{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "confession",
            "id": 718
         },
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "surfer",
            "id": 1524
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "malibu",
            "id": 8613
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "diner",
            "id": 10738
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "summer",
            "id": 13088
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "drag",
            "id": 171636
         }
      ],
      "imdb_id": "tt0206226",
      "video": false,
      "title": "Psycho Beach Party",
      "recommendations": [
         150889,
         17021,
         10696,
         33721,
         12724,
         131916,
         5873,
         47462,
         10615,
         17153,
         19846,
         27226,
         34845,
         366551,
         17731,
         27296,
         27465,
         44562,
         169644,
         25533
      ],
      "backdrop_path": "/glxsr7BsqtKqPEUv1M0ePhaKiqO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Florence 'Chicklet' Forrest",
               "gender": 1,
               "credit_id": "52fe4562c3a368484e0571f1",
               "name": "Lauren Ambrose",
               "profile_path": "/zEdW3X6MHTDVG4jizKfVebVTmCH.jpg",
               "id": 54470,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Starcat",
               "gender": 2,
               "credit_id": "52fe4562c3a368484e0571f5",
               "name": "Nicholas Brendon",
               "profile_path": "/hYkgGWmRgCQ4isVLFxugJbjybgP.jpg",
               "id": 71675,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marvel Ann",
               "gender": 1,
               "credit_id": "52fe4562c3a368484e0571f9",
               "name": "Amy Adams",
               "profile_path": "/tk5eWJcOBr9uRefeUm9ntvehbLA.jpg",
               "id": 9273,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Captain Monica Stark",
               "gender": 2,
               "credit_id": "52fe4562c3a368484e0571fd",
               "name": "Charles Busch",
               "profile_path": "/8d81ujSbFidmQwItm1qxqdaej8S.jpg",
               "id": 103374,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kanaka",
               "gender": 2,
               "credit_id": "52fe4562c3a368484e057201",
               "name": "Thomas Gibson",
               "profile_path": "/xX2uBrFKE5Us7TKvIwWERGw5LRn.jpg",
               "id": 13638,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lars / Larry",
               "gender": 0,
               "credit_id": "52fe4562c3a368484e057205",
               "name": "Matt Keeslar",
               "profile_path": "/grucMGE9xHQ4uoE0QSD0dZVQTKe.jpg",
               "id": 35598,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mrs. Ruth Forrest",
               "gender": 1,
               "credit_id": "52fe4562c3a368484e05720f",
               "name": "Beth Broderick",
               "profile_path": "/93bOlZw9mhqJ6svBRsmQt9JhuxJ.jpg",
               "id": 45391,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Rhonda",
               "gender": 1,
               "credit_id": "52fe4562c3a368484e057213",
               "name": "Kathleen Robertson",
               "profile_path": "/dDokQ6zSfzkaZRvDfvEHglWMb90.jpg",
               "id": 33676,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Counterman",
               "gender": 2,
               "credit_id": "5957cfbec3a368253c00c460",
               "name": "Nicholas D'Agosto",
               "profile_path": "/hzGlng2AVXSxS8N8NeHsHyUjhnM.jpg",
               "id": 37059,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Provoloney",
               "gender": 0,
               "credit_id": "5957cff6c3a368293b00e1f3",
               "name": "Andrew Levitas",
               "profile_path": "/15YMsSqttwT75cKQ9eiDPqfxjmh.jpg",
               "id": 166995,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Yo Yo",
               "gender": 2,
               "credit_id": "5957d00ec3a368275000bec9",
               "name": "Nick Cornish",
               "profile_path": "/gxREPiEyAwfXRDTtIctkC79ZyYc.jpg",
               "id": 149551,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4562c3a368484e0571ed",
               "name": "Robert Lee King",
               "profile_path": null,
               "id": 133183,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4562c3a368484e05720b",
               "name": "Charles Busch",
               "profile_path": "/8d81ujSbFidmQwItm1qxqdaej8S.jpg",
               "id": 103374,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 4.15512,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 27723,
      "vote_count": 35,
      "budget": 1500000,
      "overview": "Spoof of 1960's Beach Party/Gidget surfing movies mixed with slasher horror films. A not-so-innocent girl in 1960's Malibu becomes the first girl surfer at Malibu Beach, only she suffers from dissociative identity disorder and occasionally her alter ego, a sexually aggressive, foul-speaking girl, comes out. During her \"episodes\" several beach goers are found murdered.",
      "similar": [
         3597,
         357096,
         101,
         949,
         948,
         764,
         4638,
         193893,
         238636,
         9392,
         109414,
         49524,
         290250,
         433808,
         298312,
         40969,
         10014,
         9451,
         3600,
         11564
      ],
      "original_title": "Psycho Beach Party",
      "runtime": 95,
      "poster_path": "/25a4lSkU43K2npb4g1XOJqmgtNb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "New Oz Productions",
            "id": 7055,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Red Horse Films",
            "id": 7056,
            "origin_country": ""
         }
      ],
      "release_date": "2000-08-06",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Party till you drop. Dead.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Lee King"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Charles Busch",
         "Charles Busch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0206226/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MjI1NDE0OF5BMl5BanBnXkFtZTcwODg4NDUxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Lauren Ambrose, Nicholas Brendon, Thomas Gibson | See full cast and crew »"],
      "reviews": [
         "Yes, a few of these viewers dont even seem to know the work of Charles Busch - the creator/writer and performer of Psycho Beach Party. Busch has a huge following in theatre (Psycho beach Party started a s a play)and all of his work is tongue-in-cheek and some of the complaints on these posts sound like people who wouldn't \"get\" Rocky Horror Picture Show or Plan 9 From Outer Space either. But that's okay - Busch's work is not for everyone - just like John Waters/Divine's work isnt for everyone. And this film adapatation certainly has it's weaknesses - but much of it is DEAD on - including the opening and closing credits with a young Ann-Margaret look-a-like doing her best go-go boot dancing. Busch is hysterical as the hard-as-nails \"female\" police chief and Lauen Ambrose has a field day playing the perky like Gidget with multiple personalities. The film is fun and if you like it, check on Busch in Die, Mommie, Die.",
         "Wow - I saw this movie on late-night TV (the only place where you would expect it to shown), and man was it funny! I love spoof movies, and this on did quite nicely. Just the technical aspects of having a modern movie set in the early 60's would be challenging, so hats off to the director. I loved the super cheesy dialogue (Golly gee!), and the characters were both inspired and stereotypical, at east for a 'beach blanket' flick. \"I'll be your girl Friday!\" says the plucky sidekick. The innuendo and double-entendre's are great, like when the girls are at a scary drive-in movie. \"Boys, they only have one thing on their mind.....well, I'm going <to the snack bar> to get a weiner.\" It was strange seeing Greg from Dharma and Greg here, but what the hell. Backward projection rocks!",
         "This film really grew on me. It's got great actors (namely Nicholas Brendan and Lauren Ambrose), a great throwback sense of style, and very clever dialogue. I can't tell if this film is intentionally hysterical (I think it is, but some parts...it's hard to tell.) I also really liked some of the characters, including police\"woman\" Monica Stark. All in all, a light-hearted summer movie, perfect for a few good laughs.",
         "I have to say the first time I watched this movie I couldn't even sit through the whole show. Fortunately for me that particular summer HBO played it in excess. Eventually I found myself looking to see when it was on again and watching it every time. This movie is a definite \"send-up\" to all those campy movies we either loved or hated, and this movie is definitely in the \"love-it or hate it\" category. Give yourself enough heads up to be up for anything and you too will add this to your \"must see's\" of cult classics. Most of the actors are unknown, some you may recognize from various TV shows. the story line is quirky at times but the cast works well together to pull this off.",
         "Before there was SCARY MOVIE, there was PSYCHO BEACH PARTY! That says it all, man! Charles Busch gives us Charles Busch in a chilling, wicked satire of teen slasher flicks, drive-in movies, and hormones as they were in the 1960s. There has been nothing like this movie since PIZZA WAITRESS WITH THREE HEADS. Golly! Puns and double meanings fly like sand on a windy day. Plus there is hidden wisdom such as, \"Chastity lost is never found.\" And gay love as a cure for digestive problems? Who knew? Gidget meets Mae West, and Matt Kessler with a Swedish accent. I could go on, but I won't. This is a Shakespearian play within a movie within a movie. Go figure. See it and have fun.",
         "First things first: 'Psycho Beach Party' is funny, fresh, light-hearted and completely likable. It is a rare film that can walk the tight-rope between mocking a particular film genre (in this case, the \"Beach Blanket\" movies of the fifties and sixties) while still showing great affection for said genre. 'Psycho Beach Party' does it wonderfully. Using an obviously skewed view of these pleasant if vapid films, 'PBP' covers us in satirical humor and warmth, a tricky combination to pull off. If you have ever sat through a film in which a surf board was the star, check this one out...great fun. Now, second: In response to Brian Bagnall's review from Canada, this film is NOT gay propoganda (just because the writer/director is gay does not make this a gay film). Gays do NOT have to have blonde hair (one of the only two agy characters has black hair...must have missed that one, huh, Brian?). The film does NOT portray the era as demeaning to women (the women in this film are some of the most empowered I have seen in a long time). And if you can not suspend your disbelief for long enough to watch our young heroine escape from a man twice her size, you probably should not be watching a film with the word \"psycho\", \"beach\", and \"party\" in the title. This film looks foundly back on a time that was simpler, both in the movies and reality. Anyone who gets anything other than a Genre Spoof from this was not paying attention. Put simply, people; 'Psycho Beach Party' is Fabu!",
         "I don't know why I had heard of this film, but I had. I don't know why I wanted to rent it, but I did. I don't know why I laughed all the way through it, but I did.... Yeah, I do know why I laughed. It was funny. It wasn't as purile as most modern \"teen\" comedies are, but it sure did have fun poking fun at the 60's beach movies like \"Beach Blanket Bingo\". Charles Busch, who plays the part of the female detective, is absolutely a laugh riot: I truly believe he was channeling Kathleen Turner. The two hunky doofus boys who are more in love with each other than any of the babes...Nicholas Brendan, in a reverse take on his role on \"Buffy\", plays the major stud puppy here...Thomas Gibson in a reverse take on his televsion role as \"Greg\", plays a beatnik surfer dude. Beth Broderick, with her unbelievably sexy raspy voice, plays this films version of June Cleever with a twist. The lines are outrageous. The costumes dead on. The portrayals ridiculous and accurate at the same time. The is high camp! Don't expect serious - don't expect typical humor. But if you're over thirty, and remember those old beach movies, then you'll get a real blast out of this film.",
         "Absurdity never seemed so straight and the straight and narrow never took so many turns. Psycho Beach Party is the most outrageous fun since Rocky Horror Picture Show hit the screen. Of all the films that poke fun at male-female, male-male, and female-female sexuality this summer, Psycho Beach Party takes the cake. The comparison is apt. Both films were adapted from successful small theatrical hits. Both films take innocence and sexuality to their extremes. What Rocky Horror did for monster movies, musicals and science fiction, Psycho Beach Party does to psychological thrillers, surfer/Gidget movies and slasher films. Charles Busch, the writer of the film and the play, has been New York's dirty little secret for over a decade. When Busch's \"Vampire Lesbians of Sodom\" was a hit downtown, I remember seeing people read the marquee, laugh, wince, then laugh again self consciously. Charles Busch brings this same combination of joy and guilt together wonderfully in Psycho Beach Party. He acts in it as well, he's the female detective that looks so damned good in that blue uniform. Its a shame theater doesn't inspire film as often as it once did. Theatrical dialogue, laced as it is the references and innuendo, requires a bit more suspension of disbelief from the audience. I'm not sure the \"American Pie\" generation is sophisticated enough to sit through something both silly and clever. Everyone shines in this cast, but no one outshines Chiclet. Let's leave it at that, in the wake of the \"What Lies Beneath\" fiasco, I'll leave the plot for people to discover. Unlike everyone at Universal Studios, I don't think people really want to know what happens before they go to the movies. Director Robert Lee King mocks the cinematic conceit of putting a film within a film not once but four times in less than a minute of screen time. It's a left, a right, a right, and a left knockout punch. And when you finish laughing about it -- King's little stunt will come back to haunt you later that night. Like Rocky Horror Picture Show, Psycho Beach Party is not the campy little trifle you thought you were being served...........",
         "A silly, sick, hilarious movie! We had so much fun--saw it on a rainy night in NYC; the theater was packed and a rollicking good campy time was had by all! You'll remember many gems of dialogue--especially a line from Nicholas Brendon that rivals fellow \"Buffy\" cast member Allyson Hannigan's shocker in \"American Pie\"! Anyone with the slightest affection for those AIP beach movies will love this one. Terrific soundtrack too--why no album???",
         "A great movie with a lot of great performances by the cast. Especially Lauren Ambrose (Florence/Chicklet), who after seeing this movie, definitely deserves a lot more recognition. Recognition, I hope, that comes soon. Same goes to the whole cast also, who really made this low budget beach movie into my eyes, a hit. So please, if you have time, and live in New York, stop by to watch this great movie. You won't be disappointed."
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "New Oz Productions",
         "Red Horse Films",
         "Strand Releasing"
      ],
      "summaries": ["Spoof of 1960's Beach Party/Gidget surfing movies mixed with slasher horror films stars Lauren Ambrose as Florence Forrest, a not-so-innocent girl in 1960's Malibu who becomes \"Chicklet\" the first girl surfer at Malibu Beach, only Florence suffers from dissociative identity disorder and occasionally her alter ego Ann Bowman, a sexually aggressive, foul-speaking girl, comes out in which during that time several beach goers are found murdered. The suspects include Chicklet herself, surfer Kanaka, B-horror film actress Bettina Barnes, exchange student Lars, and even Chicklet's own mother."],
      "budget": 1500000
   },
   "movielensId": 3830,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-06",
      "dvdReleaseDate": "2001-04-24",
      "directors": ["Robert Lee King"],
      "runtime": 95,
      "movieId": 3830,
      "title": "Psycho Beach Party",
      "mpaa": "NR",
      "actors": [
         "Lauren Ambrose",
         "Nicholas Brendon",
         "Amy Adams",
         "Charles Busch",
         "Thomas Gibson",
         "Matt Keeslar",
         "Beth Broderick",
         "Kathleen Robertson",
         "Nicholas D'Agosto",
         "Andrew Levitas",
         "Nick Cornish"
      ],
      "imdbMovieId": "0206226",
      "originalTitle": "Psycho Beach Party",
      "genres": [
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": ["UA_G2Ts8xmo"],
      "plotSummary": "Spoof of 1960's Beach Party/Gidget surfing movies mixed with slasher horror films. A not-so-innocent girl in 1960's Malibu becomes the first girl surfer at Malibu Beach, only she suffers from dissociative identity disorder and occasionally her alter ego, a sexually aggressive, foul-speaking girl, comes out. During her \"episodes\" several beach goers are found murdered.",
      "tmdbMovieId": 27723,
      "avgRating": 2.81564,
      "releaseYear": "2000",
      "numRatings": 358,
      "posterPath": "/25a4lSkU43K2npb4g1XOJqmgtNb.jpg"
   }
}