{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "anthology",
         "id": 9706
      }],
      "imdb_id": "tt0057603",
      "video": false,
      "title": "Black Sabbath",
      "recommendations": [
         28049,
         27632,
         28055,
         5486,
         28041,
         27703,
         25508,
         5482,
         49361,
         27636,
         5485,
         5483,
         11772,
         6591,
         28050,
         20345,
         17921,
         16372,
         22307,
         25319
      ],
      "backdrop_path": "/ifq2Ea9bfN84LEEX41Pck6rtFLV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Himself / Gorca",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c385",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Rosy",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c389",
               "name": "Michèle Mercier",
               "profile_path": "/6fRJSsHqaw1FKugKmTjcI2WqneD.jpg",
               "id": 19270,
               "order": 1
            },
            {
               "cast_id": 27,
               "character": "Helen Chester",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c3b5",
               "name": "Jacqueline Pierreux",
               "profile_path": "/8Ves8RgONKCfUnwJ2dlKQZS4yFh.jpg",
               "id": 24787,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Sdenka",
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c38d",
               "name": "Susy Andersen",
               "profile_path": "/1NZc4xKLp9jfZmvBYAvdoQ57D3J.jpg",
               "id": 99455,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Mary",
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c391",
               "name": "Lidia Alfonsi",
               "profile_path": "/jq8HbxGYhxd4Kfq27ngsKMnjjEq.jpg",
               "id": 9240,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Pietro",
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c395",
               "name": "Massimo Righi",
               "profile_path": "/vAwcCgMfHEOsQ2fr1wJFIJ188g4.jpg",
               "id": 98494,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c399",
               "name": "Rika Dialina",
               "profile_path": "/c8tf7er3Ulxo9vmwHcduVgxZjdb.jpg",
               "id": 99456,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Giorgio",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c39d",
               "name": "Glauco Onorato",
               "profile_path": "/tXoZf4YHyPJ4j1NEI8BiIlsOLRu.jpg",
               "id": 72660,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "The Maid",
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c3a1",
               "name": "Milly",
               "profile_path": null,
               "id": 99457,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Neighbor",
               "gender": 1,
               "credit_id": "52fe4574c3a368484e05c3a5",
               "name": "Harriet Medin",
               "profile_path": null,
               "id": 54941,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Police Inspector",
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c3a9",
               "name": "Gustavo De Nardo",
               "profile_path": "/2TUeATCid0ET1TaXPi9e5dai5QD.jpg",
               "id": 98509,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Frank Rainer",
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c3ad",
               "name": "Milo Quesada",
               "profile_path": null,
               "id": 99445,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Vladimire d'Urfe",
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c3b1",
               "name": "Mark Damon",
               "profile_path": "/uIPFihuOZBXbFf4Bp2sYAlaq4wE.jpg",
               "id": 6890,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c33f",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c345",
               "name": "Aleksei Tolstoy",
               "profile_path": "/fx1XT6uoTLhuzJAp5NmkVuN8LPn.jpg",
               "id": 29188,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c34b",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4574c3a368484e05c351",
               "name": "Alberto Bevilacqua",
               "profile_path": "/mjsIhFu70VZQGTjV5Mhi24XIpb.jpg",
               "id": 32308,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c357",
               "name": "Marcello Fondato",
               "profile_path": null,
               "id": 51421,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c35d",
               "name": "Salvatore Billitteri",
               "profile_path": null,
               "id": 99450,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c363",
               "name": "Paolo Mercuri",
               "profile_path": null,
               "id": 99451,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c369",
               "name": "Ubaldo Terzano",
               "profile_path": null,
               "id": 98483,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c375",
               "name": "Les Baxter",
               "profile_path": "/Al8Y7Wqykey2ne2QcbLCUC2wjcZ.jpg",
               "id": 99452,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c37b",
               "name": "Roberto Nicolosi",
               "profile_path": null,
               "id": 50788,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4574c3a368484e05c381",
               "name": "Mario Serandrei",
               "profile_path": null,
               "id": 15132,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53d5b771c3a3686b8800499f",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 8.979464,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 28043,
      "vote_count": 96,
      "budget": 0,
      "overview": "Black Sabbath is a 1963 Italian horror film directed by Mario Bava. Boris Karloff, in addition to appearing in the linking passages, has a role in \"The Wurdalak\" segment (based on a story by Aleksey Konstantinovich Tolstoy). The film comprises three horror stories, the others being \"The Drop of Water\" and \"The Telephone.\"",
      "similar": [
         16288,
         297160,
         193726,
         84348,
         29074,
         20701,
         5,
         354251,
         33908,
         14128,
         31578,
         29514,
         199420,
         87436,
         46581,
         16281,
         436549,
         307047,
         351064,
         11624
      ],
      "original_title": "I tre volti della paura",
      "runtime": 92,
      "poster_path": "/ftqFFa48PSqupA0JKRAzf5WaR9H.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Emmepi Cinematografica",
            "id": 12711,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Galatea Film",
            "id": 12240,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alta Vista Film Production",
            "id": 13862,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Societé Cinématographique Lyre",
            "id": 8948,
            "origin_country": ""
         }
      ],
      "release_date": "1963-08-17",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "This is the night of the nightmare",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mario Bava"],
      "runtime": 92,
      "synopsis": "Note: this synopsis is for the orginal Italian release with the segments in this certain order. Boris Karloff introduces three horror tales of the macabre and the supernatural known as the 'Three Faces of Fear'. THE TELEPHONE Rosy (Michele Mercier) is an attractive, high-priced Parisian call-girl who returns to her spacious, basement apartment after an evening out when she immediately gets beset by a series of strange phone calls. The caller soon identified himself as Frank, her ex-pimp who has recently escaped from prison. Rosy is terrified for it was her testimony that landed the man in jail. Looking for solace, Rosy phones her lesbian lover Mary (Lynda Alfonsi). The two women have been estranged for some time, but Rosy is certain that she is the only one who can help her. Mary agrees to come over that night. Seconds later, Frank calls again, promising that no matter who she calls for protection, he will have his revenge. Unknown to Rosy, Mary is the caller impersonating Frank. Marry arrives at Rosy's apartment soon after, and does her best to calm Rosy's nerves. She gives the panic-struck woman a tranquillizer and puts her to bed. Later that night as Rosy sleeps, Mary gets up out of bed, and pens a note of confession: she was the one making the strange phone calls when she learned of Franks escape from prison. Knowing that Rosy would call on her for help, she explains that she felt it was her way of coming back into her life after their breakup. While she is busy writing, she fails to notice an intruder in the apartment. This time it is Frank, for real. He creeps up behind Mary and strangles her to death with one of Rosys nylon stockings. The sound of the struggle awaken Rosy and she gasps in fright. The murderous pimp realizes that he just killed the wrong woman, and slowly makes his way to Rosy's bed. However, earlier that night, Rosy had placed a butcher knife under her pillow at Mary's suggestion. Rosy seizes the knife and stabs Frank with it as he's beginning to strangle her. Rosy drops the knife and breaks down in hysteria, surrounded by the two corpses of her former lovers. THE WURDALAK In 19th Century Russia, Vladimir D'Urfe is a young nobleman on a long trip. During the course of his journey, he finds a beheaded corpse with a knife plunged into its heart. He withdraws the blade and takes it as a souvenir. Later that night, Vladimir stops at a small rural cottage to ask for shelter. He notices several daggers hanging up on one of the walls, and a vacant space that happens to fit the one he has discovered. Vladimir is surprised by the entrance of Giorgio (Glauco Onorato), who explains that the knife belongs to his father, who has not been seen for five days. Giorgio offers a room to the young count, and subsequently introduces him to the rest of the family: his wife (Rika Dialina), their young son Ivan, Giorgio's younger brother Pietro (Massimo Righi), and sister Sdenka (Susy Anderson). It subsequently transpires that they are eagerly anticipating the arrival of their father, Gorcha, as well as the reason for his absence: he has gone to do battle with the outlaw and dreaded wurdalak Ali Beg. Vladimir is confused by the term, and Sdenka explains that a wurdalak is a walking cadaver who feeds on the blood of the living, preferably close friends and family members. Giorgio and Pietro are certain that the corpse Vladimir had discovered is that of Ali Beg, but also realize that there is a strong possibility that their father has been infected by the blood curse too. They warn the count to leave, but he decides to stay and await the old mans return. At the stroke of midnight, Gorcha (Boris Karloff) returns to the cottage. His sour demeanor and unkempt appearance bode the worse, and the two brothers are torn: they realize that it is their duty to kill Gorcha before he feeds on the family, but their love for him makes it difficult to reach a decision. Later that night, both Ivan and Pietro are attacked by Gorcha who drains them of blood, and then flees the cottage. Giorgio stakes and beheads Pietro to prevent him from reviving as a wurdalak. But he is prevented from doing so to Ivan when his wife threatens to commit suicide. Reluntantly, he agrees to bury the child without taking the necessary precautions. That same night, the child rises from his grave and begs to be invited into the cottage. The mother runs to her son's aid, stabbing Giorgio when he attempts to stop her, only to be greeted at the front door by Gorcha. The old man bits and infects his daughter-in-law, who then does the same for her husband. Vladimir and Sdenka flee from the cottage and go on the run and hide out in the ruins of an abandoned cathedral as dawn breaks. Vladimir is optimistic that a long and happy life lies with them. But Sdenka is reluctant to relinquish her family ties. She believes that she is meant to stay with the family. Sdenka's fears about her family are confirmed when that evening, Gorcha and her siblings show up at the abandoned Abby. As Vladimir sleeps, Sdenka is lured into their loving arms where they bite to death. Awakened by her screams, Vladimir rushes to her aid, but the family has already taken her home, forcing the lover to follow suite. The young nobleman finds her, lying motionless on her bed. Sdenka awakens, and a distinct change is visible on her face. No longer caring, Vladimir embraces her, and she bites and infects him too. THE DROP OF WATER In Victorian London, England, Nurse Helen Chester (Jacqueline Pierreux) is called to a large house to prepare the corpse of an elderly medium for her burial. As she dressed the body, she notices an elaborate diamond ring on its finger. Tempted by greed, Nurse Chester steals it. As she does, a glass tips over, and drops of water begin to splash on the floor. She is also assailed by a fly, no doubt attracted by the odor of the body. Unsettled but pleased by her acquisition, she finishes the job and returns home to her small East End flat. After returning home, Nurse Chester is assailed by strange events. The buzzing fly returns and continues to pester her. Then the lights in her apartment go out, and the sounds of the dripping water continues with maddening regularity. She sees the old womans corpse lying on her bed, and coming towards her. The terrified woman begs for forgiveness, but she ultimately strangles herself, imaging that the medium's hands are gripping her throat. The next morning, the concierge (Harriet White Medin) discovers Nurse Chester's body and calls the police. The investigator on the scene (Gustavo de Nardo) quickly concludes that its a simple case and that Nurse Chester \"died of fright\". The pathologist arrives on the scene to examine the body before it's taken away and he notes that the only sign of violence is a small bruise on her left finger, mostly likely caused when someone pried a ring from her finger. As the doctor makes this observation, the concierge appears distressed, as she has apparently took the ring from the dead Nurse Chester, and is further distracted by the sound of a fly swooping about in the air.... Boris Karloff makes a final appearance as Gorcha riding on his horse as he concludes the three tales of fear and tells the viewers to be careful while walking home at night for ghosts and vampires have no fear. The image pulls back to actually reveal him sitting on a prop fake horse with a camera crew and various crewmen moving branches around to simulate the scene of riding through the forest from the Wurdalak segment.",
      "writers": [
         "Mario Bava",
         "Alberto Bevilacqua"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0057603/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwNDc4NDQxOV5BMl5BanBnXkFtZTgwNzc1MDkwMzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Michèle Mercier, Lidia Alfonsi, Boris Karloff | See full cast and crew »"],
      "reviews": [
         "I Tre Volti Della Paura/Black Sabbath(1963) starts out with a colorful introduction by Boris Karloff that gives homage to Sydney Greenstreet's introduction for the trailers of The Maltese Falcon(1941), and Across the Pacific(1942). One of the best horror film anthologies of the 20th Century. An example of Mario Bava's love for the art of painting and the realm of fantasy. Quentin Tarantino was influenced by Black Sabbath(1963) for his structure of Pulp Fiction(1994). Black Sabbath(1963) is at its most artful and scary in its original Italian edition. THE TELEPHONE is the third best tale but the most historical in the evoluation of the Italian thriller. Although not the first Giallo to be made in Italy, its certainly the first Giallo to be done in color. Also, the first Giallo to have the eroticism and violent outbursts of the Italian novel known as the gialli. Takes place in one area with the exception of a couple of scenes. This gives the story a touch of the theatre. Michele Mercier as Rosy is absolutely stunning. The lesbian subtext of THE TELEPHONE was a darling concept that was too erotic for American audiences to watch as thought out by AIP before the film's USA release. This taboo subtext was cut and the story was turned into a ghost yarn in the American version. Gives hints of why Rosy and her friend Mary stopped seeing each other. THE TELEPHONE uses the colors of blue and red to express the sexual and violent tension of the story. The final shot of the telephone with the receiver out and a body on the floor below would be used again in the final shot of Blood & Black Lace(1965). THE TELEPHONE contains features that would appear at the beginning of Scream(1996). In fact, the opening scene of Scream(1996) is almost a shot by shot remake of THE TELEPHONE. Influenced Mario Bava's Blood & Black Lace(1965) and the gory body countish Bay of Blood(1971). A murder by strangulation with telephone cord would appear later in A Bay of Blood with the murder of the entomologist. THE WURDALAK is a tragic tale of family decline. Its also the most romantic of the three tales. The romantic subplot involving Count D'Uree and Sdenka is reminiscent of The Mask of Satan(1960). About a Russian version of the vampire known as the Wurdalak who drains the blood of loved ones so they too can be Wurdalak. The most personal story of Mario Bava in this anthology. Boris Kalfoff gives his best performance in a horror film since playing the creature in Frankenstein(1931) and Bride of Frankenstein(1933). THE WURDALAK is very similar to Edgar Allen Poe's The Fall of the House of Usher. Based on a novel that was later filmed as a full length movie. The scene of the ghost child turning into Gorca to hunt Gregor's wife would influence Kill Baby Kill(1967) and Shock(1977). Mario Bava directs THE WURDALAK with an atmospheric touch. Despite the film's low budget, THE WURDALAK has excellent costume and set designs. Mark Damon and Susy Andersen are good in their roles as doomed lovers. This segment of Black Sabbath(1963) would be of significance to later Bava films I.E, The Whip & the Body(1964), Kill Baby Kill(1967), Lisa & the Devil(1974), and Shock(1977). The line \"My Destiny is here\" personifies Bava's life as a homebody and is similar to a couple of lines from The Mask of Satan(1960) and Lisa & the Devil(1974). A good short story that is not boring. A DROP OF WATER is the most frightening and scary story of Black Sabbath(1963). Its one of the best and perhaps the greatest horror story Mario Bava has ever filmed. In this story, Bava was interested in the idea of a person alone in a dark room. The story is about a nurse who thinks a dead medium patient is after her for stealing a ring. A DROP OF WATER is brilliant in exploring the theme of fear. A DROP OF WATER contains spine tingling sequences of horror and atmospheric lighting. Jacqueline Pierreux is fabulous as the fearful and guilt conscious nurse, Helen Corey. She plays Helen Corey with believability. The story is ambiguous on whether the ghost is real or is just in Helen Corey's mind. A DROP OF WATER is a true horror tale that plays on the imagination of the audience brilliantly unlike the overrated, Blair Witch Project(1999). The end suggests that the same events will occur all over again. Filmed by Mario Bava with an expertise in horror and terror. A DROP OF WATER was influenced by Bava's love of Russian literature especially the works of Nikolai Gogol, Fyodor Dostoevsky and also the short stories of Edgar Allen Poe. In the same manner and vein as The Tell Tale Heart. The theme of guilt in A DROP OF WATER shows up in The Whip & the Body(1964) plus Shock(1977).",
         "Originally titled I TRE VOLTI DELLA PAURA (THREE FACES OF FEAR), this horror anthology made it to the U.S. with a new title to remind viewers of how good Bava's BLACK Sunday (1960) was. It also gained an excellent Les Baxter soundtrack and Boris Karloff as a host, though the tales were reversed in order and the strong lesbian subtext of one segment and some violence were omitted, but that's good ole' American censorship for you (both have since been restored, anyway). In any case, this anthology is a classic of its kind. \"Drop of Water\" (based on a story by Checkov) is a chilling tale of a nurse (Jacqueline Pierreux) who gets her just desserts after stealing a diamond ring from the hideous-looking corpse of a psychic. \"The Telephone\" (based on a story by F.G.Snyder) was the least satisfying of the bunch for me personally, yet is still above average. In it, a lascivious, unstable and bisexual young beauty (Michele Mercier) receives threatening phone calls that seem to be coming from a man who has a personal vendetta against her. Final tale is \"The Wurdalak,\" which was based on a Tolstoy. Boris Karloff stars as Gorca, a man turned into a vampire by the curse of Wurdalak, which makes him attack and kill only those he loves (namely his extended family, including child). It's astonishing to look at and very suspenseful. All three are colorfully, creatively done, drenched in Bava's trademark rich atmosphere and bring something a little different to the table. \"Drop\" (last in the Italian version) has the most chilling central image, \"Wurdulak\" (middle in the Italian version) has the boldest color palette and most vivid art direction and \"Telephone\" (first in the Italian version) is a very early giallo. Horror regulars Mark Damon (from Corman's HOUSE OF USHER), Massimo Righi and Harriet White Medin (usually typecast as a stern housekeeper in Italian horror films) co-star in this one. Score: 8 out of 10 (only because I'm reserving a point until I get to watch the original Italian version).",
         "This is an anthology film with three stories, totally unrelated introduced by a rather aged, dignified Boris Karloff. Karloff introduces each with great savvy and a generous dose of wit and humour. All three stories were directed by Italian horror specialist Mario Bava, whose use of the camera was legendary and unique. The first story was based on a story by Chekov called \"The Drop of Water\" and it is the best of the three. This little story about a nurse that steals a ring off the body of a witch, having been warned not to, is one of the scariest scenes ever to be filmed. The second story about a killer and a phone is adequate. The third story, starring Karloff as a Wurdelak...or vampire..is very good. It has plenty of atmosphere, and is the only film in which Boris ever played a vampire. All in all, Black Sabbath is a good film. It shows the talent that Bava had for taking fairly ordinary situations in life into horriffic ones.",
         "Welcome to yet another pure vintage Bava classic. I went straight for the undubbed version in which the tales are presented in their original order, and I strongly recommend for you to do the same as it is a pure horror masterpiece! The ultimate horror icon Boris Karloff hosts three various and delightful tales of the supernatural. The first story (The Telephone) is rather simplistic but it sets a promising tone for the rest of the movie. In this, the stunningly beautiful Rosy (Michele Mercier who reminds you of Barbara Steele) receives threatening phone calls, seemly from her ex-lover who recently escaped prison. The tale features a sublime lesbian undertone and quite a few shocking moments. The second tale is somewhat the main event of the film and also stars Karloff in a terrifically diabolical role. We're introduced to \"Wurdulaks\", which are vampire-variants that are exclusively after the blood of their beloved. Karloff shines as the elderly ghoul who returned from a mountain expedition to kill a Turkish psycho, but behaves strangely ever since. This tale has a remarkably high tension level and fully depends on its marvelous set pieces and eerie locations. A must see tale for admirers of Gothic horror and the chapter that comes the closest in style to Mario Bava's ultimate achievement \"Black Sunday\". The final tale may even be the best as it is one of the most frightening things I ever beheld. \"The Drop of Water\" has Jacqueline Pierreux haunted by the corpse of an old lady who died during a séance. The image of this dead lady is creepy beyond comparison and the climax is sublime. All three tales are amazingly pictured and terrifically scripted. Mario Bava once again states he's the most talented horror director ever. This versatile production probably also is the ideal film to begin checking out his work. Black Sabbath is the perfect example of how omnibuses should be done. This format got immensely popular in the 70's and especially the British Amicus company cornered the market. Some of their films were very good (Tales from the Crypt, Asylum) but yet they should have paid more heed to milestone movies like \"Black Sabbath\".",
         "1945's Dead of Night introduced horror cinema to omnibus films, and Mario Bava's Black Sabbath brought it back! Italian produced films were making a lot of money in the early sixties, and hot on the heels of his success with Black Sunday, former cinematographer and horror genius Mario Bava was brought in to direct this compendium of horror tales. The great Boris Karloff adds a further lure to the proceedings, and these two giants were on to a winner before they started filming. This film is like an overview of what Mario Bava is all about. The first tale, a Giallo-like thriller, echoes films such as The Girl Who Knew Too Much and Blood and Black Lace, while tale number two; The Wardulak, is pure Gothic horror, a la Black Sunday. The climax story, The Drop of Water, is the most horror orientated of the trio and gives a good early showing of the adrenaline that would go on to make the likes of Baron Blood and Bay of Blood the great films that they are. Mario Bava has a lot of fans and many of his films could easily be considered his best, but there is no doubt for me. The best film Bava ever made is Black Sabbath. After a colourful and campy introduction by the great Boris Karloff, we move straight into The Telephone. This tale is simple, yet effective and instantly grabs you \u0096 not letting go until the end. The lesbian undertones give it an extra bit of verve (especially with the actresses being as tasty as they are!), and the way that Bava claustrophobically shoots almost the entire story in one apartment means that the tale is always easy to get to grips with. Bava's music is the main event style-wise. Music is a big part of Giallo, and this entry in Black Sabbath, along with The Girl Who Knew Too Much, ensures that we all know it was Bava who created the Giallo. The ironic ending seals the story and makes sure that you'll be in high spirits going into tale number two. The Wardulak is the longest, most ambitious and also the weakest part of the trilogy. That's not to say that it's anything less than brilliant; the other two are just stronger. The Gothic sets and atmosphere are definitely the main draw here, and the way that Bava lights up every scene with his trademark use of lighting and colours is absolutely stunning. Being the most expansive, this is the story that best allows Bava full use of his directing ability and many of the shots could be easily be framed and hung on your wall. The tale is very reminiscent of the masterpiece Black Sunday, and gives a good impression of what the film might have looked like had it have been in colour. Boris Karloff takes the lead role here as a man trying to destroy a line of vampires like creatures known as Wardulak's. Karloff obviously enjoyed making this film, and his assured and camp performance in this part of the film, along with his intro and outro, really shows that. The conclusion to this story is really well done, and makes sure that this part of the film ends on a high. My favourite tale is the first one, but The Drop of Water definitely isn't far behind! This tale is pure evil, and allows Bava to show his mastery of the horror genre the best. We follow a young female nurse who steals a ring from one of her patients...a medium...who died during a séance. Like the first tale, this one's effectiveness stems from it's simplicity and this allows Bava to implement his excellent use of lighting and colours. The sets are brilliantly lit, and the director manages to create a foreboding feel that runs throughout the film. The design of the elderly medium's face is really haunting, and seeing the corpse get it's revenge gives Black Sabbath it's main scare. Watching this tale, it's obvious why Bava is so well respected by cult and genre fans. There aren't many directors that can generate this kind of scare from such a simple plot - and all of The Drop of Water's frights are owed entirely to the director. On the whole, this is a superior omnibus horror film. All the elements are in place and if you want a great overview of Mario Bava's talents - this is the place to look!",
         "I don't know if Sam Arkoff knows it, but the moment AIP renamed \"I Tre Volti Della Paura\" into \"Black Sabbath\" for the American release they were writing 20th century history. A couple of years later a relatively unknown band from Birmingham, inspired by Mario Bava's Gothic horror anthology, would name their band Black Sabbath and proceed to become one of the most well known and influential bands of the last 30 years. Black Sabbath starts off wisely with the weakest story in the movie, \"The Telephone\". There's nothing incredibly exciting going on, and the interior setting doesn't allow Bava to fully exercise his usual flair in visuals and atmosphere, rendering this segment a rather routine affair. Any historical significance the segment might have in the shaping of the giallo is made redundant by the fact that Bava himself would go on to define the genre a few years later with Blood and Black Lace. The patient viewer will be amply rewarded by the following two segments though. The Wurdulak, featuring a ghastly Boris Karloff in one of his best roles, and A Drop of Water, with Jacqueline Pierreux in the role of a greedy nurse, are both the epitome of Mario Bava's Gothic style in colour. What makes Black Sabbath so vibrant and captivating is the use of colour in lighting. Going against every rule and defying every sense of historic realism, Bava employs colours from every end of the palette (from magenta to cyan) and lights his sets in the most imaginative ways. It may seem arbitrary, and it may very well be, but the effect cannot be dismissed. It works. Imagine Seijun Suzuki circa Tokyo Drifter doing Black Sunday in colour and you get pretty close to what Bava strives for lighting-wise. There's a pop art sensibility that contrasts beautifully with the stern tone of the movie. Combined with misty exteriors, long shadows and a baroque opulence, Bava mutates Gothic horror into a unique beast that is simultaneously very familiar and extravagantly exotic. What's even more admirable is that Black Sabbath is actually scary. Well not in the traditional sense anymore, no. But there are genuinely chilling moments. I can't even begin to imagine how horrifying the ending of A Drop of Water or Boris Karloff's face seen through a smudged glass in The Wurdulak would have been to unsuspecting audiences back in 1963. In conclusion; seek this movie out, but know what you're getting into. This is old school Gothic horror with a unique visual flair, a penchant for atmosphere and a great Boris Karloff. In the Gothic horror Bava scale, I would rank it somewhere between Kill! Baby! Kill... (Bava's other masterpiece) and Lisa and the Devil, if that means anything.",
         "\"Tre volti della paura \" is a movie made up of three sketches,linked by Boris Karloff's comments -he plays the lead in the second segment - and all dealing with death following a logical progression:fear of death in the first sketch,some kind of \"night of the living dead\"cum vampires in the second one and terror around a dead woman in the third.Mario Bava did not need any special effects that mar so many horror films today:his baroque settings (Michele Mercier's flat in the first sketch,the countess's Gothic mansion in the third,and the lunar landscapes in the middle one),his knowing lighting effects,his color research,his incredibly effective use of the depth of field (visually stunning in the final segment)are as impressive today as they were forty years ago and were a strong influence on other Italian directors such as Dario Argento.Worth the price of admission.",
         "Black Sabbath is an anthology from the Italian horror master, Mario Bava. Throughout the film, his trademark use of lighting and unique camera work are evident. Truly impressive. The first story, \"The Telephone\", is a basic thriller and, IMO, the weakest of the three stories. Most everything that happens is fairly predictable. But, Bava's direction makes an ordinary story very entertaining. Also, Michèle Mercier is a knockout and makes this segment worth watching. I'll give the first segment an 8/10. Most people seem to think that the second story, \"The Wurdalak\", is the best. I'm in agreement. This segment could have easily been fleshed-out into a feature length movie of its own. Boris Karloff, Mark Damon, Susy Andersen, and the rest of the cast do a wonderful job. Karloff is as creepy as ever in this tale. And Bava is at his best. Many of the scenes are bathed in a wonderful blue/green light that adds so much to the overall atmosphere. Wonderful set locations are also a highlight of this story. I'm also a sucker for the more Gothic settings in \"The Wurdalak\". I'll give the second segment a 9/10. The third segment, \"The Drop of Water\", actually had more elements to freak me out than the other two. There is just something about this segment that creeps me out every time I see it. Again, Bava's fingerprints are on every detail of this story. The flashing blue/green light becomes more and more frightening as the movie progresses. I'll give the third segment a 9/10. Bava really does a masterful job with all three segments of this anthology. For anyone not familiar with Bava, IMO, this would be a good place to start.",
         "This terrifying film plenty of vampires,weird deeds and murders is formed by three stories proceeded in some memorably horrific set-pieces: 1) The telephone by author Snyder : A prostitute(Michele Mercier) terrorized in her flat by phone calls from a broken-out inmate(Milo Quesada) receives visit her lover(Lidia Alfonsi). 2)The Wurdalak by Aleksey Tolstoi: In a night of nightmare during the early 1800s, a Russian noble(Mark Damon, usual in Spaghetti Western)and a family(exceptional Boris Karloff, a gorgeous Susy Andersen, and Massimo Roghi) stumble a vampires who must kill those love and go after their descendants; the undead vampires of hell terrorize the house in a orgy of stark horror. 3)The drop of water by Chekhov: In the early 1900s, a nurse(Jacqueline Pierreux, mother of actor Jean Pierre Leaud, 400 blows) steals a ring from a medium dead and she seeks avenge, then a ghastly specter arises, exacting cruel revenge for past robbery. Bava's second great hit(the first was Black Sunday or Mask of the demon) surprisingly realized with startling visual content and well scripted by Marcello Fondato and Albert Bevilacqua. This omnibus terror is plenty of thrills and chills in glimmer color in lurid paste with sensational results. This genuinely creepy tale is photographed by Ubaldo Terzano and Bava with magentas , shades of ochre,translucently pale turquoises and deep orange-red reflecting paleness the victims. Eerie and suspenseful musical score by Roberto Nicolisi, though in American version is composed by Lex Baxter, Corman's usual.The motion picture is stylishly and strikingly shot by Bava, filmed in parallel orbit to those Roger Corman( Edgar Allan Poe cycle) and produced by American International(James H. Nicholson, Samuel Z. Arkoff). He along with Riccardo Freda are fundamental masters of Italian horror, in fact collaborated deeply among them, as Bava terminated two films of Freda, ¨Il Vampiri and Caltiki¨and they created the Giallo sub-genre. Rating: Good, acceptable atmospheric direction from genre master Bava, this is one more compelling horror ventures in which his camera stalks in sinister style throughout a tale with extraordinaries visual skills.A must see for terror buffs.",
         "Three macabre tales.\"the telephone\".a woman is plagued by threatening calls but all is not what it seems.\"the wurdaluk\".in 18th century Russia a family wait for their father, now a vampire to come home and claim his loved ones and suck their blood.\"a drop of water\". a nurse robs a corpse of a ring and soon regrets it. This film continuously eluded me for many years and i finally managed to see it in it's original form, beautifully restoredand it's worth the wait. the first story is the weakest, although not without interest. the second is the best , very atmospheric and contains a powerful scary performance from Boris Karloff who plays the lead vampire for the only time in his career and this role is one of his best.The last story is short but creepy and features the most scary corpse you'll ever see in a film.This is easily director Mario Bava's best film.only a silly last scene with Karloff dents it a little."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Emmepi Cinematografica",
         "Galatea Film",
         "Alta Vista Film Production"
      ],
      "summaries": [
         "A trio of atmospheric horror tales about: A woman terrorized in her apartment by phone calls from an escaped prisoner from her past; a Russian count in the early 1800s who stumbles upon a family in the countryside trying to destroy a particularly vicious line of vampires; and a 1900-era nurse who makes a fateful decision while preparing the corpse of one of her patients - an elderly medium who died during a seance.",
         "A trilogy of three horror stories. \"The Drop of Water\" concerns a nurse who steals a ring off a dead spiritualist, only to have the corpse seek revenge. \"The Telephone\" features a prostitute who is terrorized by phone calls from a dead client. \"The Wurdalak\" stars Boris Karloff as a vampire who feeds on the blood of his loved ones.",
         "(1) \"Il Telefono\" - Rosy receives many phone calls threatening her. She believes her former lover, who has just escaped from prison, is calling her. She denounced him for a crime committed time ago and he was convicted. She calls her girlfriend Mary to stay with her. A secret is revealed and a tragedy happens in the end. (2) \"I Wurdulak\" - Vladimire d'Urfe, a young man, is riding a horse at night and finds a man with a knife in his back. He withdraws the dagger from the man and finds a house close to the place where he found the body. There, he meets a family composed of two brothers, one sister, one sister-in-law and one nephew, and he falls in love at first sight with the beautiful Sdenka. He realizes that the dead man was a criminal, probably killed by the head of the family Gorca, and he is advised to leave that place, before Gorca arrives back at midnight. The family informs him that there is a chance that Gorca might have been transformed in a Wurdulak, a kind of vampire who drains blood from the living persons. A few seconds after midnight, Gorca comes back home, and the afraid family does not know whether he was transformed or not. The family discovers later what happened in a tragic way. (3)\"La Goccia d' Acqua\"- Helen Chester is called to prepare the body of a countess for her funeral. She steals the worthy ring from her finger. The countess comes back from beyond to retrieve her ring, terrifying the frightened woman."
      ],
      "budget": 0
   },
   "movielensId": 3832,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1963-08-17",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Mario Bava"],
      "runtime": 92,
      "movieId": 3832,
      "title": "Black Sabbath",
      "mpaa": "",
      "actors": [
         "Boris Karloff",
         "Michèle Mercier",
         "Jacqueline Pierreux",
         "Susy Andersen",
         "Lidia Alfonsi",
         "Massimo Righi",
         "Rika Dialina",
         "Glauco Onorato",
         "Milly",
         "Harriet Medin",
         "Gustavo De Nardo",
         "Milo Quesada",
         "Mark Damon"
      ],
      "imdbMovieId": "0057603",
      "originalTitle": "I tre volti della paura",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "LvqT1D7qvrc",
         "P2k-XeX5Iaw"
      ],
      "plotSummary": "Black Sabbath is a 1963 Italian horror film directed by Mario Bava. Boris Karloff, in addition to appearing in the linking passages, has a role in \"The Wurdalak\" segment (based on a story by Aleksey Konstantinovich Tolstoy). The film comprises three horror stories, the others being \"The Drop of Water\" and \"The Telephone.\"",
      "tmdbMovieId": 28043,
      "avgRating": 3.4351,
      "releaseYear": "1963",
      "numRatings": 208,
      "posterPath": "/ftqFFa48PSqupA0JKRAzf5WaR9H.jpg"
   }
}