{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "transplantation",
            "id": 741
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "mutant",
            "id": 1852
         },
         {
            "name": "brain",
            "id": 2588
         },
         {
            "name": "fiancé",
            "id": 2687
         },
         {
            "name": "surgeon",
            "id": 3262
         },
         {
            "name": "strip club",
            "id": 3688
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "car crash",
            "id": 9844
         },
         {
            "name": "laboratory",
            "id": 10124
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "disembodied head",
            "id": 10478
         },
         {
            "name": "mad doctor",
            "id": 10770
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "decapitation",
            "id": 11181
         },
         {
            "name": "severed head",
            "id": 11581
         },
         {
            "name": "car accident",
            "id": 13063
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "transplant",
            "id": 33498
         },
         {
            "name": "surgery",
            "id": 157959
         }
      ],
      "imdb_id": "tt0052646",
      "video": false,
      "title": "The Brain That Wouldn't Die",
      "recommendations": [
         22727,
         72091,
         40954,
         43109,
         42794,
         28586,
         36530,
         43341,
         34078,
         31392,
         31280,
         3574,
         109122,
         31276,
         26643,
         31119,
         32307,
         53949,
         3124,
         29393
      ],
      "backdrop_path": "/wSsgo70hqClQvH0CKklbhuwHspr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Dr. Bill Cortner",
               "gender": 2,
               "credit_id": "52fe451b9251416c91027b71",
               "name": "Jason Evers",
               "profile_path": "/18UezS7VTmEd3WQ4R7kizPKgeNd.jpg",
               "id": 16089,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Jan Compton",
               "gender": 1,
               "credit_id": "52fe451b9251416c91027b75",
               "name": "Virginia Leith",
               "profile_path": "/1QLn1rgPuKQqa79lQpKZvjXNLb1.jpg",
               "id": 110727,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "52fe451b9251416c91027b99",
               "name": "Doris Brent",
               "profile_path": null,
               "id": 110736,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Jeannie Reynolds",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027ba1",
               "name": "Audrey Devereal",
               "profile_path": null,
               "id": 110737,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Monster",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027ba5",
               "name": "Eddie Carmel",
               "profile_path": null,
               "id": 110738,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Doris Powell",
               "gender": 1,
               "credit_id": "52fe451b9251416c91027b79",
               "name": "Adele Lamont",
               "profile_path": null,
               "id": 110729,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Blonde Stripper",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027b7d",
               "name": "Bonnie Sharie",
               "profile_path": null,
               "id": 110730,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Brunet Stripper",
               "gender": 1,
               "credit_id": "52fe451b9251416c91027b81",
               "name": "Paula Maurice",
               "profile_path": null,
               "id": 110731,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Peggy Howard",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027b85",
               "name": "Marilyn Hanold",
               "profile_path": "/afXJVfSIlqTzV5fsFuMt8do54PA.jpg",
               "id": 30998,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Dr. Cortner",
               "gender": 2,
               "credit_id": "52fe451b9251416c91027b89",
               "name": "Bruce Brighton",
               "profile_path": null,
               "id": 110732,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Beauty Contest M.C.",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027b9d",
               "name": "Bruce Kerr",
               "profile_path": null,
               "id": 91487,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Photographer",
               "gender": 2,
               "credit_id": "52fe451b9251416c91027b8d",
               "name": "Arny Freeman",
               "profile_path": null,
               "id": 110733,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Medical Assistant",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027b91",
               "name": "Fred Martin",
               "profile_path": null,
               "id": 110734,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Donna Williams",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027b95",
               "name": "Lola Mason",
               "profile_path": null,
               "id": 110735,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Kurt",
               "gender": 0,
               "credit_id": "52fe451b9251416c91027ba9",
               "name": "Leslie Daniels",
               "profile_path": null,
               "id": 27842,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027b67",
               "name": "Joseph Green",
               "profile_path": null,
               "id": 110726,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027b6d",
               "name": "Joseph Green",
               "profile_path": null,
               "id": 110726,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027baf",
               "name": "Rex Carlton",
               "profile_path": null,
               "id": 97961,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027bb5",
               "name": "Stephen Hajnal",
               "profile_path": null,
               "id": 1129117,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027bbb",
               "name": "Marc Anderson",
               "profile_path": null,
               "id": 1129118,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027bc1",
               "name": "Rex Carlton",
               "profile_path": null,
               "id": 97961,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027bc7",
               "name": "Joseph Green",
               "profile_path": null,
               "id": 110726,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe451b9251416c91027bcd",
               "name": "Paul Fanning",
               "profile_path": null,
               "id": 1206139,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe451b9251416c91027bd3",
               "name": "George Fiala",
               "profile_path": null,
               "id": 109241,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "551d74df925141374f00064e",
               "name": "Mort Landberg",
               "profile_path": null,
               "id": 1448815,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "56e2aeb092514143a1000a19",
               "name": "Jack Priestley",
               "profile_path": null,
               "id": 1027513,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e2aec1c3a36870010026c5",
               "name": "Byron Baer",
               "profile_path": null,
               "id": 1588910,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "56e2aed6925141788e0025c0",
               "name": "Eva Blair",
               "profile_path": null,
               "id": 1588911,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.063065,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33468,
      "vote_count": 40,
      "budget": 62000,
      "overview": "Dr. Bill Cortner (Jason Evers) and his fiancée, Jan Compton (Virginia Leith), are driving to his lab when they get into a horrible car accident. Compton is decapitated. But Cortner is not fazed by this seemingly insurmountable hurdle. His expertise is in transplants, and he is excited to perform the first head transplant. Keeping Compton's head alive in his lab, Cortner plans the groundbreaking yet unorthodox surgery. First, however, he needs a body.",
      "similar": [
         341006,
         23730,
         2142,
         10185,
         294963,
         24920,
         8810,
         19912,
         588,
         9426,
         10483,
         263115,
         948,
         126889,
         298312,
         381288,
         378018,
         22825,
         1991,
         769
      ],
      "original_title": "The Brain That Wouldn't Die",
      "runtime": 82,
      "poster_path": "/lEmcF0P87S1sGKKkzZwIYYbqv6R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Rex Carlton Productions",
         "id": 12335,
         "origin_country": ""
      }],
      "release_date": "1962-02-25",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "Alive... without a body... fed by an unspeakable horror from hell!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Joseph Green"],
      "runtime": 82,
      "synopsis": "Dr. Bill Cortner (Herb Evans) is a brilliant surgeon who saves the life of a patient that his father Dr. Cortner (Bruce Brighton) is operating on. Bill uses one of the techniques that he has been researching in his studies on amputated limbs and the ability to keep them alive. The research Bill has used is controversial because the ethics involved include using body parts of expired patients. Dr. Cortner appreciates his sons assistance but warns him to proceed carefully. As Bill meets up with his fiancée Jan Compton (Virginia Leith) to make plans for the weekend a call comes in from Kurt (Leslie Daniel), the doctor assisting Bill at his country house, that there is a problem in the basement. As Bill hurried drives toward the house with Jan by his side the car accidentally goes off the road and Jan is decapitated. Bill rushes the head of the woman to his country house and keeps it alive with the intention of killing a woman for her body and transplanting it onto Jans head. One of Bills earlier experiments is being kept locked in the basement and becomes more violent as time proceeds. Jans surviving body part, her head resents being kept alive and communicates with the thing living in the closet, telling it to break out. As Bill searches for the perfect female body for Jans head, he meets several women, finally meeting up with a former friend Donna Williams (Lola Mason) whose scarred face Bill promises to eradicate with plastic surgery. As Bill brings Donna back to the country house a startling reaction from the creature in the closet causes astounding results. ================ A More Detailed Synopsis Follows =============== The movie opens with a black screen and a woman's voice pleading, \"Let me die. Let me die.\" Title and credits follow. A man is on the operating table covered with sheets. He is surrounded by three doctors and a nurse in surgical gowns, caps and masks. The patient stops breathing and the senior Dr. Cortner (Bruce Brighton) laments, \"I should have known he was a good as dead when they wheeled him in.\" Nurse Jan Compton (Virginia Leith) tries to comfort her soon to be father-in-law, \"You did everything possible. Everything you could Dr. Cortner.\" His son, Dr. Bill Cortner (Jason Evers as Herb Evers) seizes the opportunity and asks, \"Now, Dad, do I have permission to take over and try things my way?\" Father reluctantly agrees and assists his son by working on the heart while Bill takes over the brain. They manage to revive the patient, his outcome is still uncertain, but he is now alive. Bill admits he has been working in his laboratory with similar results. Dr. Cortner does finally admit his son did perform a miracle, \"I may not approve of your methods, but I am proud of your results.\" After the patient is wheeled out of the Operating Room, Father and Son wash up and discuss the medical ethics of experimentation on humans. Bill tells his father he is close to perfecting a drug that will assist in transplantation without rejection. They walk back into the O.R. to talk, and Jan joins them. Bill reminds his father about the medical convention in Denver. Jan checks on his reservations. Dr. Cortner reveals that the hospital has been making inquiries about missing human parts. He tells his son, \"But I can't cover up for you anymore. The Superintendent had it out with me. He thinks it's you whose been stealing those limbs from the amputee operations.\" Bill admits he needs them for his work. Before he leaves, Dr. Cortner asks his son about his weekend plans, cautioning him about the country house, \"Place gives me the creeps. I should have sold it when your mother died.\" Bill promises Jan they will be married in a few weeks. A nurse (Doris Brent) catches Bill and Jan before they leave the hospital. She tells him about an important phone message from Kurt at the country place, \"Something terrible has happened and he wanted you to come right out.\" Bill drives Jan's car up to the country house. He drives too fast and crashes the car. Bill is thrown clear of the wreck, but Jan is trapped inside the burning car. Bill retrieves her head, wrapping it inside his jacket. He runs back to Dad's house in the country carrying Jan's head in his arms like a football. When he gets to the palatial estate he calls to his assistant, Kurt, while pounding on the front door. Kurt (Anthony La Penna as Leslie Daniel) answers the door, still wearing his lab coat. His left arm is paralyzed, his left hand is drawn back into a claw, the skin dark and leathery. Bill explains there has been an accident. He is cradling Jan's head in his arms, he is frantic. \"I've got to save her,\" he tells Kurt. Kurt tries to relay his concern about the thing in the closet, but Bill insists, \"For Gods sake Kurt, this is urgent. Do as I tell you before its too late. I can't waste precious time arguing with you.\" The two walk downstairs to the lab and hook up equipment. Bill carefully pours a test tube of liquid into a flask. The time is now 10:20 and we see what all the frantic work involved. Jan's bandaged head sits in an enamel pan, attached to various tubes and wires. Kurt is astonished and tells Bill, \"The eyelids, I saw them move. It can't be. My eyes are deceiving me.\" Bill replies, \"What you see is real. What's done is done, and what I've done is right. It's the work of science.\" Jan starts to revive and mumbles, \"I remember fire. Burning. Let me die. Let me die.\" Bill reminds Kurt he's had transplant success, but Kurt asks, \"Transplant her to what?\" Bill considers the question, then replies, \"I've brought her back. She'll live and I'll get her another body. I can make her complete again.\" Kurt disagrees and voices his objections. Bill does admit he can only keep her alive for 48-50 hours in the pan. We learn that Kurts arm, withered and deformed, was an earlier unsuccessful experiment using an earlier formula. Kurt reminds Bill about the creature in the closet. Bill approaches the heavy door, padlocked on the outside. Something inside is breathing abnormally. Bill peers inside through an observation door near the top. He is horrified by what he sees. \"Keep it locked,\" he tells his assistant. He then turns his attention back to his fiancée, \"I've got to think about her now. I've got to find her a body.\" \"How are you going to go about getting one?\" Kurt asks. Bill assures his assistant that there are ways. It is late evening and Bill decides to go cruising at a local strip club, The Moulin Rouge. Outside the entrance, he sees two cut out display boards of strippers, a blonde and a brunette. He likes what he sees, obviously the discriminating shopper. Inside the blonde stripper (Bonnie Sharie) does her show for the patrons of both sexes. Bill wanders in and takes a stool at the bar. Blondie wanders over and bumps and grinds to get Bill's attention. The brunette stripper (Paula Maurice), a bit masculine looking, is jealous of her co-worker. When the blonde finishes her act, she heads for the dressing room. This gives the brunette a chance to make eyes at Bill. A table becomes available and Bill sits down next to the brunette and chats. Blondie comes back and joins Bill at his table. At the house, Jan is resting in her pan. Blondie goes back to her dressing room, and Bill follows. They chat. Jan begins to mumble again about dying. Bill is getting a little anxious and tells the stripper, \"You may be just what I'm looking for.\" Before Bill can close the deal, the brunette enters the dressing room and changes. Bill is concerned that a witness is more than he can handle. When the girls get catty with each other, Bill excuses himself. The brunette tells Bill, \"Come back later, I'll remember you.\" \"That's what I'm afraid of,\" he replies. The blonde and brunette strippers get into a fight. We close this charming scene with a camera pan up the wall to a pair of cat paintings and someone meowing. [Note: Yes, we get it, a cat fight!] Jan awakens and looks around the lab. Her brain waves register high on the equipment. She calls out to the creature in the closet, \"What has he done to you?\" It is mute, so she directs it to knock once if it hears her. Kurt is attracted by the noises downstairs. Jan expresses her anger and disappointment at Bill for what he's done to her. She invites the creature to join her in a plot of revenge. Kurt goes down to the lab and Jan pretends to be asleep. Kurt tip-toes over to the closet and listens at the door. It pounds on the door and Kurt jumps. Jan laughs hysterically. Kurt runs over to the lab table and confronts his tormentor. Jan asks Kurt, \"What's locked behind that door?\" \"Horror: no normal mind can imagine. Something even more terrible than you,\" Kurt replies. But Jan corrects him, \"No, my deformed friend. Like all quantities of...horror has its ultimate, and I am that.\" Kurt explains that Bill's experimental mistakes are summarized by the creature behind the closet door. Jan realizes what Bill has been doing at the country house and Kurt's part in the grotesque work. Kurt lost his arm in a lab accident, and Bill promised to restore it. Jan realizes that Bill intends to transplant her head onto another woman's body. Jan explains the new serum has given her power Bill never expected. She demonstrates for Kurt. The terrified lab assistant runs when the creature tries to force the closet door off its hinges. Kurt runs into Bill in the living room and asks if he was successful in finding a woman. Bill explains he can't be the last person seen with a woman before she disappears. The next morning Bill goes cruising in his car. He runs into a woman acquaintance, Donna Williams (Lola Mason). Donna suggests a bathing beauty contest, so Bill invites her into the car. He makes an excuse to stop at home first, but they run into another woman. A friend of Donna, Jeannie Reynolds (Audrey Devereal as Devereau), joins them in the car. Now with a witness, Bill's plans for Donna are scuttled and the three go to the beauty contest. They sit down just as the M.C. (Bruce Kerr) starts the show. The first contestant is Helen Appleton (uncredited). She is wearing a one-piece swimsuit. Bill nods his approval. Next up is Betty Brockton (uncredited), a blonde with her hair in a single braid and wearing a modest two-piece swimsuit. Terri Lund (uncredited) is the third contestant. She is wearing a one-piece and the crowd applauds. Peggy Howard (Marilyn Hanold) is the final contestant and Bill leers approvingly. Donna notes, \"She has the second nicest body I've ever seen.\" Bill assumes Donna is just trolling for a compliment and asks, \"Second to you?\" But Donna quickly corrects Bill and reminds him of Doris, the girl in school who was disfigured by a jealous boyfriend. Donna mentions that Doris is seldom seen and has few friends. Bill is thinking Doris may be perfect for his needs. Jan continues her one-way chat with the creature in the closet and concludes they must stop Bill. Bill drives over to see Doris Powell (Adele Lamont) at her apartment. He walks in and she is posing on a platform for five photographers. Bill sits on the couch and observes the display. Doris stops and puts on a robe and dismisses the photographers. Art (an uncredited Sammy Petrillo) hangs back and suggests some unprofessional work. Doris makes it clear she is not interested and tells him to leave. She confronts Bill, \"See it all, mister? The show's over. Next time bring a camera and buy a ticket. I'm not running a charity.\" Bill reminds her they were class mates, but Doris is bitter and tells him she hates all men. She reminds Bill by showing him the scar on her face. Rather than being repulsed, Bill explains that he is a doctor and that his father is a very good plastic surgeon and they can fix her face. Doris is not convinced and tells Bill, \"I've been doctors. It's no use: the scar tissue is too deep. No one can help me.\" But Bill convinces her that new techniques are available. He talks her into a consultation at his home with his father. When Doris asks his motive, Bill tells her his version of the truth, \"I'm gonna make your face beautiful again, cut it off and give your body away.\" Doris laughs and explains that she believes him. Doris changes her clothes and they drive to the country house. At Jan's direction, the closet creature has been pounding on the door working the hinges loose. Kurt enters the lab with food for the creature. He is in a sarcastic mood, so Jan taunts him with, \"Your formless, sniveling fear becomes you more.\" They bicker and Jan directs Kurt over to the closet door. As she distracts Kurt, she summons her friend behind the closet door to attack Kurt. It reaches out through the observation door and pulls Kurt's arm inside. As Kurt struggles, the creature pulls his good arm off at the shoulder. Kurt wanders around the lab and house, smearing blood all over the walls. In cinema's longest death scene, Kurt wanders back to the lab and collapses and dies of shock and blood loss. All the while Jan giggles and laughs. Bill arrives home with Doris. Bill tells Doris he will mix some drinks and they will wait for his father to return. Bill discovers Kurt's body in the lab and covers it with a sheet. He closes, but forgets to lock the observation door and then he mixes the drinks. He adds a powerful sedative to Doris' drink. Bill walks back upstairs and gives Doris the spiked drink. Doris consumes the drink, and then accuses Bill of putting something in her drink. She collapses and Bill carries her down to the lab in his arms. Bill proudly announces to Jan, \"I told you I'd bring you a body. A beautiful one. Soon it will be yours.\" Bill rationalizes his intentions to Jan as he prepares for surgery. Jan tells Bill, \"You must be stopped.\" Bill needs quiet, so he places a strip of tape over Jan's mouth. Just as Bill prepares to cut off Doris' head, a pounding sound comes from the closet. Bill walks over to the door. He does not notice the observation door is unsecured. He looks back at Jan. The observation door opens and a large hand and arm reaches out to the doctor. It pulls him back and the door pulls loose from the casing. A grotesque creature (Eddie Carmel) emerges, still holding Bill Cortner through the door. It is a misshapen mess with one bulging eye, folds of scar tissue for a face and a pointed head. It carries the door and its victim across the lab. It manages to knock a flask of flammable liquid on the floor starting a fire. It throws Bill to the floor, discards the closet door, and approaches the doctor. It easily picks Bill up in its arms and chews a sizeable piece of his face off. At Jan's direction, it carries the unconscious Doris off the operating table and out of the burning lab. A stunned and dazed Dr. Cortner is still lying on the floor. Jan tells him, \"I told you to let me die.\" We close to a black screen and Jan laughing. [Note: The end title card reads, The Head That Wouldn't Die and a copyright year as 1960.]",
      "writers": [
         "Rex Carlton",
         "Joseph Green"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052646/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMjM5NzU3MV5BMl5BanBnXkFtZTgwODY1NjIxMzE@._V1._CR48,47,273,392_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Jason Evers, Virginia Leith, Anthony La Penna | See full cast and crew »"],
      "reviews": [
         "For what this is (a rather over-heated horror sci-fi stew), it works for its sheer audacity and shameless full-bore conviction of its aims. Mad scientist movies end up resorting to long shots of people in white lab coats talking in sterile sets. But this one has a woman's head in the tray, fighting with the doctor, yelling at the monster in the closet, and engaging the assistant in metaphysical questions usually not heard in such low-budget potboilers. Nice dynamic that it's his fiancé that he wants to save...but she has become so bitter since becoming a disembodied head in a tray of water. I remember watching this for the first time on TV in the early 70s and being amazed they used to make movies like this. Better than average camera work, also, trying to get a sense of vertigo and movement throughout. This film with its hell-bent-for-leather pace is a fever-dream that works because it doesn't let go, or tip you to the fact that the makers thought it was ridiculous as it certainly is. Be sure to get the restored version with the monster in the closet finally grabbing the doctor's arm and making a bloody mess at the end. A great cathartic bloody end to this near Shakespearean morality play about how man should not meddle in god's business.",
         "This was one of the first CREEPY movies I ever saw...I was about 5 at the time. It scared me GOOD! But that night I put chewing gum in one eye to be like the monster...and my mom got very upset. She had to clean my eye with alcohol and the next day my eye smelled like DOUBLE MINT! NOW THAT'S A MOVIE! Hey for it's time it was a great movie. That Head sitting on the lab counter top was as real as it got back then. And IF your 5 it is VERY SCARY! Kids now a days are spoiled by special effects that show too much and leave NOTHING for your minds imagination. Your mind can imagine things more scarier than special effects! (IMO)",
         "The opening credits bear the title THE BRAIN THAT WOULDN'T DIE. Some 80 minutes later, the same film is strangely billed as THE HEAD THAT WOULDN'T DIE in the end credits. That gives you an idea of how much effort went into this '60s schlockfest. But that doesn't mean it's not worth watching if you're in the right mood. Jason Evers (who would later lend his considerable talents to such memorable efforts as A PIECE OF THE ACTION and A MAN CALLED GANNON) stars as a wacky doc who thinks it'd be just super to keep his fiancée's head alive in his laboratory after her untimely decapitation in a car accident. He's understandably not content marrying a head, so he seeks out an appropriate (though not necessarily willing!) body donor. Much of the \"action\" takes place in the mad doc's basement lab (likely marking one of the final times the traditionally cheesy horror film lab set was put to use). Jan Compton (Virginia Leith), or Jan in the Pan as she's called, spends an awful lot of time yapping and whining. Another IMDb reviewer wasn't far off when he likened her to THE HEAD THAT WOULDN'T SHUT UP! Can you blame her? She's understandably not content to live this sort of life. But what's really holding her interest (and mine... there, I admitted it) is the doctor's other monstrous creation, which keeps trying to pound its from behind its single-doored prison. Will our hero find a body for his woman? Are the authorities on to him? Why am I enjoying this so much? Those are just some of the questions you'll find yourself asking. THE BRAIN THAT WOULDN'T DIE comes to us in the tradition of PLAN 9 FROM OUTER SPACE and THE BEAST OF YUCCA FLATS, though it's not quite on par with those films in terms of \"so bad it's good\" appeal. As incredible as it sounds, the picture is legitimately able to hold the viewer's interest with its outrageous plot and suspense built up over the creature behind the door. Sure it goes on a bit too long and sure there are dull moments, but what did you expect? Admit it. If you haven't seen this one, at least part of you wants to. It's probably that part that yearns for pure, unadulterated stupidity from grown men and women from time to time. So indulge that inner glutton with THE BRAIN THAT WOULD'T DIE.",
         "With all the \"teasecake\" in Brain (shot in 1959 but released in 1963), the locations (a loner wandering through strip clubs, swimsuit contests, a model's studio, in a convertible following and picking up women on the street) and the wolfish emphasis on full-length shots of near-naked stacked women, the movie has the sensibility and style of the men's magazines of that time (with symbolic titles like Rogue, Knave, Dude, Bachelor, Caper, etc.). It's surprising that it hasn't been remade and updated, even if only for the cable or home video market, like Not of This Earth, Little Shop of Horrors, How To Make A Monster and other B programmers. Sure it's a cheap little film but that's the fun of it.",
         "THE BRAIN THAT WOULDN'T DIE was considered so distasteful in 1959 that several cuts and the passage of three years was required before it was released in 1962. Today it is difficult to imagine how anyone could have taken the thing seriously even in 1959; the thing is both lurid and lewd, but it is also incredibly ludicrous in a profoundly bumptious sort of way. The story, of course, concerns a doctor who is an eager experimenter in transplanting limbs--and when his girl friend is killed in a car crash he rushes her head to his secret lab. With the aid of a few telephone cords, a couple of clamps, and what looks very like a shallow baking pan, he brings her head back to life. But is she grateful? Not hardly. In fact, she seems mightily ticked off about the whole thing, particularly when it transpires that the doctor plans to attach her head to another body. As it happens, the doctor is picky about this new body: he wants one built for speed, and he takes to cruising disconcerted women on city sidewalks, haunting strip joints, visiting body beautiful contests, and hunting down cheesecake models in search of endowments that will raise his eyebrow. But back at the lab, the head has developed a chemically-induced psychic link with another one of the doctor's experiments, this one so hideous that it is kept locked out of sight in a handy laboratory closet. Can they work together to get rid of the bitter and malicious lab assistance, wreck revenge upon the doctor, and save the woman whose body he hankers for? Could be! Leading man Jason Evers plays the roguish doctor as if he's been given a massive dose of Spanish fly; Virginia Leith, the unhappy head, screeches and cackles in spite of the fact that she has no lungs and maybe not even any vocal chords. Busty babes gyrate to incredibly tawdry music, actors make irrational character changes from line to line, the dialogue is even more nonsensical than the plot, and you'll need a calculator to add up the continuity goofs. On the whole THE BRAIN THAT WOULDN'T DIE comes off as even more unintentionally funny than an Ed Wood movie. Director Joseph Green actually manages to keep the whole thing moving at pretty good clip, and looking at the film today it is easy to pick out scenes that influenced later directors, who no doubt saw the thing when they were young and impressionable and never quite got over it. The cuts made before the film went into release are forever lost, but the cuts made for television have been restored in the Alpha release, and while the film and sound quality aren't particularly great it's just as well to recall that they probably weren't all that good to begin with. Now, this is one of those movies that you'll either find incredibly dull or wildly hilarious, depending on your point of view, so it is very hard to give a recommendation. But I'll say this: if your tastes run to the likes of Ed Wood or Russ Meyers, you need to snap this one up and now! Four stars for its cheesy-bizarreness alone! GFT, Amazon Reviewer",
         "This is wonderful over-the-top entertainment for fans of sleaze cinema. Some people apparently don't like this film because everyone in it is evil. Thankfully, that is true. There's nothing more boring than all those nice, bland heroes and heroines. Yecchh!! Our cast here is totally over-the-top \"bad\". Leslie Daniels in particular as the doctor's Igor-like sidekick puts on his best (or should I say worst?) Richard III impression, complete with withered hand and drawn out Shakespearean rant. A classic ham! And there's cheesecake for everyone with busty babes bursting out from every corner (as long as the doctor has to find a new body to crown his girlfriend's head on... well, who wouldn't pick the creme de la creme?). There's even a fabulous (meee-owww!) cat fight between two strippers that probably levitated a lot of audiences back in 1960. And ... RE-ANIMATOR fans will love the similarities of the angst-ridden head in the tray trying to seize a little power. So, how can anyone say this film is bad in a bad way? You want \"good\", go watch DONOVAN's BRAIN, a very competent but forgettable little film made several years earlier. This film is a like a mad, campy Halloween party. Leave your attitude behind, and try to enjoy it!",
         "This film is an absolute classic for camp. That is why it was an Elvira and MST3000 classic. Everyone knows the story. Scientist keeps his girlfriend's head alive in a lasagna pan in his basement while he cruises town and tries to find her a body by checking out the local chicks. Finally he finds a real hourglass body with a scar-faced chick's head on top. The severed head makes friends with the failed experiment in the closet and the conehead comes out of the closet and rips off the assistant's remaining \"good\" arm (his other is not right from a scientist's earlier failure), and the whole place burns down. The movie scared us so much as kids that my friend wouldn't go into his basement for a year after seeing it. As kids we ranked the scariest movies of all time and this one was number four. Only one of those scary movies was really any good (the Original \"The Haunting\".) I had to give this movie a seven rating for the tremendous amount of entertainment value it offers. Its eerie effect because of the crappy production and the weird sexual angle when the scientist looks for the bodies (complete with porno sound track) scares the hell out of innocent children, while the ridiculous aspects make it prime material for watching talking and laughing. I could watch this film tonight and enjoy it while I'd rather go to the Dentist than watch \"Chicago\" again. Seven is the most I can give it, because its entertainment value is mere luck. The film , as cinema, is a disaster.",
         "The unethical surgeon Dr. Bill Cortner (Herb Evers) is developing a technique of transplantation of organs and members using a serum against rejection. When he has a car accident with his girlfriend Jan Compton (Virginia Leith), he saves her head only, and tries to find a woman with a beautiful body to transplant Jan's head against her will. I found the low budget movie \"The Brain That Wouldn't Die\" very underrated in IMDb. The story is not so bad, and certainly inspired \"Frankenhooker\" and \"The Man with Two Brains\". The acting and the direction are very reasonable, and there are some mistakes of edition (for example, when Dr. Bill Cortner is having a conversation in the car with his friend on the sidewalk), but these errors just contribute to make the movie funnier. The make-up of the creature is great. My vote is six. Title (Brazil): \"O Cérebro Que Não Queria Morrer\" (\"The Brain That Did not Want to Die\")",
         "I had a heck of a good time viewing this picture, and was splendidly surprised at its more erudite features. First off, the film is undeniably cheaply-made with its cardboard sets, limited settings, and creative scientific props. The acting ranges from very poor(the two strippers), barely professional(Herb Evers as the leading man), gothic overstatement(Leslie Daniels as the assistant Kurt)to first-rate with Virginia Leith in the title role as the headless victim alive against her will for the benefit of science and her fiancee's lustful passions. The scripting though is very good and the dialogue is fantastic for a movie of this ilk. Issues abound about what role science and medicine have in our lives and what their boundaries should be. This film is a thinking film in many ways. However, don't be too fooled by its real intent. It is a sleazy story about a man obsessed with his aptitude in medical science who wishes to fuse together his dead girlfriend's head with the perfect body, thereby creating the perfect woman for a man with the best of both body and soul. One other very bright aspect of the film is the sax music which resonates strongly every time the doctor scours town for female beauties.",
         "A scientist and his girl friend are out driving when his speeding causes a car crash. He escapes unharmed but she is decapitated. He saves her head, brings it to his house and keeps it alive (!!!!). He then proceeds to search out models and strippers for the perfect body for the head. His crippled assistant watches over the head which starts talking and has a telepathic (or telepathetic) link to a deformed monster kept in the closet.... As you can see, this is pretty stupid stuff, but I had a certain fondness for it. When I grew up in the late 1970s, a local TV station showed this movie about 20 times each year (no exaggeration). They showed it always on Saturday afternoon TV--uncut. Seeing this on TV back then was great! Explicit blood and gore along with a gruesome monster and sleazy sexploitation--who cares if it was good? Seeing it now I realize how lousy this really is. The acting is perfectly wretched, the production values are nonexistent, the script is pretty dumb and (aside from the still pretty disgusting gore) this is dull stuff. There's also a mild cat fight between two women and the admittedly great monster at the end. Also add in an ending which leaves tons of loose ends. On one hand this is an interesting example of a 1960s exploitation film. On the other its utter trash. Either way, it's not a good movie but is a must-see (for one time only) for horror and gore fans. Also the head's laugh is pretty creepy. Note the end credits which gets the TITLE wrong (calling it \"The HEAD That Wouldn't Die\")!"
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Rex Carlton Productions"],
      "summaries": [
         "Dr. Bill Cortner has been performing experimental surgery on human guinea pigs without authorization and against the advice of his father, also a surgeon. When Bill's fiancée Jan Compton is decapitated in an automobile accident, he manages to keep her brain alive. He now needs to find a new body for his bride-to-be and settles on Doris Powell, a glamor model with a facial disfigurement. Jan meanwhile doesn't want to continue her body-less existence and calls upon the creature hidden in the basement, one of Bill Cortner's unsuccessful experiments, to break loose.",
         "After a car crash, a man keeps his wife's head alive in his laboratory. As if this weren't enough, an evil beast pounds and screams from a locked room adjacent to the lab.",
         "The unethical surgeon Dr. Bill Cortner (Herb Evers) is developing a technique of transplantation of organs and members using a serum against rejection. When he has a car accident with his girlfriend Jan Compton (Virginia Leith), he saves her head only, and tries to find a woman with a beautiful body to transplant Jan's head against her will.",
         "Brilliant but borderline psychotic surgeon does secretive, experimental work with limb transplants and tissue rejection drugs, much to the chagrin of his surgeon-father. When he crashes his car and his fiancee is decapitated, his research - far from complete - is put to the test. His focus then becomes finding an appropriate donor body to make his fiancee whole, while the current and failed experiments in his basement laboratory grow restless.",
         "A doctor experimenting with transplant techniques keeps his girlfriend's head alive when she is decapitated in a car crash, then goes hunting for a new body."
      ],
      "budget": 62000
   },
   "movielensId": 3833,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-02-25",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Joseph Green"],
      "runtime": 82,
      "movieId": 3833,
      "title": "The Brain That Wouldn't Die",
      "mpaa": "",
      "actors": [
         "Jason Evers",
         "Virginia Leith",
         "Doris Brent",
         "Audrey Devereal",
         "Eddie Carmel",
         "Adele Lamont",
         "Bonnie Sharie",
         "Paula Maurice",
         "Marilyn Hanold",
         "Bruce Brighton",
         "Bruce Kerr",
         "Arny Freeman",
         "Fred Martin",
         "Lola Mason",
         "Leslie Daniels"
      ],
      "imdbMovieId": "0052646",
      "originalTitle": "The Brain That Wouldn't Die",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "BqKv_kLZZGQ",
         "8bidEQn6vfg"
      ],
      "plotSummary": "Dr. Bill Cortner (Jason Evers) and his fiancée, Jan Compton (Virginia Leith), are driving to his lab when they get into a horrible car accident. Compton is decapitated. But Cortner is not fazed by this seemingly insurmountable hurdle. His expertise is in transplants, and he is excited to perform the first head transplant. Keeping Compton's head alive in his lab, Cortner plans the groundbreaking yet unorthodox surgery. First, however, he needs a body.",
      "tmdbMovieId": 33468,
      "avgRating": 2.36726,
      "releaseYear": "1962",
      "numRatings": 339,
      "posterPath": "/lEmcF0P87S1sGKKkzZwIYYbqv6R.jpg"
   }
}