{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "cowboy",
            "id": 155291
         },
         {
            "name": "wild west show",
            "id": 156622
         }
      ],
      "imdb_id": "tt0080472",
      "video": false,
      "title": "Bronco Billy",
      "recommendations": [
         17689,
         28761,
         37917,
         16969,
         15417,
         22023,
         10724,
         20006,
         14881,
         10747,
         10649,
         28368,
         6723,
         8879,
         28176,
         17169,
         11901,
         35588,
         15393,
         12633
      ],
      "backdrop_path": "/k215tEWyBst0aLgD976SlVxrrLQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bronco Billy",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e013775",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Antoinette Lily",
               "gender": 1,
               "credit_id": "52fe442bc3a368484e013779",
               "name": "Sondra Locke",
               "profile_path": "/vzuYg4TGd2YSJy4I6ZNaLUVxuuV.jpg",
               "id": 66223,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "John Arlington",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e01377d",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Doc Lynch",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e013781",
               "name": "Scatman Crothers",
               "profile_path": "/nzSlIgwX4vMSJhDPdUSkV9MAAai.jpg",
               "id": 7077,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Lefty LeBow",
               "gender": 2,
               "credit_id": "5835fe0cc3a36836be001ae7",
               "name": "Bill McKinney",
               "profile_path": "/bXGJNizj5SbEFPjeBupnRxgwPq0.jpg",
               "id": 16555,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Leonard James",
               "gender": 2,
               "credit_id": "5835fe1ac3a36836a3001ac5",
               "name": "Sam Bottoms",
               "profile_path": "/h3arYTuOmUxTgKEsimVXtkyriAu.jpg",
               "id": 8350,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Chief Big Eagle",
               "gender": 2,
               "credit_id": "533d3a5ec3a368790b002bea",
               "name": "Dan Vadis",
               "profile_path": "/uLcOUp29ZPLXQvMvmpEUIQuEMF6.jpg",
               "id": 37723,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Lorraine Running Water",
               "gender": 1,
               "credit_id": "5835fe27c3a36836a6001abb",
               "name": "Sierra Pecheur",
               "profile_path": null,
               "id": 170074,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Sheriff Dix",
               "gender": 2,
               "credit_id": "5835fe8f92514131a1001a5a",
               "name": "Walter Barnes",
               "profile_path": "/m7OtPTdxtRSRFJeAYnBSTFjINgX.jpg",
               "id": 33544,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Dr. Canterbury",
               "gender": 2,
               "credit_id": "551727e29251416f00001641",
               "name": "Woodrow Parfrey",
               "profile_path": "/eKbfFahTG0h0b47QXwKTGY1eZaS.jpg",
               "id": 13263,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Irene Lily",
               "gender": 1,
               "credit_id": "5835fea8c3a36836ae0019ba",
               "name": "Beverlee McKinsey",
               "profile_path": null,
               "id": 1218873,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Lt. Wiecker",
               "gender": 2,
               "credit_id": "5835fed6c3a36836b7001afb",
               "name": "Doug McGrath",
               "profile_path": "/5SymooBkRDbpetuy5VlgMZWcfmZ.jpg",
               "id": 62033,
               "order": 11
            },
            {
               "cast_id": 9,
               "character": "Station Mechanic",
               "gender": 2,
               "credit_id": "551727c9c3a3687dec00020c",
               "name": "Hank Worden",
               "profile_path": "/r43IWN0nGj6kpgNAiK0kgzTIA95.jpg",
               "id": 30299,
               "order": 12
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "5652bae39251417a6700216b",
               "name": "David Reed",
               "profile_path": "/qbEmGeofMt8cDYtpSOhfSO2tthL.jpg",
               "id": 1536857,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Child at orphange",
               "gender": 1,
               "credit_id": "5835ff22c3a36836b3001b97",
               "name": "Alison Eastwood",
               "profile_path": "/mRXDleUiPyNFSv3mOF4PNR7nhkY.jpg",
               "id": 389,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Orphan",
               "gender": 2,
               "credit_id": "5835ff2e92514131a1001aef",
               "name": "Kyle Eastwood",
               "profile_path": "/5nYxN3NMIClr3KKAF0U5aIS7MVK.jpg",
               "id": 33525,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "5835ff3ec3a36836ae001a68",
               "name": "George Wendt",
               "profile_path": "/wbDxe198w5Yu8zYdxkV9vmexN1E.jpg",
               "id": 66606,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe442bc3a368484e013771",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54959557c3a36831b8001ce0",
               "name": "Dennis Hackin",
               "profile_path": null,
               "id": 136194,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5835ff7ac3a36836be001c71",
               "name": "Neal H. Dobrofsky",
               "profile_path": null,
               "id": 36129,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5835ff8492514131a1001b43",
               "name": "Dennis Hackin",
               "profile_path": null,
               "id": 136194,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5835ff8f9251413198001bfc",
               "name": "David Worth",
               "profile_path": "/eelvhT2xXPSrk1ANkFZFwUFHegc.jpg",
               "id": 22012,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5835ff9b92514131a4001c0a",
               "name": "Eugène Lourié",
               "profile_path": null,
               "id": 11558,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5835ffa5c3a36836ae001ae1",
               "name": "Ernie Bishop",
               "profile_path": null,
               "id": 6925,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5835ffafc3a36836b7001bec",
               "name": "Glenn Wright",
               "profile_path": null,
               "id": 1043608,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 5.621669,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21866,
      "vote_count": 65,
      "budget": 0,
      "overview": "An idealistic, modern-day cowboy struggles to keep his Wild West show afloat in the face of hard luck and waning interest.",
      "similar": [
         24420,
         1259,
         276,
         1024,
         1643,
         13523,
         44564,
         17612,
         38,
         19913,
         13,
         1903,
         50546,
         50544,
         86331,
         46705,
         272693,
         68718,
         228205,
         277547
      ],
      "original_title": "Bronco Billy",
      "runtime": 116,
      "poster_path": "/9eXrB9j0gwxQBPJWRp8ExgKaSy7.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Second Street Films",
            "id": 89137,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1980-06-11",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "The most outrageous of 'em all.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Clint Eastwood"],
      "runtime": 116,
      "synopsis": null,
      "writers": ["Dennis Hackin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080472/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1ODM0NDcxNF5BMl5BanBnXkFtZTcwMDExNjcyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Clint Eastwood, Sondra Locke, Geoffrey Lewis | See full cast and crew »"],
      "reviews": [
         "This movie never got much acclaim for some reason. When I read where Clint Eastwood said it was a personal favorite of his I smiled, because it's mine, too.....and I like a lot of Eastwood's movies. This isn't just my favorite Eastwood film. It's one of my all-time favorite - period! That's probably because it has tremendous charm, with a good mixture of comedy and drama with characters you care about. It's definitely different from most of Clint's movies. The famous Eastwood glare when he's mad is still there, and he still shows his violent side. However, it's not a violent story, just a tale of a modern-day man and his little troupe who want to be cowboys and Indians, and go on tour with their little Wild West show. The film has nice, colorful photography and looks great on DVD. However, the story, not the visuals, is the main attraction. It's refreshing to see Eastwood play a role like this where he's a Mr. Rogers-type western hero for little kids, urging children to stay on the straight and narrow, mind their parents and say their prayers before going to bed at night. Sondra Locke also is effective as the cold newcomer who reluctantly joins the group and slowly changes from a mean-spirited, sarcastic woman to a caring person. She shows a good comedic touch and is excellent in this film, perhaps her best effort since \"The Heart Is A Lonely Hunter.\" The rest of the cast is fun to watch, too, and it includes one of my favorite faces and voices, that of \"Scatman\" Crothers. There is very little profanity in this film, too, which adds to the attraction and widens the potential audience of this neglected gem. I really think it's Eastwood's most underrated movie.",
         "I think this movie is pure Eastwood: not trying for the spectacular or flashy, not aiming for any Oscars, but honest, well-crafted, original in theme, touching and memorable. It deserves more attention than it's gotten and is deeper than it's been given credit for. Eastwood himself has said that if he ever had anything to say as a director it's in this film. It's a great addition to Eastwood's large and impressive body of work, and shows yet again that he is never afraid to take chances.",
         "What can I say about \"Bronco Billy\" expect that its truly one of Clint Eastwood's most sympathetic projects ever and a beautiful picture full of laughs and positive feelings. Between more violent movies Clint made a habit of appearing in a nice and jovial motion pictures (\"Thunderbolt and Lightfoot\", \"Every which way but loose\", \"Any which way you can\", \"Honkytonk man\", \"Pink Cadillac\") and it can't get much nicer than \"Bronco Billy\". Lovable story practically charms everybody and Clint is making incredibly amusing parody of his western characters. \"Bronco Billy\" is also one of the six films where Sondra Locke co-starred with Clint and this is certainly her finest performances beside him. Eastwood has always mentioned \"Bronco Billy\" as one of the personal favorites of his career and I see no reason to wonder why. This film just simply makes you feel good.",
         "I just saw Bronco Billy for the first time in its entirety tonight on DVD. This film has to be one of Eastwood's most underrated films. It's mainly a light comedy with some touches of drama thrown in. While Clint's in fine form in one of his few comedic roles the highlight is easily Scatman Crothers as Doc. He shines in each of his scenes and is the film's most likable character. Is the film a classic? No. But it does have a lot of heart and I ended up caring about what happened to Billy and his wild west show. It's not too hard to see why this is one of Clint's personal favorite films. I think the film has a good message too. And that is if you do good deeds then good luck might just come your way. Even though he is a flawed character Billy does have a good heart and performs shows for the underprivileged for free. If you are a in the mood for a film that will make you feel good for two hours then Bronco Billy is for you. My rating: 7/10",
         "After \"Every Which Way But Loose\" and its sequel, \"Any Which Way You can\" became HUGE boxoffice hits, it was something of a surprise that audiences shunned this film, which contains alot of the same elements (minus the monkey), but is just a tad more mature and serious in terms of story and character development. It's an admittedly corny but charming semi-western comedy that has Eastwood leading a ragtag \"wild west show\" across the country, playing at various county fairs, churches and orphanages. A snooty, spoiled, runaway heiress hooks up with the troupe, causing all kinds of complications. Eastwood directs with a sure hand; the film is rather leisurely paced, but has warm, rustic charm that's very likeable and the movie is worth discovering on video and DVD now. Fine family entertainment.",
         "Bronco Billy the sharpshooting cowboy is the owner of a modern-day travelling Wild West Show that seems to get caught in one messy situation after another. And not helping is the lack of crowd figures to their show. But nothing is going to stop Bronco Billy along with his companions from living their American dream. Through some amusing chain of events a wealthy, snobby heiress Antoinette Lilly finds herself tagging along with the show and becoming one of Bronco Billy's assistant, after her new husband leaves her stranded with nothing. I don't understand why they think this cap gun shoots nothing but blanks. While, Eastwood (who directs and stars) goes all sentimental, warm and fuzzy for a change. It wasn't as well accepted (despite it being one of Eastwood's favourites) and flopped at the box office with it receiving such poor jabs from most critics. Not to say it's great, but this comically light-hearted character journey has a certain amount of charm within its foundation that doesn't make it as bad as you would believe. Even with this whimsical nature, it never gets overbearing. Sure it can cause you to cringe at times, but it wears its heart on its sleeve and keeps it integrity intact. More often I found myself smiling at the shenanigans, well it was hard not to. It's simply a satire worked into an old-fashioned story of familiar ingredients, were there was plenty of things going on in the plot. Who knew these traditional plot devices could maintain such interest. This is because of a delightful bunch of wholesome performances, authentically zippy purple patches of random fun and Eastwood's conventionally hardy direction makes sure it ticks along sufficiently. Even if it's nicely shot, there's nothing overly flashy or quirky creeping up, so it's all about the loyal chemistry and assured story that keeps one compelled. Streamlining the moralistic story are deep insights and symbolic brushes of the true feeling of the American dream. You got to earn it, as it's not served on up on a plate for you and from that you make the most out of it to live up to 'your' dreams. Pacing-wise it can stall in stretches, but I didn't find it boring when that did occur. The stock characters here seem to be grounded by reality, despite some silly developments (mainly involving a mental institution). The relaxed Clint Eastwood chimes in with a wonderfully touching performance. He simply chews up the material with great vigour. A terrific Sandra Locke has a screen presence that's equally as dominating in the role of the stuck-up, cold-blooded high-end dame. Eastwood regular Geoffrey Lewis' oddball greedy turn was marvellously madcap. The performances of Sam Bottoms, Dan Vadis, Sierra Pecheur and Bill McKinney are pleasurably sincere as Eastwood's ragtag team. If there's one Eastwood film that's unfairly lampooned. \"Bronco Billy\" gets my vote. This gratifying show must go on.",
         "Here's a picture that works beautifully on several levels, including the philosophical (I kid you not). Approach it as a lighthearted caper, and you will be entertained. If you enjoy whimsy with a trace of fantasy, it will not disappoint you. How about a picture questioning the nature of reality, in which characters challenge and re-shape the identities that life seems to have foisted upon them? There are not many movies with such powerful ambitions, and fewer still that develop them in an oblique, yet perfectly comprehensible, manner. There is nothing the least bit heavy handed about this film; quite the opposite. Enter the special world it creates, and you will be rewarded both emotionally and intellectually. (See what I mean? Now make sure you haven't missed \"Finding Graceland\" and \"Pennies From Heaven.\")",
         "This film is not about Eastwood doing the stock 70's Eastwood, it is not about Sandra Locke, or about any other person's performance. The people in this film are lost, both in the social space of a world they cannot live in and in time. They lack most of the usual human equipment, like faith and hope (see Thomas McGuane's 'Panama'). But they blunder on, as much by default as by will, in the illusory world of Bronco Billy's road show and guided by Billy's real values, with each other. Like most of Eastwood's films, Bronco Billy is built around a story, but in this story how it comes out is not important, it is how Billy and this cast of lost souls get there. And the film has one the greatest lines in cinema history: The one Bronco Billy used to tell Antoinette what happened to his wife.",
         "This movie obviously wasn't made to break any box office records. It's just a sweet little comedy with great characters that deserves more recognition. Maybe the biggest problem with \"Bronco Billy\" is that it tries to have too much story. I wouldn't had mind seeing the movie focusing on Clint and his gang alone, plenty of great characters for that! Instead we now have the movie mainly focusing on the love story. This isn't really a comedy with \"haha\" moments. It more is a movie with a warm and fun feeling, which is mainly thanks to the great characters. I especially enjoyed Scatman Crothers in his role but also Clint Eastwood did a good job as a character that basically wanted to be like the western characters Eastwood previously played before. Fun comedy by Eastwood! Give it a shot, you might end up liking it. 7/10 http://bobafett1138.blogspot.com/",
         "I am a Clint fan..this was one of my favorites. Not a red carpet Oscar type flick...even better. One that is enjoyable to watch and leaves you feeling good when it is over. It's been a long time since I've seen it. I have seen it several times. The chemistry between Clint and Sondra is pretty noticeable. Living in Texas, I can say that in many ways it touches upon the nature of things here, the way friends stick together, and the overall feeling of kinship that exists between people from all walks of life. So, if you want to kick back and watch a hoot of a little movie, this is it. After watching it, you may just find out how many people you have touched in your life without realizing it."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Romance",
         "Western"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Second Street Films"
      ],
      "summaries": [
         "Bronco Billy McCoy is the proud owner of a small traveling Wild West show. But the business isn't doing too well: for the past six months he hasn't paid his employees. At a gas station he picks up Antoinette, a stuck-up blonde from a rich family, who was left behind without a penny by her husband on their wedding night. Billy likes her looks and hires her as his assistant. She seems to bring them bad luck and the business gets even worse. In these hard times she loses her reluctance and starts to like her new way of life... and Bronco Billy.",
         "Bronco Billy's is a second rate traveling wild west show, owned and featuring as its headliner 'Bronco' Billy McCoy, a trick rider and sharp shooter. Despite the show not making any money and the performers often not getting paid, the troupe is loyal to Billy. Billy does not accept any criticism either about himself or the way he runs his show, but he does have a soft side, especially toward his younger fans and the disadvantaged. Of late, he has had problems retaining an assistant for his act. The latest of the assistants he picks up along their travels is Antoinette Lily, whose story he is unaware beyond knowing that she is a stranded yet fiery damsel in distress. In reality, she is an heiress who was abandoned by her husband of convenience. At the beginning, Miss Lily, as the troupe refers to her, is an unwilling participant in the show, she only wanting to get somewhere where she can get back to her life. But once she reads news of her husband whose current fate was orchestrated by her unscrupulous step-mother and her lawyer, Miss Lily believes she can get back at her family by staying with the show. Miss Lily and the rest of the troupe are often at odds with each other, but slowly mutual friendly feelings emerge as Miss Lily learns the stories behind the façade of each of the troupe members. Billy and Miss Lily eventually fall in love. But when they inadvertently run into Miss Lily's husband, both Miss Lily and Billy have to decide what lies in their future.",
         "An idealistic, modern-day cowboy struggles to keep his Wild West show afloat in the face of hard luck and waning interest."
      ],
      "budget": 0
   },
   "movielensId": 3834,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1980-06-11",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Clint Eastwood"],
      "runtime": 116,
      "movieId": 3834,
      "title": "Bronco Billy",
      "mpaa": "PG",
      "actors": [
         "Clint Eastwood",
         "Sondra Locke",
         "Geoffrey Lewis",
         "Scatman Crothers",
         "Bill McKinney",
         "Sam Bottoms",
         "Dan Vadis",
         "Sierra Pecheur",
         "Walter Barnes",
         "Woodrow Parfrey",
         "Beverlee McKinsey",
         "Doug McGrath",
         "Hank Worden",
         "David Reed",
         "Alison Eastwood",
         "Kyle Eastwood",
         "George Wendt"
      ],
      "imdbMovieId": "0080472",
      "originalTitle": "Bronco Billy",
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Romance",
         "Western"
      ],
      "youtubeTrailerIds": ["oqyBr-07Eh0"],
      "plotSummary": "An idealistic, modern-day cowboy struggles to keep his Wild West show afloat in the face of hard luck and waning interest.",
      "tmdbMovieId": 21866,
      "avgRating": 2.81551,
      "releaseYear": "1980",
      "numRatings": 561,
      "posterPath": "/9eXrB9j0gwxQBPJWRp8ExgKaSy7.jpg"
   }
}