{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "portal",
            "id": 7939
         },
         {
            "name": "undertaker",
            "id": 12434
         },
         {
            "name": "evil",
            "id": 156075
         },
         {
            "name": "tall man",
            "id": 162333
         },
         {
            "name": "sentinals",
            "id": 162334
         }
      ],
      "imdb_id": "tt0095863",
      "video": false,
      "title": "Phantasm II",
      "recommendations": [
         16139,
         16146,
         9638,
         262848,
         18111,
         28260,
         8973,
         24929,
         11415,
         28090,
         37530,
         27814,
         14510,
         14240,
         36599,
         23730,
         19158,
         15762,
         13567,
         33061
      ],
      "backdrop_path": "/cd2jHPY1F5CBLl2RR6hXDP8ydOD.jpg",
      "revenue": 7282851,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe463f9251416c7507220f",
               "name": "James Le Gros",
               "profile_path": "/rqBjmSkcRGwtwpb2tTjGcqLtKyG.jpg",
               "id": 6474,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Reggie",
               "gender": 2,
               "credit_id": "52fe463f9251416c75072223",
               "name": "Reggie Bannister",
               "profile_path": "/4ayBwRs64wGiCpj2HXHGw3HIO9K.jpg",
               "id": 97939,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "The Tall Man",
               "gender": 2,
               "credit_id": "52fe463f9251416c7507220b",
               "name": "Angus Scrimm",
               "profile_path": "/tBDDTCXXybeyzDmFwAuPCb6ePCT.jpg",
               "id": 79584,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Liz",
               "gender": 1,
               "credit_id": "52fe463f9251416c75072213",
               "name": "Paula Irvine",
               "profile_path": null,
               "id": 87127,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Alchemy",
               "gender": 1,
               "credit_id": "52fe463f9251416c75072217",
               "name": "Samantha Phillips",
               "profile_path": "/pB63iEL64HPuNI31ka7wWJzoVeg.jpg",
               "id": 41978,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Father Meyers",
               "gender": 2,
               "credit_id": "52fe463f9251416c7507221b",
               "name": "Kenneth Tigar",
               "profile_path": "/sSdACkgPQYBJVQnd8B6uWpQPjMY.jpg",
               "id": 87128,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Grandma",
               "gender": 0,
               "credit_id": "57f047dcc3a3683f720060f4",
               "name": "Ruth C. Engel",
               "profile_path": null,
               "id": 1687700,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mortician",
               "gender": 0,
               "credit_id": "52fe463f9251416c7507221f",
               "name": "Mark Anthony Major",
               "profile_path": null,
               "id": 87129,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Jeri Reynolds",
               "gender": 1,
               "credit_id": "52fe463f9251416c75072227",
               "name": "Stacey Travis",
               "profile_path": "/peARleY7mDjxph4fFfeWnV4LMFe.jpg",
               "id": 31714,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Young Mike",
               "gender": 0,
               "credit_id": "57f047ed92514159de00689a",
               "name": "A. Michael Baldwin",
               "profile_path": "/gGOWFGVokrYR6u36CKrb24OwdQT.jpg",
               "id": 58240,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Background Player",
               "gender": 0,
               "credit_id": "54b8e692c3a36814110010f5",
               "name": "Irene Korman",
               "profile_path": null,
               "id": 1414115,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Background Player",
               "gender": 2,
               "credit_id": "57f047fd92514141ee00b418",
               "name": "Troy Fromin",
               "profile_path": null,
               "id": 152995,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Hooded Dwarf (uncredited)",
               "gender": 2,
               "credit_id": "57f0480dc3a3683fac00668d",
               "name": "Phil Fondacaro",
               "profile_path": "/3Ao8VPvlytIm3DWFffdSPxwxFdC.jpg",
               "id": 12662,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Hooded Dwarf (uncredited)",
               "gender": 2,
               "credit_id": "57f0481892514141db00a6d6",
               "name": "Ed Gale",
               "profile_path": "/nT29IOEnFLknnx1MccIiPug014d.jpg",
               "id": 1471,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe463f9251416c75072201",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe463f9251416c75072207",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "535f7dad0e0a264fd5007a71",
               "name": "Roberto A. Quezada",
               "profile_path": null,
               "id": 58252,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "535f7dc40e0a264fde007a0d",
               "name": "Betsy Fels",
               "profile_path": null,
               "id": 1081201,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "535f7e270e0a264fdb007774",
               "name": "Fred Myrow",
               "profile_path": null,
               "id": 58249,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "535f7e3f0e0a264fde007a18",
               "name": "Christopher L. Stone",
               "profile_path": null,
               "id": 28947,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "535f7e580e0a264fe5007d82",
               "name": "Carla Gibbons",
               "profile_path": null,
               "id": 1314882,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "54437f0ac3a3683e010043d7",
               "name": "Daryn Okada",
               "profile_path": null,
               "id": 56324,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.409139,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15158,
      "vote_count": 119,
      "budget": 3000000,
      "overview": "Mike, after his release from a psychiatric hospital, teams up with his old pal Reggie to hunt down the Tall Man, who is at it again. A mysterious, beautiful girl has also become part of Mike's dreams, and they must find her before the Tall Man does.",
      "similar": [
         9638,
         16139,
         16146
      ],
      "original_title": "Phantasm II",
      "runtime": 97,
      "poster_path": "/fv1yEUmt0LgNcOjqcBPPmezEZdo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Spacegate Productions",
            "id": 3046,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Starway International Inc.",
            "id": 3146,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1988-07-08",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": "/bu33EKctcBJvN5KHR780lWQkyJd.jpg",
         "name": "Phantasm Collection",
         "id": 47770,
         "poster_path": "/xqgAkKmQRrk0UaIbWMak4RRSQm7.jpg"
      },
      "tagline": "The ball is back!",
      "adult": false,
      "homepage": "http://phantasm.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Coscarelli"],
      "runtime": 97,
      "synopsis": "Picking up where the first movie left off, the Tall Man and his minions attempt to take Mike (James LeGros), but Reggie (Reggie Bannister) manages to save him after turning on the gas while the fireplace was on, blowing up the house. Six years later, the film introduces Liz Reynolds (Paula Irvine), a young woman with a psychic bond to Mike Pearson and the Tall Man that manifests in the form of prophetic nightmares. After she awakens from one, she looks at her dream journal, which includes drawings detailing characters and events from the first film; during this, she recalls a vision that picks up immediately where the first film ended: after the Tall Man's minions attacked Mike through his bedroom mirror, Reggie heard the commotion and ran upstairs to his aid. He tried to get a shotgun, but was attacked by Lurkers and had to flee, although he managed to surreptitiously snuff the pilot lights on the stove. Once upstairs, he dodged the Tall Man and rescued Mike, and the two dove out of the bedroom window to escape as the gas fumes reached the living room fireplace and destroyed the house. Following this, Liz pleads for Mike to find her, as she fears that when her grandfather dies, the Tall Man will take him. Having been institutionalized as delusional since the first film, Mike feels he can no longer ignore Liz's dream pleas, and fakes his recovery to obtain a doctor's release. At night, he returns to Morningside Cemetery to exhume bodies and is interrupted by Reggie who tells him that the attack at the beginning of the film never occurred. Mike reveals that the coffins he dug up are empty and urges Reggie to help him hunt the Tall Man down. En route to Reggie's house, Mike receives a vision of an impending gas explosion, and frantically tries to warn Reggie seconds before his house is consumed in an explosion, killing his wife Celeste, daughter Bonnie, and Aunt Marta. Mike's futile warning convinces Reggie that he is telling the truth and agrees to accompany Mike on his quest. They break into a hardware store at night and stock up on an abundance of supplies and tools to build weapons including a chainsaw and two double-barrelled shotguns welded together. Over the next several months, Mike and Reggie travel the country roads, encountering abandoned towns and pillaged graveyards, as well as a few traps and apparitions the Tall Man has left. One of them is an apparition of a fully nude deceased young woman. The clues lead them to Perigord, Oregon. Meanwhile, Liz's grandfather has died and she accompanies her grandmother to the funeral with her sister Jeri, who leaves prematurely and mysteriously vanishes. While searching for her, Liz explores the mortuary and discovers an exhumed coffin, but before she can open it, the Tall Man surprises her and she runs away. The presiding priest Father Meyers (Kenneth Tigar) maddened with fear and alcohol withdrawal, desecrates the grandfather's body with a knife in a desperate attempt to thwart the mysterious occurrences he has witnessed. That evening, during a bout of drinking, the reanimated grandfather surprises him at his door and then spirits into the grandmother's bed before absconding with her. In the morning, Liz finds the empty bed and a funeral pin; the Tall Man psychically tells her to return at night if she wants to rescue her grandmother. Prior to their arrival in Perigord, Mike awakens to find that Reggie has picked up a hitchhiker named Alchemy (Samantha Phillips) who eerily resembles the nude apparition. They find Perigord deserted and decrepit, and stop in an abandoned bed & breakfast before venturing out to the cemetery. Liz arrives at the mortuary to search for her grandmother, but is confronted by Father Meyers, who tries to rally her to escape with him but he is killed by a flying sphere. She encounters the Tall Man and discovers that her grandmother is now one of his Lurkers. As she escapes, she and Mike meet in the cemetery and return to the bed & breakfast, where they try to sleep. When a tripped alarm distracts them downstairs, the Tall Man captures Liz, knocks her unconscious and drives her away in his hearse. Mike and Reggie chase him in Mike's deceased brother Jody's car, but the Tall Man runs them off the road and the car explodes. At the crematorium, Liz slowly regains consciousness while being taken into the furnace room by the Tall Man's mortician assistants. She fakes unconsciousness by allowing the assistant to partially undress her and take her crucifix. She manages to fight off the mortician by sending him into an active furnace and escapes. Mike and Reggie break into the mortuary and venture into the embalming room. As Reggie pours hydrochloric acid into a tank of embalming fluid, Mike discovers that the Tall Man, having learned from his mistakes, has hidden his transdimensional portal (Spacegate) behind a heavy steel door. In lieu of a handle, there is a large round \"keyhole\" in the wall and Mike realizes that they must capture a sphere in order to access the room. They then split up to find Liz. Reggie searches the basement where he is attacked by a Graver, then four Lurkers. Mike saves Liz from a flying silver sphere but they are both attacked by the other mortician, who is defeated when the silver sphere pins his hand to a door and he cuts off the hand with an axe in an attempt to escape another sphere. A laser-armed flying golden sphere pursues Mike and Liz but instead kills the second mortician as he tries to catch them. Reuniting with Reggie, the three pry the mortician's severed hand off the door and carry the embedded silver sphere to the embalming room, where they insert it into the \"keyhole\" and open the metal door to the white room containing the portal. Reggie ignites the flamethrower to burn the building down, but the Tall Man surprises them, knocking Reggie down, throwing Mike into the portal, and carrying Liz to the embalming table. Reggie helps Mike climb back out, while the Tall Man prepares to embalm Liz alive with a giant probe; Mike pulls the silver sphere from the keyhole and attacks the Tall Man with it unsuccessfully. Liz gets free and stabs the Tall Man with the probe, and Reggie quickly activates the embalming machine, pumping the acid-contaminated fluid into him, causing him to melt. Reggie sets fire to the room and hallways and the trio are greeted at the back entrance by Alchemy, who has procured an abandoned hearse. They ride off with Mike and Liz in the rear compartment and Reggie and Alchemy in the driver's cabin. Reggie thanks Alchemy for coming back for them and tries to flirt with her until she gently plucks a section of hair and flesh from her head, revealing that she is not human. As Reggie screams, the hearse swerves wildly and Mike and Liz try to get out; the hearse stops and a bloody and battered Reggie hits the window before falling to the ground. As the hearse begins to drive away, Mike and Liz tell each other \"this is just a dream\" but the slot to the driver's cabin opens, revealing the Tall Man who tells them \"No, it's not!\" Hands break the rear window and pull Mike and Liz through it... mirroring the ending of the first film.",
      "writers": ["Don Coscarelli"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095863/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2Mzg0MDA5MV5BMl5BanBnXkFtZTcwNzQxMjU3Mg@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: James Le Gros, Reggie Bannister, Angus Scrimm | See full cast and crew »"],
      "reviews": [
         "In the tradition of other horror movie franchises, Phantasm takes the action route for this sequel. The horror and sci-fi are still there but there's more combat, stuff blowing-up and gore than there was before. I suppose it does keep things fresh but it does get a bit too tongue-in-cheek sometimes. Kinda like Evil Dead II, I'm not sure if this really fits in with the tone set by the first film. Phantasm II begins right after where the first film left off. The freaky dwarfs have invaded Mike's home and Reggie must foil the Tall Man's attempts at kidnapping him. Flash forward seven years and Mike is in a mental institution. He is released upon admitting that the whole Phantasm experience was made up only to find that in his absence the Tall Man has been plundering many of America's small towns and thousands of graves are empty. After the Tall Man kills Reggie's family in a gas explosion, Reg teams up with Mike to hunt him down and kick his head in...again. All they have to do is follow the trail of dead people, right? And this time they are ready for whatever outlandish tricks he's ready to play on them, armed to the teeth with quadruple-barrelled shotguns, flame-throwers and chainsaws. Complicating matters are Mike's inexplicable visions of the future and psychic connections to a mysterious girl he has never met before. As before, the Tall Man is the best thing in the film. Angus Scrimm is so wonderfully silent and unholy that no matter how slick and entertaining the rest of the film is he'll come out on top. Don Coscarelli was given a budget 10 times that of the original by Universal, but they did interfere with production quite a lot, much to his annoyance. They said that only one of the original cast members could return, so he chose Reggie Bannister and re-cast Mike with James LeGros (after turning down Brad Pitt!). It does kind of ruin the continuity a bit but it's not terribly distracting. They also demanded a more simple and linear story, so don't expect any of the bizarre dream sequences and flashbacks. If you're a big fan of the first this might seem disappointing but you know how studios love to think less of their audiences. The higher budget helps Phantasm to have a bigger scope than the original. The first half of the film feels like a road movie with lots of pretty scenery while the rest is kind of like a low-rent Ghostbusters/Lost Boys clone. Which sounds like a negative point, but the hokey tone of the film vanishes when it heads off into HP Lovecraft territory. If you're looking for answers as to what the first film was all about then you won't find many. In fact it raises more questions than anything else. But it's still a fun ride. I'm just kind of annoyed that the music took the more generic synth approach that was common in the 80's instead of the funky 70's beats we got before. The main Phantasm theme is still there for your enjoyment however and gets a great finish on the end credits.",
         "What is notable about PHANTASM II, is how the sequel takes a much different route than the first film. Coscarelli rather than recycling the plot of the first, instead adds a new flavour to help keep the sequel not only fresher, but also makes the film a Action/Horror road movie, rather than a surreal like Horror/Drama that the original was. When watching the film, it becomes readily apparent that the film is much higher budgeted than what Coscarelli had to work on the original film. Unlike what most film-makers would do, when working on a bigger budgeted sequel to a film of theirs, Coscarelli doesn't waste money on familiar actors, but rather sticks to casting no name, fresh faced actors in the film & spends his money more wisely on special effects & stunts & it really shows here. For starters we get a good look at the Lurkers ghoulish looking faces, zombie make-up, a mutated monster erupting from a girls back & there's a car chase. A decent car & house explosion, a chainsaw duel, better special effects & visual effects, including a gold sphere that can shoot out a laser beam that can blow up anything that moves, a drill like device that can erupt from it & this time there are three spheres! a much better done heat seeking Silver Sphere POV & an incredible melting man effect & a silver sphere burrowing under a Pallbearers spine, through his stomach & up through his throat, before getting stuck in his mouth! The set design for the mausoleums & the deserted, decaying towns & cemeteries are very well done & the \"fourbarrelled shot gun\", chainsaws & home made flame thrower weapons the hero's use are pretty awesome. Coscarelli also adds some Gothic, Hammer horrorish elements, mainly from two deathly pale pallbearers who are assisting the Tall Man in his evil quests, & Gas masked Grave Diggers. The acting is better than the first & Coscarelli again does very good behind the camera. However it's also clear when watching the film, that Coscarelli did not have as much control over this film as he did the first one, which he raised the money for himself. PHANTASM II remains the only studio backed entry to the series & as a result one can well see the studio's fingerprints all over it. For one, Mike is played by then newcomer JAMES LeGROS, who actually performs quiet well as Mike, but it just doesn't feel like a real PHANTASM movie without A. MICHAEL BALDWIN playing the role, he's really missing here & it shows. Minus REGGIE BANNISTER (who also had to audition for his role in order to keep it) & ANGUS SCRIMM & Director Coscarelli, none of the crew of the first returned here. The film has also lost it's surreal like dream quality look & feel that the original had, for a more linear approach. Also gone is the psychological undertones of the first & the mystery surrounding the Tall Man & the Dwarfs are kept as ambiguous as ever. The gore scenes also disappoint, since most of the gore footage wound up on Universal Studio's cutting room floor. PHANTASM II is virtually bloodless, minus a quick cut shot of a sliced off ear & brief blink & you'll miss them shots, of brains being drilled out via the flying spheres & shot out back of it & the puddle of blood on the floor, before said victim collapses. The gore is very watered down & we also get to see a badly charred burned hand, very briefly pass a small porthole window, on a crematorium, that one of the Pallbearer's was tossed into & Reggie thrusts a chainsaw into a gravediggers groin (off screen), a severed hand etc. It also adds a voice over narration from both Liz, Mike & Reggie. The film also introduces not one but two teen psychic characters, Mike & another girl named LIZ (PAULA IRVINE) the two eventually meet & strike up a relationship in a somewhat out of place teen love angle, that I felt again was not only out of place, but also didn't really gel well in the films story. If you were to take it out you would still have a movie, thankfully Coscarelli doesn't care for it either & doesn't spend to much time with it. There are some slow spots to be had, the introduction to Liz kind of slows down the picture. ANGUS SCRIMM seems to be having ball playing the Tall Man & plays the role with such sadistic glee, he really is a fun villain & deserves more recognition within the horror community, than what he has gotten over the years. All in all, PHANTASM II is pretty fast moving & highly enjoyable. Some people tend to prefer this over the original. To be honest I can't say I am one of them, since I prefer the original films eeriness & surreal dream like qualities to straight laced action/horror which this film is. Love the Hemicuda the hero's travel in. Look for LETHAL WEAPON'S own, KENNETH TIGAR as a priest who knows what is going on & attempts to stop the terror & a ROBOCOP tribute where we see Alex Murphy's headstone in the cemetery, but his body has went missing, since the Tall Man has had it dug up in order to shrink it to the size of a dwarf!. Love the scene where SAM (SPIDER-MAN/EVIL DEAD) RAIMI'S ashes are being put in a bag, by one for the morgue attendants. The down beat ending is utterly silly & just a re-staging of the first films closing shot, but is original & not done often (the bad guys win & the hero's wind up dying). Followed by PHANTASM III: LORD OF THE DEAD *** stars",
         "Phantasm II manages, within a minuscule budget, to nearly outdo the original film's atmosphere and scares while sticking to a more linear storyline. Despite Universal's interference and insistence on a less dreamlike narrative (the backbone of all the other Phantasms), director Don Coscarelli manages to give this installment the most polished look and measured, exciting pace of the series. While being stuck telling a more on-the-surface story than the first film, he manages to plant extremely frightening, original, surrealistic images throughout the film that stick in the viewer's mind forever(I first saw this when I was 12 in a theater, and have never forgotten it). A priest's worried look over his shoulder at his empty town; a writhing, screaming parasite burning to death.. auto parts hanging from a burning tree after a car crash..gasmasked beings carting exhumed coffins across a porcelain hallway; an abandoned mortuary..full of freshly lit candles! The stark simplicity of the doorway to the villain's homeworld. Hooded creatures storming Reggie's kitchen in the dark. And on, and on.. The story is simple enough, seven years after the original a teenaged Mike (now played by James Le Gros) is released from an asylum and is immediately drawn back into the Tall Man's game, traveling through an emptied America into a nightmare that could very well all be in his mind. This early in the series, the mysterious Tall Man is just that.. he probably has ten minutes screen time in the film, and yet the mood and pacing always make you nervous that he'll appear behind you and cart you off to be part of his experiments. Where IS he? What is he doing when we do not see him? This lack of resolution actually works for the picture's benefit, and not against it. Indeed, though Phantasm spawned an additional two intelligent, emotional sequels, as we learned more about the villain Mike and Reggie are up against, we're much less frightened of him. Angus Scrimm is at his creepiest in this installment. Reggie begins to take his place as audience favorite, a reluctant hero on par with Ash (Evil Dead) and Dr. Loomis. Le Gros does well as the buff but still doubtful Mike. Kudos to character actor Kenneth Tigar for his role as the tortured priest, who \"can't close his eyes to the things he's seen\", who manages to draw us in with his nuanced, emotional performance. He could have easily shown up to give exposition and get killed, instead he manages to keep the viewer hooked AND meet his untimely end. Full of suspense, scares, and action, Phantasm II may not be the mindbender of the original, but it's no a less worthy chapter of the most surrealistic, thought-provoking horror series ever created.",
         "While it isn't the iconic horror film it's predecessor was, Phantasm II is backed by better production values, a cool apocalyptic premise and a stand-out improvement in James LeGros replacing Baldwin. There is a reason why LeGros has appeared in a great deal more than Baldwin (including a hilarious parody of Brad Pitt in Living in Oblivion) and shows it here in spades. Frankly I feel this was as good or better than the first but the required shock ending that punctuates each of the films in this series has grown tiresome and makes each feel like they do not truly stand on their own as their own experience. Nevertheless, the entire series is original, imaginative and involving. Phantasm II really should have capped off the series with it's big budget backing, as the very next film in the series felt a lot like Alien 3 where the film picks up characters from the second film discarded in a very unfortunate and disappointing manner...but I digress. Phantasm II is solid, quad barrel shotgun monster blasting fun and a must see for monster movie fans everywhere!",
         "I saw \"Phantasm II\" before watching any of the other Phantasm movies, and despite its shortcomings, it converted me into a fan of the series. While it has an effective atmosphere and an interesting array of characters, the plot certainly could have been more carefully written. There is one part where Mike risks his life handling a very dangerous flying sphere and uses it as a key to open some weird door, but the movie fails to show the purpose of opening that door. Sure, it shows you what lies behind the door, but that's it! Mike and his friends don't really do anything in there! Also, the Tall Man goes through the trouble of luring Liz into a trap, but he just throws her against a wall once he catches her. If Liz was such a threat to his evil plans (as the plot asserts), then wouldn't the Tall Man want to make sure she's dead? Still, when you have a couple psychics, an ex-ice cream vendor, a mysterious hitchhiker, an army of dwarves, flying spheres and a rather omnipotent--and scary-looking--old guy called the Tall Man rolled into one picture, the movie promises to be interesting, and it delivers for the most part. Compared to the other Phantasm movies, I liked \"Phantasm II\" better than \"Phantasm III\" and \"Phantasm: Oblivion,\" but it's not quite as good as the original Phantasm.",
         "I can't explain in words how much I love the Phantasm series. Each film is a direct continuation of the last and each time we get answers to questions about The Tall Man while at the same time more are being asked. Phantasm II is probably my fave in the series not because of the action (most phans say it's the most action packed but I think part III holds that honor) but really this is the only one where Reggie and Mike are side by side and in my opinion thats why it's the best (in all the others Reggie being the horn dog he is is trying to find mike AND get laid...which is still cool). I can't believe that no other phans have mentioned how much Phantasm II mirrors Evil Dead 2 (I know they've had to notice it) that however is not a problem cause right next to the Phantasm series is the Evil Dead series. Just look at it and you will see what I'm talking about. Phantasm II follows Evil Dead 2 by going into comedy at times, others have complained that Phantasm III had comedy but they for some reason they forget II did also....it just wasn't as campy but still was funny, like when Reggie beat a dwarf creature into pieces by going crazy on it with the end of a shot gun or the look on his face when Alchemy is riding him and smacks him on top of his head and when he pulls a chainsaw on the graver at the end only for the graver to pull out a really LONG chainsaw...and of course just about everything Reggie says is funny. And like Ash getting equipped with his chainsaw in ED 2 Reggie gets his now trademark 4-barrel shotgun, and the scene where the mortician gets a sphere in his back and bounces all over the room makes me think of ED 2. But believe me Phantasm II is not a copy cat of ED 2. It still has some creepy stuff in it like the scene where the grandfather is getting his mouth sewn up. But this movie screams atmosphere more than anything, with it's great score and visual style really helping to push that home. All the actors give great performances and The Tall Man is the ultimate villain thanks to a great creepy performance by Angus Scrimm...all he's gotta do is twitch an eyebrow. Also the scene where the priest gets it is really cool (you can tell that the MPAA made them trim it though but thats just my opinion). But I think what really separates this horror series from most is that in almost all the other you root for Freddy, Jason, or Michael Myers and even though I love The Tall Man (God bless you Mr. Scrimm) Reggie is without a doubt THE man. Some people may have Indiana Jones or any of those guys as their fave characters but mine will always be Reggie (played perfectly by Reggie Bannister) along with the Ash character from Evil Dead (Bruce Campbell...need I say more), Herbert West from the Re-Animator series (Jeffrey Combs...one of the funniest actors around) and the best character Kurt Russell (no introduction needed) EVER played....no it's not Snake Plissken...but Jack Burton from the great Big Trouble in Little China. Sorry for going off on a rant there just wanted you to know. Anyways Reggie is the glue that holds the series together. Why Universal has not put this and part III out on DVD is beyond me, yet they will do another DVD edition of The Mummy remake. I think the reason this series is not as well known is because of the studio's killing it's chances (check out the web site on how they released Phantasm II) and instead of going in different directions to gain mass appeal (like the Elm Street series....which if I'm right Don Coscarelli was offered to direct part 2...the most under appreciated of that series) the Phantasm series as they went (and hopefully go) on tried to please it's core audiance. And the series keeps the same characters through out so you really care for these guys and like them want to know what the hell is going on. I love these movies more than any other series and hope they are continued to be made. Hopefully we will see that Roger Avary penned script be made into a movie soon.",
         "In 1979, Don Coscarelli wrote and directed the surreal horror classic, \"Phantasm\". His film used great special effects and a very creepy score by Fred Myrow (\"Soylent Green\", \"Rubin and Ed\"). Nine years later, Coscarelli teamed up with actors Reggie Banister and Angus Scrimm again to make the appropriately titled, \"Phantasm II\". While certainly not as creepy as the first film, \"Phantasm II\" is certainly very fun. Coscarelli was able to use better special effects than in the first film and it certainly is noticeable. Also, this sequel goes with the \"Evil Dead II\" logic of \"bigger is better\". Chainsaw duels and explosions are added, not to mention an arsenal of extremely cool weapons including a home made flamethrower and a really cool double shotgun. But bigger is not always better... One problem that this film has is that it does not capture the \"coming of age\" theme that the first film has. While this is understandable because all the characters have aged nine years, the feeling the first film had of \"investigating something creepy in town\" is something we can all relate to. \"Stand by Me\", \"Blue Velvet\", and the first \"Phantasm\" all used this very appropriately, but I only wish that the sequel did as well. Another problem I have is that the character of Mike is so different. In the first he was a curious youngster (similar to Jeffrey Beaumont in \"Blue Velvet\") but he is much different in this film, as he is much more level headed. However, it is better that his character has changed because he fits the mood of this film. \"Phantasm II\" is not a spectacular film, but I really do enjoy it, and that's why I rate it a nine out of ten. It is a rather different film from the first, but is still extremely fun, and that's the reason why I rate it as one of my favorites. Don't go expecting the same mood of \"Phantasm\", but rather the mood of \"Army of Darkness\"... THIS MOVIE GETS BONUS POINTS FOR... Angus Scrimm, great special effects, creepy soundtrack",
         "While many may argue that this is a superior movie to the 1979 original (all about \"The Tall Man\",his killer dwarfs and the flying spheres of death) it suffers in a number of small ways when compared to the rest of the series. The main problem, although he does very well in the role, is the casting of James Le Gros. A decent actor and he handles all of the surreal horror well but he's just not the same lad we travelled alongside in the first movie and that DOES make a difference when the other, familiar faces are being played by the same people (namely, Angus Scrimm as \"The Tall Man\" and Reggie Bannister as Reggie). The other problem, and one that would crop up in every future instalment, is the way that Coscarelli paints himself into a corner and then has to contort his way out of it. Perversely, this makes for some added entertainment value at the same time but it does throw up a number of jarring inconsistencies and moments that take you out of the scary world you were immersed in. The plot throws us straight back into pursuit mode as young Michael and Reggie pursue \"The Tall Man\", finding evidence of his presence in many American small towns and always getting close but not quite close enough until, conveniently, nearer the end of the movie. Along the way, we learn a little bit more about the plans he has and the practices he has in place to make them become a reality. Paula Irvine and Samantha Phillips add some enjoyable female company this time around but they're really not given that much to do (at least, not until the fun finale). Phillips, especially, is basically used as an exposition tool although it's certainly a unique way to get characters up to speed. As things veer ever closer to the ridiculous you have to make a conscious decision to either go along with the movie completely or to let things like realism and logic ruin your enjoyment. I went with the former option and had a lot of fun that way. See this if you like: Phantasm, Bubba Ho-tep, Evil Dead II.",
         "Decided to tape this film early in the AM television programing and was greatly surprised at the entire plot. If you love graveyards, and watching steel balls flying through the air that can make your insides turn in a few minutes to Swiss Cheese, this film is definitely for YOU! James LeGros,(Mike),\"Sexual Life\",'04 and Paula Irvine(Liz),\"Party Lamp\",'86 put their hearts and soul into their roles and experienced horrible situations you will never forget. I missed all the other Phantasm flicks,however, I do intend to catch up and view all the present and past other Horrible \"Phantasm\" films. If you are a nut about blood and seeing human bodies crumble in front of your very eyes, THIS IS YOUR FILM! ENJOY!!!",
         "Phantasm II, with its robed, evil midgets and flying mini-saw wielding spheres, is a film that delivers the goods. We've got a chainsaw dual, cool characters in the Reg-man, Mike, and the Tall Man, and a hell of a lot of action!! Right from the opening title when you hear the atmospheric theme (which is amazing by the way), the tone is set and you know you're in for something special. With the help of some dark and fantastical imagery, the story is laid out. Mike and Reggie are hunting down the Tall Man, a mysterious undertaker from another world who plunders graveyards and carts the dead off to be crushed into evil slave midgets. The movie strikes a chord with some of its imagery, especially those of embalming. What better way to be reminded of your mortality than to see a cadaver having his mouth sewn shut, and later another being drained of his blood and pumped with chemicals? Perhaps the Tall Man sums it up best when he says, \"You think when you die you go to heaven? You come to US!!\" It may make you uncomfortable to think about such things, but that is the point, at least partially. Don't get up to get a beer on this one either. The movie has such a quick pace, you'll be left behind and might miss one of the many memorable scenes: Reggie and Mike walking through an empty graveyard, Father Meyer's encounter with a sphere, the quad-barreled shotgun, or the aforementioned chainsaw dual!! All in all, Phantasm II is a film that surpasses its predecessor (itself a classic) and takes you on a 90-minute roller-coaster ride. It's fun, action-packed, and above all, highly entertaining."
      ],
      "genres": [
         "Action",
         "Fantasy",
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Spacegate Productions",
         "Starway International Inc.",
         "Universal Pictures"
      ],
      "summaries": [
         "Mike is released from psychiatry, when he agrees with the doctors that the terrible happenings in his past were just in his imagination. But once he's free, he contacts Redge and they team up to hunt down and eliminate the \"Tall Man\", who plunders the graveyards and abducts the sleeping with help of his terrible gnomes. A beautiful strange girl starts to appear in Mike's dreams. He assumes she's in danger and needs their help - will they find her before the Tall Man can do her any harm?",
         "Mike, following his release from a psychiatric hospital, teams up with old pal Reggie to hunt down the Tall Man, who is at it again. A mysterious, beautiful girl has also become part of Mike's dreams, and they must find her before the Tall Man does. They reach an Oregon cemetery that has had all the bodies dug up and removed. Realizing this is the work of the Tall Man, they venture inside armed heavily. But the Tall Man still has his deadly flying spheres - and a couple of cronies who will stop at nothing to keep their evil plans a secret.",
         "Mike, now released from a psychiatric hospital, continues his journey to stop the evil Tall Man from his grim work."
      ],
      "budget": 3000000
   },
   "movielensId": 3837,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-07-08",
      "dvdReleaseDate": "2009-09-15",
      "directors": ["Don Coscarelli"],
      "runtime": 97,
      "movieId": 3837,
      "title": "Phantasm II",
      "mpaa": "R",
      "actors": [
         "James Le Gros",
         "Reggie Bannister",
         "Angus Scrimm",
         "Paula Irvine",
         "Samantha Phillips",
         "Kenneth Tigar",
         "Ruth C. Engel",
         "Mark Anthony Major",
         "Stacey Travis",
         "A. Michael Baldwin",
         "Irene Korman",
         "Troy Fromin",
         "Phil Fondacaro",
         "Ed Gale"
      ],
      "imdbMovieId": "0095863",
      "originalTitle": "Phantasm II",
      "genres": [
         "Action",
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["3LHizNyn8Tc"],
      "plotSummary": "Mike, after his release from a psychiatric hospital, teams up with his old pal Reggie to hunt down the Tall Man, who is at it again. A mysterious, beautiful girl has also become part of Mike's dreams, and they must find her before the Tall Man does.",
      "tmdbMovieId": 15158,
      "avgRating": 2.78863,
      "releaseYear": "1988",
      "numRatings": 466,
      "posterPath": "/fv1yEUmt0LgNcOjqcBPPmezEZdo.jpg"
   }
}