{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "mausoleum",
            "id": 162332
         },
         {
            "name": "tall man",
            "id": 162333
         },
         {
            "name": "sentinals",
            "id": 162334
         },
         {
            "name": "mortuary",
            "id": 162335
         }
      ],
      "imdb_id": "tt0110823",
      "video": false,
      "title": "Phantasm III: Lord of the Dead",
      "recommendations": [
         16146,
         15158,
         262848,
         9638,
         27815,
         27816,
         18111,
         28090,
         26959,
         28260,
         26956,
         24341,
         18256,
         26954,
         11429,
         29794,
         14240,
         37530,
         8973,
         19158
      ],
      "backdrop_path": "/rSsDcfGCY5VMSy0Xb04Hl7UI1fl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mike",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f70b",
               "name": "A. Michael Baldwin",
               "profile_path": "/gGOWFGVokrYR6u36CKrb24OwdQT.jpg",
               "id": 58240,
               "order": 0
            },
            {
               "cast_id": 22,
               "character": "Reggie",
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f76d",
               "name": "Reggie Bannister",
               "profile_path": "/4ayBwRs64wGiCpj2HXHGw3HIO9K.jpg",
               "id": 97939,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Jody",
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f70f",
               "name": "Bill Thornbury",
               "profile_path": "/2NxCvwkJdpEuZ995uE3PPzoW93X.jpg",
               "id": 58241,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Rocky",
               "gender": 1,
               "credit_id": "52fe46a99251416c7507f713",
               "name": "Gloria Lynne Henry",
               "profile_path": "/oltO7ytuIwTKsoZfNq56I2p5Lyt.jpg",
               "id": 79581,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Tim",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f717",
               "name": "Kevin Connors",
               "profile_path": null,
               "id": 79582,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Edna",
               "gender": 1,
               "credit_id": "52fe46a99251416c7507f71b",
               "name": "Cindy Ambuehl",
               "profile_path": "/dzxVT04oxEZhYidDi9faAu2kmyX.jpg",
               "id": 79583,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f71f",
               "name": "John Davis Chandler",
               "profile_path": "/66egeP4tNoXacifMfuzRuewcrRN.jpg",
               "id": 32786,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Rufus",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f723",
               "name": "Brooks Gardner",
               "profile_path": null,
               "id": 35162,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "The Tall Man",
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f727",
               "name": "Angus Scrimm",
               "profile_path": "/tBDDTCXXybeyzDmFwAuPCb6ePCT.jpg",
               "id": 79584,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Demon Nurse",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f72b",
               "name": "Irene Roseen",
               "profile_path": "/hORHT27sB0nNBCqt3umdCjzNd6j.jpg",
               "id": 79585,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Tanesha",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f72f",
               "name": "Sarah Scott Davis",
               "profile_path": null,
               "id": 79586,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "Motel Owner",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f733",
               "name": "Duane Tucker",
               "profile_path": null,
               "id": 79587,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "Tim's Mother",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f737",
               "name": "Claire Benedek",
               "profile_path": "/jf8cE63QhxcCXRuc60Dmcc3eJsG.jpg",
               "id": 79588,
               "order": 12
            },
            {
               "cast_id": 13,
               "character": "Woman at Orphanage",
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f73b",
               "name": "Wendy Way",
               "profile_path": null,
               "id": 79589,
               "order": 13
            },
            {
               "cast_id": 14,
               "character": "Gas Station Attendant",
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f73f",
               "name": "Robert Beecher",
               "profile_path": "/8uYs1ZA7aQhx5UneheV19QkMv89.jpg",
               "id": 79590,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f745",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f74b",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f751",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f757",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f75d",
               "name": "Seth Blair",
               "profile_path": null,
               "id": 79591,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a99251416c7507f763",
               "name": "Fred Myrow",
               "profile_path": null,
               "id": 58249,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a99251416c7507f769",
               "name": "Christopher L. Stone",
               "profile_path": null,
               "id": 28947,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "535f80cc0e0a264fdb0077b6",
               "name": "Jacklynn Briskey",
               "profile_path": null,
               "id": 1314884,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "535f80e70e0a264fe8007a0b",
               "name": "Chris Chomyn",
               "profile_path": null,
               "id": 1273938,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "535f80fc0e0a264fde007a5b",
               "name": "Carla Gibbons",
               "profile_path": null,
               "id": 1314882,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.547035,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16139,
      "vote_count": 72,
      "budget": 2500000,
      "overview": "The Tall Man, that imposing menace from Morningside Mortuary, is back and once again haunting the thoughts of the now-adult Mike and his friend, ex-Ice Cream vendor Reggie. The two continue their hunt for the mysterious figure and in his path of destruction encounter a variety of dangerous situations, friends and enemies.",
      "similar": [
         485415,
         24920,
         72190,
         19908,
         336843,
         82654,
         766,
         16288,
         10925,
         13648,
         8408,
         24935,
         923,
         16281,
         24929,
         400136,
         19204,
         273477,
         9638,
         241842
      ],
      "original_title": "Phantasm III: Lord of the Dead",
      "runtime": 91,
      "poster_path": "/l8ccrv8XDD727vD3V3qntjrMoox.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Starway International Inc.",
         "id": 3146,
         "origin_country": ""
      }],
      "release_date": "1994-05-06",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/bu33EKctcBJvN5KHR780lWQkyJd.jpg",
         "name": "Phantasm Collection",
         "id": 47770,
         "poster_path": "/xqgAkKmQRrk0UaIbWMak4RRSQm7.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://phantasm.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Coscarelli"],
      "runtime": 91,
      "synopsis": "Immediately after his apparent demise at the end of Phantasm II, a new Tall Man emerges from the white room dimension fork. During this time, the hearse driving Liz and Mike carries on and explodes. Reggie, who was attacked by the Alchemy/Tall Man creature, rushes over and finds Liz dead and a dwarf devouring her face. After killing a few dwarfs with his 4-barrel shotgun, the Tall Man appears, apprehending Reggie and an unconscious Mike but leaves when Reggie threatens to detonate a grenade. Stating that he wants Mike in one piece, the Tall Man leaves with Liz's head in hand claiming to return for Mike when he's well again. After apparently spending two years comatose in a hospital, Mike has a near death experience, in which his brother Jody appears and tells him he's not ready to cross over into the light. Mike walks on but the Tall Man stands in his way causing him to wake up. Just as Reggie arrives, Mike is attacked by a demon nurse but fights her off. A sphere emerges from her head and crashes out through the window. Back at home, Jody appears again to warn Mike but the Tall Man arrives via dimension fork, fights off Reggie and Jody (now forcibly transformed into a charred flying sphere) and draws Mike through the gate with him. The next morning, Reggie (with the Jody-sphere) travels to the small town of Holtsville, which turns out to be deserted. Reggie is captured by three looters who lock him in his Cuda's trunk and drive on to another house. There they are attacked and killed by a little boy named Tim, who also releases Reggie. After they have buried three looters in the yard, Tim tells Reggie how the Tall Man took his parents and destroyed the town. In the morning, Reggie and Tim find the three graves empty and their pink hearse gone. Setting out to find the Tall Man, Reggie wants to leave Tim with a woman looking after orphans but the boy hides in the trunk and comes along. Reggie enters the Holtsville mausoleum and is confronted by a sphere. Before he can destroy it, he is assaulted and subdued by two young black women, Tanesha and Rocky. Reg tries to warn them but the sphere kills Tanesha, as well as damaging Rocky's nunchaku. Tim appears and shoots it out of the air with his pistol. The three join forces and drive on, looking for a town called Boulton, which contains a large mortuary. On their way the come across a convoy of hearses driven by gravers and follow them. As they camp outside, the Jody-sphere floats over to Reggie. In a dream, Jody appears and leads Reggie to the Tall Man's lair, where Mike is imprisoned in a small cell. The two free him but the Tall Man reappears and pursues the three. Jody is transformed back into a sphere and Reggie awakes. Jody appears again, opens another gate and Mike emerges. The Tall Man tries to emerge as well but Reggie manages to shut the gate just as he was about to reach through, cutting off the Tall Man's hands. They manage to fight off the small creatures the hands morph into and also later the pink hearse containing the three comically-zombified looters. They reach Boulton mortuary, where they come across a cryonics facility, which reminds Mike that the Tall Man dislikes cold. While Reggie, Rocky and Tim are separately attacked by the looters, Mike consults with the Jody-sphere, who explains that the Tall Man is amassing an army to conquer dimensions. He also shows him in a dream what the Tall Man does with the dwarf creatures he has created from the dead: he removes the sapient part of the brains to create the spheres, turning the body into a drone and the mind into a killer. The Tall Man senses their presence and before they can leave, and paralyzes Mike. Surrounded by hundreds of spheres, the Tall Man reaches for Mike, who wakes up and finds himself strapped to the table. The Tall Man grabs and subdues the Jody-sphere and welcomes Mike. Soon after, two of the looters, Rufus and Henry, wheel in Tim. Mike tries to give a message to the boy, saying \"There are thousands of them\", but is paralyzed beyond speech by the Tall Man. Rocky meanwhile manages to shake off her attacker and goes on to fight off Reggie's. Cut free by the Jody-sphere, Tim runs into the remaining looters who are killed by the Jody-sphere and Reggie's 4-barrel shotgun. The trio crash into the embalming room, where the Tall Man has begun operating on Mike. Rocky impales the Tall Man with a spear dipped in liquid nitrogen, causing his flesh to begin melting. Rocky and Reggie lock him into the refrigerator room. A golden sphere breaks out of his head, crashes outside and chases through the corridors. Surprised by the golden sphere, Reggie catches it with a plunger and is almost overpowered by it. With help from Rocky and Tim, he submerges the sphere in the nitrogen tank neutralizing it. In the meantime, Mike climbs from the table and sees yellow blood issuing from his wound. He looks into a mirror and sees a golden sphere in his own head, concealed his torn skin. Just after the Tall Man's sphere has been dumped into the nitrogen, Mike appears, showing silver eyeballs, complaining of the cold and walking outside. Reggie chases after him but Mike warns him to stay away. Jody leaves as well telling Reggie that they'll be in touch. Reggie suggests searching the mortuary but Rocky leaves having had enough of dealing with the undead. Reggie and Tim go back inside and Tim reports that Mike said that \"There are thousands of them.\" Unknown to them, dozens of spheres are hovering above them. In the next room, Tim finds the poles of the dimension fork and the nitrogen tank overturned. He goes back to find Reggie pinned to the wall by force of the spheres. Tim tries to get his gun but a new Tall Man reappears and watches as Tim is pulled through a window by a creature followed by the sound of him getting torn apart and killed... continuing the films' trademark ending.",
      "writers": ["Don Coscarelli"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110823/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwOTU5MDM2OV5BMl5BanBnXkFtZTcwOTI4ODM0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Reggie Bannister, A. Michael Baldwin, Bill Thornbury | See full cast and crew »"],
      "reviews": [
         "Phantasm III keeps its promise of continuing with the Phantasm story and the Phantasm characters. Mike and Reg are back - and so is Jody from the first Phantasm. And let's not forget one of the creepiest screen villains in the last 30 years - Angus Scrimm as the ubiquitous Tall Man. This time around Reg and Mike continue to battle the Tall Man from the last scene in Phantasm II - eventually Mike is kidnapped and Reg finds some new pals - an eleven year old that has holed himself up in his house whilst battling intruders and killing many of them as well as a martial arts using woman with that Grace Jones look and the sizzle of speech that a film like this needs sometimes. We get the spheres, the mausoleums, the suspenseful, frightening scenes you know are coming but still are ill-prepared for, and some imaginative script-telling and directing from Don Coscarelli. Phantsm III has all that one might look for in a sequel like this and keeps the Phantasm flame burning gloriously brightly. The acting is as always very solid. Reggie Bannister is particularly good in his reprising role, and let's face it when Angus Scrimm says, \"BOY!\" that he makes even the most lithe heart beat a bit faster. Some of the plot elements like the little eleven year old are somewhat far-fetched as the three thugs in living and non-living form became tiresome. The layout of the film with its vast empty towns and sense of decay in the American heartland as well as the hugely reverential-look given to the mausoleum showcase Coscarelli's skills as a director with a wonderful eye for detail.",
         "Why did it take me so long to get into the \"Phantasm\" films, as just in the last two months I got around to seeing the first two films and now the third entry. So far I've enjoyed every one. While I found the quality of this entry not match the previous two, still it's an entertainingly non-stop ride in the quest to stop the Tall Man. It pretty much follows on from the previous edition, capping off that had just transpired. The road trip continues through small rural towns, where an almost apocalyptic feel is crafted. Nonetheless the adventurous tone is there, but it's leaning more for comic humour and flat-out action (in a way similar to the second entry), over the tripped-out atmospheric spookiness. It's Reggie Banister's show and there's nothing wrong about that because he makes for a likable heroine that's easy to root for. A. Michael Baldwin isn't in it as much (which the chemistry between Mike and Reggie isn't as prominent) and Bill Thornbury reprises his role in rather an innovative manner. Two new ragtag characters find there way in to help out Reggie; played by Gloria Lynne Henry and Kevin Connors. These two bring biting persona's. Angus Scrimm in Tall Man mode is as menacing as ever - in appearance and the voice --- \"It's time now BOY\". Director / writer Don Coscarelli keeps the unique vision alive, where his handling seems more focused (especially the writing) and complete, but competently staged with enough flair and panache in numerous sequences. After the last film was produced by a film studio, this entry would go back the low-budget independent roots. The unconventional story isn't as complicated, but this clip show is always on the move and is tension grabbing in its varied ideas. The lively special effects and make-up FX were effectively executed, where it becomes more and more a centre piece with the lethal flying spheres, dimension portals and the legion of dead serving under the Tall Man.",
         "With the removal of studio interference we get the return of A. Michael Baldwin to the lead role alongside series regulars Reggie Bannister and Angus Scrimm as our intrepid heroes continue to chase down (or, indeed, are actually taken away by) \"The Tall Man\" and try to figure out a way to stop him once and for all. We have a few new characters (and one character we thought we would never see again, played yet again by Bill Thornbury) thrown into the mix, including a young kid who appears in a bizarre, and gory, riff on Home Alone and some more of them pleasing womenfolk we like to see appearing in our genre outings. More characters and even more revelations does not stop Coscarelli filling every scene with the fruits of his unbelievably fertile imagination and fans of the series should not be worried; this features even more bizarre moments of horror, even more carnage from the killer spheres and even more blood and guts nastiness. As I said in reviewing the first movie, and as applies equally here, \"Phantasm\" is really a Ghost Train ride of a movie. They may lose their edge slightly as the heroes continue to escape ever-increasing perils and Coscarelli has to once again magic up some explanation for a character's survival but they remain top-notch entertainment and great fun for fans. See this if you like: Phantasm, Phantasm II, Bubba Ho-tep.",
         "\"Phantasm III: Lord of the Dead\" is a pretty inventive and fun sequel. Following \"Part II\", this time Reggie (Reggie Bannister) is continuing his search for the Tall Man to stop him from his deadly work. Mike (Michael Baldwin) is captured by the Tall Man after falling into a coma, and now it's up to Reggie to save him. With the help of Jody (who is mainly in the form of a silver sphere now) and some others that he picks up along his journey, including a young boy named Tim (Kevin Connors) and a woman from the Army, Rocky (Gloria Lynne Henry), Reggie begins a relentless search for the Tall Man's current location, where he has Mike, and what he plans to do with him. A different but very entertaining entry, \"Phantasm III\" is a very fun film. It differs in style quite a bit from the previous movies, but it seems like that's a trend in this series. \"Phantasm\" had it's own kind of surreal style, \"Phantasm II\" had a similar surrealism but had much more action, and \"Phantasm III\" is more of a slamming, action-packed horror adventure, with a more mild dose of mysticism and a lot more gore. It's a different kind of film from the rest, and since the style is so much different from parts I and II, I think that is the primary reason that people didn't enjoy it. I personally do miss the surreal atmosphere, which I felt this film was distinctly lacking, but it still has enough strangeness and bizarre nature to keep me happy. There is some humor thrown into the mix as well, which seemed a little strange I suppose, but was likely there for some comic relief amidst the out-of-this-world premise. Anyhow, the comic scenes aren't blatantly funny, but do get a little snicker from the audience. The only problem I have with it is that it seems to draw away the seriousness of the story, thus making it less frightening, which wasn't good. The storyline gives more explanation about The Tall Man which is needed, but I did feel this movie had almost too many villains. Not only do we have The Tall Man plus his dwarve-creatures and army of spheres, but we also have a trio of thieves that Reggie stumbles upon, who end up as zombies that continue as antagonists throughout the film. I felt that was a little unnecessary, but I'm not going to nitpick too badly. I enjoyed the scenery in this movie and the sci-fi elements are brought through a bit more here, but I was very, very pleased with the final thirty-minute showdown in the huge, Gothic mausoleum. That really brought things home - it was a magnificent, extremely spooky set, and was the perfect place for some good scares and action scenes to unfold. This sequel has more gore, so that means more special effects, which were done very well, I must admit. Lots of sphere attacks and some really clever, unusual death scenes make for a good time, and a nice display of what the special effects creators have to offer. Acting-wise, we have Michael Baldwin returning as Mike (he was replaced by James LeGros in Part II), and Billy Thornbury returning as Jody, so having all the original cast members back was a major positive. Reggie Bannister is great as well as the quirky but likable Reggie. And while I thought the new character of Rocky almost seemed misplaced (kick ass Army chick with an attitude), I liked her a lot and I thought the actress portraying her did a great job. Overall, \"Phantasm III: Lord of the Dead\" is a sequel that has it's share of problems, and differs a lot in style from the other movies. But, it is an energetic and fun continuation of the story that has enough positive points that make it well worth a watch, especially for all those \"phans\". It's weirdly funny at times and creepy and dark at others, but I enjoyed it a lot despite it's flaws. Some may not like it because of the different style and path that it takes, but I thought it was a really fun sequel. 8/10.",
         "Most people note the humor in this picture as a downfall to the series... or the zombies which were never before seen. but what people don't know is that all the writing and strangeness has already been pre-thought out by series creator Don Coscarelli. If you want you could call this a fault on the series, but in my opinion as long as the original creator is coming up with the ideas it's alright, because he's the inventor of the franchise, he can do what ever he wants... he can't ruin the mythology of the Tall Man he can only expand it. the good things about this film are the magnificent return of the original Mike Pearson (A. Michael Baldwin). Plus Bill Thornbury Mikes brother Jody. All the action, Set Decoration, SETS IN GENERAL... THE CHARACTERS... THE STORY, and the surprises. i don't want to go into too much detail on the plot because i don't want to spoil it for you... but the reasons most people give this movie flak are stupid. when you watch this film compared to the others you will see a big difference, this movies is in a little way the epic phantasm movie... seeing the building of the 'warriors' with Reggie and his crew... and the final battle... they could have ended the series with this one, but Coscarelli has bigger finale plans for his phantasm fans and we just might see that sooner then you think. i hope this helps.",
         "Picking up after the dreary and depressing Phantasm II ended; The Tall Man kidnaps Mike, while Reggie and new kid Tim spend most of the rest of the movie trying to get him back, and not end up as slaves on the Tall Man's \"Red Planet\". This isn't as violent and gory and part II, it goes overboard with comedy, and ends up silly and inane: the trio of thieves in the bright pink hearse were only there for comic relief, and the black karate chick (I can't even remember her name) was so irritating I couldn't wait to see if the Tall Man killed her character. One of the story's most clever bits is when it sets it up to almost look like it was going to be Tim's character, who comes in late and ultimately is the hero, but ... it doesn't quite work out that way. By the very end of this story, Liz is beheaded by the killer midgets, Mike gets a silver sphere implanted into his skull, the spheres get Reggie, and the dwarfs get Tim, and there's no one left to stop The Tall Man. The bad guy wins, and - \"It's never over\" How's that for a surprise twist at the end? Impressive set designs in the mortuary are an asset, but the film can't balance the humour and horror nearly as much as it wants to, and it ends up looking almost satirical. That ending was, at the time, final, and although it's disappointing and anticlimactic, it was also a fitting and appropriate ending for this weird little series. Filmed in 1993, unreleased for about a year and a half upon completion.",
         "Phantasm ....Class. Phantasm II.....awesome. Phantasm III.....erm.....terrible. Even though i would love to stick up for this film, i quite simply can't. The movie seems to have \"sold out\". First bad signs come when the video has trailers for other films at the start (something the others did not). Also too many pointless characters, prime examples the kid (who is a crack shot, funny initially but soon you want him dead), the woman who uses karate to fight off the balls (erm not gonna work, or rather shouldn't) and the blooming zombies (what the hell are they doing there, there no link to them in the other Phatasms). Also there is a severe lack of midgets running about. The only good bits are the cracking start and, of course, Reggie B. (Possible SPOILER coming Up) To me this film seems like a filler between II and IV as extra characters just leave at the end so can continue with main 4 in IV. Overall very, VERY disappointing. 3 / 10",
         "Like the other Phantasm movies, \"Phantasm III: Lord of the Dead\" has a colorful--arguably a little TOO colorful--set of characters. A kid with absolutely incredible marksmanship skills? A man who can transform into a small flying sphere and back again? Three zombies that look like rejects from a Quentin Tarantino movie? Adding to the whackiness is the plot itself. The Tall Man kidnaps and hides Mike inside a wall for a while; Reggie and Jody (the transformer) rescue him, and then hide out in \"the largest mausoleum in the western U.S.\" Their hiding plan sounds crazy enough to work, but it doesn't work and Mike gets caught again. Tall Man performs a little brain surgery and Mike can bleed yellow and make his eyes turn silver now. Reggie finds out that the Tall Man has a lot of balls and gets nailed to the wall while some dwarves take that Tim kid away...Now try to explain all that with a straight face. Overall, it's a quirky, decent movie worthy of a 7 rating (10 being the highest). If you like some insanity mixed with horror/gore in your movies, then \"Phantasm III\" should be right up your alley, as well as the insanely funny gore-fest \"Dead Alive.\"",
         "Continuing off \"Phantasm 2\", Reggie (Reggie Bannister) just lost Mike (Michael Baldwin) to that evil being called Tall-Man (Angus Scrimm). That evil Mortician creates more sentinels such as his zombie-esquire dwarfs, the living dead and his famed flying brain-drilling spheres are sent to kill people in small towns as he invades them then possibly the world to take over. Reggie joins with orphaned 11 year old Tim (Kevin Conners) and feisty militant woman Rocky (Gloria Lyn Henry) to ward off the Tall-Man's minions and try find out his secret. Another exciting installment of the unique Sci-fi horror fantasy saga \"Phantasm\" from writer and director Don Coscrelli. This one gives us some decent performances with a dose of dark humor throughout, the surprises are also creative as well much like the first two and there's some gore in this installment that should please fans. This one is pure fun from beginning to end, a must see for fans of horror and the series.",
         "i remember being pumped up about seeing the original cast of mike and jody returning to the phantasm series but being just as dissapointed with this 3rd installment.for one you have too many villains to deal with.it's not just the TALL MAN but these hoodlums which eventually turn into zombies working for the tall man.the TALL MAN doesn't need any more people helping him other than those dwarfs and it just takes away from his character.the spheres are back and just as impressive but this film is just a liitle too campy and does not satisfy your loyal phanatics like myself.the little boy character was a nice addition so he could tag along with reggie and help our hero, but the rocky character should have been left out.it is somewhat humorous watching reggie trying to snag her throughout the flick.good special effects for a low-budget movie and somewhat entertaining but not containing any real suspense and that weirdness factor if you will that the first one had and the second one had as well.definately the weakest in the series but does get you ready for the fourth one {OBLIVION}which is considerably better. by the way from the second to the third film i notice that reggie has been forking out some major cash without having any kind of job, i guess a retired ice cream vendor could have some kind of stash hidden away for retirement."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Starway International Inc."],
      "summaries": [
         "The Tall Man, that imposing menace from Morningside Mortuary, is back and once again haunting the thoughts of the now-adult Mike and his friend, ex-Ice Cream vendor Reggie. The two continue their hunt for the mysterious figure and in his path of destruction encounter a variety of dangerous situations, friends and enemies. They also must contend with the resurrected dead plus a growing number of the infamous and deadly silver spheres which aid the Tall Man as he sets his sights on indoctrinating Mike and finishing the fight begun so many years ago.",
         "Mike and Reggie continue to hunt the mysterious Tall Man."
      ],
      "budget": 2500000
   },
   "movielensId": 3838,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-05-06",
      "dvdReleaseDate": "2007-04-10",
      "directors": ["Don Coscarelli"],
      "runtime": 91,
      "movieId": 3838,
      "title": "Phantasm III: Lord of the Dead",
      "mpaa": "R",
      "actors": [
         "A. Michael Baldwin",
         "Reggie Bannister",
         "Bill Thornbury",
         "Gloria Lynne Henry",
         "Kevin Connors",
         "Cindy Ambuehl",
         "John Davis Chandler",
         "Brooks Gardner",
         "Angus Scrimm",
         "Irene Roseen",
         "Sarah Scott Davis",
         "Duane Tucker",
         "Claire Benedek",
         "Wendy Way",
         "Robert Beecher"
      ],
      "imdbMovieId": "0110823",
      "originalTitle": "Phantasm III: Lord of the Dead",
      "genres": [
         "Horror",
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["Wu0a_XOxRlM"],
      "plotSummary": "The Tall Man, that imposing menace from Morningside Mortuary, is back and once again haunting the thoughts of the now-adult Mike and his friend, ex-Ice Cream vendor Reggie. The two continue their hunt for the mysterious figure and in his path of destruction encounter a variety of dangerous situations, friends and enemies.",
      "tmdbMovieId": 16139,
      "avgRating": 2.52024,
      "releaseYear": "1994",
      "numRatings": 247,
      "posterPath": "/l8ccrv8XDD727vD3V3qntjrMoox.jpg"
   }
}