{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "mausoleum",
            "id": 162332
         },
         {
            "name": "tall man",
            "id": 162333
         },
         {
            "name": "sentinals",
            "id": 162334
         }
      ],
      "imdb_id": "tt0138703",
      "video": false,
      "title": "Phantasm IV: Oblivion",
      "recommendations": [
         16139,
         15158,
         262848,
         9638,
         26959,
         26962,
         18111,
         26956,
         26957,
         26954,
         28260,
         35945,
         27815,
         26960,
         29794,
         28090,
         27816,
         19158,
         14240,
         14510
      ],
      "backdrop_path": "/nGtAnq1uWZyVL1U4AexxrasnXPY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "The Tall Man / Dr. Jebediah Morningside",
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f80d",
               "name": "Angus Scrimm",
               "profile_path": "/tBDDTCXXybeyzDmFwAuPCb6ePCT.jpg",
               "id": 79584,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Mike",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f7fd",
               "name": "A. Michael Baldwin",
               "profile_path": "/gGOWFGVokrYR6u36CKrb24OwdQT.jpg",
               "id": 58240,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Jody",
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f801",
               "name": "Bill Thornbury",
               "profile_path": "/2NxCvwkJdpEuZ995uE3PPzoW93X.jpg",
               "id": 58241,
               "order": 2
            },
            {
               "cast_id": 23,
               "character": "Reggie",
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f85f",
               "name": "Reggie Bannister",
               "profile_path": "/4ayBwRs64wGiCpj2HXHGw3HIO9K.jpg",
               "id": 97939,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Jennifer 'Jenny' Wheeler",
               "gender": 1,
               "credit_id": "52fe46aa9251416c7507f805",
               "name": "Heidi Marnhout",
               "profile_path": "/zZ2K5DbH5ZTZmOAz9ZK4wszXcnL.jpg",
               "id": 58682,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Demon Trooper",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f809",
               "name": "Bob Ivy",
               "profile_path": "/bGKG5G07ldok7XbEWZpINL4UVe.jpg",
               "id": 79592,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Music & Dwarf Creatures (voice)",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f811",
               "name": "Christopher L. Stone",
               "profile_path": null,
               "id": 28947,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Background Player",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f815",
               "name": "Chloe Kay",
               "profile_path": null,
               "id": 79593,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Background Player",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f819",
               "name": "Sylvia Flammer",
               "profile_path": null,
               "id": 79594,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Background Player",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f81d",
               "name": "David Gasster",
               "profile_path": null,
               "id": 79595,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Background Player",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f821",
               "name": "Sasha Kassel",
               "profile_path": null,
               "id": 79596,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "Background Player",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f825",
               "name": "Aidan Kassel",
               "profile_path": null,
               "id": 79597,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "13th Morningside Volunteer Infantryman",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f829",
               "name": "Eric Avary",
               "profile_path": null,
               "id": 79598,
               "order": 12
            },
            {
               "cast_id": 13,
               "character": "13th Morningside Volunteer Infantryman",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f82d",
               "name": "Andy John",
               "profile_path": null,
               "id": 79599,
               "order": 13
            },
            {
               "cast_id": 14,
               "character": "13th Morningside Volunteer Infantryman",
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f831",
               "name": "George A. Craig",
               "profile_path": null,
               "id": 79600,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f837",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46aa9251416c7507f83d",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f843",
               "name": "A. Michael Baldwin",
               "profile_path": "/gGOWFGVokrYR6u36CKrb24OwdQT.jpg",
               "id": 58240,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46aa9251416c7507f85b",
               "name": "Christopher L. Stone",
               "profile_path": null,
               "id": 28947,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "535f83920e0a264fde007a9c",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "535f83ab0e0a264fe10079c2",
               "name": "Chris Chomyn",
               "profile_path": null,
               "id": 1273938,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "535f83e90e0a264fd5007afb",
               "name": "Scott J. Gill",
               "profile_path": null,
               "id": 58687,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "535f83c50e0a264fe8007a3b",
               "name": "Shelley Kay",
               "profile_path": null,
               "id": 424552,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.039693,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16146,
      "vote_count": 65,
      "budget": 650000,
      "overview": "Taking off immediately where the last one ended, in this episode Mike travels across dimensions and time fleeing from the Tall Man, at the same time he tries to find the origins of his enemy, and what really happened the night that his brother died. Meanwhile, Reggie battles the spheres and the undead in a quest to find Mike before the Tall Man can complete his transformation.",
      "similar": [
         16139,
         9638,
         15158,
         1092,
         11601,
         32023,
         224328,
         430573,
         97985,
         234937
      ],
      "original_title": "Phantasm IV: Oblivion",
      "runtime": 90,
      "poster_path": "/1mBU0bPgOKt0RarqGNyRUbLQbrn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Starway International Inc.",
         "id": 3146,
         "origin_country": ""
      }],
      "release_date": "1998-07-31",
      "vote_average": 5,
      "belongs_to_collection": {
         "backdrop_path": "/bu33EKctcBJvN5KHR780lWQkyJd.jpg",
         "name": "Phantasm Collection",
         "id": 47770,
         "poster_path": "/xqgAkKmQRrk0UaIbWMak4RRSQm7.jpg"
      },
      "tagline": "You Can't Go Forward Until You've Gone Back.",
      "adult": false,
      "homepage": "http://phantasm.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Coscarelli"],
      "runtime": 90,
      "synopsis": "The film opens where its predecessor left off. Mike flees from Boulton mortuary in the hearse, while Reggie is trapped inside by The Tall Man's spheres. However, The Tall Man decides to let Reggie go for the moment. Mike's spherical brother Jody persuades a reluctant Reggie to go looking for Mike. On the way, Reggie runs into a police car which pulls him over. He is attacked by the policeman, who turns out to be a mysterious psychopathic demon, but manages to escape after blowing up the police car and destroying the body. The next morning, Reggie meets a woman called Jennifer, whom he rescues from her overturned car and takes her to the next town, which is also abandoned. They stay the night at an abandoned motel and Reggie tells her the story of The Tall Man. Jennifer doesn't believe him and also rejects his advances. Having dreamed of Mike, Reggie wakes up and unbuttons Jennifer's nightshirt, discovering two spheres sticking in her breasts. As they fly out and attack him, he smashes one with a sledgehammer but is pinned to the wall by the other. In desperation he strikes his tuning fork and the sphere explodes. Jennifer grabs his leg but he smashes her with the hammer and leaves. Mike, trying to uncover the mysteries of The Tall Man and to escape the transformation, drives through abandoned towns and remembers the last days before The Tall Man's arrival. The Tall Man appears in the back of the hearse and takes control of the car before he disappears into the coffin. Mike drives the hearse into Death Valley. Mike intends to force The Tall Man to a confrontation and writes his testament. He finds himself at a 19th Century colonial-style house with an earlier model of the gate inside. Mike meets a man resembling The Tall Man, who however welcomes him cordially and introduces himself as Jebediah Morningside. Jebediah wants to speak with Mike, who, however, is frightened and again escapes through the gate. Jebediah's wife (who resembles the Fortuneteller from the first Phantasm movie), appears and tells him to let Mike go. Back in Death Valley, Mike realizes that he can move rocks by the power of his mind. Jody appears. Mike is distrustful and accuses his brother of having abandoned him. Jody defends his behavior and disappears. Mike works on his car, using parts to build a makeshift sphere. Hoping that he might stop Jebedaiah from becoming the evil Tall Man, he again goes through a gate, but finds himself in the deserted city of Los Angeles and escapes The Tall Man only with Jody's help. Meanwhile, Reggie arrives at Death Valley and fights off a group of zombie dwarfs when Mike and Jody appear through a gate. Mike embraces Reggie and tells him not to trust Jody. Reggie passes Mike the tuning fork, as the two brothers pass through the gate, appearing in Jebediah's house. Invisible to the old man, they witness how he perfects his craft and approaches the inter-dimensional gate. Mike tries to stab him before he can pass through but misses him, as they are in another dimension. Jebedaiah vanishes and moments later is replaced by the evil Tall Man who emerges in his place, having taken his form and using his human appearance as a disguise. Mike escapes through the gate, finding himself in a cemetery. He is attacked and overpowered by his brother and awakes on mortuary slab. Jody holds him as The Tall Man begins operating. A panicking Mike strikes the tuning fork, thus immobilizing his opponents. Mike then kills Jody with a sphere but The Tall Man revives and telekinetically takes the fork from Mike. Again, Mike escapes through the gate back to Death Valley, pursued by The Tall Man. Reggie tries to shoot The Tall Man but is overpowered. Mike summons the sphere he built. The Tall Man is impaled in the neck but he is unharmed and he pulls out the sphere and crushes it with his right hand, amused. At that moment, Mike activates the hearse's motor, which turns out to be the true weapon against the Tall Man (a strange inter-dimensional bomb). A distracted Tall Man is vanquished after the explosion consumes both him and the car. However, a new Tall Man immediately comes through the gate, revealing that the Tall Man is but one of many. He resumes the surgery started by the last Tall Man he removes the golden sphere from Mike's head and disappears again through the gate. As Mike is close to death, Reggie arms himself with his 4-barrelled shotgun and enters the gate, determined to overcome The Tall Man. As Mike lies dying on the desert floor near the gateway, he has a childhood memory, climbing into Reggie's ice cream truck with him and driving off into the night.",
      "writers": [
         "Don Coscarelli",
         "Don Coscarelli"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0138703/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNDIyNzExM15BMl5BanBnXkFtZTcwODczNDAwMg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: A. Michael Baldwin, Reggie Bannister, Bill Thornbury | See full cast and crew »"],
      "reviews": [
         "After taking the series too far in the direction of horror-hokum, Don Coscarelli pushes Phantasm IV further into sci-fi than any previous film but brings back the narcoleptic approach the first that II and III were sorely without. In doing so, Phantasm IV becomes the most atmospheric and haunting one yet. Just don't expect long scenes of exposition or plot-details being unsubtly wrapped up, the mystery of the Tall Man is too strong to ever fully end. As you should remember, at the end of Phantasm III Mike disappeared into the darkness after the Tall Man did some kind of unnecessary brain surgery on him and Reggie was literally left hanging after being pinned to the wall by a dozen killer spheres. Well you can relax, the Tall Man knows that killing Reggie will achieve nothing and focuses on catching Mike, who has a plan to draw him out into the open by hiding in the desert. Reggie closely follows, driving through loads of deserted towns already pillaged by the Tall Man. And the ghost of Jodie (now looking like the identical twin brother of Stellan Skarsgard) comes back to offer some suspicious advice. It's all very, very minimalist and reminds me a lot of the Myst video games in regards to the overwhelming sense of abandonment and isolation, the journal-keeping, the doorways to other worlds, the stark silence of desert landscapes and the weird contraptions. The true identity of the Tall Man is finally revealed but the forces behind him are still kept in the dark. The answers are hinted at rather than announced and the dialogue sparse without being empty. Another cool thing about this sequel are the many eerie and haunting (and haunted?) locations such as a lonely beach, spooky rock formations, a lifeless Wilshire Boulevard (the biggest street in LA) and barren salt flats that give it such an otherworldly and supernatural feel that the typical mausoleums and old graveyards of II and III didn't. Again the Tall Man steals the show from Reggie, who is putting up a harder fight to make it his movie. Both are great characters who shrug off the typical characteristics of villain and hero and become people who you can REALLY root for. Yes, you can side with the Tall Man! It's a shame that Angus Scrimm has never really gotten any huge recognition outside of the cult-horror circles as his approach to the character is very unique and he takes his acting very seriously. Since Don Coscarelli shot so much unused footage for the original Phantasm film he incorporates some of it into the story, thus heightening the already warped space-time continuum the Phantasm universe exists in. As a result of this the ending may seem annoyingly ambiguous but can be interpreted in so many different ways. Since Coscarelli is busy with other projects right now it seems unlikely that the long-rumored Phantasm's End will happen any time soon. But when you enjoy a series of films so much do you really want to see it end? The non-closure of Phantasm IV keeps the story alive after the credits roll instead of finishing it for good. Which is how I would prefer it. If you watch it with company, this tends to lead to much discussion afterwards, something more straight-forward horror films don't. I've always thought that if you wish to tackle something outlandish and imaginative that you must have an equally as strong counter-imagination to fully take it in and comprehend. If you prefer films like Bridget Jones and turn your nose up to Lost Highway then your probably best steering away from the Phantasm series. If you're better than that then you're in for one helluva crazy ride.",
         "This is one of my favorite series of movies. The other day, my wife, and I found ourselves watching all four 'Phantasms'. Unlike the 'Friday, the 13th' series, they all tried to be different, but at the same time be true to the concept. Even in the first movie, you walked away (in my case drove away since I saw it at a drive-in) saying to a point, what happened here? Didn't Reggie get killed, and Jody survive? That I think is part of the mystique of these movies. You find yourself discussing with your family, and friends what happened here. Hey, it came many times at at Christmas, and Thanksgiving at my house for quite a few years, NO KIDDING! This one, I liked, but I'm a little disappointed with it. As I'm typing this up, I have the first one playing, and I still don't quite get IV. For one thing, the idea of explaining why the tall man doesn't die because he comes from different dimensions. Like 'Dr. Who', he travels through time, and space can appear at any time, or place. Okay, I'll buy that. But, why is he so hell-bent on capturing Mike? Does he have some kind of vendetta against Mike, and Jody's family? As Jody said in III,\"seeing is easy, understanding takes a little more time.\" I'm getting a headache trying to understand. There must have been a ton of stuff on the cutting room floor, or someone found a great actor to play Mike from 1979, because a lot of this one bounces back to the first one as they try to tie all of this together. I understand, unlike 'Star Wars', the complete story was not written out ahead of time, it was made up as it went as it went along. Don Coscarelli is good on keeping us guessing, and I see there one more coming, and judging by the title, this will be the last one, so PLEASE Mr. Coscarelli, If this is the last one, finish it up with style, don't keep me guessing!!!!",
         "What makes this series so consistent is the fact that the same writer/director, Don Coscarelli, is responsible for all four entries. Some phans prefer the second film for its tendency to lean more toward being an action film, while others like the cartoonish, over-the-top aspects of the third entry. Personally, I think this one (IV) is the best sequel. I love the fact that it is more in the moody, psychological vein of the original, which is by far the best in the series in my opinion. IV uses some beautiful locations- a rocky beach, a desert with intricate rock formations, and a completely unpopulated downtown Los Angeles (I'm assuming that's what city it is). These serve as really interesting backdrops for Mike, Reggie, Jody and the Tall Man (all the original actors returned, too). All this is beautifully shot by D.P. Chris Chomyn, who did a great job. The plot is not completely clear, but also not complex. The Tall Man is after Mike with the intent to turn him into another \"Tall Man\" sort-of undertaker. Meanwhile there's a subplot where Reggie encounters a beautiful female on the road (as he does in both other sequels). The dialogue is sparse and much of the meaning is implied. One of the most impressive things about the film is the way they were able to incorporate so much unused footage from the original (19 years earlier) into the story. Despite the time difference, the new film and the old footage work together perfectly, and that is a really cool thing to behold. The film actually ends with a flashback- a poignant and subtle scene that is unlike the endings of the other three movies, leaving the series with what could be a perfect close. But if Coscarelli and Co. want to come back and do another one, what Phantasm phan is gonna dispute it?! Not me!",
         "I cannot believe all of the bad reviews that this movie is getting! It is clearly the best sequel in the whole series! It may have had a bizzare ending, but it left you to come up with your own answer. Like one great philospher said, \"When the end is upon us, that is where the beginning may arrive.\" I have my own answer, but I could go on for hours about what I thought the ending meant. Great movie, great sequel, long live the tall man!",
         "A horror movie that is fourth in a series should be terrible. This one actually stands on its own as a good movie, though perhaps not great as fourth in the series. As other users have commented, this movie does not answer questions about the Phantasm series. It shows a little background on the tall man, and that's it. On the other hand, looking at it as a stand-alone-movie, it works! It has very coherent and often beautiful art direction. There are very few characters (I assume to save money), but that works. It keeps the movie from bogging down in goofy dialogue and laughable characters like Phantasm III. The movie actually gets rather artful at times. Just observe the desert scenes with the field of metal rods to see what I mean. The Tall Man doesn't seem too threatening in this one. He come across much more as a constant pressure instead of an acute danger. The individual characters aren't really developed any more than the previous films. They are reaching archetypal roles of heros, seekers, fighters, etc. This is not a slasher film. It almost is not a horror movie. Oddly enough, it is almost stepping out of its low-brow beginnings (except for the breast scene in the hotel) and nearly reaching art movie status. I would love to see Phantasm V taken further in this vein. Unfortunately, I think this is the last of the series. Enjoy it if you can find it!",
         "\"Phantasm IV: Oblivion\" is a more than qualified conclusion to the series. **SPOILERS** Fleeing through the country, Mike, (A. Michael Baldwin) finds that The Tall Man, (Angus Scrimm) has implanted a Silver Sphere into his skull to turn him into one of the minions he controls, while his friend Reggie, (Reggie Bannister) is held captive. Following the spirit of his trapped brother Jody, (Bill Thornbury) out to Death Valley, they all meet together to determine what's going on. Realizing that the Tall Man had plans for them from the very beginning in his quest to take over the world, they manage to find the secret of who The Tall Man really is, using his time-travel equipment to venture into the past to see who he really was in the past life. As they gather more about the Tall Man, he realizes that they're going against his plans, forcing him to unleash the full force of his demons against them in an effort to stop them fry ruining his plans for world domination. The Good News: This here was one of the more impressive entries in the series. One thing it has going for it is the really big and grandiose action scenes in the film. What helps it the most is that the majority of the scenes are largely familiar stuff of the series. There's a spectacular car flip and rescue, two exploding vehicles, some aggressive jumping dwarfs and a silver-sphere attack, the last of which occurs after the inevitable attempt by one to get off with the equally inevitable girl picked up en route. These are all great to witness, giving the film some life it may not otherwise have had. In terms of atmosphere and suggestion, the film scores rather well. The in-car visions of the past and the initial encounter with the phantom patrolman proving to genuinely creepy. Equally effective is the flashbacks and alternate reality visions and memories, presenting us with absolutely unique scenes that are quite imaginative and really intriguing. The longest one, a night-time chase through a forest will get plenty of atmospheric scenes in, including the sequence where the hanging Tall Man ushers a big remark offering peace in exchange for his freedom. It's a great scene, and one of the best ones in the film. The sight of The Tall Man appearing as a regular human, sitting on his porch and offering the visiting Mike a glass of home-made lemonade is pretty impressive as well. Another cool thing about this sequel are the many eerie and haunting locations, such as a lonely beach, spooky rock formations, a lifeless street in LA and barren salt flats that give it such an otherworldly, supernatural feel that the typical mausoleums and old graveyards of the previous ones didn't. Although there's some really dull moments, there's also some big moments in here to get some big moments in, especially the autopsy scene that reveals a big surprise for one of the victims, with the Silver Spheres getting a welcome appearance that wouldn't have otherwise been. An attack from the spheres late in the film, leading to many of it's true gore set-pieces as they cling to major body parts is something to behold, and there's some more in here that are very welcome. All in all, this is a very worthy sequel entry. The Bad News: There wasn't very many flaws in here, but they were somewhat important. The fact that it follows the conventions of the series closely is the main point in this one. This one has so many of the clichés and plot-points that the other ones have, and it can lead to multiple scenes where predicting what will come next will be done correctly the great majority of the time, which can lead to many problems throughout the film. That can be something in this one, mainly because none of them are changed around or inverted this time around, which is where the problem lies. Nothing is changed, and that is something which can be used against it at times. There's also the fact that the film doesn't really move as fast as the others out there, which can be somewhat irritating. A lot of time is spent wandering around in the desert, which offers it good scenery but nothing else, and by utilizing the clichés at hand, a long time is spent on others that have nothing to offer in terms of action, and at times this can be somewhat dull. However, the main problem with this one is that there's no explanations for anything in the film, much less the series. This one probably should've done something to answer the questions the others have to offer, and it would've been a great time to do it. That is the biggest flaw, and it keeps it down the most. The Final Verdict: It won't match up to the classics early on in the series, but it's still highly entertaining for the series and wraps it on a high note. Highly recommended for the fans of the series or those just plain interested, but those who haven't followed the series won't find much in here that will appeal to them. Rated R: Graphic Violence and Graphic Language",
         "If you remember the first movie at all, and you approach this movie with an open mind, you will find OblIVion quite satisfying. Though not as atmospheric as the first movie, there are several creepy scenes scattered throughout, including the opening scene and a dream sequence involving Reggie. In addition, there are several scenes from Phantasm (I) cleverly woven into the storyline creating continuity between the two films. Some, but not all questions are cryptically answered, which steadfastly adheres to the \"nothing is as it seems\",non linear flow to the movies. It definitely leaves room for one last movie. Maybe the last movie can spell it out (or at least somewhat) for \"phans\" needing closure. In conclusion, if your not a fan of the Phantasm movies, or are just randomly renting movies out of boredom, I strongly suggest you don't bother and keep your cynicism to yourself. But if your willing to at least watch the first film, or if your addicted to Phantasm I, Phantasm IV will clearly keep you wanting more.",
         "I am one of the world's biggest fans of the original Phantasm. But I have to admit, that the sequels really do nothing for me. Number four is the closest thing to the original. It lives the same world, but isn't distracted by pop culture phenomena of the time the way 2 & 3 seemed to be influenced/commentating on 'Evil Dead' and 'Home Alone'. As much as I like seeing the Tall Man, Reggie and Mike back in action, Jody still seems forced into the series. I really wish that Coscarelli had just left him dead and moved on. The whole 'living ball' thing is plain silly.",
         "I made a huge mistake when I began to watch the 'Phantasm' series. I started with this one and only because I couldn't find the original and just wanted to see this series so badly. I'd heard good things about it, but that was decreased a bit after seeing this film. It was made worse after I saw the first three because they're all so good by comparison. Every series has at least one installment that can be called the weakest and 'Phantasm: Oblivion' seemed to be this one's example, but then I gave it another chance. It's still my least favorite of the series, but I've realized that after all is said and done it's really not a bad film. It is however a mediocre finale, which may not be the case if V gets it's funding. Pros: A really powerful opening five minutes, which includes an unnecessary, but well done series recap. As usual the performances are excellent. It's cool to see alternate footage from the original in the form of flashbacks. We finally start to get some answers as to when and how this all started. Another really good music score. Setting a large portion of the film at night increases the chill factor. Pace is kind of slow, but steady. Some decent effects. Cons: Lacking in action. Still a lot of unanswered questions. Though it's nice to see the deleted footage from the first film, a lot of it feels like padding. It's also cool to see Bill Thornberry again, but he's way underutilized. Final thoughts: As another sequel, 'Oblivion' is above average and much better than I remember. But as a fan it just doesn't feel like a satisfying end to it all. A fifth film is said to be in the works, but it needs financing and to happen soon. This is overall a great series, but the wait for this next sequel is starting to get excruciating. My rating: 3.5/5",
         "I don't know why people complain about this film so much, it is easily as good as the other Phantasm Films. This film, as usual, contains brilliant acting from the four leads, especially Reggie Bannister(who is God in the horror film genre, with Bruce Campbell as Jesus), and Angus Scrimm's aging appearance just add to his performance, (let's face it he look old, which is cool for the evil bad guy). The action scenes are excellently staged and the make-up is the best ever. I find all the complaints about this film laughable and stupid. 1. Not enough revealed about the Tall Man's origins, despite promises. What do you what? An autobiography, with detailed plans for his world domination (which part 5 promises if it's ever made). What is revealed is enough to show evil comes from good, perhaps a metaphor for the Tall Man's quest for Mike over the ears. 2. Lack of action/gore. Rubbish!!!!!!!!! I'm going to sulk over this statement. Reggie (God) Bannnister is one mean Zombie-thing ass kicker. Reggie's entire journey to find Mike goes from one gun battle to another. And as for gore, there's more yellow custard flying around here than an Oscar losers after dinner party. 3. Bad script/direction. What a load of sh#te. This is one of Coscarelli's funniest scripts, loaded with wit ('this won't hurt a bit...Well...maybe just a little bit.' person hearing this then screams, priceless). And as for direction we need look no further than scenes featuring the Almighty, sorry Mr Bannister, the Motel Room scene is excellent, especially the end: CREATURE:(ON THE FLOOR)Wait, we aren't finished yet! REG:(RAISING GUN)Sorry baby, but YES WE ARE! (GUN FLIES AT SCREEN AND BLACKOUT CRUNCHING NOISE) 4. Finally the end. Another cliff hanger, noting is resolved, no clear winner (again) main characters face death, how will they get out of this? Wait ten years for another installment. What's the problem, this is the best way to end the series if part five never comes - Reg aimlessly fighting for his friend's life, Mike Helpless to prevent his fate and the Tall Man appearing to be the Evil victor, but we know the good guys will win, don't we? This is just the perfect ending as it embodies the entire themes and events of the series. And should it lead to a part five it is also a brilliant cliff hanger. I'm not saying that this film is perfect,the results of part 3's cliff hanger are disappointing, as are the ideas that Mike has about his 'abilities', but it is still a very enjoyable film. The desolated future scene is a Reg (God) send, apparently done without permission or blocking off the street, as are the flashbacks of unused part one scenes, the final one is very effectively haunting. Let's hope this leads to part five, if it's even half as good as this. I saw part three first in 1994/5 on Sky and at the end thought 'Our heroes can't be left like this, Mummy (I was 12) how will they escape?' she told me to wait and see. Six years later I finally know. As good as this, part five would be well worth the wait twice over."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Starway International Inc."],
      "summaries": [
         "Taking off immediately where the last one ended, in this episode Mike travels across dimensions and time fleeing from the Tall Man, at the same time he tries to find the origins of his enemy, and what really happened the night that his brother died. Meanwhile, Reggie (accompanied by a beauty he picked up on the road) battles the spheres and the undead in a quest to find Mike before the Tall Man can complete his transformation.",
         "Phantasm: Oblivion is the 4th installment of the series. The cast from the orginal Phantasm returns as Mike attempts to find how the tall man came to be. Mike, along with Cody and some help from Reggie, travels through various dimensions of time and space to find the source of the tall man."
      ],
      "budget": 650000
   },
   "movielensId": 3839,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-07-31",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Don Coscarelli"],
      "runtime": 90,
      "movieId": 3839,
      "title": "Phantasm IV: Oblivion",
      "mpaa": "R",
      "actors": [
         "Angus Scrimm",
         "A. Michael Baldwin",
         "Bill Thornbury",
         "Reggie Bannister",
         "Heidi Marnhout",
         "Bob Ivy",
         "Christopher L. Stone",
         "Chloe Kay",
         "Sylvia Flammer",
         "David Gasster",
         "Sasha Kassel",
         "Aidan Kassel",
         "Eric Avary",
         "Andy John",
         "George A. Craig"
      ],
      "imdbMovieId": "0138703",
      "originalTitle": "Phantasm IV: Oblivion",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "9lg7nrOz1es",
         "bXZtb7R2rRQ"
      ],
      "plotSummary": "Taking off immediately where the last one ended, in this episode Mike travels across dimensions and time fleeing from the Tall Man, at the same time he tries to find the origins of his enemy, and what really happened the night that his brother died. Meanwhile, Reggie battles the spheres and the undead in a quest to find Mike before the Tall Man can complete his transformation.",
      "tmdbMovieId": 16146,
      "avgRating": 2.51351,
      "releaseYear": "1998",
      "numRatings": 222,
      "posterPath": "/1mBU0bPgOKt0RarqGNyRUbLQbrn.jpg"
   }
}