{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cia",
            "id": 591
         },
         {
            "name": "judge",
            "id": 934
         },
         {
            "name": "blackmail",
            "id": 1936
         }
      ],
      "imdb_id": "tt0112443",
      "video": false,
      "title": "Bad Company",
      "recommendations": [
         67307,
         88818,
         39473,
         47608,
         83714,
         106143,
         41590,
         46925,
         31633,
         78406,
         117904,
         25697,
         32330,
         75889,
         31563,
         47939,
         27141,
         18551,
         17126,
         15170
      ],
      "backdrop_path": "/l8MeKNXaG4F3OKxNxBiFwbhuRi8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Nelson Crowe",
               "gender": 2,
               "credit_id": "52fe4593c3a36847f80cf065",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Margaret Wells",
               "gender": 1,
               "credit_id": "52fe4593c3a36847f80cf069",
               "name": "Ellen Barkin",
               "profile_path": "/i4WSy0da6KaA3xvETtXqZtUMoRP.jpg",
               "id": 6913,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Vic Grimes",
               "gender": 2,
               "credit_id": "52fe4593c3a36847f80cf06d",
               "name": "Frank Langella",
               "profile_path": "/wMlcjLBQouQjE0iceseNTxUF3BF.jpg",
               "id": 8924,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Tod Stapp",
               "gender": 2,
               "credit_id": "52fe4593c3a36847f80cf071",
               "name": "Michael Beach",
               "profile_path": "/lOlWhURNKyZHn71dvq7qC7fiwN6.jpg",
               "id": 87118,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Judge Justin Beach",
               "gender": 2,
               "credit_id": "52fe4593c3a36847f80cf075",
               "name": "David Ogden Stiers",
               "profile_path": "/zngM0eXq6RuYZmdocsAY2AMKUja.jpg",
               "id": 28010,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Les Goodwin",
               "gender": 2,
               "credit_id": "52fe4593c3a36847f80cf079",
               "name": "Daniel Hugh Kelly",
               "profile_path": "/6eZZbAZsupu3WHHtW3tud3o0F1u.jpg",
               "id": 22111,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Julie Ames",
               "gender": 1,
               "credit_id": "52fe4593c3a36847f80cf07d",
               "name": "Gia Carides",
               "profile_path": "/zXb8k7dyHYbwUHsNuhp0V4JJIof.jpg",
               "id": 14226,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4593c3a36847f80cf05b",
               "name": "Damian Harris",
               "profile_path": null,
               "id": 42301,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4593c3a36847f80cf061",
               "name": "Ross Thomas",
               "profile_path": null,
               "id": 58652,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.756797,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40480,
      "vote_count": 14,
      "budget": 0,
      "overview": "Nelson Crowe is a CIA operative under the thumb of the Company for a disputed delivery of $50,000 in gold. They blackmail him into working for the Grimes Organization, which is set up as a private company for hire, to blackmail prominent individuals. Crowe, working with Margaret Wells (another former Covert Operations operative), blackmails and bribes a State Supreme Court judge, but the deal sours. One of Crowe's co-workers, Tod Stapp, discovers Crowe's current CIA involvement in a plot to overthrow Grimes, and blackmails him to be cut in on the deal. More blackmail occurs as Wells manipulates Crowe to kill Grimes, then the CIA uses that discovery to blackmail Wells into killing Crowe. Who can you trust???",
      "similar": [
         137094,
         1645,
         47964,
         146216,
         254904,
         320,
         954,
         955,
         956,
         273481,
         691,
         11808,
         8834,
         4771,
         389,
         3597,
         9331,
         1247,
         26389,
         2252
      ],
      "original_title": "Bad Company",
      "runtime": 108,
      "poster_path": "/tq9dJtuOAMhBjXTaJ7WrD0mEWHe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tool Shed Productions",
            "id": 21857,
            "origin_country": ""
         }
      ],
      "release_date": "1995-01-20",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Bribery. Blackmail. Murder. Specialities of the house.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Damian Harris"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Ross Thomas"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112443/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3MjIyODk5N15BMl5BanBnXkFtZTcwMjQyNTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ellen Barkin, Laurence Fishburne, Frank Langella | See full cast and crew »"],
      "reviews": [
         "I saw the film when it was first released. Recently it showed up on cable and decided to take a second look. As it was my impression then, I still think this elegant thriller could have used a more logical plot because there are many questions that even a second glance doesn't answer. The film owes a great deal to the stylish production it was given by director Damian Harris and his team. The Vancouver location doesn't take away from Seattle, where it's supposed to take place. The excellent cinematography of Jack N. Green adds dimension to the movie. Laurence Fishburne, as the cool Nelson Crowe, is a major asset to the picture. So is Ellen Barkin, an actress that is always good to watch and is sadly missed from the screen, as she hasn't made a film in years. Frank Langella, Michael Beach, and above all, Gia Carides, made tremendous contribution to the film.",
         "Underrated, gripping thriller was a big box-office failure but it deserves a second chance on home video. Tightly plotted (there's always something happening, but the complications never get too confusing) and smoothly directed, it's a movie that knows how to keep you absorbed, even though its nihilistic ending is slightly cliched. Give it a try. (***)",
         "Decent thriller has a basic story of double-dealing partners with different agendas and bribery of a judge with a gambling problem. Ellen Barkin, Laurence Fishburne and Frank Langella are the principals involved in an organization that specializes in blackmail and bribery schemes, with double crosses thrown in for good measure. A key element in the picture is the offer of a bribe to a judge for his vote in a controversial court case, with the predictable drama and mystery following thereafter. The film also has wild sex scenes that are intended to add spice to a complicated mystery involving shadowy CIA and espionage figures. Gia Carides has a key supporting role as the judge's mistress who later acts out her part of a woman bent on payback. Remainder of the cast is okay and the tech credits are fine.",
         "If you want your films to have sympathetic characters, you probably shouldn't go near this one. This is a very tough and cynical thriller, one that has no good guys, only a whole lotta bad guys and a couple of not quite as bad guys. But that's what I enjoyed about this film. It was great to see the plot unfold in unexpected ways, and to see these characters mess with one another, motivated only by greed, lust, and fear. Another aspect is the film's sleek and cold style. From the wardrobes to the apartments these characters occupy, the film is pretty stylin'. And the acting is very good. Laurence Fishburne is excellent as the amoral Crowe, Frank Langella is elegantly nasty as Grimes, and Michael Beach has a deceptively quiet role as one of Fishburne's \"co-workers\". A very dark film that resolves itself quite nicely in the end, and well worth seeing. But if you need a good guy to root for, this isn't the film to check out.",
         "This movie is proof-positive that everything is not for everyone,and in this case,that is unfortunate.The criticisms leveled at this film usually mention its 'slow pace' or its 'simplistic writing',as if every film needs to be directed by John Woo or written by David Mamet.I enjoyed it tremendously because it spit in the face of the usual textbook narrative themes found in nearly every movie made before or since.It champions its amoral characters,treating them like golden gods and giving them plenty of room to play.When you've found a film where the most sympathetic character is someone's conniving mistress,it is cause for much celebration! These characters are not just amoral,they are deliciously amoral and quite nonchalant about it! I love the degree of sophistication that each character possesses,treating each other as petty contrivances standing in the way of their decidedly selfish goals.They absolutely reek of elegance.Even their conflicts are handled in a gentlemanly manner,like being slapped with a silk glove instead of the customary right cross or knee to the groin.The bullets flying about even seem to adhere to some sort of proper etiquette!The characters even refuse to die wearing anything off the rack! This film is more about gracious duels than cacophonous shoot-outs and car chases.It is,quite simply,a film for the sophisticate.The person who admires the cool detachment of Hannibal Lecter(minus his dietary proclivities),or the person who has an especially warm spot for humorous lines that only aspire to deliver a wicked grin instead of a hearty guffaw.This movie fully realizes that most of its characters are unapologetic elitists,and it applauds them.Nowhere is this more clear than in the character portrayed by Daniel Hugh Kelly.His elegantly evil performance is so deliciously smarmy that it was obviously created for the sole purpose of providing that wicked grin that I spoke of before. If you consider yourself more trip-hop than hip-hop,more Oscar De La Renta than Old Navy,more Paris in the spring than Peoria in the summer,then this is the film for you!",
         "It's not the company you keep but the one you work for at issue here in this taut film about an ex-CIA agent who goes to work for a company that specializes in helping their corporate clients get the upper hand in any and all situations by any means necessary, but especially blackmail, as the central plot revolves around soborning a judge who has severely compromised his integrity by mounting up impressive gambling debts and extra-marital infidelity. Ellen Barkin plays the devious (bad) company recruiter who signs on ex agent Laurence Fishbourne whose 140 IQ proves no match for her physical talents. By bribing the compromised judge (David Ogden Stiers) they will rescue their client Walter Curl (Spalding Grey) from a lawsuit that claims that his company dumped cancer causing pollutants. Though the judge is a gambling philanderer, he's in nobody's pocket, and thus, after taking the bribe, votes his conscience on the case in question, and then opts out after sending his girlfriend (Gia Carides) to the Bahamas with the money. Meanwhile Barkin maneuvers Fishbourne through sex into killing company head Frank Langella, showing that IQ comes in a distant second to sex appeal. Nobody (except maybe Carides and Stiers, and to a certain extent Fishbourne) is going to win much sympathy from the audience, but the story stays on task all the way through, and the observations it casts on corportate behavior are not so far out.",
         "Nelson Crowe (Laurence Fishburne) is a CIA agent disgraced by the disappearance of a shipment of $ 50,000 in gold. Blackmailed him to enter into a joint industrial espionage, Grimes organization, in order to extort money from important posts. However, gradually realizes that he could gain control of the company if it were proposed. In this film there is a lot of intrigue, and calculatedly items appear balanced each other, and with good quality, well located also on an interesting script that gets a little predictable end, Very large falls in topics regarding money, power ... but even great films also happens the same, and yet they are very good and very famous. Highlight cast Ellen Barkin, Laurence Fishburne and a decent performance. The characters are psychologically well maintained and much better if they get to know in detail throughout the film. When this is achieved, moreover, all you do then it should fit perfectly with what we see in them. But all this could not be achieved with a good result, and even less in the current black film, no rough use but not exaggerated violence, sex and realism for more action scenes.",
         "I rented this because it was written by Ross Thomas, and I'm a huge fan of his novels. I wanted to see how his ideas were put on the screen. The story line and plot twists are very Thomas, but the characters seemed a little one-dimensional. He is great at building characters in his novels, but there just isn't enough time to do that in a movie. I needed to see vulnerability in each character, when all that was given was cold calculation (which even the hardest CIA agent is NOT). The sex scenes seemed forced, and I bet that they weren't in the original script. Thomas doesn't need to use sex to relate characters to each other, but it's a quick 'gimmie' for the film. I recommend this movie to any Ross Thomas fan, especially given that it was probably the last thing he wrote before he died. Otherwise, watch it if you're into mystery, but know that it's not very thrilling, and can move slowly at times.",
         "I think it's a cool movie, really brings out the characteristic of different characters. Nelson Crowe is the control freak and the killer, great acting by Laurence Fishburne. These people are simply doing whatever they have to do, but not want to. They're all in massive pressure and you can feel it--thanks for the brilliant acting. The pressure is pushing everyone crazy and changing them. I think the best part of the movie is where Nelson pushes Margaret onto the table when she tries to fight back, and say \"you're the angel I dreamed of\". What a great social engineer! While in the last part, she simply had enough of his bullshit and couldn't take it no more. (as I said before, Nelson is the control freak) When Margarent killed the old guy, there was a moment where she was emotionally stunned, but she didn't want to show it before Nelson and they still had business to do. While the plot seems strange, and could be changed abit, it's still a great see would recommend anyone to see it. There are simply too much things in this film to mention. Be warned though the ending is quite disturbing some people might not like it.",
         "Ellen Barkin and Laurence Fishburne performed wonderful acting skills, their love scenes were electricity, and the plot kept me on the edge of my seat. Barkin performed her own Basic Instinct with Frank Langella who did his best to burn up the screen, no more vampire roles for him. If you like romance and warmth, view this film."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Tool Shed Productions"
      ],
      "summaries": ["Nelson Crowe is a CIA operative under the thumb of the Company for a disputed delivery of $50,000 in gold. They blackmail him into working for the Grimes Organization, which is set up as a private company for hire, to blackmail prominent individuals. Crowe, working with Margaret Wells (another former Covert Operations operative), blackmails and bribes a State Supreme Court judge, but the deal sours. One of Crowe's co-workers, Tod Stapp, discovers Crowe's current CIA involvement in a plot to overthrow Grimes, and blackmails him to be cut in on the deal. More blackmail occurs as Wells manipulates Crowe to kill Grimes, then the CIA uses that discovery to blackmail Wells into killing Crowe. Who can you trust???"],
      "budget": 0
   },
   "movielensId": 384,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-20",
      "dvdReleaseDate": "2003-10-14",
      "directors": ["Damian Harris"],
      "runtime": 108,
      "movieId": 384,
      "title": "Bad Company",
      "mpaa": "R",
      "actors": [
         "Laurence Fishburne",
         "Ellen Barkin",
         "Frank Langella",
         "Michael Beach",
         "David Ogden Stiers",
         "Daniel Hugh Kelly",
         "Gia Carides"
      ],
      "imdbMovieId": "0112443",
      "originalTitle": "Bad Company",
      "genres": [
         "Action",
         "Crime",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "2WBdyJAihWI",
         "z_749VE-fMQ"
      ],
      "plotSummary": "Nelson Crowe is a CIA operative under the thumb of the Company for a disputed delivery of $50,000 in gold. They blackmail him into working for the Grimes Organization, which is set up as a private company for hire, to blackmail prominent individuals. Crowe, working with Margaret Wells (another former Covert Operations operative), blackmails and bribes a State Supreme Court judge, but the deal sours. One of Crowe's co-workers, Tod Stapp, discovers Crowe's current CIA involvement in a plot to overthrow Grimes, and blackmails him to be cut in on the deal. More blackmail occurs as Wells manipulates Crowe to kill Grimes, then the CIA uses that discovery to blackmail Wells into killing Crowe. Who can you trust???",
      "tmdbMovieId": 40480,
      "avgRating": 2.98015,
      "releaseYear": "1995",
      "numRatings": 806,
      "posterPath": "/tq9dJtuOAMhBjXTaJ7WrD0mEWHe.jpg"
   }
}