{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shyness",
            "id": 367
         },
         {
            "name": "summer camp",
            "id": 5767
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "mental illness",
            "id": 41329
         },
         {
            "name": "water skiing",
            "id": 158345
         }
      ],
      "imdb_id": "tt0086320",
      "video": false,
      "title": "Sleepaway Camp",
      "recommendations": [
         34311,
         34312,
         27475,
         24124,
         36599,
         39874,
         27813,
         22172,
         9638,
         40969,
         27814,
         16938,
         27346,
         40229,
         13555,
         15158,
         24913,
         14240,
         14029,
         26515
      ],
      "backdrop_path": "/oLQ5j4XMfRGS97rjm0DM7t5cE3N.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Angela",
               "gender": 1,
               "credit_id": "52fe457b9251416c7505819f",
               "name": "Felissa Rose",
               "profile_path": "/PEiMOmcnhRJGlrOXxD2bSrRc37.jpg",
               "id": 74673,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ricky",
               "gender": 0,
               "credit_id": "52fe457b9251416c750581a3",
               "name": "Jonathan Tiersten",
               "profile_path": null,
               "id": 74674,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Judy",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581ad",
               "name": "Karen Fields",
               "profile_path": null,
               "id": 1270519,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe457c9251416c750581b1",
               "name": "Christopher Collet",
               "profile_path": "/lywSPExsD11x5rpvNhm66LEUT6x.jpg",
               "id": 114058,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mel",
               "gender": 2,
               "credit_id": "52fe457c9251416c750581b5",
               "name": "Mike Kellin",
               "profile_path": "/28LFcecwpDIMVIJUdzqko87popk.jpg",
               "id": 50762,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Meg",
               "gender": 1,
               "credit_id": "52fe457c9251416c750581b9",
               "name": "Katherine Kamhi",
               "profile_path": "/7faC4s5WVNYNOEoFz74ocJZsYEd.jpg",
               "id": 1178530,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Ronnie",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581bd",
               "name": "Paul DeAngelo",
               "profile_path": null,
               "id": 931643,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mike",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581c1",
               "name": "Thomas E. van Dell",
               "profile_path": null,
               "id": 1270520,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Billy",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581c5",
               "name": "Loris Sallahian",
               "profile_path": null,
               "id": 1270521,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Kenny",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581c9",
               "name": "John E. Dunn",
               "profile_path": null,
               "id": 1270523,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mozart",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581cd",
               "name": "Willy Kuskin",
               "profile_path": null,
               "id": 1270524,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Aunt Martha",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581d1",
               "name": "Desiree Gould",
               "profile_path": null,
               "id": 1270525,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Artie",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581d5",
               "name": "Owen Hughes",
               "profile_path": null,
               "id": 1270526,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe457c9251416c750581d9",
               "name": "Robert Earl Jones",
               "profile_path": null,
               "id": 98927,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Susie",
               "gender": 0,
               "credit_id": "52fe457c9251416c750581dd",
               "name": "Susan Glaze",
               "profile_path": null,
               "id": 1270527,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457b9251416c7505819b",
               "name": "Robert Hiltzik",
               "profile_path": null,
               "id": 74671,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54dc2c539251416195002d54",
               "name": "Jerry Silva",
               "profile_path": null,
               "id": 1426218,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54dc2c33c3a3681237002dd2",
               "name": "Robert Hiltzik",
               "profile_path": null,
               "id": 74671,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54dc2c45c3a368122d002dcb",
               "name": "Robert Hiltzik",
               "profile_path": null,
               "id": 74671,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "54dc2c619251415a0d002948",
               "name": "Michele Tatosian",
               "profile_path": null,
               "id": 1426219,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54dc2c6ec3a368123b002fb4",
               "name": "Edward Bilous",
               "profile_path": null,
               "id": 1426220,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54dc2c94c3a368122a0030dd",
               "name": "Ron Kalish",
               "profile_path": null,
               "id": 68942,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "54dc2ca6c3a368122a0030e0",
               "name": "Sharyn L. Ross",
               "profile_path": null,
               "id": 1313090,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54dc2cb4c3a3681233003351",
               "name": "Michele Tatosian",
               "profile_path": null,
               "id": 1426219,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "54dc2cc1925141618c003065",
               "name": "William Bilowit",
               "profile_path": null,
               "id": 1426222,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "54dc2cdc925141618c00306a",
               "name": "Ed French",
               "profile_path": "/8l0UmouE1FYEqmzUszAViFaYpaq.jpg",
               "id": 3990,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "57e60c13c3a36835a200331b",
               "name": "Benjamin Davis",
               "profile_path": null,
               "id": 1684180,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 6.858077,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13567,
      "vote_count": 162,
      "budget": 350000,
      "overview": "Slightly disturbed and painfully shy Angela Baker is sent away to summer camp with her cousin. Not long after Angela's arrival, things start to go horribly wrong for anyone with sinister or less than honorable intentions.",
      "similar": [
         10781,
         12662,
         15069,
         948,
         30833,
         16764,
         21484,
         9373,
         123109,
         12521,
         10285,
         588,
         238636,
         381288,
         3597,
         276488,
         3600,
         5486,
         341006,
         310137
      ],
      "original_title": "Sleepaway Camp",
      "runtime": 85,
      "poster_path": "/gkAgVMS2mShi8bXWUSB8VvDshl2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "American Eagle",
         "id": 2775,
         "origin_country": ""
      }],
      "release_date": "1983-11-18",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Sleepaway Camp Collection",
         "id": 47391,
         "poster_path": "/aDSw8Y7Rat8Q72oyzBRyTaAjMeO.jpg"
      },
      "tagline": "…you won't be coming home!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Hiltzik"],
      "runtime": 88,
      "synopsis": "Over the opening credits, we see a closed-down summer camp in the fall that is called Camp Arawak. The film opens in the summer of 1975, with a family consisting of divorcée John Baker (Dan Tursi) and his two children, Angela and Peter, out on a lake near a summer camp in upstate New York. After their small boat accidentally flips, John and the children begin to head ashore, where John's lover Lenny (James Paradise) is calling to him. As the family swims, a pair of teenagers named Marianne and Craig are pulling a water skier named Dolores in a motorboat. Craig and Marianne switch places to that the girl can drive the boat, but they fail to notice the family in the water in time and hits them, which kills both John and Peter. The survivor, Angela, is sent to live with her eccentric aunt, Dr. Martha Thomas (Desiree Gould), and Martha's son Richard \"Ricky\" Thomas. Eight years after John and Peter's deaths, Angela, now age 14 (Felissa Rose), and Ricky, now age 15 (Jonathan Tiersten), are sent to Camp Arawak by Martha, who reminds them not to tell anyone how they got the signatures for their physical exams. The buses arrive at the camp, and Artie (Owen Hughes), the creepy-looking cook, admires the children in a very suspicious way. Ricky introduces Angela to his best friend Paul (Christopher Collet), and he shows Angela around the camp since he was there last summer. Angela goes not respond when Paul talks to her and backs away after he finishes the tour. Ricky tries to talk to Judy (Karen Fields), his former girlfriend from last summer at the camp, but she hardly acknowledges him. Because of her introverted nature and her shyness, Angela is ridiculed and bullied--her main tormentors being Judy and camp counselor Meg (Katherine Kamhi). During lunchtime, Angela, having not eaten for some time, is taken into the kitchen by the sympathetic head counselor Ronnie (Paul DeAngelo) to see if there is anything in there she would like to eat. Left alone with the greasy head cook Artie, Angela is taken into a back room by Artie, who intends to molest Angela. Before any harm can come to Angela, Artie is found in the midst of unfastening his pants by Ricky, who flees from the kitchen with Angela after Artie threatens him. After the incident in the pantry, Artie is seriously injured when he is knocked off a chair by an unseen figure while tending to a large pot of boiling water that spills on his face and hands. Artie's injuries are deemed accidental by camp owner Mel Costic (Mike Kellin), who pays off the rest of his kitchen staff, including the assistant cook Ben (Robert Earl Jones), to keep the event quiet and tells the replacement cooks to tell the campers that Artie left for another job. The next day, Ricky, Paul, and the rest of the boys in their cabin, including geek Mozart (Willy Kuskin), are playing baseball with Kenny (John Dunn), Mike (Tom Van Dell), Billy (Loris Sallahian), and the rest of the boys from another cabin. After Ricky wins the game to the older guys, Kenny talks with Mike about how to get back at Ricky. Later that night in the recreation cabin during a dance, Angela is accosted by Kenny and Mike, who begin mocking her for not speaking, which prompts Ricky and his friend Paul to get into a fight with the boys in which several others join in, which fulfills their plan of getting back at Ricky. After the brawl is broken up by counselor Gene (Frank Trent Saladino), Ricky and the rest of the boys involved in the fight leave while Paul stays behind and succeeds in befriending Angela by telling her about misadventures he and Ricky would get into when they were younger. The shy Angela still does not talk, but when Paul begins to leave, she speaks for the first time and tells him \"good night\". Later that night, Kenny is rowing a boat with his girlfriend Leslie (Lisa Buckler), and he rocks and overturns the boat. Leslie angrily swims away as Kenny, underneath the overturned boat, is attacked and pushed underwater by an unseen person. In the morning, Kenny's dead and decomposing body is found, and his death is also ruled accidental by Mel, despite suspicion from Ronnie and the police, especially a cop named Frank (Allen Breton). Later that day, Angela walks up to Paul and begins to talk to him as he watches the girls play volleyball, much to Judy's irritation. Meg tells Angela that she either must participate or do nothing, which includes talking with boys. That evening, Paul and Angela go to the rec room to watch a movie, and they later leave when the movie is over, hand in hand as Angela slowly starts to become more friendly with him. When they are alone, Paul attempts to kiss Angela, but she gets uptight and walks back to her cabin. The next day at the lake, Paul sits beside Angela, who tells him that she cannot go in the water. Paul gets up and leaves when Meg arrives. Meg then asks Angela if she is going to swim, but Angela stops talking. Meg angrily shakes the silent girl until Ronnie pulls her away and tells her to leave Angela alone. In the girls cabin, Judy approaches Angela and is angry, thinking that she got Meg into trouble. Then Judy begins mocking Angela again and asks her why she will not shower or go swimming, or change clothes with the other girls. Angela continues to be silent, (but it is clear at this point onward that she is hiding something). Later that day, Angela is hit in the face with a water balloon by Billy and his friends, who are on a cabin rooftop throwing water balloons at passersby. Mel reprimands the boys on the roof and then grounds Billy for the rest of the summer. Ricky comes to the aid of Angela and tells her, \"I'll kill him!\" A little later, while his friends go off to play basketball, Billy stays behind in the cabin and goes into the restroom to take a \"wicked dump\". An unseen person locks him in the toilet stall. The unseen person then cuts the screen behind Billy and shakes a hive full of live bees into the room. Billy eventually breaks out of the stall but is stung to death, with bees covering his face. When Mel learns about Billy's death, he becomes more unsettled because he thinks that the camp will be shut down. Mel also grows suspicious of Ricky, whom he believes is killing those who bully Angela. The relationship between Angela and Paul grows strained when, that evening, Paul attempts to make out with Angela on the beach, which causes Angela to have a flashback to her youth when she and her brother Peter witnessed their father in bed with Lenny. Angela rejects Paul, who tries to have sex with her, and runs away. The next day, Paul, being confused and angered by Angela's rejection of his advances, is easily seduced by Judy, who lures him away from a game of capture the flag, a game assembled by counselor Jeff (Rick Edrich). In the woods, Angela and Ricky talk about Paul and his intentions where Ricky expresses to Angela that he does not trust him, but Angela reminds Ricky that Paul is just a friend. They both happen by Paul and Judy kissing which prompts Angela to run off. A little later, feeling guilty about what happened between him and Judy, Paul attempts to explain himself to Angela while on the beach at the lake but this time, she does not want to talk to him. Later that day, as Paul tries again to talk to Angela, he is shooed away by Judy and Meg, who pick up Angela and throw her into the water. After being taken out of the lake by lifeguard Hal (Mike Mahon) and having sand flung at her by several small children, a clearly disturbed Angela is comforted by Ricky, who swears vengeance on her aggressors. That evening, Meg, while preparing for a date with Mel, is murdered with a knife while taking a shower, having her back sliced open. Meg's disappearance goes largely unnoticed and camp activities go on as usual with a social being held. While there, Angela is approached by Paul, who again tries to apologize over the incident with Judy. Angela, for some strange reason, tells Paul to meet her later that night at the waterfront after the social. Next, six young children, the ones who threw sand at Angela, are taken camping with counselor Eddie (Fred Greene), and when two of them ask to go back because they feel sick, Eddie takes the two back to his car and drives back to the camp. But when Eddie comes back, he finds the other four children in their sleeping bags, hacked to bits with Eddie's ax, which was used to cut wood, lying on the ground, dripping with blood. Meanwhile, Mike and Judy are kissing, and Mike hides when Mel stops to ask where Meg is. After Mel leaves, Mike decides that he'd better leave. Mel finds Meg's dead body in the shower stall and thinks that Ricky killed her to get back at him. Judy, who had decided to skip the social to be with Mike, goes back to the girls' cabin, and he is killed when the unseen killer enters, and pushes her out. The murderer shoves a pillow on her face and forces a curling iron somewhere unknown (possibly her vagina). After the social, the camp is thrown into a panic when Eddie arrives and tells the counselors about the deaths of the four children. Ricky, who missed the social because he felt sick, overhears this news before being attacked by Mel, and he accuses him of killing Meg and all the others. After beating Ricky seemingly to death, Mel stumbles into the camp archery range, where he is shot in the throat with an arrow by the real killer. Ronnie calls the police and then tells Marie (Dee Dee Friedman) to gather the other counselors to round up the surviving campers to put them into one cabin until they can root out the killer. As the counselors and the police scour the camp, Angela meets Paul on the beach, where she tells him to undress, which Paul enthusiastically agrees to do. Ronnie and Marie find the dead Meg and Mel, while Frank the cop and Gene find Ricky, who is still alive. Gene carries the badly beaten Ricky away to a waiting ambulance as Frank radios for backup. Ronnie and Susie (Susan Glaze) find Angela nude on the beach, softly singing to herself and clutching a large knife and Paul's severed head in her hands. Angela is revealed to be both the killer and a boy--the thought-to-be-dead Peter. Through flashbacks, it is shown that after Martha gained custody of him, she decided to raise Peter as a girl, already having a son and coming to the conclusion that another boy simply would not do. It's also implied that Peter/Angela was mentally affected in a very negative way by seeing his/her father sharing a homosexual embrace with another man. The film suddenly ends with the nude and blood-covered Angela, male genitalia in full view, standing before Susie and Ronnie, letting out an animalistic hissing sound.",
      "writers": ["Robert Hiltzik"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086320/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2ODE0MTUwNV5BMl5BanBnXkFtZTYwNTk5NTE5._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Felissa Rose, Jonathan Tiersten, Karen Fields | See full cast and crew »"],
      "reviews": [
         "Horror films seemed the easy way to make a quick buck in the 80's. There was an abundance of them that graced video. I don't think half of them actually made it to the big screen. You can add Sleepaway Camp to that list. This is a typical scary film. It has it's moments and it is scary in some parts. It has some nice humour especially when they play camp jokes on each other. But having said all that, this movie is as good as it is and it's not too bad ) because the mother in this film is creepier than Mrs. Bates and she actually makes you want to kill her. But the two parts that I will never forget are images that are firmly planted in my brain, especially the part of it that stores nasty horror elements in it. The first was the death by curling iron. It is so horrific that it bothered me so much that I had to cover my eyes the second time I saw it. It is qutie graphic, not because of what they show, but because you know how nasty it is. But the one thing that will stay with me and probably anyone else that has seen this film is the very end. That last shot is so horrific, so way out of left field that you never see it coming. It just hits you and then it ends. It has a power of its own. And judging by the comment on here from other users, they feel the same way. This is a film absolutely worth checking out.",
         "When I first picked up the box cover of Sleepaway Camp, I said to myself, \"Just another stupid slasher film with a camp setting.\" Yes, it was another stupid slasher film with a camp setting. It was the best damn slasher film with a camp setting of all time. It provided a simple story with sexy teenagers from the early 80s innocently attending a Christian sleepaway camp. It was really good. The acting and writing alone could not make the movie good though, it was the ending. It had the best movie ending in cinematic history (until I saw Multiple Maniacs). I will not reveal the specifics, but I will urge you to rent the movie and see for yourself, because it is one of the most surprising and shocking endings ever conceived. You will not be disappointed.",
         "Many people have made the connection to the Friday the 13th series with Sleepaway Camp for obvious reasons. They both came out within a few years of each other and all the action takes place at a summer camp. However, the primary theme in the Friday the 13th series is vengeance. Vengeance of a mother for the neglect and drowning of her son and then vengeance by the son for the murder of his mother. Of course vengeance is also key to all the murders in Sleepaway Camp but for entirely different motivations. The murders of Sleepaway Camp come from sexual repression, being picked on, and sexual molestation. All these derive from feelings of shame and embarassment which is different than the motivations of Friday the 13th. A better comparison for Sleepaway Camp would be Psycho. First let me say that in no one are the two comparable, Psycho is a masterpiece of story, directing, acting, and camera work, Sleepaway Camp is none of these. But they share similar thematic characteristics. Norman Bates suffers an Oedipal complex but when his mother takes a new lover he kills her and suffers tremendously. He is overwhelmed by guilt and shame and brings her back to life in his mind. But whenever he sees an attractive woman he feels guilty and shameful and murders them because his mother is jealous for his affection. Sleepaway Camp is a more bizarre twist on these themes. Angela's (who turns out to be a boy) father and sister are both killed in a boating accident. But unlike Jason, Angela does not wreck havoc on the camp for those deaths. Instead Angela is adopted by her demented Aunt and forced to become a girl because the Aunt already has a son, Ricky. There are two scenes in which I'm guessing a young Ricky and Angela witness two men, presumably Ricky's father and his lover having sex. These scene is followed by a scene in which suggests a sort of sexual molestation between young Ricky and young Angela. These two pivotal events greatly affect Angela and cause a sexual crisis within him/her. What begins the rampage at Camp Arawak is another sexual molestation performed by the cook on Angela. This act sets her/him off the deep end and she/he begins to kill anyone who hurts her/him in any way. Then to complicate matters she begins to have a relationship with Paul. Angela has a gender identity crisis and cannot decide whether she/he is attracted to Paul or to other women. It probably doesn't help her that she is surrounded by Men in booty shorts and half shorts, who would be mistaken for flamboyantly gay in today's culture. So she decides to have a relationship with Paul and seems happy but he wants more, to feel her breasts, which of course she doesn't have. Angela finally loses all control when she catches Paul cheating on her with Judy. She brutally murders Judy by raping her with a curling iron. Then she goes berserk and kills four younger children in their sleeping bags. I think they kicked sand at her. Then she decides to reveal her secret to Paul. And she does and promptly decapitates him. Finally in the creepiest scene that I never saw coming she makes a crazy face with a gaping open mouth, ax in hand, completely naked and breathes heavily making slight animalistic noises. This facial expression is comparable to one that Norman Bates makes dressed as the mother at the end of Psycho. The sister of Marion is in the basement, finds the skeleton of the mother and then turns to see Norman dressed as the mother making a very similar crazy expression. So in conclusion Psycho is a much more accurate comparison because both involve characters who are sexual confused, are men who dress as women, and kill when their sexual identites come into crisis. I do not think Sleepaway Camp is a great movie, but had it better acting and special effects it could be. It is a thoroughly rich text. The reason many people have responded to the ending, which I found shocking and disturbing and will unfortunately never leave me, is because it plays on deeply disturbing psychological events in people's lives. And for that matter I think it is much scarier than a Friday the 13th or Nightmare on Elm Street which are basically about vengeance for the murder of a person.",
         "It had been years since I saw this movie, but I remembered the key elements. Young girl is harassed at camp, her bullies start dying off, unforgettable ending. I just never realized how big of a classic this really is. For those of you who don't know, the film starts off with a man on a boat in the middle of a lake with his two children. The boat tips over, another boat comes racing towards them and kills all but one. Flash forward 8 years later, the sole survivor now lives at her aunts house, where she sends the girl, Angela, and her cousin, Ricky, to summer camp. At camp, Angela is brutally teased and taunted by her fellow campers. Her cousin Ricky continuously comes to her defense, but the bullies are all being killed off by a mysterious unknown attacker. All of this leads up to an ending that I believe to be one of the most shocking in cinema history. Felissa Rose gave an excellent performance as Angela, who makes you sympathize heavily for her, due to her soft mannered and soft spoken personality. She is very much the kid we all were, and some of you might still be. A vulnerable target for those with a superiority complex, very much the outcast. Writer/Director Robert Hiltzik fills the film to the brim with psychological undertones, masterfully creating a genuine thriller out of this low grade, slasher extraordinare. But you don't care about that, do ya'. You want gore! And while it's not an overtly gory film, there are enough offerings of blood here and there to keep you gorehounds satisfied. Not to mention some nifty death scenes. And the ending, my friends, is what makes Sleepaway Camp worth the watch. That's not to say SC isn't a good film, in my opinion it's great, but for those of you who have no clue as to how it ends... You will not be disappointed. They just don't make horror films like this anymore, folks.",
         "Robert Hiltzik's \"Sleepaway Camp\" is one of the most memorable slasher movies ever made.Of course the acting and dialogue are terrible,but writer/director Robert Hiltzik manages to create very creepy atmosphere throughout,the killings are original and gruesome and the ending is very shocking and twisted.Felissa Rose is marvelous as Angela,especially with her creepy stare.\"Sleepaway Camp\" is a little bit different than your standard slasher fare-it's filled with strange and deviant characters,disturbing flashbacks and sexual subtexts.There is only a little bit of gore,still we do get an arrow through the neck,severed head,a bloody stabbing and death by hair curler.Overall,\"Sleepaway Camp\" is a fast-paced slasher flick with a wonderful central character of Angela.Highly recommended.",
         "This 1983 horror slasher gem was written and directed by first time director Robert Hiltzik. The story begins with a boating accident which kills the main character Angela's father and brother. We then move forward in time, now Angela is living with her Aunt Martha and her cousin Ricky. Angela and Ricky then go to camp and it is Angela's first time going but Rickey has been there before. Angela doesn't get along with the other campers and is very quiet. A series of murders begin and it is a mystery who is killing all these people. Could it be Ricky who made death threats, could it be Mozart killing these campers because he was picked on, could it be Angela, or could it be someone else? This movie has very interesting and unique deaths without gore. This movie is not for everyone, if you are a fan of cheesy horror movies or just slashers definitely check out this movie. You will never forget the ending.",
         "After you watch Sleepaway Camp, you will either love it or hate it. I loved this movie after I watched it... The weird thing about this movie though it has everything I hate in Horror movies. Sometimes the acting was cheese. Especially that horny kid that keeps trying to hookup with Angela. He dropped some one-liners that made me laugh cause it was so lame. It reminded me of the 50's for some reason.... But somehow it suited the movie, which didn't make me hate it. The story is pretty predictable. You have an idea what is really happening in the movie but the ending throws it all out the window cause you never expected that to happen... I think it was the ending that made it all worth watching and made me appreciate it. The ending made me zone out and gave me the chills. The reality of the story is twisted which is why I watched again after I first saw it. Overall, I highly recommend this cult-classic. It's truly one of a kind.",
         "This is 80's American Cheese at it's greatest! The cast does a great job and the script is actually really good. If your a fan of cheesy slasher flicks this is one you should certainly check out...and absolutely DO NOT MISS THE ENDING!!!! One of the creepiest endings I've ever seen in a movie which is sure to give anyone the chills. A truly wicked low budget horror flick.",
         "Sleepaway Camp is....you guessed it- about a group of kids at a summer camp being knocked off one by one. Its got that classic 80's slasher music with bad acting, editing, and effects, but thats what I love about them. This is one of those slasher flicks thats good for a movie night with your friends. And that ending you've heard so much about...its pretty cool and unexpected. Its not only a slash flick, but a film about sexual identity. Worth the price of rental. Check it out!",
         "We all know this plot: People at a summer camp who are mean to a very shy girl named Angela (Felissa Rose) begin to die in gruesome ways. The difference here is the nasty edge to things and solid Ed French make-up FX. Obnoxious, overacting characters screaming at each another in their grating New York accents are always good for some laughs, too. Kids make fun of Angela (\"You're a real carpenter's dream! Flat on both ends and in need of a screw!\"), nail her with water balloons and push her down. Not since CARRIE has a lead character had it so bad. Flashbacks prove how having same-sex parents can lead to homicidal behavior! There's death by drowning, scalding water, decapitation, bees, snake and curling iron (guess where?), a child molester cook, a PSYCHO shower scene, skinny dipping and one of the best endings of the 80s. Followed by 2 1/2 comedy sequels. Score: 6 out of 10"
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["American Eagle"],
      "summaries": [
         "After a horrible boating accident kills her family, Angela, a shy and sullen young girl, moves in with her eccentric aunt Martha, alongside her protective cousin Ricky. One summer, Martha sends the kids to Camp Arawak. Soon after their arrival, a series of bizarre and increasingly violent accidents begins to claim the lives of various campers. Who is the twisted individual behind these murders? The disclosure of the murderer's identity is one of the most shocking climaxes in the history of American cinema.",
         "Slightly traumatized and painfully shy Angela Baker is sent away to summer camp with her cousin. Not long after Angela's arrival, things start to go horribly wrong for anyone with sinister or less than honorable intentions."
      ],
      "budget": 350000
   },
   "movielensId": 3843,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-11-18",
      "dvdReleaseDate": "2000-07-25",
      "directors": ["Robert Hiltzik"],
      "runtime": 85,
      "movieId": 3843,
      "title": "Sleepaway Camp",
      "mpaa": "R",
      "actors": [
         "Felissa Rose",
         "Jonathan Tiersten",
         "Karen Fields",
         "Christopher Collet",
         "Mike Kellin",
         "Katherine Kamhi",
         "Paul DeAngelo",
         "Thomas E. van Dell",
         "Loris Sallahian",
         "John E. Dunn",
         "Willy Kuskin",
         "Desiree Gould",
         "Owen Hughes",
         "Robert Earl Jones",
         "Susan Glaze"
      ],
      "imdbMovieId": "0086320",
      "originalTitle": "Sleepaway Camp",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["yfZR1Lqjws4"],
      "plotSummary": "Slightly disturbed and painfully shy Angela Baker is sent away to summer camp with her cousin. Not long after Angela's arrival, things start to go horribly wrong for anyone with sinister or less than honorable intentions.",
      "tmdbMovieId": 13567,
      "avgRating": 2.90897,
      "releaseYear": "1983",
      "numRatings": 390,
      "posterPath": "/gkAgVMS2mShi8bXWUSB8VvDshl2.jpg"
   }
}