{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "lolita",
            "id": 2087
         },
         {
            "name": "adoption",
            "id": 2393
         },
         {
            "name": "saint tropez",
            "id": 8080
         }
      ],
      "imdb_id": "tt0049189",
      "video": false,
      "title": "...And God Created Woman",
      "recommendations": [
         8286,
         64559,
         11121,
         104441,
         124485,
         63691,
         116048,
         59143,
         38414,
         1802,
         85514,
         64968,
         101482,
         44065,
         3425,
         125150,
         106196,
         78281,
         227245,
         70806
      ],
      "backdrop_path": "/fAIVu4byOv1FZ4zY9LOnN88ssUi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Juliette Hardy",
               "gender": 1,
               "credit_id": "52fe44a6c3a36847f80a257b",
               "name": "Brigitte Bardot",
               "profile_path": "/3zQZJKE1TBXEi1khQlLI321KhHX.jpg",
               "id": 3783,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Michel Tardieu",
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a257f",
               "name": "Jean-Louis Trintignant",
               "profile_path": "/rvwO5Rsm2ZohPCQjwEvY30PBp68.jpg",
               "id": 1352,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Eric Carradine",
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a2583",
               "name": "Curd Jürgens",
               "profile_path": "/psFeEFYhy1tUn9y4vLxF9eSKMK9.jpg",
               "id": 10459,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Madame Morin",
               "gender": 1,
               "credit_id": "52fe44a6c3a36847f80a2587",
               "name": "Jane Marken",
               "profile_path": "/xTO3v5ilmwp8WqcF81aW1DcZ6ii.jpg",
               "id": 25160,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "M. Vigier-Lefranc",
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a258b",
               "name": "Jean Tissier",
               "profile_path": "/ldJLQTxRlpgfSFQBHJhPHkst5tv.jpg",
               "id": 39180,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Lucienne",
               "gender": 1,
               "credit_id": "52fe44a7c3a36847f80a2593",
               "name": "Isabelle Corey",
               "profile_path": "/kwOy4Rl0RBUbW9MLDJGa9zDYcEt.jpg",
               "id": 55778,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mme Vigier-Lefranc",
               "gender": 1,
               "credit_id": "52fe44a7c3a36847f80a258f",
               "name": "Jacqueline Ventura",
               "profile_path": null,
               "id": 55777,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Antoine Tardieu",
               "gender": 2,
               "credit_id": "56314c34c3a3681b54010b21",
               "name": "Christian Marquand",
               "profile_path": "/p1YD5nxNdCKtxJExlN1BIrvNrl4.jpg",
               "id": 38914,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "5704521d9251415bbe000ef4",
               "name": "Georges Poujouly",
               "profile_path": "/i98NGRrw3Iqy6NBWsVXwlWOu4ka.jpg",
               "id": 12274,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "le jeune danseur qui fait tapisserie",
               "gender": 2,
               "credit_id": "5982e62dc3a36834c80097d0",
               "name": "Jean Lefebvre",
               "profile_path": "/bSvA4RWoxV9sK8CrR24sGSrWMYc.jpg",
               "id": 37457,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a256b",
               "name": "Raoul Lévy",
               "profile_path": null,
               "id": 37775,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a2571",
               "name": "Roger Vadim",
               "profile_path": "/oftdq5DjC1loKRBLP4KfKauuc5e.jpg",
               "id": 53767,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a2577",
               "name": "Roger Vadim",
               "profile_path": "/oftdq5DjC1loKRBLP4KfKauuc5e.jpg",
               "id": 53767,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a7c3a36847f80a2599",
               "name": "Raoul Lévy",
               "profile_path": null,
               "id": 37775,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a7c3a36847f80a259f",
               "name": "Paul Misraki",
               "profile_path": null,
               "id": 24295,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a7c3a36847f80a25a5",
               "name": "Armand Thirard",
               "profile_path": null,
               "id": 2579,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a7c3a36847f80a25ab",
               "name": "Victoria Mercanton",
               "profile_path": null,
               "id": 53771,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a7c3a36847f80a25b1",
               "name": "Jean André",
               "profile_path": null,
               "id": 54366,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.313964,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 8420,
      "vote_count": 63,
      "budget": 0,
      "overview": "Juliette Hardy is sexual dynamite, and has the men of a French coastal town panting. But Antoine, the only man who affects her likewise, wouldn't dream of settling down with a woman his friends consider the town tramp.",
      "similar": [
         11448,
         5126,
         10719,
         802,
         37135,
         873,
         644,
         22881,
         76494,
         334543,
         26550,
         11544,
         20352,
         10152,
         888,
         9769,
         87567,
         10137,
         28313,
         10995
      ],
      "original_title": "Et Dieu… créa la femme",
      "runtime": 95,
      "poster_path": "/oEFiaX89TZKrA7qTBMcibhPGJ4G.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Iéna Productions",
         "id": 2486,
         "origin_country": ""
      }],
      "release_date": "1956-11-28",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "...but the devil invented Brigitte Bardot!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Roger Vadim"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Roger Vadim",
         "Raoul Lévy"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0049189/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkyMDA4Mjc0Nl5BMl5BanBnXkFtZTgwMzgwODgxNDE@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Brigitte Bardot, Curd Jürgens, Jean-Louis Trintignant | See full cast and crew »"],
      "reviews": [
         "Sexuality is a mysterious creature at times, determined by many different elements: the physical appearance of a person, the way their body moves, their attitude towards life, the way they express their emotions, their creativity, the subtle fragrance they give off, the way they talk, and sometimes an x-factor that can't be defined. What strikes me about Bardot's powerful sexuality is that cinema really hadn't seen anything like it before she came around. The closest example I can think of in American film might be Lauren Bacall in \"To Have and Have Not,\" but even that misses the mark. Bardot was not only a beautiful woman but she had a fun, mischievous and freedom-loving spirit and a fiery mind lurking around behind her sometimes poorly written characters, and these things make her even more attractive. Plus, she had a great voice. Which is why I was stunned to see a trailer for _Et Dieu... créa la femme_ dubbed into English at the end of the subtitled version. The woman doing Bardot's voice sounded awful, and so much of Brigitte's sexuality was lost. Imagine Bacall telling Bogie \"You know how to whistle, don't you Steve?\" in a squeaky, high-pitched voice. Would she be as sexy? I don't think so. Yet people watching the dubbed version of this film are getting something similar. As far as the film itself goes, most everything has already been said in other comments. Bardot does a great job as Juliette - who else could have done the role so well? - and Jurgens was quite good as Eric Carradine. The setting is luscious and fits perfectly with Bardot's character and the overall mood of the tale. The music is excellent, from the title sequence at the beginning through the dance scene at the end. The story can be cliched at times and there are definitely machista elements. But it's not a bad story either, with good tension created between the brothers. The fight sequences, as someone else mentioned, are laughable and poorly done. But it doesn't really matter. It's Bardot's show all the way - from her nude Cinemascope sunbathing shot that opens the film, with the witty dialog between her and Jurgens, to her erotic dance that serves as the climax of the story. Along the way we get several nice scenes that show her broader persona, including the one where she sets the bird and rabbit free in the field, and the scene in the bookstore with the woman from the orphanage. But, for the sake of Dieu, don't see this movie dubbed.",
         "The image of a nude Brigitte Bardot stretched out on her stomach, as she appeared at the very beginning of \"And God Created Woman,\" used to create posters that sold by the thousands and helped to popularize her initials, \"B.B.\" The scandal she provoked launched the film and made it an unprecedented success\u0085 Her image embodied a unique combination of perversity and innocence, a mix she displayed in her powerful portrayal of the fascinating character in the film\u0097a young woman, proud of her body, who ultimately rejects morality\u0085 However, this opposition to conventional behavior was more a declaration of intent than of reality\u0085 The film was actually a morality tale: the liaison of the heroine and her brother-in-law was severely criticized, and conjugal love triumphed over the other more sordid union in the end\u0085 The controversy of \"An God Created Woman\" lay not so much in the actual events, but in the female character's impudence\u0085 And even if Vadim's message has become dated, it nonetheless documents a difficult period of time and the frustration that accompanied a living, breathing, sexual fantasy, an object of desire, a symbol of sexual liberty\u0085 Sex was no longer voyeurism, as it was in George Lacombe's \"The Light Across the Street,\" (La Lumière d'en face) but instead became a reality which called for one's attention\u0085 Seen in this way, it is incontestable that \"B.B.\" and Vadim contributed to the liberation of sexual mores, almost presaging the Sexual Revolution\u0085",
         "\"Et Dieu... crea la femme\" is Brigitte Bardot's breakout film. She explodes on the screen, overwhelming the audience (the male audience by sure). I bet that women, as well, are shocked by the thought that such a rival-bomb can exist. The movie itself have always been underrated. It was a scandal at the epoch and we can easily see why. Actually, the erotic atmosphere created by BB in \"Et Dieu... crea la femme\" is amazing even for today standards (immensely superior to that of current movies, in my personal opinion). At any rate, the scandal made the movie be automatically considered bad (needless to say, people went crazy to see it). Curiously enough, a dozen of years later several ugly movies were automatically considered good by the critics because of the scandal they raised! Now that our modern eyes no longer see the scandal, we may judge \"Et Dieu... crea la femme\" a nice film, made VERY special by Brigitte Bardot's presence. The stunning locations of a still tourism-free Cote d'Azur are beautifully photographed. The story is interesting and entertaining. Melodrama is systematically avoided. The script contains a good deal of typical French wit: sharp, cynical, but with a melancholic subtext. A couple of instances. The mature gentleman Eric Carradine, trying to justify Juliete's bad behavior \"I am the only one to be guilty of that\" and the old woman \"Don't delude yourself, sir...\". Again Carradine \"I fell in love with a young girl and I gave money for her to marry another man. How do you call it?\" and a friend \"I call it wisdom\". Bardot brilliantly plays Juliete, a remarkably interesting character. Probably, more than her free and mindless attitude toward love affairs, Juliete's true personality may be described as anarchist selfishness. She doesn't give a damn for others. She just does everything she wants, not caring people's opinions, prejudices or feelings. She loves animals, though. A further point of interest is that, according to her own autobiography, BB's personality has some in common with that of Juliete's. I don't comment Brigitte's sex-appeal. Words are not enough, just look at her and enjoy. The life at the village on the sea and the various other characters are described with accuracy. Jurgens, Trintignant and the remainder of the cast work well. The cult-scene of the movie is Juliete's Mambo dance. Here we understand what Europeans of the 1950s thought to be a torrid scene. We also see that they were right! Seeing the movie, many are displeased that (seemingly) a dose of heavy slaps turns the wild Juliete into a devoted spouse. That looks machist ideology. Well, to begin with, to beat guilty women is just a realistic and predictable behavior in the low class environment of a village of fishermen in the 1950s. But, above all, do you think Juliete-Brigitte tamed by few hits? Come on! She accepts the slaps only because in that very moment she has thought it good to take them. But who knows the future? Believe me, Juliete is far from being tamed, and the end of the film by no means coincides with the end of the story... In spite of possible criticism, I like \"Et Dieu... crea la femme\". Right or wrong, this film has a relevant place in the history of cinema.",
         "Pfff... In all her 48 movies Brigitte Bardot never catches public imagination more thouroughly and efficiently than she does in 'et Dieu créa la femme'. Her performance in this movie really makes the sparks fly off your screen. Make sure you see the new, cleaned up version, by the way. You'll better appreciate its fine use of colors. By this statement we have captured the essence of 'Dieu'. There really is nothing more positive to say about this movie. But it is enough. More than enough. Surely no one could have played the role of Juliette better than Brigitte did. By wearing her long, blond hair loose, Brigitte suggest sexual availability. Paradise on earth is just around the corner, she tells us. And today Brigitte's message sounds as fresh and promising as in 1956. That's why 'et Dieu créa la femme' is immortal.",
         "In St. Tropez, the orphan Juliete Hardy (Brigitte Bardot) is an eighteen years old woman sexually active and ahead of time, strongly desired by the wealthy middle age man Eric Carradine (Curd Jurgens). She has a crush on Antoine Tardieu (Christian Marquand), the older son that works in Toulon of a poor family that owns a modest shipyard, but he just want to have one nightstand with her. When Juliete's stepparents decide to send her back to the orphanage because of her bad reputation in the town, Antoine's brother Michel Tardieu (Jean-Louis Trintignant) proposes to marry her and she accepts, and she begins to love him. But when the Tardieu family decides to sell the shipyard to Eric and Antoine returns to St. Tropez, her lust for him blossoms again and becomes an announced tragedy. This is the first time that I watch \"Et Dieu... Créa la Femme\" and I found it a surprisingly good movie. The story is extremely sexy and ahead of time, and works mainly because of the extremely beautiful and sensual Brigitte Bardot. Her sensuality and eroticism is impressive even in 2007, and I confess that I felt in love for her. The IMDb Tagline \"...but the devil invented Brigitte Bardot!\" is amazing, certainly one of the best I have ever read in this outstanding site. My vote is seven. Title (Brazil): \"\u0085E Deus Criou a Mulher\" (\"\u0085And God Created the Woman\")",
         "Pouty Brigitte Bardot in the movie that made her an international star. Is it me or does her nubile orphan Juliette bear the basic \"accoutrements\" of those legendary tragediennes of 19th century English literature like Tess of the D'Urbervilles or Eustacia Wye? It might explain Juliette's last name: Hardy. Except \"And God Created Woman\" is set in St. Tropez and is not a tragedy. Flat out, it's a middle-aged Frenchman's chic, paternalistic vision of the irrepressible nymphet. By paternalistic, I mean we know more about what the men in her life think about her than what she thinks about them or herself. Curt Jurgens' character (who, I think, stands in for director Roger Vadim) sizes her up quickly, and in the end, blows town with Christian Marquand who plays Antoine, the man she really wants. He's got her number; to him, she's the type who refuses to be tamed, who uses her obvious \"gifts\" to get what she wants, who's easily bored and distracted, and a slave to her whims. To Antoine, she is an incorrigible wanton; he has no faith that she'll change. But Antoine has his way with her (He figures it's what she wants, and it is), abuses her, and tries to wise up his younger brother (Jean-Louis Trintignant) who had married her. By chic, I mean Vadim always knew how to cast attractive people in his movies. Bardot isn't the only \"hotty\" here; Marquand matches her heat, watt for watt, and with less effort. There's a jazzy hipness to their look for which few directors besides Vadim had a talent. Still, when Juliette is rejected and runs back to her trusting husband, the movie fades from memory, and the last shot in the picture (of the street where she lives) recalls the landscapes Cezanne abstracted into modern art oblivion.",
         "Every great actress has her breakthrough role--the one that really puts her over with the public--and for 22-year-old Brigitte Bardot, that role came in 1956's \"...And God Created Woman.\" In this film she plays an 18-year-old named Juliette, who marries younger brother Michel (Jean-Louis Trintignant) to spite older brother Antoine, all the while being pursued by the wealthy, middle-aged Carradine (Curt Jurgens). It is easy to see why BB proved so popular in this film. She is indeed very beautiful, and writer/director/husband Roger Vadim shows her off to good effect. OK, to address the thought uppermost in the minds of my fellow all-American red-blooded pigdogs, we get to see BB in all manner of formfitting outfits (sorry, no nude scenes or swimwear), seducing Antoine whilst laying in the surf, teasing behind sheets and under blankets, and, most impressively, doing a frenzied mambo. I dwell on BB's physique because, really, it is what the film is all about. Personalitywise and characterwise, Juliette is a fairly tiresome, repugnant and conscienceless creature. But physically...ooh la la! No wonder Carradine says that she was born to destroy men! The film also boasts location filming in San Tropez, a town that here looks nice and quaint, if surprisingly run-down. The DVD itself is mighty fine, with an impressive wide-screen image, crisp color and adequate subtitling. Men, pair this movie one night with the 1935 Marlene Dietrich vehicle \"The Devil Is A Woman\" and you just might give up on females for good!",
         "This was the movie which launched Brigitte Bardot as the sex symbol of the fifties and sixties in the the role of the teenager Juliette. And this is really a movie about a woman. She fills the screen during the whole projection with her gorgeous and generous anatomy and also with her way of smiling, talking, laughing, walking and dancing in a mixture of flesh, fire and beauty displaying moreover her personality and her fears, desires and anguish. However she is no \"femme fatale\" and only a tender teenager who cannot be blamed for having been born so pretty, charming and physically well shaped and who sometimes appears almost like a defenceless child. The story involves not the classical triangle but a quadrilateral instead whose vertices are besides Juliette herself, her young husband, his brother and the rich middle aged businessman who covets her since the beginning. The end of the story is somewhat conventional but acceptable anyway. This movie was received like a bomb in the movie world shaking some moral canons and shocking a lot people although by today's patterns it can be judged as rather innocent. Anyway the story is simple,original and well conceived and the actors play well which makes it a good movie after all.",
         "This groundbreaking Vadim film made Ms. Bardot the hottest sex symbol on the planet back in 1956. Vadim was never much of a director, but he had great taste in women (Bardot, Deneuve, J. Fonda). Brigitte Bardot is a knockout as a spoiled and selfish 20 y/o who doesn't seem to know what she wants, but all the men want HER! No one walks down a street like Ms. Bardot. Beautiful location and good performances all around. It's too bad the dubbed version has a terrible voice used for Brigitte, but her physical presence carries it anyway. She knows how to move and hold your attention. Just an incredibly vibrant creature of the 50's. She has undervalued as an actress and no one was sexier or more sure of herself (at least ON screen). Best performance = Bardot. A 7 out of 10.",
         "I see there are but a few ratings for this incredibly successful movie..But it is only because it's french (foreign) and old. Young Brigitte Bardot (now a living legend) plays a young, sexually attractive orphan who basically, becomes the fantasy of every man in town. She then gets married with a nice and clean young man, but she can't keep herself from cheating on him. This movie was a hit and it became a cult movie. I wonder why..The storyline is flat and ordinary, the acting as well...Oh! yes, but there was BB and her beautifully shaped body, her full lips, and her sensuality like there's never seen before.. A star was born..."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cocinor",
         "Iéna Productions",
         "Union Cinématographique Lyonnaise (UCIL)"
      ],
      "summaries": [
         "Antoine promises to take the orphaned Juliette away from St. Tropez after a party where she has wandered onto the yacht of the urbane Eric. But in the morning the bus and Antoine zip by Juliette's stop and she runs into the field to capture the rabbit she set free moments before. About to be sent back to the orphanage by her foster mother, she identifies with the rabbit. Antoine's younger brother Michel comes to Juliette's rescue with a marriage proposal and she accepts. Eric wants the brothers' shipyard as a casino site and brings Antoine back to St. Tropez. Life gets complicated.",
         "In St. Tropez, the orphan Juliete Hardy is an eighteen years old woman sexually active and ahead of time, strongly desired by the wealthy middle age man Eric Carradine. She has a crush on Antoine Tardieu, the older son that works in Toulon of a poor family that owns a modest shipyard, but he just want to have one nightstand with her. When Juliete's stepparents decide to send her back to the orphanage because of her bad reputation in the town, Antoine's brother Michel Tardieu proposes to marry her and she accepts, and she begins to love him. But when the Tardieu family decides to sell the shipyard to Eric and Antoine returns to St. Tropez, her lust for him blossoms again and becomes an announced tragedy.",
         "Juliette Hardy is sexual dynamite, and has the men of a French coastal town panting. But Antoine, the only man who affects her likewise, wouldn't dream of settling down with a woman his friends consider the town tramp. While Antoine's away, his younger brother Michel, who worships Juliette, proposes to her; out of liking rather than love, she accepts, and their marriage becomes happy. But what will happen when Antoine returns?",
         "In sunny St. Tropez, a young sexpot loves one brother but marries the other."
      ],
      "budget": 300000
   },
   "movielensId": 3845,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1956-11-28",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["Roger Vadim"],
      "runtime": 95,
      "movieId": 3845,
      "title": "...And God Created Woman",
      "mpaa": "",
      "actors": [
         "Brigitte Bardot",
         "Jean-Louis Trintignant",
         "Curd Jürgens",
         "Jane Marken",
         "Jean Tissier",
         "Isabelle Corey",
         "Jacqueline Ventura",
         "Christian Marquand",
         "Georges Poujouly",
         "Jean Lefebvre"
      ],
      "imdbMovieId": "0049189",
      "originalTitle": "Et Dieu… créa la femme",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Kmqv88jWhyE"],
      "plotSummary": "Juliette Hardy is sexual dynamite, and has the men of a French coastal town panting. But Antoine, the only man who affects her likewise, wouldn't dream of settling down with a woman his friends consider the town tramp.",
      "tmdbMovieId": 8420,
      "avgRating": 3.28125,
      "releaseYear": "1956",
      "numRatings": 208,
      "posterPath": "/oEFiaX89TZKrA7qTBMcibhPGJ4G.jpg"
   }
}