{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "prisoner of war",
            "id": 1968
         },
         {
            "name": "sadism",
            "id": 4426
         },
         {
            "name": "necrophilia",
            "id": 5919
         },
         {
            "name": "nazi exploitation film",
            "id": 161351
         },
         {
            "name": "ilse koch",
            "id": 161352
         }
      ],
      "imdb_id": "tt0071650",
      "video": false,
      "title": "Ilsa: She Wolf of the SS",
      "recommendations": [
         7392,
         28746,
         36879,
         11822,
         29343,
         28172,
         28656,
         15018,
         27813,
         8691,
         13553,
         14005,
         40146,
         27346,
         1559,
         12237,
         25239,
         47886,
         39342,
         27313
      ],
      "backdrop_path": "/6RuDyw05aHHWVQg7KH7TUVjTfHS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ilsa",
               "gender": 1,
               "credit_id": "52fe43fdc3a368484e009669",
               "name": "Dyanne Thorne",
               "profile_path": "/jbRkEPC5ozPNqFCCkOqjhL4Mvh2.jpg",
               "id": 52611,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Wolfe",
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e00966d",
               "name": "Gregory Knoph",
               "profile_path": null,
               "id": 86642,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mario",
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e009671",
               "name": "Tony Mumolo",
               "profile_path": null,
               "id": 86643,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe43fdc3a368484e009675",
               "name": "Maria Marx",
               "profile_path": null,
               "id": 86644,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Kata",
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e009679",
               "name": "Nicolle Riddell",
               "profile_path": null,
               "id": 86645,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ingrid",
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e00967d",
               "name": "Jo Jo Deville",
               "profile_path": null,
               "id": 86646,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Maigret",
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e009681",
               "name": "Sandy Richman",
               "profile_path": null,
               "id": 86647,
               "order": 6
            },
            {
               "cast_id": 25,
               "character": "Binz",
               "gender": 2,
               "credit_id": "5860158c92514115cf021432",
               "name": "George Buck Flower",
               "profile_path": "/xHzW4GszCLTZLNxvTcKL9ICuLIc.jpg",
               "id": 54564,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Gretchen",
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e009689",
               "name": "Rodina Keeler",
               "profile_path": null,
               "id": 86648,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "General",
               "gender": 2,
               "credit_id": "57dda3abc3a368142c001f99",
               "name": "Richard Kennedy",
               "profile_path": null,
               "id": 52616,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Prisoner in Pressurized Chamber (uncredited)",
               "gender": 1,
               "credit_id": "57dda420925141784f002024",
               "name": "Uschi Digard",
               "profile_path": "/meaV6JRaPXOIokmWIae2tEb2c3q.jpg",
               "id": 41699,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Prisoner - Redhead (uncredited)",
               "gender": 1,
               "credit_id": "57dda432925141785d001f82",
               "name": "Colleen Brennan",
               "profile_path": "/lVie2gankWtswC8ee0cZSWqUEvn.jpg",
               "id": 40430,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Rosette (uncredited)",
               "gender": 0,
               "credit_id": "57dda448c3a3681428001f4a",
               "name": "Jacqueline Giroux",
               "profile_path": "/2RA7mRv6s86QzLIvWr60ay6jfQW.jpg",
               "id": 1177733,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Nazi Guard (uncredited)",
               "gender": 2,
               "credit_id": "57dda472c3a3681422001dc8",
               "name": "John F. Goff",
               "profile_path": null,
               "id": 52622,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Prisoner (uncredited)",
               "gender": 1,
               "credit_id": "57f8006dc3a3683aa7004ae3",
               "name": "Sandy Dempsey",
               "profile_path": "/u0mfZU1ocq0tNNFoNAIVgkrTlNf.jpg",
               "id": 101467,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43fdc3a368484e00968f",
               "name": "Don Edmonds",
               "profile_path": null,
               "id": 4695,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e009699",
               "name": "Jonah Royston",
               "profile_path": null,
               "id": 192721,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e00969f",
               "name": "John C.W. Saxton",
               "profile_path": null,
               "id": 69890,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fdc3a368484e0096a5",
               "name": "David F. Friedman",
               "profile_path": "/oFi1eCcemfruKEGuHQClqCUOnKX.jpg",
               "id": 99934,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e0096ab",
               "name": "Glenn Roland",
               "profile_path": null,
               "id": 52626,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e0096b1",
               "name": "Kurt Schnit",
               "profile_path": null,
               "id": 1188383,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43fdc3a368484e0096b7",
               "name": "Joe Blasco",
               "profile_path": null,
               "id": 103869,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 8.817863,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 20850,
      "vote_count": 61,
      "budget": 0,
      "overview": "Ilsa is a warden at a Nazi death camp that conducts experiments on prisoners. Ilsa's goal is to prove that woman can withstand more pain and suffering than men and should be allowed to fight on the front lines",
      "similar": [
         1694,
         2652,
         588,
         9426,
         126889,
         384521,
         336843,
         3034,
         9383,
         22825,
         9738,
         399055,
         4961,
         13492,
         18111,
         3035,
         19901,
         73861,
         10781,
         24395
      ],
      "original_title": "Ilsa: She Wolf of the SS",
      "runtime": 96,
      "poster_path": "/aXK4fYcznrklsYrvASyujMNpN8F.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Aeteas Filmproduktions",
         "id": 15314,
         "origin_country": ""
      }],
      "release_date": "1975-10-01",
      "vote_average": 4.9,
      "belongs_to_collection": {
         "backdrop_path": "/o03hf2Kgfx72sgYRCgGlzFiocR1.jpg",
         "name": "Ilsa, She Wolf of the SS Collection",
         "id": 123249,
         "poster_path": "/lC9CPYCuoV8e5BnksTlK14fE7Ai.jpg"
      },
      "tagline": "The most dreaded Nazi of them all!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Edmonds"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Jonah Royston",
         "John C.W. Saxton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071650/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NDUwODA2NV5BMl5BanBnXkFtZTcwMDg5MDgyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Dyanne Thorne, Gregory Knoph, Tony Mumolo | See full cast and crew »"],
      "reviews": [
         "First off, understand my rating of Ilsa. Ilsa by general movie standards is not a good movie. If you were to put it up against any of the so called \"classic\" movies, it would not stand up. But those who search out Ilsa She Wolf of THe SS or any of the others in the series aren't doing so because they want to see a tense, well acted, well directed movie. Ilsa is first and foremost an exploitation film and, realizing that, I have to say it is in the upper echelons of its field because it wallows in filth and does so unapologetically. It boils down to this. If you search out a Euro Trash film, be it an Italian Giallo or English 70's horror, you desire it to be as sleazy and un politically correct as possible but also you want the movie to have some semblance of a plot, be it ever tiny. Ilsa scores big on all these points. There is wall to wall nudity, all female. Gratitutious torture scenes that are more ridiculous than offensive, (I mean every time Ilsa drags a prisoner down for torture they are completely naked as they are being tortured). And all most everyone of the female cast members at some point is completely naked. Let's be honest, It ain't Shakespeare, nor does it pretend to be. Of note is the lead actress Dyanne Thorne. Apparently Ms. Thorne had lofty ambitions of being a serious actress at one point in her career but the fickle finger of fate lead her to Ilsa fame. In her mid 40's, Ms. Thorne is competent enough not to look like an amateur on screen. She has a several nude scenes throughout the movie and anyone who watches Ilsa will no doubt remember her more for her large breasts than her acting ability. Ilsa She Wolf of the SS is a noteworthy entry into the world of exploitation films and should be the starting point for anyone who journeys into this genre. I rate it as a 10 because it knows what it is and does not pretend to try for anything higher",
         "I first rented this sick flick in the 80's, and the guy at the video store who recommended it (knowing I was into shock/exploitation movies) told me he'd give me my money back if I wasn't completely offended. Guess who didn't get their money back? . I finally found a copy of the uncut version I first saw--hard to find, unless you have a DVD player-- and yep, it still shocked me just as much. It may have shocked me even more, because I kept thinking, \"No WAY could they put a movie like this out today!\" I've actually seen all of the Ilsa series and each time I watch one, I think \"this is probably the sickest\". Then I realize they are all really sick, just in different nasty ways. The first time I watched this, even though I wasn't watching it with anyone else, I felt guilty for not turning it off and returning it to the video store, it was so sick. People have said the violence and acting are unrealistic, but there were parts where I had to remind myself this was a movie (though it was supposedly based on real Nazi experiments...let's not dwell on that) and the women screaming in agony at the top of their lungs were just actresses. There's a few unrealistic scenes- for instance, a woman being boiled to the point where her skin seems to have come off looks almost fine a scene later. Most of it looks a little too real for me-enough so I was feeling sick to my stomach by the big dinner scene, and I didn't even watch it all at once. First of all, anyone who didn't think this movie was violent or gory, you definitely have seen a cut version. Anyone who thought it was boring or tame obviously didn't see the version I saw with the woman being boiled alive onscreen or the patients with huge, open gaping wounds that had been deliberately infected. As another reviewer said, if you see the right version (or the wrong one, depending on your point of view) there are not 5 minutes that go by without some sort of sex, nudity, violence, or all 3 at the same time. If I ever heard anyone describe this movie as 'sexy', I would get away from them as quickly as possible. In this debut of the Ilsa (Ilsa herself pronounces it as \"Ill-za\") series, Dyanne Thorne plays the title role, an extremely sadistic commander of a concentration camp where they perform 'medical research'. The men usually only get castrated (after sleeping with Ilsa and not 'satisfying' her) or beaten. The women have the bad luck to be in a camp where Ilsa is trying to prove her theory that women are naturally stronger and can take more pain than men. Some are taken away to the 'brothel' area, which is no picnic either (one of the scenes that actually made me lose my appetite showed a prisoner after the men are through with her- not a pretty sight) but the *really* unlucky ones are taken to the 'medical' area. One woman makes the huge mistake of not only telling Ilsa she can take whatever she dishes out (Rule #1 in an Ilsa movie-never taunt her with her tough you are) but giving her attitude and talking back (Rule #2, do NOT give Ilsa attitude or talk back, you will probably receive the most disgusting fate of any character in the entire movie) and Ilsa decides to make an example of her, resulting in some of the nastiest, hardest to watch scenes in the movie. I can't describe them in detail or this review probably wouldn't be posted. Ilsa picks one American man, \"Wolf\" to sleep with her, a so called 'genetic freak' who can satisfy Ilsa, so he gets to keep all his, uh, equipment for the time being. Of course, he has an escape plan...he also provides most of the unintentional comic relief in the movie, as his acting is so amazingly bad, even for an exploitation movie, that he sounds like he is reading from cue cards, a few words at a time: \"I-will-make...love-to-you-like...you-have-never-been....made-love-to-before.\" As a sidebar, I'd sure like to read Dyanne Thorne's autobiography, if she ever puts one out. Several times during the movie, I wondered if the actress ever told anyone how she was making a living in detail at the time. \"Well, today I get paid to go dress up in complete Nazi regalia and pretend to pee on another higher ranking Nazi. Then, after lunch...\". She hams it up as Ilsa, and was, let's face it, pretty brave to do this movie. A warning to others who might consider renting this because they hear it's \"campy and fun\"- don't rent it for that reason unless you have a really sick sense of humor or a real &*%$ed up idea of fun. Some co-workers of mine unwisely didn't listen to any warnings from people who have watched the entire movie and went to see a midnight screening thinking they were going to see some kind of bad-in-an-Ed-Wood-way B-movie. They made it through maybe 15 minutes tops before walking out in total revulsion. It's not the kind of movie you want to watch over and over because it's so fun. I watch it every once in a while to see if I'm still as easily shocked as I was a few years ago. So far, I am. Why do I own it, if it's so horrible? I guess I have no excuse for that, other than to show it to people who think they've seen it all. If you think you've seen it all, you haven't, until you see the first 3 Ilsa movies.",
         "When this movie first came out in the 70's it was a 42nd street style grindhouse pleaser that would have shocked mainstream audiences; however with the advent of video few will be so shocked today. Ilsa is impossible to take seriously. Sure medical torture was carried out by the Nazis but this movie is not like Men behind the sun, and you will be left questioning the authenticity of Ilsas source. Ilsa can be enjoyed as an exercise in bad taste that John Waters would enjoy; torture, Nasty nazis and a range of bad accents, though Joe DeBlascos SFX makeup is pretty good.The camerawork is good giving it a gritty feel, and the sets (used by Hogans heros!) are impressive. Ilsa will neither exceed nor dissapoint as an exploitation flick, and thats my recommendation.",
         "Hmmm, this is a tough one to rate. Half of me wants to praise it as being entertaining, sleaze-core cinema at it's cheesy best whilst the other half wants to keep quiet for fear of offending people. It's true that the subject matter here is dodgy to say the least, but at the end of the day it's only a movie & whether or not it was made in bad taste, it's basically great exploitation cinema. If you are easily offended, stay away...for the rest of you out there, this is an excellent example of the kind of movie they don't dare make anymore. One last thing:- Compared to the three sequels that followed (this movie was a BIG success in it's day), this isn't as gory as it's reputation suggests.",
         "ILSA - SHE WOLF OF THE SS is the first in the \"infamous\" series of exploitation films featuring buxom ball-breaker, Dyanne Thorne. These films are a classic example of true exploitation cinema and should be checked out by any fan of \"extreme\" or exploitation films. Short version: Ilsa is the head bitch at a Nazi experimentation camp. She gets her kicks by torturing the male and female prisoners in all kinds of interesting ways. Overall, SHE WOLF is pretty tame in the gore department, compared to what is out there today. I'm sure if you saw this when it first came out in '75, it was probably some really racy stuff...but being from a generation raised on blood-and-guts, the Ilsa films are more laughable than \"shocking\". I prefer SHE WOLF and the under-rated TIGRESS OF SIBERIA installments over HAREM KEEPER OF THE OIL SHEIKS and WICKED WARDEN (those two having more of a sleazy sex overtone, and being very light on the red stuff...) but all are worth a look just to say that you've seen them. Anchor Bay has put out a beautiful box-set that contains SHE WOLF, HAREM KEEPER, and WICKED WARDEN, and if you check the right on-line dealers, you can find it for dirt-cheap. Makes a great collection piece. To my knowledge, TIGRESS OF SIBERIA is not available on DVD at this time (at least not in the States...) which is a shame, because although many other reviewers trash it, I really liked that film. Anyway, if you are an exploit fan these films should already be in your collection. If you are interested in checking out this type of material, these films are as good a start as any. Not for the average movie-goer, but not as over-the-top as they could be nowdays. recommended - 8/10 for Dyanne Thorne's big-ass Nazi titties!!!",
         "ILSA SHE WOLF OF THE SS belongs in the exploitation trunk of legendary films that include the likes of NEKROMANTIK, I SPIT ON YOUR GRAVE, SALO, CANNIBAL HOLOCAUST and countless others. Fortunately for ILSA I think the movie lives up to it's hype, even if it is a bit dated, and at times heavy on the cheese. Ilsa, played by the well-endowed Thorne, is a sadistic mother, in charge of Medical Camp 9 who spends her days performing many torturous experiments on female and male prisoners alike. They either disobeyed orders, talked back, or didn't pleasure her right (the men) - One man is castrated because Ilsa didn't reach heights of orgasm that she would've liked (???). Anyway, the film continues by showing scenes of torture, after torture, after torture.... It goes on like this for much of the film. When characters aren't being brutally whipped, boiled, decompressurized, or mutilated in various forms, Ilsa is seen showing off her enormous breasts (many times I might add). Pacing is really hurt during these scenes, especially when a lot of needless talking comes into play. Really, these scenes just become downright dull and boring. However, the ending was fairly exciting and violent. The gore and make-up is pretty good; that literally half-dead woman was made up quite well. She certainly was a freakish sight that's for sure. NOT GOOD by any means, but if you wanna see something that'll really push the limit....",
         "Ilsa, She Wolf of the SS certainly deserves its reputation as a nasty film. Although it is thoroughly cheesy, poorly acted, routinely directed, and extremely camp at times, the film still packs a punch due to its ability to offend and disgust at every turn; the depiction of Nazi atrocities in the name of entertainment is hard to defend (so I'm not even going to try) and this movie pulls no punches with its well executed graphic violence and horrific torture scenes. Ilsa, played with gusto by chesty blonde Dianne Thorne, is the Kommandant at a concentration camp where she oversees medical research performed on the female prisoners. Meanwhile, she uses the males to try and satisfy her sexual needs (and when they fail, she has them castrated!). It is up to German/American stud Wolfe to lead the prisoners in a revolt against the guards whilst simultaneously gaining Ilsa's trust by rogering her senseless at every opportunity. This notorious sleaze classic packs so much depravity into its 96 minutes running time (uncut), that lovers of exploitation will have a field day. From the opening scene in which Ilsa's sex slave is dragged back to the camp to be emasculated, to the ending in which the prisoners exact bloody retribution, sex and violence pervades every frame. The effective make-up FX by Joe Blasco are repugnant enough for hardened gore-hounds and fans of the female form will be delighted by the copious amounts of nudity (nearly every woman gets naked at some point in the film!). And lets not forget the scene in which Ilsa pees on the Nazi general... Thirty years after it was made, Ilsa still has the ability to shock\u0097the mark of a true exploitation classic!",
         "Here it is:the nastiest and the most notorious \"Ilsa\" installment.Dyanne Thorne shines as a Nazi bitch Ilsa.It's a real pleasure to see her naked in several soft core sex scenes.There are also some nasty torture scenes-the film is so beyond any taste that it's impossible not to like it.The most disturbing sequence is definitely the infamous dinner scene.There is a party which includes killing a female prisoner by tying a noose around her neck and placing her on a block of ice.Of course some people may consider this film sickening,but fans of extreme stuff will certainly enjoy this exploitation classic.10 out to 10.Hail Ilsa!",
         "An exploitation classic that is a surprisingly enjoyable film. Ilsa, the Arian commandant of a secret medical facility, sets out to prove to her doubting superiors that women are able to endure greater pain and suffering than men. She does this by torturing the female inmates in increasingly diabolical ways, while trying to break the American 'sexual freak of nature', Wolfe. Cue lots of gratuitous nudity, castration, strangulation, boiling alive, magnificent pre-implant breasts, softcore sex and gang rape, golden showers, and general bloody mayhem. The German accents are hilarious, and the acting barely one step up from Hershael Gordon Lewis and early John Waters. It even has the ubiquitous 'moral message' at the beginning. But unlike so many of these movies, 'Ilsa' manages to avoid descending into tedious repetition half way through, and builds to a brilliantly ludicrous climax in which an entire camp is gunned down by machine gun fire, without a drop of blood being spilt. Brilliant.",
         "I completely see why some people really like this movie (director Quentin Tarantino among those that do). The movie may have been slightly cringe-worthy when I saw it (mostly the way the director relishes in the dirty art he has created), but in retrospect is fluff compared to a lot of the movies I've seen since then. Even though this movie is pure, unadulterated carnage and heinous acts throughout the entire course of the film, it had a redeeming quality.It's hard to pinpoint what made this movie so appealing to me. It was a perfect emblem of the pure sleaziness and overall decadent atmosphere of the 70's smut prevalent at this time. Like all grindhouse films, it appeals to the baser senses - filled with excess violence (grizzly and well-done) and sex. And it's shot amazingly well for such a poor film. I expected it to be grainy and imperceptible. There's an element of immorality felt when watching films like this, but it's a healthy outlet to sublimate impure thoughts. It's sensationalist, yes. Probably no artistic merit either. But it's an appetizer of the 70's Perversia. I do think it's mostly meant to be titillating and gross for the sake of being gross. It's so blatantly in-your-face tasteless and bad that I love it. Stay away from it if you don't have a knack for the depraved."
      ],
      "genres": [
         "Horror",
         "War"
      ],
      "productionCompanies": ["Aeteas Filmproduktions"],
      "summaries": [
         "The scene is set from the start - Ilsa, chief warden of a Nazi concentration - is enjoying the pleasures of one of her male captives. He has the temerity to orgasm before she does, and is speedily hauled off by 2 of Ilsa's henchwomen for speedy castration. Shortly after, a lorry load of fresh female captives arrives. Ilsa informs them: \"Do not be afraid, we are doctors.\" While this statement is true, the reality is that she wishes to use them in \"medical experiments\" to prove that women are as able to withstand pain as men, in fact better. This is in fact \"proved\" by flogging one of each to death at the same time, with the two henchwomen laying on with whips while stripped to the waist. After much more along the same lines, Ilsa's nemesis arrives - a blond, blue-eyed American who has been swept up in the death camps. He satisfies her, but weakened by lust for him, Ilsa fails to spot the inevitable prisoners revolt which reverses the table on the baddies. Ilsa is given the full, um, lash by the delectable Dianne Thorne - the bogus German action laid on with a trowel, magnificent breasts deployed at every available opportunity. The success of Ilsa begat a series of similarly themed knock offs by the one and only Jess Franco - the best of these, set in a dodgy South American prison - is Ilsa, Wicked Warden.",
         "Ilsa is an evil Nazi warden at a death camp that conducts \"medical experiments\". Ilsa's goal is to prove that women can withstand more pain and suffering than men and therefore should be allowed to fight on the front lines."
      ],
      "budget": 0
   },
   "movielensId": 3847,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1975-10-01",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["Don Edmonds"],
      "runtime": 96,
      "movieId": 3847,
      "title": "Ilsa: She Wolf of the SS",
      "mpaa": "NR",
      "actors": [
         "Dyanne Thorne",
         "Gregory Knoph",
         "Tony Mumolo",
         "Maria Marx",
         "Nicolle Riddell",
         "Jo Jo Deville",
         "Sandy Richman",
         "George Buck Flower",
         "Rodina Keeler",
         "Richard Kennedy",
         "Uschi Digard",
         "Colleen Brennan",
         "Jacqueline Giroux",
         "John F. Goff",
         "Sandy Dempsey"
      ],
      "imdbMovieId": "0071650",
      "originalTitle": "Ilsa: She Wolf of the SS",
      "genres": [
         "Thriller",
         "Horror",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ilsa is a warden at a Nazi death camp that conducts experiments on prisoners. Ilsa's goal is to prove that woman can withstand more pain and suffering than men and should be allowed to fight on the front lines",
      "tmdbMovieId": 20850,
      "avgRating": 2.68905,
      "releaseYear": "1975",
      "numRatings": 201,
      "posterPath": "/aXK4fYcznrklsYrvASyujMNpN8F.jpg"
   }
}