{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "staircase",
            "id": 1816
         },
         {
            "name": "gothic",
            "id": 33505
         },
         {
            "name": "spiral staircase",
            "id": 155811
         },
         {
            "name": "proto-slasher",
            "id": 233450
         }
      ],
      "imdb_id": "tt0038975",
      "video": false,
      "title": "The Spiral Staircase",
      "recommendations": [
         20025,
         13528,
         17058,
         42995,
         16373,
         29451,
         19119,
         28297,
         22307,
         60216,
         20620,
         25508,
         29589,
         25103,
         17645,
         43461,
         42077,
         43269,
         20482,
         31713
      ],
      "backdrop_path": "/5zu7LxqglEv0Tym36LYhJcJP1qi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Helen Capel",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051e3d",
               "name": "Dorothy McGuire",
               "profile_path": "/iGkamkWnIor7eYrTDQMxAjxoQbA.jpg",
               "id": 24815,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Professor Warren",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e41",
               "name": "George Brent",
               "profile_path": "/up9OfpLXl80hkGPvB5KnOdo0jbB.jpg",
               "id": 20364,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mrs. Warren",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051e45",
               "name": "Ethel Barrymore",
               "profile_path": "/24OXA0rGmxbF09D5aK7aiWe6HCB.jpg",
               "id": 97777,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Parry",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e49",
               "name": "Kent Smith",
               "profile_path": "/xwAXHrjizAsN6j0xDlMadMMa4g4.jpg",
               "id": 51764,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Blanche",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051e4d",
               "name": "Rhonda Fleming",
               "profile_path": "/6yQSo2AWXePgW4mszL0ZUHpX28l.jpg",
               "id": 10160,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Steve Warren",
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051e51",
               "name": "Gordon Oliver",
               "profile_path": "/wHTUcdcUjjiTXFs0OtMYfAdLAP5.jpg",
               "id": 34180,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mrs. Oates",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051e55",
               "name": "Elsa Lanchester",
               "profile_path": "/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg",
               "id": 2926,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Nurse Barker",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051e59",
               "name": "Sara Allgood",
               "profile_path": "/rNTIjpZXtXurKCyTzCNbMQ5ljwR.jpg",
               "id": 7381,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mr. Oates",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e5d",
               "name": "Rhys Williams",
               "profile_path": "/jaD2gAkx9AhNABqDobe9D23oexT.jpg",
               "id": 82835,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Constable",
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051e61",
               "name": "James Bell",
               "profile_path": "/wRkt24kVhuy2iMYdzgYJ2qbava9.jpg",
               "id": 84935,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Dr. Harvey (uncredited)",
               "gender": 2,
               "credit_id": "56ac59b5c3a3681c470052fb",
               "name": "Erville Alderson",
               "profile_path": "/yi3crBgbU5m4jfsH3H15YNNPrpg.jpg",
               "id": 589728,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Neighbour (uncredited)",
               "gender": 1,
               "credit_id": "56ac59c89251417e11005353",
               "name": "Ellen Corby",
               "profile_path": "/3oBJ4HH5z7FspFMxOTUe1eBzoIA.jpg",
               "id": 5738,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Murder Victim (uncredited)",
               "gender": 1,
               "credit_id": "56ac59ddc3a3681c3b005210",
               "name": "Myrna Dell",
               "profile_path": "/jv17YcftYhmXHUZ0Jbsf71wQJRM.jpg",
               "id": 94399,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "The Killer's 'Eye' (uncredited)",
               "gender": 2,
               "credit_id": "56ac59f99251417c980011ee",
               "name": "Robert Siodmak",
               "profile_path": "/i43x7MCzzNGeSbLO6LvAOJWFeXN.jpg",
               "id": 5029,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e39",
               "name": "Robert Siodmak",
               "profile_path": "/i43x7MCzzNGeSbLO6LvAOJWFeXN.jpg",
               "id": 5029,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e67",
               "name": "Nicholas Musuraca",
               "profile_path": null,
               "id": 10150,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051e6d",
               "name": "Dore Schary",
               "profile_path": null,
               "id": 22598,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051e73",
               "name": "Harry W. Gerstad",
               "profile_path": null,
               "id": 4167,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e79",
               "name": "Harry Marker",
               "profile_path": null,
               "id": 109414,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051e7f",
               "name": "Ethel Lina White",
               "profile_path": null,
               "id": 14291,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e85",
               "name": "Mel Dinelli",
               "profile_path": null,
               "id": 105017,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e8b",
               "name": "Roy Webb",
               "profile_path": null,
               "id": 4345,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e91",
               "name": "Albert S. D'Agostino",
               "profile_path": null,
               "id": 4349,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051e97",
               "name": "Jack Okey",
               "profile_path": null,
               "id": 17763,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.900011,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27452,
      "vote_count": 58,
      "budget": 0,
      "overview": "In 1916, beautiful young mute Helen is a domestic worker for elderly, ailing Mrs. Warren. Mrs. Warren's two adult sons, Albert (a professor) and womanizing impudent Steven, also live in the Warren mansion. Mrs. Warren becomes concerned for Helen's safety when a rash of murders involving 'women with afflictions' hits the neighborhood. She implores her physician, Dr. Parry, to take Helen away for her own safety. When another murder occurs inside the Warren mansion, it becomes obvious that Helen is in danger.",
      "similar": [
         539,
         201085,
         2654,
         62213,
         321612,
         346672,
         65086,
         4970,
         11906,
         303,
         19204,
         11336,
         14001,
         1977,
         11868,
         20126,
         28501,
         32985,
         9871,
         24808
      ],
      "original_title": "The Spiral Staircase",
      "runtime": 83,
      "poster_path": "/b1VZwHlpl8DVPvnuCyauNGGV8QJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1946-02-06",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Siodmak"],
      "runtime": 83,
      "synopsis": "Set in early 20th century New England, the screenplay by Mel Dinelli is about a serial killer who is murdering disabled young women in the community. His next victim apparently is Helen, a mute girl who works as a live-in companion for wealthy, bedridden Mrs. Warren, who urges her to leave the house, as does Dr. Parry, who knows the reason for Helen's loss of speech and hopes to help her get her voice back. Rounding out the household are Mrs. Warren's son and stepson, her verbally-abused nurse, a secretary, a handyman and his wife, a housekeeper with a taste for brandy. It contains some glorious black and white cinematography from a forgotten master, Nicholas Musuraca. A stunning example comes early in the film as Helen walks home at night in the rain. She rattles a stick against some railings when a flash of lightning illuminates a gleaming silhouette of her stalker in the trees. It has been copied many times, most notably in I Know What You Did Last Summer. It's worth seeing the film for that shot alone. The gloomy, decaying mansion where most of the action takes place is wonderfully realised by production designer Albert S. D'Agostino , who also designed Welles's The Magnificent Ambersons. Despite its dated, vaguely Freudian themes, it remains a highly atmospheric film and a very enjoyable thriller.",
      "writers": [
         "Mel Dinelli",
         "Ethel Lina White"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038975/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMTU1MDUxOF5BMl5BanBnXkFtZTcwNDM3NjYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dorothy McGuire, George Brent, Ethel Barrymore | See full cast and crew »"],
      "reviews": [
         "This was an excellent suspense film with outstanding cinematography and interesting characters played by a strong cast. There are lots of complimentary adjectives in the above sentence but the film deserves it, particularly the photography (see this on DVD). The lighting is as good as anything I've ever seen in film noir (this is not a film noir, as one reviewer correctly points out). In fact, outside of David Lean's \"Oliver Twist, \" this may be the best-looking black-and-white film I've seen. A good part of the visual treat is viewing the fantastic Victorian house where most of the action takes place. The lead character, played beautifully by Dorothy McGuire, is one the viewer cares about which helps get one involved in the story. All the other characters are fun to watch, and are detailed here in other reviews. I go along with most in saying Ethel Barrymore was the most likable. There are a few holes in the storyline, to be sure, but one doesn't care since the film movies rapidly, the story keeps you so involved and the visuals and audio are so interesting. This latter also features the longest thunderstorm on record!",
         "This is one of the most elegantly crafted, paced, photographed and designed of all lady-in-distress thrillers, a sub-genre I am not altogether fond of, but in this case the result is something near to a masterpiece. The actors, especially Dorothy McGuire, are first-rate. I'm particularly in love with the house, a cavernous Victorian, over-decorated, visually and spatially 'busy' place, full of odd furniture and fixtures, rugs, lamps and mirrors, it is as much a character as any person in the film. Kudos to the RKO art department, fifty plus years later I salute them. The way the house is explored is a fascinating as the way the characters are presented. Bit by bit we grow accustomed to the place and its denizens, and when the inevitable thunderstorm happens we feel comfortable inside, aware of the menace within we are none the less seduced by the grandness of the place, indeed enveloped by it, as the air of danger becomes almost cozy, and the gothic surroundings become as comforting as they are baleful. This is no small trick; it's an art. Name a film of the past thirty years that comes close to The Spiral Staircase in its exploration of the various shades of meaning in what for want of a better term one would have to call the Great Gothic Place.",
         "The Spiral Staircase is one of the most eerie and atmospheric films that I have ever had the pleasure of seeing. The entire movie gives off a sense of malice throughout, and the use of music here is some of the best I've ever seen in a movie. The film's plot follows a series of murders, of which all the victims are people with imperfections. Our hero is Helen; a young mute girl that works as a nurse for Mrs Warren, an old lady that lives in a big house. Aside from the old lady, also living in the house are her two sons; Albert and Steven, along with a few other people such as the maid. As the murders are being committed on imperfect women, the old lady becomes concerned for her mute nurse and begs her to leave. When another murder is committed in the house, the danger that the young girl is in becomes more apparent. The first thing you will notice about this hidden gem is it's striking cinematography and lush settings. The film is very Gothic, and that gives it a very foreboding atmosphere. This is without doubt the best things about the film; in a dark thriller such as this, the atmosphere is always important, and as I said; this film has plenty. The film also features a lot of intrigue. As it has many characters that could be suspects, it leaves you guessing. Playing it's cards very close to it's chest, we don't find out who is the murderer until the very last minute. The cast of The Spiral Staircase don't excel individually, but they come together very well as an ensemble. Most of them would never make another notable movie, although the majority have rather large filmographies. Robert Siodmak takes the directors chair, and he should be commended for his work. His use of the camera is excellent; the film features numerous close-ups, and when coupled with the haunting music; it makes for a great eeriness. There is one sequence in particular where the killer is watching his would-be victim from some bushes in the rain, and that with the haunting music in the background is altogether one of the most frightening sequences ever filmed. Cinematic perfection.",
         "The extra vulnerability of the handicapped has been a magnet to attract some fine directors of suspense\u0085 The fulcrum of Robert Siodmak's 'The Spiral Staircase' was the fact that the beautiful and expressive Dorothy McGuire was dumb \u0096 deprived of her speech by shock\u0085 Her terror when death stalked had to be wordless, and it was all the more potent\u0085 She could not communicate, she could not plead or call for help\u0085 It was New England in 1906, and she was employed by the bedridden mistress (Ethel Barrymore) of an old mansion (decorated in Victorian style). On the girl's day off, a disabled girl was found murdered in the little town. It was the third such murder\u0085 In each case the victim had been physically handicapped \u0096 and, as we learned later, the murderer killed because he could not tolerate imperfection\u0085 There was a chilling start to the suspense as Dorothy McGuire walked home through a stormy night, rattling a twig against railings\u0085 In a lightning flash we saw \u0096 but she did not \u0096 the silhouette of a man watching her\u0085 On into the house and, as she paused on a landing, we saw the feet of the man on another landing\u0085 waiting. And then, in a close-up of his eye, we saw her face reflected \u0096 an imperfect face\u0085 On this level the tension was maintained in visual terms, through the murder of another girl in the house and the mute's discovery of the body, and her belief that she knows the murderer\u0085 She tricks him into a room and locks him in\u0085 but, as she is to find, she has locked up the wrong man\u0085 Ethel Barrymore received the film's only Academy Award nomination, as Best Supporting Actress\u0085 McGuire would have to wait another year to be nominated as Best Actress, for her great role in Elia Kazan's emotional 'Gentleman's Agreement', 1947.",
         "\"The Spiral Staircase\" starts off with an afflicted woman being murdered, and right from the onset I was surprised at how explicit it was for its time - by today's standards it's nothing you don't see every day on television, but 1946 was a very different time. It then moves onwards and we are introduced to a young woman who is mute and lives in a mansion with a long, spiraling staircase. (Hint: this pays off later in the movie.) When it's made known that a killer is making his rounds murdering afflicted women, the owner of the mansion fears for the mute woman's life - and after a string of more murders occur they realize she's next. RKO's picture was far ahead of its time. Someone on here said it's not a film noir and commanded that people stop calling it one. I'll disagree. I think it IS film noir, in the sense that it's a personal struggle for one person who's surrounded by death and murder. I don't think it should be left up to one person to decide what \"film noir\" really means. I do think there are limits of course (\"Batman Returns\" is NOT film noir, it just tries to come across as one) but no one should say, \"This isn't a film noir because it's a thriller.\" So what? Loads of film noirs are thrillers. I personally feel the stylings, the themes and the motif of the movie could be classified as \"film noir.\" It's a beautiful movie to look at, very well filmed, and the ending is probably one of the best I can remember ever seeing. It's had a few remakes over the years, but the first remains the best - by a long shot. Highly recommended.",
         "The Spiral Staircase is an excellent film. Dorothy McGuire gives a great performance as a mute woman in a town where disabled women are being killed, I think she deserved an Oscar nomination. She does a lot of emoting with her eyes and her body language. The technical aspects of this film are amazing. The score is extremely creepy, the camera work is excellent, and the main set is well designed. There are some extreme close-ups of an eye that are very spooky. This is a movie that Alfred Hitchcock would have made. There is a long and extremely affecting dream sequence that is riveting. Elsa Lanchester is very good as servant, and Ethel Barrymore deserved her Oscar nomination for playing the employer of the mute woman. An excellent movie that is a must see.",
         "In the beginning of the Twentieth Century, a serial-killer is terrorizing a small town, killing women with imperfections. In the Warren manor, the mute servant Helen (Dorothy McGuire) nurses Mrs. Warren (Ethel Barrymore) who is terminal in bed. The newcomer Dr. Parry (Kent Smith) falls in love for Helen and has the intention to take her to specialists in Boston for treatment for recovering her voice and marry her. When the reckless Steve Warren (Gordon Oliver) arrives from Europe, he stays in the mansion with his mother and his stepbrother Professor Albert Warren (George Brent) and has a brief affair with Albert's assistant Blanche (Rhonda Fleming). When a crippled woman is killed in the town, Mrs. Warren advises Helen to leave the house immediately since she is in danger. When a murder occurs in the mansion, Helen does not know who is trustful to help her to call Dr. Parry to rescue her. \"The Spiral Staircase\" is a suspenseful stylish movie, with a magnificent black and white cinematography that follows the German Expressionism and wonderful set decoration in Victorian style. It is impressive the use of shadows and lights in many unforgettable scenes, like for example Blanche in the basement or Helen in the spiral staircase. The beginning is an awesome tribute to the earlier days of the cinema. The performances are excellent and it is impossible to individually highlight any actor or actress. The plot keeps the tension until the very end in this great movie. My vote is eight. Title (Brazil): \"Silêncio nas Trevas\" (\"Silence in the Darkness\")",
         "For sheer mastery in the art of black and white photography and its ability to provide the shadowy atmosphere necessary for mood, they don't come any better than this. The house alone is as much a part of the plot as the actors--but everything clicks...the acting, the script, the story, the direction and the brooding atmosphere that lets you know you're in for an intense and absorbingly suspenseful story. All of the suspense is relieved occasionally with just the right amount of humor. Particularly by Elsa Lanchester as the housekeeper who uses trickery to steal an extra bottle of liquor from the wine cellar. While thunder and lightning storms outside the mansion, we know that a serial killer is lurking on or near the premises, one who specializes in murdering women with physical afflictions. At the center of the story is Dorothy McGuire's character, a mute girl who lost her voice years ago during a traumatic experience. Around her are a number of people, all of whom become suspicious as the plot thickens--Kent Smith, Rhonda Fleming, George Brent, Ethel Barrymore and Gordon Oliver. Ethel Barrymore is especially good as a frightened old woman, bedridden and suspicious enough of everyone. For comparison, view the recent color TV adaptation, bland in overall effect. It will make you appreciate this black and white classic more than ever. As with most remakes, it doesn't stand a chance against the original. My only complaint is that DOROTHY McGUIRE does not have much range in her expressions. Wide-eyed, but seldom wild, her restraint limits the amount of fear her character can express without using her voice. A more over-the-top performance might have been more useful, given the Gothic mood created so well by director Robert Siodmak. She is overshadowed by Ethel Barrymore as a bed-ridden invalid urging her to leave the house and Gordon Oliver, as the playboy step-brother who plays his role to the hilt. GEORGE BRENT does nicely for the most part, but seems too laid back in the final scenes to be as menacing as he is meant to be. Still, well worth watching for its shadowy Victorian atmosphere alone.",
         "(Slight Spoilers} Effective turn of the century thriller set in New England about a killer on the loose murdering young women in the community who have imperfections in their mental or physical abilities. It's as if this murderer, like mimicking the actions a wolf pack, is attempting to cull out the sick and the weak reindeer or caribou to keep the rest of the herd strong and healthy for future breeding. After murdering three unfortunate young women the murderer zeros in on young Helen Capel, Dorothy McGuire, a mute young women who works as a maid for the old and bed-ridden Mrs.Warren, Ethel Barrymore, at her estate outside of town.You begin to realize that the killer is in a way imperfect himself and by trying to eliminate those he deems imperfect is making up for his own imperfections. Dorothy McGurie in one of her best roles as the mute and pretty Helen is stalked all through the movie by the killer in the shadows of the Warren Mansion and in the woods around it. There's a really scary scene early in the movie when the killer in the pouring rain follows Helen through the woods at night as she momentarily drops her key to the Warren home only to back off at the last minute when someone else unexpectedly arrives. Ethal Barrymore is also very effective as the sick and bed-ridden Mrs. Warren who has some idea who the killer is and wants Helen to leave the house as soon as possible in order not to end up being his next victim. Both George Brent and Gordon Oliver are fine as the two step-brothers and sons of Mrs Warren in their roles as the serious Prof.Warren and his globe-trotting and fun-loving brother Steve. Who have very deep and troubling insecurities about themselves due to their late authoritative father's high standards that he set for them that they both couldn't live up too. There's also Kent Smith as Dr. Parry who knows the real reason for Helen's loss of speech, she tragically saw her parents die in a house fire at a very young age. Dr. Perry wants to help Helen get her voice back by having her see a vocal specialist that he knows in Boston. It turned out at the end of the movie that it was shock therapy that did the trick. Spine-tingling final when the killer comes out of the shadows and closes in on the terrified Helen for the kill chasing her up the spiral staircase of the Warren house. It's then the killer finds out only too late that he, not Helen, has gotten himself trapped in the cross-hairs of a deadly ambush.",
         "Helen Capel was rendered mute in childhood due to a family trauma, now she acts as a companion to the bed ridden Mrs Warren. She's currently fretful because a serial killer is on the loose and he preys on women with afflictions... Based on Ethel White's novel \"Some Must Watch,\" The Spiral Staircase harks back to the days of the \"old dark house\" thrillers and encompasses a German expressionist sheen. The setting is an old Gothic mansion in New England at the turn of the century. Directed by Robert Siodmak, not one spooky house thriller genre convention has been neglected here. The tension builds amid creaking doors and gates, whistling winds, flickering candles, blowing curtains and cut-aways to the eyes of the unseen lurking madman waiting to add poor Helen to his roll call of victims. Mirrors, windows and shadows feature prominently as craftsman Siodmak spins his uneasy expressionistic web. The cast are uniformly strong. Dorothy McGuire gives one of her best and most convincing performances as the under threat Helen. While Ethel Barrymore (nominated for Best Supporting Actress), Elsa Lanchester and George Brent all turn in brilliant performances. But perhaps it's not unfair to say that the real stars here are the technical staff? Siodmak expands his talent and knowing from his work at Universal Pictures (Son Of Dracula/The Suspect), Albert D'Agostino's sets are wondrous period delights and Nicholas Musuraca's deep-focus photography has the ability to make one keep looking over the shoulder to see if something is lurking in the room with us... There's quite a few changes in this adaptation from the novel, notably the setting was in England and Helen was a cripple and not mute. But few could seriously argue that The Spiral Staircase in silver screen form is anything but a triumphant piece of classic cinema. 10/10"
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "RKO Radio Pictures",
         "Dore Schary Productions",
         "Vanguard Films"
      ],
      "summaries": [
         "Beautiful young mute Helen is a domestic worker for old ailing Mrs. Warren. Mrs. Warren's two sons, Albert (a professor) and womanizing impudent Steven, also live in the Warren mansion. Mrs. Warren becomes concerned for Helen's safety when a rash of murders involving 'women with afflictions' hits the neighborhood. She implores her physician, Dr. Parry, to take Helen away for her own safety. When another murder occurs inside the Warren mansion, it becomes obvious that Helen is in danger.",
         "Disabled women in small town at the beginning of century are becoming prey of a serial killer. Helen, mute girl who works for the Warren family, fears that she could be the next victim.",
         "In the beginning of the Twentieth Century, a serial-killer is terrorizing a small town, killing women with imperfections. In the Warren manor, the mute servant Helen nurses Mrs. Warren who is terminal in bed. The newcomer Dr. Parry falls in love for Helen and has the intention to take her to specialists in Boston for treatment for recovering her voice and marry her. When the reckless Steve Warren arrives from Europe, he stays in the mansion with his mother and his stepbrother Professor Albert Warren and has a brief affair with Albert's assistant Blanche. When a crippled woman is killed in the town, Mrs. Warren advises Helen to leave the house immediately since she is in danger. When a murder occurs in the mansion, Helen does not know who is trustful to help her to call Dr. Parry to rescue her.",
         "A serial killer (circa 1916) is targeting women with 'afflictions'; one night during a thunderstorm, mute Helen feels menaced."
      ],
      "budget": 0
   },
   "movielensId": 3849,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1946-02-06",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["Robert Siodmak"],
      "runtime": 83,
      "movieId": 3849,
      "title": "The Spiral Staircase",
      "mpaa": "",
      "actors": [
         "Dorothy McGuire",
         "George Brent",
         "Ethel Barrymore",
         "Kent Smith",
         "Rhonda Fleming",
         "Gordon Oliver",
         "Elsa Lanchester",
         "Sara Allgood",
         "Rhys Williams",
         "James Bell",
         "Erville Alderson",
         "Ellen Corby",
         "Myrna Dell",
         "Robert Siodmak"
      ],
      "imdbMovieId": "0038975",
      "originalTitle": "The Spiral Staircase",
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Y-hIiCQT848"],
      "plotSummary": "In 1916, beautiful young mute Helen is a domestic worker for elderly, ailing Mrs. Warren. Mrs. Warren's two adult sons, Albert (a professor) and womanizing impudent Steven, also live in the Warren mansion. Mrs. Warren becomes concerned for Helen's safety when a rash of murders involving 'women with afflictions' hits the neighborhood. She implores her physician, Dr. Parry, to take Helen away for her own safety. When another murder occurs inside the Warren mansion, it becomes obvious that Helen is in danger.",
      "tmdbMovieId": 27452,
      "avgRating": 3.72148,
      "releaseYear": "1946",
      "numRatings": 298,
      "posterPath": "/b1VZwHlpl8DVPvnuCyauNGGV8QJ.jpg"
   }
}