{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0251739",
      "video": false,
      "title": "Margaret Cho: I'm the One That I Want",
      "recommendations": [],
      "backdrop_path": "/sL3T7wEy3Aq3zGvNiYyCUQdflvd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Herself",
            "gender": 1,
            "credit_id": "52fe46c59251416c9105f329",
            "name": "Margaret Cho",
            "profile_path": "/3DUdtidVGm8FFfknl6HfBMBf366.jpg",
            "id": 11152,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46c59251416c9105f325",
               "name": "Lionel Coleman",
               "profile_path": null,
               "id": 120685,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe46c59251416c9105f32f",
               "name": "Margaret Cho",
               "profile_path": "/3DUdtidVGm8FFfknl6HfBMBf366.jpg",
               "id": 11152,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.441302,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38548,
      "vote_count": 3,
      "budget": 0,
      "overview": "November, 1999, Margaret Cho is home in San Francisco at the Warfield Theater. Cho structures her monologue loosely on her professional life's trajectory: doing stand-up, cast in an ABC-TV sitcom, losing 30 pounds in two weeks for the part, the show's cancellation, a descent into booze, pills, and self-loathing, and a resurrection into her own voice, her own shape, and being the one she wants.",
      "similar": [],
      "original_title": "Margaret Cho: I'm the One That I Want",
      "runtime": 96,
      "poster_path": "/uYDY0n2kBJTouMHWWdwErXEHRf6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-07-01",
      "vote_average": 8.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lionel Coleman"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Margaret Cho"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0251739/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4MDIxMzUzOV5BMl5BanBnXkFtZTcwOTk4NjIyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Margaret Cho | See full cast and crew »"],
      "reviews": [
         "Margaret Cho is a Genius. She has the uncanny ability to talk about very sensitive issues (racism, self image, family, cruelty in the entertainment industry, and of course sex in all of its forms), and make them accessible through sheer hilarity. Her timing is impeccable, her imitations uproarious, and her candor admirable. This movie is an autobiographical account of her life including the failure of her sit-com. Through it all, she is able to show her audience a great deal of vulnerability, and still come out triumphant. I laughed so hard I thought I had gone through a 90 minute abdominal workout.",
         "The idea of concert films has always stuck me as a bit odd. What's the point of paying to see a MOVIE when really you're just seeing a stand-up routine or concert like something you'd see on HBO--since the \"live, in person\" aspect is missing, what's the point? Aren't movies all about seeing something you couldn't see in a play or on a TV show? I still haven't resolved this cinematic question for myself, but I can tell you that this movie is more entertaining than 99% of what Hollywood studios produce. I defy anyone to see this movie and not have a great, gut-busting time (prudes excepted, perhaps). So much of what's been written about this film says that it's essentially just about her experience with her failed sitcom, but, in fact, that's just one of several set pieces of the film. The best bits have to do with Cho's mother (her imitation is both hilarious and a bit touching), and Cho spends a lot of time on gay-related bits (many of which are genuinely funny). But what I discovered about Cho through this movie was that one of her greatest strengths--what sets her apart from her peers--are her facial expressions, which are versatile and always dead-on. Many times, the punchline is not a snappy line, but rather, Cho's dead-on facial expression. Finally, I knew why, at least in this case, a concert film format was appropriate: unless you had front row seats to the show, there's no way most audience members at the live show could enjoy Cho 100%, but the movie camera allows us to see her every facial movement (before erupting in laughter). Unlike an HBO comedy special, this film does have a serious emotional throughline--that being Cho's quest to accept herself and be happy. The comedy gets raunchy but is always funny; the entertainment value of this film--made on the most simple terms--far surpasses that of most movies made today. Highly recommended. (p.s. when I saw the film in Los Angeles, Cho was on hand at the theater to take tickets herself; she is deservedly very proud of this movie).",
         "It's a torrent of self-hate that pours through this scabrously funny ninety-minute concert by the Korean-American comedian Margaret Cho, whose work here is a peak that bears comparison to Chris Rock and Richard Pryor--the tallest praise I can muster. Cho's unclassifiable id--Asian-American omnisexual is a poor sticker for the self she unloads here--can find no name, no resting place, and no club that will have it as a member. Never has alienation been so explosively hilarious. And beyond the content of her work, Cho is a master of her craft, a genius manipulator of silence, long-held muggy faces, microphone-stand grasps, lunges for the water bottle, and sheer stillness. Her precision can be scary. There is a little too much face-pulling and playing to the balcony of Boys' Town (Cho's \"I am a faghag!\" shtik seems designed to churn up microwaved warmth from her fan base). But there are many moments--especially Cho's rendering of her inexplicably insane-seeming mom--that could stand toe to toe with Lenny Bruce and Pryor at their tops.",
         "I'd never heard of Margaret Cho before \"I'm the One That I Want\" came out, but since then she's become a real fixture in the entertainment industry. In this performance, she talks about her various experiences in life, such as a lesbian cruise. Some of it makes you think \"OK, that's more than I needed to know\" (you'll know it when you hear it), but you never stop laughing. Cho's concert documentary \"Assassin\" featured her with some more toned-down material, but no less right-on. She's certainly an admirable person and great comedian. It's great to know that we have someone like her to reflect modern humor.",
         "I saw this about 3 years ago. I really wanted to see it after hearing about it at her website. This was much different from her previous routines as this was a one woman show rather than stand up comedy. This first few minutes are pretty slow where she talks about sexuality. When she gets into the meat of the show (\"The All American Girl\" incident), that is where she excels. We hear the story behind the failure of the show, Margaret \"selling out\" to the show's plot (An episode has her making fun of her parents at a club, something she does often in her routine. In the end, she publicly apologizes for making fun of her parents), losing weight rapidly because the network told her too, and a whole lot more. When she gets serious, we feel her pain. When it was cancelled, she goes into a downward spiral. I loved her retort when she replaced by Drew Carey (\"Because he was so thin\" lol). I love the empowerment Margaret gives herself when she realizes that losing a show was not the living end. She knows better now because of those unattainable goals that Hollywood sets up for women and ethnic comedians. She shows her strength and defiance against the system. In the end, she comes out a winner.",
         "I gave this film a 10 rating. I struggled with that, because although I feel that this comedy film is truly outstanding, the pace through me off for a moment or two. She comes on stage in a flash of energy and dives right in with the one liners. I had tears in my eyes. But then around the middle, the stories became more involved, not so funny. But then she gets the motor going again at the end. The fact is Margaret Cho is the funniest woman alive. I identify with her life so much it scares me. The mother-answering-machine jokes are pee-in-your-pants funny, although a little too long in the tooth. The main reason I gave this film a 10 out of 10 is mainly for the brutal honesty Margaret gives the audience. She can't be making this stuff up! Some of the highlights of the show are: \"Lesbians love whale watching!\", \" Am I Gay? Am I Straight? No, I'm just easy. Where's my parade?\" and the always laughable, \"A**Masters\" skit. Always a crowd favorite. After I rented this movie, I went right to the web and bought this disc. I highly recommend this flick to any fan of stand up comedy. The special features are worth the purchase price.",
         "Ahhh, you're in for a treat. This woman has something to say and she says it in the best ways possible-- funny, edgy, self-effacing, step off buddy, been-there and Hi, I'm baaaack. And just in time. I love you, Margaret Cho. I've heard the ass master bit fifteen, twenty times, and you still make me laugh. God bless you. It's interesting how easily male stand-up comedians slip into their eponymous network sitcoms, and how difficult it is to fit a female comedian into one. Cho gives us her story, and then she gives us her new mantra-- I'm the one that I want. This is the kind of tape you'll want to have around, not necessarily because of the humor, but because of the message. If you've never heard of Margaret Cho, then know that she is one of the best around. A 'must see'.",
         "Actress/comedienne Margaret Cho's 1999 concert, filmed before a live audience in San Francisco, catches the wonderfully embittered (and yet still hopeful) comic genius at a professional peak. Regaling against the Hollywood machinery which nearly put her away for good, Cho masterfully segues from stories about her failed TV-sitcom \"All American Girl\" to side stories and family memories which gives her main theme--being true to yourself--more depth and punch. Smartly opening with rebel grrl music, Cho appears on-stage without any gimmicks (her follow-up concert, \"Notorious C.H.O.\", added a back-screen which was probably helpful to that audience but a distraction for movie viewers). This concert keeps getting better, with the funniest of the jokes becoming staples in Cho's repertoire. *** from ****",
         "This movie rules on so many levels. Take the comments of \"james_cocos-snowboots\" with a grain of salt; his favorite movies include Police Academy 3 & The Adventures of Ford Fairlane. Oh, and 'Boots, she's not a dyke. That part is a gag. (Can't blame you for not paying attention, since you didn't like the movie, but really, you put your foot in it with that one.) Further evidence that 'Boots is not in Cho's intended demographic: his comment on another film reads as follows: \"...this movie really hits home as a commentary on modern morality in a world that has lost its teleological end as an ethical culture in which the end of life is ethical satisfaction and contentment with God and His ultimate purpose.\" ('Boots, I think you should make sure you look up them big fancy words before you use 'em -- if the world can actually \"lose its teleological end,\" that means that your God isn't omnipotent. Which I'd agree with, but I doubt you would.) By the way, I'm a straight white man. So you don't have to be a queen, dyke, Korean- American, or fag hag to love Margaret Cho. It probably does help to have actually met an out-of-the-closet homosexual, though.",
         "As a fan of her for several years now, I feel that her performance in \"I'm the One That I Want\" isn't as well-paced and sharply, unrelentingly funny as her previous stand-up performances. She seems to \"ham-it-up\" a lot more in this performance. Also, whereas in past stand-up performances, the laughs would come rapid-fire, one after another (I guess because of time-restraints), Margaret seems to be stretching out her jokes a little too long, either through repeating the same thing over and over (e.g.the \"vagina-washer\" bit, \"fag-hag\") or by making silly faces and ogling at the camera. This is not to say that this movie isn't funny, there are some bits that are absolutely hilarious. Her best material is the stuff regarding Asians, such as the prejudice and stereotyping (e.g. The Margaret Cho Rice Diet, the \"Asian Thing\") and her impressions of her decidedly ethnic Korean mother. While I used to like her material about gays, it seems like she hams it up a little too much here, and is specifically playing it up for her large gay audience. It feels more forced in this performance. That being said, \"Ass master\" still made me laugh till I cried. All in all, a good performance with some rather sad and touching(but not necessarily funny) material about her ordeal with her failed sitcom. She is becoming little too much \"drama-queen\" or \"diva\" though and it takes a toll on her humor. I liked her \"raunchy, rebellious, F the system, Asian-chick\" persona much better."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": ["Cho Taussig Productions"],
      "summaries": ["November, 1999, Margaret Cho is home in San Francisco at the Warfield Theater. Cho structures her monologue loosely on her professional life's trajectory: doing stand-up, cast in an ABC-TV sitcom, losing 30 pounds in two weeks for the part, the show's cancellation, a descent into booze, pills, and self-loathing, and a resurrection into her own voice, her own shape, and being the one she wants. Along the way we visit Karl Langerfeld in jail, a lesbian cruise ship, a TV Guide photo shoot, a hospital, bars, and her family's Polk Street bookshop. Takes on being a fag hag, speeding up felatio, casual daily racism, and her mother's phone messages highlight a scabrous, brilliant performance."],
      "budget": 0
   },
   "movielensId": 3851,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-07-01",
      "dvdReleaseDate": "2001-10-09",
      "directors": ["Lionel Coleman"],
      "runtime": 96,
      "movieId": 3851,
      "title": "Margaret Cho: I'm the One That I Want",
      "mpaa": "",
      "actors": ["Margaret Cho"],
      "imdbMovieId": "0251739",
      "originalTitle": "Margaret Cho: I'm the One That I Want",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "November, 1999, Margaret Cho is home in San Francisco at the Warfield Theater. Cho structures her monologue loosely on her professional life's trajectory: doing stand-up, cast in an ABC-TV sitcom, losing 30 pounds in two weeks for the part, the show's cancellation, a descent into booze, pills, and self-loathing, and a resurrection into her own voice, her own shape, and being the one she wants.",
      "tmdbMovieId": 38548,
      "avgRating": 3.70622,
      "releaseYear": "2000",
      "numRatings": 434,
      "posterPath": "/uYDY0n2kBJTouMHWWdwErXEHRf6.jpg"
   }
}