{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0204709",
      "video": false,
      "title": "An Affair of Love",
      "recommendations": [
         185494,
         104710,
         121652,
         36113,
         74126,
         46278
      ],
      "backdrop_path": "/A8PiYWnTJZPVt26XSLynrJRqCHJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Her",
               "gender": 1,
               "credit_id": "52fe4719c3a36847f8123725",
               "name": "Nathalie Baye",
               "profile_path": "/1oDCTomK09eXEZwMTniNNciH7zp.jpg",
               "id": 136761,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Him",
               "gender": 2,
               "credit_id": "52fe4719c3a36847f812372f",
               "name": "Sergi López",
               "profile_path": "/dH5jWen7KE4N3QuNSpeGOVAdIOT.jpg",
               "id": 16972,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Interviewer (voice)",
               "gender": 0,
               "credit_id": "5932d5afc3a368599000d72d",
               "name": "Jacques Viala",
               "profile_path": null,
               "id": 1527640,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Joseph Lignaux",
               "gender": 0,
               "credit_id": "5932d5cdc3a36859de00d4b8",
               "name": "Paul Pavel",
               "profile_path": "/kGJt5oIUe3AZQzB7Ua6sVG2JOsP.jpg",
               "id": 3517,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Madame Lignaux",
               "gender": 1,
               "credit_id": "5932d603c3a3685a4500d610",
               "name": "Sylvie Van den Elsen",
               "profile_path": null,
               "id": 223259,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Hotel receptionist",
               "gender": 0,
               "credit_id": "5932d6489251417de200d704",
               "name": "Pierre Gerranio",
               "profile_path": null,
               "id": 1072373,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Ambulance driver",
               "gender": 2,
               "credit_id": "599a245c9251414a210079a9",
               "name": "Hervé Sogne",
               "profile_path": "/5zbFAGKAcc8divdl0MC6RxkRtip.jpg",
               "id": 587137,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Hospital employee",
               "gender": 2,
               "credit_id": "599a246b9251414a0d007c19",
               "name": "Christophe Sermet",
               "profile_path": null,
               "id": 438290,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4719c3a36847f812372b",
               "name": "Frédéric Fonteyne",
               "profile_path": null,
               "id": 151166,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5932d6abc3a3685a0b00dd62",
               "name": "Philippe Blasband",
               "profile_path": null,
               "id": 19985,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.645463,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         },
         {
            "iso_3166_1": "LU",
            "name": "Luxembourg"
         }
      ],
      "id": 46991,
      "vote_count": 15,
      "budget": 0,
      "overview": "They recount their impressions to the Interviewer. They met through a magazine ad, She and He. They corresponded through the Internet. He responded to her ad seeking someone to fulfil her fantasy for \"a pornographic affair\". This is their first meeting in a Paris café. He's a little reticent. She wants to know whether or not he's hairy. (He is; he's Spanish.) They retire to a nearby hotel room. The door of the room closes. Unseen, the affair is consummated... They continue to see one another regularly each week. They find they get along well together. Soon she suggests that they try normal sex the next time...",
      "similar": [],
      "original_title": "Une liaison pornographique",
      "runtime": 80,
      "poster_path": "/cXOD8JaHL5OfhhwIXnVVJbT5GQI.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "ARP Sélection",
            "id": 189,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Artémis Productions",
            "id": 11773,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-04",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Frédéric Fonteyne"],
      "runtime": 80,
      "synopsis": "Frédéric Fonteynes \"Une Liaison Pornographique\" (US title, \"An Affair of Love\") is an unusual love story, insofar as it unfolds in reverse. Every Thursday, at the same hotel, at the same café, He and She (they are totally anonymous) meet in order to satisfy their sexual phantasm. Their anonymity is not without recalling Alain Renais characters in \"Hiroshima Mon Amour\" (1958) or \"Last Year at Marienbad\" (1961). But here the ordeal is not that of the memory nor of the bomb, but that of a trite story of two people who do not know how to love and communicate. She (Nathalie Baye), a mid-fortyish, confident, unattached woman, felt the need to realize a sexual phantasm. To this end, she placed a classified ad in a pornographic journal (or was it on the internet?). He (Sergi Lopez), a handsome man, ten years her junior, answered it. Now sitting at two different locations, they recall their adventure to an unseen man (a journalist, a pollster, whomever), answering his questions, as the camera goes back and forth between the two characters. Their descriptions of the circumstances which lead to their first meeting are remarkable by their lack of consistency. But, if their recollections of specific facts have grown vague, the strong emotions engendered by their love for each other and their tragic break-up are still very much alive. The rest of the story is presented in a series of flashbacks, interspersed with the characters comments to the interviewer. At their nervous first meeting in a café, She is reserved at first and He is rather shy, although at first glance, one might have an impression of him as a macho-type. They face each other at a table, somewhat self-conscious. Their conversation is sparse and He seems somewhat taken aback by her boldness when She informs him that she has already reserved a room in a nearby hotel. They go to the hotel, register, and go upstairs to their room. The door closes on them, leaving the camera outside, and the next scene shows them in the street confirming their next date for the following Thursday. And so they meet weekly, for months. However, as time progresses, the sexual fantasy is slowly moving to the background as their feelings for each other develop. It is obvious that from the first moment they met, they were attracted to each other. Now, there seems to be the possibility that they have really fallen in love. This possibility is born out when, back in the café, She declares her love to He. They go to the hotel, but his time, they will make love normally, and for the first time, the viewer is allowed to enter in their room. Eventually, the time comes when the two cannot go further without a real, traditional commitment. Such commitment requires them to change direction, not only into a situation of emotional sharing, but into the realization that their couple is not exactly an island. The latter is brought about by an incident at the hotel, when an older stranger (Paul Pavel) mistakenly enters their room, and is later found dead of an apparent heart attack in the hallway. This incident gets them involved with the reality of the outside world that they experience as a couple for the first time. The brief intrusion of the stranger into their life and the subsequent meeting with his wife (Sylvie Van den Elsen) shows what could be awaiting He and She, should they persist in the logical evolution of their relationship. He and She meet for a final time at the café, each having individually decided to continue toward a final commitment. But unsure of and trying to double-guess their partners desire yet unable to communicate, they instead part forever. Returning to the present moment and to their interview with the unseen man, they both still refuse to divulge the character of the womans phantasm. She brushes off the interviewer by simply stating \"It was an act of love. It could have been anything.\"",
      "writers": ["Philippe Blasband"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0204709/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1Mjk3NDM1NF5BMl5BanBnXkFtZTcwMzg1NTUxMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Nathalie Baye, Sergi López, Jacques Viala | See full cast and crew »"],
      "reviews": [
         "This is one French movie which I am pretty sure will not run through an American remake. It has all the elements that attract the intellectual European movie goer, and all what is rejected by the typical American viewer. It is a love story with two characters, almost everything happens in just two places (a restaurant and a hotel room), drama is based on characters development, and eroticism is all but explicit. It is a love story, but it departs the usual romantic comedy pattern and escapes the cheap happy end that spoils that many American movies. Acting is superb, and actually the best part in the film, though it is sometimes too static, more Russian or East European style than French. At the end, you are left with a simple story of un-realized love, the message being that the imposed limits of communication according to which the heros decided to play decide their ultimate faith, and the faith of their relationship. Not too much, but decent cinema if you like the style and genre. 8/10 on my personal scale.",
         "This little movie is simply sublime. I ran across it again when searching for more Sergi Lopez films. His range is simply amazing, from sensitive fantasy lover (as in this film) to the most dastardly twisted villain. I would be hard-pressed to think of any more talented male actor in European film today. I particularly liked him in \"Dirty Pretty Things\", due to its serious, thoughtful treatment of the pressures on immigrants. \"A Friend Like Harry\" was just great entertainment, humor of the darkest sort. \"Une Liason Pornografique\" is still another type of film altogether. The French produce many interesting films on sex, some successful, some less so. This is of the best I can recall from my own 20-year love affair with European art films. Another recent French film that I can whole-heartedly recommend is Coline Serreau's Chaos, which took several years to cross the ocean to the U.S., but was originally released in 2001. Also Chocolat by Claire Denys, another quiet but piercingly accurate character study.",
         "It is not a perfect film, it has flaws, the most obvious being the pseudo psycho babble that could have been achieved with greater effect by having said less, but having said it better. It is a romance, it is romantic, it is sexy, and it is a slice of life, their lives, a small part that keeps the rest of their lives from being without charm. There is no need to contemplate the past or their futures but the moments that make the present happiness complete. The film proves that sex between mature adults can be beautiful, and not bound by the petty mores of witless societies that demand sex take place between pnuematically enhanced teenagers and souless males who would not understand the rhythms of sex without a street directory. Nathalie Baye was 51 when she made this film and has an attractive body, but she has a great way of making herself erotically desirable. Any person that has never laughed, joked or cried during sex has not had much good sex. It is the casual and caring ease between the leads that demonstrates how sex can be imtimate and romantic and caring. The people who call this movie cold have looked at it from the director's eyes and have failed to capture the warmth of the two leads. The title, I think is in the French style of ironic (a word missing from the American dictionary) rather than the British sense of the word. While the British treat irony like a Shakespearean tragedy the French equate it more with the \"little death\" and regard it more as humour tainted with pathos. The French idea of tragedy is to leave the ending out of movies, but perhaps I am over using irony here. If you have 80 minutes to spare to think about the relationships in your own life, then this little movie just might help you explore your own heart a little more. And remember a movie without flaws is called, \"Looney Tunes.\"",
         "In the search for intimacy and meaning in the dehumanizing urban environment, quite personable, intelligent and attractive people have to resort to newspaper or online ads to meet someone for romance or just companionship. In this film, however, a man and woman, both attractive and personable, seek depersonalised sex, not involvement. Or so they thought. Of course they become emotionally involved, and then the question becomes: will they continue? This is a very nicely judged piece using a combination of interview sequences intercut with flashbacks. There are no distractions: we focus almost entirely on Nathalie and Sergi as they are interviewed separately about their affair. Their versions are not identical but there is only one flashback version of each encounter so there is not a lot of confusion. The curious thing is that although intimacy develops it follows the rules of the original impersonal pornographic encounter \u0096 no names, no talk about jobs and families and friends, no swapping of personal detail. They meet once or twice a week in the same coffee bar and hotel room for six months or more, yet still know virtually nothing about each other (apart from their sexual fantasies). Why this holding back? Neither is currently attached to anyone else. The only explanation is that they really didn't want to get involved, or don't want to take the risk. Burned before? Who knows? Nathalie Baye as the (slightly older) woman is poised, charming and not obviously hung up about sex. She seeks the zipless f*** of feminist legend. She does have trouble expressing her feelings \u0096 for her `I love you' are the hardest words in the language (all right, `Je t'aime'). Sergi Lopez as her homme de jour is a bit more emotionally expressive but still holds himself back. I suppose one could see the film as suggesting that the alienation of modern life can be traced to an unwillingness to become emotionally attached, that life is faster and cleaner if relationships are disposable without much pain. These two want intimacy, but they don't want to pay for it. It's a well-made movie with plenty of Parisian bustle and lots of nice close-ups. It's all a bit sad, though. Have we been reduced to being consumers of personal relationships as well as sex?",
         "An ad in the paper with a specific sexual fantasy asked for. A meeting of 2 strangers, who remain so both to us and to each other. A subtle deepening of feelings for each other...this movie is so delicate it is like gossamer. Nuances of looks, smiles, movement. \"Elle\" winds up a little harder, \"lui\" a little softer. I was spellbound by it. Recommend it to those who like their movies to stay with them for a while. Great acting and direction.",
         "The story of a romance between two people - no names, no lives, only each other and the time they had together. It's beautiful. It's one of those movies that stabs at your heart every now and then. You know what you want to happen, but at the same time, you know it won't. I love Natalie Baye and Sergi Lopez. Both actors are incredible in their own rights and wonderful together. The characters that they helped create only further that. I love how there are no names, no phone numbers, no address. There's only each other and that room. As the viewer, we don't even get to see what happens in that room, except for the more normal scenes. At the end of the movie, I can't help but wonder... what happened in that room and I watch it over and over to find out what happens and I never do. If anyone does, let me know. I'm still dying to find out. At the end of the movie, anyone who's seen it, knows it ends with an unhappy ending, but I can't help but think it will end differently. I always watch it and wait, hoping for something I know won't happen. It makes it end all the more beautifully, despite the fact that I still think in my twisted little head that perhaps the 'behind the scenes' guys gave them their phone numbers and names and they ended up together. Of course, when I know that my version didn't go as planned, I feel a deep sorrow. It's like two of my best friends breaking up and ruining everyone's lives... Of course, everything makes it all the more beautiful. I also love the way that the movie is brought out. It's a fictional movie with fictional characters presented as a documentary.",
         "Her (Nathalie Baye) places an ad in a magazine looking for a sexual partner to share her fantasy. He (Sergi Lopez) responds. They meet in a bistro on a gray afternoon in Paris and proceed to a nearby hotel. Their coupling is very satisfactory to them and they proceed to other encounters. All this is told in flashback with both speaking separately, and wistfully about what happened and how it ended. This is a fascinating story, appealingly told with sureness by director Frederic Foteyne and his attractive, expressive leads. Yes, their affair is casual, sexual and without the usual \"meeting cute\" baggage. Actually, I thought she was the engine that began and ended the affair. Lopez's character seems to be far more emotionally involved as the affair progress than Baye's. He responds to her responding to him and you can see him falling for her. Her speech to him about her feelings is quite startling and you think, maybe he's going to seek her commitment. A happy ending, though this is not one of those silly tearjerkers where you sit there embarrassed, would have been wrong and it's very satisfying. I loved this small, quiet, movie. The sex is very discreet. The dialoge is direct and thank goodness this is not a wordy movie. It doesn't need it. It's got a very good director in control of his material and two fine leads who tell you all you need to know. I just discovered Sergi Lopez was the villain in DIRTY PRETTY THINGS. He's a terrific screen presence. Someone mentioned CHAOS (in connection with their review of this film), another French film I recently discovered. Two more mature, well-written, well- acted and directed films could not be imagined. Highly recommended.",
         "Frederic Fonteyne's Une Liason Pornographique, ridiculously retitled An Affair of Love in the US to satisfy the US censors, falls into the category of much better-than-it-sounds. Nathalie Baye and Sergi Lopez are the anonymous couple who meet through a contacts magazine to engage in an unnamed sexual fantasy and who decide to make a regular thing of it. Naturally they end up falling in love and destroying their relationship at the very moment when it seems that it has a future. That what could have been yet another Tango in Paris actually works is down to the strength of the performances - refreshingly, not once does Lopez resort to some of his more overused mannerism - and the fact that both characters prove somewhat unreliable narrators in Phillippe Blasband's script. Not much sex, virtually no nudity, but some moments of truth in a concise and involving movie.",
         "An unnamed man and woman find each other through the personal ads of a sex magazine, to engage in a pornographic act that forms their mutual fantasy (the camera, old-Hollywood style, lingers in the hotel corridor during the act itself). They meet again; and again. They start to get to know and like each other. They make normal love. Maybe they'll have a normal relationship. But the film continually reminds us of the proximity of the crowd, within which they might blur back into being strangers; of the beguilingly complex topography of relationships (you feel the emotional landscape as electrically as you feel her finger trace the contours of his face and back in one scene); of the possibility for devastatingly wrong moves even amid the most enveloping intimacy; of the inevitability that even our profoundest memories will erode; of the relationship between the experience and the interpretation of an event. This is the epitome of a concise, elegant, sensitively written and acted European film; not designed to move an artistic mountain, but a certain crowd-pleaser.",
         "A careful & thought-provoking examination of how two lives intersect.... and how the nature of that intersection defines and then changes the level of personal engagement. The film is compelling in its continual exploration of how we know ourselves, how we know each other...the lens & filters (real & imagined) through which we know the world. Both performances were exemplary...and the conversations (which drove the bulk of the film) remarkable for their seeming realism. (even with subtitles!)"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "ARP Sélection",
         "Artémis Productions",
         "Canal+"
      ],
      "summaries": ["They recount their impressions to the Interviewer. They met through a magazine ad, She and He. They corresponded through the Internet. He responded to her ad seeking someone to fulfil her fantasy for \"a pornographic affair\". This is their first meeting in a Paris café. He's a little reticent. She wants to know whether or not he's hairy. (He is; he's Spanish.) They retire to a nearby hotel room. The door of the room closes. Unseen, the affair is consummated... They continue to see one another regularly each week. They find they get along well together. Soon she suggests that they try normal sex the next time..."],
      "budget": 0
   },
   "movielensId": 3855,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1999-09-04",
      "dvdReleaseDate": "2001-01-23",
      "directors": ["Frédéric Fonteyne"],
      "runtime": 80,
      "movieId": 3855,
      "title": "An Affair of Love",
      "mpaa": "",
      "actors": [
         "Nathalie Baye",
         "Sergi López",
         "Jacques Viala",
         "Paul Pavel",
         "Sylvie Van den Elsen",
         "Pierre Gerranio",
         "Hervé Sogne",
         "Christophe Sermet"
      ],
      "imdbMovieId": "0204709",
      "originalTitle": "Une liaison pornographique",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "They recount their impressions to the Interviewer. They met through a magazine ad, She and He. They corresponded through the Internet. He responded to her ad seeking someone to fulfil her fantasy for \"a pornographic affair\". This is their first meeting in a Paris café. He's a little reticent. She wants to know whether or not he's hairy. (He is; he's Spanish.) They retire to a nearby hotel room. The door of the room closes. Unseen, the affair is consummated... They continue to see one another regularly each week. They find they get along well together. Soon she suggests that they try normal sex the next time...",
      "tmdbMovieId": 46991,
      "avgRating": 3.65335,
      "releaseYear": "1999",
      "numRatings": 388,
      "posterPath": "/cXOD8JaHL5OfhhwIXnVVJbT5GQI.jpg"
   }
}