{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "boston",
            "id": 1680
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "family relationships",
            "id": 10235
         }
      ],
      "imdb_id": "tt0120593",
      "video": false,
      "title": "The Autumn Heart",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 11532,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ann",
               "gender": 1,
               "credit_id": "52fe4cacc3a368484e1c1d8f",
               "name": "Tyne Daly",
               "profile_path": "/lI6AOkMfPJRmCav6KhElje9bD40.jpg",
               "id": 66221,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Diane",
               "gender": 1,
               "credit_id": "52fe4cacc3a368484e1c1d93",
               "name": "Marla Sucharetza",
               "profile_path": "/aGhbVmBBR24Qbx3jq9f3NLMgeIy.jpg",
               "id": 21129,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Donna",
               "gender": 1,
               "credit_id": "52fe4cacc3a368484e1c1d97",
               "name": "Marceline Hugot",
               "profile_path": "/7WxTQBruJR8IqKZ5ui6D4kPH1Yy.jpg",
               "id": 54124,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Deborah",
               "gender": 1,
               "credit_id": "52fe4cacc3a368484e1c1d9b",
               "name": "Ally Sheedy",
               "profile_path": "/xfNrfzgDwyvmczadJWw4fN70siS.jpg",
               "id": 12851,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Daniel",
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1d9f",
               "name": "Davidlee Willson",
               "profile_path": null,
               "id": 1183659,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Leah",
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1da3",
               "name": "Lisa Keller",
               "profile_path": null,
               "id": 146056,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1da7",
               "name": "Bobbie Steinbach",
               "profile_path": null,
               "id": 1183660,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe4cacc3a368484e1c1dab",
               "name": "Will Lyman",
               "profile_path": "/xYU1FSeQhXLyg6VskqRBofFyoU8.jpg",
               "id": 163671,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1db1",
               "name": "Steven Maler",
               "profile_path": null,
               "id": 1183661,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1db7",
               "name": "Davidlee Willson",
               "profile_path": null,
               "id": 1183659,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1dbd",
               "name": "Kelley A. McMahon",
               "profile_path": null,
               "id": 1183662,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1dc3",
               "name": "Jerri Sher",
               "profile_path": null,
               "id": 1183663,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1dc9",
               "name": "Lisa Marie Schiller",
               "profile_path": null,
               "id": 1183664,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1dcf",
               "name": "Marc Chabot",
               "profile_path": null,
               "id": 1183665,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.001626,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 201581,
      "vote_count": 0,
      "budget": 0,
      "overview": "When a school bus driving woman (Tyne Daly) has a heart attack, she makes one request of her three daughters (Ally Sheedy, Marla Sucharetza, Marceline Hugo) - she wants them to find their long lost brother, who was taken away by their father (Jack Davidson) 16 years ago. What they discover is that while they have struggled, their father has become a wealthy man and their brother is in school at Harvard.",
      "similar": [
         3134,
         4771,
         112160,
         858,
         281957,
         281,
         773,
         298312,
         133805,
         2142,
         400,
         527,
         45153,
         8272,
         261023,
         44925,
         12162,
         334,
         8923,
         8967
      ],
      "original_title": "The Autumn Heart",
      "runtime": 110,
      "poster_path": "/4qsYYKHfgNvK3MI1KUA7AJsraYx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Film Cellar",
         "id": 15012,
         "origin_country": ""
      }],
      "release_date": "1999-01-27",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Sister Forever",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Maler"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Davidlee Willson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120593/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczNjA5NDk0N15BMl5BanBnXkFtZTcwNTkwNDIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Tyne Daly, Marla Sucharetza, Marceline Hugot | See full cast and crew »"],
      "reviews": [
         "Every now and then a group of talented writers, actors, directors, etc. coalesce without fanfare, big budget, or broadside promotion and quietly give birth to a very special film. So it is with \"Autumn Hearts\", a sentimental comedy/drama about a Harvard University student and groom-to-be who's unexpectedly reunited with a trio of long lost sisters from the other side of the tracks. The films takes the audience on a roller coaster ride of laughs and tears as the motley mix of characters earnestly seek needed reconciliations and purge long held regrets. All acting is good but Sheedy's performance in consummate.",
         "This is one of the worst movies I've ever seen. There was no character development, no point at all. Just a \"susie cream cheese ending\" that made me want my 2 hours back. I like most of the actors involved, but was really disappointed and found this to be a waste of time and video. Contrived, sappy, bad acting. What was Tyne Daley thinking? I'm amazed anyone would rate this a good movie. You could see the ending coming a mile away. If you're thinking of watching it, save those 2 hours for something else. Tyne Daley's talents are hardly used at all...laying in a hospital bed for much of the movie, barely any lines. Just sad and such a waste.",
         "This movie contains some of the best acting by Ally Sheedy and Tyne Daly. The story is strong, characters are hilarious, and there's enough of a twist to wreck the most stoic person. The movie revolves around a family... or fractions of a family brought together after some time. Unaware sisters seek out a long lost brother and father. Their journey takes them to the other side of the tracks, into unknown territory, and establishes that family is tighter than all known boundaries - even stronger than the truth. So many movies delve into the surface of \" children of a divorce.\" This movie rips into the core of the damage two adults can have on their children. It should be required viewing for any parents splitting up.",
         "I was really looking forward to seeing that movie from 1999 (a period, in which I liked Ally Sheedy' s appearance), as somebody said it was warmhearted or so. In fact I was completely bored throughout the whole film. Is it because I live in old Europe - the family-ideals proposed in that film were so creamy overdrawn and didn't match mine at all...? The characters of the siblings were so different, you wouldn't believe they are relatives. Like another commenter said, they were not developing at all. Sheedy had to act a hysteric, bitter, always yelling beast, who had never come over losing her father by divorce of her parents. She had to present us a flat black-and -white-psychology with no tones of grey in between.",
         "The reappearance of a long absent, non-contributing father (hint of alcohol) with more money and charisma than the mother who struggled, and the pain and confusion of sensitive children who don't know how to react is a fairly common real-life occurrence, worthy of serious treatment. This film avoids that. The sisters are genetically anomalous caricatures; no background for mother's decision to divorce is provided, but Dad's little box of treasures is; and having mother die makes the difficult work of resolving blame, guilt, loyalty and fair outcome unnecessary. Shallow feel good ending. Son gets to love dead Mom he doesn't know. Girls get to love Dad who didn't even want to be there. Dad wins. Everyone else loses.",
         "It is precisely because of movies like this one that I ever more frequently seek out independent films. A remarkable accomplishment from this talented screenwriter. Many have been unduly harsh and critical of this film because it walks along a \"well-trodden\" hollywood path - the heartaches of families who deal with divorce. But to see only this is to miss the forest for the trees. \"The Autumn Heart\" tells the story of one family's outcome from divorce. But during the storytelling we are enriched with wonderful characters who quickly stir a multitude of different feelings within ourselves. We discover many layers to each of these characters (or at least we do if we realize we are in the forest). This should undoubtedly be credited to the terrific perfomances in this film. If you have not seen \"The Autumn Heart\" yet, go see it. If you have seen it, see it again (as I have) for it comes even more alive the second time. An amazing achievement from an independent film.",
         "I loved this movie! It was fun, it was sad, it was insightful! Terrific performances. I especially liked Marla Sucharetza, who played Diane. Although we initially see the \"ditsy\" side of Diane, we come to discover there is a lot more to this kind-hearted character. I will be on the lookout for more from this talented group.",
         "My wife and I enjoyed this film a lot. The actors come across like real people, and the script is funny at times, serious at times. The movies adult subject matter is constrained to adult language, and some adult situations.",
         "Yes, the movie is very predictable and full of cliché's as stated in some of the commentaries. So what? How many different versions of Cinderella have you seen so far? All cliché and predictable, isn't? In my opinion what is outstanding in this movie is Ally Sheedy's performance, and that is what makes this movie worth seeing. Superb is her acting, particularly in the scene with the final confrontation between Deb and her father. The music that plays in the background during that final confrontation scene is also really beautiful. Looking up in the end credits, I guess it is called \"February\", but I could not find it anywhere so far.",
         "My wife & I saw this film at the Nantucket Film Festival this past June. Both of us was blown away with the wonderful story that made us both laugh & cry !!!! Great movie, wonderful acting, cannot understand why this movie hasn't been picked up domestically??????????? This is a real great movie!!!!"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Film Cellar"],
      "summaries": ["When a school bus driving woman (Tyne Daly) has a heart attack, she makes one request of her three daughters (Ally Sheedy, Marla Sucharetza, Marceline Hugo) - she wants them to find their long lost brother, who was taken away by their father (Jack Davidson) 16 years ago. What they discover is that while they have struggled, their father has become a wealthy man and their brother is in school at Harvard."],
      "budget": 0
   },
   "movielensId": 3856,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-27",
      "dvdReleaseDate": "2001-11-27",
      "directors": ["Steven Maler"],
      "runtime": 110,
      "movieId": 3856,
      "title": "The Autumn Heart",
      "mpaa": "",
      "actors": [
         "Tyne Daly",
         "Marla Sucharetza",
         "Marceline Hugot",
         "Ally Sheedy",
         "Davidlee Willson",
         "Lisa Keller",
         "Bobbie Steinbach",
         "Will Lyman"
      ],
      "imdbMovieId": "0120593",
      "originalTitle": "The Autumn Heart",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "When a school bus driving woman (Tyne Daly) has a heart attack, she makes one request of her three daughters (Ally Sheedy, Marla Sucharetza, Marceline Hugo) - she wants them to find their long lost brother, who was taken away by their father (Jack Davidson) 16 years ago. What they discover is that while they have struggled, their father has become a wealthy man and their brother is in school at Harvard.",
      "tmdbMovieId": 201581,
      "avgRating": 2.42857,
      "releaseYear": "1999",
      "numRatings": 7,
      "posterPath": "/4qsYYKHfgNvK3MI1KUA7AJsraYx.jpg"
   }
}