{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "tv show",
            "id": 2571
         },
         {
            "name": "media",
            "id": 6007
         },
         {
            "name": "celebrity",
            "id": 6562
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "teenage girl",
            "id": 10809
         },
         {
            "name": "hospital",
            "id": 11612
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "masked man",
            "id": 15069
         },
         {
            "name": "tragic event",
            "id": 15249
         },
         {
            "name": "popularity",
            "id": 15402
         },
         {
            "name": "homecoming",
            "id": 156064
         },
         {
            "name": "tv news",
            "id": 158584
         }
      ],
      "imdb_id": "tt0111048",
      "video": false,
      "title": "S.F.W.",
      "recommendations": [
         19087,
         39927,
         20468,
         61752,
         18414,
         26291,
         59797,
         142573,
         40150,
         5286,
         82432,
         12251,
         13203,
         25066,
         24065,
         52017,
         220153,
         32013,
         13591,
         60158
      ],
      "backdrop_path": "/cBCUHXTzm2GSZ14FHfsJQgm4IDN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cliff Spab",
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e07405f",
               "name": "Stephen Dorff",
               "profile_path": "/l9DEmM22RzJA331AOdg5cAXaOfm.jpg",
               "id": 10822,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Wendy Pfister",
               "gender": 1,
               "credit_id": "52fe45e0c3a368484e074063",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Morrow Streeter",
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e074067",
               "name": "Jake Busey",
               "profile_path": "/mGbWKlwTTyr62h6IwL66otOQV15.jpg",
               "id": 28410,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Monica Dice",
               "gender": 1,
               "credit_id": "52fe45e0c3a368484e07406b",
               "name": "Joey Lauren Adams",
               "profile_path": "/hQqqcyUvLQwnqBYCdpGZIfKOpmO.jpg",
               "id": 16484,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Janet Streeter",
               "gender": 1,
               "credit_id": "52fe45e0c3a368484e07406f",
               "name": "Pamela Gidley",
               "profile_path": "/xfsP7yQMy9q3k1fS2PfixnyEJcl.jpg",
               "id": 59789,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Scott Spab",
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e07408b",
               "name": "David Barry Gray",
               "profile_path": null,
               "id": 94974,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Joe Dice",
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e07408f",
               "name": "Jack Noseworthy",
               "profile_path": "/g30R5ax6RSN8OSdsWZnG2IhLDFT.jpg",
               "id": 22133,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Gerald Parsley",
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e074093",
               "name": "Richard Portnow",
               "profile_path": "/bKvHyXRytdiQLZmNkV9AjdFnNvK.jpg",
               "id": 4255,
               "order": 7
            },
            {
               "cast_id": 27,
               "character": "Al",
               "gender": 2,
               "credit_id": "59087b9d925141644a00d036",
               "name": "Tobey Maguire",
               "profile_path": "/l8e9we9RmTsYgNpx4xqQIlMplLl.jpg",
               "id": 2219,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e074075",
               "name": "Jefery Levy",
               "profile_path": null,
               "id": 72125,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e0c3a368484e07407b",
               "name": "Andrew Wellman",
               "profile_path": null,
               "id": 1173718,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e074081",
               "name": "Danny Rubin",
               "profile_path": null,
               "id": 1526,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e0c3a368484e074087",
               "name": "Jefery Levy",
               "profile_path": null,
               "id": 72125,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "564122dac3a3685be5000533",
               "name": "Lauren Zuckerman",
               "profile_path": null,
               "id": 1001368,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56412032c3a3685bd40004d4",
               "name": "Peter Deming",
               "profile_path": "/3NgM7E5kRYFMXY5znBPktbeI6qB.jpg",
               "id": 9573,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "56412051c3a3685be2000432",
               "name": "Sharon Boyle",
               "profile_path": null,
               "id": 15308,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5641206c92514128a6000497",
               "name": "Dana Sano",
               "profile_path": null,
               "id": 91147,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "564122c8c3a3685bd400053c",
               "name": "Graeme Revell",
               "profile_path": "/g2Nhv2OCV8ygLYxkeDbhlqnrv7Z.jpg",
               "id": 5912,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5641231b92514128a90004e4",
               "name": "Sandy Struth",
               "profile_path": null,
               "id": 21674,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56412337c3a3685bdc0004c7",
               "name": "Eve Cauley",
               "profile_path": null,
               "id": 6480,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5641234dc3a3685be800055e",
               "name": "Rachel Abroms",
               "profile_path": null,
               "id": 10817,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5641235ac3a3685bd4000556",
               "name": "Owens Hill",
               "profile_path": null,
               "id": 53812,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "56412375c3a3685be500054d",
               "name": "Debra McGuire",
               "profile_path": "/2wH44GuUhNUORaANbwOjJNmkC3r.jpg",
               "id": 41084,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "564126f4c3a3685bdc000546",
               "name": "Sarah Auerswald",
               "profile_path": null,
               "id": 1399029,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5641271492514128a60005ba",
               "name": "Joshua Winget",
               "profile_path": null,
               "id": 95842,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 2,
               "credit_id": "5641272fc3a3685bdf000620",
               "name": "Louis DiCesare",
               "profile_path": null,
               "id": 1533787,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "5641273c92514128a10005e1",
               "name": "Ali Farboud",
               "profile_path": null,
               "id": 1533788,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.741316,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29444,
      "vote_count": 27,
      "budget": 0,
      "overview": "An alienated and misanthropic teenager gains sudden and unwanted celebrity status after he's taken hostage by terrorists where his indifference to their threats to kill him makes news headlines.",
      "similar": [
         376660,
         10193,
         2108,
         10229,
         8363,
         8193,
         272693,
         315635,
         399057,
         85350,
         449176,
         264644,
         10625,
         9880,
         26123,
         18126,
         17130,
         340485,
         308369,
         286565
      ],
      "original_title": "S.F.W.",
      "runtime": 96,
      "poster_path": "/2o9zTDKdC4MHNIYBLgFMpO5ik9o.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         },
         {
            "logo_path": "/nlG4JEjJ7SAFDehgIVvHFBPW23y.png",
            "name": "Gramercy Pictures",
            "id": 37,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-09-15",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Fate made them hostages. The media made them stars.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jefery Levy"],
      "runtime": 96,
      "synopsis": "Cliff Spab (Stephen Dorff) and his friend Joe Dice (Jack Noseworthy) are two slackers who go out one evening to buy some beer in a Los Angeles convenience store. While there, a group of masked and heavily armed terrorists take Cliff, Joe, and three other people hostage. The terrorists, who call themselves S.P.L.T. Image, have a video camera, and they tape their hostages. During the month-long standoff with the police, S.P.L.T. Image's only demand is that their broadcasts be televised on worldwide television live and uncut, or else the hostages will be killed. After two of the hostages are killed, Cliff, Joe and another hostage, a young teenage girl named Wendy Pfister (Reese Witherspoon), are the only ones left. After 36 days, Cliff become indifferent to being killed, and he says repeatedly, \"So fucking what?\", in reply to his captors' threats to kill him. Because of the coverage, this makes Cliff a media icon. The movie skips forward, picking up in the hospital. Cliff, we learn, had shot his way to freedom, at the cost of a bullet in his shoulder, and more significantly, Joe's life. Despite Joe's death, Cliff is branded a hero for saving Wendy and killing all the terrorists. He's picked up from the hospital by his brother Scott (David Barry Gray) and taken home, where Cliff soon becomes uncomfortable. He does not appreciate either the reporters camped outside his front lawn, nor his parents, who welcome him home awkwardly. Cliff cannot stand the presence of his domineering father and weak-willed mother, and he flees their house. But on the street, he finds that his life cannot go back to what it was before the convenience store. His line, abbreviated as S.F.W., is on banners, newspapers, CDs, and on billboard advertisements. At the fast food restaurant where he works, called Burger Boy, he finds his name and image on the board with a \"Special 36¢ Cliff Spab Burger\" being marketed in commemoration of his 36 days in captivity. Cliff flees to the home of Joe's older sister Monica (Joey Lauren Adams), who tells Cliff that she resents that he has gotten all the media attention, whereas her brother, who got killed during the siege, has not gotten any sympathy or even attention from anyone. After spending a night of empty passion with Monica, Cliff leaves in the morning. Cliff calls upon his best friend Morrow Streeter (Jake Busey) to help him. Morrow takes Cliff to hide out in the elegant home of his sister Janet (Pamela Gidley), a lawyer who gives Cliff some advice. She advises that he should not pass up any opportunity to exploit his fame for personal gain. Alienated with life, Cliff leaves the following day by hitchhiking out of Los Angeles. He gets a ride with a disaffected couple who confide with him about their marital troubles; this inspires Cliff not to run from his problems since they will only follow him. Cliff decides to take advantage of his newfound fame, first by checking into a fancy hotel, and then holding press conferences, making public appearances, and holding autograph signings all generally portraying him as a rebel. But Cliff's real desire is to find Wendy, whom he also sees on the news. Wendy, however, is refusing to comment about the ordeal in the convenience store. Cliff eventually manages to track her down. Soon, a romantic attraction develops, but their relationship is hampered by reporters and paparazzi tailing both of them. One evening, Cliff slips out of his hotel room, meets with Wendy, and they travel to the location of the convenience store siege, where they find that the building has been closed down and boarded up as a crime scene. After reminiscing how he and Joe managed to overpower their captors, and killed all of them in a huge gunfight where Joe was killed and Cliff was wounded, Cliff then tells Wendy he only wishes that he could just give up all this fame and celebrity status so the two of them can have a quiet romantic life together. A few days later, during a public appearance at a local high school, Cliff and Wendy arrive in the school auditorium to a cheering crowd of students. All of them are chanting Cliff's line, \"So fucking what!\", except for one distraught looking student. Her name is Barbara Wyler, nicknamed \"Babs\" (Amber Benson). Babs just sits silently, looking angry. She pushes her way through the crowd and points a gun at Cliff and Wendy on the stage and yells, \"Everything matters!\" Babs opens fire, seriously wounding both Cliff and Wendy. Media attention now switches to Babs Wyler, who is arrested, booked, and indicted for this crime. Her line of \"Everything matters\" becomes the new public catchphrase, replacing Cliff's \"S.F.W.\" line. As reporters and media people talk about Babs' actions, the wounded Cliff and Wendy, now in the hospital, are relieved that their ordeal with the media is over, and they now can slip away to re-start their romance with their new found privacy.",
      "writers": [
         "Andrew Wellman",
         "Danny Rubin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111048/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MTk0NjU3N15BMl5BanBnXkFtZTcwMzQxMTE3NA@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Stephen Dorff, Reese Witherspoon, Jake Busey | See full cast and crew »"],
      "reviews": [
         "I'm not trying to say that this movie is the greatest movie ever made, but I feel that it is too bad that more people do not know about S.F.W. It's a bit hard to believe the plot, but since when have movie plots played within the guidelines of normal society. Stephen Dorff gives an amazing performance as Cliff Spab. This was the first movie I ever saw him in, and seeing S.F.W. really made me think he is destined for big things. I liked how the story shifted from past to present constantly. This way, you had to wait until the end of the movie to find out what happened at the beginning. Makes it all the more intriguing. I love this movie, and most people would too if they gave it half a chance.",
         "I saw this movie about 3 or 4 years ago, and fell in love with it. It was at a period in my life that I needed something to show me that I was still alive and things could always be worse, this movie was it. The characters, the plot, the cinematography, all of it. Every minute of this movie kept me wondering what would happen next, and a lot of had edge of my seat suspense. Stephan Dorff did such a great job of playing this character. Having to balance such an emotionally scarred but still nonchalant young man must have been difficult. I really believed that he had been put through these awful things though, because his performance was that good. Reese Witherspoon also gave a great performance. I believe her role in this movie was slightly under-rated, she played your typical romantic interest but she also was the reason that Dorff's character didn't lose his mind. I often find that the cinematography is better in independant films, and I believe this was independant. It had some bad language in it, but that doesn't bother me. The symbolism that is throughout this movie amazed me, and I notice something new everytime I watch it. SFW is based on the book 'Madison Heights Syndrom', and even though I've never read the book, I'm sure they did a great job adapting it. There was not one thing about this movie I didn't like and would recommend it to everybody.",
         "I just watched S.F.W. and was amazed at how, at least five years before the major trend of 'reality TV' became the in-thing, this movie satirized it, and showed it for how wrong and un-real it is. This movie scathingly commentates on the media's ability to warp and distort truth, and to give the mundane deep meaning. Cliff Spab is a meaningless person trapped in a meaningless society that does not appreciate the horror of his ordeal and ruthlessly tries to cash in on his pain. This film is chock-full of meaning and irony, and it is simply brilliant.",
         "Way, way ahead of it's time (similarly themed films made years after were Natural Born Killers, Mad City, Truman Show), this is, quite simply, a life-altering, mind-altering film which zeroes in on and then embodies the zeitgeist of the nineties. See this film, take a look at the world surround you (especially western popular culture), and think about it. It's also pretty f***in' funny.",
         "I watched this film not knowing what to expect; what I got was one of the coolest, most original films I've seen. It is ostensibly a hostage-drama set in a Fun-Stop convenience store, but rapidly reveals itself as more; a biting attack on the media circus and the hype machine, a revealing portrayal of suburban life in America, and a comment on the nature of heroes. The leads are played effortlessly by Stephen Dorff (who seems to not be acting at all)and Reece Witherspoon, with excellent support from B-movie stalwarts Joey Lauren Adams and Jack Noseworthy. All the characters are unlike those you see in most films... they are the sort of people you've met, but never expected to see on screen. Characters the hero Spab (Dorff) meets along the way are delightfully unattractive and random, from the hippie Earl and his militant partner to the receptionist in a neck brace at a posh hotel. Richard Portnow's FBI agent has some wonderfully quotable lines, and Mr and Mrs Spab soon reveal themselves to be far from the perfect parents. The arrangement of the story (flashbacks are employed heavily) lets you build up a rounded picture of the events that made Spab a hero, not revealing the true account of what happened in the store until near the end. Up to this point the events are clouded by the media and gossip surrounding the \"Fun-Stop Hostage Crisis\" and although we are led to believe Spab did something spectacular, the later flashbacks reveal why he is unwilling to assume the mantle of hero and why he seems to be in a bad mood most of the time!. A great film that depicts a classic anti-hero with more than adequate back-up from the script and cast. Watch it soon!.",
         "S.F.W. Aspect ratio: 1.85:1 Sound format: Dolby Stereo A feckless young man (Stephen Dorff) becomes an unlikely celebrity after surviving a televised hostage ordeal in his local convenience store, but he's unable to reconcile the tragedy of the siege - in which his best friend (Jack Noseworthy) was killed - with the exaggerated version of events peddled by a ratings-hungry media. Jefery Levy's cult-movie wannabe pairs Dorff alongside relative newcomer Reese Witherspoon in a vicious assault on the contemporary media, depicted here as a soulless entity concerned solely with ratings and money (yeah, so what else is new?). The message is obvious, but Levy and co-scriptwriter Danny Rubin (GROUNDHOG DAY) revel in their own daring: Dorff and Witherspoon play ordinary characters who emerge from an extraordinary situation and are forced to confront their unexpected (and unwanted) fame. However, Levy's unflattering view of modern journalism (symbolized by John Roarke as a variety of thinly-disguised real-life TV celebrities who feed off other people's misery, and Gary Coleman in a fleeting, self-deprecating cameo) seems a little distorted and misleading, though clearly filtered through the lead character's personal viewpoint. Dorff himself is terrific, as always, playing a charismatic and foul-mouthed Everyman, scornful of the manner in which his personal misfortune has been manipulated to feed the expectations of a mindless, sensation-hungry audience. But there are moments when the screeching soundtrack fades abruptly to silence and Levy concentrates on Dorff's haunted face as he recalls key events - good and bad - from the siege, and the friendships that were forged and destroyed under extreme duress. The movie doesn't say anything new, but the execution is invigorating. Look out for an early appearance by Tobey Maguire as a young stoner who thinks he's died and gone to heaven when he and his buddy (Dana Allan Young) encounter their idol Dorff on an empty street (a truly hilarious sequence). Steve Antin cameos as a news reporter named after his character in the equally odd INSIDE MONKEY ZETTERLAND, helmed by Levy in 1992.",
         "I personaly really liked this movie ,i thought Stephen Dorff was great this movie got me interested in him and his other movies!I like the plot its different and doesnt really hide anything its better for a younger crowd 15-21 it can be related to easily by them as it contains a lot of anger and confusion the catch frase is \"So F*****g What\" which tries to make us c that nothing really matters ! The characters are all put together pretty good except Reese Witherspoon's character Wendy did get on my nerves a bit she just didnt seem right for the part! i recommend this movie i really liked it ,it also has great music in it ranging from hole ,Maralyn mason and soundgarden .",
         "I truly feel sorry for the people who paid money to see this film, and I use that term loosely. With only $64,000 in ticket sales at least only a couple thousand were subjected to the seemingly unending nothingness of this movie. The writing is so patently obvious and juvenile, a five year old could have thought of better lines sitting on the toilet. I don't completely blame the actors for their terrible performances since they had very little to work with from the writing. What I can't believe are the reviewers who rave about this movie. Were we watching the same thing? Were you high? Oh right, given the content, you probably were. Please don't ever waste your time watching this, unless you are contemplating suicide.",
         "I had high hopes for this movie but was totally disappointed upon seeing it. For how much I didn't like it, something about this movie stuck with me ten years later, looking back I've created a more interesting version of what this movie COULD have been in my head, It put me on the edge of wanting to believe that it was a poor man's Oliver Stone movie. The most intriguing thing about this movie is that watching it puts you in a specific time and place, a short lived style in the early to mid 90's that seems like a twilight zone dream. It captures something about that time that very few movies have done. Other than that quality, the plot, which starts off great slowly rolls down an incline and falls flat off a cliff. The characters almost have depth and catch your interest right from the start but end up over the top annoying, especially the main character Spab. By the end of the movie, he's lost any redeeming quality and Joey Lauren Adams character's continual whining becomes like nails on a chalk board. Having had no background knowledge of this movie upon seeing it, I really thought that Kevin Smith was somehow involved because it has the same feel of his early work and uses a few of the same actors. All in all, this could have been a memorable movie, far ahead of it's time with it's depiction of reality TV and media sensationalism but in reality, was really just a big waste of time.",
         "Yes, the acting and directing were a little inconsistent, and some of the lines were sophomoric and occasionally downright lame, but the value of the movie lays in it's overall existentialist theme. Cliff Spab doesn't care about the consequences of anything- he's smokes, he drinks, he curses, doesn't care about bettering himself, doesn't really care about the way he looks, and isn't afraid of anything- not even death. Is it because he was overlooked, abused, etc.? Not really. Cliff doesn't revel in fame or attention when he gets it, but rather treats it as a joke because it simply doesn't matter (even if he half enjoys it), hence the phrase \"So Fu.... What.\" The importance of this phrase points to the notion that nothing really matters in life. Someone can get the best grades, go to the best schools, watch their weight, be good to others, always do right, gain fame and notoriety...or they can be shot in the head in the middle of a store robbery. In the grand scheme of things it really doesn't matter. Quoting Chuck Palahniuk, \"On a long enough time-line, the survival rate for everyone drops to zero.\" Our existence in our solar system, in our galaxy, in the universe is a spec of dust on a spec of dust on a spec of dust, hence SFW (nothing really matters). The black comedy and satire of this movie comes from the doting media and fans of Cliff Spab. It's not that they really love him, they are just looking for an answer- a motto to guide their lives. But, as in real life, something seemingly meaningful to you one moment becomes a useless fad in the next moment. In the conclusion of the movie Barbara Wyler tries to shoot Cliff or something (it's really been years), and states her tag-line \"Everything matters!\" It's the complete opposite theory of Cliff's. Her essential meaning is that everything we do has an affect on the future, future generations, the overall makeup of things on our planet, etc. Her message could be looked at as kind of good, but the irony lies in the fact that she seems all too excited to step directly into Cliff's shoes and be another meaningless, short-lived role model. In essence Cliff was right when he believed nothing matters and Barbara's time in the spotlight will also fade away. One day neither will be remembered and will have no affect on anything or anyone. Even those that followed them for a brief time will be gone and forgotten. It's a sad story of the media misguiding people to waste their short lives with whatever's popular and meaningless in the moment. But, it also questions, if nothing really matters anyway, SFW."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "A&M Films",
         "PolyGram Filmed Entertainment",
         "Propaganda Films"
      ],
      "summaries": [
         "Cliff Spab is a guy who doesn't really care about anything. He gets held hostage at a store for 36 days by terrorists, who demand that the entire thing be broadcast on national television. Cliff ends up taking a bullet for fellow hostage Wendy - making him a national hero. The two are the sole survivors of the ordeal, and soon become prisoners of the media. Cliff escapes it all, only to find himself being pushed further away from Wendy when he needs her most.",
         "An alienated and misanthropic teenager gains sudden and unwanted celebrity status after he's taken hostage by terrorists where his indifference to their threats to kill him makes news headlines."
      ],
      "budget": 0
   },
   "movielensId": 386,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-15",
      "dvdReleaseDate": "2003-06-17",
      "directors": ["Jefery Levy"],
      "runtime": 96,
      "movieId": 386,
      "title": "S.F.W.",
      "mpaa": "R",
      "actors": [
         "Stephen Dorff",
         "Reese Witherspoon",
         "Jake Busey",
         "Joey Lauren Adams",
         "Pamela Gidley",
         "David Barry Gray",
         "Jack Noseworthy",
         "Richard Portnow",
         "Tobey Maguire"
      ],
      "imdbMovieId": "0111048",
      "originalTitle": "S.F.W.",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["CLQ_dlkA6sU"],
      "plotSummary": "An alienated and misanthropic teenager gains sudden and unwanted celebrity status after he's taken hostage by terrorists where his indifference to their threats to kill him makes news headlines.",
      "tmdbMovieId": 29444,
      "avgRating": 2.82677,
      "releaseYear": "1994",
      "numRatings": 381,
      "posterPath": "/2o9zTDKdC4MHNIYBLgFMpO5ik9o.jpg"
   }
}