{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0138681",
      "video": false,
      "title": "The Opportunists",
      "recommendations": [],
      "backdrop_path": "/rND611tFZeWyEIYKAlZ0Y7Mci7Z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Victor 'Vic' Kelly",
               "gender": 2,
               "credit_id": "52fe46d9c3a36847f8115945",
               "name": "Christopher Walken",
               "profile_path": "/ApgDL7nudR9T2GpjCG4vESgymO2.jpg",
               "id": 4690,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Michael 'Mikey' Lawler",
               "gender": 2,
               "credit_id": "52fe46d9c3a36847f8115949",
               "name": "Peter McDonald",
               "profile_path": "/gPc9j1Sqn1mrShUkPMbj2subRWF.jpg",
               "id": 73283,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rest Home Sister",
               "gender": 1,
               "credit_id": "52fe46d9c3a36847f811594d",
               "name": "Kate Burton",
               "profile_path": "/6xfvY8epNXBLXIKOK3mdyC5q5ra.jpg",
               "id": 20879,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Aunt Diedre 'Dee'",
               "gender": 1,
               "credit_id": "52fe46d9c3a36847f8115951",
               "name": "Anne Pitoniak",
               "profile_path": "/zcQf85EI3UyqDc9SKqrVCSKIOx5.jpg",
               "id": 38691,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rest Home Priest",
               "gender": 0,
               "credit_id": "52fe46d9c3a36847f8115955",
               "name": "Jim Mayzik",
               "profile_path": null,
               "id": 134147,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Miriam Kelly",
               "gender": 1,
               "credit_id": "52fe46d9c3a36847f8115959",
               "name": "Vera Farmiga",
               "profile_path": "/oWZfxv4cK0h8Jcyz1MvvT2osoAP.jpg",
               "id": 21657,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pat Duffy",
               "gender": 2,
               "credit_id": "52fe46d9c3a36847f811595d",
               "name": "Donal Logue",
               "profile_path": "/h0JZ8Hyc9p6sY2jQeJkDcax6UY3.jpg",
               "id": 10825,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sally Mahon",
               "gender": 1,
               "credit_id": "52fe46d9c3a36847f8115961",
               "name": "Cyndi Lauper",
               "profile_path": "/4fMFl40wCdIEjlajmdpqqPJkhMQ.jpg",
               "id": 87255,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dylan",
               "gender": 0,
               "credit_id": "52fe46d9c3a36847f8115965",
               "name": "Paul D'Amato",
               "profile_path": null,
               "id": 134148,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46d9c3a36847f8115941",
               "name": "Myles Connell",
               "profile_path": null,
               "id": 134146,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d9c3a36847f811596b",
               "name": "Myles Connell",
               "profile_path": null,
               "id": 134146,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.732399,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 45905,
      "vote_count": 3,
      "budget": 0,
      "overview": "Vic is a struggling auto mechanic with a safe-cracking past and a lot of debt. His girlfriend runs a bar and offers to loan him the money she's saved for remodeling, but Vic is reluctant to take it. When a long-lost cousin from Ireland shows up on his doorstep, the two team up for one last heist.",
      "similar": [],
      "original_title": "The Opportunists",
      "runtime": 90,
      "poster_path": "/vjcS2jhBLTlUdaMj4Gc9Ug4nDjC.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Flashpoint (I)",
            "id": 13495,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eureka Pictures",
            "id": 1002,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Clinica Estetico",
            "id": 1274,
            "origin_country": ""
         }
      ],
      "release_date": "2000-05-17",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "When crime is all you know, you've got to take what you can.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Myles Connell"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Myles Connell"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0138681/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0OTkyMjc1NV5BMl5BanBnXkFtZTcwNzQ2NTMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Walken, Peter McDonald, Anne Pitoniak | See full cast and crew »"],
      "reviews": [
         "Christopher Walken and his girlfriend played by Cindi lauper are both New Yorkers so I'm certain they both felt right at home in their roles. Many who like fast action, snappy dialog types of films will be bored with this one. However, for those like me who enjoy a great, well-developed character study carried out in about 88 minutes, this is worth a viewing. Walken plays a safe-cracker who has served his time and trying to go straight, working as a mechanic, and paying for his old aunt to stay in a home run by nuns. Always on the verge of debt, the sale of his car is saboutaged by someone wanting to get him to do one more job, the safe at the armored car office. So, pressured from all sides, he agrees. In the safe, his halpess \"helper\", posing as a cousin from Ireland, gets Walken trapped and caught by the cops. He gets out of it when the business owner, who also runs an illegal laundering operation, fails to press charges. We see walken going back into Lauper's bar, presumably to live straight from then on. The story thus is sorta victimless. Although Walken and the others are helped by the one money bag that is successfully stolen by the Irish guy, then split up, it was money illegally gotten. We are, I suppose, to forgive Walken because he had no choice. The most interesting scene was where he was practicing \"cracking\" the 3 different safe combinations within 6 minutes to avoid setting off the alarm. The DVD is \"budget\" all the way - Dolby AC-3 sound, no menu, no extras. However, the sound and picture are not deficient, given the formats. Just a well-acted, low-budget film, and I enjoyed it.",
         "This is worth taking a look at. Walken does a commendable job as the small-time crook, now out and self-employed, trying to stay honest fixing cars in a garage. Cindi Lauper is good, piling on a thick NYC accent, first time I've seen her in a movie. She's likeable, very grounded in the movie. The supporting cast is very real. The result is, you don't like many of them a lot. They're average people, and we see them in less than flattering scenes. To that extent, you do like them because they're dealing the best way they know with events. The movie works, in part because of what it doesn't do. It doesn't make us endure one of those speeches the wife or girlfriend or best pal gives the ex-con, just before he's about to commit to one more heist. Here, Lauper just tells Walken to hit the road, she knows somethings up, and it's gonna spoil the plans they made. Very low-key. No need to get into melodrama, everybody knows the Walken character, they're not going to change his mind with wailing. I wouldn't drive across town to see the film, but if it's convenient, this is a good character study. It has some humor, too, but only as a byproduct of things going on, not a goal. The tone of it reminded me of the movie, Thief, but only in the sense that we're watching people who live in a realm most of us never go. I'd rather see this kind of movie than another one of those idiotic gross-out comedies.",
         "This movie was paced really well and the characters were are very believable. I was especially suprised I enjoyed Cyndi Lauper's acting. Quite Good. I am a Christopher Walken fan so probably would enjoyed it more than others. Even so it was a good, down to earth story with some morals. It was interesting, funny and really very enjoyable. I liked the quirky humour and was glad I watched it. I would definitely recommend it to anyone. See it.",
         "Christopher Walken plays a loser auto mechanic in Queens, New York whose life is hitting rock bottom. His checks are bouncing all over the place, and his relationship with his girl friend, nicely played by Cyndi Lauper is heading nowhere fast. He becomes involved in a heist, with some bumbling locals. The film works well enough, but the writing is a bit weak, and it could have been directed a little better. But well worth a look. By the way, Walken is excellent.",
         "Even though it's not a big budget film, it is the acting that makes this movie so enjoyable to watch. Each of the actors gives a believable performance. I already knew that she was a very talented singer/songwriter but who would have guessed that Cyndi Lauper was such a wonderful actor. It's a pity that she didn't have a larger role. I hope that she continues with her acting. The DVD contains absolutely no extras - not even the movie trailer. It was never given a cinema release in Austalia but turned up on DVD at a budget price.",
         "I think the writer/director's aim was to make a simple crime story (on a low budget) that had a very credible and believable feel - presenting characters that seem to come from any local neighborhood. At this the movie succeeds. The scenes and dialogue are carefully crafted and the film as a whole is very well cast and acted. I liked Walken's understated performance. It's consistent with the other actors. Also, it seems more natural and devoid of the self-acknowledging flippancy found in some of his other work. The movie is low-key, and one can probably see the end coming. Yet someone looking for a caper film without contrived suspense or melodrama - and a little bit of a character study - will find this rewarding.",
         "Definitely low key, with only a nosebleed of violence, this caper movie is both unpredictable and entertaining. Christopher Walken, Cyndi Lauper, along with the entire cast, are excellent. What drives the film into above average territory is tremendous character development. We actually get to know who is pulling the heist, rather than rushing into it. So what you get is a very quiet film with likable characters who you care about. If you are looking for an edge of your seat high tech robbery movie, avoid this. If on the other hand you would like to relax and take time to understand some interesting thieves, seek out \"The Opportunists\". - MERK",
         "After a distant cousin comes to stay with him, one-time safe-cracker Christopher Walken is lured into taking one more heist assignment. Too-familiar story nevertheless has interesting elements, both funny and dramatic. This safe-cracker has not come far in the last decade: he has to rent a fancy car as a ruse, his cousin is a crafty but green accomplice, and the two security guards in on the scheme are schnooks. Mildly enjoyable despite an overall feeling of lethargy and predictability. Cast is strong, with Walken doing his usual even, solid work and Cyndi Lauper (of all people) very attractive as a no-nonsense bar-proprietress. ** from ****",
         "Warning: contains spoiler This movie, in the way it was crafted, reminded me of the craftsmanship of the great films of the forties. (Casablanca, African Queen, Mildred Pierce, to name a few of my favorites) That is, straightforward in telling the story and no superfluous fluff. The screenwriters could have easily gone astray in this film by adding love scenes between the daughter and the boy or even Lauper and Walken's character, but they deftly avoided this and stuck to the story. I enjoyed each and every performance and it is a shame that because of the Academy's focus on mainstream cinema Christopher Walkens will probably be overlooked at Oscar time. He conveyed so much with his facial expressions alone that it is easy to watch this movie again just for his low key performance. My favorite scene in the film was where the Walkens character is practicing opening safes and his cohorts are watching this. Near the end of it they are shown asleep on the couch while Vic is still hard at work on the locks. This reminded me of the disciples in the Garden of Gethsemane who slept while Christ 'watched'. I am not saying Walkens character is a Christ figure. But in this he and Christ were at one: they took their craft seriously. And later when the 'disciples' begin to loose faith in Walken's character he confidently parades out of the house and announces that the next day the heist will come down. One minor glitch: Walkens character didn't impress me as the type who would botch an automobile repair job; so at that point I felt something was fishy, but I quickly forgot about that fact and rode the crest of the story. The minor characters were all equal to their roles and I was pleasantly pleased with Cindy Lauper. Give this one 9 out of 10 and hope it garners a Oscar nomination.",
         "The poker-faced Walken character is at the center of this mildly entertaining look into the life of an insolvent ex-safe cracker. A journeyman film at best, the Walken character seems to care so little about his life that it is difficult for the audience to care creating a rift between audience and character and resulting in a story which is like warm beer: Flat, but satisfying if you're thirsty enough."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Clinica Estetico",
         "Eureka Pictures",
         "Flashpoint (I)"
      ],
      "summaries": [
         "Vic is a struggling auto mechanic with a safe-cracking past and a lot of debt. His girlfriend runs a bar and offers to loan him the money she's saved for remodeling, but Vic is reluctant to take it. When a long-lost cousin from Ireland shows up on his doorstep, the two team up for one last heist.",
         "A struggling auto mechanic with a criminal past agrees to one last heist to pay off his debts."
      ],
      "budget": 0
   },
   "movielensId": 3860,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-05-17",
      "dvdReleaseDate": null,
      "directors": ["Myles Connell"],
      "runtime": 90,
      "movieId": 3860,
      "title": "The Opportunists",
      "mpaa": "R",
      "actors": [
         "Christopher Walken",
         "Peter McDonald",
         "Kate Burton",
         "Anne Pitoniak",
         "Jim Mayzik",
         "Vera Farmiga",
         "Donal Logue",
         "Cyndi Lauper",
         "Paul D'Amato"
      ],
      "imdbMovieId": "0138681",
      "originalTitle": "The Opportunists",
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Vic is a struggling auto mechanic with a safe-cracking past and a lot of debt. His girlfriend runs a bar and offers to loan him the money she's saved for remodeling, but Vic is reluctant to take it. When a long-lost cousin from Ireland shows up on his doorstep, the two team up for one last heist.",
      "tmdbMovieId": 45905,
      "avgRating": 3.01449,
      "releaseYear": "2000",
      "numRatings": 69,
      "posterPath": "/vjcS2jhBLTlUdaMj4Gc9Ug4nDjC.jpg"
   }
}