{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "strike",
            "id": 4112
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "coach",
            "id": 8338
         },
         {
            "name": "misfit",
            "id": 9789
         },
         {
            "name": "american football player",
            "id": 155791
         }
      ],
      "imdb_id": "tt0191397",
      "video": false,
      "title": "The Replacements",
      "recommendations": [
         14709,
         9942,
         20697,
         5693,
         10414,
         11067,
         10985,
         20857,
         11652,
         9991,
         9536,
         11983,
         14635,
         9622,
         16232,
         9918,
         13257,
         10956,
         11808,
         10478
      ],
      "backdrop_path": "/yA4OiCFItCMCmFOXVFT4Xy1HsqI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Shane Falco",
               "gender": 2,
               "credit_id": "52fe43659251416c7500ec87",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jimmy McGinty",
               "gender": 2,
               "credit_id": "52fe43659251416c7500ec8b",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Annabelle Farrell",
               "gender": 1,
               "credit_id": "52fe43669251416c7500ec8f",
               "name": "Brooke Langton",
               "profile_path": "/u44XljgfkA6KBmJlEPyquR6bmL.jpg",
               "id": 35980,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Clifford Franklin",
               "gender": 2,
               "credit_id": "52fe43669251416c7500ec93",
               "name": "Orlando Jones",
               "profile_path": "/7QOW3bgYjPxnjwrZDclmnJenhPH.jpg",
               "id": 18270,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Jamal Jackson",
               "gender": 2,
               "credit_id": "52fe43669251416c7500ecaf",
               "name": "Faizon Love",
               "profile_path": "/tKz3IMO2jT8NdoDXOlKmcw4wLXf.jpg",
               "id": 62066,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Daniel Bateman",
               "gender": 2,
               "credit_id": "52fe43669251416c7500ecb3",
               "name": "Jon Favreau",
               "profile_path": "/sJSGJwGa3hjMlJNUCxF7wQwo7fb.jpg",
               "id": 15277,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Nigel 'The Leg' Gruff",
               "gender": 2,
               "credit_id": "52fe43669251416c7500ecb7",
               "name": "Rhys Ifans",
               "profile_path": "/p0rbwzc4Yj2oHW0iiln0X0Wx9EK.jpg",
               "id": 7026,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Jumbo",
               "gender": 0,
               "credit_id": "563f010392514129fe01f558",
               "name": "Ace Yonamine",
               "profile_path": "/q0LsDtKaHJVKsKRThIneGvMbIza.jpg",
               "id": 1532981,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Walter Cochran",
               "gender": 2,
               "credit_id": "563f01319251414c7000d578",
               "name": "Troy Winbush",
               "profile_path": "/h5QhqEdCgwbFdvtGEAMLDf1RkAb.jpg",
               "id": 76476,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Brian Murphy",
               "gender": 2,
               "credit_id": "563f01539251416cd80060dc",
               "name": "David Denman",
               "profile_path": "/rT1dvSLZjlfiZm7VvD1qEbvZ34O.jpg",
               "id": 62562,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Earl Wilkinson / Ray Smith",
               "gender": 2,
               "credit_id": "563f017e9251413b1300f476",
               "name": "Michael Jace",
               "profile_path": "/cnULwB3zzpyBqMoUTkdvtAVnpFH.jpg",
               "id": 46921,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Pilachowski",
               "gender": 2,
               "credit_id": "563f01a5c3a3681b4d034c0c",
               "name": "Gailard Sartain",
               "profile_path": "/QFQlZdsM0QEUDWll19fgnxALYq.jpg",
               "id": 2886,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Eddie Martel",
               "gender": 2,
               "credit_id": "563f01cec3a3681b5e02bc62",
               "name": "Brett Cullen",
               "profile_path": "/dSucCeOCUJy8nDjUjxmWguu3W1D.jpg",
               "id": 16841,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Edward O'Neil",
               "gender": 2,
               "credit_id": "563f0230c3a3681b5202d5af",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Andre Jackson",
               "gender": 2,
               "credit_id": "563f043b9251413442005db5",
               "name": "Michael Taliferro",
               "profile_path": "/8W5mA1wm9pF1J6F7w1XaUojhlUm.jpg",
               "id": 87360,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43659251416c7500ec7d",
               "name": "Howard Deutch",
               "profile_path": "/68Vae1HkU1NxQZ6KEmuxIpno7c9.jpg",
               "id": 26502,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43659251416c7500ec83",
               "name": "Vince McKewin",
               "profile_path": null,
               "id": 65365,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43669251416c7500ec99",
               "name": "Seth Flaum",
               "profile_path": null,
               "id": 21794,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43669251416c7500ec9f",
               "name": "Dylan Sellers",
               "profile_path": null,
               "id": 65559,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43669251416c7500eca5",
               "name": "John Debney",
               "profile_path": "/hTrlvZlDXQk49nfc2BM9sjKfJv.jpg",
               "id": 4500,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43669251416c7500ecab",
               "name": "Tak Fujimoto",
               "profile_path": "/stUrxvmoFNrNLskc2oPhrOOeinB.jpg",
               "id": 16300,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 9.819642,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10393,
      "vote_count": 273,
      "budget": 0,
      "overview": "Maverick old-guard coach Jimmy McGinty is hired in the wake of a players' strike to help the Washington Sentinels advance to the playoffs. But that impossible dream hinges on whether his replacements can hunker down and do the job. So, McGinty dusts off his secret dossier of ex-players who never got a chance (or screwed up the one they were given) and knits together a bad-dream team of guys who just may give the Sentinels their title shot.",
      "similar": [
         10637,
         22881,
         9655,
         9291,
         2300,
         4942,
         11287,
         8923,
         13416,
         323677,
         86130,
         17108,
         10474,
         26602,
         319888,
         9955,
         9767,
         9563,
         10158,
         13680
      ],
      "original_title": "The Replacements",
      "runtime": 118,
      "poster_path": "/cHI4RgNND66gAcV63V5SoS76tVQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "2000-08-07",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Throw the ball. Catch the girl. Keep it simple.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Howard Deutch"],
      "runtime": 118,
      "synopsis": "The film opens with Shane Falco (Keanu Reeves), a former star quarterback at Ohio State University who choked in his final college game and failed to succeed in the pros, doing his job cleaning the bottoms of peoples' boats. While underwater, he finds a metal trophy football labeled \"Shane Falco: All American\" and pretends he is playing football again. Meanwhile, the fictional Washington Sentinels are shown playing a game in which commentators John Madden and Pat Summerall mention a players' strike taking place over salary disputes. As the game winds down, Sentinels quarterback Eddie Martel (#7) (Brett Cullen) chooses to slide to the ground instead of scoring the game winning touchdown to avoid getting injured. After the name, the Sentinels coach, Lindell (Keith David), announces a walk-out of himself and the rest of the team over his players $5 million annual salary demand which has not been met. The next day, Edward O'Neil (Jack Warden), the owner of the Sentinels, decides to hire Jimmy McGinty (Gene Hackman), the Sentinels' former coach who was fired after getting into a fight with the team's star quarterback, to recruit replacement players during the strike and coach the team for the rest of the season. He tells McGinty that all they need is three wins out of their final four games to advance to the playoffs. McGinty tells O'Neil he will only do it if he promises not to interfere with his coaching style. McGinty recruits many different ragtag and misfit players whom include: Nigel Gruff #3 (K) (Rhys Ifans), a Welsh footballer (soccer player) and pub owner, nicknamed \"The Leg\" because he can kick a soccer ball the entire length of the playing field. He also has a tendency to smoke on the field and has a crippling gambling addiction. Walter Cochran #34 (RB) (Troy Winbush), a religious man who is a firm believer in the power of the Lord. Cochran played one game in the pros and blew out his knee. Earl Wilkinson aka \"Ray Smith\" #42 (CB) (Michael Jace), a former star defensive back/kick returner, serving a prison sentence for assaulting a police officer. He's allowed to play only with the permission of the governor of Maryland. Daniel \"Danny\" Bateman #56 (LB) (Jon Favreau), a reserved, almost reticent man during normal interaction with people, but when placed in an adversarial situation, goes completely berserk, particularly if he sees the color red. Linebacker and defensive captain. Jumbo Fumiko #68 (OT) (Ace Yonamine), a Japanese sumo wrestler turned offensive tackle with a passion for food. The Jackson Brothers; two blood brothers and former offensive linemen turned bodyguards for rapper ODB who only seem to excel when they play on the same team. Jamal Abdul Jackson #72 (G) (Faizon Love) and André \"Action\" Jackson #73 (G) (Michael Taliferro) Clifford Franklin #81 (WR) (Orlando Jones), a stock boy currently working in a mini mart who can outrun anyone, but cannot catch anything. Brian Murphy #86 (TE) (David Denman), a tight end who would have been a first round draft pick had he not been born deaf. Shane Falco #16 (QB) is persuaded by McGinty to come on board to play quarterback again. Falco soon becomes attracted to the team's head cheerleader, Annabelle Farrell (Brooke Langton), who likes him as well, but doesn't want to date him because of her stereotype that all pro athletes are prima donnas. Annabelle is also looking for replacement cheerleaders and she hires Heather (Sarah Ann Morris) and Dawn (Caroline Keenan), two strippers who try out for the Sentinels' cheerleading squad. They're accepted because the other people trying out are terrible (Annabelle also invites several of their \"Co-workers\" to the team). While Heather appears the more competent cheerleader, Dawn appears to play the role of the ditzy blonde because she always forgets things and spaces out. In the Sentinels' first game using replacement players, they trail by four with only a few seconds left to play. McGinty calls a passing play, but Falco gets scared and changes the call to a running play. Cochran gets tackled just before he reaches the end zone and the Sentinels lose. That night, the actual Sentinels players taunt the replacement players at a bar, leading to fight between the two teams. The replacement players get arrested, but are beginning to build team chemistry, which is something they lacked in the first game. The newfound team chemistry leads to a last second field goal victory in the next game, and then another last second victory the next week, leaving the team needing only one more victory to make the playoffs. However, O'Neil tells McGinty that Eddie Martel has crossed the picket line and will be re-activated by the Sentinels for the final game of the season. McGinty protests at first, saying that he will use Falco as his quarterback, but O'Neil convinces him that the team cannot afford to have Falco choke with the game on the line, especially since they are playing the best team in the league who has had their entire team cross. A heartbroken McGinty tells Falco that he has been cut in favor of Martel, but Falco accepts the news, saying that it's best for the team since Martel is better than him, to which McGinty says that Falco has heart and Martel does not. Falco stands Annabelle up on a date because of his depression. In the final game of the season, Martel has trouble connecting with the team due to his prima-donna attitude, and scolds them whenever he makes a mistake. At halftime, the Sentinels trail 17-0, and reporter asks McGinty what they will need to win the game, to which he replies \"miles and miles of heart\" meant as a message to Falco. Falco hears him say this and comes to the game during halftime, and the rest of the team kicks Martel out of the locker room. Falco runs onto the field at the start of the half and draws loud and thunderous applause from the fans. He apologizes to Annabelle and kisses her on national TV. Cochran is able to run for a touchdown at the beginning of the half before injuring his leg. The Sentinels then score again to cut the lead to 17-14. With only a few seconds left in the game, McGinty calls for a field goal to tie the score and then go into overtime. But when Nigel 'The Leg' Gruff, the kicker, gets set, he tells Falco that he cannot kick the field goal, because several men in the audience will \"take his pub\". Falco then takes the snap then runs it all the way for a touchdown, only to have it brought back for a holding call. Falco then goes to the sidelines and tells McGinty that he wants the ball, implying that he has gotten over his fear of choking with the game on the line. Falco throws a pass to tight end Brian Murphy for a touchdown, and the Sentinels win 20-17, advancing to the playoffs, and the Sentinels begin dancing in synchronized formation. The film ends with a voice-over from McGinty saying that when the players left the game that night, there were no endorsement deals or victory parades waiting for them, just a locker waiting to be cleaned out as they all went back to their separate lives... never playing pro-football again when the strike ended. But it didn't matter, because they each got a second chance at fame and glory, which lasts forever.",
      "writers": ["Vince McKewin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0191397/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMDQwMDgwNl5BMl5BanBnXkFtZTgwOTU5ODA5MjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Keanu Reeves, Gene Hackman, Brooke Langton | See full cast and crew »"],
      "reviews": [
         "Despite the fact that this film is a totally unoriginal and predictable retread of a dozen `losers to winners' sports stories, it is so hysterically funny that I didn't even care. The story is thin at best. The NFL is having a players strike and scabs are called in to finish the season. Our heroes are low on ability but high on desire and peculiarity. The quarterback, Shane Falco (Keanu Reeves), once had a promising career, but he fell apart psychologically when his team was pummelled in a college bowl game and he was labelled a player that folds in the big game. Of course, while visiting the NFL, Shane falls in love with the head cheerleader (Brooke Langton) who never dates players (except of course this once). All this is merely a mundane excuse for a raucous and silly comedy that has some sidesplitting moments. To enjoy this film you really need two things. You need to love football and you need to enjoy slapstick, banana peel comedy. I realize that this limits the audience considerably, but for those who qualify (and I am one), this movie is a scream. Director Howard Deutch (Pretty in Pink, Grumpier Old Men) did a great job on the football sequences. He hired 45 professional football players (Former NFL players, Canadian Football League, etc.) to do the football scenes and sent the actors to a three-week football camp. The action looked real because it was real. The players were told to play and hit the way they normally would. Of course, the plays were choreographed, but they were real football plays. The comedy was lowbrow, outrageous and crass, with a great deal of physical comedy. The cheerleader scenes were a riot, especially the cheerleader tryouts. The scene where they started pantomiming sex acts to distract the opposing team was priceless. There was also sharp-witted football humor that required more than just a passing knowledge of the game. There isn't much serious that can be said about the acting. Keanu Reeves tried to play an earnest comeback and romantic role amidst all the foolishness and it really didn't fit with the rest of the film. However, he was an excellent athlete. He did most of his own on-field shots and looked very believable as the quarterback. Gene Hackman was good when he was making snappy wisecracks, but his inspirational `Hoosiers' imitation was misplaced. This film really belonged to the supporting actors like Orlando Jones (Clifford Franklin), Michael Taliferro and Faizon Love (The Jackson Twins), Ace Yonamine (Jumbo Fumiko), Rhys Ifans (Nigel `The Leg' Gruff) and all the cheerleaders who made the comedy work. Jon Favreau gets a special mention as the crazy S.W.A.T. officer turned linebacker who took the wild man role to the next level. This film won't be fun for everyone, but it will have certain people falling off their chairs. I rated it an 8/10. Subtract two points if you aren't amused by slapstick and boorish behavior, and another two if you aren't a football fan. For the rest of you, be prepared to split a gut.",
         "To work, comedy has to be unexpected. And that is just what makes \"The Replacements\" work so well. Oh, not that the storyline is unexpected, for from it. But the actual comedy embedded in that plot is often delightfully quirky and quite unusual in this extremely good-natured and entertaining film. The very first scene, for example, takes place in a completely unexpected setting and proceeds in a really odd-ball way. As it is most times, Keanu Reeves acting is subtle. In this film you have to watch those eyes that are so eloquent when he's discouraged and listen to those little expelled breaths that convey so well (and so humorously) his state of mind when he's near the girl he's finds attractive. It's all there, and more, if you watch closely. Reeves is completely believable as a man who needs a second chance to do something he loves--play football. It's like he's a different person on and off the field--and that's exactly what the movie was trying to convey. The development (redemption is only too slightly strong a word) of Reeves' character is excellently portrayed. That struggle to overcome provides a good solid center around which all the hilarity revolves and becomes funnier in contrast. Gene Hackman and the rest of this ensemble cast did a great job--everyone has his or her moments. If the movie has a weakness, it's the romance. Not that Brook Langton and Reeves aren't good in the clinches--they have a definite chemistry. But it seems like there should have just been one scene between them with some real substance. \"The Replacements\" also succeeds well as a football movie. The great photography and sound; the inventiveness of the script in dreaming up unusual and funny, yet still plausible, game events; and the evident attention to training for and depicting the physical moves, all add up to a movie which sports fans will relish. And yet, the football plays, are presented so clearly that even someone who's not a knowledgeable football fan can understand everything that's happening, even the first time. Comedy is tough--it's quite an achievement to have folks in the theater laughing for most of two hours. And that's certainly what the audience did when I saw \"The Replacements.\" As well as cheering out loud for the \"home team,\" clapping at the end, and coming out feeling like dancing to \"I Will Survive\" like they did in the movie. As well as feeling like we can survive and be ourselves--just like those scrappy, eccentric replacements.",
         "This movie was made purely for entertainment. What a breath of fresh air. With all the extremely dramatic, be it important, films being made lately (Life is Beautiful,etc), it's nice to watch a film that is just entertaining. The supporting cast was amazing, as an ensemble they worked together as a team should. And Keanu Reeves gave a wonderful performance - he is often under appreciated as an actor because he is attractive - but he gave a solid performance. Gene Hackman was good - that goes without saying, but I think this is the first time I've ever seen him portray a character I actually liked. If you enjoy a good laugh, this a movie you would likely enjoy.",
         "This is one of those movies that you'll pick to go see for a few reasons. Gene Hackman, Keanu Reeves (Wow), football, babes,& yada yada. I went to see a sneak preview, so it didn't really matter to me if it was going to be good, because I didn't have to pay for it. Well, I would pay to see it again!! Not only is this movie beyond funny, real funny, the story is terrific, acting wonderfully strong , the dialogue so real, and it leaves you wanting more. Gene Hackman can do anything, so him playing a coach, and choosing him for the role was right on the mark. Keanu Reeves, what can I say. He's so easy on the eyes. ALL you want to do is watch him play the role as quarterback, (as if he was one), and enjoy looking at him being \"FALCO\". The chemistry between him and Annabell is so cute & mushy. It's a movie for anyone who wants to laugh, is rooting for the under dog, likes football or not, or who just wants to go to a movie and be completely entertained!! W.B. has truly captured what it is we all go to the movie for. I can guarantee you, when you see this movie, not only will you walk out wanting to see it again, but you'll tell anyone you know, to go see it and have a BLAST!! This movie is a winner!",
         "Those are the words of coach (Hackman) before the final regular season game for the \"replacement\" players, filling in for the striking regulars. The \"never-been\" QB (Keanu Reeves) must try to lead them to victory. \"The Replacements\" is primarily a good screwball comedy, in the vein of, but significantly better than, \"Best of Show\" and \"The Waterboy.\" Some may even take a \"message\" away, about the importance of teamwork, belief in oneself, true love (QB and the head cheerleader). But that is all secondary. I rate this one highly for pure escapism entertainment, but also with good acting by Reeves and Hackman, and some almost-believable football action, heavily interlaced with goofiness. The lap-dancers turned cheerleaders, who totally distract the opposing team. The tag-team vomiting during the huddle, after the Japanese sumo wrestler eats too many eggs before the game (\"I gotta beef up!\") The cop who, like in the \"Waterboy\", can get enraged (Coach says, \"I want you to get me the ball,\" and he does.) The Welsh kicker who is \"wirr-rrry strong\" and smokes a cigarette while kicking. The \"I will survive\" dance in jail, after the barroom brawl with the 'regulars.' To make a good screwball comedy, the writer and director have to walk a fine line and here they do it well. John Madden and Pat Summerall, playing announcers, are genuinely funny. The DVD picture, and Dolby Digital 5.1 sound, are up to standards.",
         "I have to admit, my boyfriend had to drag me to this movie, and I went along with it, telling myself that at the very least I could spend the next couple of hours admiring Keanu's cuteness, even if he isn't the best actor. BOY was I suprised! This was a really funny, really sweet movie that made me laugh and laugh. Keanu's acting was better than I've ever seen, the supporting cast did a GREAT job. I go to a LOT of movies, and it has been a long while since I've seen a movie that i enjoyed this much, so I really encourage you to give it a try.",
         "I haven't bothered watching professional football since Joe Montana retired but this movie got me interested again. While I can appreciate the comments of other reviewers that it is a formula movie and has many inaccuracies when it comes to the football action it is pure and unadulterated fun. The bottom line is this movie is downright funny, from start to finish. The cast are absolutely wonderful and the casting director did a brilliant job of bringing this gang together. Gene Hackman of course is perfect as the coach.... \"I'll pull you off the field you spoiled son of a bitch\".... Rhys Ifans absolute perfection as Gruff (after a **** you remark from Jimbo) \"You'll have to find your dick first Shamu\", to the shoot em up bros from the hood, to \"get me the ball, get me the ball\" The acting was absolutely wonderful in this movie. I have to admit I didn't like the guy that played Martell but perhaps that's because I wasn't supposed to like him, perhaps it shows what a good job he did. And Keanu, dear, sweet, so maligned Keanu, I read a reviewer once who said of Keanu's acting that it is \"almost transparent\" and in this movie it is, he doesn't eat scenery he just does his job, low key, perfectly in character, and for those who know anything at all about acting all you have to do is watch his eyes. He has a Harrison Ford like quality of being able to express a wealth of emotions with his eyes and in this movie he pulls it off perfectly. I also read somewhere that during the making of this movie it was discovered that Keanu really did have \"an arm\" and at one point threw a 69 yard pass. I have seen this movie in excess of 20 times and will no doubt see it 20 more times, it is the best feel-good movie I have ever seen. When I want drama and suspense I will watch \"The Green Mile\" when I want simple, comedy that just leaves me with a huge grin I will watch the replacements. Oh yeah and I just want to kiss the person who put Keanu in a No. 16 uniform *S*",
         "It's a sportsmovie. It's got every sports cliche in the book: \"I look at you and see two men. The man you are and the man you ought to be.\" But, hell, who cares? It's the Major League of football movies. Sure, it's not gonna win an Oscar, but it's entertaining. A good movie to kill 2 hours. You want drama in a football movie, check out Any Given Sunday. You want fun, mindless entertainment, check this out. Props to Keanu Reeves for learning to throw like a genuine quarterback.",
         "It is about time they put out a movie that you can watch just to feel good about something and have a good laugh. The last movie that was close to this was \"Major League\" which this was very similar to, but there were some aspects that made this better. It was the most unique roll I have ever seen Gene Hackman in and it was a very refreshing one at that. Even the music set the tone perfectly. You will love the closing, naturally I do not want to give it away but the music in the closing scene of the movie was just perfect in setting the mood and emotion. I could watch it over and over. Thumbs up on this one guys!!!!!!",
         "\"The Replacements\" is more than an \"it does for football what \"Major League\" did for baseball\" kind of movie. \"Replacements\" is funnier than that film, for one thing. It's more in the league of \"Slapshot\" with Gene Hackman providing the weight that Paul Newman brought to that film. Also, like the hockey scenes in \"Slapshot,\" the actual football sequences are really bone crunching. While there is a lot to look at in \"Replacements,\" like Keanu Reeves (who is also really good in this role, playing it for drama amid all the wackiness) getting the hell beat out of him, or like the replacement cheerleaders carted in from local strip clubs to really get the fans pumped for the game (is this what the XFL is going to be like?), this movie works as more than all that stuff. More than the sum of it's parts, as they say. \"Replacements\" has a good heart. Bottom line, I'm going to see it again."
      ],
      "genres": [
         "Comedy",
         "Sport"
      ],
      "productionCompanies": [
         "Bel Air Entertainment",
         "Dylan Sellers Productions",
         "Warner Bros."
      ],
      "summaries": [
         "A comedy based on the 1987 professional football players' strike. Gene Hackman plays the coach of the team, Jack Warden is the owner, Brett Cullen is the All-Pro quarterback that goes on strike and Keanu Reeves is the \"scab\" who replaces the star QB.",
         "When the NFL football team, the Washington Sentinels, goes on strike, the team's owner, Edward O'Neill, calls former NFL coach Jimmy McGinty out of retirement to coach a rag-tag team of replacement players to finish the season's last four games in which McGinty turns to former Ohio State player Shane Falco to be the team's captain for the duration of the season and Falco is forced to shape up the misfit players whom include convenience store guard Clifford Franklin, gangster rapper brothers Andre and Jamal Jackson, former sumo wrestler Jumbo Fumkio, a Welsh \"football\" player called \"The Leg\", a deaf player, a convict on a work-release program, a tough SWAT leader, and many more while, at the same time, Falco strikes up a possible romance with the team's cheerleading captain Annabelle Farrell.",
         "When the NFL's Washington Sentinels goes on strike, the team's owner, calls former NFL coach Jimmy McGinty out of retirement to coach a rag-tag team of replacement players to finish the season's last four games. Stage left Shane Falco the team's captain for the duration of the season is forced to shape up the misfit players whom include convenience store guard, gangster rapper brothers, former sumo wrestler, a Welsh \"football\" player called \"The Leg\", a deaf player, a convict on a work-release program, and a tough SWAT leader. Meanwhile Falco strikes up a possible romance with the team's cheerleading captain Annabelle Farrell.",
         "During a pro football strike, the owners hire substitute players."
      ],
      "budget": 50000000
   },
   "movielensId": 3861,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-07",
      "dvdReleaseDate": "2000-11-28",
      "directors": ["Howard Deutch"],
      "runtime": 118,
      "movieId": 3861,
      "title": "The Replacements",
      "mpaa": "PG-13",
      "actors": [
         "Keanu Reeves",
         "Gene Hackman",
         "Brooke Langton",
         "Orlando Jones",
         "Faizon Love",
         "Jon Favreau",
         "Rhys Ifans",
         "Ace Yonamine",
         "Troy Winbush",
         "David Denman",
         "Michael Jace",
         "Gailard Sartain",
         "Brett Cullen",
         "Jack Warden",
         "Michael Taliferro"
      ],
      "imdbMovieId": "0191397",
      "originalTitle": "The Replacements",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["Ivh1DoSVfyo"],
      "plotSummary": "Maverick old-guard coach Jimmy McGinty is hired in the wake of a players' strike to help the Washington Sentinels advance to the playoffs. But that impossible dream hinges on whether his replacements can hunker down and do the job. So, McGinty dusts off his secret dossier of ex-players who never got a chance (or screwed up the one they were given) and knits together a bad-dream team of guys who just may give the Sentinels their title shot.",
      "tmdbMovieId": 10393,
      "avgRating": 3.14396,
      "releaseYear": "2000",
      "numRatings": 3310,
      "posterPath": "/cHI4RgNND66gAcV63V5SoS76tVQ.jpg"
   }
}