{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "virgin",
            "id": 2389
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "brother",
            "id": 5301
         },
         {
            "name": "girlfriend",
            "id": 5490
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "engagement",
            "id": 6167
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "customer",
            "id": 155241
         }
      ],
      "imdb_id": "tt0199314",
      "video": false,
      "title": "About Adam",
      "recommendations": [
         149553,
         79816,
         29691,
         70515,
         52855,
         48791,
         35683,
         12257,
         58985,
         20648,
         348955,
         20407,
         17813,
         26907,
         365491,
         26042,
         53765,
         35225,
         14330,
         43079
      ],
      "backdrop_path": "/mengsEo2pGl2PhBtLJogoPEw9pP.jpg",
      "revenue": 151559,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lucy Owens",
               "gender": 1,
               "credit_id": "52fe47659251416c75097c69",
               "name": "Kate Hudson",
               "profile_path": "/87SBjReNEW8PFiGbPSTS68H39LT.jpg",
               "id": 11661,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Laura Owens",
               "gender": 1,
               "credit_id": "52fe47659251416c75097c71",
               "name": "Frances O'Connor",
               "profile_path": "/tWGMS7DciV43tlxA6UEc2UqxrhL.jpg",
               "id": 1518,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Simon",
               "gender": 2,
               "credit_id": "52fe47659251416c75097c6d",
               "name": "Tommy Tiernan",
               "profile_path": "/8vWYuvfl9X1nJZkgoPv5cFzAJCg.jpg",
               "id": 107682,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe47659251416c75097c83",
               "name": "Stuart Townsend",
               "profile_path": "/8xnPcuwJEz2aiPr4NoqgfBj6lnW.jpg",
               "id": 56778,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Karen",
               "gender": 1,
               "credit_id": "56e349f09251415b5f0000a6",
               "name": "Cathleen Bradley",
               "profile_path": "/hE0CJWLJFl50Hz5MoXTHs6L7QWG.jpg",
               "id": 585008,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Martin Rooney",
               "gender": 2,
               "credit_id": "56884065c3a3684be9022fd0",
               "name": "Brendan Dempsey",
               "profile_path": "/uMsK8VlLu25ZpNN3WsfPnLBXqo4.jpg",
               "id": 147054,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Alice Rooney",
               "gender": 1,
               "credit_id": "56e344c3c3a3685a92000f2a",
               "name": "Charlotte Bradley",
               "profile_path": "/rslnwlRCeVFwV3lzqKtdl3RYUqr.jpg",
               "id": 17778,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Peggy Owens",
               "gender": 1,
               "credit_id": "5623c4a192514127d4003209",
               "name": "Rosaleen Linehan",
               "profile_path": "/9uUoYAFJ6Q9iPA2PIPRQ95YxdGe.jpg",
               "id": 89393,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "David Owens",
               "gender": 0,
               "credit_id": "5623c53a9251417f4700bbbf",
               "name": "Alan Maher",
               "profile_path": "/9699ZNI5xjbSAkMwJLZoGyqDId9.jpg",
               "id": 143864,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Dympna",
               "gender": 1,
               "credit_id": "56e2afc5c3a3686ffd002439",
               "name": "Kathy Downes",
               "profile_path": "/eGfmNUdva14M3LeQicYuQJUhOGs.jpg",
               "id": 81057,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Andy",
               "gender": 0,
               "credit_id": "5623c47592514171c500e41c",
               "name": "Donal Beecher",
               "profile_path": null,
               "id": 1523892,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Professor Harry McCormick",
               "gender": 2,
               "credit_id": "579388099251413ce100b694",
               "name": "Roger Gregg",
               "profile_path": "/lGJesg15NwEo26m2uP82iLkgEPG.jpg",
               "id": 1654994,
               "order": 11
            },
            {
               "cast_id": 5,
               "character": "Customer #1",
               "gender": 0,
               "credit_id": "52fe47659251416c75097c7b",
               "name": "Stewart Roche",
               "profile_path": "/9qfecE3WZ9EEWRlNPXDLH7A1Jcp.jpg",
               "id": 1207066,
               "order": 12
            },
            {
               "cast_id": 6,
               "character": "Customer #2",
               "gender": 0,
               "credit_id": "52fe47659251416c75097c7f",
               "name": "Aoife Maloney",
               "profile_path": "/8BM0y2E6FAM3Fmap7pOgJASOfq.jpg",
               "id": 1207067,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Lucy's Ex-boyfriend (uncredited)",
               "gender": 2,
               "credit_id": "579388f4c3a36828a600b05c",
               "name": "Paul Cotrulia",
               "profile_path": "/mR8aYn190uxWjf5RVUOU4I2gtRu.jpg",
               "id": 1159568,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "548440e392514168cd0001fd",
               "name": "Gerard Stembridge",
               "profile_path": null,
               "id": 1380314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545479390e0a2635de000fc1",
               "name": "Gerard Stembridge",
               "profile_path": null,
               "id": 1380314,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.876581,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 18168,
      "vote_count": 42,
      "budget": 0,
      "overview": "A waitress falls for a handsome customer who seduces her, her two sisters, her brother, and her brother's girlfriend.",
      "similar": [
         32868,
         1259,
         24420,
         796,
         1643,
         27066,
         12531,
         263472,
         2149,
         1903,
         38,
         88,
         2064,
         46705,
         50546,
         225886,
         80752,
         28468,
         86331,
         112160
      ],
      "original_title": "About Adam",
      "runtime": 105,
      "poster_path": "/w0WvlhjBRKMKcmaMoca57ofIvCH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Bórd Scannán na hÉireann",
            "id": 1898,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Venus Productions",
            "id": 16836,
            "origin_country": ""
         }
      ],
      "release_date": "2000-01-28",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "He came. He saw. He conquered. One sister at a time.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gerard Stembridge"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Gerard Stembridge"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0199314/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2MjM2MzU0OF5BMl5BanBnXkFtZTcwNzk3MDYyMQ@@._V1_SY312_CR1,0,214,312_AL_.jpg",
      "actors": ["Stars: Stuart Townsend, Kate Hudson, Tommy Tiernan | See full cast and crew »"],
      "reviews": [
         "About Adam received new life after Kate Hudson became almost famous. But while Hudson plays a key role this film is, quite literally, about Adam, as played wonderfully by Stuart Townsend. The film begins with young Irish singing waitress Lucy, as played by Hudson with an Irish accent that comes and goes, meeting the mysterious Adam. She immediately falls for him and their new romance proceeds happily along. Lucy brings Adam home to meet the family and here things get turned on their head. After seeing the story play out from Lucy's perspective we go back and revisit the same time period from different points of view, those of Lucy's two sisters and brother. It soon becomes apparent that Adam is not quite what he seems and that he has become much closer to Lucy's family than she would ever believe. Frances O'Connor as the quiet, bookish Laura and Charlotte Bradley as the unhappily married Alice will each strike up their own serious relationship with Adam. As we see each of the sisters' stories unfold it puts a new spin on all that we have seen before. Even Lucy's brother finds himself oddly attracted to Adam while Lucy floats along completely oblivious to all that is swirling around her. Each of the key roles is performed well and enough time is given to allow us to explore the motivations of each of these characters. If we didn't really get to know these people and what drives them, everyone involved could come off rather badly, especially Townsend's Adam. But the director makes each character sympathetic enough and it all ties together very well. A clever script, mostly terrific acting, intriguing characters, wonderful Irish scenery and a very smart plot device that adds a unique twist to everything...About Adam has a lot going for it. It's a smart, funny, enjoyable ride.",
         "In some ways this is an incredibly refreshing film. In it's acceptance that lust and promiscuity are normal facts of life and not something that lead to a lifetime of suffering and possibly eternal damnation, it's almost unique in Irish cinematic history. Seeing a film so free from the historical and religious baggage that shackles most Irish films can also be a bit disconcerting, like seeing one of the nuns that taught you in school wearing a mini-skirt and fishnet tights. Set far from the traditional Irish mise-en-scene in Dublin's trendy Temple Bar area, it features Stuart Townsend as a benign Irish cousin to Jack Nicholson in _The Witches of Eastwick_, who plays on the desires of three beautiful sisters for his own ends. Far from being a scheming Casanova, he's a likeable character who does nothing more than tell a few tall tales to aid his seductive techniques, and who helps people come to terms with themselves rather than cosign them to a life of guilt by doing so. This film is like Stembridges earlier film, Guiltrip, turned inside out. It's bright, urban-based, modern, and shows signs that Ireland is finally developing a mature attitude to Sexuality.",
         "'About Adam' is a male counterpart to Gerry Stembridge's classic TV drama, 'the Truth about Clare', his innovative film about Ireland and abortion. In that film, three characters tried to grope, through memories, prejudices, egotism, blindness etc., the truth about the title character, a pregnant woman who died following an abortion in England (it is still illegal in Ireland); here, four characters try to capture the essence of the elusive Adam, a jack of all relationships but mastered by none. A knowledge of Stembridge's previous, more sober film gives this breezy comedy a darker edge - its tale of a family being given everything they sexually desire is an appropriate metaphor for a society like Ireland currently going through an unheard-of economic boom, creating a culture of extreme self-interest. The dangers of this self-interest are plain to see - a few weeks ago another Stembridge TV satire was aired about Ireland's racist treatment of refugees. We have never had this much prosperity before, and we don't want anyone else sharing it. Similarly, the last person this film is 'about' is Adam. Like 'Clare', the film is structured around the personal narratives of each character involved with Adam - Lucy (Kate Hudson, and, I'm afraid, the hype for once is spot-on - she IS adorable), the spontaneous, singing waitress with a new boyfriend every week, who finally settles down to a 'great passion'; Laura (Frances O'Conner - can there be any doubt now that she is our finest actress?), the pretentious, uptight English post-grad doing a thesis on repressed Victorian women writers who is 'loosened up' by Adam, her assumptions revealed to be a lie; David, the brother, dating a prim virgin, enlisting Adam's help and finding himself sexually attracted to him; Alice, the elder sister, trapped in a prosperous marriage to a pompous dullard, intrigued by Adam, but unwilling to lose control like her siblings that easy. Each narrative is tailored to each witness' personality (like 'Dracula', an ironic allusion throughout), in the way each story is shaped; in the stylistic devices employed; in tone; but, most importantly, in the perception of Adam. 'Clare', for all its excellence, played to that age-old myth, the mystery, inscrutability, unattainability, unknowability of woman. 'Adam', the first man, remorselessly documented throughout thousands of years of masculine culture, is suddenly the mystery, the woman, the sphinx, the passive black hole. Adam (which may not even be his name) is the blank onto which the various characters project their fantasies - he is literally what they want him to be. Naturally, plot points overlap within the four stories, and our interpretation of them changes with greater knowledge, but, paradoxically, our knowledge of Adam diminishes, helped by the lies and stories he spins about himself. Who is Adam? Besides the obvious pleasure of bedding three beautiful women, why does he do it? In fact, forget that 'besides', that's probably your answer. As well as alluding to his own work, Stembridge cleverly remodels two other classics of sexual amorphousness. Like Terence Stamp in Pasolini's 'Theorem', Adam is a stranger who enters a bourgeois household where everyone has a stereotypical role they adhere to, and which Adam smashes, forcing them to review their lives and the assumptions they live by. This has a liberating effect, but also a joyful one - this is a remarkably angst-free film. With his blank good looks, his white suit, and bleached blonde crop, Stuart Townsend (hi Celia!) is a ringer for the young Stamp. The other allusion is to 'Alfie', that freewheelingly amoral sexual cad, lying his way through a score of beautiful women. Except Adam is the anti-Alfie, he does not humiliate or diminish women, they're the ones who develop; and he lacks the controlling power of narration; but he does limit them, reducing them to 'mere' sexual urge. Significantly, both these films were key artefacts of the 1960s, and there is an optimism, a freshness, a vigour, a lightness to 'About Adam' that resembles the swinging 60s, as if Ireland, belatedly, has entered its own hedonistic decade. Both films, equally significantly, were warnings or analyses of that decade's fatal complacency, and in the exhilerating shots of Dublin that dot the film we cannot fail to notice the looming cranes, the building activity that suggests this story isn't quite finished, this culture hasn't quite reached maturity.",
         "Possible Spoilers Most films about Ireland are about either the Troubles, or the Catholic Church, or a crowd of loveable, happy-go-lucky rustics, so it comes as something of a surprise to find an Irish film set in middle-class Dublin with very little mention of religion and none at all of sectarian violence. Indeed, there is so little specifically Irish about this film that with a change of accent it could easily be relocated to London, New York or Los Angeles. The film is told in a number of episodes, each seen from the point of view of a different character. The central character, Adam, is a handsome, charming young man who is engaged to a waitress named Lucy but nevertheless seduces not only Lucy herself but also her two sisters Laura and Alice and her brother's girlfriend Karen, and comes close to seducing the brother himself. A plot like this could easily be the stuff of tragedy, but here it is treated strictly as a comedy. Unfortunately, it veers between two different comic genres, the romantic comedy and the sex comedy, with any humour there might be getting lost somewhere between the two. On the one hand, Adam is a promiscuous womaniser; on the other, he is the romantic gallant who wins Lucy's hand. The director and scriptwriter try to get round this contradiction by presenting Adam's behaviour not as exploitative but rather as liberating for the women concerned. The bookish academic Laura, the unhappily married Alice and the prim, virginal Karen are all shown as benefiting from their sexual experiences, nobody gets hurt, and all ends happily with a big white wedding. For all its modern urban setting, this film is about as realistic as one of Grimm's fairy tales. It is set in a fantasy world where everyone is good-looking, where jealousy does not exist, where sex (especially promiscuous sex) is an unqualified force for good, where a man can bed every woman he meets and still end up marrying the girl of his dreams, and where a woman's surest way to find happiness is to get laid (preferably by Adam). And leprechauns exist and there really is a pot of gold at the end of every rainbow. If you like urban legends about knights on white chargers (or pale blue E-types) bringing sexual happiness to womankind, you will love this film. I am afraid it did nothing for me. 4/10.",
         "On the face of it, it seems a little much that a no doubt sexy guy will attract females like a magnet including three sisters, one of their brother's girlfriend - and the brother - but it could well happen I guess. That in essence is roughly the plot, so if that appeals you'll probably like the film - it's reasonably well cast, adequately acted, nicely filmed and moves along at a fast pace. But if that plotline sounds too superficial, you can't stand seeing an E-type jaguar painted pale blue and aren't overly excited by Dublin as a setting, then you'll probably find it a bit ho hum. The promise of lots of appealing sex scenes will also be disappointing - certainly there is some action in that department but filmed very prudishly. However, Irish films are a rarity so that may be enough in itself to tempt a viewing.",
         "I plodded toward the multiplex against my will, my girlfriend dragging me along as we went. '...but whyyy???' I moaned. 'Shut up with ya, we're going to see it, ya big ejit!' my girlfriend snapped. My reluctance to see 'About Adam' was based on previous experiences of experiencing Irish-made films, they were all the same - poor little, thatched cottage family living in repressed little ol' Ireland in the midst of poverty - boring! However, I actually really enjoyed 'About Adam' - with proper distribution and promotion - this could be a huge hit across Europe and the USA. 'About Adam', for a thankful change, shows Ireland how it really is - modern, stylish and prosperous. The people in the film aren't weeping throughout the entire film because their potato patch is unproductive, they are just like ordinary, modern Irish people - well, we don't all go sh**ging our fiance's entire family - but other than that it's real. The film is very witty and entertaining, if only a little slow at some parts. Kate Hudson has a surprisingly good Irish accent and Stuart Townsend is a well-cast star with a bright film throughout the film industry, here and abroad. 'About Adam' is a very positive and encouraging leap forward for the Irish film industry and is an example of how more Irish films should be made in the future - we're sick of dwelling in the past - it's the positive present and bright future people want to see. 'About Adam' bears more of a resemblance to 'American Pie' and 'Road Trip' than to 'The Field' and other such films. All in all, a good show. I encourage all, European, American, Australian etc, to see this film - not just because I'm Irish, but because it is a genuinely enjoyable, funny movie.",
         "Give me a break! In what world does this director/writer live in? If anyone, after seeing this dribble, thinks it's a charming romantic comedy, then try a little role reversal and see if you still think it is. A woman, no matter how lovely her eyes may be, who sleeps with her fiancé's two brothers (one just half an hour before her wedding) would be deemed a whore and a slut. Not to mention that he's a pathological liar, to boot! How did this film get made? Maybe the backers thought an Irish film that wasn't about the Catholic Church or about the Catholic Protestant \"troubles\", would be refreshing, but please, this movie was hogwash from beginning to end. Kate Hudson, Stuart Townsend, Frances O'Connor and Charlotte Bradley made a valiant effort to make this screenplay work, but it was DOA.. Do yourself a favor, steer clear of this one. It' not worth anyone's time. I just hope the actors got paid well.",
         "Whatever happened to the real Ireland we know so well from all those Hollywood films of yore? Barry Fitzgerald, or at least his ghost, is nowhere to be seen in this hip little tale. And not a sound from Bing Crosby. Nor any nuns nor IRA types nor leprechauns nor prelates seducing altar boys. I thought \"Angela's Ashes\" had brought us up to date on Irish history, but, my goodness, just look how things have changed on the Emerald Isle! All facetiousness aside, some of the comments written here by Irish viewers are impressively insightful and full of true reflections that could as well have been made years ago about life in that tiny country. That this film comes out of a modern and progressive (to some extent at least) culture is obvious,and no Irishman need labor over an apologia to that effect. One must remember that these same streets were known to James Joyce and Jonathan Swift. As to the film itself, only a fool could take it seriously. It is a one-note \"spoiler\" from beginning to end, with no true center by way of an intriguing plot. The shifts back and forth in time to suggest multiple points of view have indeed been done before in much better films than this. The characters are apt and comely, but with little depth. Romantic comedy needs an edge, as well as some surprises, to make it go the distance. Everything here is just too likeable. Hmmm. I guess the same thing might be said of Barry Fitzgerald.",
         "The reason I say that is because I like the way they give different perspectives of several different scenes as seen by the different characters in the movie. I really like Stewart Townsend (he's one of those adorable people that are charismatic not to mention easy on the eyes). This is definitely NOT a cinematic masterpiece but I don't think it was meant to be either. It was entertaining and THAT's what I liked about it. Well, that and Stewart Townsend but I think I already mentioned that. Didn't sound like many people liked this one but I have to disagree. It's fun, sexy, flirtatious,and comedic all in one movie. Give it a chance and watch it again or for the first time, whichever the case may be.",
         "I guess from my reaction to many a romantic comedy, some may think I'm male. Actually I'm a heterosexual female who enjoys ORIGINAL romantic comedy, but I also have half a brain and expect some degree of intelligence from films. The Laura character summed this film up pretty thoroughly for me. She is an English actor, meaning that two of the main characters, including of course THE main female lead, were not Irish. I can't be bothered repeating why this is extremely sad - it's been said so many times - but the marketing machine behind most movies will not change it's mind about shoving Americans (or Brits) into the leads in \"foreign\" films, no matter how much people complain. They want the bucks, you know, and a famous names DOES mean more bums on seats. Sad but true. I found this film uninspired. There were perhaps 2 or 3 genuinely amusing and surprising lines. The characters were pretty much laughable, in a bad way. Adam's justification for his machiavellian behaviour I found ridiculous and unconvincing. This guy is not altruistic - that much should have been patently obvious to anyone with a brain half the size of an ant's b**ls. I hung on to the end. Lord knows why as I tend to advise: if you don't like a movie, turn it off. Maybe I'm feeling rather masochistic today or maybe I kept hoping something was going to happen to make it worth my while. It didn't. That said, if you don't care about intelligent scripts or whether a movie rehashes themes/styles/plots that have been done better elsewhere many a time and if you like fluffy, pointless romantic comedy no matter what, then watch and enjoy! 4/10"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Bórd Scannán na hÉireann",
         "Venus Productions"
      ],
      "summaries": [
         "A waitress meets personable, attractive Adam and they soon become lovers, then get engaged. Wasting no time, Adam starts an affair with her bookish sister, who knows about the first relationship. Their (none-too-happily) married third sister knows about both these liaisons but is still attracted to Adam. The lad is certainly playing the field, but in their own ways the girls seem to be getting just as much out of the deal as him.",
         "A waitress falls for a handsome customer who seduces her, her two sisters, her brother, and her brother's girlfriend."
      ],
      "budget": 0
   },
   "movielensId": 3862,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-28",
      "dvdReleaseDate": "2002-02-05",
      "directors": ["Gerard Stembridge"],
      "runtime": 105,
      "movieId": 3862,
      "title": "About Adam",
      "mpaa": "R",
      "actors": [
         "Kate Hudson",
         "Frances O'Connor",
         "Tommy Tiernan",
         "Stuart Townsend",
         "Cathleen Bradley",
         "Brendan Dempsey",
         "Charlotte Bradley",
         "Rosaleen Linehan",
         "Alan Maher",
         "Kathy Downes",
         "Donal Beecher",
         "Roger Gregg",
         "Stewart Roche",
         "Aoife Maloney",
         "Paul Cotrulia"
      ],
      "imdbMovieId": "0199314",
      "originalTitle": "About Adam",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "Kxp-p7Cw_7k",
         "U2oVKYID93E"
      ],
      "plotSummary": "A waitress falls for a handsome customer who seduces her, her two sisters, her brother, and her brother's girlfriend.",
      "tmdbMovieId": 18168,
      "avgRating": 3.14686,
      "releaseYear": "2000",
      "numRatings": 303,
      "posterPath": "/w0WvlhjBRKMKcmaMoca57ofIvCH.jpg"
   }
}