{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "flying saucer",
            "id": 3243
         },
         {
            "name": "godzilla",
            "id": 7671
         },
         {
            "name": "city",
            "id": 14828
         },
         {
            "name": "kaiju",
            "id": 161791
         }
      ],
      "imdb_id": "tt0188640",
      "video": false,
      "title": "Godzilla 2000: Millennium",
      "recommendations": [
         39466,
         12636,
         12561,
         6593,
         39469,
         18289,
         39465,
         19336,
         36679,
         39468,
         15767,
         1682,
         38582,
         36243,
         39464,
         19545,
         3115,
         1680,
         1679,
         15766
      ],
      "backdrop_path": "/Cvn5ZFGKmiRFnkvxkykKfjR8NG.jpg",
      "revenue": 10037390,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Yuji Shinoda",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016e11",
               "name": "Takehiro Murata",
               "profile_path": "/fCZhSQpSSu8Nn1Kn1NJ8pEoIBaK.jpg",
               "id": 66152,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Yuki Ichinose",
               "gender": 1,
               "credit_id": "52fe439a9251416c75016e15",
               "name": "Naomi Nishida",
               "profile_path": "/xjujoH3S0S7Sb2KN4XrvM8kw9VB.jpg",
               "id": 66153,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Io Shinoda",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e19",
               "name": "Mayu Suzuki",
               "profile_path": null,
               "id": 66154,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mitsuo Katagiri",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016e1d",
               "name": "Hiroshi Abe",
               "profile_path": "/a2vyZunjEClKkP6e8QWy9aS0M9d.jpg",
               "id": 66155,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Prof. Shiro Miyasaka",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016e4b",
               "name": "Shirô Sano",
               "profile_path": "/dOqwnvpAvLtfEV0YJTuJbnCeNUP.jpg",
               "id": 73139,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016e4f",
               "name": "Takeshi Ôbayashi",
               "profile_path": "/kkd43M8l7IxKUzx8HtePYq0xVNk.jpg",
               "id": 82972,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e53",
               "name": "Shirô Namiki",
               "profile_path": null,
               "id": 80131,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e57",
               "name": "Sakae Kimura",
               "profile_path": "/fH03pakRentEbawEQ2IX9EAg9Ra.jpg",
               "id": 19048,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e5b",
               "name": "Bengaru",
               "profile_path": null,
               "id": 1060569,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e5f",
               "name": "Ken'ichi Nagira",
               "profile_path": null,
               "id": 1060570,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e63",
               "name": "Ken'ichi Ishii",
               "profile_path": null,
               "id": 1060571,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e67",
               "name": "Yoshimasa Kondô",
               "profile_path": "/2YYDvLowRZFdPIMphgSF8SuqOAT.jpg",
               "id": 1029276,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Tokai Power Plant Director",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e6b",
               "name": "Kôichi Ueda",
               "profile_path": "/qOWfODlgb2J8zcVnTXA90zvRMDT.jpg",
               "id": 50659,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e6f",
               "name": "Yoshiyuki Omori",
               "profile_path": null,
               "id": 1060572,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 2,
               "credit_id": "52fe439a9251416c75016e73",
               "name": "Masahiko Nishimura",
               "profile_path": "/wCoWoRUYhycGU22ZsHM83EmJxLA.jpg",
               "id": 20333,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Gojira",
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e77",
               "name": "Tsutomu Kitagawa",
               "profile_path": null,
               "id": 1135826,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe439a9251416c75016e23",
               "name": "Takao Okawara",
               "profile_path": null,
               "id": 50651,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e2f",
               "name": "Shogo Tomiyama",
               "profile_path": null,
               "id": 50661,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e35",
               "name": "Hiroshi Kashiwabara",
               "profile_path": null,
               "id": 66156,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e3b",
               "name": "Takayuki Hattori",
               "profile_path": null,
               "id": 66157,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e41",
               "name": "Katsuhiro Kato",
               "profile_path": null,
               "id": 66158,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe439a9251416c75016e47",
               "name": "Yoshiyuki Okuhara",
               "profile_path": null,
               "id": 66159,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.858631,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 10643,
      "vote_count": 53,
      "budget": 1000000,
      "overview": "Godzilla saves Tokyo from a flying saucer that transforms into the beast Orga.",
      "similar": [
         39256,
         1682,
         124905,
         15766,
         19545,
         7191,
         315011,
         36243,
         1678,
         5876,
         293167,
         339967,
         64686,
         929,
         339530,
         373571,
         15767,
         588,
         346,
         616
      ],
      "original_title": "Gojira ni-sen mireniamu",
      "runtime": 107,
      "poster_path": "/iFqf6rOnVdBGR3PIqn1eRUffuaH.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Toho Film (Eiga) Co. Ltd.",
         "id": 622,
         "origin_country": ""
      }],
      "release_date": "1999-12-11",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/hhUQwi9Z7wE2kwwC1AM1AE418oU.jpg",
         "name": "Godzilla (Millennium) Collection",
         "id": 374512,
         "poster_path": "/v9fV11I7KVP9xa6UWvW2YlGtErD.jpg"
      },
      "tagline": "Get ready to crumble.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "JPY ",
      "directors": ["Takao Okawara"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Hiroshi Kashiwabara",
         "Wataru Mimura"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0188640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExNzAwNDMwMF5BMl5BanBnXkFtZTYwOTY2MzU3._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hiroshi Abe, Naomi Nishida, Takehiro Murata | See full cast and crew »"],
      "reviews": [
         "Heh heh, what isn't there for me to love \"Godzilla 2000\"? Minimal computer graphics, well built city models, awesome looking makeover for the big G and a neat and fierce looking foe named Orgah. Oh, and not to mention a cute little girl named Iyo, who shows a big interest for Godzilla and Orgah (perhaps a nostalgic refrence to the monster loving kids Ken Yano and Rokku-chan?). Alot of people seem to hate this movie due to it not having too much CG, no \"super sexy\" model actor or actresses or were just spoiled off of the recent Hollywood trash cinema. OMG, and someone even compaired the recent Godzilla movies to Evangellion (GAG ME!). I however, stand up for Toho. Long live Toho! Long live the King of Monsters!",
         "\"Godzilla 2000,\" actually completed in 1999 (and was released during the summer of 2000 in America), was the first Toho-backed kaiju-eiga film to receive a major theatrical distribution in the U.S. since 1985. I saw \"Godzilla 2000\" at the theater and wasn't disappointed, even though a lot has changed since Toho killed off their iconic monster at the end of 1995's \"Godzilla Vs. Destoroyah.\" I'm 19; I've been a hardcore \"G\"-fan since I was four years-old and of course, I was quite hesitant about seeing a new \"Godzilla\" film, being that the Americanized 1998 version wasn't that good. The Toho logo that appears during the opening credits reassured me that \"Godzilla 2000\" was taking me back to the good old days when Godzilla wasn't afraid to knock down a building or stomp down the military when they threatened him. With their third generation of \"Godzilla\" films being kicked off with this flashy new movie, Toho continued a trend that was seen in generation two, where they discard the events of the previous Godzilla incarnation and instead start with the original 1954 \"Godzilla\" and work from there. Toho took full advantage of this new series by designing a distinctly reptilian Godzilla, who as the film opens, has already popped up on the radar of some brainy scientist who argues that Godzilla should be studied, instead of destroyed. And Toho didn't skimp on creating a new monster either, which is a giant UFO that yields something a lot more than just martians. This new foe is actually a nasty little creature that's never given a name, though subsequent debate about the film has concluded that its name is \"Orga,\" who proceeds to try to consume Godzilla and his powers, thus creating one powerful monster. \"Godzilla 2000\" has a lot of problems too, which may or may not mar an otherwise decent stomping experience. Though on the whole, it's nice to see Godzilla back in form (somewhat) and this Toho production firmly returns their most beloved creation to dominance, it also suffers a lot from the problems that have plagued its predecessors, and some of those problems may have been due to Roland Emmerich's 1998 Americanized version of the big green guy. Of course, since I never really cared for the people in a \"Godzilla\" movie and those feelings haven't changed, it must be pointed out here that the people have been drastically short-changed in favor of the all-out monster showdown that is the film's climax. You're really given a reason to not care about humans in this picture, whereas any previous \"Godzilla\" movie may have made you have an inkling of feeling for them. Godzilla himself has changed a lot, with massive plates that line his back and he's also been given a pretty nifty set of fangs. But the thing is, this Godzilla looks and behaves quite... different. Though it's evident with this production that Godzilla is the bad guy (pending on your view), this was one of the things that really struck me as unique about the previous generation of kaiju-eiga films - in that you never really knew if he was the bad guy or not - this movie makes that pretty clear to you, even though the new monster Orga is clearly the bigger problem for the people of Japan. The special effects in this third generation \"Godzilla\" film seem to actually be a step back too. The previous generation (the first two movies at least) had really beautiful and thoughtful effects that put you into wonder about how they were achieved. This series doesn't have that level of wonder for some reason. You'd expect their effects to improve over five years or so, but these effects look rushed and unrealistic. Aside from these quibbles, \"Godzilla 2000\" doesn't suffer a whole lot, but I was glad to see that it firmly reestablished Godzilla back to his good old, stomping self. 7/10",
         "This is the latest in the Toho Films series, and it should be noted that this movie is a GODZILLA movie, a genre unto itself. Not only is it an intelligent film, with likeable characters ( the Godzilla Prediction Unit is great, in the enthusiasm of scientists trying to understand Godzilla as a force of nature; besides that, who wouldn't want to be part of the GDU and have that cool Godzilla logo on the side of their transport vehicle? ) and a truly kinetic, enthusiastic script by Hiroshi Kashiwabara and Wataru Mimura--the most telling line of dialogue in the movie, which could be used to describe the love and respect the writers have, occurs when a television reporter comments that the entire proceeding is \"like something out of a 1950s science fiction film.\" And that is the point of this movie, to remind every one of us who grew up on monster movies that in the midst of all the ALIEN-stylized cinematic drool, that the giant UFO perched menacingly over Tokyo, shimmering with mysterious electronic pulsations while Godzilla ( with an underwater swimming scene for Godzilla that is priceless) stomps in for a classic samauri-like duel with the alien craft and its occupant, with all the Man In Suit and b-movie special effects you can stand, is the reason why many of us \"creature feature\" lovers continue going to the movies TODAY, because we're looking for something like GODZILLA 2000. A movie crafted with exquisite passion and respect, both for its subject and for its audience. Go see this movie in a theatre, or be sorry you didn't. Thrill to the magnificent musical score (the best I've heard in a film this year), and the superior direction that provides Godzilla with power and heroism (yes, heroism; Godzilla's reasons for alternately destroying Tokyo, but fighting against alien forces to save it, demonstrates what all us monster freaks know: Godzilla is intelligent, and has his reasons). I dare you to go and see Godzilla blast away with his atomic breath and not be ready to come up out of your seat with joy. This movie is undiluted greatness, from beginning to end.",
         "I was fortunate enought to see the original Japanese version of Godzilla 2000. I have to say that this is The Best Godzilla Movie Of All Time. Instead of the futuristic technologies of the Heisei series (maser tanks, mechas and ESP), G2K presents more or less ordinary Japanese life. The only thing slightly futuristic in the movie are the JSDF's Full Metal Missiles (and the UFO itself). I loved the human cast. G2K will be the second movie that I loved which has a human cast I enjoyed watching, the other being \"Gamera: Guardian of the Universe\". Katagiri and Shinoda shined throughout. Yuki Ichinose and Io Shinoda are just as good to. One of my favorite scenes with the humans is Io and Shinoda giving Yuki the runaround in their little headquarters (a scene deleted from the American version, I believe). The Godzilla Prediction Network is very well thought-out organisation. Shame they don't really exist ^_^* MireGoji (the fan name for the 2000 suit) is one of the best G-suits in existence. The new dorsal plates are just great, especially as they light up. They seem to heat up from the inside, rather than flash. The new heat beam is just marvellous. Shame Goji lost the ability to blink. The UFO and Orga are one of the greatest enemies Goji's had yet. Shame Orga didn't get much to do. However, his destruction was new and refreshing. The special effects are fantastic. It's so relieving to see missiles hit their target. The CGI shots are great. My favorites are the shot of Goji swimming underwater and the tracking shot of the Full Metal Missiles under the bridge. The music by Takayuki Hattori is also fabuluous. To sum up: GOJIRAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA!!!",
         "This is my second favorite Godzilla film. It has a good enough story, a great enemy, and good enough special effects. If you own this on DVD and you live in the USA, then please watch it on the \"Audio Commentary\". It will change your view of the movie. Plus it's a great come back against \"Godzilla (1998)\" which disgraced Godzilla. If you are a big Godzilla Fan, I fully recommend this film to you. It's a great start to begin the Millennium series which also has some really good films, among my favorite. Anyway, I give this film an A-. If you watch it with the \"Audio Commentary\", you will too.",
         "I enjoyed this flick. Sure it wasn't the best movie made and it surely would not win an award, but it was a fun film. There are a couple of the Godzilla movies in the 90's I liked more, but this one did not disappoint. The dubbing is rather good for everyone except the guy who is trying to kill Godzilla. He sounds a bit to deep voiced and at one point when he laughs he goes \"Ha, Ha, Ha\", but other than him the dubbing is good. There is also a bit of dead zone where godzilla isn't around between godzilla's first encounter the flying saucer and the final battle, but it is not to bad. Also, they kind of ignore the movie Godzilla vs. Destroyah even though they show Godzilla's son taking over the reigns this fact is ignored and all the characters from the 90 films are ignored as well. All and all it is a fun movie and there is a good battle at the end.",
         "After the good but overblown \"Godzilla 1998\" Toho took their monster back and made him badder than ever, tons of atmosphere and dodgy but cool special effects are thrown into this movie which sees Godzilla coming up against a creature called \"Orga\" who by using Godzilla-Cells is able to regenerate any damage he suffers. You'll probably have guessed the plot isn't exactly stellar but there's enough atmosphere, monster violence, property damage and nifty special effects to tide you over. Not the best \"Godzilla\" movie ever but not the worst either and at least it isn't \"Godzilla '98\" 8/10",
         "This film is a delight! It was SO COOL to see the \"Big G\" on the big screen again, minus Devlin & Emmerich's \"retooling\" (emphasis on \"tool\") The crowd that afternoon was small, but enthusiastic. Granted, the dialogue is just as stilted as previous films, but still fun. And \"fun\" is the operative word here. Whereas the aforementioned Tristar release was somber and bloodless, this one brings back the sheer joy of the original series with the verve of the Heisei series. Highly recommended!",
         "Four years after the supposed last Godzilla movie, Toho brought back the Big G to star in another series of films called the \"Millennium\" series. This movie was made as a direct sequel to the original Godzilla film, but the monster simply appeared on cue - his origins and cause of his return were never explained. Aside from slight references mentioned by the characters of the monster's prior appearances in the 1960s and 1980s, you cannot really tell that this film has any relation to the original Godzilla movie. To me, I think there should be a suspense built-up to signal the return of Godzilla since 1954, like it was portrayed in \"Godzilla 1985\" (1984). Instead, Godzilla was just spotted as he began his rampage, with the military trying to stop him - nothing new here. Meanwhile, a UFO lands on Earth, and Godzilla does battle with it. Thrown in the mix are people from the Godzilla Prediction Network (GPN), out to study Godzilla and spare him from the military; I think they really weren't relevant to the story, though. The acting was lame, especially Shirô Sano's character. There is really no new material or anything special about this film, aside from the introduction of a new monster. The plot was boring, which lead to an unexciting story and an unremarkable movie. Kenji Suzuki's special effects, though, were amazing and Takayuki Hattori's music score was OK. I didn't really care for the monster suit for Godzilla - not really well executed. His radioactive breath, though, is given a more powerful purpose, as he only used it a few times in the movie. Overall, a very dull movie to be made as the direct sequel to the original Godzilla film. This movie is simply another \"monster-on-the-loose\" flick, which ended up being my least favorite Godzilla movie. Grade D-",
         "Godzilla saves Tokyo from a flying saucer that transforms into the beast Orga. There are some noteworthy firsts in this film: we have the first green Godzilla (no longer the dark gray we are used to), and the first Toho Godzilla using CGI (for better or worse) in some scenes. No, could this be the best looking man-in-suit Godzilla yet? I think so. While a bit more \"rock star\" this time around, he looks incredibly mean and aggressive, the monster you do not want to mess with. This may have been the last good Godzilla movie made (as of 2014). Although, I suppose that is all a matter of taste. Some people probably dislike this one while others probably love the Gareth Edwards version."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Toho Pictures"],
      "summaries": [
         "Godzilla returns in a brand-new movie that ignores all preceding movies except for the original with a brand new look and a powered up atomic ray. This time he battles a mysterious UFO that later transforms into a mysterious kaiju dubbed Orga. They meet up for the final showdown in the city of Shinjuku.",
         "This movie ignores all the other Godzilla movies except the original. Godzilla has attacked Japan twice more in the 60's-80's after his first appearance. Now it's 1999, and the Godzilla Prediction Network (GPN) is studying and tracking Godzilla when he appears on the coast of Nemuro. He completely destroys the city. Earlier that week, a 60 million year old rock was discovered. Without warning it begins to float and heads for a meeting with Godzilla in Tokai Mura. Godzilla uses his ultra-powerful fire breath (incredibly stronger than in the first movies) and breaks the rocks to reveal a UFO!!! The UFO blows Godzilla back into the sea with a hyperblaster but lands and ceases all activities due to the damage caused by Godzilla. Later, the UFO takes off for Shinjuku where the final battle between the UFO and Godzilla takes place. The UFO transforms into a monster dubbed Orga and resumes attacks on Godzilla. Can Godzilla defeat the strange alien creature? What other tricks do these titans have up their sleeves?",
         "Godzilla saves Tokyo from a flying saucer that transforms into the beast Orga."
      ],
      "budget": 1000000000
   },
   "movielensId": 3864,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1999-12-11",
      "dvdReleaseDate": "2000-12-26",
      "directors": ["Takao Okawara"],
      "runtime": 107,
      "movieId": 3864,
      "title": "Godzilla 2000",
      "mpaa": "PG",
      "actors": [
         "Takehiro Murata",
         "Naomi Nishida",
         "Mayu Suzuki",
         "Hiroshi Abe",
         "Shirô Sano",
         "Takeshi Ôbayashi",
         "Shirô Namiki",
         "Sakae Kimura",
         "Bengaru",
         "Ken'ichi Nagira",
         "Ken'ichi Ishii",
         "Yoshimasa Kondô",
         "Kôichi Ueda",
         "Yoshiyuki Omori",
         "Masahiko Nishimura",
         "Tsutomu Kitagawa"
      ],
      "imdbMovieId": "0188640",
      "originalTitle": "Gojira ni-sen mireniamu",
      "genres": [
         "Adventure",
         "Horror",
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["akes6lbGjaY"],
      "plotSummary": "Godzilla saves Tokyo from a flying saucer that transforms into the beast Orga.",
      "tmdbMovieId": 10643,
      "avgRating": 2.52328,
      "releaseYear": "1999",
      "numRatings": 1632,
      "posterPath": "/iFqf6rOnVdBGR3PIqn1eRUffuaH.jpg"
   }
}