{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0236388",
      "video": false,
      "title": "The Original Kings of Comedy",
      "recommendations": [
         67774,
         9698,
         25629,
         24060,
         22906,
         21153,
         41303,
         36678,
         13587,
         97207,
         30856,
         41104,
         13592,
         26370,
         13588,
         43700,
         58680,
         73669,
         87148,
         34389
      ],
      "backdrop_path": "/zp2N26mtnFCqFY8lcAsZikzlqup.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e02323d",
               "name": "Steve Harvey",
               "profile_path": "/nKhanBJNgqiULoSXVMy1tmCF1ge.jpg",
               "id": 82587,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e023241",
               "name": "D. L. Hughley",
               "profile_path": "/f6yF5dhBEooYQWY2YAWbIptNhZU.jpg",
               "id": 85931,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e023245",
               "name": "Cedric the Entertainer",
               "profile_path": "/yyGxCX3yT1weZREjCxQ40dk1aFO.jpg",
               "id": 5726,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e023249",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4470c3a368484e02324f",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4470c3a368484e023255",
               "name": "Cedric the Entertainer",
               "profile_path": "/yyGxCX3yT1weZREjCxQ40dk1aFO.jpg",
               "id": 5726,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4470c3a368484e02325b",
               "name": "Steve Harvey",
               "profile_path": "/nKhanBJNgqiULoSXVMy1tmCF1ge.jpg",
               "id": 82587,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4470c3a368484e023261",
               "name": "D. L. Hughley",
               "profile_path": "/f6yF5dhBEooYQWY2YAWbIptNhZU.jpg",
               "id": 85931,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4470c3a368484e023267",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "588be6bd9251414395000bb4",
               "name": "David Gale",
               "profile_path": "/b4MJOQRqAk2rIpMJ4vL9QBbj3qA.jpg",
               "id": 1746321,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.033032,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23618,
      "vote_count": 18,
      "budget": 0,
      "overview": "The Original Kings of Comedy achieves the seemingly impossible task of capturing the rollicking and sly comedy routines of stand-up and sitcom vets Steve Harvey, D.L. Hughley, Cedric the Entertainer, and Bernie Mac and the magic of experiencing a live concert show. Director Spike Lee and his crew plant a multitude of cameras in a packed stadium and onstage (as well as backstage, as they follow the comedians) to catch the vivid immediacy of the show, which is as much about the audience as it is about the jokes.",
      "similar": [],
      "original_title": "The Original Kings of Comedy",
      "runtime": 115,
      "poster_path": "/3WyU0n7ss8mT4b5YhPI8AfbN7XE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "40 Acres & A Mule Filmworks",
         "id": 4319,
         "origin_country": ""
      }],
      "release_date": "2000-08-18",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "We Got Jokes",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Spike Lee"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Cedric the Entertainer",
         "Steve Harvey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0236388/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NDY1NDU1M15BMl5BanBnXkFtZTcwODcyNTMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Harvey, D.L. Hughley, Cedric the Entertainer | See full cast and crew »"],
      "reviews": [
         "this movie had me laughing to the point where i found it hard to breath. some jokes are risqué and a little raunchy, but then so is life. this movie can be watched safely by adults young and old as i can attest to as i watched it confidently with my mother (!) who was in tears. everyone i know who has watched it tells me stories of laughing to dangerous extremes. one friend watching it in a less than crowded theatre was concerned she might choke and there would be no one to save her! each comedian has strong memorable material that rings true. my only problem with it is finding it on the sightread in the UK, better distribution of all \"black\" movies please.",
         "If you enjoy stand up-these were certainly the \"Kangs\"-as Steve said:) They take you back to recall your history, childhood, life. The subjects are funny because you know people like those they mimic, or are like who they comment on! Simply this film shows us why these men have remained the top of the most funny (alive) male comedians for as long as they have. As the man above,don't try to \"review\" this as a movie with plot, character development, etc. Steve Harvey was the Host so his sets were throughout and he had his own later.It's a reel of a night of standup-THAT'S ALL! These men are Funny-You can see the reaction of the crowd as they get that \"You know that's right\" moment, or have to get up and do that \"dance-laugh\" cos they will have you rollin! I can watch it every time and the reaction is the same(gut laughs)-my whole family is nearly in tears watchin Ced and Bernie. These men are crazy funny fools! Just watch it and see how much you laugh...I hope you \"get it\"-it's just COMEDY! It was also nice to see them off-stage and see the real relationship, brotherly bonds between adult black men who have done good with their lives! Entertainment at it's finest.",
         "The success of this tour surprised many whom were not familiar with these comedians, mainly because they are superstars on the African-American, not mainstream, comedy circuit. These men are funny as hell! The TV shows they appear or have appeared on do not give them the freedom to turn loose like they do in this film. One of the best sequences was when Harvey complained about rap and urban contemporary music (he was so right!) and gave respect to old school R&B. This is absolutely the best comedy that was released all summer.",
         "As a sometime stand-up comic, it was a great treat that this summer brought a big-name stand-up concert film, namely Spike Lee's \"The Original Kings of Comedy\". The film, a record of the highest-grossing comedy tour of all time, is not revolutionary and says nothing new about comedy or those who practice it. But it's chock-full of laughs, magnetism, and good, rollicking fun. The concert in \"Original Kings\" was taped at Charlotte, North Carolina's Charlotte Coliseum, and it's a great testament to the often unfairly neglected stand-up art that comedy performers could fill such a prodigious space. The MC of the evening, who holds forth from an elaborately decorated stage set, is the WB's Steve Harvey, who has a wonderfully exasperated stage persona and a voice full of gusto as he sounds off about the stupidity of Rae Carruth, the idiosyncracies of black church elders, and the asininity of the band on the Titanic playing as the ship went down. He's got a rip-roaring sense of energy that gets the show started on a good note. D.L. Hughley's set is perhaps the lowlight of the film. His delivery is not as punchy as that of the other performers, and unlike Harvey, he seems to use profanity as a crutch rather than as a proper comedy tool. Still, his performance has its moments, and he's likable enough that his onstage time doesn't get too dull. Fortunately, things pick up when Cedric the Entertainer, a big, cuddly bear of a guy in a chocolate brown fedora, takes the stage. His set is the highlight of the film, full of sharp commentary about Tiger Woods, blacks on the space shuttle, and the particulars of a \"ghetto wedding\". He fills the stage with his expansive body language, and his silly dance interludes are among the best moments in the picture. Someone should give this guy his own TV show, and fast. Closing things out is Bernie Mac, an abrasive, raspy-voiced, pop-eyed provocateur whose act is the most down-in-the-dirt of all the performers featured. His riffs on the virtues of beating children, the problem of living with a gay six-year-old nephew, and the importance of a certain twelve-letter-word to the black vocabulary, are sometimes more hostile than funny, but his gritty delivery and fast pace socks the best jokes home nicely. Besides, the audience in the theatre where I saw the film gave him applause at the end of his set, the only performer onscreen they did that for, so who am I to argue? Lee's direction sometimes gets in the way of the performers, with showy camera moves that distract from the words. The film is at its best when Lee's cameraman, Malik Sayeed, just plops his camera down and lets the comics do their stuff. There are some nice reaction shots of the crowd, who are clearly having a great time, and the way that the laughter of the onscreen audience blends with that of the people in the theatre really makes you feel like you're part of the show. \"The Original Kings of Comedy\" is not as great as earlier stand-up films like \"Bill Cosby Himself\" or \"Eddie Murphy Raw\", films that fell together more cohesively than this one does. Still, if you're looking for some Friday night laughs, you would be well advised to head to the theatre and hail to the Kings.",
         "2 hours of incredible comedy from 4 incredible comedians. Easily the best comedy showcase since Eddie Murphy \"Raw\", possibly since Bill Cosby's \"Himself\". If you have never seen these stars perform their stand-up before, you are really missing out. The only problem with this \"film\" is the \"filming\" itself. I use quotes because this movie was recorded entirely with digital cameras, which, at times, look like your mom's video tape of your 8th grade school play. I don't understand how Spike Lee can even credit himself in this movie. It doesn't take a genius to put a camera on the front of the stage and periodically pan to the crowd. (-Groundbreaking work, Spike! ) In conclusion, this is the best comedy film I've seen in years even if it does look like 1985 CBS file footage of an NBA game.",
         "Bought the DVD from store, sat myself down and grabbed a bag o' popcorn. Watched it and felt great. It was damn funny yet reasonably censored. I recommend it to anyone who has even a little sense of humor. Although i think that it was poorly edited. Some scenes could have been better. There was a lot static on my DVD but i guess the fault could also be in my player. I also would not recommend it to people who have weak spots in racist jokes. Every second joke was about white people and i as a 'gringo' don't like that. Besides i also would like to mention that this is a one-time-looking piece of work. Anyway i recommend it if you want to have a little laugh after work.",
         "This was a great stand-up movie, and it's wonderful that stand-up is coming back in this form. I have been exposed to stand-up ever since I was a little kid, and I have seen the evolution of stand go from 90 min concert movies like this one, down to 1 hour specials, and even down to 30 min specials as well. And The Kings bring back a variety show for us in the movie format, and the result is a masterpiece. For those of you who only saw racism in the jokes, then you really weren't paying attention to what was being said, and knowing the attention span of the average American, that's not hard to believe. Did anyone notice that the WHITE people in the audience were laughing just as hard as the black? I think that it's because most of us white folks can take a joke, and understand that the comic is really playing around, without doing a \"my god, that's a racist remark\" defense that many people here seem to be doing. What these men were doing with comparing black and white is NO DIFFERENT than when Jeff Foxworthy compares and contrasts rednecks and sophisticated people. Now, the fact that the comics were using stereotypes...hmmm. How do I say this? Folks, I have collected comedians for years, and my collection spans from CD's, DVD and VHS tapes. I have comedians that few people have heard of. My collection spans over both genders, different nationalities and ethnic groups, and I must say that every comedian needs to joke about something that the audience can and will understand, and stereotypes are the key thing to do just that, because everyone understands stereotypes. And besides, some comedians will even take a common stereotype and make it their act...Tim Allen used the stereotype of the man's man; Roseanne Barr used the disgruntled housewife, and Jeff Foxworthy used the redneck angle. Now, a comedian can go without stereotypes, but he/she runs the risk of losing the audience. And besides, it's not the stereotype that makes the joke, it's the exaggeration behind the joke. And as far as the comedians in the movie here, they really strive for a good show. Steve Harvey did great jokes, and even did things, that while not really funny, were great entertainment, like when he was playing samples of different songs for the audience. Hughley was funny as well, especially when he was interacting with the audience. The other two comics I have never sen before, but I have no complaints, as they round out the show nicely. Each comic owned the stage when they were on it, and they would be hard to top. And folks, I like Chris Rock, but he wasn't as funny as these guys are, simply because he tries waaay too hard, and these guys are just here having fun. A great performance by some great comics, and I would recommend this to anyone. A+++++",
         "I just got home from this flick and I loved it. Not so much a movie, but a filmed appearance of the four comedians (Steve Harvey, D. L. Hughley, Cedric the Entertainer, and Bernie Mac) at a show in North Carolina. It has been my experience that \"concert-comedy\"-type movies can often be boring, certainly not matching the experience of actually seeing a comedian live. This was not the case with \"Kings.\" Granted I was in a crowded theatre, but the expert direction by Spike Lee really pulls you in and makes you a part of the studio audience. Audience reaction shots and multiple-camera angles keep the viewing fresh and \"behind the scenes\" peeks all offer more than simply being there live would have. As far as laugh volume, this was the funniest movie I've ever seen. It has everything: swearing, raunchy sex jokes, clever comparisons between blacks and whites, pop culture jabs, and even some \"insult comedy.\" Each comedian does about a half-hour of material, but you'll wish they each got an hour at least. The soundtrack is excellent as well. Well, it's not technically a soundtrack, but the songs played in the stadium at the show were a great mix of old-school love songs and funk. \"The Original Kings of Comedy\" is not a movie. It is a concert-comedy piece with elements of a documentary. After a lack-luster summer of gross-out comedy flicks, it was very nice to see genuinely talented and witty word-slingers come together with a consistently pleasing director in certainly the funniest movie of the summer. Maybe ever.",
         "Some of this is very funny. And these people are genuine. But the sanctimonious Spike Lee will be embarrassed in a generation or two as this humor is considered today's Amos and Andy. Doesn't matter that it comes from blacks. Doesn't matter if everyone thinks it is funny now. Plus. No element of American culture is natural today, and this is especially so with Black culture. It is now in the hands of record, fashion and media companies. Spike may insist he is a free man, but he is not, and now complicit in another big company's inventing of a culture.",
         "Stand up comedy on the big screen. A smart move on Spike Lee 's part. The bad part was him picking the wrong distributor. ORIGINAL KINGS OF COMEDY might have picked up first place on its opening weekend if it was given more screens to be shown on. But the overall box office was not as big a legend as THE BLAIR WITCH PROJECT. Therefore we would never know, let alone care. ORIGINAL does have its moments. The concert, KINGS OF COMEDY is filmed and documented by Spike Lee, shot on February 26-27 in Charlotte, North Carolina. Four leading comics are featured. More shots of the preparation of the show and more behind the scenes moments would have been made ORIGINAL more interesting. More moments with the audience such as Boogie would have been just as fun. Every comic has their ups and downs. A completely mediocre effort on a genre that has more potential."
      ],
      "genres": [
         "Comedy",
         "Documentary"
      ],
      "productionCompanies": [
         "40 Acres & A Mule Filmworks",
         "Latham Entertainment",
         "MTV Films"
      ],
      "summaries": [
         "February 26 and 27, 2000, the Original Kings of Comedy play Charlotte, NC. The themes are Blacks and Whites, men and women, old-school and hip-hop. Steve Harvey emcees, celebrates '70s music and lyrics of love, and pokes at folks in the front row. D.L. Hughley mines racial differences and talks about his marriage. Cedric the Entertainer riffs on a Black president and on being grown up. Bernie Mac, who says he expresses what's in the back of our minds, closes with reflections on being 42 (new aspects to his sex life and his attitude toward children). Spike Lee's camera takes us backstage and off-stage with the Kings and into the crowd where everyone's laughing.",
         "A concert film featuring four major African American stand up comedians."
      ],
      "budget": 3000000
   },
   "movielensId": 3865,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-18",
      "dvdReleaseDate": "2001-02-27",
      "directors": ["Spike Lee"],
      "runtime": 115,
      "movieId": 3865,
      "title": "The Original Kings of Comedy",
      "mpaa": "R",
      "actors": [
         "Steve Harvey",
         "D. L. Hughley",
         "Cedric the Entertainer",
         "Bernie Mac"
      ],
      "imdbMovieId": "0236388",
      "originalTitle": "The Original Kings of Comedy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "The Original Kings of Comedy achieves the seemingly impossible task of capturing the rollicking and sly comedy routines of stand-up and sitcom vets Steve Harvey, D.L. Hughley, Cedric the Entertainer, and Bernie Mac and the magic of experiencing a live concert show. Director Spike Lee and his crew plant a multitude of cameras in a packed stadium and onstage (as well as backstage, as they follow the comedians) to catch the vivid immediacy of the show, which is as much about the audience as it is about the jokes.",
      "tmdbMovieId": 23618,
      "avgRating": 3.27906,
      "releaseYear": "2000",
      "numRatings": 1041,
      "posterPath": "/3WyU0n7ss8mT4b5YhPI8AfbN7XE.jpg"
   }
}