{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0178050",
      "video": false,
      "title": "Sunset Strip",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Tammy Franklin",
               "gender": 1,
               "credit_id": "52fe4bafc3a36847f820f5c5",
               "name": "Anna Friel",
               "profile_path": "/ccSUerm8OyftugbfsVdrrKKbBrv.jpg",
               "id": 58016,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Zach",
               "gender": 2,
               "credit_id": "52fe4bafc3a36847f820f5c9",
               "name": "Nick Stahl",
               "profile_path": "/3IBXRFxLdpk3PrN6ypdiWZi6xe3.jpg",
               "id": 6408,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Felix",
               "gender": 2,
               "credit_id": "52fe4bafc3a36847f820f5cd",
               "name": "Rory Cochrane",
               "profile_path": "/nSwd3TTKPCgZyuO5DqGAzAXQUnF.jpg",
               "id": 51792,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Marty Shapiro",
               "gender": 2,
               "credit_id": "52fe4bafc3a36847f820f5d1",
               "name": "Adam Goldberg",
               "profile_path": "/utlFTzTDP5VDQYXmzdHBbfloYhb.jpg",
               "id": 6163,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Duncan",
               "gender": 2,
               "credit_id": "570f63d292514143ff000c65",
               "name": "Tommy Flanagan",
               "profile_path": "/eVHvVN05wJSINFlkjxjwOwe6C3L.jpg",
               "id": 2478,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mr. Niederhaus",
               "gender": 2,
               "credit_id": "570f63e092514120e8000148",
               "name": "John Randolph",
               "profile_path": "/r3HirIBplq3hjYYvO7JtyGP4SrF.jpg",
               "id": 18649,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Christine",
               "gender": 1,
               "credit_id": "570f63eb925141016f001838",
               "name": "Stephanie Romanov",
               "profile_path": "/xD0YDW0lT7ww3amHRKeK2db6bs7.jpg",
               "id": 159485,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Glen Walker",
               "gender": 2,
               "credit_id": "570f63f9c3a368538500299b",
               "name": "Jared Leto",
               "profile_path": "/msugySeTCyCmlRWtyB6sMixTQYY.jpg",
               "id": 7499,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Eileen",
               "gender": 1,
               "credit_id": "570f6405c3a36853730025ba",
               "name": "Mary Lynn Rajskub",
               "profile_path": "/icSziituw2XPBKvdgNWcyRyrJMp.jpg",
               "id": 25884,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Nigel",
               "gender": 0,
               "credit_id": "570f6413c3a3684ff1000e3e",
               "name": "Maurice Chasse",
               "profile_path": null,
               "id": 1226235,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Jennifer",
               "gender": 1,
               "credit_id": "57277e08c3a3685871003780",
               "name": "Krista Allen",
               "profile_path": "/aPNoOzxPicfSzPv2Qv7Ccex8WJL.jpg",
               "id": 21858,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Hobbit",
               "gender": 2,
               "credit_id": "570f64f1c3a368503c000ed8",
               "name": "Matthew Frauman",
               "profile_path": "/fKS3hwd9w4ujmdN9DPn01k9dVlN.jpg",
               "id": 1569166,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Joel",
               "gender": 0,
               "credit_id": "570f64fec3a3684ff1000e5b",
               "name": "Justin Ashforth",
               "profile_path": null,
               "id": 20545,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Mary",
               "gender": 0,
               "credit_id": "570f65159251416bff00077c",
               "name": "Justin Ashforth",
               "profile_path": null,
               "id": 20545,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Production Assistant",
               "gender": 0,
               "credit_id": "570f6520c3a3684ff1000e68",
               "name": "Brian Gattas",
               "profile_path": "/68tcSMPHWayV4KWetUFIquEV0pq.jpg",
               "id": 63686,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Younger Waitress",
               "gender": 1,
               "credit_id": "570f652bc3a36853730025e4",
               "name": "Judy Greer",
               "profile_path": "/ooEejsGv4loFIKnbe2arzOwWy6H.jpg",
               "id": 20750,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "577899979251411cd4001a42",
               "name": "Randall Jahnson",
               "profile_path": "/ijL3uaKskVMZipUUtRzKiZhCfpW.jpg",
               "id": 57377,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "577899c4c3a3683366000512",
               "name": "Russell DeGrazier",
               "profile_path": null,
               "id": 544158,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bafc3a36847f820f5bb",
               "name": "Adam Collis",
               "profile_path": null,
               "id": 1065346,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57789983925141566f000559",
               "name": "Randall Jahnson",
               "profile_path": "/ijL3uaKskVMZipUUtRzKiZhCfpW.jpg",
               "id": 57377,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [],
      "popularity": 1.210255,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 117262,
      "vote_count": 2,
      "budget": 0,
      "overview": "A day in Hollywood, 1972, with young people looking for the 24 hours that will change their lives. Zach will open that night for a British rocker at Whisky a Go-Go; he lives in a canyon and plays impromptu duets with a mysterious guitarist he doesn't see. Tammy is a costume designer, open to quick sex with the various rockers she works with and loved from afar by Michael, a photographer recovering from a case of the clap. His good friend is Felix, a morose, alcoholic songwriter. On hand for comic relief is Marty Shapiro, a fast-talking record producer. Getting ready for the gig at the club, Zach's performance, and the early-morning aftermath comprise the film.",
      "similar": [],
      "original_title": "Sunset Strip",
      "runtime": 90,
      "poster_path": "/ncThyoxoMl9XEoFgwJnJqburkfT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         },
         {
            "logo_path": "/A32wmjrs9Psf4zw0uaixF0GXfxq.png",
            "name": "The Linson Company",
            "id": 4700,
            "origin_country": ""
         }
      ],
      "release_date": "2000-08-18",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "The ultimate address for a dream",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Adam Collis"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Randall Jahnson",
         "Randall Jahnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0178050/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjUxMjUxNjU3NF5BMl5BanBnXkFtZTcwOTQ3NDA0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Simon Baker, Anna Friel, Nick Stahl | See full cast and crew »"],
      "reviews": [
         "What do you want in a movie? If it's verisimilitude, you must have subjective overview for the context, or else it's just another period piece as distant and impersonal as The Napoleonic Wars. If it's a character study, you must accept this as the basis of the filmed entertainment. \"Sunset Strip\" should be viewed as a character study companion piece to \"Almost Famous\" with far more accurate verisimilitude. \"Famous\" is a wondrous pastiche, lotsa entertaining bang for your buck. But \"Sunset Strip\" represents the real s**t. I know. I was there. And here's why you should take my anonymous word for it. When I first saw this movie I was astonished that I didn't recognize the name of its writer, for I recognized every one of his characters, literally as well as figuratively. The writer obviously was exactly the same age I was, worked in the exact aspects of the entertainment industry that I did, at the exact same time in the early 70's at the exact same spots in Hollywood and knew the exact same people I did (or knew of.) Anna Friel was Genie the Tailor, who did in fact die in an auto accident with several members of British band Fairport Convention. The geeky manager was seemingly an early Geffen clone. The disolute songwriter was a Warren Zevon-alike, while Jared Leto was, dare I say, a completely interchangeable popstar type of the era. My own future husband, popstar of that era, lived in the exact same Laurel Canyon mountain aerie depicted in the film (replete with benevolent landlord), while I worked as a music photographer amongst the main protagonist's doppelganger. And I did know who he was. He was one of the names you'll recognize on photo credits of the era, who owns a major restaurant here. But he didn't want his name on the writing credits, so I'll respect that. \"Sunset Strip\" is a highly entertaining character study that is unbelievably accurate in its depiction of an assortment of characters on the perimeter, or the earliest stages of ascent, of the music scene in Los Angeles in the early 1970's. It's all true. And we did go out there every night. . .",
         "Well last night I watched Sunset Strip on Canal +, the movie channel, pretty much just to see Tommy Flanagan (Duncan Reed in this movie, Cicero in Gladiator, and Morrison in Braveheart...very different roles). Before that, though, I read some reviews about the movie, and none were very flattering. After seeing it, though, I can't really understand why, for I quite liked it. I mean it certainly wasn't as bad as the critics were making it out to be. There are several different plot lines going on at once, all during a single day on Sunset Strip, and they're all connected to each other by at least one person. It would be too confusing to explain it all, but I recommend it.",
         "The movie starts off with this prologue: \"In Hollywood in 1972 upon Sunset, man The Strip was packed every night. Not with tourists, but Us, the people in the backrooms trying to make it. We were all out there looking for something because we knew that LA was a goldmine and that your life could change in 24hrs and thats why we came here.\" The movie takes place within a 24hr period, giving insight into the lives of those trying to \"make it\". For such a short period, the viewer gets an awful lot of character development. One of the many things that makes this movie good is how one can relate to the characters, the realism. The soundtrack is also really well done, it totally sets the mood for each moment and has a tendancy to carry the viewer to where they are supposed to be. I found the acting to be believable, and was glad to see some faces I recognized for other movies. I would suggest anyone who is looking for a good movie check this out.",
         "After seeing the film for the first time last night, and then reading some of the negative reviews here, the only logical conclusion I can make is this; if you weren't closely involved in that era, in that place, then you probably won't enjoy the film. But if you did, you will love it. For those who were there, \"Sunset Strip\" is amazingly accurate, and sometimes painfully so. The male-centric attitude women of that time had to endure from so-called \"liberated\" men was summed-up perfectly in the scene where Anna Friel's character is summoned - there's no better word for it - by her rock-star idol, and upon arrival at his hotel room, is asked to serve tea by some pompous jerk. As stated much better than I ever could by \"fastfilmhh\" in her review of this film, it is a deadly-accurate portrayal of the time, places and attitudes back then, warts and all. The only error that I found was when one character made reference to \"bad 'ludes.\" While there was certainly bad coke, and bad weed, Quaaludes were far too inexpensive and easily available for anyone to waste their time knocking off fakes, at least in my experience. But that small mistake was nicely balanced-out by the stage-whispered comment made during a party scene by yet another pompous jerk - there were lots of those back then - alerting a new arrival to the \"real party\" going on in a closed-to-the-less-than-super-cool back room. That sort of social status selectivity happened at every party ever held back then, and was called \"cocaine politics\". The producers obviously took great effort to maintain an accurate portrait of the times, from using and recording actual Fender 'Strats, to only showing three-piece bands on the Whisky's stage, which was a hard and fast rule at that club, unless the band was currently uber-hot. Sidenote: If you are interested in securing your grand-children's financial security, find and buy an original Fender Stratocaster like the ones used in the film, plus some strings, and place them in a large safe-deposit box. In a hundred years or so, those puppies will be worth their weight in Stradivarius violins. Some reviews have mentioned the lack of character development in \"Sunset Strip\", and that is accurate, especially when compared to other film portraying that period, such as \"Almost Famous.\" While I won't pretend to read the writer's and director's minds, I will say that, considering the accuracy of the rest of the production, it could be that they deliberately left the characters shallow because let's face it, ... they (we) all were shallow back then. You needed those high boots to wade through the wall-to-wall pretense. The only difference between the suits and the freaks was that the freaks were freaks on purpose. And just a bit more honest. Sometimes. Anyway, if you want to watch a living textbook of that place at that time, \"Sunset Strip\" hits the nail on the head. Just don't say it's far-out and groovy, please, or you won't be invited to the real party.",
         "In the late 90's and early 00's there was a rash of terrifically lively and affectionate rock films centering on a specific aspect of 70's rock'n'roll: Among these pictures are the wonderfully raucous teen romp \"Detroit Rock City,\" the marvelous glam rock epic \"Velvet Goldmine,\" Cameron Crowe's sweetly autobiographical \"Almost Famous,\" and this undeservedly overlooked low-key winner about six young hopefuls in lowdown funky, free'n'easy, anything-goes carefree hedonistic 70's Los Angeles who are desperately trying to make it in the music business on the glitzy Sunset Strip, the much-fabled boulevard of starry-eyed dreams and glittery glamour. In a highly busy and eventful single day the lives of cocky, strutting, long-haired singer Jared Leto, scrawny, scruffy, wide-eyed guitarist Nick Stahl, obnoxious coke-snorting hipster Adam Goldberg, moody songwriter Rory Cochrane, eager struggling costume designer Anna Friel, and mellow photographer Simon Baker are radically changed forever as they meet with either hard-earned success or dismal crashing failure during the course of a crucially important 24 hour period. Adam Collis' assured, observant, naturalistic no-frills direction relates the hoppin' narrative at a deliberately gradual pace, offering a totally convincing, lovingly detailed, and admirably unromanticized recreation of an especially raw and exciting era. Better still, the seedier aspects of the backstage rock world -- drugs, groupies, venereal diseases and so on -- are depicted with a certain fierce honesty and engaging matter-of-factness. The precisely written script by Randall Jahnson and Russell DeGrazier keeps the plot on track from start to finish, never letting the colorful series of episodic vignettes degenerate into a rambling and unfocused mess. The top-rate soundtrack of choice vintage tunes galvanizes the proceedings with tremendous crackling verve while the gaudy fashions and embarrassing hairstyles perfectly peg the gloriously tacky and outrageous excesses of the notoriously loose and libertine Me Decade. Kudos also to Ron Fortunato's handsome, sparkling cinematography and Stewart Copeland's right-on groovy score. And the fresh cast of immensely attractive and appealing young thespians all give excellent performances: Friel in particular invests her role with an irresistibly perky aplomb and Leto (Ellen Burstyn's useless ineffectual junkie son in the gut-wrenching \"Requiem for A Dream\") projects an arrogant swagger that's completely smack dead on target. Veteran character actor John Randolph has a lovely part as a crusty, but kindly elderly landlord. An unjustly neglected sleeper that's eminently worthy of rediscovery and subsequent possible cult status.",
         "I'm not very interested in whether this film correctly portrays life as it actually was or is among the LA hopefuls or in whether the clothes or music are authentic. These issues seem to me to be superficial. As a story it is very, very good and is superbly acted by all the main characters. It is quirky in an interesting way. Anna Friel turns in a great performance as do several of the others. It should have had a wider release - I would give it a much higher rating than many of the banal films which become \"hits\" these days.",
         "This is a fun, quirky, magnetic little movie about trying to make it in the 1970's rock scene amidst L.A.'s famed Sunset Strip District. It stays away from some of the heavier issues going on in the 70's, but I found that the trip it does bring us on is unique enough and real enough to play as good film making. Nick Stahl is believable in the rock n roll wannabe roll, and Leto is scene stealing as the STAR. Although it doesn't have the heart of an Almost Famous or the dirt of a Boogie Nights, it meets both films halfway and entertains.",
         "I really enjoyed this movie. It starts of with a musician waking up and taking a piece of paper off some tin foil and then trips into the opening credits. It offers a photographers perspective of the music scene as he works along side his costume designer. They try to keep the musicians egos at bay, and get there work done no matter the consequences. There is also a very trippy wardrobe scene that almost demands applause once completed.",
         "Done in the style of Crash and Boogie Nights, Sunset Strip falls far short of those two recent classics. It's main problem is lack of a coherent story, but even more than that it lacks for the most part characters you could really care about. Mainly because these two were an exception to some of the self indulgent rockstars and wannabes, Sunset Strip was best when it focused on the relationship of Nick Stahl and John Randolph. The eager young kid from the sticks and the oldtimer who once played in the orchestra that scored Gone With The Wind had a real nice poignant resonance to it. The other people there, I never really cared about, there comings and goings and how they all interconnected with one another over a course of 24 hours during a summer day of 1972. I'd see the film for those Stahl and Randolph and go for a pop and popcorn break during the rest.",
         "Although there are a couple interesting characters and good production value, the story is lousy. I stuck around for Nick Stahl's storyline, which was interesting but ultimately frustrating. Rory Cochrane's character was interesting as well, although only about 10 minutes of the movie is devoted to it. The writer couldn't make 90 minutes of movie out of these more interesting characters, so he chose the expedient love-story route. The music is actually pretty good. The acting is good from what I can tell, although lousy story makes the performances a moot point. Adam Goldberg's character is annoying, and basically a reprise or a conglomeration of his other urban/disco Jewish caricatures. The bottom line is if you are interested in music or the entertainment business and have low expectations and 90 minutes to kill, then there are worse ways to spend your time than by watching Sunset Strip."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Fox 2000 Pictures",
         "Art Linson Productions",
         "Linson Films"
      ],
      "summaries": [
         "A day in Hollywood, 1972, with young people looking for the 24 hours that will change their lives. Zach will open that night for a British rocker at Whisky a Go-Go; he lives in a canyon and plays impromptu duets with a mysterious guitarist he doesn't see. Tammy is a costume designer, open to quick sex with the various rockers she works with and loved from afar by Michael, a photographer recovering from a case of the clap. His good friend is Felix, a morose, alcoholic songwriter. On hand for comic relief is Marty Shapiro, a fast-talking record producer. Getting ready for the gig at the club, Zach's performance, and the early-morning aftermath comprise the film.",
         "A comedy that takes place during 24 hours on Sunset Strip in 1972."
      ],
      "budget": 0
   },
   "movielensId": 3866,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-18",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Adam Collis"],
      "runtime": 90,
      "movieId": 3866,
      "title": "Sunset Strip",
      "mpaa": "R",
      "actors": [
         "Anna Friel",
         "Nick Stahl",
         "Rory Cochrane",
         "Adam Goldberg",
         "Tommy Flanagan",
         "John Randolph",
         "Stephanie Romanov",
         "Jared Leto",
         "Mary Lynn Rajskub",
         "Maurice Chasse",
         "Krista Allen",
         "Matthew Frauman",
         "Justin Ashforth",
         "Justin Ashforth",
         "Brian Gattas",
         "Judy Greer"
      ],
      "imdbMovieId": "0178050",
      "originalTitle": "Sunset Strip",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A day in Hollywood, 1972, with young people looking for the 24 hours that will change their lives. Zach will open that night for a British rocker at Whisky a Go-Go; he lives in a canyon and plays impromptu duets with a mysterious guitarist he doesn't see. Tammy is a costume designer, open to quick sex with the various rockers she works with and loved from afar by Michael, a photographer recovering from a case of the clap. His good friend is Felix, a morose, alcoholic songwriter. On hand for comic relief is Marty Shapiro, a fast-talking record producer. Getting ready for the gig at the club, Zach's performance, and the early-morning aftermath comprise the film.",
      "tmdbMovieId": 117262,
      "avgRating": 2.75,
      "releaseYear": "2000",
      "numRatings": 36,
      "posterPath": "/ncThyoxoMl9XEoFgwJnJqburkfT.jpg"
   }
}