{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0176426",
      "video": false,
      "title": "All the Rage",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Helen",
               "gender": 1,
               "credit_id": "52fe444e9251416c9100bff9",
               "name": "Joan Allen",
               "profile_path": "/Atg0mSjK9Dl98YBsFvBuGO8PG5m.jpg",
               "id": 11148,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Warren Harding",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100bffd",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tyler",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c001",
               "name": "Robert Forster",
               "profile_path": "/3ulaOBmEqmGQ8ywo8wHAqGJ2odX.jpg",
               "id": 5694,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c005",
               "name": "Andre Braugher",
               "profile_path": "/9VtD8RlQ0urgDKS7B8tR456dW50.jpg",
               "id": 6861,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Agee",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c009",
               "name": "Bokeem Woodbine",
               "profile_path": "/OewCN9cV4xwvMwPwBw05kqKy2v.jpg",
               "id": 71913,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Annabel Lee",
               "gender": 1,
               "credit_id": "52fe444e9251416c9100c00d",
               "name": "Anna Paquin",
               "profile_path": "/5Q4vZK2PqHkreQLmbPspIgrSLUP.jpg",
               "id": 10690,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Clerk",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c011",
               "name": "Wayne Morse",
               "profile_path": "/sAC84iyxhqyoHv72PF04c9OpAl6.jpg",
               "id": 139929,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Chris",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c015",
               "name": "David Schwimmer",
               "profile_path": "/aOW62VZJMGXjiPvwP43xCHS9X4r.jpg",
               "id": 14409,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Tennel",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c019",
               "name": "Josh Brolin",
               "profile_path": "/x8KKnvHyPvH16M6waAnY1OeCtA8.jpg",
               "id": 16851,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Morgan",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c01d",
               "name": "Gary Sinise",
               "profile_path": "/n5AbjoNfONICaggp2f1QhYAjAoZ.jpg",
               "id": 33,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Janice Taylor",
               "gender": 1,
               "credit_id": "52fe444e9251416c9100c021",
               "name": "January Jones",
               "profile_path": "/tzbVCQwFZ9XGhjYZNs4rw37OAyw.jpg",
               "id": 31717,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Secretary",
               "gender": 1,
               "credit_id": "52fe444e9251416c9100c025",
               "name": "Deborah Offner",
               "profile_path": "/ywOLdDO1sXMc5ygatNxeHgg4SQo.jpg",
               "id": 11872,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c02f",
               "name": "Giovanni Ribisi",
               "profile_path": "/jvq2pimmpNdQj8o75Au9RKC7E1z.jpg",
               "id": 1771,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c02b",
               "name": "James D. Stern",
               "profile_path": null,
               "id": 52159,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55d5e17892514102c80045b6",
               "name": "Keith Reddin",
               "profile_path": null,
               "id": 181299,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.835501,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30946,
      "vote_count": 5,
      "budget": 0,
      "overview": "A rich cross-section of urban USA find their lives changed when their fates collide at gunpoint.",
      "similar": [],
      "original_title": "All the Rage",
      "runtime": 99,
      "poster_path": "/qHC8eAykueUlIw0EfOAx63DzykA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Screenland Pictures",
            "id": 23587,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mutual Films International",
            "id": 61335,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Newmarket Capital Group",
            "id": 506,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Scanbox Entertainment",
            "id": 17559,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-11",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James D. Stern"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Keith Reddin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0176426/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxMzY1MTc1NV5BMl5BanBnXkFtZTcwOTY2OTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Joan Allen, Jeff Daniels, Robert Forster | See full cast and crew »"],
      "reviews": [
         "\"It's the Rage\" is actually the title of this movie, which I saw the other night on cable, and it's an odd duck of a film, starting out with Jeff Daniels' character shooting a man in his living room. He explains to his horrified wife (Joan Allen) that the man was a burglar, but she discovers, with even more horror, that it's actually her husband's business partner. What the @#^k??! Then, some other characters are introduced, each one crazier than the other (played by Gary Sinese, Robert Forster, Anna Paquin, Giovanni Ribisi, all great). Then, the characters start interacting, in extremely clever, well-written ways. The one thing that unites these loonies is that they're all on the edge and they all have guns. (Is that two things?) Consider the possibilities. Or better yet, see the film.",
         "In a film all about guns, it doesn't take long before some blood is spilled. Part social commentary, part dark comedy, \"All The Rage\" finds its place just behind making a strong point about gun ownership and their use by the general American public. Making its world premiere at the 1999 Toronto Film Festival, this film touches upon issues like irreverence and obsession but doesn't dwell on the morality, inherent danger and potential for misuse. Being a Canadian, I feel extremely fortunate to live in a country that is not infested with firearms and hope that will never change. The prevalent, ingrained element of guns in American society always exists as a threat to us, the Northern neighbours who live in awe of the lifestyles and death counts. We all fear that one day we may find ourselves in the same boat. If nothing else divides us, I hope at least that this will never change. The cast features many established, well known and popular actors, some in drastic departures from what we're accustomed to seeing them in, and some not so much. Everyone seems to be putting forth the effort that would make any director proud, but somehow this directorial debut is lacking something. The setting of the film feels almost like a cartoon comic strip with characters who behave in strange and often irrational ways. I feel this lack of a realistic backdrop takes away from the film's potential to deliver a strong message or generate much of an emotional response from the audience. Few of the film's realistic character portrayals lend enough to give the film's overall sense that of a serious one. Therefore, it's hard to take this film seriously. It wasn't terribly funny either. I hate to say it, but some of the most enjoyable elements of this film for me were the music selections, including a great opening song from Talking Head David Byrne. During the film festival, I tend to be more generous than usual, but I can't say this film won me over.",
         "this film is different as a score of people discover things about themselves and others that they didn't know and how to use a gun. at first i must admit it was a slow flick, but i like these movies where the point of view changes from one character to another with their own little side stories, only to find that they are all really connected. this is a fun movie that deals with the reality of guns in the united states and how harmful they can be in the wrong hands. a terrific message put to use in a very strange story...i give it two thumbs up in the origionality department and another two thumbs up for anna paquin, who goes from the silent and scared ROGUE in the X-MEN movie, to a trashy whore who just happens to be underage and loving it.",
         "To be taken seriously only as political satire. Quite humorous and edgy, with a sharp script, but spotty continuity in the narrative. Almost more a cartoon than a good story. None of the characters are believable, which is OK, as they seem to be distillations of types. All of the men in this film are horrible--I wouldn't want a friend or a relative among them. Women are treated as victims, more or less, what spare representation there is of women, though both Joan Allen and Anna Paquin are wonderful in these highly stylized roles. Jeff Daniels's performance, as are those of most of the other men, are masterpieces of underacting. Gary Sinise and Giovanni Ribisi are given grand opportunities to chew up the scenery, which one may have every expectation either will do, literally, at any moment. It seems to me this is also less about guns than it is about how guns are a horrible and all too real manifestation of those things--far more terrible and dark--that may have become by now an inalterable part of the American (that is, the U.S. American) character. Some other themes, besides casual (and not so casual) violence--twisted attitudes toward sexuality, the vagaries of the over-hot infotech culture, and our inability to perceive our own psychological deficiencies--are not well integrated.",
         "A well-crafted, rhythmic story knitting together a dozen lives (some well-explored, some not-enough) with handguns as the common thread. Like Short Cuts or Magnolia, the story builds not though a single protagonist/antagonist pair, but through a mosaic of different people. The ensemble cast (especially Joan Allen, Andre Braugher, Gary Sinise, Jeff Daniels and Anna Paquin)is wonderful and except for Allen, all play parts that seem well outside their usual range. Braugher and Daniels especially play parts different from what they've done before and both are convincing. Only an accomplished stage actor like Sinise could have fully developed \"Morgan\", a character that could too easily have become a charicature; he probably deserved some award nominations for supporting actor for this, and it makes it more poignant seeing him in the mindless commercial pap that dominates his career. The core theme is how guns, and owning them, affect different personalities. Some changes are the same in all the new gun owners; most are different. While it's clearly an anti-handgun film, I don't find that offensive; it's clear the writer knew actual urban people who obtained handguns and the way urban handgun toters change, sometimes subtlely, sometimes significantly. If you're a member of The Second Amendment Foundation or a survivalist whacko, you won't appreciate the film, but any of the 94% of the population that isn't will relish the tart commentary. Editing and cinematography are both crisp and add a lot to the story. This is a very, very good movie in every respect. I recommend it strongly.",
         "Excellent acting, sly intertwining of modern characters, and escalating suspense make this movie intriguing and very watchable, despite the sophomoric and \"in-your-face\" anti-gun agenda that is as subtle as a lead balloon.",
         "I must say that those who scrutinized this film for material for or against gun control are, to my mind, off target. Raw, bloody action? Not so. This is a comedy and there are more tongues-in-cheek than gratuitous bodies falling about. The blood imagery could fill a thimble. Consider: Jeff Daniels, amiable idot or straight guy of so many films is the meanest character this film has to offer. He is so cold and sociopathic that it steps into the wonderland of some deranged looking glass. The gal who causes much of the trouble is a kleptomaniac, amateur whore, and manipulator of a truly deranged brother (Giovani Ribisi in an hilarious portrayal of a pyschopathic burnout avenging angel brother with delusions of murder. Robert Forster, of course, is the wonderfully laconic, genuine cop in the piece, who only dreams of retirement and a safari to Africa. Well, through a series of hilarious coincidences and plot intersections, where the various characters meet and exchange inadvertent plot material--it is a small and cruel world indeed--the whole thing sort of comes together at a standoff. Well, modesty and spoiler precautions prevent further details. But this film does work in story and tone--it's funny, guys! Don't give it a miss because somebody told you there's a lot of gun play. A seven from jaime.",
         "Tonight, a few hours ago, I found myself trapped in a dilemma. It wasn't anything very big, it was just about what movie was I going to watch on Sunday evening. Every month I write down all the movies that I'm interested in and that I could watch in TV, and I try to see them. It's a good thing to do. The deal is, that I had \"Black Hawk Down\" planned for Sunday 13, and I was going to watch it. But yesterday I was watching some fascinating parts of \"Living in Oblivion\" (I have to watch the whole film) and I heard about \"It's the rage\" (TV title), which is \"All the Rage\", right? So I wrote it down and immediately realized that the movie was starting just when \"Black Hawk Down\" was. So the dilemma arrived when I had to choose which movie to watch. I thought quickly. I had \"Black Hawk Down\", an awarded film, directed by Riddley Scott, the man behind the masterpiece that is \"Gladiator\". I had the cast, with Josh Harnett (one point less), Eric Bana (don't like him), war movie (not my favorite type at all, and I think they just keep repeating the story since the first of its type). I didn't mention Ewan McGregor because he's a good actor in my opinion. Well, then there was this film, \"All the Rage\", directed by a James D. Stern (don't know him), who, however, managed to get an incredible cast. Better Gary Sinise and Jeff Daniels than Josh Harnett and Eric Bana; a lot better. And there was also Joan Allen, Anna Paquin, Giovanni Ribisi, David Schwimmer; all of them and some more in alphabetical order. Although I must say it wasn't only the cast, but the trailer too, and its title, the elements that made this film interesting enough. And there I was some hours ago, sitting in front of the TV, and watching \"It's the Rage\", or \"All the rage\" (it doesn't matter). So I met all these people, talking about guns and committing murders, so when I had seen one hour of the movie I was thinking: \"Everyone's gonna die\". Interesting the movie was, indeed. Interesting for me was to watch Gary Sinise in an astonishing performance (see it for yourselves), playing an eccentric millionaire tired of the world outside and hidden in his \"inside\" world. Sinise has the best performance in the movie, and also the best lines. Jeff Daniels is very good (but with the same face and expression he has decided to keep a long time ago) as an obsessed husband. Anna Paquin spreads talent as a young slut, taking advantage of everybody because her brother has a gun. She's religious, his brother believes. He's a punk, crazy about security and life and death played by Giovanni Ribisi. David Schwimmer seems different in his gay role, in his trance. I must also say Andre Braugher and Josh Brolin almost steal the movie with their roles. Robert Forster wanders unnoticed in an important role. And Joan Allen is just alright as a lost person, dealing with important things at the end of her life. Am I repeating too many words here? I could be, because these are the words that make the movie and everything goes on around them. Life? Death? What are these things? Just the beginning and the end of our existence, I like to think. This film doesn't really \"deal\" with these things, but they are constantly present in it. \"Trance\" is also a word to talk about. Everything seems to be in a profound trance. There's not much music, shots are silent, the environment is strange, the camera never seems to stop, always approaching the characters until it probably hits their eyes. It all seems to be going down, like...Life probably? The end of life, better known as death? I can't even tell if this society exists; everybody's talking about guns, everybody (I say again) is in a trance, everybody walks the streets and meets. The characters in the movie eventually meet, in strange occasions, in different parts of this city. It reminded me a little bit of \"Sábado\" (\"Saturday\"), an Argentinean film I love in which different people have encounters in the city. It's wonderful. But \"All the Rage\", or \"It's the rage\" it's not wonderful at all. It says too much but does almost nothing. It tries to be thought-provoking but it ends being a mess. I have to finish writing this, but there are many things you could discuss about this movie. It has an element, something that makes you think why it ended being the movie it is. I don't have much time now (although more time than the characters in the film). If you want to see Gary Sinise shining, watch this movie; it's the least I can say. However, these amazing actors, for some reason chose to be in this film. Was it the rage, maybe? Was it all the rage? About the dilemma, I solved it, yes. I'll catch \"Black Hawk Down\" another day.",
         "With a better screenplay, 'It's the Rage' might have made an interesting study of gunplay and how it's twists lives around. It reminds me of John Badham's 'The Gun' which follows and elusive gun from one owner to another and to a lesser extent 'Twenty Bucks' a fun comedy, which follows a twenty dollar bill through several hands. The movie opens in a suburban house where a jealous husband (Jeff Daniels) shoots his wife's lover and claims to have mistaken him for an intruder. He is let off the hook by his lawyer (Brauger), a gay man whose lover (David Schwimmer) is unstable after a hold-up and decides to buy a gun. Meanwhile Daniel's wife has taken a job with a computer genius who has becomes a recluse and who's employee (Josh Brolin) has quit and taken a job at the local video store. One night he timidly flirts with a compulsive shoplifter (a blonde Anna Paquin) that Braugher is having an affair with. She informs her brother about Brolin (spicing up the story of their encounter just a bit) who goes into a blinding rage and determines to kill him. All of this sounds better than it plays. The problem is that the characters all seem at arm's length. Mostly because they are all preoccupied with being angry and selfish or both, except for Brolin who so terminally jolly as to almost be nauseating. The gun message doesn't work either. The movie is bookended by incident involving guns but it's attempts to intersect them with the lives of the characters feels more like a stunt. Most of the characters seem like characters. Almost everyone in the movie looks in need of a shower, a shave, an attitude adjustment or all three. Only two of the characters are well written. I liked Helen played by Joan Allen as Daniel's wife who starts a sweet, rather timid affair with the computer genius and I liked Robert Forster as the detective calmly shadowing Daniels. The movie itself made a more interesting journey off-screen. It premiered on Cinemax before making a brief theatrical run and then landing in the direct-to-video dustbin. It doesn't really deserve any of them. 'It's the Rage' is a dull, lifeless mosaic of mostly boring, lifeless people.",
         "After picking this movie up on a whim, I was very satisfied with the calibre of both the intertwining plots and quality acting. Gary Sinese has redeemed himself in my eyes after his debacle of Mission to Mars. His quirky character is both loveable and pitiful. Giovanni Ribisi is unbelievably good, as always. I was also very very impressed with David Schwimmer's performance. Great, grainy,shakey camera angles add to the turmoil and angst of the film. Excellent music throughout as well."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Mutual Films International",
         "Newmarket Capital Group",
         "Scanbox Entertainment"
      ],
      "summaries": ["Handguns figure in the intertwining lives of nine people. Warren shoots his wife Helen's lover and his defense is that he thought he was shooting an intruder. She leaves him; the lawyer helps her get a job with a nutty, reclusive computer wizard who waves a pistol about, sometimes at Helen. Tennel, the computer geek's ex-assistant, lands a video-store job and is smitten by Annabel Lee, an aggressive street kid who likes complaining about men to her pistol-packing psychotic brother to set him off. In secret, Annabel starts an affair with the lawyer, who has both a pistol and a gay lover, who becomes jealous. He has a pistol too. A cool (and armed) cop stays on Warren's tail."],
      "budget": 0
   },
   "movielensId": 3867,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-11",
      "dvdReleaseDate": "2000-08-15",
      "directors": ["James D. Stern"],
      "runtime": 99,
      "movieId": 3867,
      "title": "All the Rage",
      "mpaa": "R",
      "actors": [
         "Joan Allen",
         "Jeff Daniels",
         "Robert Forster",
         "Andre Braugher",
         "Bokeem Woodbine",
         "Anna Paquin",
         "Wayne Morse",
         "David Schwimmer",
         "Josh Brolin",
         "Gary Sinise",
         "January Jones",
         "Deborah Offner",
         "Giovanni Ribisi"
      ],
      "imdbMovieId": "0176426",
      "originalTitle": "All the Rage",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["npxeAOGwOGI"],
      "plotSummary": "A rich cross-section of urban USA find their lives changed when their fates collide at gunpoint.",
      "tmdbMovieId": 30946,
      "avgRating": 2.70879,
      "releaseYear": "1999",
      "numRatings": 91,
      "posterPath": "/qHC8eAykueUlIw0EfOAx63DzykA.jpg"
   }
}