{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "psychoanalyst",
            "id": 189131
         }
      ],
      "imdb_id": "tt0118018",
      "video": false,
      "title": "A Couch in New York",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Béatrice Saulnier",
               "gender": 1,
               "credit_id": "52fe4733c3a36847f81289a7",
               "name": "Juliette Binoche",
               "profile_path": "/rkW6eE75Tt1i3J1s2fsIDZBW0kd.jpg",
               "id": 1137,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Henry Harriston",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f81289a3",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f81289af",
               "name": "Paul Guilfoyle",
               "profile_path": "/vQRNg8D5jeUHGKeFzMuwFaAFnzZ.jpg",
               "id": 925,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Campton",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f81289ab",
               "name": "Richard Jenkins",
               "profile_path": "/iz61iPIgNUp0yk48bRNjEJ5GHO4.jpg",
               "id": 28633,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Anne",
               "gender": 0,
               "credit_id": "5468b640eaeb816b4f000c1a",
               "name": "Stephanie Buttle",
               "profile_path": null,
               "id": 151138,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Lizbeth Honeywell",
               "gender": 1,
               "credit_id": "5468b65122136e68d5000b7a",
               "name": "Barbara Garrick",
               "profile_path": "/5qWUMLEFG0J6pOPGiZ5YJacnvvu.jpg",
               "id": 12932,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "5aa8cf5ec3a36839e102e6a3",
               "name": "Kent Broadhurst",
               "profile_path": "/5FRRBEO40f1DBJeebGBaTRj8pnT.jpg",
               "id": 20914,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "5aa8cf680e0a263dc102df9d",
               "name": "Matthew Burton",
               "profile_path": null,
               "id": 175300,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "5aa8cf889251415e3c02c981",
               "name": "Henry Bean",
               "profile_path": null,
               "id": 30458,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "5aa8cf9c0e0a263dc4030a79",
               "name": "Adam LeFevre",
               "profile_path": "/y17YQ7F99kpqJuCUYfOoeArAkKz.jpg",
               "id": 61607,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "5aa8cfaac3a36839dd029546",
               "name": "Tiffany Fraser",
               "profile_path": "/Aaz8SvzeTvb2TrTo7EGNxl5QM2q.jpg",
               "id": 1218084,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4733c3a36847f812899f",
               "name": "Chantal Akerman",
               "profile_path": "/AnQ5qy7X33w0QgKpTq5yVOfnBIs.jpg",
               "id": 130030,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5468b62322136e68c9000e70",
               "name": "Chantal Akerman",
               "profile_path": "/AnQ5qy7X33w0QgKpTq5yVOfnBIs.jpg",
               "id": 130030,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5468b62eeaeb816b55000cdc",
               "name": "Jean-Louis Benoît",
               "profile_path": null,
               "id": 263085,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5aa8ced9c3a36839cb02ebdb",
               "name": "Sonia Wieder-Atherton",
               "profile_path": null,
               "id": 1676946,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5aa8cee9c3a36839e102e62d",
               "name": "Dietrich Lohmann",
               "profile_path": null,
               "id": 10616,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5aa8cef5c3a36839cb02ebec",
               "name": "Claire Atherton",
               "profile_path": null,
               "id": 1270678,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.11406,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 47434,
      "vote_count": 9,
      "budget": 0,
      "overview": "Dr. Henry Harriston is a successful psychoanalyst in New York City. When he is near a nervous breakdown, he arranges to change his flat with Beatrice Saulnier from France for a while. Both don't know each other and both find themselves deeply involved into the social settings of the other, because the decision to change their flats is made overnight. Could be the perfect amusement, but suddenly Henry finds himself beaten up by Beatrice' lover and Beatrice is considered to be Dr. Harriston's substitute by his clients...",
      "similar": [
         112160,
         3134,
         49519,
         858,
         93456,
         634,
         693,
         772,
         437557,
         24684,
         258480,
         43923,
         427900,
         9261,
         455,
         9598,
         450438,
         5176,
         97630,
         141
      ],
      "original_title": "Un divan à New York",
      "runtime": 108,
      "poster_path": "/92CVrPyiiXKOGdEldkb0FuVKPrU.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "M6 Films",
            "id": 1115,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Balenciaga",
            "id": 4236,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 15671,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-21",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "A Man... A Woman... A Dog... The perfect combination for romance...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chantal Akerman"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Chantal Akerman",
         "Jean-Louis Benoît"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118018/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1OTkzMzQzNV5BMl5BanBnXkFtZTcwMDkxODcxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Juliette Binoche, William Hurt, Stephanie Buttle | See full cast and crew »"],
      "reviews": [
         "I don't understand why this movie isn't more popular. William Hurt plays wonderfully sensitive and sincere. Juliette Binoche is charming and natural. The story is like a book. And the filmmakers and photographers have caught the moments just right. The lines and words are not pathetic: they are intelligent and honest. I love this film. I have seen it several times and Cole Porters \"Night and day\" suits the film and actors really well. I give this film top score for seeing the special art and beauty of living. Few movies catches the small deatils like this one: In colours, quite comfortable moments, moods, real life-pictures and honest life-image. Thank you very much, filmmakers, actors, storytellers, composers and photographers for reminding us how beautiful life can be.",
         "This film seems to be a litmus test of some kind. The majority of viewers, both prof. critics and laypeople, don't like. But a sizable minority, like me, are ga-ga over it. I find it funnier and more intelligent each time I watch it. I liked it the first, but it has gotten better each of the four times I have watched it since. Juliette Binoche is an absolute revelation as an actress. Watch her facial expressions change instantly as she responds to other people. She is marvelous. There is an incredibly funny dialogue between her and her French friend who lives in US, played by an actress, also very good, whose last name, i believe, is Buttle. Many of the commentators seem to believe that this dialogue shows the two women to be stupid, but I disagree. What the whole film slyly hints at is the stupidity of conventional, sectarian, ideologically driven psychoanalysis. These women, in their innocence of ideology, see thru the veil. As does Beatrice in her role as makeshift therapist. What makes her a wonderful therapist is her RESPONSIVENESS, as indicated above, to what is happening in the moment with each patient as an individual. Unhampered by rigid doctrine, she gives each what they need, not a load of ideology. I would love to see the actual script, but haven't been able to find it.",
         "Beatrice (Juliette Binoche) is a free-spirited Parisian woman with plenty of male admirers. The trouble is, she hasn't really returned anyone's affections. When she feels pressured, she decides to swap apartments with a New Yorker for awhile. Henry (William Hurt) is a shrink who also is a bit tired of putting people's lives in order and he believes a trip to Paris will do him good. However, Beatrice is mistaken for a doctor temporarily replacing Henry and is beset with several patients. She listens, she has fun! And, patients hand her the green stuff. Meanwhile, Henry is less than thrilled with Beatrice's noisy apartment and decides to come back to the NY area early. Ah ha! He finds out in short order that Beatrice has been seeing his patients and he decides to pose as one. Let the games begin. This very French film, told mostly in English, has a sweet charm and a wonderful premise. Binoche graces the film with her loveliness and talent and Hurt gives a likable performance as well. Yes, it is understated and the dialogue seems truncated at times, but the movie has a European flavor that will please those who like it quirky. All other elements, costumes, scenery, and cinematography, are nice, too. If you belong to the group of film enthusiasts which needs a dose of laughs and love every week, find this film in the near future. It is a great movie to watch from a comfortable couch, with or without, a partner.",
         "A Couch in New York is a French/American/Belgium co-production with the innocence and humour of the romantic comedies of the 50's. Juliet Binoche shows the charm of a modern day Audrey Hepburn (with the same beautiful vulnerability portrayed by Hepburn in Funny Face and Breakfast at Tiffany's) while William Hurt plays the strong man role that used to be reserved for the likes of Humphrey Bogart, Fred Astaire or Gregory Peck. Using old tricks of mistaken identity and falling in love with a stranger, the dialogue is somehow saved from sounding corny and instead pays homage to the classic romantic comedies. A two tissue movie.",
         "Dr. Henry Harriston, a psychoanalyst, is so sick of his patients he puts an ad in the Herald-Tribune asking to swap his New York apartment for one in Paris. Beatrice, who answers the ad because her friend Anne lives in New York, seems to get the better part of the deal. Dr. Harriston has a fabulous apartment and Beatrice's building is noisy and falling apart. Then Dr. Harriston's patients start showing up at his place. Also, Dr. Harriston's dog Edgard is lethargic and has intestinal problems. Meanwhile, Beatrice has a number of men after her, mostly borderline insane. Juliette Binoche is pretty and so charming, and she really shows genuine concern for Dr. Harriston's patients--one in particular. Richard Jenkins does something unique and unexpected as one of the patients. And William Hurt eventually does show his talent as well. Most of the leading actors gave good performances. The first half was quite funny, but the second half leaned more toward drama. Though there were funny moments, such as when Dr. Harriston tried to carry on a conversation with his friend Dennis while Dennis was taking an order at a restaurant. The ending was very sweet. Overall, this film was worth seeing.",
         "For the most part, I liked this movie. I liked that french was spoken in France. (So many American movies have the characters, in places other than the United States, speak only english, even when the character is a native of that \"foreign\" country. See the movie \"Chocolate\". This movie starred Juliet Binoche, living in France, yet, she speaks english.) But, at the final quarter the movie lost me. . .A SPOILER IS APPROACHING. ..when, upon her leaving NYC to return to Paris, the dog--who loves her, and whom she loves--tries to meet up with her at the taxi cab. For whatever reason, she says to her friend, who is in the taxi with her, that she has had enough of the dog, and, then she tells the driver to get going. The dog then proceeds to follow her, by running, in NYC traffic, after the taxi. I just thought that was an incredibly uncaring scene: the dog would most definitely be hit by a car. But, voila!, miraculously, the dog meets up with her at the airport (If you don't live in NYC, you should know that the airport, any of the three airports, is miles and miles and miles away from Manhattan!), and he is unharmed. I can suspend disbelief when viewing a movie, but this was definitely too much for me. For her character to have jeopardized the safety of the dog, by so carelessly allowing him to follow her taxi in heavy NYC traffic, is absolutely cruel and ridiculous, and out of character for her: She went to great lengths to get the dog back from the woman who removed him from the apartment. . .another scene,by the way, which made absolutely no sense!. ..by swimming in the filthy water of the pond in Central Park.",
         "In Couch in New York, the first American film by acclaimed Belgian director Chantal Akerman, Dr. Henry Harriston (William Hurt) is a dour New York psychoanalyst who is close to exhaustion. He decides to place an ad in the Paris Herald Tribune offering to swap his New York apartment for a month. Henry ends up in the digs of a free-spirited dancer from Paris, Beatrice Saulnier (Juliet Binoche) and she takes over his swank New York penthouse. Obviously well to do, Henry's apartment is spacious, impeccably furnished, and meticulously cared for, while hers is messy, bohemian, and funky. In what Ms. Akerman describes as \"what Hollywood calls a double fish out of water film\", this film is something of a curiosity yet it's one of the best screwball romantic comedies I've seen. The premise is totally ludicrous of course and off the wall but that's what makes it so special. Of course, I'm particularly open to films that pop the bubble of the psychiatric establishment. Apparently Henry forgets to tell his patients he is going away and they come knocking on Ms. Saulnier's door and calling for appointments, hardly even noticing the change in doctors. Being a sweet and sympathetic soul and not wanting to turn people away, she listens to their stories for an hour and they pay her money for her advice (illegally of course). She learns quickly that all analysts have to say is \"yeees\" or \"hmmmm\" or \"what comes to mind now?\" and get paid big bucks. Of course, patients have the right to remain silent and sometimes nothing comes to mind (they can sometimes spend an hour in total silence and must still pay for the privilege). Ms. Saulnier is an understanding person and a good listener and, in quite a slap at the \"professionals\", achieves more success with Henry's patients (not to mention his dog Edgar) in one week than he apparently has in years. Beatrice decides to continue to pretend to be Dr. Harriston's assistant and studies up on her Freud. Meanwhile in Paris, Henry must contend with Beatrice's aggressive boy friends, messy rooms, leaky plumbing and the hammering of a roof being repaired. Fed up with the problems in Paris, he returns to New York to stay with an old friend in a down home part of Brooklyn. Conveniently for the plot, the good doctor stops off at his office and finds Beatrice playing psychoanalyst and his patients miraculously improved. Finding Ms. Saulnier intriguing and attractive, he goes along with her game, pretending to be her patient. This sets off a process of mutual discovery and self-awareness that is quite predictable but nonetheless amusing and enlightening. This was my first Akerman film and while I realize it is totally unlike her others, I really loved it and found both leads to be superb. Binoche never looked more alluring and Hurt is terrific in his role as the deadpan doctor. I don't know who's crazy, the majority of critics who trashed it or me, but I know for sure one of us is ready for the couch. I won't say any more about Couch in New York except that while it does unfold its magic at a very leisurely pace, the rewards are there for the patient (no pun intended). Since the ending left me with such a warm, fuzzy feeling, I'm thinking of calling Ms. Binoche and.well.on second thought.",
         "In spite of its thin premise about the unexpected effects of an apartment exchange this is a movie of gentle and charming fantasy as the two characters find themselves becoming entangled in each other's lives. Although the plot is predictable from that point on, the execution of it is funny and some of the observations about people are pointedly accurate. Add to that a good use of the New York cityscape and this is a great movie to spend a rainy afternoon (or evening) with.",
         "\"Juliette Binoche cannot act\", according to 'anonnymous' below. That is a ridiculous assertion. As is to link this film with Kieslowski's 'Blue'. The problem with this movie is that neither Binoche nor Hurt are given the material in the form of a good screenplay nor the direction to make the film work. It seems to me that Akerman, who is an excellent director, see La Captive, does not have a good enough command of English to write a screenplay in the language. The film, which starts out nicely quickly gets bogged down in the psychoanalyitical. Endless \"yes\" and \"mmmmm\"s loose their amusement value quickly. The romance angle is badly developed, just why has Beatrice fallen for John Wire aka Henry? It doesnt work. But Juliette Binoche can act. In fact in Europe she is regarded with Isabelle Huppert to be the finest actress working today. But she can only produce the goods when she is given the material and the careful direction necessary. Go rent \"Rendez-Vous\", \"The Unbearable Lightness of Being\", \"Les Amants du Pont-Neuf\", \"Three Colours Blue\", \"Alice & Martin\", \"The Widow of Saint-Pierre\" and especially \"Code Innconnu\" and try arguing otherwise.",
         "I'm totally biased. Not objective or dispassionate. Juliette Binoche is my favorite actress of all time and every time I see her do anything on screen it's captivating. And William Hurt is one of my favorite actors. And the idea for the film was a very good one, however I think the french writer must have been resposible for most of the dialogue because a lot of it is nonsensical/out of place. That said, nice little stories like these (not cheesy, just \"light\") are one of the resons why I love film. I think of Chacun Cherche son Chat for the epitome of what I'm talking about...I saw this with my gf (now wife) at the Kabuki in SF and we both had a great time."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Films Balenciaga, Les",
         "France 2 Cinéma",
         "M6 Films"
      ],
      "summaries": ["Dr. Henry Harriston is a successful psychoanalyst in New York City. When he is near a nervous breakdown, he arranges to change his flat with Beatrice Saulnier from France for a while. Both don't know each other and both find themselves deeply involved into the social settings of the other, because the decision to change their flats is made overnight. Could be the perfect amusement, but suddenly Henry finds himself beaten up by Beatrice' lover and Beatrice is considered to be Dr. Harriston's substitute by his clients."],
      "budget": 0
   },
   "movielensId": 3874,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": "2000-08-15",
      "directors": ["Chantal Akerman"],
      "runtime": 108,
      "movieId": 3874,
      "title": "A Couch in New York",
      "mpaa": "R",
      "actors": [
         "Juliette Binoche",
         "William Hurt",
         "Paul Guilfoyle",
         "Richard Jenkins",
         "Stephanie Buttle",
         "Barbara Garrick"
      ],
      "imdbMovieId": "0118018",
      "originalTitle": "Un divan à New York",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["iU-4q4lyA0c"],
      "plotSummary": "Dr. Henry Harriston is a successful psychoanalyst in New York City. When he is near a nervous breakdown, he arranges to change his flat with Beatrice Saulnier from France for a while. Both don't know each other and both find themselves deeply involved into the social settings of the other, because the decision to change their flats is made overnight. Could be the perfect amusement, but suddenly Henry finds himself beaten up by Beatrice' lover and Beatrice is considered to be Dr. Harriston's substitute by his clients...",
      "tmdbMovieId": 47434,
      "avgRating": 3.16514,
      "releaseYear": "1996",
      "numRatings": 109,
      "posterPath": "/92CVrPyiiXKOGdEldkb0FuVKPrU.jpg"
   }
}