{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "black magic",
            "id": 4252
         },
         {
            "name": "satanist",
            "id": 5545
         },
         {
            "name": "supernatural",
            "id": 6152
         },
         {
            "name": "hammer horror",
            "id": 155730
         },
         {
            "name": "occult",
            "id": 156174
         },
         {
            "name": "ritual sacrifice",
            "id": 162745
         },
         {
            "name": "occult horror",
            "id": 178647
         }
      ],
      "imdb_id": "tt0062885",
      "video": false,
      "title": "The Devil Rides Out",
      "recommendations": [
         28801,
         3104,
         18990,
         39043,
         30855,
         17102,
         34479,
         28752,
         40064,
         3079,
         29049,
         29778,
         33020,
         42594,
         39925,
         28667,
         29960,
         26912,
         42469,
         35669
      ],
      "backdrop_path": "/wFSkj7oFhXCZD7y02PFwlib8PRU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Duc de Richleau",
               "gender": 2,
               "credit_id": "52fe473a9251416c9106e5ab",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mocata",
               "gender": 2,
               "credit_id": "52fe473a9251416c9106e5b5",
               "name": "Charles Gray",
               "profile_path": "/czTISDAqwpOUGDdO3wT1fgkLUAz.jpg",
               "id": 10074,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tanith Carlisle",
               "gender": 0,
               "credit_id": "52fe473a9251416c9106e5b9",
               "name": "Nike Arrighi",
               "profile_path": "/8dDRwjScCYbApYZfNxwnxlk9wiU.jpg",
               "id": 18768,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Rex Van Ryn",
               "gender": 2,
               "credit_id": "52fe473a9251416c9106e5bd",
               "name": "Leon Greene",
               "profile_path": "/nKAZHKoc9ZDp8J75WE93Q3Qhzdb.jpg",
               "id": 113700,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Simon Aron",
               "gender": 2,
               "credit_id": "52fe473a9251416c9106e5cd",
               "name": "Patrick Mower",
               "profile_path": "/5tVoPn4bgAEzFmRdf7phkEO3P7z.jpg",
               "id": 95092,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Countess",
               "gender": 0,
               "credit_id": "52fe473a9251416c9106e5d1",
               "name": "Gwen Ffrangcon Davies",
               "profile_path": "/r5tuarfDIXDjNbxrR3g8W9hmW1V.jpg",
               "id": 1204461,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Marie Eaton",
               "gender": 1,
               "credit_id": "52fe473a9251416c9106e5d5",
               "name": "Sarah Lawson",
               "profile_path": null,
               "id": 184946,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Richard Eaton",
               "gender": 2,
               "credit_id": "546b37ffc3a3680d7d00162d",
               "name": "Paul Eddington",
               "profile_path": null,
               "id": 1198078,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Peggy Eaton",
               "gender": 1,
               "credit_id": "52fe473a9251416c9106e5dd",
               "name": "Rosalyn Landor",
               "profile_path": "/5MnGANdSf8W5V0nBEeqUlW09vRl.jpg",
               "id": 148829,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Malin",
               "gender": 2,
               "credit_id": "558bdf339251415888000517",
               "name": "Russell Waters",
               "profile_path": "/gxO3jVF5a5Fh4PYFdgH00oet3cI.jpg",
               "id": 114837,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe473a9251416c9106e5b1",
               "name": "Terence Fisher",
               "profile_path": "/53YMKaZBJSEWvPAOAGJpWkttXee.jpg",
               "id": 29662,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe473a9251416c9106e5c9",
               "name": "Anthony Nelson Keys",
               "profile_path": null,
               "id": 29665,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473a9251416c9106e5e3",
               "name": "Dennis Wheatley",
               "profile_path": null,
               "id": 1078791,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe473a9251416c9106e5e9",
               "name": "James Bernard",
               "profile_path": null,
               "id": 30137,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe473a9251416c9106e5ef",
               "name": "Arthur Grant",
               "profile_path": null,
               "id": 30138,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe473a9251416c9106e5f5",
               "name": "Spencer Reeve",
               "profile_path": null,
               "id": 30418,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56e15bc9925141088f00216e",
               "name": "Bernard Robinson",
               "profile_path": null,
               "id": 30139,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "558bdf519251415888000524",
               "name": "Richard Matheson",
               "profile_path": "/qpcAG1Rpic5EWY8LMPN3e1R6TKs.jpg",
               "id": 12415,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "558bdf859251415888000535",
               "name": "Eddie Knight",
               "profile_path": null,
               "id": 11126,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "558bdfb09251415888000547",
               "name": "Patricia McDermott",
               "profile_path": null,
               "id": 14750,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "558bdfddc3a3687e650034d8",
               "name": "Ian Lewis",
               "profile_path": null,
               "id": 1481301,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56e15bf9c3a3680a1f00264f",
               "name": "Ken Rawkins",
               "profile_path": null,
               "id": 1588446,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "56e15bb7925141087c002293",
               "name": "Bernard Robinson",
               "profile_path": null,
               "id": 30139,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 2,
               "credit_id": "56e15c0fc3a3680a2900268c",
               "name": "Arthur Cox",
               "profile_path": null,
               "id": 122924,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e15c21c3a3680a1000234c",
               "name": "Moray Grant",
               "profile_path": null,
               "id": 30761,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 1,
               "credit_id": "56e15c3b925141543c00009d",
               "name": "Irene Lamb",
               "profile_path": null,
               "id": 390,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56e15c67925141543c0000a5",
               "name": "Philip Martell",
               "profile_path": null,
               "id": 1588242,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e15c78925141543c0000a7",
               "name": "David Toguri",
               "profile_path": null,
               "id": 1342605,
               "department": "Crew",
               "job": "Choreographer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.524291,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 39891,
      "vote_count": 62,
      "budget": 0,
      "overview": "The powers of good are pitted against the forces of evil as the Duc de Richelieu wrestles with the charming but deadly Satanist, Mocata, for the soul of his friend. Mocata has the knowledge and the power to summon the forces of darkness and, as the Duc de Richelieu and his friends remain within the protected pentacle, they are subjected to ever-increasing horror until thundering hooves herald the arrival of the Angel of Death.",
      "similar": [
         40064,
         409297,
         19592,
         622,
         561,
         1487,
         675,
         588,
         91586,
         77949,
         396422,
         259693,
         9946,
         752,
         65086,
         8839,
         250546,
         291272,
         9003,
         184346
      ],
      "original_title": "The Devil Rides Out",
      "runtime": 96,
      "poster_path": "/6sPmdNVa11PlwXZp1KeHAjMv5O9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Associated British-Pathé",
            "id": 4894,
            "origin_country": ""
         },
         {
            "logo_path": "/pi7SHIi3CNAyDUCt6Jpr1q9UW3t.png",
            "name": "Hammer Film Productions",
            "id": 1314,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Seven Arts Pictures",
            "id": 14159,
            "origin_country": ""
         }
      ],
      "release_date": "1968-07-20",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "The beauty of woman . . . the demon of darkness . . . the unholy union of",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Terence Fisher"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Richard Matheson",
         "Dennis Wheatley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062885/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjQ5MzI0NjgzM15BMl5BanBnXkFtZTcwMTM2MTgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Christopher Lee, Charles Gray, Nike Arrighi | See full cast and crew »"],
      "reviews": [
         "'The Devil Rides Out' is easily one of the most entertaining of Terence Fisher's Hammer movies. While best known for his Dracula and Frankenstein movies, this fascinating blend of adventure thriller and Satanic shocker is not to be overlooked. While technically a horror movie with strong supernatural elements, the movie's use of old fashioned thrills and Lee's dashing heroic character Duc de Richleau, gentleman and occult expert, give this one quite a unique flavour unlike most of the other Hammer classics. Lee is brilliant throughout, as is his nemesis the evil magician Mocata played by Charles Gray (Blofeld in 'Diamonds Are Forever'). The rest of the cast are also very effective. Leon Greene as Richleau's loyal friend Rex, Nike Arrighi as Tanith the mysterious girl rex becomes besotted with, and Patrick Mower as Simon, Richleau and Rex's young friend who foolishly dabbles with Satanism and soon finds himself under the control of Mocasta. The film is consistently interesting, with lots of excitement and some unpredictable plot twists. The Satanism is treated more seriously and realistically than many 1960s horror movies (and wait til you see \"The Goat Of Mendes\"!) , and this is a credit to Richard Matheson who adapted Dennis Wheatley's original novel. I am becoming increasingly aware of just how many movies I admire that Matheson had a hand in writing - many of Roger Corman's Poe series, 'The Legend Of Hell House' and 'The Last Man On Earth' to name a few. Matheson is one of the most talented and imaginative horror writers to ever work in Hollywood, and rarely gets the credit he deserves. 'The Devil Rides Out' is yet another fantastic movie from the Hammer studio, and highly recommended.",
         "One of Terrence Fisher's greatest directorial efforts certainly is this stylish, witty, thrilling adaptation of a Dennis Wheatley novel. Richard Matheson did the screenwriting honors, ad like most of what he touches, it turns to gold. This film has a wonderful score throughout, some superior set pieces and some pretty novel special effects for its day. But behind all of this is the central, universal battle between the forces of good and evil, represented by the characters of Christopher Lee and Charles Gray. Both actors do an excellent job. This may indeed be Christopher Lee's finest performance, which is all the more surprising since he not only plays a good man but also is in a role that Peter Cushing would have devoured. Lee, from the very onset of the film, plays a man well-versed in knowledge of the occult and whose presence literally steals scene after scene. His counterpart, the malevolent Charles Gray, is just as good as Lee's antithesis. Gray is an underrated actor whose presence also illuminates and transcends the screen. The film boasts some great scenes including the much heralded Angel of Death scene, and there is a great scene between Gray and Lee's niece. A tremendous film in many respects and one of Lee's best, Fisher's best and Hammer's best!",
         "Last night I saw this film for the first time in 35 years. Time has been kinder to it than it has to many Hammer films, but this one is less driven by effects and make-up and more by dialog. That's all for the better because once again, when need be, Hammer fails in the effects department. I had forgotten how the theater went wild in 1968 while looking at the cheap tarantula effect - was it growing or not, the perspective changed constantly. Some of the effects are of the \"stop the camera\" variety, no more convincing here than on \"Lost In Space.\" But still, it is the performances, situations and the dialog that engage us. Christopher Lee, who brought the project to Hammer, seems to be enjoying himself as the Duc de Richleau, finally getting to play a hero. His longtime friend Rex, played by Leon Greene (but voiced by Patrick Allen) is a real stalwart guy, given to punching out windshields when necessary, climbing into car trunks, and throwing a crucifix from a running board to eliminate the specter of the devil himself. The best scene has Lee and company in a circle in which to protect themselves from the evils sent by Mocata, played by Charles Gray with a suaveness that matches the twinkle of his blue eyes. Mocata tries every trick in the book, including trying to make it appear that the daughter of the household is being threatened by the tarantula, as well as an Angel of Death on horseback (it is a large room). Meanwhile, outside, Rex has a potential female victim tied up for her own good, she later becomes a medium when the previously \"threatened\" little girl is kidnapped - to take the place of the medium on the sacrificial altar! Nike Arrighi plays the \"medium\" - a young woman who was to have been re-baptized as a servant of the devil, but whose life now hangs in the balance between the black magic of Mocata, or the efforts of the Duc de Richleau, and she has more talent than most of the Hammer actresses of the period. The Duc's friend Rex falls for her, but is hard pressed to keep up with the spells of Mocata, who will stop at nothing to reclaim his servant. What really helps the film is a great sense of period - somewhere midway between the two world wars. The props (especially the vehicles) and costumes are quite right, and the landscapes are far more diverse than the usual Bray Studios trappings. There's no doubt that the team sought to make this one special and shoot on some real locations - and it's perhaps here rather than in the effects that the budget was concentrated. All in all, despite some shortcomings, a very enjoyable Hammer film, a solid Richard Matheson script from a superior Dennis Wheatley novel makes for exciting viewing, far superior to the previous Satanic Hammer film \"The Witches\" (aka \"The Devil's Bride\") and equal to the later adaptation of Wheatley's own \"To the Devil A Daughter\" - the last Hammer film which may have its less than sterling reputation for that measure alone.",
         "Heading the great Hammer Horror Revival was Terence Fisher, the director whose adaptations of the Universal horror classics, The Curse Of Frankenstein (1957), The Horror of Dracula (1958) and The Mummy (1959) sealed the studio's fate as the leading producer of British gothic horror for almost 20 years. Throughout the 60s, while half of Hammer's output were rather silly adventure yarns (The Viking Queen, The Vengeance Of She) and lazy exercises in generic conventions (Curse Of The Mummy's Tomb, The Old Dark House), Fisher created more adult-oriented horror - psychological, almost Freudian horror (The Gorgon, Frankenstein Created Woman), drawing on the sexual conflicts of the repressive English social climate starting to fray at the seams. Fisher's final film, Frankenstein And The Monster From Hell (1973) is British horror at its bleakest - a deeply disturbing and amoral portrait of amorality in the figure of Fisher's greatest creation, Baron Frankenstein as essayed by Hammer icon Peter Cushing. Over twenty years after his death he is still regarded as Britain's greatest ever horror director. Fisher began work on The Devil Rides Out, the first of three Dennis Wheatley adaptations, in the summer of 1967. From the opening credits, an indecipherable mass of occult symbols appearing out of a red mist punctuated with James Bernard's ominous orchestral score, screenwriter Richard Matheson (I Am Legend author and scriptwriter of Roger Corman's Edgar Allen Poe series) sharpens Crowley's prose to create a frighteningly real world of dark forces at work beneath the genteel surface of the English aristocracy. At a reunion of old friends at a country estate, occult expert the Duc de Richelieu (Christopher Lee) and his well-meaning but impulsive lantern-jawed sidekick Rex (Leon Greene) discover their young comrade Simon (Patrick Mower) has become involved in `astrological society', a thinly-veiled satanic cult lead by the charismatic Mocata (Charles Gray). Richelieu and Rex kidnap Simon to prevent his Devil's baptism, but he escapes. Mocata then uses Richelieu's friends Richard (Yes Minister's Paul Eddington) and his family, and Tanith (Nike Arrighi), a young French beauty also marked for baptism, as bait to lure Richelieu to his destruction. For a studio defined by its reworkings of Dracula and Frankenstein, Mocata is one of Hammer's most frightening monsters. Veteran Shakespearean actor Gray, best remembered these days as the Bond villain in Diamonds Are Forever (1971) and the narrator in The Rocky Horror Picture Show (1975), conveys the palpable menace from his cold, unflinching steel-gray eyes and his carefully modulated voice, a master of hypnosis and mind control no doubt based on real-life characters from Wheatley's days in British Intelligence (some say Mocata is smoother version of the `Great Beast', occultist Alistair Crowley, whom Wheatley was acquainted with). Matheson's script changes the Mocata character from a swarthy European figure of Word War 2-era intrigue into an English `gentleman', more forcefully underpinning the tension between England's exterior pastoral elegance and class respectability, and its repressed bacchanalian urges. Wheatley, a British author best known for his black magic tales and costume adventure stories, was an avid collector of occult esoterica and was reportedly delighted with the film, as Matheson's script had expanded on his own research his Black Magic rituals with an eye for detail, drawing on Crowley's writings as well as Sumerian and Egyptian legends, occult and pagan texts. Of course the film's focus is on the imposing figure of the six foot four Christopher Lee, by 1967 a genre superstar having played Dracula, the Frankenstein monster, the Mummy, Rasputin, even Sherlock Holmes. Lee had in fact pressed Hammer to purchase the rights for Wheatley's novel, and was delighted to play a character on the side of `good' after a decade typecast as Dracula. Hammer films are characterized by relatively low budgets, compensated by taut direction and expert characterization, and a winning combination of tight studio sets and English country exteriors. The Devil Rides Out utilizes its stagebound scenario to chilling effect: Simon's cold gray observatory turns malevolent purely by adding scratching noises from a cupboard. The budget only lets the film down in its two major setpieces; both the final sacrificial ceremony at Mocata's mansion and the Grand Sabbat, supposedly a grand ritual orgy for Simon and Tanith's intended baptism, veer toward poorly-staged pantomime. When Mocata invokes Satan (`The Goat of Mendes - the Devil himself!') at the Sabbat, the sight of a rather wretched figure with pin-on horns and raccoon eyes tends to blunt the scene's horrific implications. Indeed the film's scariest scene is set in an empty room; Richelieu, Rex and the family take refuge inside a chalk circle and are confronted by a series of apparitions conjured by Mocata. Again the scene is only marred by the final ghastly figure: a horsebound Angel of Death, whose mask drops to reveal a cheap-looking grinning plastic skull. The Devil Rides Out was an artistic triumph but not a commercial success. Perhaps it was the unfamiliar tone of the film, or the fact Christopher Lee had his fangs filed down; two further Duc de Richelieu adventures starring Lee, Strange Conflict and Gateway To Hell were abandoned. Hammer's next venture after The Devil Rides Out, The Lost Continent (an ambitious reworking of Wheatley's Jules Verne style adventure novel Uncharted Seas) went wildly overbudget and Wheatley was not impressed, citing a number of plot changes by director Michael Carreras. The third Wheatley adaptation, a grotesque updating of To The Devil A Daughter with Richard Widmark and an embarrassed Christopher Lee, was Hammer's horror swansong in 1976, and the company sank soon after. Maybe it was the curse of Dennis Wheatley after all - still, for us horror iconoclasts, we still have The Devil Rides Out, a film that remains after 35 years one the finest examples of the gone but never to be forgotten house of Hammer.",
         "Is \"The Devil Rides Out\" the best Hammer film this notorious production company ever brought forward?? Quite possibly so, as it is an almost perfect mixture of allegorical melodrama, compelling thriller and occult horror. The screenplay, adapted from a novel by horror cinema's most talented writer Richard Matheson, is loaded with suspense and atmospheric eeriness and contains an extended occult vocabulary that'll make genre fans foam! Most of the time, it's even hard to believe that you're actually watching a Hammer film since this film is more superior on every level than any of their other productions. Don't get me wrong, I instantly love every Hammer film I see but you can't but reckon that most of their films usually are unsubtle shockers with superficial characters and gratuitous gruesomeness. \"The Devil Rides Out\" is completely different! Genuine frights are delivered through uncanny settings and handlings, while the character drawing is simply sublime. Christopher Lee stars as an eminent duke \u0096 Duc de Richleau (what a name!) - with an encyclopedic knowledge of black magic, whose acts are distinguished and always well considered. Leon Greene plays Richleau's lesser-gifted friend Rex but what he lacks in tact, he makes up in loyalty and impulsiveness. Together they attempt to rescue another friend \u0096 Simon \u0096 out of the hands of a satanic cult, led by the macabre Mocata. Every detail of Richeleau's expertise on the subject is required as Mocata is a worthy nemesis, even capable of summoning Satan himself! \"The Devil Rides Out\" is a downright terrific adventure, with non-stop excitement and efficient scary moments. Only, this is not simply reached through cheap images of terror, but through a constantly ominous atmosphere and an intelligent and carefully constructed screenplay. Another immediately follows one powerful sequence and it's nearly impossible to determine the absolute highlight of the film. Lee's and Greene's first encounter with a diabolical creature in the mansion's attic, the car chase through the countryside, the baptism-ritual in the woods, the séance with Richleau's niece\u0085 All these are just examples of sheer horror brilliance that feature in this one film! And there are several more, mind you. If the wholesome isn't impressive enough, the ending contains a paradox-twist, truly stunning and very much ahead of its time. Perhaps the biggest trump of this still underrated gem of classic horror is that it feels disturbingly realistic and believable. The premise of a devil-worshiping cult often automatically provokes unintended laughs and cheesy situations but in this case you practically sense the devil breathing down your neck! Satan Himself makes an appearance (referred to as The Goat of Mendez) and it's the most convincing portrayal of the Master of all Evil I've ever seen. The professionalism of both cast and crew nearly bursts through the screen. Terence Fisher especially gained fame by his directorial achievements in the Dracula and Frankenstein cycles, but this surely is the most flawless film in his admirable career. From the trivia-pages of this marvelous website, I picked up that this is also Christopher Lee's favorite Hammer film (of ALL the movies he starred in, he considers \"The Wicker Man\" to be the best) and you can't but second his great taste. Lee's sympathy for this screenplay obviously reflects itself in his performance as he lifts up the film to an even higher quality level. Christopher plays the good guy, for a change, but the role definitely suits his persona and no other actor on this planet could have played it better. You get it by now, \"The Devil Rides Out\" is one of the greatest horror film ever made and a cinematic experience true fans can't afford to miss.",
         "The Devil Rides Out (AKA: The Devil's Bride) is produced out of Hammer Film Productions. It's based on the 1934 novel of the same name written by Dennis Wheatley, with Richard Matheson adapting the screenplay. Directed by Terence Fisher, it stars Christopher Lee, Charles Gray, Nike Arrighi, Leon Greene, Patrick Mower, Sarah Lawson and Paul Eddington. Filmed in Technicolor with Arthur Grant the cinematographer and the music is scored by James Bernard. 1930's England and Duc de Ricleau (Lee) finds that his young friend Simon Aron has gotten himself involved with a Satanic cult led by the evil Mocata (Gray). As the Duc and his friends try to save Simon from the cult, Mocata and his followers summon the forces of evil to aid their cause. It was meant to come out a bit earlier in the 60's, but Satanism, an always iffy subject, would have seen censorship strip Hammer's ideas for the film to the bone. So the studio waited a few more years and finally got the film out a couple of years shy of the 70's. It's a film that now, more than ever, is rightly viewed as not only one of the best film's to have come out of Hammer, but also as one of the best British horror movies ever released. There was much in the film's favour from the off, it had the studio's best director in the chair, the charismatic Christopher Lee in the lead and the talented Matheson (I Am Legend/The Shrinking Man/Hell House) writing the screenplay. The latter of which managing to streamline Wheatley's potent, but long, source material into a fast paced hour and a half movie. It's also, thanks to Wheatley, well researched, which when finding the story is set in more modern times, gives the film an authentic sheen as it rides on into the macabre. On the surface the plot seems to be a standard good against evil battle, but it's not just a battle, this is a war on terror. Lee's determined, bastion of good, de Ricleau is not just fighting to save the soul of those he cares about, the film makes one feel that it's a battle he must win: for us all. Tho only blessed with the usual standard Hammer budget, the film has immense attention to detail, the power of black magic and the occult is painted vividly, with Fisher ensuring that nothing is hokey, this is serious stuff. The director, too, favouring atmospheric dread over short sharp shocks. What action there is is quality, sure the effects are hardly Oscar winning fare, but the impact is big. So too are the number of memorable scenes that puncture the story, the centrepiece of which is the night our \"good\" characters spend in floor drawn pentacle, fighting off the forces of darkness, some suggested trickery and terrifying manifestations testing their resolve, with the majestic Lee holding court with virtuous nobility. The rest of the cast are uniformly excellent, with stand outs being Gray, excelling at silky villainy, even tho he's not on screen a great deal, and Eddington, who neatly plays it deadpan opposed to Lee's serious attempt to drive home the seriousness of what is going on. Noteworthy, too, that it's one of those rare occasions to see Lee playing the good guy. Grant (The Plague of the Zombies) makes wonderful use of the Technicolor, his lensing for the fire and brimstone finale is particularly memorable, and Bernard's score is eerie for the build up sequences and demonically boisterous for the critical moments: one of the best scores to accompany a Hammer film. It's not high cinematic art, and certainly not an overtly horrific film; in that you wouldn't recommend it to the boo-jump thrill seeker, but it's troublingly scary, adult and dripping with cold dread. A picture that closes in on you and challenges the myths and nightmares that lurk in the dark. Up alongside The Wicker Man and Witchfinder General as one of the true greats of British horror. 9.5/10",
         "THE DEVIL RIDES OUT, while it came along almost 10 years after Hammer first started churning out horror films, is possibly the best horror film they ever produced. Even though HORROR OF DRACULA and CURSE OF THE WEREWOLF rank highly with fans and critics alike, THE DEVIL RIDES OUT is just now receiving the acclaim it deserves. Christopher Lee turns in one of his best performances as Duc de Richelieu, a religious man who stands firmly against witchcraft. His friend Simon has been chosen for baptism into a Satanic cult in the English countryside and Richelieu, along with his friends Rex and Roger, intend to stop the dastardly deed from occurring. To avoid the wrath of the Mercata, the leader of the cult (played by ROCKY HORROR PICTURE SHOW's Charles Gray), Richelieu draws an ancient protective circle and places all the involved parties inside to spend one terrifying night trying to protect themselves against demons and spirits of all kinds. Not your average Hammer production, DEVIL RIDES OUT was released in the U.S. as THE DEVIL'S BRIDE since RIDES OUT was deemed a title for a Western. RIDES OUT makes much more sense during a certain sequence featuring the Angel of Death riding a jetblack horse. The visuals in this film are astounding: a giant spider, a goat-headed devil, a black man with yellow piercing eyes, and the infamous goat's blood scene. All these and more are in store for you when you see THE DEVIL RIDES OUT. I recommend this not only to initiates of the Hammer cult (no pun intended), but also to those who want to see one film that will make them fans. This or HORROR OF DRACULA should do the trick.",
         "Watching this on DVD after gap of a couple of years, more or less immersed in the horror of Italian giallo and the product of Japan, I am surprised at just how good this is. Has to be hot candidate for the best Hammer and one of the best Christopher Lee performances. He actually seemed to enjoy this role as an upper class Brit struggling to pit himself against the powers of evil. This reminded me a little of Night of the Demon and certainly shares with that film the 'ordinariness' of the chums struggling against the devil himself and the believable power of that 'dark side'. For me this just fails to get 100% due to what I reckon is the only disappointment; Leon Greene and it is a bit unfair because its probably more the way his part is written. This very English tradition of having a bumbling Dr Watson type character to help the lead to explain what's happening to the audience and also to show how very clever he is. Still, it's a minor gripe when this is such a glorious, non-stop, thrill of an adventure which I should also mention includes a most effective and key performance from Nike Arrighi who is most convincing as 'the possessed'. Excellent.",
         "Hammer studios scores a knock-out with this superb supernatural horror flick starring Christopher Lee as Duc de Richleau who finds a battle on his hands with a Satanic cult, led by Mocata(Charles Gray;played the villain Blofeld in DIAMONDS ARE FOREVER). Richleau had a war pal who died and so he took over fatherly duties for the man's son, Simon(Patrick Mower), who is being pursued by the cult to become a follower of Satan. Richeau, a devout man who understands the methods of the dark magic, must stop them from taking Simon. Mocata has a powerful gift and that is of controlling weak minds. The key to the evil forces' power is direct eye-contact..you, in a sense, give over yourself when that form of contact is connected. Things get even more complicated when Richleau's other war pal, Rex(Leon Greene)finds that another has yet to have been \"re-baptized\" in the Satanic cult named Tanith(Nike Arrighi)for whom he falls in love. Mocata uses Tanith as his medium and can control her from a long distance. Tanith doesn't wish to harm anyone, but the evil commanding inside her is too strong to control. The Eatons have a home nearby where the Satanic cult hold a place of worship. Richard Eaton(Paul Eddington)thinks all that Richleau tells him is gibberish and is skeptical. His wife Marie(Sarah Lawson)is Richleau's niece and she does, albeit reluctantly, believe what her uncle speaks regarding the cult. But, it's only through action where Marie and Richard begin to understand what Richleau and they are up against. There are quite a few moments of peril for Richleau and Rex as they must somehow keep Simon and Tanith away from the clutches of Mocata and his group. It's proved in ritual that Mocata has the ability to summon Satan. If this flick were in anyone else's hands, it might turn out as a silly, campy horror film. But, in the capable hands of Terence Fisher with Lee leading the way FINALLY having an opportunity to be a heroic figure, this flick is played seriously with optimum effect. Charles Gray was well cast as the chief villain for he has a foreboding, yet sophisticated, presence that works well. At hindsight he might even look like a gentleman..it's when he's able to practice his devil worship that we see his pure evil. Squeezing every ounce of tension at their disposal, our heroes will have to remain in a \"circle of safety\" as they are tempted to move out via fake manipulation showing them images that are not really there playing on the inner fear of each individual. Adding the final scary piece is when Mocata kidnaps the Eatons' little girl for a sacrifice to their Lord.",
         "This film sets itself apart from most of the rest of Christopher Lee's career as, for a change, he plays the good guy! In fact, he does a rather good job and the character, although a hero, definitely suits his persona. Lee's character is a pronounced expert on the occult and Lee does a great job in portraying him. He brings with him a sense of worldliness that few actors can match and that is perfect for his role here. However, I'm sorry to say that Christopher Lee's performance is practically the best thing about this film. Don't get me wrong, it certainly isn't bad; there's some lovely moments of horror and the film remains interesting throughout, but it's far too serious and the innocent, tongue in cheek edge is one of the things I like best about Hammer. Some of the trademarks are still there; campy acting and over the top sequences been the best of them, but overall this seems like it could have been released by another studio. And that isn't something I want when I'm watching a Hammer film. That being said, some of the imagery in the film is fantastic. We've got the angel of death, a giant tarantula, several scenes of devil worship and - wait for it - Satan himself makes an appearance! And, get this, he doesn't look ridiculous either! The plot follows Christopher Lee as he discovers that one of his best friends has turned to devil worship, don't you just hate it when that happens? Anyway, Lee doesn't take this sort of thing lying down and decides to dedicate all his free time to saving his friend's soul. Because that's what friends are for, right? The film builds it's atmosphere by way of several sacrifices and other assorted devil worship and a great score. The great score doesn't exactly hinder the film's atmosphere either, and helps to build up a malicious sense of dread throughout. Despite it being more serious than usual, the film is still a lot of fun and it's hard to really call a film that sees Christopher Lee running around trying to stop a devil worshipping cult 'serious' anyway..."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Associated British-Pathé",
         "Hammer Film Productions",
         "Seven Arts Productions"
      ],
      "summaries": [
         "In the countryside of England, the Duc de Richleau a.k.a Nicholas welcomes his old friend Rex Van Ryn that has flown to meet him and Simon Aron, who is the son of an old friend of them that had passed away but charged them the task of watching the youngster. Nicholas and Rex unexpectedly visit Simon that is receiving twelve mysterious friends. Sooner Nicholas, who is proficient in black magic, learns that the guests are member of a satanic cult and Simon and his friend Tanith Carlisle will be baptized by the powerful leader Mocata to serve the devil. The two friends abduct Simon and Tanith expecting to save their souls but Mocata summons the Angel of Death and the Goat of Mendes to help him in a battle between the good and the forces of evil.",
         "When the Duc de Richelieu and his friend Rex Van Rin unexpectedly visit their good friend's son Simon Aron he immediately suspects that something is wrong. Aron is hosting a soirée of exactly 13 people, all supposedly astronomy enthusiasts. When Richelieu finds live chickens in a closet, he knows Simon is playing with black magic. He has come under the influence of the mysterious Mocata and rescue Simon and his friend Tanith Carlisle from their satanic baptism. Mocata is determined to have his new acolytes at his side however and unleashes the power of hell to take them back.",
         "The Duc de Richeleau and his friend Rex discover their young charge Simon has fallen in with the powers of Darkness and is about to be baptized into the service of evil. The Duc is fortunately versed in such matters and finds himself locked in a duel with the deadly Mocata, disciple of the left-hand path."
      ],
      "budget": 0
   },
   "movielensId": 3875,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-07-20",
      "dvdReleaseDate": "2000-08-08",
      "directors": ["Terence Fisher"],
      "runtime": 96,
      "movieId": 3875,
      "title": "The Devil Rides Out",
      "mpaa": "G",
      "actors": [
         "Christopher Lee",
         "Charles Gray",
         "Nike Arrighi",
         "Leon Greene",
         "Patrick Mower",
         "Gwen Ffrangcon Davies",
         "Sarah Lawson",
         "Paul Eddington",
         "Rosalyn Landor",
         "Russell Waters"
      ],
      "imdbMovieId": "0062885",
      "originalTitle": "The Devil Rides Out",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["LCZnuo1vuWU"],
      "plotSummary": "The powers of good are pitted against the forces of evil as the Duc de Richelieu wrestles with the charming but deadly Satanist, Mocata, for the soul of his friend. Mocata has the knowledge and the power to summon the forces of darkness and, as the Duc de Richelieu and his friends remain within the protected pentacle, they are subjected to ever-increasing horror until thundering hooves herald the arrival of the Angel of Death.",
      "tmdbMovieId": 39891,
      "avgRating": 3.30464,
      "releaseYear": "1968",
      "numRatings": 151,
      "posterPath": "/6sPmdNVa11PlwXZp1KeHAjMv5O9.jpg"
   }
}