{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120867",
      "video": false,
      "title": "Jerry and Tom",
      "recommendations": [],
      "backdrop_path": "/6PASdc7SdzFyPhkk0T0IUfaemQt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tom",
               "gender": 2,
               "credit_id": "52fe4952c3a368484e12594d",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "52fe4952c3a368484e125951",
               "name": "Sam Rockwell",
               "profile_path": "/mEH7nCaG75XNkoFbp3MIwCbIZb6.jpg",
               "id": 6807,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe4952c3a368484e125955",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The Guy Who Loved Vicki",
               "gender": 2,
               "credit_id": "52fe4952c3a368484e125959",
               "name": "Ted Danson",
               "profile_path": "/wWm9eDLuPDw29R76KAjg6gIE9dS.jpg",
               "id": 12836,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Vic",
               "gender": 2,
               "credit_id": "52fe4952c3a368484e12595d",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Karl",
               "gender": 2,
               "credit_id": "52fe4952c3a368484e125961",
               "name": "William H. Macy",
               "profile_path": "/cYmHYCGxkOVZgu2oDyhF6lKgfaj.jpg",
               "id": 3905,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Stanley",
               "gender": 2,
               "credit_id": "52fe4952c3a368484e125965",
               "name": "Peter Riegert",
               "profile_path": "/yPgaRZBMVy9eoNNuiPIm0wzG9sD.jpg",
               "id": 20899,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Deb",
               "gender": 1,
               "credit_id": "52fe4952c3a368484e125969",
               "name": "Sarah Polley",
               "profile_path": "/asFwK6hCFYHtHVJoOwMBSMTETtg.jpg",
               "id": 98,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4952c3a368484e12596f",
               "name": "Saul Rubinek",
               "profile_path": "/1gsXmCmJIegqK0U8dwLz005UM0.jpg",
               "id": 3712,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4952c3a368484e125975",
               "name": "Rick Cleveland",
               "profile_path": null,
               "id": 69019,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 0.600012,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 76891,
      "vote_count": 9,
      "budget": 0,
      "overview": "Tom and Jerry are two hit men, they work by day at a third-rate second-hand car dealership. Tom is a veteran and Jerry is a novice in their business, and their attitude toward their profession differs a lot. It shows when Tom is required to kill his old friend Karl.",
      "similar": [],
      "original_title": "Jerry and Tom",
      "runtime": 107,
      "poster_path": "/lXnbIgEhPgbEJHC6ziwUhZ43xHM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-12-04",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "These Guys Make The Sopranos Sing!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Saul Rubinek"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Rick Cleveland",
         "Rick Cleveland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120867/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1NTc5NTc5N15BMl5BanBnXkFtZTcwOTI2NjEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Mantegna, Sam Rockwell, Maury Chaykin | See full cast and crew »"],
      "reviews": [
         "1st watched 4/1/2001 - 7 out of 10(Dir-Saul Rubinek): Witty, black comedy with terrific performances by Mantegna and Sam Rockwell. This is the kind of movie that is somewhat of a guilty pleasure because there are times when you're laughing as someone is getting killed or at least in the process of being killed. This is definetly the intent of filmmaker Saul Rubinek where there is a mix of normal guy(who happens to be a hitman)and hitmen(who just happen to own a used car lot). The movie starts out in the present as it appears Jerry and Tom are waiting to \"do\" another person, and then takes you back ten years to show you how Jerry got involved in the business that Tom already has been doing for many years. There isn't much morality here and really no lessons are taught but that's ok it's just a movie, and a pretty good one at that.",
         "This is the movie that brings you into the world of the ordinary hit man, well not the machine gun tottling Mafioso gunmen we're so used to watching in the big gangster movies. But the ordinary hit man who does his job as a necessary means to a living. The job is fine but there's no pot of gold at the end of the rainbow. The art of doing well is to kill with nonchalance. It is a hazardous occupation -- you go on as long as you can but don't know if you'll be a target yourself one day. There are no fancy trenchcoats or big cigars. The hit men work as used car salesmen, wipe windows in the lot when free and pay for their own movie tickets. They supply their income by knocking off their assigned victims. A respectable year for Tom means usually getting about two to three contracts done. Need to dismember the body after a murder? They go for a cheap K-mart chainsaw instead of the more renowned Black and Decker brand, and get frustrated when they find that it doesn't work at first try. Young Jerry (Sam Rockwell) learns the ropes from Tom (Joe Mantegna) and witnesses his first murder in the front seat of a car. Jerry's induction is every bit as abhorrent as one would normally react to seeing a man killed. But he learns to like what he does and becomes as cold and merciless as his mentor is. In fact Jerry gets to be as ruthless as Tom, to the point that he even takes sadistic pleasure when whacking off his victims. Tom's professional detachment is his strength and hallmark. But this trait unfortunately is never learnt by his protégé and the latter's intractability proves to be his undoing. Apart from a very entertaining script, what makes the movie an excellent watch is the top-notch performances from the cast, especially Joe Mantegna, Sam Rockwell, Maury Chaykin and Charles Durning. And of course the wonderful cameos by William Macy and Ted Danson. The brutality of the killings is shocking but any darkness in the movie is balanced by the humorous edge throughout. This is about ordinary hit men getting their contracts done. There are no recriminations and regrets. The movie starts and ends on a sardonic note, the very tone that first-time director Saul Rubinek wanted to create. I'm sure if this was a bigger name director with a bigger budget JERRY AND TOM would have been a screamer at the box office. This was a movie I thoroughly enjoyed and it comes highly recommended. Ten out of 10 from me.",
         "Actor Saul Rubinek's impressive directorial debut is an engaging black comedy about two hitmen (Joe Mantegna and Sam Rockwell) who moonlight as used car salesmen. Imagine a Quentin Tarantino film without the endless pop culture references and a healthy dose of David Mamet-laced dialogue instead. Tom is the older, more experienced killer while Jerry is the younger, dumber protege. The film explores the ten-year relationship of these two men punctuated by a number of hilarious stories Tom tells about their boss Vic's famous past hits that seem to include such illustrious prey as JFK and Elvis. What makes Jerry and Tom work so well is Rubinek's confident direction. It is clever without drawing too much attention to itself, it has a witty screenplay by Rick Cleveland that is filled with comic setpieces and witty dialogue, and a solid cast that features the likes of Joe Mantegna, Maury Chaykin, Charles Durning, and William H. Macy. These are actors who know what to do with a good script. It seems like all involved had a blast making this film and this translates into a good time for the audience as well.",
         "Don't look for a deep meaning for life in this film. Look for a very entertaining two hours of superb characters, situations, and some of the most crafty filming techniques I've seen in years. The transitions from one scene to the next were very clever. This one was worth rewinding and watching the characters more closely to fully appreciate them and many of the scene transitions. This is a quality film. The story is not overly complex but keeps you guessing as to what will be next. Tired of the Hollywood formula movies? Tired of shallow characters? Rent this one, you will not be disappointed.",
         "One has to have a morbid sense of humor to enjoy this wry black comedy about two used car salesmen who moonlight as contract killers. The comedy is very tongue in cheek as these two miscreants matter-of-factly whack a dozen or so marked men while bickering over trivialities. The gag is funny at first, but wears thin as we are treated to minor variations on the same theme for an hour and a half. Other than some innovative scene transitions, the direction by veteran TV director Saul Rubinek was nothing special, except I suppose he made good use of a very limited budget. The story was taken from a play by Rick Cleveland, (`The West Wing' TV series) and Rubinek maintained the theatrical feel using simple sets and concentrating mainly on the actors. Joe Mantegna is an excellent tough-guy character actor and conjures another terrific mobster. He is a tough but practical murderer who takes the task as strictly business and longs to get out of the game. Sam Rockwell is also good as his dim-witted cohort, who begins to like his work a bit too much. Charles Durning gives a droll performance as an over-the-hill hit man who wants to write a book about his targets. There are also cameos by William Macy, Ted Danson and Peter Riegert. This is a better than average B movie with some acting performances that are worth seeing. I rated it a 6/10. It is funny in a perverse way, and Mantegna's performance is a treat.",
         "There are moments of drama and irony in this film, but mostly it's a very well-written and well-acted comedy that is at times hilarious for the ease with which it captures icons and styles from other films while at the same time twisting and mocking them. There is some very cool, matter of fact dialog that brings home the idea of all jobs and actions creating their own reality around them and becoming mundane, no matter how unusual or dangerous the work. While making the viewer laugh, it also brings home the pain and horror the hit men create, especially when they don't behave professionally or fail to follow their own code of distorted ethics.",
         "I saw Jerry and Tom at the 1998 Sundance Film Festival. As said by a previous commentator, I can't believe this film never found wide release. It is a fun, clever, and beautifully made film. This was Rubinek's directorial debut but you'd never know by watching. Rubinek brought out wonderful acting efforts by all. One of the most entertaining elements of the film was his use of seamless transitions from story to story in the film. After the showing at Sundance, Rubinek did a Q&A session where he noted that these were sometimes technically very difficult to accomplish. I cannot recommend this film highly enough. If you see it in video, rent and enjoy.",
         "I have trouble sitting through some movies. Many of the movies I see are the same as other movies....They keep doing the same thing over and over and change the peoples names and a few details and call it new.... This movie Jerry and Tom was a breath of fresh air, something different. It was well done and well cast and it was fresh with a different way of changing scenes, more like a carousel effect with sets blending into the next... BRAVO!!... I couldn't have a cast a better crew of characters, each one brought just what the needed to their role. The movie develops as a new hit man starts his training under the watchful eye of his teacher. We watch him grow through the years, from a young long haired hippie to a well groomed hit man. The humor throughout the movie by itself makes this movie worth watching, very subtle at times, and outrageously funny at other times.",
         "This is part of my Scarecrow Video Guide inspired movie-trek, following \"Steven Soderbergh's Schizopolis\". \"Jerry & Tom\" is a fun little black comedy, but it reminded me a little too much of another fun little black comedy...\"Coldblooded\", starring Jason Priestly & Peter Riegert. (Oddly, Riegert shows up here in a similar role. And, as of now, both films have a 6.7 on IMDb.). I'm not sure which one is lesser known, but they both have something to offer. \"Jerry & Tom\" is the \"better\" film, if only by virtue of the performances. Joe Mantegna is always good, and Sam Rockwell can't lose, IMHO. But nothing much happens here. \"Coldblooded\" was more fun, as I recall. (It's been at least 7 years since I saw it.) I could tell 10 minutes in that \"Jerry & Tom\" was based on a play. It's basically a series of conversations, some brilliantly funny, centered around a group of hit men. It would be a great play, but as a film it's a little lacking. There's an amazing series of creative transitions to show time passages (the story takes place over 10 years), and some hilarious flashbacks. But the scenes in between are incredibly slow. Still, it's hard to fault a film with great actors reading great lines. Aside from Mantegna and Rockwell, Charles Durning is predictably excellent, and William H. Macy shines in a brief role. Perhaps these two films would make a good double feature. Watch \"Jerry & Tom\" first and savor it, then have a few drinks and enjoy \"Coldblooded\". Next on the trek- \"Forbidden Zone\"!",
         "Though forgettable in the long run, while it lasts \"Jerry and Tom\" is very enjoyable. Never has a movie about two ruthless hitmen had less on screen violence. Neither has brutal killing has ever been executed with such taste. While the humor is decidedly black, it's not morbid. There are many funny moments, but the overall effect is somewhat slight. What makes it work is the Joe Mantegna/Sam Rockwell duo. They are both fine team players, especially when paired up with an unlikely other half. Rockwell has in the past partnered a variety of characters from uptight John Turturro in \"Box of Moonlight\" to precocious child Micha Barton in \"Lawn Dogs\" and always with much subtle off beat humor. Mantegna is basically a one role actor. It's a turn he does extremely well, but we have seen it all before. Still, watching these two in \"Jerry and Tom\" is great fun and there's good support from Charles Durning, Ted Danson and Maury Chaykin. There is a nice sense of whackiness about it all, not only in the dialog and characterization but also in the strange and unique manner in which some of the scenes smoothly segue into each other with unexpected camera moves."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Lions Gate Films"],
      "summaries": ["Tom and Jerry are two hit men, they work by day at a third-rate second-hand car dealership. Tom is a veteran and Jerry is a novice in their business, and their attitude toward their profession differs a lot. It shows when Tom is required to kill his old friend Karl."],
      "budget": 5000000
   },
   "movielensId": 3876,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-04",
      "dvdReleaseDate": "2000-08-08",
      "directors": ["Saul Rubinek"],
      "runtime": 107,
      "movieId": 3876,
      "title": "Jerry and Tom",
      "mpaa": null,
      "actors": [
         "Joe Mantegna",
         "Sam Rockwell",
         "Maury Chaykin",
         "Ted Danson",
         "Charles Durning",
         "William H. Macy",
         "Peter Riegert",
         "Sarah Polley"
      ],
      "imdbMovieId": "0120867",
      "originalTitle": "Jerry and Tom",
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Tom and Jerry are two hit men, they work by day at a third-rate second-hand car dealership. Tom is a veteran and Jerry is a novice in their business, and their attitude toward their profession differs a lot. It shows when Tom is required to kill his old friend Karl.",
      "tmdbMovieId": 76891,
      "avgRating": 3.04688,
      "releaseYear": "1998",
      "numRatings": 64,
      "posterPath": "/lXnbIgEhPgbEJHC6ziwUhZ43xHM.jpg"
   }
}