{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0236008",
      "video": false,
      "title": "The Ballad of Ramblin' Jack",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4c4bc3a36847f822713b",
               "name": "Jack Elliott",
               "profile_path": null,
               "id": 186018,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4c4bc3a36847f822713f",
               "name": "Arlo Guthrie",
               "profile_path": "/76uUZUFXhrUCzNAp5DI7nl9NE3Q.jpg",
               "id": 44547,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4c4bc3a36847f8227143",
               "name": "Kris Kristofferson",
               "profile_path": "/hiGkNoiAwnUgY9XZ3YhiWMvKngi.jpg",
               "id": 10823,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4c4bc3a36847f822714d",
               "name": "Pete Seeger",
               "profile_path": "/rr9HGrG7WOCmsXdHWetO1NZ0tpe.jpg",
               "id": 44549,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4c4bc3a36847f8227151",
               "name": "Odetta",
               "profile_path": null,
               "id": 1179594,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4c4bc3a36847f8227155",
               "name": "D.A. Pennebaker",
               "profile_path": "/n762JR4KaAouvTeb5LGHxWa2i87.jpg",
               "id": 21113,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4c4bc3a36847f8227159",
               "name": "Dave Van Ronk",
               "profile_path": null,
               "id": 1179595,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4c4bc3a36847f8227149",
            "name": "Aiyana Elliott",
            "profile_path": null,
            "id": 1179593,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.108833,
      "production_countries": [],
      "id": 161687,
      "vote_count": 0,
      "budget": 0,
      "overview": "With the help of her mother, family, friends, and fellow musicians, Aiyana Elliott reaches for her father, legendary cowboy troubadour, Ramblin' Jack Elliott. She explores who he is and how he got there, working back and forth between archival and contemporary footage. Born in 1932 in Brooklyn, busking through the South and West in the early 50s, a year with Woody Guthrie, six years flatpicking in Europe, a triumphant return to Greenwich Village in the early 60s, mentoring Bob Dylan, then life on the road, from gig to gig, singing and telling stories. A Grammy and the National Medal of Arts await Jack near the end of a long trail. What will Aiyana find for herself?",
      "similar": [],
      "original_title": "The Ballad of Ramblin' Jack",
      "runtime": 112,
      "poster_path": "/b52Phx7BrfAOffHgircxhxzK7Og.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-01-26",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "After Woody Guthrie and before Bob Dylan came Ramblin' Jack Elliott.",
      "adult": false,
      "homepage": "http://www.ramblinjack-themovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Aiyana Elliott"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Dicky Dahl",
         "Aiyana Elliott"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0236008/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NTYyMDcyOF5BMl5BanBnXkFtZTcwMzA2NzAyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Elliott, Gil Gross, Arlo Guthrie | See full cast and crew »"],
      "reviews": [
         "One of the most entertaining and informative documentaries to come around in a long while, \"The Ballad of Ramblin' Jack\" is also one of the most moving. An important episode of American musical history is beautifully detailed in this extraordinarily well-produced work, and no one with a serious interest in the development of popular music in the 20th century should miss it. Ramblin' Jack Elliott, born Elliott Adnopoz, is perhaps THE pivotal figure in the popularization of authentic American folk music. He formed a kind of link between the accomplishments of Woody Guthrie and those of Bob Dylan and his followers. Long before Dylan's famous pilgrimage to New York and the bedside of the terminally ill Guthrie, Ramblin' Jack had formed a close friendship and musical alliance with the great balladeer. Elliott's dedication to the preservation of the Guthrie legacy kept the music alive through recordings and live performances around the country. He was undoubtedly one of the greatest guardians of the folk tradition, performing authentic material, the works of Guthrie, and some original songs in an unadorned style, but with more personality than, say, Pete Seeger. In the thriving folk music scene of the late 1950s and early 1960s, Elliott was a cult figure whose every appearance was noteworthy. Then, somewhere in the mid-sixties, the rise of Dylan so overshadowed Elliott and others in the field, that he has been virtually forgotten by all but music historians. As the film progresses, it seems impossible to avoid a growing respect for Elliott's contribution and talent. His voice, like Guthrie's and Dylan's, does not adhere to conventional ideals of beauty, but it has a definite appeal. A superb singer, Elliott's uncomplicated and always musical performances are models of their kind. His rise as a truly gifted figure, imitated by many (including Dylan, as the film clearly demonstrates) is powerfully contrasted with a descent into near oblivion. The documentary gives both high and low points their due. Included are interview excerpts with Elliott associates such as Pete Seeger, Dave van Ronk, Kris Kristofferson, Arlo Guthrie, and two of the singer's three ex-wives. Ramblin' Jack's daughter, Aiyana Elliott, has put together an immensely successful documentation of her father's life and career. We see footage from childhood play in the 1930s through the singer's ascent into the folk music hierarchy: recording contracts, continuous live dates, friendships with Seeger and Dylan, network television appearances. Artfully interspersed with the career narrative is the tale of Elliott's personal life, or what anyone can know of that life, so that this film is both an artist's biography and a daughter's search for the man her father really is. If the musical life is fascinatingly detailed, the fragmented relationship between parent and child is treated with only a bit less scrutiny. The viewer comes away with an understanding of an important career and period, and with a strong awareness of the humans who lived it. This is a top-notch musical bio-documentary, and a must-see for American music fans.",
         "Ramblin' Jack's story is in many ways the story of American music in the 20th Century, and this documentary tells that story with vitality from the unique perspective of a daughter trying to come to terms with her father's family-excluding career. As such, it may be a tad too ambitious, but the result is certainly entertaining and as personal and powerful a picture of an artist as I can remember seeing. Largely without pretension and careful to get a variety of perspectives, the film provides a faceted view of an evasive subject. The historic documents - a shot of young Zimmerman in the crowd at a Ramblin' Jack show, rare film of roots artists, home movies - are just amazing, and the interviews with the Guthrie clan and other survivors of the 50s folkie era are illuminating. The film's secondary story - the daughter's quest for understanding of her dad - may not be everyone's cup of coffee, but it worked for me, putting a human frame around an epic life. Mostly, the film awakened for me that sense of endless possibility in mid-20th Century America, before the mass packaging of culture crushed so much of the country's promise. Folk was a musical movement born in backwaters and the public squares of melting pot cities, of the fusion of cultures - black and rural, diverse and rich as the world - into the raw stuff of entertainment. Jack's life echoes Kerouac and the Beats in his quest for experience, and his role as Woody Guthrie's heir-designate puts him square in the heart of American radical politics, though those politics largely seem to have evaded Jack's attention. Jack's identification and fascination with cowboy music establishes a link to American myth and the dreams of a decade that yearned for the freedom of boundless frontiers while established powers did their best to suppress cultural deviance. Jack's life, his persistence today, and the small but vital subculture of his heirs - guys like Tom Russell and Steve Earle - attest to the ornery survival of essential difference in a world that punishes nonconformity",
         "\"Ballad Of Ramblin' Jack Elliott\" (2000) documentary: Wonderful portrait of a '60's era rebel and artist of high gifts who never quit the 60's...and he's 81 years old in 2012. The cult movie titled \"My Dinner With Andre\" (1981) poses the question \"What if the 1960's were the high point of civilization, and it's all downhill after that, from now on?\" Well, maybe it is. People who want to see a portrait of a true 1960's person with the wonderful mentality of those long departed times should see this documentary movie. Ramblin Jack Elliott was (and is...still living at age 81 in 2012 as this is written) a true 1960's person, and was before the 1960's even started. He started his 1960's life in the 1940's when he ran away from home to become a cowboy, and later became the protégé and house mate of Woody Guthrie in Queens (NYC), New York before Woody lost his health. See the Wikipedia biog article about Ramblin Jack Elliott to learn about what is shown in this wonderful documentary, made by his daughter, Aiyanna Elliott. She's a predictably bitchy radical feminist, and so was her mother....no wonder Ramblin Jack spent little time with either of them over the years, and no wonder he apologizes very little for his avoidance, non-presence in their lives. Dreadful women, and the documentary shows that, though that is not supposed to be the point of what is revealed. Jack Elliott is a wonderful person and a gifted artist. This movie shows that. He was part of the 1960's and never left it, never gave up.....is still out there \"doin\" it. I've never seen such a terrific portrait of a 1960's person as in this documentary. Another worth seeing, which shows the same thing (a 60's guy who never left the 1960's, even in his old age) is the documentary titled \"George Harrison: Living In The Material World\" (2011). Neither Elliott nor Harrison were political....both were musicians, primarily, and the music in both docs is wonderful to hear and remember, especially for those who were there for the 1960's and remember it well, and miss it. --------------- Written by Tex Allen, SAG actor. Email Tex at TexAllen@Rocketmail.Com. Information about Tex Allen movie credits, biog facts, and interests at WWW.IMDb.Me/TexAllen.",
         "Until I saw this film, I'd never seen Jack Elliott \"in concert.\" I've seen Dylan, many times; see Arlo Guthrie once a year when he plays Harrisburg, Pa., with his daughter Sara; saw Dave Van Ronk when he played here a couple of years ago with Rosemary Sorrels; never saw Jack Elliott. Until now. And what a concert. No back-up singers; no jazz; no fancy lighting; no special effects. Just Jack Elliott, playing and singing and talking about his life and his times and his adventures, picking away on his guitar for punctuation, singing deep and throaty about where's he's been, who he is and making fun at a lot of ideas about what other people think he means. No apologies; no excuses; a living tribute to what Henry Ford II once said: never complain, never explain. It's hard to believe that this film was made by his daughter. It's a true, genuine, open statement about a man who has lived his life with absolutely no plan in mind about what he would do or say or where his choices would take him or what effect it would have on other people or things, but never hesitated to follow his heart, follow his curiosity, outrun his shadow with every step. Pick up and leave; pick up and go; never look back and never let go. Never stop working, never stop playing, take every breath and every encounter and every day and tell other people about it on a guitar. Invite them in for dinner and some stories while sitting on a barstool. That's Jack Elliott in concert. It almost sounds as if his life has been selfish and self-serving, but this film clearly makes the distinction between living a life of greed, which is what drives selfish people, and having a sense of self, which is what Jack Elliott has worked on and what he devoted himself to and has shared with us through his music. He meant no harm; he has always just been looking. The film evolves into a masterpiece of objectivity despite the potential for the obvious pitfall of a daughter trying to understand her father and asking the whole world to watch with her while she searches. What courage. She's made of the same stuff her father is and this \"road trip\" they took together is made singularly more sweet because they invited all of us along with them. Folk music is all about the stories, recording people and events musically, in common terms and without the frills, just straight up stories. And this film tells a great story and in the telling, has itself become a story. My sons and I are going to a Bob Dylan concert on August 16th. I'm bringing a tape of this film to them to watch before the concert. Music helps us understand who we are, where we've been and where we're headed. Having seen this film, I'm going to listen to Dylan with a whole new set of ears. And I've been listening to him for forty years. This film is an important guidepost in the history of American folk music because it gives us the life's work and \"ramblings\", up front and on a personal level, of a true American folk legend.",
         "This was very informative and enjoyable, but one problem. I would have to agree about the teller getting in the way of the story. But more importantly, Jack's daughter complains about the lifestyle her father lead. One that left a gap in their relationship. The typical he was never there story etc. My problem is the fact that she's making a documentary about this gap. The whole premise is not very genuine. I mean if he was an asshole, and your going to exploit that to further your career, then do that. Rather she complains about him, makes a documentary, to me, that proves otherwise. I guess that if I was upset with my father and the career that he led, I wouldn't showcase the very \"root of the evil.\" Seems like she was trying to make a buck off of her father, and in the process tried to force some, \"my daddy was never there\" story to put herself in it. Which is generally a no, no for directors/writers.",
         "Rambling Jack Elliott could not have earned himself a more fitting nickname. Lord, he was born a rambling man, but a man who rambles too much is a man that you can't pin down. He was a folk singer, a man whose soul could whip up the most heartfelt music you ever heard, yet he never seems to have had a commitment to anything. The documentary \"The Ballad of Ramblin' Jack\" is very much about what kept his career from taking off. Directed and narrated by his daughter Aiyana \u0096 from his fourth marriage \u0096 the film is a personal essay mostly from her point of view about what it was like growing up the child of a man who never seemed to have an organized thought in mind. In his music, as in life he rambled and rambled and rambled. In the 50s and early 60s he came up alongside Woody Guthrie and a budding young singer named Robert Allen Zimmerman (who you know as Bob Dylan). He knew them both well, but somehow those two had a better plan in life and in their music. During a tribute concert for Guthrie following his death in 1967, Dylan was a headliner but Elliott was left off the program. As time went on, he would watch both men become legends, while he became a footnote, seen only as a meager thread between the end of Guthrie and the beginning of Dylan. Reading a review of his own career, Elliott \u0096 still alive at 82 - blows the paper a satisfied raspberry. He was born in Brooklyn in 1931 as Elliott Charles Adnopoz, a doctor's son who ran away from home at an early age to join up with the rodeo. He had a deep passion for the cowboy life and, despite his origins made his own image as the kind of folk singer whose music was the cry of the wounded. He rambled from one thing to the next and just kept right on rambling. That was the problem, the rambles kept him from finding a foothold in the industry. Late in the film, one of his managers laments that \"I respected his talent, but he was too disorganized.\" We can see that early on in a clip from his appearance on The Johnny Cash Show as Elliott befuddles his fellow players \u0096 and even Cash himself \u0096 as he can't quite decide on which key to begin. It's hard to know where to stand with this documentary because you become so fixated on the fact that it was Elliott that killed his own career. He rambled on and rambled on, never finding a place for himself. By the end, you wonder if he liked frustrating those around him, or if his mind blew from one thing to the next just like his music.",
         "The BORJ is a revealing and well told of story of the great Jack Elliott. Jack, a folk/country legend, is a hard one to figure out. The documentary takes you on a tour throughout his life, from his childhood up until the very present. His daughter (who directed this feature) has Jack, family and friends tell his story. The film allows you to judge for yourself what kind of man he really was. A musician, a cowboy, hard traveller and a father. The documentary will help you understand and appreciate his place in music. As a companion to Woody Guthrie to his influence on Bob Dylan. What's nice is nothing is pushed in your face. The viewer is left to reason out for themselves why he distances himself from his family and friends. Although, it's never clear what makes him click as a person or a father you can't help but want to know why. It's a well done film that will have you asking questions and leave you wondering about Jack. I came out of the theater a bit sad but appreciative that there are people in the world like Ramblin' Jack Elliott.",
         "I eagerly started to read the review of Sumland from San Francisco regarding this film and was was turned off two thirds of the way by his biased rambling and criticisms of Elliot's daughter Aiyana...Sumland seems to think women should just \"put up and shut up\" regarding the actions of emotionally immature fathers and husbands who may be charming performer and musicans but lousy family members...Women don't have enough assertiveness , ego, and self esteem to begin with regarding relationships, they are expected to carry all the responsibility for relationships and then are blamed when they fail...Hooray for Aiyana for her candor , honesty, maturity and sensitivity regarding her father...Too bad people like Sumland cant handle the truth and would rather have women sugarcoat the reality of their experiences that excuses poor parenting and spousal behavior....\"If women all told the truth of their experiences, the world would split open\"...Audra Lourde",
         "The man was a fraud and a thief. He stole the music and complete style of Guthrie and sold it as his own. Then another thief and fraud, Dylan, came along and did the same to Ramblin' Jack. Many consider them icons, but they made their bones off of a dying man. Jack was literally full of sh*t. For a supposed trucker, he couldn't even back up his own RV. When asked what he preferred; a truck, a plane, a ship or a skateboard, he should have said \"a horse\", but then he was never a cowboy, though he dressed up like one and was a lifelong baby soft handed cowboy groupie. He claimed to work on a clipper ship and be a big time sailor, but others had to do his work for him. He was a fraud, a clown. He just did his Guthrie imitation and relied on his imaginary rambling b.s. stories to pay for his supper. He could pick the guitar well. But as a man, he was less than dirt. He was an ultimate user. What a douche!",
         "Of general interest due to Ramblin' Jack Elliott's role in creating the archetype of the American folk music hero, given tangible historic expression in his serving as the link between Woody Guthrie and Bob Dylan, specifically, as the model for the latter's original stage persona. Elliott, fashioning himself after, as protégé of, Guthrie, was one of the first to imagine and create the role of the American minstrel from which innumerable others have borrowed and to this day continue to borrow. This film would have been infinitely more interesting without the first-person intrusion of the film maker, Elliott's daughter, who from the start sets out to have that one heart-to-heart with her daddy she never had; she almost makes herself the subject of this film, but who would see it if she were? The daughter-in-search-of-father theme interferes not only with the objectivity of this biography of folk singer Ramblin' Jack Elliott (1931-present), but it disrupts the chronological depiction of events: the film jumps confusingly between recent and distant past to accommodate the daughter's story, which includes redundant home-movie footage of her as a child. Does the world really need one more egocentric female narrative of the parent-that-never-was, of familial \"dysfunction\"? Bookstore shelves and the rolls of indie films are already overfilled with every conceivable variant of this bourgeois American-woman self-preoccupation. This domestic mindset is so pervasive that I suspect its root cause is the feminist parochialism of university writing and film departments in which these women were initially \"empowered.\" And/or is this the self-pitying cultural legacy of psychoanalysis? (Faulkner: \"motherblood with hate loves and cohabits.\") Yes, Ramblin' Jack was a lousy parent, always absent, on the road. Anyone who expected otherwise had to have been totally impervious to who and what he was. The very qualities that make him special, for which he is prized and loved, namely, his unspoiled childlike sense of wonder, the freshness and simplicity of his vision, his offbeat folky genuineness, all arise from the fact that Elliott from the first refused to grow up, that he willfully turned his back on the world of adult responsibility and conventional adult social identities, choosing, instead, to live out the fantasy of the cowboy troubadour, literally running away from his Brooklyn home to join the rodeo at the age of 16. Was this in reaction to the anhedonia of his Jewish parents, the echo of the holocaust in modern America? His mother (we are told) was a driven, unpleasant woman who wanted Jack to be a doctor just like his father, who (we are told) was an aloof workaholic. Elliott Adnopoz--Jack's real name--obviously rebelled against being force fed the conventional American dream, sought instead bohemian outlet in the romanticism of the American frontier, the American West. Unlike Louis Prima: The Wildest, which was redeemed from its adulatory distortions by ample actual footage of its subject performing, this film mercilessly cuts into Ramblin' Jack's performances to editorialize on his failings and vent his daughter's frustrations. Still, because Elliott's life intersected so deeply and so often the currents of American folk and pop music, we are inevitably given a backstage glimpse of that larger, more important drama. His journeys encompassed the cultural suffocation of the Eisenhower years, the skiffle movement and origins of rock music in England, the American folk renaissance of the 60's, and the hippie culture of the West Coast. Alan Lomax, Dave van Ronk, Arlo and sister Nora Guthrie, Odetta, Kris Kristofferson, and Pete Seeger all check in with impressions and recollections of Jack. One could only wish that Aiyana Elliott could have imbued her film with more of her father's casual charm, his gentle whimsiness. The heavy hand of this author makes one appreciate all the more Errol Morris, whose documentaries tell themselves without even the voice of a narrator."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Music"
      ],
      "productionCompanies": [
         "Crawford Communications",
         "Journeyman Pictures",
         "Plantain Films"
      ],
      "summaries": ["With the help of her mother, family, friends, and fellow musicians, Aiyana Elliott reaches for her father, legendary cowboy troubadour, Ramblin' Jack Elliott. She explores who he is and how he got there, working back and forth between archival and contemporary footage. Born in 1932 in Brooklyn, busking through the South and West in the early 50s, a year with Woody Guthrie, six years flatpicking in Europe, a triumphant return to Greenwich Village in the early 60s, mentoring Bob Dylan, then life on the road, from gig to gig, singing and telling stories. A Grammy and the National Medal of Arts await Jack near the end of a long trail. What will Aiyana find for herself?"],
      "budget": 0
   },
   "movielensId": 3880,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-01-26",
      "dvdReleaseDate": "2001-05-08",
      "directors": ["Aiyana Elliott"],
      "runtime": 112,
      "movieId": 3880,
      "title": "The Ballad of Ramblin' Jack",
      "mpaa": "",
      "actors": [
         "Jack Elliott",
         "Arlo Guthrie",
         "Kris Kristofferson",
         "Pete Seeger",
         "Odetta",
         "D.A. Pennebaker",
         "Dave Van Ronk"
      ],
      "imdbMovieId": "0236008",
      "originalTitle": "The Ballad of Ramblin' Jack",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "With the help of her mother, family, friends, and fellow musicians, Aiyana Elliott reaches for her father, legendary cowboy troubadour, Ramblin' Jack Elliott. She explores who he is and how he got there, working back and forth between archival and contemporary footage. Born in 1932 in Brooklyn, busking through the South and West in the early 50s, a year with Woody Guthrie, six years flatpicking in Europe, a triumphant return to Greenwich Village in the early 60s, mentoring Bob Dylan, then life on the road, from gig to gig, singing and telling stories. A Grammy and the National Medal of Arts await Jack near the end of a long trail. What will Aiyana find for herself?",
      "tmdbMovieId": 161687,
      "avgRating": 3.46875,
      "releaseYear": "2000",
      "numRatings": 112,
      "posterPath": "/b52Phx7BrfAOffHgircxhxzK7Og.jpg"
   }
}