{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0168515",
      "video": false,
      "title": "Phish: Bittersweet Motel",
      "recommendations": [],
      "backdrop_path": "/9qHRDKOPNTOysBBaUvtAYKnKvpB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Trey Anastasio",
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040bdd",
               "name": "Trey Anastasio",
               "profile_path": null,
               "id": 94932,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jon Fishman",
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040be1",
               "name": "Jon Fishman",
               "profile_path": null,
               "id": 94933,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Page McConnell",
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040be5",
               "name": "Page McConnell",
               "profile_path": null,
               "id": 94935,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mike Gordon",
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040be9",
               "name": "Mike Gordon",
               "profile_path": null,
               "id": 87279,
               "order": 4
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.39885,
      "production_countries": [],
      "id": 26244,
      "vote_count": 3,
      "budget": 0,
      "overview": "Bittersweet Motel is a documentary about the popular rock band Phish. The film focuses on Phish's music, with little emphasis on their die-hard fan base.",
      "similar": [],
      "original_title": "Phish: Bittersweet Motel",
      "runtime": 82,
      "poster_path": "/d0Pc9CkZwwyyYYQrhkyPgpRUacn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Aviva Entertainment",
         "id": 4472,
         "origin_country": ""
      }],
      "release_date": "2000-08-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Todd Phillips"],
      "runtime": 82,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0168515/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1NTc0MDM2N15BMl5BanBnXkFtZTcwODc4MjMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Trey Anastasio, Jon Fishman, Mike Gordon | See full cast and crew »"],
      "reviews": [
         "This documentary of the travelin' band Phish is above and beyond a lot of \"rockumentaries\" out there. It purports to lend audiences a behind-the-scenes look at the band on tour, and does so as promised. A lot of people have said that they're relieved the documentary didn't focus on the band's somewhat infamous, huge fan base that follows Phish on tour. I agree that the lack of \"fan\" interviews was a refreshing surprise, but was annoyed to find that the few phans they did talk to were complete and utter morons: there was harmonica boy, the horny frat-pack, tripping groupie harassing Trey Anastasio, and lamely objectified nitrous-huffing girl. Ugh. It would've been nice if they'd balanced them out with some thoughtful, intelligent phan commentary. I know these people exist; I myself followed Phish on tour for a short period a year or so before this multi-tour documentary was made. That aside, though, I enjoyed the live concert footage (nice that the filmmakers chose to play most of the songs all the way through, instead of providing lots of mere snippets), the backstage banter (a lot of it gut-wrenchingly funny, at least to me) and the coverage of the group's much ballyhooed European tour. Especially liked that the band had fun with the fact that a documentary was being made of them--gotta love the staged \"accidental\" fellatio going on behind closed doors--despite the fact that they obviously weren't always thrilled to have a camera crew tailing their every move. One caveat: wish Trey hadn't been such a primary focus. I mean, he's entertaining, but so are the other guys. The editing isn't fabulous, but it's good enough. One more thing: Even if you're not a \"phan,\" you'll probably enjoy this film. You may even develop an undiscovered appreciation for Phish's evident creative talent, sense of humor and impressive musical chops. My husband had no real love for Phish before seeing this, and still doesn't really, but was glad he saw it nonetheless. As for folks who dig the band, this documentary is a real gem you'll probably want to get on video when it's released.",
         "A fantastic objective look at the band and subculture surrounding their popularity. Previous non-fan and director Todd Phillips does a surprisingly good job at answering the questions Phish fans are interested in which is simply showing the band behind the scenes being themselves. The Phish fanbase, generally, knows more statics and facts than the band is probably even aware of; Phillips know this and avoids giving it any focus. Phish is not the Sexpistols, or any other band who has been documented that focuses on creating a spectacle; their focus is creating great music if this aspect sounds boring you probably will not enjoy the film. A final note. Although Phillips concentrates on lead guitarist and vocalist Trey Anastatio, his comment on this matter is \"Trey talked the most and provided the most material to work with I couldn't have a movie with a bunch of musicians saying nothing.\" Highly entertaining and worth watching if you have only just heard of Phish. I also highly recommend Gordon's documentary of the band \"Tracking\" short but creative.",
         "Well if you love Phish you really should get this DVD, but you knew that! It has plenty of full length extras on it (PYITE, BBFCFM) and is quite hilarious at times. The complaints that I hear about this movie are sound, however. I didn't like the interviews with the fans, and the songs ARE clipped for time. I don't know why they bothered clipping the songs to make this movie run a lean 84 minutes, in most cases they should have just let them play and made the movie 2+ hours. Everybody is going to have a list of songs that they wish had been included, so I'm not going to complain about certain songs that I believe should definitely be in any Phish movie but were left out. I certainly love this movie and will watch it a hundred times if this first week is any indication of things to come. This thing is worth buying for the killer NYE and Great Went footage alone.",
         "As a huge Phish fan, I obviously loved this movie. It's great to see interviews with the band and to gain their perspectives on things (i.e. How Mike tells Trey he plays too many notes. You can actually see some tension there). As for non-Phish fans, my opinion is that music lovers will appreciate this movie and will like this documentary. Others just won't get it (much like how people feel about Phish's music).",
         "Bittersweet Motel is a well made documentary that follows the band on tour from their 1996 New Year's Eve show in New York City to their two day concert in August of 97, the Great Went which attracted 70,000 fans to Limestone, Maine. The footage was shot at different venues on their American and European tour. It includes live performances and candid backstage action as well as home movie style fun off stage and personal interviews about their music. A lot of the film is lighthearted, not because the subject isn't taken seriously but because these guys are just fun people. There are plenty of parts which will make you laugh out loud. Todd Phillips wisely keeps the focus on the band and their music and doesn't focus much attention on the horde of fans which follow the band from show to show. A lot of media coverage often centers around their fans, so it is refreshing to see more of an emphasis on the music and the guys that create it. There are many candid scenes of them discussing their music, whether it be criticizing or praising a set minutes after leaving the stage or analyzing a song. We are also given a peek at the band on a smaller backstage setup rehearsing songs right before going on stage to perform them. The only complaint that I have about the film is that much of the coverage centers around Trey Anastasio, the lead singer and guitarist. While this was interesting and entertaining, I would've liked to have seen more of a balance of coverage of the other band members in interviews. To Todd Phillips credit, the lack of balance may be because of their shyness or disinterest in the making of the film. Trey was obviously a lot more out-going and enthusiastic about appearing on camera than the other band members. As a fan, I believe this film discusses things that fans have always wondered about. This documentary is exactly what many fans have wanted to see for years. Whether this film will appeal to non-fans, I don't know. But I don't think they will watch it anyway.",
         "This documentary is a disaster. Badly shot, sloppily edited, full of cliches, without any semblance of story development... everything that gives rock documentaries a bad name. Phish come across as a bunch of 40-ish nerds who could just as easily be writing code in some computer lab as playing music. We learn nothing about who they are, what drives them, or why we should give a **it. Nothing happens in this film except a bunch of shows, rehearsals and allegedly funny antics by obviously bored band members."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Aviva Entertainment",
         "Bittersweet Films",
         "Little Villa Features"
      ],
      "summaries": [
         "This film follows the band, Phish, through a year of its life; from the Great Went concert in Limestone, ME in August 1997 through the subsequent touring in the next year, leading up to August 1998. The director, Todd Phillips, said, \"We weren't looking to make 'Tie-Dyed'; I wanted to concentrate on the music.\"",
         "Bittersweet Motel is a documentary about the popular rock band Phish. The film focuses on Phish's music, with little emphasis on their die-hard fan base."
      ],
      "budget": 0
   },
   "movielensId": 3881,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-25",
      "dvdReleaseDate": "2001-03-06",
      "directors": [""],
      "runtime": 82,
      "movieId": 3881,
      "title": "Phish: Bittersweet Motel",
      "mpaa": "",
      "actors": [
         "Trey Anastasio",
         "Jon Fishman",
         "Page McConnell",
         "Mike Gordon"
      ],
      "imdbMovieId": "0168515",
      "originalTitle": "Phish: Bittersweet Motel",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Bittersweet Motel is a documentary about the popular rock band Phish. The film focuses on Phish's music, with little emphasis on their die-hard fan base.",
      "tmdbMovieId": 26244,
      "avgRating": 3.58451,
      "releaseYear": "2000",
      "numRatings": 71,
      "posterPath": "/d0Pc9CkZwwyyYYQrhkyPgpRUacn.jpg"
   }
}