{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0162903",
      "video": false,
      "title": "Catfish in Black Bean Sauce",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Dwayne Williams / Sap",
               "gender": 0,
               "credit_id": "57cbc063c3a3685a53009feb",
               "name": "Chi Muoi Lo",
               "profile_path": "/mlBxR3PuzUappuaIvKv9ebgOebo.jpg",
               "id": 554095,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Nina",
               "gender": 1,
               "credit_id": "57cbc0769251413514009542",
               "name": "Sanaa Lathan",
               "profile_path": "/pnLeXOKrKquzk0R9cp1lpDKoEZP.jpg",
               "id": 5411,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Harold Williams",
               "gender": 2,
               "credit_id": "57cbc08692514141db0013fa",
               "name": "Paul Winfield",
               "profile_path": "/6FuLfJh70aDUxggFuPC2oID5Mjg.jpg",
               "id": 1818,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Dolores Williams",
               "gender": 1,
               "credit_id": "57cbc097925141640f0063b7",
               "name": "Mary Alice",
               "profile_path": "/2h20nF8gvhqhgVDV6Lru55dKB44.jpg",
               "id": 9572,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Mai",
               "gender": 1,
               "credit_id": "57cbc0acc3a3686747006201",
               "name": "Lauren Tom",
               "profile_path": "/oXU7sZOTjlALqz3UYYi2sWBAYAl.jpg",
               "id": 15100,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Thanh",
               "gender": 1,
               "credit_id": "57cbc0bcc3a3680a140012b7",
               "name": "Kiều Chinh",
               "profile_path": "/eD7lWMHtl0qEFifAEf907GDnAkW.jpg",
               "id": 143432,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Michael",
               "gender": 2,
               "credit_id": "57cbc0cfc3a3686744006414",
               "name": "Tyler Christopher",
               "profile_path": "/5WilIxQaVGOoXD3OUTwYUnikSLK.jpg",
               "id": 154575,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Vinh",
               "gender": 2,
               "credit_id": "57cbc0de925141357d009969",
               "name": "Tzi Ma",
               "profile_path": "/zlaSI3VFHl1KsnrFWdwfrTCNgAo.jpg",
               "id": 21629,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "James",
               "gender": 2,
               "credit_id": "57cbc0f3c3a368674400641e",
               "name": "George Wallace",
               "profile_path": "/dlELhZZSyzTXY7IVkFzwwcfMlFU.jpg",
               "id": 552139,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57cbc108c3a3680a5800134d",
               "name": "Chi Muoi Lo",
               "profile_path": "/mlBxR3PuzUappuaIvKv9ebgOebo.jpg",
               "id": 554095,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57cbc11dc3a3680a58001353",
               "name": "Chi Muoi Lo",
               "profile_path": "/mlBxR3PuzUappuaIvKv9ebgOebo.jpg",
               "id": 554095,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57cbc139c3a3685c25009e8f",
               "name": "Chi Muoi Lo",
               "profile_path": "/mlBxR3PuzUappuaIvKv9ebgOebo.jpg",
               "id": 554095,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57cbc153925141420e001413",
               "name": "Stanley Yung",
               "profile_path": null,
               "id": 102696,
               "department": "Production",
               "job": "Co-Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.080489,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 287821,
      "vote_count": 0,
      "budget": 0,
      "overview": "An African American couple (Winfield and Alice) adopt two orphans from a Vietnamese refugee camp. After twenty-two years, the children are reunited with their birth mother, bringing deeply submerged resentments and misconceptions to the surface and forcing the characters to reexamine their identity and relationships in both comical and poignant situations.",
      "similar": [],
      "original_title": "Catfish in Black Bean Sauce",
      "runtime": 119,
      "poster_path": "/km8JY33LNxByT0CWxOimXigSv27.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Black Hawk Entertainment",
         "id": 81025,
         "origin_country": ""
      }],
      "release_date": "2000-06-09",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chi Muoi Lo"],
      "runtime": 119,
      "synopsis": null,
      "writers": ["Chi Muoi Lo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0162903/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNzQ3OTg4NV5BMl5BanBnXkFtZTcwNTIxNjQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Chi Muoi Lo, Sanaa Lathan, Paul Winfield | See full cast and crew »"],
      "reviews": [
         "Catfish is a delightful independent film that allows its audience to experience both emotional extremes from laughter to tears. The story is about a childless African American couple (Harold and Delores Williams) who have adopted and successfully reared two Vietnamese children. The couple wonderfully played by Mary Alice and Paul Winfield bring their many years of rich believable acting experience to the screen. The son Dwayne played by writer/director Chi Moui Lo has fully assimilated in the African American culture with his adoptive parents and is dating the lovely Nina played by Sanaa Lathan. The daughter Mai played by Lauren Tom has not assimilated and is seeking to fulfill her inner emptiness by finding her Vietnamese mother. The story line begins with Dwayne comedically trying to find a means to ask the beautiful but less than romantic Nina to marry him. During a cookout at his parents Dwayne fumbles through a public marriage proposal to Nina that is followed by Mai's announcement that she has found their birth mother and is bringing her to America. The plot thickens, as Delores Williams must come to grips with her motherhood as she faces the possibility of losing Mai whom she has never been emotionally close to as well as her beloved Dwayne. Each character of the movie is poignantly forced to reexamine their own identity as well as his / her heartstring relationships with others when the Vietnamese birth mother Thanh played by Kieu Chinh brings her overbearing opinionated personality to the apparently stable extended family. Thanh basically steps in on anybody to gain the control of the motherhood to her children that she has lost the past 20 years. She seeks to win the affections of Dwayne as well as break off his engagement to Nina because she feels she has lost him both affectionately and culturally, but she disrespects and rudely ignores the needy Mai whom she feels she has already won over. Choi as director somewhat effectively uses flash backs to the past and imaginary images of the future to bring us the audience into what is going on in his head. A weird comedic subplot is somewhat developed between Dwayne and his roommate who is dating a transsexual male. This and all of the other conflicts are drawn together into one big catfight between Thanh and Delores. Each person must choose sides or loyalties during and following the fight. The most touching moment for me in the film was the reconciliation between Delores and Mai which is precipitated through their mutual love for Harold and his well being. (A tearjerker moment) Alls well that ends well, each character handles their conflict and comes to grips with what true love and family is all about. Overall I must say that the movie was worth the $5.50 I paid. I didn't get bored or go to sleep even though the audience consisted of me and one other person. We both commented at the end that it was a pretty good movie. For the, Sanaa Lathan fans, we again have her playing the girlfriend, of the main character and she does get respectable screen time. Nina the character she plays in this film does not have much depth or real earth shattering dialogue. Nevertheless Sanaa works with what she has very well. You get the down home naturally beautiful Sanaa that looks good in jeans and tennis shoes or anything else she chooses to wear, to me it always looks respectful and appropriate for her body style. She is tasked to play a hard working, not so touchy feely romantic but committed girlfriend for the self-esteem lacking Dwayne. He loves her but can't seem to understand what such a beautiful woman could want with a short man such as himself. (The farce is I was wondering the same thing) His self-doubt and conflicts with his mother leads him to break off the engagement with Nina. The breakup occurs as Nina has tried to adjust her romantic style and be more attentive to Dwayne based on a sly Thanh prompted remark made by Mai. Maybe it's the feistiness that she plays so well that I was looking for. Sanaa seems to have a lot of energy and passion; it appears to me that she never really personally connected with this character although she does not flub the role. Sanaa's strong black woman roles in the Love and Basketball, Best Man and even Drive in which she is not allowed to shed tears over a man (especially in his presence) on screen although her heart is visibly in conflict is a different type from this character. This character gets to cry on screen, which Sanaa handles immaculately but I just did not feel that can of passion that she can open up so well during those scenes. As always I enjoyed watching Sanaa on the big screen and when I get a chance I will go back to catch what I missed the first time about Catfish in Black Bean Sauce. 3 1/2 stars out of 5. DLF",
         "This a very, very impressive independent film. The story is funny, painful and moving. The characters are extremely well-written and three-dimensional. The ensemble acting is quite amazing; this film has the best casting I've seen in a while, even the smallest parts! I was upset that it had to end. 8/10.",
         "Paul Winfield and Mary Alice together -- what a pairing! That's worth the ticket already. Good for Chi Muoi Lo, thank goodness to his perseverance and passion, we get to see his fruit of labor and love: CATFISH IN BLACK BEAN SAUCE. The ingredients are strong emotional (and controversial) subjects. What an ensemble cast, including himself in the center of this multi-layered drama. It may feel like he packed it all in, yet we get to taste and soak it all. Bold strokes for a first time filmmaker, Chi Muoi Lo, who produced (practically with the help of the whole Lo family as indicated in the credit roll), wrote the script, directed the film, and performed in it as the central character, the adopted Vietnamese son Dwayne. Wonderful strong cast with Mary Alice and Paul Winfield as Dolores and Harold, the kind-hearted adoptive couple who took in his sister along with Dwayne. Lauren Tom, as Dwayne's Vietnamese sister Mai, gave a steady restrained performance, especially a critical scene shared with Mary Alice -- the intensity, the dramatic charge built up between the two women -- sensitive anticipatory confrontation yet tear-jerking all together. Story is told in current times, fantasy-dream mode, and childhood flashbacks. At times scenes may seem like cliché, yet we laughed, we're anxious, we smiled with empathy, and we're hooked into the whirl of it all. There's also Sanaa Lathan (of \"Love and Basketball\" 2000) as Mia, the lovely yet hesitant girl friend whom Dwayne was courting -- yes, romance included. It's a spicy dish -- a real mix of various types and levels of relationships: mother-son, mother-daughter, brother-sister, Asian-Black, husband-wife, roommates, in-laws, young loves -- diversity filled to the brim and steaming hot! Warmth and conflicts, misforgivings and forgivings, a lot of heart! See it to taste it.",
         "I won't waste a lot of time going over the whole plot of this film, as it has already been done numerous times. Basically, just a nice, sometimes funny, sometimes serious little film that I just couldn't bring myself to turn away from. Check it out, don't shy away from a film just because movie citics give it \"2 thumbs down\"!! That's the ones I have to see. Good movie here.",
         "I loved this movie, thought it was hilarious. If you are looking for something truly deep this is not the one. I enjoyed the fact that it wasn't another black man and white woman or the reverse. It was good to see other cultural relationships which do exist in the real world. I also enjoyed the relationship with Dwayne and his (black) mother. It would have been nice if the relationship between the (black) mother and daughter were explored a little more but that's not what the film was about. Didn't know director was from Philly would support anything he does since he's from my home town. Hope the director does something else soon.",
         "This independent movie is not only funny, but also very moving. It's rare that at a time which only blood and gore horror movies dominate that we get a good movie like this. The relationship between the characters and their emotional states are very well reflected. Surprisingly, the acting of all of the actors besides from the well known ones were very natural and believable. Definitely a great performance by Paul Winfield. The struggles between traditionalism, pressure from traditional parents, and pop-culture were told very well. I highly recommend this feel good movie. I can almost say a great family movie but I don't know if I should say that with the presence of a transvestite in it. Definitely worth watching at least once. I guarantee that you'll be wanting to show this movie to friends and family too.",
         "I enjoyed this movie because of its positive depiction of Asian and African Americans in close relationships. A romantic story between and Asian man and a Black woman is almost never seen. The movie also addressed the problems that can arise when adopted children seek out their natural parents. I find it interesting that it is almost always daughters that do this. The story was touching, especially the resolution of the rift between Mai and Dee, the black woman who had raised her and loved her. This movie was also very funny. It's a shame that it received such little publicity. I wish there were more like it. Hopefully the director/writer will produce more movies in this vein. I recommend it highly.",
         "I watched this movie last night on the Black Stars channel, after being attracted to it by the story summary about two Vietnamese people being raised by a black couple. I really did not expect a lot from the movie and had planned to switch channels after the first few minutes. Let me just say that I ended up not switching the channels at all. I think that the director/writer has the role of the domineering Vietnamese mother down pat. I felt that his \"serious\" storyline, the conflict that the Vietnamese brother and sister felt between the black couple who raised them and their newly found mother who abandoned them was great. I felt that his \"comedic\" storyline, the Vietnamese brother trying to act like a \"brother\" and his roomate dating a transgender male was silly. Overall, I think that this is a must see, especially for people who are from a different culture. It is important to see that if you are raised by loving and caring people, it does not matter if they look different from you. ps. If you can understand Vietnamese, the movie is a whole lot funnier than the Vietnamese \"brother\" or transgender jokes.",
         "Little known Indie feature, with excellent cast story and acting! The drama is intense and heartfelt and the comedy is fall-on-the-floor laughter. The story has subplots, including one gay themed, but the main story is gripping, about a Vietnamese refugee being adopted by an African American family. As an adult she has her birth mother come to the U.S., and then it gets very interesting. It takes an incredible film to have you sobbing incessantly in one scene and then you are laughing uncontrollably in the next.",
         "I would like to thank Chi Moui Lo for making this movie. I think he is amazingly talented, and I am greatful. This movie made laugh and almost cry. It reminds me a little of my own circumstances, so I could relate real well. I look forward to more great movies by Mr. Chi Moui Lo."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Black Hawk Entertainment"],
      "summaries": ["Dwayne and his older sister Mai are adults: Mai is married to Vinh, Dwayne is about to propose to Nina. Twenty-two years ago, when Mai was 10, she and Dwayne were refugees in Vietnam, adopted by Harold and Dee Williams, African-Americans from Los Angeles. Now, they remain close, especially Dwayne and his parents. Mai drops a bomb: she's located their birth mother, Thahn, and she's flying her to LA. Dee takes the news hard: she sees herself being replaced. Harold is more sanguine, and Dwayne pretends to be indifferent. When Thahn arrives, tensions reach the breaking point between Mai and Dee, between Nina and Dwayne, and even between Dee and Harold. Can we all get along?"],
      "budget": 0
   },
   "movielensId": 3883,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-06-09",
      "dvdReleaseDate": "2001-09-18",
      "directors": ["Chi Muoi Lo"],
      "runtime": 119,
      "movieId": 3883,
      "title": "Catfish in Black Bean Sauce",
      "mpaa": "",
      "actors": [
         "Chi Muoi Lo",
         "Sanaa Lathan",
         "Paul Winfield",
         "Mary Alice",
         "Lauren Tom",
         "Kiều Chinh",
         "Tyler Christopher",
         "Tzi Ma",
         "George Wallace"
      ],
      "imdbMovieId": "0162903",
      "originalTitle": "Catfish in Black Bean Sauce",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An African American couple (Winfield and Alice) adopt two orphans from a Vietnamese refugee camp. After twenty-two years, the children are reunited with their birth mother, bringing deeply submerged resentments and misconceptions to the surface and forcing the characters to reexamine their identity and relationships in both comical and poignant situations.",
      "tmdbMovieId": 287821,
      "avgRating": 2.70161,
      "releaseYear": "2000",
      "numRatings": 62,
      "posterPath": "/km8JY33LNxByT0CWxOimXigSv27.jpg"
   }
}