{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0198386",
      "video": false,
      "title": "The Crew",
      "recommendations": [
         56965,
         29854,
         112687,
         32100,
         449751,
         55863,
         30302,
         44941,
         385371,
         29889,
         37598,
         163848,
         84209,
         92272,
         370301,
         52471,
         32005,
         27895
      ],
      "backdrop_path": "/pnCURIGx9R0fXqAcNK9qK3P5c7I.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bobby Bartellemeo / Narrator",
               "gender": 2,
               "credit_id": "52fe47be9251416c750a419f",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joey 'Bats' Pistella",
               "gender": 2,
               "credit_id": "52fe47be9251416c750a41a3",
               "name": "Burt Reynolds",
               "profile_path": "/g5AyPAhdr5OtHVRGLD3i8Gw4oas.jpg",
               "id": 16475,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mike 'The Brick' Donatelli",
               "gender": 2,
               "credit_id": "52fe47be9251416c750a41a7",
               "name": "Dan Hedaya",
               "profile_path": "/5E4SUVfLMUKNCiP0dMhyOv3XHVZ.jpg",
               "id": 6486,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tony 'Mouth' Donato",
               "gender": 2,
               "credit_id": "52fe47be9251416c750a41ab",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Detective Olivia Neal",
               "gender": 1,
               "credit_id": "52fe47be9251416c750a41af",
               "name": "Carrie-Anne Moss",
               "profile_path": "/6gk8GmlfjW8ONS19KMeISp8Cqxf.jpg",
               "id": 530,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ferris 'aka Maureen' Lowenstein",
               "gender": 1,
               "credit_id": "52fe47be9251416c750a41b3",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Pepper Lowenstein",
               "gender": 1,
               "credit_id": "52fe47be9251416c750a41b7",
               "name": "Lainie Kazan",
               "profile_path": "/qI20obSkCyWbo13xh20rWeUuMXp.jpg",
               "id": 53647,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Raul Ventana, Drug Lord",
               "gender": 2,
               "credit_id": "52fe47be9251416c750a41bb",
               "name": "Miguel Sandoval",
               "profile_path": "/x0mn76606kpJtzzl0B2nfJlZXkE.jpg",
               "id": 30488,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Det. Steve Menteer",
               "gender": 2,
               "credit_id": "52fe47be9251416c750a41bf",
               "name": "Jeremy Piven",
               "profile_path": "/qtho4ZUcValnVvscTGgyWfUr4VP.jpg",
               "id": 12799,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Young Bobby Bartellemeo",
               "gender": 2,
               "credit_id": "52fe47bf9251416c750a41c3",
               "name": "Casey Siemaszko",
               "profile_path": "/kW2A2OrOMnlU7FoVDFbFmZJIUa8.jpg",
               "id": 1953,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Young Joey 'Bats' Pistella",
               "gender": 2,
               "credit_id": "52fe47bf9251416c750a41c7",
               "name": "Matt Borlenghi",
               "profile_path": "/vmZFbUiP6BeRxaeycLkX4Zfed8V.jpg",
               "id": 84163,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Young Tony 'Mouth' Donato",
               "gender": 2,
               "credit_id": "52fe47bf9251416c750a41cb",
               "name": "Billy Jayne",
               "profile_path": "/4vPd7Pw1F2pLlDp8dKVZfzxwl8t.jpg",
               "id": 84164,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Young Mike 'The Brick' Donatelli",
               "gender": 2,
               "credit_id": "52fe47bf9251416c750a41cf",
               "name": "Jeremy Ratchford",
               "profile_path": "/fzzVrrOw00lWlqJs4dBSD8gJGZg.jpg",
               "id": 44205,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47bf9251416c750a41d5",
               "name": "Michael Dinner",
               "profile_path": "/v6WBnSPVNMCO99mnCirUFn4ajRR.jpg",
               "id": 84165,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47bf9251416c750a41db",
               "name": "Michael Dinner",
               "profile_path": "/v6WBnSPVNMCO99mnCirUFn4ajRR.jpg",
               "id": 84165,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.94551,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19150,
      "vote_count": 13,
      "budget": 0,
      "overview": "Four retired mobsters plan one last crime to save their retirement home.",
      "similar": [],
      "original_title": "The Crew",
      "runtime": 88,
      "poster_path": "/kcs40jP5bCOwmptlN2e7RBHViTH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "2000-08-21",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Dinner"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Barry Fanaro"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0198386/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NDA2NTY2MV5BMl5BanBnXkFtZTcwNjg2MjIyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Dreyfuss, Burt Reynolds, Dan Hedaya | See full cast and crew »"],
      "reviews": [
         "A plot that takes an unusual and comical look at what would normally be the darker side of society, with retired mobsters, detectives, hookers and bungling drug lords coming together in a storyline that takes all the cliches and presents them in a new and refreshing manner. I've watched this movie several times - I think it's well written and acted, with some great characters, the casting is excellent as is the soundtrack. Not a great classic, but I don't think it's trying to be, just a hugely entertaining movie - I'm sure the actors enjoyed making it.",
         "I don't think this movie was given enough of a chance. The cast alone is worth watching the movie for (Jennifer Tilly is one of my favorites; the cast also includes Burt Reynolds, Richard Dreyfuss, Jeremy Piven and Carrie Anne Moss. The jokes are cute and clever, and although it doesn't have the clever wit of a Tarantino, it's still well-timed and hilarious. I'd never heard of this movie and happened to see it on TV. Now, I'm a hard sell, and I laughed my ass off through half the movie and smiled at the sweet, fairy tale ending that leaves everyone walking away from the movie with warm fuzzies. And it's not just some mushy piece of sap; it's about old wise guys, so there are plenty of geriatric fist fights and pee jokes for the guys (and for those of us females who appreciate gentle toilet humor too, like me). So give this movie a chance, is all I'm saying, and I think you'll be pleasantly surprised.",
         "I was positively intrigued to see such a wide divergence of opinion on this flick; I can't recall ever seeing such a split opinion in this space. Therefore I will offer the moderate observation that, while being far from the cleverest comedy I've seen, the movie isn't all that bad. The script is not a particularly witty effort, but the tangled web that these 4 retired hoods spin for themselves becomes progressively more intriguing. (I would note that the arson technique portrayed must be taken with about a pound of salt) The sentimental sub-plot about the missing daughter is unnecessary and dilutes the comedy (though, mercifully it's not played up very big). Altogether, not a cause for raves, but not as bad as some here say.",
         "Maybe because I \"AM\" over 50 I enjoyed the Crew. I cant say. But the music was good too. I came home and did a search on Napster for Joe Pesci's \"Old Man Time\". Good song. Check it out. People are used to complicated stories and special effects. They cant just sit and be entertained anymore. Which is what this movie is-entertainment. I enjoyed it. 7 out of 10 stars I would say.",
         "So much promise, yet so little achievement was the enduring impression left on me after watching this comedy. A group of ageing ex-con artists conjure an imaginative, yet flawed plot to save their Miami retirement home from soaring rents by using the body of a dead neighbour to scare away potential residents. When the dead man's son (Sandoval) emerges to take vengeance on those responsible for his death, they use their collective criminal experience to dodge the attempted retributions. Dreyfuss, Reynolds, Cassel and Hedaya probably weren't quite old enough to convince me that they were geriatrics, relying on props to affect the age (hearing aids etc) although Reynolds did a great impression of someone who'd lost his marbles. His near-death epiphanies lead to several hair-brained schemes while Dreyfuss' main angle is assisting the local police investigating the death, the female detective (Moss) unaware the she is his daughter. She mistakes his kindly advances as those of a dirty old man, while Dreyfuss is trying to work out how to confess to the ruse, and still reconcile with the daughter neither knew existed. Moss is stunning and it's almost inconceivable that the Pivster (Piven) is both her detective partner and boyfriend from whom she's estranged. Must be low self esteem... Slapstick, sentimental comedy has its moments and an appealing cast but never quite hit the notes I was expecting, all things considered. Easy, lightweight viewing.",
         "Mob film affectionados will appreciate this film if only that it adds a new perspective to an old theme. There are several cleverly orchestrated scenes which spoof other classic mobster films, giving viewers something more than simple comedy to get them laughing. Richard Dreyfuss was not entirely convincing as a retired 'wiseguy'; he doesn't really fit the part somehow. The storyline may have been improbable at times, and dragged a little on a few occasions, but for the most part it holds one's attention until the very end. It really makes one wonder; what does happen to all those old \"made\" guys if they happen to live to retirement age?",
         "Wanna see something fun with no blood, no hidden agenda, just humor? It's a lotta fun. It's not adolescent glee -- don't expect Mike Myers. But it's not short on entertainment value. Four old retired wise guys are forced back into the \"business\" for reasons beyond their control. Sometimes it's a bit formulaic, but it's always entertaining. I'll see it again.",
         "There are good parts and there are bad parts in \"The Crew.\" The good stuff is that all four geezers in the movie are consistently amusing, Jennifer Tilly has never looked better (maybe her cleavage has something to do with that), it's good to see Carrie-Anne Moss in something other than \"The Matrix,\" and the general level of humor is funny even though we've seen it a million times. On the bad side, it's much too short to make a lasting impact, poor Jeremy Piven is stuck in a thankless role, too many jokes are aimed at the same target, and too much time passes between major gut-busters. Still, Richard Dreyfuss and Burt Reynolds get their share of laughs, even though the cleavage gets all the attention.",
         "This is a totally fun movie for me, for several reasons. I actually like all the actors, and I have a long history with one in particular. Back in the 1960s Lainie Kazan was a top singer in the same category as Barbra Streisand, and I was able to hear her live in concert at Purdue University in the late 1960s. Since then she has shown us she is one of the best actresses her age, no matter what age she was, and she is great in this somewhat dark comedy. It starts in 1968 when \"the crew\" of four wise guys in the New York area are committing one of their crimes. After about 5 minutes of that it cuts to 2000 in the South Miami area where the four are semi- retired and living in an apartment complex with an ocean view. The script is funny and one scene with a rat (described after the SPOILERS below) is one of the most inventive comedic scenes I have ever seen. The crew really are trying to be retired but because their location has become desirable, and they are threatened with rent doubling, they hatch a plan. One of the crew works as an undertaker and they figure if they get an unidentified body and blow its head off in the lobby then their location will become undesirable and with people moving out they might even get a reduction in rent. It works, but one of the crew, the usually silent one, blabs to a hooker and she threatens to expose them unless they do a job for her. Then the south American drug mob gets involved and what follows is a series of funny escapades. I am surprised at this movie's low IMDb rating, I found it to be a very entertaining movie. SPOILERS: The crew are asked to kill the hooker's wealthy stepmom (Kazan) but they don't want to so instead they get a skeleton, kidnap the lady, put her wristwatch on the skeleton, burn down her mansion to spare her but make it look like she was killed. They use a rat, tie a long fabric fuse to its tail and release it into the house where, as it goes through various walls starts fires all along the way. But it gets spooked by the fires and heads outside, to the house next door which is the south American drug lord's, sets his house on fire and it burns down also. A detail makes it even funnier, we see them outside at night in the front lawn as the rat pulling a burning fuse scampers towards the house in the background. A really fine, comedic detail.",
         "An action film in which old timers, ex baby boomers and other senior citizens who are more or less trying to live in various varicose-infected institutions can project themselves and identify with the main heroes who are just the same as them, old timers who are more or less trying to survive and have some fun in a fun-less varicose-cursed institution in Florida. A touch of Jewish-ness, a dose of sexual fascination, a couple of pairs of boobs, a lot of denuded breasts and chests, but no more than that, a little star of a dumb drug lord who is trying to shine in a world where all the sunshine has retired, and you have it. A funny film for an afternoon of enjoyment at the old people's home as an alternative to checkers or bridge. It is true there are some funny elements, like the arsonist rat or the real true skeleton of the lady next door burned in the arson of her house and that carries the dog tag of her little identity, made in Taiwan. Enjoy it and don't expect to remember it one hour later, except if you already have Parkinson's or Alzheimer's. Then the recollection would come from the back of your brain. Dr Jacques COULARDEAU, University Paris Dauphine, University Paris 1 Pantheon Sorbonne & University Versailles Saint Quentin en Yvelines"
      ],
      "genres": [
         "Crime",
         "Comedy"
      ],
      "productionCompanies": [
         "George Litto Productions",
         "Sonnenfeld Josephson Worldwide Entertainment",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Four former made men, struggling to get by in a rundown Miami hotel, come up with a plot to drive out all of the young tenants that are slowly taking over the beach-front hotel and driving up their rent. Taking a man that was found dead on the beach, they arrange what appears to a mob hit and provide a note that says more killings are to occur. Unfortunately the old man they use turns out to be the senile father of a drug lord. The drug lord declares war on the killers of his father, thinking it was an action of his enemies. A stripper learns of the old men's involvement and threatens to squeal on them unless they kill her stepmother. Meanwhile, one man searches for his long-lost daughter, who is the investigating police officer, trying to divest herself from her crumb fellow officer and former boyfriend.",
         "Four retired mobsters plan one last crime to save their retirement home."
      ],
      "budget": 23000000
   },
   "movielensId": 3884,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2000-08-21",
      "dvdReleaseDate": "2001-03-13",
      "directors": ["Michael Dinner"],
      "runtime": 88,
      "movieId": 3884,
      "title": "The Crew",
      "mpaa": "",
      "actors": [
         "Richard Dreyfuss",
         "Burt Reynolds",
         "Dan Hedaya",
         "Seymour Cassel",
         "Carrie-Anne Moss",
         "Jennifer Tilly",
         "Lainie Kazan",
         "Miguel Sandoval",
         "Jeremy Piven",
         "Casey Siemaszko",
         "Matt Borlenghi",
         "Billy Jayne",
         "Jeremy Ratchford"
      ],
      "imdbMovieId": "0198386",
      "originalTitle": "The Crew",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["RalfvRfCIp8"],
      "plotSummary": "Four retired mobsters plan one last crime to save their retirement home.",
      "tmdbMovieId": 19150,
      "avgRating": 2.3403,
      "releaseYear": "2000",
      "numRatings": 263,
      "posterPath": "/kcs40jP5bCOwmptlN2e7RBHViTH.jpg"
   }
}