{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0234137",
      "video": false,
      "title": "Love & Sex",
      "recommendations": [
         18408,
         78051,
         19033,
         31633,
         73329,
         39806,
         39424,
         14167,
         91930,
         15534,
         41661,
         18620,
         78406,
         169068,
         29825,
         121652,
         39497,
         16890,
         82520,
         80919
      ],
      "backdrop_path": "/ybQMYglXC3v7EobvTpjiLglCJhW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Kate Welles",
               "gender": 1,
               "credit_id": "52fe44b9c3a368484e0335fb",
               "name": "Famke Janssen",
               "profile_path": "/9wHWq6Mnfpn8L1diMxjr26ReZWl.jpg",
               "id": 10696,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Adam Levy",
               "gender": 2,
               "credit_id": "52fe44b9c3a368484e0335ff",
               "name": "Jon Favreau",
               "profile_path": "/sJSGJwGa3hjMlJNUCxF7wQwo7fb.jpg",
               "id": 15277,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Eric",
               "gender": 2,
               "credit_id": "52fe44b9c3a368484e033603",
               "name": "Noah Emmerich",
               "profile_path": "/iTPoDQq2R5zU17hRwLtWkm2gCmK.jpg",
               "id": 11315,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Monique Steinbacher",
               "gender": 1,
               "credit_id": "52fe44b9c3a368484e033607",
               "name": "Ann Magnuson",
               "profile_path": "/ry9H1u1GFbwXiWWolYA63pjBctp.jpg",
               "id": 37042,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe44b9c3a368484e03360b",
               "name": "Cheri Oteri",
               "profile_path": "/1j7zUQberFkZ6YVMzG3b7nkajaQ.jpg",
               "id": 60252,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Joey Santino",
               "gender": 2,
               "credit_id": "52fe44b9c3a368484e03360f",
               "name": "Josh Hopkins",
               "profile_path": "/4FF6p6G6SAUDJcfOx6GSFQrfTfq.jpg",
               "id": 31532,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gerard Boussard",
               "gender": 2,
               "credit_id": "52fe44b9c3a368484e033613",
               "name": "Robert Knepper",
               "profile_path": "/w40AttR4OPQvjYyTVanq5Rm5iOb.jpg",
               "id": 17343,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "9-Year-Old Bobby",
               "gender": 2,
               "credit_id": "5980e66492514151e0002c7d",
               "name": "Will Rothhaar",
               "profile_path": "/xWcCuxFOrFNhrWM2eUqGjI8kL13.jpg",
               "id": 149484,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44b9c3a368484e0335f1",
               "name": "Valerie Breiman",
               "profile_path": "/uJFnUHB265pnaNVrPqUkC2s3Ln0.jpg",
               "id": 84211,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44b9c3a368484e0335f7",
               "name": "Valerie Breiman",
               "profile_path": "/uJFnUHB265pnaNVrPqUkC2s3Ln0.jpg",
               "id": 84211,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.242727,
      "production_countries": [],
      "id": 25128,
      "vote_count": 29,
      "budget": 0,
      "overview": "When her rather explicit copy is rejected, magazine journalist Kate is asked by her editor to come up with an article on loving relationships instead, and to do so by the end of the day. This gets Kate thinking back over her own various experiences, and to wondering if she is in much of a position to write on the subject.",
      "similar": [
         11421,
         376660,
         112160,
         376867,
         244772,
         258480,
         36040,
         43923,
         12793,
         45153,
         27586,
         8272,
         10735,
         8967,
         598,
         773,
         858,
         14,
         11216,
         141
      ],
      "original_title": "Love & Sex",
      "runtime": 82,
      "poster_path": "/hw4vNzlaiMqSRrlVumKf6ifVI33.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [],
      "release_date": "2000-01-24",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Valerie Breiman"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Valerie Breiman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0234137/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExNTE2MjA5MV5BMl5BanBnXkFtZTYwMTkwMzg5._V1_SY216_CR40,0,214,216_AL_.jpg",
      "actors": ["Stars: Famke Janssen, Jon Favreau, Noah Emmerich | See full cast and crew »"],
      "reviews": [
         "\"Sex and Love\" is one of my favorite romantic comedies of recent vintage. It may in fact be may favorite. It is from a decidedly 30 something, as opposed to 20 something, point of view. There is no question that that helps define its sub-genre, and its maturity. I adore (and lust after) Framke Janssen, and deeply respect Jon Favreau. I was introduced to both by this movie. I have since gone looking for both in other films -- and have been rewarded in that quest. This film does indeed dispense with the sex wars stereotypes of the moment and deal with two individual characters. At the same time, neither is the polar opposite of the sex stereotype (which might itself actually be a play off of the expected). Framke is a semi-promiscuous, very sexy but also \"too tall\", somewhat depressive and quirky woman. Favreau is not very good looking (which women, especially more intelligent and more experienced women tend to not care so much about), intense, highly intelligent, and if anything too oriented towards early commitment. At the same time he seems to have a very strong and experimental sex drive. All in all, he is in many ways what elite level late 90's women say (at any rate) they want the most in men. But Jon develops a problem. Though he fights against it, he is in fact life experience jealous of Framke's 13 (as I remember) against his (rather amazing 3). (Both are very suppressed numbers, if you ask me.) He stays with women he sleeps with for six years. She hasn't had a relationship that lasted longer than six weeks, other than her high school French teacher (with a vanishingly small d**k). So one thing leads to another and they separate in a most friendly and civilized manner. Only to.... It is the detailed and very honest character development which makes this movie -- what it is all about. In fact it is a very \"French\" American romantic comedy -- set within a quintessentially American idiom. I'd love to see many more like this.",
         "If you are looking for a standard hollywood film with the standard hollywood jokes and the standard hollywood ending - Be prepared for a disappointment. If you are willing to put the stereotypical - boring - humour aside and open up for this entertaining, witty, insightful and brilliantly funny story - then this is the film for you. Shot in only 21 days this is a masterpiece and definitely one of the funniest film's i have ever seen. Famke Janssen and Jon Favreau make a brilliant team and the onscreen chemistry between them makes the film seem ever more realistic. Some of the jokes are worth repeating and talking about after watching this film - if you haven't seen it yet then go and get it and watch out for the french teacher, peaches and the little singer man. If you have seen this film and still can't appreciate the brilliantness then maybe you'd have to wonder whether your humour is too spoiled by the overdrawn high budget hollywood stuff. But that's only my opinion.",
         "Valerie Breiman treats the subject of love and sex with almost the perfect balance. It remains funny and light while treading on some pretty heavy issues. I saw it at a film festival and it was a welcome relief from the heaviness of many of the other films shown. This was the first time I had noticed Famke Janssen and I said, \"I'll watch out for her because she will surely get a bigger film.\" Sure enough, she showed up in a good role in X Men. This is a great date film, by the way, if your date is at all open-minded. Despite the \"sex\" in the title, there isn't much shown. The language is a little over-the-top.",
         "The screenplay was witty and had a sense of true comedic timing. The movie only showcases a bit of what the screenplay held.Valerie Breiman wrote a fantastic script, but her direction was somewhat lacking, and I felt that the actors did the best they could with what she gave them. There were some elements of great comedy, but the timing was just a BIT off. A more experienced director could have played up the many one liners and the countless funny moments from Kate's love life. The ending just sort of showed up, which was disappointing, and she could have worked more of the new article deadline into the story. And unfortunately, the one serious moment in the story (which was acted very well) was too short and it could have been explored more, and could have exhibited itself further in the story as something like that affects someone very deeply, even Kate. Jon Favreau is a very funny man and from what I've seen a pretty good actor. Famke Janssen, while best known as the best bad Bond Girl and Jean Grey from X-men, isn't known for her acting ability, having taken some roles in some very VERY bad movies. However, I think almost each and every time she makes a movie she gets better and better. This was the first time I'd seen her play something other than the one dimentional characters from her previous roles. I think that in 'Love and Sex' and also in the new 'X-2 X-Men United' she's starting to show some real acting chops, some true depth, indicating that she's more than just a former-model-turned-actress cliche. She turned out some very very funny scenes, but the director as I said earlier just missed out on the very jokes she had written. Hopefully, Ms. Janssen will start to get some meatier roles to play, based on the potential she showed here and the heart and soul she's brought to a comic book character for crying out loud. But that's another review and a completely different type of movie. I'd like to see her do more comedy. Ms. Brieman gave a decent 1st time out movie, it just could have been so much more. I still really enjoyed it and if I had the money I'd go buy it. I got the humor, and appreciated it, even though it was poorly put on the screen. Maybe its because I'm just as neurotic as Kate and Adam.",
         "If you like intelligent, witty character-driven flicks, but aren't feeling up for anything too meaningful, you will probably enjoy this. The actors have great chemistry and the writing is often delightfully fresh.",
         "If you've been watching Jon Favreau's Dinner for Five on IFC, and enjoying it, as I have, you'll definitely enjoy this movie. Favreau is fun to watch, and this movie shows his strengths as an actor. Famke Jansen is a standout as Kate, the film's protagonist. Looking through the External Reviews, linked on IMDB, it seems that many of the critics really disliked this movie, and I don't see why. It may not be Shakespeare, but why such a strong negative reaction to what is essentially a light, romantic comedy. Some even say there is no chemistry between Jansen and Favreau, and again, I just don't get it. OK, so you've probably read the synopsis, 30ish single Kate is looking for love. 30ish Adam seems to be it. Then they break up. Then they try to move on. Then they drive each other crazy with jealousy. I won't go on to spoil the finish. All that is pretty predictable, but the dialogue is well written. The actors are believable and connect with less of a sizzle than a warm melt. I enjoyed the build-up phase of the relationship that was the heart of the movie. The soundtrack songs were well chosen, and enhanced the film. Overall, this movie is a nice time, and I'd probably watch it again.",
         "Interesting film following the romances of a journalist. Famke Janssen traces her history of romances in her mind as she works diligently to meet a deadline for an article on romantic relationships to save her job. She uses this time to reflect on her on and off relationship with Jon Favreau. This film is a nice change of pace for Favreau. I would recommend this film if for nothing else then the scene with David Schwimmer.",
         "This film is an excellent example of what is good in Hollywood. The writing is inventive, never dull, but most importantly REALISTIC. No matter how tattered or tranquil your relationship history - you will connect with at least one of the characters. Both Jon and Famke are ultra believable and endearing characters. The plot line, direction, and semi-anti-climatic ending do not necessarily leave you wanting more but leave you feeling satisfied that you have just enjoyed one of the great indie films left out there. This IS a movie that most women will LOVE and some men (the ones greatly opposed to \"chick flicks\") will most likely not enjoy. Word to the wise, if you can get your guy to watch the first 10 minutes of this movie it is almost certain to be satisfying. Certainly one of my FAVORITE movies...",
         "As much as many people would like to bash this movie, obviously there NOT a female and they HAVEN'T lived in this decade. The trial to find a good man and \"mr. right\" hangs in the midst of every day, and the way they have portrayed this is very close to the truth. Ok so a lil extravagant, what are the odds that she dates the actor of her ex boyfriends fave movie, she refused to see? But ok, its a movie, and a lot of things in life, ecspecially in relationships will have you sayin, \"What are the odds?\". Things happen weirdly and the way it was delivered in this movie was beautiful. It shows the glory of love, and the cute quips one may have, it shows how people REALLY get along when they live with eachother. They show life isn't a fairy tale, and it deems the truth of it. Overall, as bad as her morals were, but whose are good these days anyways but your grandmother, I think this is a worthwhile movie, at least for a chic nite.",
         "A funny, captivating film. Honest in its approach to portray the difference between people and true love. We all make connections we people through relationships but we may not always make the right decision at the right time. It may make you at crazy, but when you've been 'cheese sandwiched' then you will know that you don't want anymore. If you want to experience someone else's view on love and sex watch it, you might love it or hate it, either because you think its rubbish or because you might not like what its saying. But we all do it so why not humour yourself, after all were all looking for that one connection, the one piece of comfort we find in this ever lonelier world. -A bit deep? well its only an opinion!"
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Behaviour Worldwide",
         "MDP Worldwide"
      ],
      "summaries": ["When her rather explicit copy is rejected, magazine journalist Kate is asked by her editor to come up with an article on loving relationships instead, and to do so by the end of the day. This gets Kate thinking back over her own various experiences, and to wondering if she is in much of a position to write on the subject."],
      "budget": 0
   },
   "movielensId": 3885,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "2000-01-24",
      "dvdReleaseDate": "2001-01-30",
      "directors": ["Valerie Breiman"],
      "runtime": 82,
      "movieId": 3885,
      "title": "Love & Sex",
      "mpaa": "",
      "actors": [
         "Famke Janssen",
         "Jon Favreau",
         "Noah Emmerich",
         "Ann Magnuson",
         "Cheri Oteri",
         "Josh Hopkins",
         "Robert Knepper",
         "Will Rothhaar"
      ],
      "imdbMovieId": "0234137",
      "originalTitle": "Love & Sex",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["YuTmh1qxaG8"],
      "plotSummary": "When her rather explicit copy is rejected, magazine journalist Kate is asked by her editor to come up with an article on loving relationships instead, and to do so by the end of the day. This gets Kate thinking back over her own various experiences, and to wondering if she is in much of a position to write on the subject.",
      "tmdbMovieId": 25128,
      "avgRating": 3.22045,
      "releaseYear": "2000",
      "numRatings": 220,
      "posterPath": "/hw4vNzlaiMqSRrlVumKf6ifVI33.jpg"
   }
}