{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0161216",
      "video": false,
      "title": "Steal This Movie",
      "recommendations": [],
      "backdrop_path": "/5CANN3Dl9H6053MNfuj4c4Ef4eV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Abbie Hoffman",
               "gender": 2,
               "credit_id": "52fe47639251416c750979a7",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Anita Hoffman",
               "gender": 1,
               "credit_id": "52fe47639251416c750979b1",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Johanna Lawrenson",
               "gender": 1,
               "credit_id": "52fe47639251416c750979b5",
               "name": "Jeanne Tripplehorn",
               "profile_path": "/pZcw8RXsRSO9WXHOrQqentISWYv.jpg",
               "id": 10478,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gerry Lefcourt",
               "gender": 2,
               "credit_id": "52fe47639251416c750979b9",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Stew Albert",
               "gender": 2,
               "credit_id": "52fe47639251416c750979bd",
               "name": "Donal Logue",
               "profile_path": "/h0JZ8Hyc9p6sY2jQeJkDcax6UY3.jpg",
               "id": 10825,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jerry Rubin",
               "gender": 2,
               "credit_id": "52fe47639251416c750979c1",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "America - 7 & 8 Years Old",
               "gender": 2,
               "credit_id": "52fe47639251416c750979c5",
               "name": "Michael Cera",
               "profile_path": "/kxeJQa9Ae7Ns1J1b5012SMeyXn2.jpg",
               "id": 39995,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47639251416c750979ad",
            "name": "Robert Greenwald",
            "profile_path": "/rj5ViWRRIDccVsr0DZ41aDHbHeC.jpg",
            "id": 51521,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.357492,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18153,
      "vote_count": 14,
      "budget": 0,
      "overview": "Five years after Yippie founder Abbie Hoffman goes underground to avoid a drug-related prison sentence, he contacts a reporter to get out the story of the FBI's covert spying, harassment and inciting of violence they then blame on the Left.",
      "similar": [],
      "original_title": "Steal This Movie",
      "runtime": 107,
      "poster_path": "/jP1zEaXz3VtF9KnUBDk9NBnGTbK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ardent Films",
         "id": 4736,
         "origin_country": ""
      }],
      "release_date": "2000-08-18",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Greenwald"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Anita Hoffman",
         "Abbie Hoffman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0161216/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxOTkyMTkyM15BMl5BanBnXkFtZTYwNjM0MDk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent D'Onofrio, Janeane Garofalo, Jeanne Tripplehorn | See full cast and crew »"],
      "reviews": [
         "I feel compelled to comment about both the movie and the bias in the movie. As someone who studies Abbie Hoffman I thought that the movie stayed pretty true to what Hoffman wrote in his autobiography, the letters that he and Anita shared that were eventually published, and the transcripts of the court testimony of the Chicago Trial. I think that knowing the movie is based on documents written by Abbie himself makes any bias in the movie seem appropriate or at least more acceptable. Also, I would argue that it is helpful to have a portrait of Abbie that is mostly positive, considering all of the trouble the government went to in order to paint him in a bad light to the public. I think Hoffman was an extremely interesting, albeit troubled character, and I think that D'Onofrio portrayed him well.",
         "\"Steal This Movie\" is the biopic of Abbie Hoffman, the famed activist and self proclaimed \"orphan of America.\" The movie paints a portrait of Abbie as a man who loved his country, only not the way the status quo would have wanted him to. Vincent D'Onofrio plays the lead with a real passion, and Janeane Garofalo also displays competent dramatic ability as Abbie's wife Anita. This movie shows America in the 1960s at its best and worst. What I found interesting was its use of grainy film for flashbacks, to take on the look of a '60s documentary. If you were alive in Abbie Hoffman's time, you either loved him or hated him. Seeing the story of his life may give you a new perspective on who he was.",
         "The film is an interesting look, at what appears to be an interesting man. The style of film is distracting at first - it's all a little too busy, but once you get get by that the film is an interesting ride. The performances are great - Janeane Garolfalo and Jeanne Tripplehorn play the women Abbie loved and do it very effectivly. And D'Onofio is great as Hoffman himself - fiery, passionate and very effective. If there's a problem with the movie, it's that it seems too in love with Hoffman to give a truly accuarate picture. It romaticizes his struggle and seems to think that Hoffman did nothing wrong when he sold what appears to be a lot of cocaine to an FBI agent. True, he was set up, but he still sold it. The film breezes past Hoffman's suicide and paints a man like a golden boy, a truly great man. I would have appreciated a more honest look.",
         "This film is about the activist years of Yippie Abbie Hoffman and the time after. People expecting to see a biopic about his activism, antics, or books will be dissapointed. The film is about Abbie Hoffman. Not about his efforts, but about him. The editing is not that great, and the dialogue could have been better, but the scenes are entertaining even without good pacing. D'Onofrio also did his best to portray Hoffman, even though he's 9 inches taller and doesn't look like him. He seems to capture that charisma, that \"mojo\" that other people seem to like. He' also very good in the second half, when you can tell Abbie is pondering his life - if he's doomed to run forever, is he running from nothing, did he waste his life. He seemed very tortured. A lot of people may be dissapointed, but this is still a good film. Such a shame it didn't get wide release.",
         "This was an overall good release but there were numerous flaws. The worst of which was the dumbing down of the characters, especially Abbie Hoffman. It made for good cinema and fit the mainstream's mental picture of Abbie, but was quite misleading. Abbie's last wife, Johanna Lawrenson, was grossly misrepresented as apolitical and little more than a bubble-headed groupie. Both were excellent organizers and people. Talking to both was inspiring. It's sad that a film from a better source misrepresented them. However, that said, the film has value for providing a visual picture of the times and occurrences of Abbie's life. Abbie was one of the most significant of the 60s cast of characters and this film contributes to keeping his legacy alive.",
         "Robert Greenwald directs this brilliant biopic of '60s counter-culture rabble-rouser Abbie Hoffman(Vincent D'Onofrio)following his involvement with civil rights demonstrations in the south; his association with the infamous Chicago 7 and his disappearance underground in the '70s. Great mix of actual historic footage and well paced dialogue based on the books of Hoffman and his wife Anita. The perky Janeane Garofalo portrays Anita Hoffman and Jeanne Tripplehorn plays Hoffman's girlfriend Johanna Lawrence. Also in the cast are Kevin Pollak, Troy Garity and Kevin Corrigan. D'Onofrio is excellent in the lead role. This is the least heard account of events, but very thought provoking and interesting.",
         "'Steal This Movie' is a well-thought, well-written well-acted, well-made dramatization of the life of left-wing activist Abbie Hoffman, probably the most famous of the Chicago Seven. (The title is a play on the title of Hoffman's autobiography, 'Steal This Book', though it certainly doesn't have the poignancy of that title.) 'Steal This Movie' made some bold casting choices. The lead role was given to Vincent D'Onofrio: not an obvious choice, because Vincent looks very little like Abbie, which caused many die-hard history aficionados to bash the decision. However, Vincent fills the role wonderful, brilliantly, expressing all the conflicting sides of Hoffman's personality, his sense of humor, his dead seriousness, strict political consciousness, bi-polar disorder, having to live in hiding and away from his wife and son. He makes the character come alive much more than someone else could have by simply looking and talking like him. Abbie's wife Anita is played wonderfully by SNL's Janeane Garofalo, accomplished comedian but not so as a dramatic actress. Though it doesn't have that much cinematic value by its own right, 'Steal This Movie' does a fantastic job of getting through both the spirit of the time and the greatness and difficulties of Hoffman's activities and his character - a great and fascinating person whose impact has long been overlooked. It's also a wonderful document of an important period that is practically ignored (relatively, of course). For those interested in the late 60s, in the hippie movements, Black Panthers and other left wing political movements of the time, and of course in Hoffman himself - it's invaluable, on top of being both touching and entertaining. A good watch.",
         "\"Steal This Movie\" was not only an educational film in the sense that shed some light on the activist movement of the 1960s, but also a pleasant surprise regarding the quality of the performances in it. Vince D'Onofrio is amazing as Abbie Hoffman and his acting ability is in full display. Steal this video right away!",
         "I felt compelled to give this movie a \"10\" because I love the subject and thought the performances were swell. But it didn't really capture the mood of the 60s--there really was a community of people all across the country who felt a shared vibe, but this movie portrayed the movement that Abbie was involved in as merely a political movement, with political countermovements against it. It was more than that, and different from that. Jeanine Garofolo gives a flawless performance as Anita. Somehow, however, Vincent D'Onofrio didn't seem right as Abbie--he was just too handsome and athletic. Although Abbie was indeed handsome and athletic, it was in a very Jewish, ergo comfortable, way. There are many others who would have made a better Abbie: John Cusack, the guy from Northern Exposure, the guy from Rushmore, the guy from American Pie. And where was William Kunstler??!!! He was a major participant, defending the Chicago 7. What happened there? Just because Lefcourt was a producer, they dropped Kuntsler. Was Lefcourt even in Chicago?",
         "Spoilers herein. This film works for me. Part of the reason is because I lived through this era and enjoy the validation of certain passionate commitments, albeit made accidentally. Part of the reason is a perhaps unbalanced fascination with Garofalo. She has the subtle ability to diffuse herself into her immediate environment. Check out `Mystery Men.' That's interesting enough, but here she plays a role which demands a more discreet charm, and she works it out. Tripplehorn plays Michelle Pfeiffer and sad to say that even though she is no great talent, her Michelle is better than Michelle's own. But the real reason this film works is that despite the cheesy crowd scenes and very bad script, the actors match the characters. The characters are one-dimensional people, who charm because of their focus. They have depth in being shallow so passionately. The actors are very similar. D'Onofrio is an ordinary actor who substitutes commitment for skill, hard work for insight, simplicity for dimensionality and thus rises to a perfectly appropriate token for Hoffman."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Ardent Films",
         "Greenlight Productions",
         "Lakeshore International"
      ],
      "summaries": ["Five years after Yippie founder Abbie Hoffman goes underground to avoid a drug-related prison sentence, he contacts a reporter to get out the story of the FBI's covert spying, harassment and inciting of violence they then blame on the Left. The skeptical reporter interviews Anita, Hoffman's wife, a single mom on welfare in New York City; Hoffman's attorney, Gerry Lefcourt; and others. As they talk, we see Hoffman's career in flashbacks, from early civil rights organizing through the trial of the Chicago Eight. While underground, as mental illness takes its toll, he meets Johanna Lawrenson, and an odd family develops: Abbie, Anita, their son, and Johanna. Will vindication ever arrive?"],
      "budget": 0
   },
   "movielensId": 3886,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-18",
      "dvdReleaseDate": "2001-01-23",
      "directors": ["Robert Greenwald"],
      "runtime": 107,
      "movieId": 3886,
      "title": "Steal This Movie",
      "mpaa": "",
      "actors": [
         "Vincent D'Onofrio",
         "Janeane Garofalo",
         "Jeanne Tripplehorn",
         "Kevin Pollak",
         "Donal Logue",
         "Kevin Corrigan",
         "Michael Cera"
      ],
      "imdbMovieId": "0161216",
      "originalTitle": "Steal This Movie",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["IxulvgFgTQo"],
      "plotSummary": "Five years after Yippie founder Abbie Hoffman goes underground to avoid a drug-related prison sentence, he contacts a reporter to get out the story of the FBI's covert spying, harassment and inciting of violence they then blame on the Left.",
      "tmdbMovieId": 18153,
      "avgRating": 3.12269,
      "releaseYear": "2000",
      "numRatings": 216,
      "posterPath": "/jP1zEaXz3VtF9KnUBDk9NBnGTbK.jpg"
   }
}