{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0157182",
      "video": false,
      "title": "Went to Coney Island on a Mission from God... Be Back by Five",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Daniel",
               "gender": 2,
               "credit_id": "5a711775c3a3681097000aa6",
               "name": "Jon Cryer",
               "profile_path": "/lUbtFIFdzGXktaFPgrznBDteI5y.jpg",
               "id": 69718,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Stan",
               "gender": 0,
               "credit_id": "5a7117820e0a261892000a9b",
               "name": "Rick Stear",
               "profile_path": null,
               "id": 106517,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Richie",
               "gender": 0,
               "credit_id": "5a711792c3a3681097000abe",
               "name": "Rafael Báez",
               "profile_path": null,
               "id": 96322,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Gabby",
               "gender": 1,
               "credit_id": "5a7117a40e0a261897000b49",
               "name": "Ione Skye",
               "profile_path": "/oiVKhuD2s4kNVnnAYUICtCjdzoC.jpg",
               "id": 3126,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Skee-Ball Weasel",
               "gender": 2,
               "credit_id": "5a7117b30e0a2618a1000b65",
               "name": "Frank Whaley",
               "profile_path": "/ma1lgPwUHUlgdt9BIcIbEPjdx0h.jpg",
               "id": 11805,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Maurice",
               "gender": 2,
               "credit_id": "5a7117c39251413d31000a89",
               "name": "Peter Gerety",
               "profile_path": "/4P7v9Tx7pNkfLGhwDwsP8oBytbt.jpg",
               "id": 1986,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Julie",
               "gender": 0,
               "credit_id": "5a711809c3a368108e000b30",
               "name": "Akili Prince",
               "profile_path": null,
               "id": 1969944,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Cindy Goldclang",
               "gender": 0,
               "credit_id": "5a7118280e0a26188c000b8e",
               "name": "Aesha Waks",
               "profile_path": null,
               "id": 1340983,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mickey (The Photographer)",
               "gender": 2,
               "credit_id": "5a71184f0e0a26189e000ba1",
               "name": "Dominic Chianese",
               "profile_path": "/szL093yLdzjRvqVWQfu0KPfitDQ.jpg",
               "id": 68186,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Jennifer",
               "gender": 0,
               "credit_id": "5a71188d0e0a261897000c29",
               "name": "Susan Foster",
               "profile_path": null,
               "id": 1969949,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Alegra, Richie's sister",
               "gender": 0,
               "credit_id": "5a7118a40e0a2618a1000c23",
               "name": "Christina Hernandez",
               "profile_path": null,
               "id": 1969950,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Sexy Larry (The Store Owner)",
               "gender": 2,
               "credit_id": "5a7118b7c3a3681097000bb8",
               "name": "William Wise",
               "profile_path": null,
               "id": 20542,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Mrs. Muñoz",
               "gender": 0,
               "credit_id": "5a7118cd0e0a26188c000c22",
               "name": "Patricia Mauceri",
               "profile_path": null,
               "id": 1237103,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "The Bearded Lady",
               "gender": 1,
               "credit_id": "5a7118ddc3a3681077000cb5",
               "name": "Leslie Hendrix",
               "profile_path": "/nNwNGlXSJcd84u0G3gUvk2wGnVi.jpg",
               "id": 163695,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Jojo",
               "gender": 0,
               "credit_id": "5a7118efc3a368107a000bfd",
               "name": "Jesse Lenat",
               "profile_path": null,
               "id": 155227,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5a7117310e0a261892000a5e",
               "name": "Richard Schenkman",
               "profile_path": "/puAjxwQ1XKIVyMOX5yN9Lw1uyc7.jpg",
               "id": 76462,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a71173d9251413d2e0009ec",
               "name": "Richard Schenkman",
               "profile_path": "/puAjxwQ1XKIVyMOX5yN9Lw1uyc7.jpg",
               "id": 76462,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a71175a0e0a261892000a88",
               "name": "Jon Cryer",
               "profile_path": "/lUbtFIFdzGXktaFPgrznBDteI5y.jpg",
               "id": 69718,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.008953,
      "production_countries": [],
      "id": 30910,
      "vote_count": 0,
      "budget": 0,
      "overview": "No overview found.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769
      ],
      "original_title": "Went to Coney Island on a Mission from God... Be Back by Five",
      "runtime": 94,
      "poster_path": "/fyM8sgjRwQ6EDVu2CMh4MK7DWay.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Schenkman"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Jon Cryer",
         "Richard Schenkman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0157182/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU1OTgzNDgwNF5BMl5BanBnXkFtZTcwNDUzMTUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jon Cryer, Rick Stear, Rafael Báez | See full cast and crew »"],
      "reviews": [
         "Went To Coney Island On A Mission From God, Be Back By Five- Terrific Drama/comedy written, produced and co-starring Jon Cryer about a trio of friends in New York city that have known each other since childhood. They have lost touch as they became adults as often happens until one day two of them get news that the third is homeless and living in Coney Island. so the two take off from work \"on a mission from God\" (their code to play hooky from school as kids) to find their friend. So the stage is set for a journey of friendship and discovery as we see how these grown men have faced adulthood and its challenges, or more importantly, run from them. We experience their childhood through a series of flashbacks from which we gleam information that directly impacts the present day narrative such as that their missing friend may not have been heterosexual, though they knew him as a ladies man and how this led to a huge tragedy in his life. This kind of movie is hard to pull off and could easily fall into Hollywood schmaltz with a lot of weeping and teary-eyed falsehoods. But this movie avoids all that and keeps a rather hard edge at all times. Understanding that the subject matter is serious and never makes fun of its characters, or looks down on them to pull at your heart strings. The terrific acting goes a long, long way to make this all work with kudos to Cryer who essays the less flashy role of the nebbish. Newcomer Rick Steer is really good as well as his angry, alcoholic friend who has tried to hang onto their youth for all these years. Rafeal Baez is very good as the lost friend too, in a difficult role, having to play both repression and mental illness without over doing it. he does a fine job. Ione Skye is on board in a supporting role and it is always nice to see her too. Overall this is a little gem of a movie that has for some reason been overlooked for almost ten years now. Time to rectify that situation.",
         "WENT TO CONEY ISLAND...is the story of two adult best friends (Cryer and newcomer Rick Stear) who go looking for a high school buddy who is long missing and believed to be homeless. Their search brings them to Coney Island in March--a bleak, overcast landscape symbolizing their bygone youth and abandoned dreams. The cinematography is stunning--the cloudy and captivating blues and grays of late winter. The atmospheric mise-en-scene plays a primary role in the film. The paint peeling, abandoned amusements, the deserted rides--all carry the hollow loneliness of a ghost town. Coney Island is frightening and glorious in all it's kitschy Americana run-down splendor! The search for the lost pal takes the friends to the freak show, skeeball parlor, bumper cars, and under the boardwalk. When at last they find him, they are forced to grapple with taking action to help him treat his mental illness, and to help themselves out of the ruts (dead end jobs, alcoholism) that they have sunk to. The dialogue is rhythmic, humorous, and authentic. Baez plays the homeless friend, Richie, with sensitivity. Rick Stear as Stan, the alcoholic, makes a passionate film debut. Pop-culture icon Jon (\"Duckie\") Cryer takes a serious turn as Daniel. The flashback to the boys' \"glory days\" in a high school garage band--covering Adam and the Ants \"AntMusic\" (!)--is worth the price of admission! It's refreshing to see a film that is well-written, socially conscious, and emotionally relevant. It is a far cry from the tired Hollywood \"formula.\" I encourage all film-lovers to see it.",
         "What an incredibly subtle yet poignant and worthwhile film. I couldn't believe how much it made me think and I liked it more and more after I saw it. Stunning visuals, as they are not technically brilliant, but more give the absolute perfect mood that is needed. Rick Stear is excellent, and I am surprised he hasn't done more. Overall, just a well-done movie. 9.5 out of 10.",
         "Funny and touching. I really enjoyed this film. It has a good balance of humor and sentiment. Cryer, as always, is a pleasure to watch on screen. I look forward to seeing more of his work and would recommend this film to anyone.",
         "I liked the way the writers and director of this film draw the viewer into the film via judicious use of flash backs and slow build up to the most dramatic scenes. Also, Baez does a good job portraying a mentally ill person. He doesn't go over the top.",
         "A movie with totally entertaining dialogue... conversations that leave you wondering if people really do talk to each other that way. Coney Island is a rarity in that it offers a peephole into the world of male friendships as well as a great reprieve from the sinking ships and apocalyptic explosions that litter the screens these days.",
         "This movie, which I just discovered at the video store, has apparently sit around for a couple of years without a distributor. It's easy to see why. The story of two friends living in New York searching for their pal from high school who is now living homeless under the boardwalk at Coney Island, has flashes of being a very good film, but ultimately is weighted down by the story focusing on Stan and Daniel, rather than on their homeless friend Richie. Cryer is as usual very good and the film has a nice stark look to it, with the ghostly images of Coney Island. However, writer Cryer and director Richard Schenkman are too busy dealing with the fairly uninteresting lives of Stan and Daniel rather than focusing on Richie. One flashback in a music store, where Richie has a crush on an employee stands out and really shows the viewer where this film could have gone. But in the end, not much. Two many drawn out scenes of annoyance, such as inside the Skeeball building. RATING 4 out of 10.",
         "In my humble opinion: This movie is well written and has many funny moments where it lacks is the sound and the acting. Through out the entire movie the sound is icy cold with very little realistic background noise, such as the lack of ocean at Coney Island. There are exceptional moments in the film where the acting is quite remarkable but for the most part especially in Rick Stear's scenes the acting is defiantly lacking. The cinematography is also notably uninteresting which accounts for the slow nature of the films progression to an emotional end.",
         "\"Went...\", a downer drama with a spritz of humor, tells the tale of two of a trio of young men who grew up together in school days off to Coney Island in search of their wayward, homeless comrad. The story proceeds in preset day using interleaved flashbacks in a clumsy attempt to develop characters and story and trite aphorisms to lend credence to a weak plot with no payoff. The film has poor technical execution, the look of a super 8mm shoot, bad makeup, and general mediocrity in art, acting, and directing and conjures up more sympathy for the actors than the characters. Very forgettable.",
         "And I don't care how small the budget was. I have fast forwarded less in pornographic movies. Garbage plot, garbage dialog, severely mediocre acting. I can't begin to describe how stupid the dialog was. And oooh the shocking plot twist! It was quite a technique, the way the severely overplayed, horrible dialog would foreshadow the climax, if you could watch it that long. If I didn't live right in the neighborhood it was shot in, I would have turned it off half way through. And I watched the movie with an optimistic attitude."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Evenmore Entertainment"],
      "summaries": ["Two young men (Jon Cryer, Rick Stear) who have been friends since early childhood decide to go on a trip to find a third friend (Rafael Baez) who has long since disappeared. Stories they have heard indicate that the friend has been seen in an apparently rambling, incoherent state at Coney Island. Their trip leads them to a number of adventures involving the otherworld-like life at the Park and revelations related to their own pasts including the death of one's sister, a failed past relationship, financial failings, and alcoholism."],
      "budget": 0
   },
   "movielensId": 3887,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "2001-01-03",
      "directors": ["Richard Schenkman"],
      "runtime": 94,
      "movieId": 3887,
      "title": "Went to Coney Island on a Mission from God... Be Back by Five",
      "mpaa": "",
      "actors": [
         "Jon Cryer",
         "Rick Stear",
         "Rafael Báez",
         "Ione Skye",
         "Frank Whaley",
         "Peter Gerety",
         "Akili Prince",
         "Aesha Waks",
         "Dominic Chianese",
         "Susan Foster",
         "Christina Hernandez",
         "William Wise",
         "Patricia Mauceri",
         "Leslie Hendrix",
         "Jesse Lenat"
      ],
      "imdbMovieId": "0157182",
      "originalTitle": "Went to Coney Island on a Mission from God... Be Back by Five",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "No overview found.",
      "tmdbMovieId": 30910,
      "avgRating": 3.14286,
      "releaseYear": "1998",
      "numRatings": 28,
      "posterPath": "/fyM8sgjRwQ6EDVu2CMh4MK7DWay.jpg"
   }
}