{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "fantasy",
            "id": 2486
         },
         {
            "name": "governor",
            "id": 5744
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0209322",
      "video": false,
      "title": "Skipped Parts",
      "recommendations": [
         294261,
         48123,
         25576,
         75471,
         41127,
         46924,
         19033,
         96716,
         24227,
         58631,
         292044,
         138735,
         54933,
         46853,
         41240,
         15041,
         18408,
         12257,
         22792,
         4916
      ],
      "backdrop_path": "/1HMcXxjc9Zu655CBsnKIwLrbaMF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Fantasy Girl",
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d8741",
               "name": "Drew Barrymore",
               "profile_path": "/y8GKPHsBXVGIGBdDzdNxjm0IbKF.jpg",
               "id": 69597,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lydia Callahan",
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d8745",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Maurey Pierce",
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d8749",
               "name": "Mischa Barton",
               "profile_path": "/pAfKhudBM6x6XjxziTJ5FftNgSR.jpg",
               "id": 11617,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sam Callahan",
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d874d",
               "name": "Bug Hall",
               "profile_path": "/7B2KfTPVnldxMT7pCgxd14oo6LF.jpg",
               "id": 69395,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Dothan Talbot",
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d8781",
               "name": "Brad Renfro",
               "profile_path": "/t97fjAtDrBHTv9ABwwwHDzdKtpo.jpg",
               "id": 51214,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Caspar Callahan",
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d8785",
               "name": "R. Lee Ermey",
               "profile_path": "/r8GBqFBjypLUP9VVqDqfZ7wYbSs.jpg",
               "id": 8655,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Coach Howard Stebbins",
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d8789",
               "name": "Gerald Lenton-Young",
               "profile_path": null,
               "id": 67708,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Laurabel Pierce",
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d878d",
               "name": "Peggy Lipton",
               "profile_path": "/ufFeqwjB6GGdZCRnkZtNS2hDoz9.jpg",
               "id": 152759,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Dot",
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d8791",
               "name": "Andrea Menard",
               "profile_path": "/xJRXVHBfpjzJBDgEEM1bCbr6opk.jpg",
               "id": 292664,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Hank Elkrunner",
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d8795",
               "name": "Michael Greyeyes",
               "profile_path": "/bYWIwMx1yzDwbkAGriEJF0gWyBP.jpg",
               "id": 154647,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d873d",
               "name": "Tamra Davis",
               "profile_path": "/6bKtaisEKoCI6NcmTkJfGRngbc4.jpg",
               "id": 57691,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d8753",
               "name": "Tim Sandlin",
               "profile_path": null,
               "id": 1093998,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d8759",
               "name": "Tamra Davis",
               "profile_path": "/6bKtaisEKoCI6NcmTkJfGRngbc4.jpg",
               "id": 57691,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c0c3a36847f80d875f",
               "name": "Alison Dickey",
               "profile_path": null,
               "id": 1095109,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d8765",
               "name": "Stewart Copeland",
               "profile_path": "/e0spn3RZW1DCziwyCQsSNPyQIU5.jpg",
               "id": 2987,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c0c3a36847f80d876b",
               "name": "Claudio Rocha",
               "profile_path": null,
               "id": 548152,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "52fe45c0c3a36847f80d8771",
               "name": "Justine Baddeley",
               "profile_path": null,
               "id": 6959,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c0c3a36847f80d8777",
               "name": "Tracy Wira",
               "profile_path": null,
               "id": 1095110,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c0c3a36847f80d877d",
               "name": "Stéphane Barsalou",
               "profile_path": null,
               "id": 1095111,
               "department": "Sound",
               "job": "Sound mixer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c0c3a36847f80d879b",
               "name": "Mark Amin",
               "profile_path": null,
               "id": 58048,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.624081,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41282,
      "vote_count": 25,
      "budget": 0,
      "overview": "A woman (Jennifer Jason Leigh) and her son (Bug Hall) must leave a small South Carolina town because of her wild behavior.",
      "similar": [
         19053,
         133805,
         13078,
         8363,
         13416,
         3134,
         20478,
         17130,
         14196,
         17899,
         4771,
         979,
         8456,
         281,
         112160,
         339692,
         122081,
         24469,
         19874,
         317091
      ],
      "original_title": "Skipped Parts",
      "runtime": 100,
      "poster_path": "/x3BIqRYQt3FL9wVDyUj7iTZBH95.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Skipped Parts Productions",
         "id": 40276,
         "origin_country": ""
      }],
      "release_date": "2000-06-06",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "There's nothing like knowing what you've been missing.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tamra Davis"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Tim Sandlin",
         "Tim Sandlin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0209322/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2NjUyMzY0Nl5BMl5BanBnXkFtZTcwNjQ5OTUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Drew Barrymore, Jennifer Jason Leigh, Mischa Barton | See full cast and crew »"],
      "reviews": [
         "After seeing Skipped Parts, and reading all the user reviews, I see why so many are repelled by the movie, but I'm one of the ones fascinated by it. In order to care about a movie, I have to care about at least one character, and in this movie, it definitely was the case, with the Sam Callahan young male part. Although it's true that hardly anyone went through what Sam and his young girlfriend went through, it was captivating to me to see Sam want, so much, to be a real boyfriend to his rather matter-of-fact fellow sexual experimenter. I identified his caring for, and attraction to, girls, with my own young life. As for his mom's character: yes, she was waaayy out there, but I have known women like that, so they *do* exist. I think that, overall, Skipped Parts is one of those movies where you have to give in to the situation a little, and go with it. IF (and this is critical) you have been through at least some of the feelings, if not actual situations, these characters experience, I think you'll agree that the 93 minutes, or so, spent in their world is not wasted time (although I think one time was enough for me...too many other great movies out there to see!).",
         "I found this film to be a welcome relief from the self-righteous, hypocritical obsession with sex as evil in our confused society. I'm sure that viewers aligned with the extreme religious right are aghast at the sexual frankness of \"Skipped Parts\". I only wish they were as upset over the war in Iraq, America's obsession with violence and the rampant intolerance still pervading the home of the free. Instead, sex and four-letter words top the list of moral outrages in the minds of far too many of our number. \"Skipped Parts\" is a compassionate view of outside-the-mainstream people at odds with the establishment. Granted, unprotected sex among teenagers is impractical and unwise, but hardly a reason to despise and condemn. Especially by those who have, as do some of the characters in the film, plenty of skeletons in their own closets. Well-written, well-acted and well-directed, \"Skipped Parts\" is a moral film in which the highest virtues are kindness, forgiveness, and love.",
         "Jennifer Jason Leigh knows her stuff. After picking up Skipped Parts off the shelf, my choice based solely on the interest in Jennifer Jason Leigh movies, I was not disappointed by Skipped Parts. A coming of age story of the American family. You can call it dysfunctional but through all of the problems and obstacles this family saw, it seemed to have more love and happiness than the stereotypical suburban, white picket fence family we are so used to seeing in every movie. Jennifer Jason Leigh is spectacular, yet again, and anyone who loves off-beat movies with a heartwarming feeling from a different direction (compared to other movies) this is a must see and ace on my list. Watch it twice then buy it (as I will do shortly)",
         "Just got back from watching the world premiere of this film at the Seattle International Film Festival. I must say, I enjoyed this movie a great deal. Skipped Parts is a wonder to behold -- outrageously funny, poignant and bold. It never shies away from the tough subjects it covers while at the same time enlightening us with its humor. The acting is top-drawer, Jennifer Jason Leigh is brilliant once again, with standout performances by young Bug Hall and Mischa Barton. I don't want to give any of this one away, but I highly recommend you check it out. A word of caution, if you find sexual banter and activity between 14-year-olds disturbing, do not see this film, it is not for the close-minded. Slated to be released in September 2000.",
         "Phrases like \"this movie will drive the Religious Right nuts\" get a lot of mileage. A number of reviewers have said it about \"Skipped Parts\". So I'm wondering what the Religious Right really would think of this film if they examined it seriously. First, the storyline suggests that sex education for kids is not a good thing and may have unwanted consequences. The women who give the advice, Lydia and Delores, are pretty unsympathetic characters when they're talking to the adolescents. Are we meant to applaud the way they give explicit details (complete with taco shell, like a silly pantomime of a sex ed class) to 14-year-olds, while withholding the key point of where this might lead? I don't think so, because their recklessness is part of a commonplace theme that runs through the film - the kids are more sensible than the adults - and also because we're shown those consequences later. Lydia and Delores might as well give Sam and Maurey a hand grenade and tell them to play carefully. So score a point for Religious Right family values here. Second, the film doesn't take the view of abortion that the Religious Right might expect from so called \"Hollywood liberals\". It doesn't present it as a quick and relatively painless way out of a jam, nor does it do any pulpit pounding about the dark days before Roe v Wade. The film could have made Lydia and Delores into proto-feminist heroes, enlightened before their time, but it didn't. In the story, there are two consequences of visiting the abortion clinic and neither one is a guilt free abortion. So score some big points for \"family values\". Third, the film ends by affirming the stereotypical woman-man-girl-boy family: the waitress, the Indian, the cheerleader, and the precocious young narrator. Sure, the narrator and the cheerleader have a baby, and the waitress is a grandmother before she's thirty. But unless the Religious Right has recently come out against grandchildren being raised by multi- generational families, I fail to see the problem. So what's there to offend the RR, other than the portrayal of Wyoming natives as rodeo loving illiterates? (And that's only offensive \u0096probably -if you're from Wyoming.) Well, there's the scene where the two young teens face each other in their underwear, saying something like, \"I think this is how it's done.\" It was uncomfortable and strange. But a lot of reviewers found it creepy, and I'm sure not all are card-carrying members of the 700 Club. And it doesn't change the fundamental themes of the story outlined above. Lydia's loose morals and rebelliousness are sure to offend the Religious Right, right? Yes, because her actions are *meant* to be offensive: her irresponsible talk, her rambling, self- indulgent rudeness to the welcome lady, her inability to do a stick of work, her cruelty to a man who's much too good for her. The RR is offended and so is everyone else. So maybe, in the movies, actions shouldn't always be judged desirable if they offend conservative Christians. Even the RR is sometimes offended by what's actually offensive. But I digress. The good news is that, as in all traditional morality tales, Lydia comes round in the end. She gets a job, declares independence (rather than just rebellion) from her father, and settles down with a man who loves her. Sure, she's white and he's Native American, but not even the film's illiterate Wyomians are offended by that. That leaves just one theme that seems custom made to offend conservative religious types. The film threatens to undermine parental authority and traditional family values by making the kids more sensible and moral than the adults. In fact, the grown ups are mostly first class hypocrites, as revealed especially in the confrontation at the abortion clinic. Sam, on the other hand, is an example of responsibility and kindness. But wait. I think I've read that somewhere before. Something about religious leaders being blind Pharisees and children being the kingdom of heaven. Yes, that definitely sounds like a deliberate attempt to offend the Religious Right.",
         "\"Skipped Parts\" is a watered-down version of Tim Sandlin's novel of the same name, the first in a wonderful trilogy about Sam Callahan's and Maury Pierce's unusual lives. I recommend reading the novel(s), where the two leads are 12, not 14, in the beginning and where the Wyoming landscape and Teton Mountains are just as much characters as they are a background for the movie. Not only is the story watered down and written for cheap laughs and tears, but the pacing is unbearably slow. Jennifer Jason Leigh is clearly not capable of doing justice to the methodically drunken Lydia Callahan, as her portrayal is really more of a caricature than a character; and Tim Sandlin sadly did little justice to his own novel in this screenplay by down-playing Sam Callahan's inner life as innocent, hopeful commentator on the action of the novel/movie. Much of his biting and insightful humor is lost by removing Sam's commentary. Read the book. It'll take more time, but feel hours shorter than this movie felt.",
         "I saw the trailer for this film a few times when I was renting some movies and I thought it looked very funny. Then today I saw it at the video store. I picked it up and watched it and loved it. I thought Jennifer Jason Leigh was so hilarious in this movie and she truly stood out as Lydia, Sam's mouthy, slutty mother. Another acting standout was Bug Hall, Mischa Barton and Angela Featherstone. I thought they played there part perfectly, especially the young leads and Leigh. I was also suprised to see Drew Barrymore in a very small role as \"Dream Girl\". Although it deals with pregnancy and sex with 14 year olds...I still found it very entertaining and if you want to see some very good acting and a good comedy, i recommend this movie very highly. 10/10",
         "As a kid, every adult has had a time in his life that he or she was fascinated by the world of the grown-ups, but didn't know much about it. As an adolescent kid you want to know more about love and sex, but the path to adulthood can be a bumpy road. That's also the reason why there have been made so many coming of age-movies. Not all of them were very successful, but some of them sure are worth a watch, like for instance this \"Skipped Parts\". When in 1963, a young woman and her 14-year old son Sam from an unknown man, are expelled from North Carolina by her powerful father who runs for governor, they end up in a small town in Wyoming. Here she continues her irresponsible life of partying and having fun, while her son discovers that the biggest part of his new school is made up by retards who don't seem to know what a book looks like from the inside. There is especially one girl, called Maury, who he can't stand at first, but who he gradually starts to like more and more. When she asks him to help her experiment with sex, they get very close and with the help of his mother they get a pretty good idea of what sex is like. But despite the fact that his mother told them to stop as soon as Maury has had her first period, they are too late and pregnancy is the result. While facing the consequences of their experiments and with grandfather's dictatorial shadow over them, Sam and Maury get help from Hank Elkrunner, a Blackfoot Indian who has become Lydia's newest boyfriend... I guess that it needs some imagination to believe that all what is happening in this movie could actually be true. I'm not saying that it isn't possible, but sometimes it all feels a bit far-fetched. Nevertheless, this is still a very interesting movie and certainly one of the better coming of age-stories that I have ever seen. Especially thanks to the underlying story line of the double moral (sex outside marriage didn't exist, but abortion clinics were available, the totalitarian patriarch who wanted to keep his influence on his family, but didn't want them near him...) and the fine acting in this movie, this is a lot better than average. It's sure worth watching and I gave it a rating of 7/10 which is far from bad for this kind of movies.",
         "It was one of the best movies I have ever seen, it just made me feel like I did when I was 14. It musn't be spoilt with more than 4 rows. It's just great!!! A must see movie for every one of you who wants to go back to his youth (if he ever had one)",
         "this is a quirky, entertaining flick. set against the backdrop of small town america 1963, it's a different 'coming of age' movie. goofy, drunken , obsessive adults and saner, wiser children attempt to sort through family roles and societal situations -- bigotry, sexual awakening, family structures, morality, abortion, gender roles --- this movie has got it all. it is, alternately, funny, sad, depressing & invigorating, but always entertaining. a great rent!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Skipped Parts Productions"],
      "summaries": [
         "It's 1963. Poor little rich girl Lydia and her 14-year-old love-child Sam are banished from North Carolina while her powerful father runs for governor. They end up in Wyoming where she parties and Sam finds he's one of only two Grosvant High School students who read. Maurey is the other, a pre-pubescent girl wanting to discover what sex is about. She and Sam set out to learn with help from Lydia, who tells them it stops when Maurey has her first period. Trouble is, pregnancy comes first. In this small town, what can Maurey do, and will Sam have any say? Meantime, Hank Elkrunner, a Blackfoot, falls for the feckless Lydia, while her dictatorial dad keeps tabs on them all from afar.",
         "An ungrounded young mother and her thoughtful teenage son are banished to a remote provincial town by a domineering father."
      ],
      "budget": 0
   },
   "movielensId": 3888,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-06-06",
      "dvdReleaseDate": "2002-02-05",
      "directors": ["Tamra Davis"],
      "runtime": 100,
      "movieId": 3888,
      "title": "Skipped Parts",
      "mpaa": "R",
      "actors": [
         "Drew Barrymore",
         "Jennifer Jason Leigh",
         "Mischa Barton",
         "Bug Hall",
         "Brad Renfro",
         "R. Lee Ermey",
         "Gerald Lenton-Young",
         "Peggy Lipton",
         "Andrea Menard",
         "Michael Greyeyes"
      ],
      "imdbMovieId": "0209322",
      "originalTitle": "Skipped Parts",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["ZVJrAA0CgTQ"],
      "plotSummary": "A woman (Jennifer Jason Leigh) and her son (Bug Hall) must leave a small South Carolina town because of her wild behavior.",
      "tmdbMovieId": 41282,
      "avgRating": 3.15,
      "releaseYear": "2000",
      "numRatings": 70,
      "posterPath": "/x3BIqRYQt3FL9wVDyUj7iTZBH95.jpg"
   }
}