{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "antiquary",
            "id": 3095
         },
         {
            "name": "loss of powers",
            "id": 3861
         },
         {
            "name": "immortality",
            "id": 4978
         }
      ],
      "imdb_id": "tt0144964",
      "video": false,
      "title": "Highlander: Endgame",
      "recommendations": [
         8011,
         8010,
         13360,
         8009,
         12088,
         10366,
         24126,
         11342,
         9278,
         8867,
         8831,
         5765,
         4954,
         11649,
         11595,
         24993,
         9033,
         11119,
         28510,
         3513
      ],
      "backdrop_path": "/xYdzbB3TksChZLuZ9qq7iq5fFux.jpg",
      "revenue": 15843608,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Connor MacLeod",
               "gender": 2,
               "credit_id": "52fe44ca9251416c7504113d",
               "name": "Christopher Lambert",
               "profile_path": "/sIl2F9LDTjfnAVBxEG5CTtZGuJU.jpg",
               "id": 38559,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jacob Kell",
               "gender": 2,
               "credit_id": "52fe44ca9251416c75041141",
               "name": "Bruce Payne",
               "profile_path": "/nUfoRt0YA3SXbTAPKjNGq5lYuOc.jpg",
               "id": 27422,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Duncan MacLeod",
               "gender": 2,
               "credit_id": "52fe44ca9251416c75041145",
               "name": "Adrian Paul",
               "profile_path": "/3BNKgYUbcWw7v9oIsPOW6fVlpkq.jpg",
               "id": 71900,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Jin Ke",
               "gender": 2,
               "credit_id": "52fe44ca9251416c7504116d",
               "name": "Donnie Yen",
               "profile_path": "/vlKBbOc0htUsDGvcxeULcFXDMRo.jpg",
               "id": 1341,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Kate MacLeod / Faith",
               "gender": 1,
               "credit_id": "534152f70e0a2679b1001fbf",
               "name": "Lisa Barbuscia",
               "profile_path": "/fesKDQexfUIPI3NYDhIKa6Vfe66.jpg",
               "id": 9146,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Heather MacLeod",
               "gender": 1,
               "credit_id": "5341534f0e0a2679ad0020c5",
               "name": "Beatie Edney",
               "profile_path": "/fV5Mf1AKqsL1IhxZxX9JQ68WrqB.jpg",
               "id": 53515,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Drunk Friend",
               "gender": 2,
               "credit_id": "5abfc72d925141601e02c113",
               "name": "David Nicholls",
               "profile_path": null,
               "id": 1760088,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ca9251416c7504114b",
               "name": "Bob Weinstein",
               "profile_path": "/hheuMcH8MnFGmatPvhdLUNnSOwm.jpg",
               "id": 1307,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ca9251416c75041151",
               "name": "Douglas Aarniokoski",
               "profile_path": "/dQ5FUVrjKNzXEADBCg3DDSWewhW.jpg",
               "id": 71901,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ca9251416c75041157",
               "name": "Nick Glennie-Smith",
               "profile_path": "/sCNYdoHmQdkeu5LPTy22xtRVkFI.jpg",
               "id": 57263,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ca9251416c7504115d",
               "name": "Joel Soisson",
               "profile_path": "/hr2hlrFO9NQVZzHsIaN5mbK32BQ.jpg",
               "id": 18384,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ca9251416c75041163",
               "name": "Douglas Milsome",
               "profile_path": null,
               "id": 8306,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ca9251416c75041169",
               "name": "Chris Blunden",
               "profile_path": null,
               "id": 16465,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5341541c0e0a2679ad0020d7",
               "name": "Peter S. Davis",
               "profile_path": null,
               "id": 53866,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "534154520e0a2679bf00203e",
               "name": "William N. Panzer",
               "profile_path": null,
               "id": 53867,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "534154810e0a2679a10020a1",
               "name": "Donna Brower",
               "profile_path": null,
               "id": 978265,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "534154960e0a2679bf002044",
               "name": "Catalin Dordea",
               "profile_path": null,
               "id": 1307603,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "534154ac0e0a2679a10020a8",
               "name": "Michelle Guish",
               "profile_path": null,
               "id": 5489,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "534154c80e0a2679bf00204a",
               "name": "Wendy Partridge",
               "profile_path": null,
               "id": 3962,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "534154e30e0a2679a70021cf",
               "name": "Oana Paunescu",
               "profile_path": "/oRLZyRn4pZ6goaX95OtQcKQaOGQ.jpg",
               "id": 1099544,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.25093,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12211,
      "vote_count": 135,
      "budget": 25000000,
      "overview": "Immortals Connor and Duncan Macleod join forces against a man from Connor's distant past in the highlands of Scotland, Kell, an immensely powerful immortal who leads an army of equally powerful and deadly immortal swordsmen and assassins. No immortal alive has been able to defeat Kell yet, and neither Connor nor Duncan are skilled enough themselves to take him on and live. The two of them eventually come to one inevitable conclusion; one of them must die so that the combined power of both the Highlanders can bring down Kell for good. There can be only one... the question is, who will it be?",
      "similar": [
         745,
         1374,
         334,
         425,
         1562,
         1381,
         601,
         319,
         616,
         675,
         744,
         1547,
         5176,
         11631,
         335,
         858,
         69,
         401,
         637,
         2288
      ],
      "original_title": "Highlander: Endgame",
      "runtime": 87,
      "poster_path": "/fmDt68Pj9OiR3pfvNL9qkuhKvi2.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "",
            "iso_639_1": "gd"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Davis-Panzer Productions",
            "id": 2737,
            "origin_country": ""
         },
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-09-01",
      "vote_average": 4.5,
      "belongs_to_collection": {
         "backdrop_path": "/gY5NPUGGJJdaGPlEM6f2pfHNtit.jpg",
         "name": "Highlander Collection",
         "id": 8050,
         "poster_path": "/mNIXoyFicGseg9NoG3NHKZolKze.jpg"
      },
      "tagline": "It will take two immortals to defeat the ultimate evil. But in the end, there can be only one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Douglas Aarniokoski"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Gregory Widen",
         "Eric Bernt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0144964/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjE1ODkzNzgyOV5BMl5BanBnXkFtZTcwOTYzMzkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Lambert, Adrian Paul, Bruce Payne | See full cast and crew »"],
      "reviews": [
         "The last installment of the Highlander movie series is a brilliant blend of the original movie and the popular television characters. The story line is weaved through past history (as Highlander fans have come to expect) and picks up where the television series ended. It still stands alone as a movie in itself, though I will admit it may be hard for a non-highlander fan to grasp all of the concepts that are thrown at them. All in all, Davis/Panzer have once again given credit to this wonderful science fiction series by watching the details of the character's pasts and still creating unknown events in their lives. This is the beauty of this series, just when you think you know the character something pops up from their past. This will be an emotional movie for diehard Highlander fans, just as the \"To Be/Not to Be\" t.v. finale was. In my opinion, even though this is dubbed as the final act of this series, there is still one minor issue that still remains....there can be only be one!",
         "After the \"Alien Experience\" and the \"Remake Sequel\", \"Highlander\" producers decided to add two and two and get someone to write a marvellous script. They went on with the mathematics, and got together Christopher Lambert and Adrian Paul. The result is the long-expected good sequel to the first \"Highlander\", set after \"The Series\" ended. Tired of the endless fights, Connor MacLeod enters the Sanctuary, a place where immortals can rest forever under the guard of the Watchers. However, an old foe of Connor releases him after killing all the other immortals in that place. Not pleased with this, this foe and his posse pays a visit to Duncan MacLeod, who gets away and looks for his clansman. Both MacLeods have sins to purge, and the time has come to do that. Christopher Lambert, though intended to have a supportive role like Sean Connery in the original film, robs the movie. Though his Connor is hardly the same bad ass of the other films, it's by far the best performance in the film. Adrian Paul manages to lead the film well, like in the TV series. Bruce Payne, playing the embittered Jacob Kell, provides a fine interpretation that is however in the line of the other \"Highlander\" villains. Lisa Barbuscia as Kate MacLeod is somewhat fine, but I'm inclined to believe the only reason \"Fishlips\" got cast is her willingness to show her breasts. The character of the film is indeed Jin Ke, played by Donnie Yen. However brief his presence on screen may be, he manages to give a very good impression, as well as some action. Another two characters worth mentioning are Rachel (the late Sheila Gish) and Heather (Beatie Edney), who appear again in a \"Highlander\" film. Briefly, but it's something. Why don't I give it a 10? First, the first film (which indeed deserves a 10) is superior to this one. Secondly, the editing of the film is weak. It's not the one of \"Highlander II: The Quickening\" but this one has some big flaws. In any case, \"Highlander Endgame\" is a great film, with more action and entertainment than the other sequels, and it's a great choice even for non fans. Seven!",
         "Fantastic End to the Game Played, By Jakob Kell and Connor and Duncan MacLeod. The Fierce Hatred Between the two Past Frends (Connor and Jakob)Reaches an Epic Climax in witch Connor and Duncan must Become \"One\", to defeat Jakob. Lisa Barbuscia also had her part but wasn't that Impressive at all. Usually i Highlight The Performance Of A Beautiful Women, But the fact is She was Just another One Of The Cast. She Looked Pretty but that was all. Jakob Kell betrayed his Best Friend Connor MacLeod. And then When Connor Tryed To Save his Mother Helped, The People ho were Trying to Burn her. Connor then Killed Both Jakob as his Priest Father. And an Infuriated Jakob Swore Revenge. Connor Knew That he was Inmortal. But also knew that a simple Chop of His Head would take that away. His Great Brother Duncan, fought in The Great War. Then Connor Picked him Up and Explained him about his Immortality. The Two Brothers Began Collecting Immortal Kills and were both about 360 Something of Confirmed Immortal Kills. But Connor also Knew that Jakob Kell was Getting Stronger And Stronger with a Total Over the 620 Confirmed Immortal Kills. Kell's Ultimate Goal was to get revenge On Connor By Killing Everone Ho meant Something to Connor, and then to complete his Revenge by Killing Connor as They would Be Only Ones Left To Make the Humiliation even Worse. In the end He would Be Stopped by the Brotherhood Double Of Duncan and Connor ho became One. Overall the Scottish Passion was Great and The Mix in Styles When People Fought Showed Great Strengh in Depfh. Thats why it is a Mystery to me why this Movie is So Harshly Underrated. It was a Great Movie. And Truly End Game. My Score : 10 - Groeten Gerrit",
         "Contains spoiler Well, frankly I have never been a fan of the Highlander franchise, but if I had been one, this movie would probably be one of the best Highlander movies around. Actually, I have only see the second one (with Michael Ironside and Sean Connery, if I remember correctly) and in comparation, Endgame is somewhat better. Even though I prefer the post-apocaliptic look of H:II, Endgame provides us with better special effect (obvius), a lot-more digestible plot and some good acting. Even though I don't like the (SPOILER) fact that Connor died (END OF SPOILER) I think it was just to finally end with the Highlander franchise. Excellent battles, good plot, and good acting (somewhat weird cast, but ok) is all I need for a movie, and Chistopher Lambert's acting is superb. A good end to the Highlander series. B+",
         "After Connor MacLeod (Christopher Lambert) witnesses his adopted daughter being killed in a building that was blown up; the Immortal locks himself up in a place called the Sanctuary to remove himself from the Game (What the Immortals call their quest to be the last remaining Immortal and receive the \"Prize\") However Jacob Kell (Bruce Payne) who became an Immortal when he was stabbed by Connor after the Highlander's mother was put to death (We see this event in a Flashback to Connor's early life in the Highlands of Scotland) Kell lets Connor live however. He is being sought out by his fellow clansman Duncan MacLeod (Adrian Paul) Kell's followers show up in Connor's old Antique Store at the same time as Duncan is investigating. Jin-Ke (Donnie Yen) and Duncan engage in a brilliant sword fight and following that with a high speed Kung-Fu fight (Which puts \"The Matrix\" to shame I must admit. Pity the fight didn't go on longer, or Jin and Duncan getting a rematch!) The fight ends with Duncan being blasted out of a window and being impaled on a series of poles, Duncan is taken by the Watchers (Watch the TV series and find out!) He is being kept locked up to prevent Kell finding him and taking his head (We'll get to that) Duncan is rescued by his buddy Dawson (Jim Byrnes) and is told that Kell has more than six-hundred heads to his name while Connor and Duncan only have only just over three-hundred between them (The movie never explains where all these Immortals come from, my advice is to not analyse the continuity too much or you'll blow your head off. No pun intended!). Duncan visits a graveyard of all the Immortals Kell has killed and he finds Connor. Connor then attacks Kell but the psychotic Immortal is far too powerful and Connor quickly realizes that he can no longer carry on. Later (After the gratuitous sex scene with Duncan and his old, old flame Kate/Faith (Lisa Barbuscia!) Duncan and Connor meet on the roof tops Connor explains that only one of them can fight Kell, so Connor wants Duncan to kill him. Duncan refuses and Connor attacks him, in the end however (There can be only ONE!) Duncan tearfully takes Connor's head and gets a massive power up. After a quick bout of training, Duncan tracks down Kell (To an abandoned warehouse/factory of all places!) Another big sword fight takes place (The editing of this fight isn't so good but the fight itself kicks ass!) finally Duncan removes Kell's head (After discovering Connor's unblockable trick isn't all that good!) and the massive Quickening blazes from the sky and gives Duncan even more power (This is one of those visual scenes that didn't come off as good as it could have). Afterwards Duncan visits the grave of Connor who has been buried alongside his first wife Heather (Beatie Edney) He returns home to discover that Kate/Faith is still alive and the two, probably, rekindle their relationship. Good Points: There are some tremendous visuals in this movie, sadly some of them come off as a little \"Made-For-TV-Movie\" at times (The rooftop fight between Connor and Duncan being a prime example!) The Flashbacks to the Highlands had Beatie Edney reprising her role as Connor's wife (Even if only for a few minutes, it was nice to see her again!) Duncan and Jin-Ke's awesome sword and Kung-Fu battle. Kell as the best villain to date, every member of the cast gives the roles their all. Kudos to both Christopher and Adrian for the tearful farewell. Bad Points: The afore-mentioned weak CGI shots. Kell, on several occasions, violates the \"No fighting on Holy Ground\" rule and receives no form of punishment (Probably because he is evil already he doesn't get the \"Dark Quickening\" as seen in the TV series!) Douglas Aarniokoski's direction isn't the best either, hopefully the next installment will return Russell Mulcahy to the director's chair.",
         "Overall, this was not a bad flick. It's not quite as good as the first one, but is much better than the second. I'd have given it a higher rating than I did if they'd just left out the high speed kung fu stuff - it's too much like all the cheap Bruce Li rip off movies. Anyway, the story in this one is good and it tidies up everything rather nicely at the end. They do leave one thread hanging but I don't think that was to provide the backdrop for another film. I think this one's the last Highlander film - at least I hope so. I believe that the Highlander \"thing\" has gone about as far as it can. It would be difficult to come up with anything original for another film. Again, this film isn't bad at all and nearly makes up for the poor middle of this series. The tie-in between the film McLeod and the TV McLeod was handled very well, I thought. I really liked the first film and I like this one pretty well also.",
         "I love Highlander and so, was anxious to see Endgame. It was badly edited and I was disappointed the first time I saw it. But, Adrian Paul did a magnificent job as Duncan MacLeod. He was the best thing in the movie. Unfortunately, Christopher Lambert is starting to look his age, and so, as sad as the fans find the loss of \"Connor\" it was time for him to pass the flame on to Duncan. Paul is a strong actor and plays the physical role with grace and intensity. After I saw the movie a second time, I started to like it! And now, I overlook the \"hack job\" on the editing of the movie and have come to appreciate it for what it has offered...a moving \"death scene\" between Duncan and Connor, and some superb action.",
         "I'm a big fan of the films and of the TV show and I think this one rates up there with the original. It's definetly better then the 2nd and third. Now that Connor is gone we'll see how Duncan goes it alone in the next film.",
         "this movie was one of the better tries at a highlander sequel, which it is not... For those of you introduced to highlander with the series the movie may be quite good, but if you are a fan of the original film this movie will disappoint you. take note that this is highlander: Endgame not Highlander IV or 4 the numeral was cleverly omitted for obvious reasons...here all things go... Personally I do not think the film merrits a theatrical release I think that a mini-series would of been a better format providing more time and better care of the characters... PS I saw the so called New Cut which runs Apprx. 1hr 32 min from the time the title is seen to when the credits start rolling... This is not the end?",
         "The trailer for this movie had me excited; I love the original movie, and the sequels thus far were less than exceptional. I should have known better, though. Offhand, I can't think of any movie which is the 4th in a series and which is worth seeing. Highlander: Endgame is no exception. The plot is predictable and the acting, marginal. No effort is made to tie up any loose ends or explain why the story went from \"there can be only one\" to \"there can be only one, except for all these other folks.\" The movie is uninspiring, full of moronic jokes and trite dialog, and worst of all: it's boring. The fight scenes, with one exception, are as formulaic and predictable as the plot. Sadly, though, they're the best part of the movie."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Davis-Panzer Productions",
         "Dimension Films"
      ],
      "summaries": [
         "When Connor Macleod sees his old friend Rachel die in an explosion, he's had it with his immortal life and the endless pain it brings him and those he loves. He locks himself inside the Sanctuary, a Watcher-organized retreat stationed on holy ground, where immortals who are tired of the game can go to forever escape it, as well as to ensure that The Prize never falls into the wrong hands. But when an old enemy, Jacob Kell, and his posse of assassins attack the Sanctuary and kill everyone there but Connor, he is forced out into the open and into battle. Kell and Connor were friends once, and knew each other back when Connor was cast from Glenfinnan; he returned when news came that his mother was to be burned at the stake, and in the attempt to free her, Kell was killed by none other than Connor himself, and became an immortal, bitter with hate, and devoted to making Connor's life a living hell. In the present day, Connor's kinsman Duncan Macleod is attacked by Kell's posse, including Kate, an old love of Duncan's who seeks revenge for her unwillingly being made an immortal centuries ago. This attack had something to do with Connor, and Duncan goes in search of him to find out why. In the process, he learns that in the 450 years since Connor and Kell's encounter in Glenfinnan, Kell has taken more than 600 heads and gained enough power to be called nothing less than the most powerful immortal alive. To make things worse, neither Connor nor Duncan are strong enough to face Kell alone.",
         "Immortals Connor and Duncan Macleod must join forces against Kell, an evil immortal who has become too strong for anyone to face alone."
      ],
      "budget": 15000000
   },
   "movielensId": 3889,
   "movielens": {
      "languages": [
         "English",
         "Français",
         ""
      ],
      "releaseDate": "2000-09-01",
      "dvdReleaseDate": "2001-02-20",
      "directors": ["Douglas Aarniokoski"],
      "runtime": 87,
      "movieId": 3889,
      "title": "Highlander: Endgame",
      "mpaa": "R",
      "actors": [
         "Christopher Lambert",
         "Bruce Payne",
         "Adrian Paul",
         "Donnie Yen",
         "Lisa Barbuscia",
         "Beatie Edney"
      ],
      "imdbMovieId": "0144964",
      "originalTitle": "Highlander: Endgame",
      "genres": [
         "Action",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["M7mqpGNx8FI"],
      "plotSummary": "Immortals Connor and Duncan Macleod join forces against a man from Connor's distant past in the highlands of Scotland, Kell, an immensely powerful immortal who leads an army of equally powerful and deadly immortal swordsmen and assassins. No immortal alive has been able to defeat Kell yet, and neither Connor nor Duncan are skilled enough themselves to take him on and live. The two of them eventually come to one inevitable conclusion; one of them must die so that the combined power of both the Highlanders can bring down Kell for good. There can be only one... the question is, who will it be?",
      "tmdbMovieId": 12211,
      "avgRating": 2.45707,
      "releaseYear": "2000",
      "numRatings": 1421,
      "posterPath": "/fmDt68Pj9OiR3pfvNL9qkuhKvi2.jpg"
   }
}