{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "butterfly",
            "id": 156096
         },
         {
            "name": "dissection",
            "id": 157890
         },
         {
            "name": "scalpel",
            "id": 163128
         },
         {
            "name": "medical school",
            "id": 187677
         }
      ],
      "imdb_id": "tt0187696",
      "video": false,
      "title": "Anatomy",
      "recommendations": [
         1699,
         8991,
         376549,
         132957,
         17236,
         10845,
         7341,
         83404,
         99254,
         1915,
         18442,
         239853,
         14549,
         50458,
         40976,
         284063,
         206,
         11871,
         32150,
         32229
      ],
      "backdrop_path": "/lOf9IpSKA0mnkb7xAKsdi8gdoGy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Paula",
               "gender": 1,
               "credit_id": "52fe430dc3a36847f8036e95",
               "name": "Franka Potente",
               "profile_path": "/9ES9W38WA8vIz6zMhlfpeJ29hrW.jpg",
               "id": 679,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Hein",
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036e99",
               "name": "Benno Fürmann",
               "profile_path": "/oaOk5Sm3yTxO1QAnYiQVVDfHGMg.jpg",
               "id": 11953,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Gretchen",
               "gender": 1,
               "credit_id": "52fe430dc3a36847f8036e9d",
               "name": "Anna Loos",
               "profile_path": "/re5xWuPWlnPLcHZAXAztV8KnNeI.jpg",
               "id": 28361,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Ludwig",
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036ea1",
               "name": "Oliver Wnuk",
               "profile_path": "/sYW2okbBPjAGhK6JrgM4kM3SgPn.jpg",
               "id": 36863,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Caspar",
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036ea5",
               "name": "Sebastian Blomberg",
               "profile_path": "/cmWWEr76Yavj6I1mxZvONbiDnal.jpg",
               "id": 6268,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Phil",
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036ea9",
               "name": "Holger Speckhahn",
               "profile_path": null,
               "id": 36864,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Prof. Grombek",
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036ead",
               "name": "Traugott Buhre",
               "profile_path": null,
               "id": 26602,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036eb1",
               "name": "Arndt Schwering-Sohnrey",
               "profile_path": "/qw0j6cwBwfikicm6k7YumTxid23.jpg",
               "id": 36463,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Franz",
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036eb5",
               "name": "Andreas Guenther",
               "profile_path": null,
               "id": 19913,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Gabi",
               "gender": 1,
               "credit_id": "52fe430dc3a36847f8036eb9",
               "name": "Antonia Holfelder",
               "profile_path": null,
               "id": 36865,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Dr. Henning",
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036ebd",
               "name": "Rüdiger Vogler",
               "profile_path": "/dUUXAwPRMkRdv5PSGv8ndWvztDW.jpg",
               "id": 5266,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Frau Henning",
               "gender": 1,
               "credit_id": "52fe430dc3a36847f8036ec1",
               "name": "Barbara Magdalena Ahren",
               "profile_path": "/b7yuOXksXr61CsgAto550We2LSe.jpg",
               "id": 36866,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Paulas Großvater",
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036ec5",
               "name": "Werner Dissel",
               "profile_path": "/d4Mn4GMSyQLSlXZAOwJZoVSc1f7.jpg",
               "id": 36712,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Präparator",
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036ec9",
               "name": "Gennadi Vengerov",
               "profile_path": "/5O6GrF9jxvFMzqsQCs7ZEoMBYjr.jpg",
               "id": 12767,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Professor in München",
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036ecd",
               "name": "Thomas Meinhardt",
               "profile_path": null,
               "id": 36867,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Bernie",
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036ed1",
               "name": "Christoph Hagen Dittmann",
               "profile_path": "/vxgdAPhKuIF1vSKv2hUg5pCHDN6.jpg",
               "id": 34302,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036e67",
               "name": "Stefan Ruzowitzky",
               "profile_path": "/qlN1bMiTQxcOzMMgNQutA6GI47Q.jpg",
               "id": 15115,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036e6d",
               "name": "Stefan Ruzowitzky",
               "profile_path": "/qlN1bMiTQxcOzMMgNQutA6GI47Q.jpg",
               "id": 15115,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036e73",
               "name": "Jakob Claussen",
               "profile_path": null,
               "id": 4525,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036e79",
               "name": "Andrea Willson",
               "profile_path": null,
               "id": 36861,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036e7f",
               "name": "Thomas Wöbke",
               "profile_path": null,
               "id": 4526,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036e85",
               "name": "Marius Ruhland",
               "profile_path": null,
               "id": 36862,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe430dc3a36847f8036e8b",
               "name": "Peter von Haller",
               "profile_path": null,
               "id": 15117,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe430dc3a36847f8036e91",
               "name": "Ueli Christen",
               "profile_path": null,
               "id": 1871,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.906081,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 1698,
      "vote_count": 74,
      "budget": 0,
      "overview": "Medical student Paula Henning wins a place at an exclusive Heidelberg medical school. When the body of a young man she met on the train turns up on her dissection table, she begins to investigate the mysterious circumstances surrounding his death, and uncovers a gruesome conspiracy perpetrated by an Antihippocratic secret society operating within the school.",
      "similar": [
         9348,
         1694,
         1699,
         10328,
         250225,
         15584,
         6217,
         196254,
         60095,
         11285,
         6037,
         116440,
         41959,
         42740,
         12192,
         38103,
         336807,
         19400,
         21997,
         31299
      ],
      "original_title": "Anatomie",
      "runtime": 103,
      "poster_path": "/xVvMgM0WTARC5RMj7JjqtVZh22f.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Claussen + Wöbke Filmproduktion GmbH",
         "id": 161,
         "origin_country": ""
      }],
      "release_date": "2000-02-03",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Anatomy Collection",
         "id": 8412,
         "poster_path": "/5cMGSefT2oJvzRNwX4IvZQOGO20.jpg"
      },
      "tagline": "Some study. Some are studied.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "DEM ",
      "directors": ["Stefan Ruzowitzky"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Peter Engelmann",
         "Stefan Ruzowitzky"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0187696/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NjkyMDA3OF5BMl5BanBnXkFtZTcwNjUxMjcyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Franka Potente, Benno Fürmann, Anna Loos | See full cast and crew »"],
      "reviews": [
         "I was very curious about Anatomy (aka Anatomie) and if I was going to see it, I was going to have to buy it since no video stores in my area carried the film. Since it was not a low-priced DVD, I did take a chance and thought I'd take a peek at other comments on IMDb. Many of the comments didn't give me enough hope of forking out lots of bucks for a film I had never seen nor had any clues about. I basically got the idea it was a sexy youth-oriented romp being compared to many cookie-cutter teen thrillers. Well, something in the back of my mind told me to ignore those types of comments and buy it! I did, and was I pleasantly surprised! If it is going to be compared to any other films, I would say it's a variation of Coma and Extreme Measures. I couldn't see any comparison to films like Scream, Urban Legends, et al. Yes, the cast is young (that's because they're med students! At least they aren't the increasingly boring high school type characters), and yes, some are lusty (basically the character played by Anna Loos is, and it is handled quite tastefully in the German language version), but Anatomy is well constructed, there is a tense mood throughout, the sets are amazing, the makeup effects are a wow, and Franka Potente is very credible in her role. I found myself enjoying all of it despite a few gaping holes in the plot! The story of a student discovering a sort-of secret society doing autopsies on still-living patients is a rather creepy scenario and what happens to those patients afterwards is quite clever. Sure, you could ask why didn't she just GET OUT OF THAT TOWN? Okay, but then the film would be over within a half hour. This was the first effort from the German part of Columbia Pictures, and it's actually quite an impressive one. There was a bit of care in the production and to actually offer some genuine thrills is an accomplishment. It is a bit mature in mind, as it doesn't resort to constant opportunities for sexual encounters(a breast fest) or juvenile drug jokes. Anna Loos' character, while often making sexual remarks and looking for some fun, was actually a nice touch--having a character that was a woman more intelligent than any of the men in the school. She found that sex was really just a distraction for her and the men rather lacking. THE IMPORTANT STUFF: Watching this film in the original German language with English or French subtitles is the BEST way to enjoy it. I saw the theatrical trailers dubbed in English and was disgusted by the change it made in the film's tone. I have never seen a properly dubbed film in my life--they never can find voices that suit the film's actors or characters. Sure enough, I tried to watch some of Anatomy dubbed in English and the intelligence level of it dropped severely, making it seem more like a comedy. A good example is when one guy was freaked out at being cut open and screamed to be sewn back up--hearing it in German he sounded frantic, but dubbed in English he sounded like a comedian. Frankly, I'm sick of hearing people say they can't handle reading subtitles or watch a \"letterboxed\" film. Anatomy comes off as silly with dubbed voices that seem octaves too high for any of the people you see in the film, and Anna Loos' sexual comments then just sound like awful remarks right out of Fast Times At Ridgemont High. I wonder if the negative comments about Anatomy are from people who watched it dubbed, it just doesn't seem like the same film at all! This is not a cheap horror film and deserves to be viewed as it was created. Interesting to note that some of the English subtitles are different in scenes in the feature and the \"making of\" supplement. As it turns out, I gambled and won with Anatomy. It's a competent thriller with likeable characters and doesn't try to go for cheap thrills.",
         "When Medical student Paula Henning (Franka Potente, of \"Run Lola Run\" fame\") wins a highly coveted scholarship, she's understandable enthused. But strange experiments are being done on live sedated bodies somewhere on the premises. When she recognizes a corpse as the boy she met on the train there, she decides to snoop around. What starts of as a reasonably captivating little thriller derails completely by the third act and becomes a carbon copy of any other slasher film made, which is a shame as if the film just stayed on target, it would've been something special, as the acting was good into then and the camera-work was pretty good throughout. My Grade: C DVD Extras: Commentary with director Stefan Ruzowitzky; 2 Deleted scenes with commentary by director Stefan Ruzowitzky; Anna Loos - My Truth (music video); 2 & a half minute Make-up featurette; barely 5 minute Making-of featurette; Talent files; Production photos; Storyboard comparisons; Dubbed Teaser & Theatrical trailers; and Trailers for \"Circus\" (2000) & \"Run, Lola, Run\"",
         "ANATOMY (Anatomie) Aspect ratio: 2.39:1 Sound formats: Dolby Digital / SDDS A brilliant med student (Franka Potente) is pitched into a conspiracy at Heidelberg University, where a secret fraternity of medical deviates practice dissection on living subjects... Stefan Ruzowitzky's superior thriller - the debut feature of Columbia Pictures' European production arm - derives inspiration from similarly-styled US shockers of the period (SCREAM, I KNOW WHAT YOU DID LAST SUMMER, etc.), and exploits the audience's worst fears about invasive medical procedures. Beautifully photographed by STALINGRAD's Peter von Haller, the film contrasts picture-postcard Heidelberg with the silver-grey starkness of the anatomy rooms where German superstar Potente struggles to disentangle herself from an ancient conspiracy of horror. Second-billed Benno Fürmann (THE PRINCESS AND THE WARRIOR) - the film's 'token' beefcake - emerges as a key player around the movie's halfway mark, beginning with a nerve-shredding set-piece recalling the potato truck sequence in Hitchcock's FRENZY (1972). In a happy turnabout from standard practice, all the nudity in the film is male-oriented, including what Ruzowitzky has described as Fürmann's \"famous butt shot\"!! Who says modern horror movies aren't camp? Great fun, and followed by ANATOMY 2 (2003). (German dialogue)",
         "Okay, I had reasonably high expectations for this. The controversial subject matter was a good concept. As a horror fan I admit I was fascinated and very excited about this. It turns out they had a great idea, but it was terribly executed. Let's see. This movie seems to run in 3 modes: Happy, Sex and Dark. The problem is that the movie never decides what it wants to be. The \"Happy\" parts I believe were meant to contrast with the \"Dark\" parts, but it doesn't work. The soundtrack is one of the reasons. The movie transitions between these 3 modes very badly, I can't even begin to say how much the directing and editing suck. There's sex in the most unappealing and unerotic way. I'm not complaining but even for Horror standards they were unnecessary and filler. The characters are all unlikeable with the exception of Paula (Potente). Her friend from Munich is a slut and possibly one of the most annoying characters in movies I've come across recently. There's a bit of plot which I won't go into detail... It's not stupid and in more talented hands would make a good movie. There's even a nice twist and a cool conspiracy going on. Don't try to understand everything because there are giant plot holes here. It's all so shoddily done that you don't care for the victims, the perpetrators, anyone. And to think this could have been great. I can say ONE good thing about it which is, the movie shed some light on today's unethical medical procedures. With genetics and controversial sciences advancing, this could have been a great philosophical film that raises and discusses these questions. But you won't find that here, just a series of scenes loosely pasted together with people and things that you don't care about. Skip this and go watch Flatliners instead, you're welcome. 3/10",
         "\"Anatomy\" is a somewhat decent film if not entirely all that great. **SPOILERS** Preparing for her studies, Paula Henning, (Franka Potente) is accepted into Heidelberg University with Prof. Grombeck, (Traugott Buhre) in his Anatomy Class, said to be one of the most advanced and prestigious around. Meeting with other students Gretchen, (Anna Loos) and Caspar, (Sebastian Blomberg) in the class, she wonders if her family reputation will affect her chances. When she gets back to her classes, she starts to wonder about the selection of corpses used, and begins to suspect that something isn't right. Investigating the situation, she finds evidence that an illegal practice of outlaw doctors performing unethical experiments is linked to several professors on the campus, and she soon finds herself targeted to keep the secrets hidden, and she races to stop them from doing so. The Good News: There wasn't a whole lot to this one. One of the best parts to this is the mystery angle that's played up about what the practice is really doing and who's involved, generating some tension to this one later on. The fact that it does this is actually a fun idea, as there's plenty to be crept out at by the rather large amount of time spent among cadavers, which is enough on it's own but here, using the practice is where it really scores a lot of great scenes where she's investigating them. That the look to them is really creepy is another big plus, as the look where they remain intact but are displayed so that the inner workings and organs are visible, often-times while the skin is still attached to the rest of the body, producing a cool and creepy visual. The film does include a little sleaze with it's really fun striptease in the morgue. It works nicely and really gets those elements into the film. The last good plus is the fact that the last half of the film is a full-on traditional slasher movie sequence, complete with a creepy stalking through the library and out into the rest of the campus and is done with a lot of fun times and come really good moments to come along with it. It's one of the better scenes in the film and they're all quite well done, leaving these as the highlights of the film. The Bad News: There was a couple of really big flaws noticeable for this one. One of the main ones is the complete lack of true horror atmosphere for the film. The idea behind it isn't exactly the greatest one to provide some horror elements, seemingly set-up like a thriller instead with the inclusion of the evil cult and the very way it's handled in here. The fact that it's introduced into the film so very late as it is does account for some flaws, as we're left with the utter dullness of the first half's focus on the special classes and the behavior surrounding them that not a lot of horror-specific elements are presented into the film, but also because it does this, we don't really know a whole lot about the cult to begin. Seemingly, it relies on the notion of being practitioners of illegal experiments to create it's fear of them, since we know nothing about the other than how they work, which can work if they only went into action more often as they don't really do that much anyway. That manages to make the cult hardly involved in the film about them and completely nonthreatening due to their absolute non-appearance and complete cluelessness over what they are actually doing, effectively reducing their fear. The last flaw here is the fact that this one is really dull, as it doesn't have a whole lot of stuff that manages to stick out as being worthwhile for the longest time due to the inclusion of all the other elements mentioned so far make it all the more boring. These here are the film's flaws. The Final Verdict: Not entirely worthless, but not all that enjoyable either unless you happen to be a fan of these films or like the concept. If either of these apply to you, then this will be highly recommended viewing, otherwise this will most likely be a severe disappointment and should be viewed with caution. Rated R: Graphic Violence, Graphic Language, Nudity and a mild sex scene",
         "Medical student Paula Henning wins a place at an exclusive Heidelberg medical school. When the body of a young man she met on the train turns up on her dissection table, she begins to investigate the mysterious circumstances surrounding his death, and uncovers a gruesome conspiracy perpetrated by an Antihippocratic secret society operating within the school. Disturbing and gross, lots of scary parts. It even has a good script and ending. But it has a one poor part. What else could you see from this movie? It's a good mystery and horror movie. But, of course, if you like it, Go buy it. If you don't, there still is not reason to waste your money on this. Rated R for Extreme Graphic Violence, Sexual Situations and Profanity.",
         "I was looking forward to this movie as everyone was talking about it as being a good horror movie, and finally an European one. So, maybe my expectations were to high. It begins with a good quiet horror/shock sequence but it lets you down right away in the following scenes, where the plot begin being introduced, as the acting and the motivation/life of the characters reveals itself no better than any 'made for TV' drama. It keeps that way right into the end. About the horror part of the movie, it is certainly a good idea and a different one, but ALL the scenes are of the 'seen it before' kind. Overall, my idea of this movie was that it had a good concept, which was inserted into a mediocre story, bad acting and less than tolerable plot holes.",
         "I saw (unfortunately) the dubbed version on Encore. Student Paula Henning (Franka Potente who was also in the cult favorite \"Run Lola Run\") stars as a serious medical student who gets into a prestigious school in Germany. But she soon discovers that some students go missing and the bodies they work on in the anatomy lab are incredibly fresh... I was stuck seeing the dubbed version on Encore. It hurt a lot (the words not matching the lips got annoying real quick) but I still liked what I saw. The acting was good, it was beautifully photographed, it wasn't TOO gruesome and I was never bored. Even more refreshing was a likable heroine who fights back when the bad guys go after her. The (mild) nudity was, in a refreshing twist, male! A previous poster mentions Benno Furmann (who is excellent) showed his butt but I don't remember seeing it. Regardless this is a well done, scary and excellent thriller. From all I've read the original German language version is the best (I don't doubt that for one second) but the dubbed version is watchable. I give this a 7.",
         "Anatomie (Anatomy) is an entertaining and engaging film that falls short of delivering the discomfort that should be connected with the films subject matter. The idea of ethical ignorance in the medical science world is one that pushes the viewer towards discomfort, and the realism of the institutions ('Heidelberg') and the special effects make it a not-entirely easy film to watch. However, the characters, the script, and the gloss of the film all seem too familiar with the Scream movies that repopularised this sort of genre. Sadly, then, whilst the subject is one to care about, the viewer is presented with another movie full of college student characters that we don't really get a chance to care about, unresolved subplots, and hammy stage-killings that have been reinventing themselves since the memorable Drew Barrymore opening scene in Scream several years back. Steven Ruzowillzky makes a fair effort of the script and the direction, but pushes no boundaries other than the general theme. Whilst we are presented with an entertaining film with some reasonable performances, we are unfortunately left with the old feeling: nothing is wrong with this film, but nothing is extraordinary either. An entertaining film, and an interesting chance to see how foreign filmmakers have been influenced by the post-scream 'horror' culture. 6 out of 10",
         "Before Franka Potente became famous with the Bourne trilogy she made this German movie. As a student in, you guessed it, anatomy she has to go to the most important school to learn that but there is a secret. Some people joined a kind of mason. She notices that something is terrible wrong in the school and she starts to investigate. Wrong. What happens next isn't really horror it's more some kind of thriller but you really have to watch it for the effects. A few years ago it was a hype to see the exhibition Kopferwelten. What you saw there is what we have here only they didn't used real bodies but it was so nicely done that it could be used in classes. It never becomes gory or even bloody, it is really the atmosphere that creates the movie. But it is one that you must have seen because, some people fears that it could happen to you...."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Deutsche Columbia TriStar Filmproduktion",
         "Claussen & Wöbke Filmproduktion GmbH"
      ],
      "summaries": ["Medical student Paula Henning wins a place at an exclusive Heidelberg medical school. When the body of a young man she met on the train turns up on her dissection table, she begins to investigate the mysterious circumstances surrounding his death, and uncovers a gruesome conspiracy perpetrated by an Antihippocratic secret society operating within the school."],
      "budget": 8400000
   },
   "movielensId": 3892,
   "movielens": {
      "languages": [
         "Deutsch",
         "Latin"
      ],
      "releaseDate": "2000-02-03",
      "dvdReleaseDate": "2001-04-03",
      "directors": ["Stefan Ruzowitzky"],
      "runtime": 103,
      "movieId": 3892,
      "title": "Anatomy",
      "mpaa": "R",
      "actors": [
         "Franka Potente",
         "Benno Fürmann",
         "Anna Loos",
         "Oliver Wnuk",
         "Sebastian Blomberg",
         "Holger Speckhahn",
         "Traugott Buhre",
         "Arndt Schwering-Sohnrey",
         "Andreas Guenther",
         "Antonia Holfelder",
         "Rüdiger Vogler",
         "Barbara Magdalena Ahren",
         "Werner Dissel",
         "Gennadi Vengerov",
         "Thomas Meinhardt",
         "Christoph Hagen Dittmann"
      ],
      "imdbMovieId": "0187696",
      "originalTitle": "Anatomie",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["4n-r9zSxw3A"],
      "plotSummary": "Medical student Paula Henning wins a place at an exclusive Heidelberg medical school. When the body of a young man she met on the train turns up on her dissection table, she begins to investigate the mysterious circumstances surrounding his death, and uncovers a gruesome conspiracy perpetrated by an Antihippocratic secret society operating within the school.",
      "tmdbMovieId": 1698,
      "avgRating": 2.969,
      "releaseYear": "2000",
      "numRatings": 371,
      "posterPath": "/xVvMgM0WTARC5RMj7JjqtVZh22f.jpg"
   }
}