{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "puberty",
            "id": 1525
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "make a match",
            "id": 6664
         },
         {
            "name": "spoiled child",
            "id": 7208
         },
         {
            "name": "gay interest",
            "id": 10199
         },
         {
            "name": "conflict",
            "id": 11933
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0112697",
      "video": false,
      "title": "Clueless",
      "recommendations": [
         8835,
         4951,
         15144,
         10314,
         11522,
         2640,
         11355,
         796,
         10625,
         2028,
         11003,
         9454,
         9377,
         4032,
         9451,
         11814,
         14926,
         11846,
         9655,
         10327
      ],
      "backdrop_path": "/kcjy02lvDIvqQsce0NSnDAr4zve.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Cher Horowitz",
               "gender": 0,
               "credit_id": "52fe4510c3a36847f80ba283",
               "name": "Alicia Silverstone",
               "profile_path": "/12OZNUQRfloOCJ7Q4JQneojSyQ4.jpg",
               "id": 5588,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Dionne",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba287",
               "name": "Stacey Dash",
               "profile_path": "/1YZ5qh5Bq1lfozK5ZYpatOAcui1.jpg",
               "id": 58150,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Tai",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba28b",
               "name": "Brittany Murphy",
               "profile_path": "/jktbTmFE3TVaKUqPDWw8VZ5rXqc.jpg",
               "id": 328,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Josh",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba28f",
               "name": "Paul Rudd",
               "profile_path": "/8eTtJ7XVXY0BnEeUaSiTAraTIXd.jpg",
               "id": 22226,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Murray",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba293",
               "name": "Donald Faison",
               "profile_path": "/j3YbuYlQgqLNY0YdtgFR6Jn5imo.jpg",
               "id": 49002,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Amber",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba297",
               "name": "Elisa Donovan",
               "profile_path": "/aIm3lSLC7XlqGudvyPZ1WxBJ4Ud.jpg",
               "id": 58151,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Travis",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba2a1",
               "name": "Breckin Meyer",
               "profile_path": "/7V3hXjmSJXApsuu2aGkEgFFAy03.jpg",
               "id": 33654,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Elton",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba2a5",
               "name": "Jeremy Sisto",
               "profile_path": "/o2FDlQQWOxF18Bq6hDvhiQZE8i9.jpg",
               "id": 23958,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Mel Horowitz",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba2a9",
               "name": "Dan Hedaya",
               "profile_path": "/5E4SUVfLMUKNCiP0dMhyOv3XHVZ.jpg",
               "id": 6486,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Mr. Wendell Hall",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba2ad",
               "name": "Wallace Shawn",
               "profile_path": "/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg",
               "id": 12900,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Miss Toby Geist",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba2b1",
               "name": "Twink Caplan",
               "profile_path": "/a6iDJoy42QZP1DfL3ybHQeXT5DU.jpg",
               "id": 66160,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Christian",
               "gender": 0,
               "credit_id": "52fe4510c3a36847f80ba2b5",
               "name": "Justin Walker",
               "profile_path": null,
               "id": 30881,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Miss Stoeger",
               "gender": 1,
               "credit_id": "56b0c16b9251412eb600000f",
               "name": "Julie Brown",
               "profile_path": "/8a1NwjIyjOWmYTqdj4fuxqKlzR5.jpg",
               "id": 40680,
               "order": 12
            },
            {
               "cast_id": 28,
               "character": "Summer",
               "gender": 1,
               "credit_id": "583a4c13c3a36862ed0001a5",
               "name": "Nicole Bilderback",
               "profile_path": "/zX98CB1FCasfLGKhQ9pmEm9yYvZ.jpg",
               "id": 17775,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba261",
               "name": "Amy Heckerling",
               "profile_path": "/c68tZT9Be1triBbKmSOKCS3dsBI.jpg",
               "id": 57434,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba267",
               "name": "Amy Heckerling",
               "profile_path": "/c68tZT9Be1triBbKmSOKCS3dsBI.jpg",
               "id": 57434,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba273",
               "name": "Scott Rudin",
               "profile_path": "/zR8sdlGblto6dneAr2mckTowwEl.jpg",
               "id": 2997,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4510c3a36847f80ba27f",
               "name": "Bill Pope",
               "profile_path": null,
               "id": 9341,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba29d",
               "name": "Debra Chiate",
               "profile_path": null,
               "id": 57426,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55400f7d9251414af00002c8",
               "name": "Robert Lawrence",
               "profile_path": null,
               "id": 1460574,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "563606b99251413b4600c5d8",
               "name": "Steven J. Jordan",
               "profile_path": null,
               "id": 38411,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56360687c3a3681b59019c36",
               "name": "David Kitay",
               "profile_path": null,
               "id": 25143,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5636069cc3a3681b5e019598",
               "name": "Mona May",
               "profile_path": "/tvGFgAsywjg11roGj3YW1Ukv0mE.jpg",
               "id": 42909,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "563606ddc3a3681b5401b6fd",
               "name": "Karyn Rachtman",
               "profile_path": null,
               "id": 6940,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "563606f7925141285701a5c4",
               "name": "Marcia Ross",
               "profile_path": null,
               "id": 51557,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 14.015505,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9603,
      "vote_count": 1089,
      "budget": 12000000,
      "overview": "Shallow, rich and socially successful Cher is at the top of her Beverly Hills high school's pecking scale. Seeing herself as a matchmaker, Cher first coaxes two teachers into dating each other. Emboldened by her success, she decides to give hopelessly klutzy new student Tai a makeover. When Tai becomes more popular than she is, Cher realizes that her disapproving ex-stepbrother was right about how misguided she was -- and falls for him.",
      "similar": [
         449176,
         455661,
         17130,
         19458,
         112160,
         141,
         376867,
         43923,
         133805,
         376660,
         10206,
         192132,
         2108,
         858,
         7326,
         10229,
         8363,
         8193,
         272693,
         315635
      ],
      "original_title": "Clueless",
      "runtime": 97,
      "poster_path": "/i8gEHh2sszB6YWLC0jl559sxAeN.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-07-19",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Sex. Clothes. Popularity. Is there a problem here?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Amy Heckerling"],
      "runtime": 97,
      "synopsis": "Cher Horowitz (Alicia Silverstone), a wealthy, popular 15-year-old, lives in Beverly Hills with her widowed father, Mel (Dan Hedaya), in an enormous house, enjoying the luxurious life that Mel provides as a very successful lawyer. Though good-natured, Cher is naive and caught up in a superficial lifestyle revolving around expensive clothes and the social hierarchy of her school. Her best friend Dionne (Stacey Dash) has a similar outlook on life, though she dates a high school boy (Donald Fasion), which Cher claims is a pointless endeavor. Cher's debate teacher, Mr. Hall (Wallace Shawn), gives her a C grade for the semester, which starts a dramatic chain of events. Dionne, who got a lackluster grade as well, hatches a plan with Cher to find a romantic interest for Mr. Hall, thus making him happy enough to consider boosting their grades. They select another teacher, Miss Geist (Twink Caplan), as the chief candidate, and slip a fake love letter into her mail cubby. She soon begins dating Mr. Hall, and both teachers become much more lax with their grading. Cher works her grade up to an A minus, greatly impressing her father. At home, Cher interacts with Josh (Paul Rudd), the college-age son of one of Mel's ex-wives, who often stays at the Horowitz home to avoid his mother and new stepfather. Josh and Cher usually have a typical sibling relationship, with mild arguing and teasing. Josh is nearly the polar opposite of Cher: an earthy, environmentalist, do-gooder.. Tai Frasier (Brittany Murphy), is a grungy artist with a trusting disposition and a clueless grasp of high school popularity, transfers to Cher's school. Cher and Dionne befriend Tai, and decide to give her a makeover to improve her social standing. However, Tai sparks up a romance with cheerful, skateboarding stoner Travis (Breckin Meyer). Cher attempts to steer Tai toward the rich and popular Elton (Jeremy Sisto), and leads her in after-school workout sessions. Josh disapproves of Cher's project with Tai, and accuses her of attempting to turn an innocent girl into a superficial brat. Through a series of subtle hints, Cher gets Tai and Elton to notice each other. Tai is giddy with excitement, and while surprisingly receptive, Elton pays much more direct attention to Cher. To present the newly made-over Tai to the high school elite, Cher and Dionne bring her to a party. Once again they attempt to steer her toward Elton, and believe that they made a connection when Tai is knocked unconscious with a projectile shoe, and Elton revives her with an ice pack. However, when departing, Cher winds up being driven home by Elton, who makes a pass at her, revealing that he had been interested in her all along. Cher is shocked and repulsed, and Elton abandons her in a parking lot far from home, where she's immediately mugged, and is forced to call Josh from a payphone to come pick her up. On the drive home, Cher suggests that they pick up food for Mel and his colleagues, who are working on a difficult case at the house. Impressed by Cher's consideration, Josh begins to form a new opinion of her. Another new student, suave and handsome Christian, transfers in. Cher is taken with him immediately, and considers breaking her own rule of never dating a high school boy. The two become friends, and attend a party along with Tai. After Christian picks Cher up, Josh is clearly envious and tells Mel that he will trail them to the party for Cher's protection. Cher and Christian bond on the dance floor, while Tai is self-consciously standing alone in a corner (watching Elton dancing with his new girlfriend, Cher's social rival Amber). Josh arrives and dances with Tai to cheer her up, which Cher notices and is surprised at his thoughtfulness. Cher decides to move things forward with Christian, and invites him over one evening when her father is out. To her disappointment, he ignores her advances in favor of watching Tony Curtis movies. When driving with Dionne and her boyfriend Murray the next day, Cher laments her situation, causing Murray to burst out laughing and point out that Christian is obviously gay. Cher is embarrassed at her misconception, but remains good friends with Christian. While at the mall, Tai experiences a brush with death as some male acquaintances nearly drop her over the rail from the upper level. Though she escapes unscathed, Tai becomes something of a celebrity at school, surpassing Cher in popularity and rebuffing her love interest, Travis, troubling Cher. Cher fails her long-anticipated driving test, and returns home dejected. Tai confides in her that she has a crush on Josh after he had danced with her at the party. Cher is confused at the feelings that arise in her at Tai's confession, and tries to convince Tai that she and Josh do not mesh well together. Tai is affronted and insults Cher (\"You're a virgin who can't drive!\"). A miserable Cher goes shopping to clear her head, and realizes that she herself is in love with Josh. In an effort to impress Josh, Cher collects donated items for victims of the Pismo Beach disaster, surprising him with her dedication and selflessness. When Josh and Cher help a stressed Mel out with his case by doing paperwork at the house, Cher makes an error and is insulted by an angry associate of Mel who leaves in a huff. Josh defends her, and they admit their feelings for each other. Soon afterward, Miss Geist and Mr. Hall are married. Cher, Josh, Dionne, Murray, Tai, and Travis attend the wedding, with Cher skillfully catching the bouquet.",
      "writers": ["Amy Heckerling"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112697/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxODIxODE2MF5BMl5BanBnXkFtZTgwOTA4NjQxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Alicia Silverstone, Stacey Dash, Brittany Murphy | See full cast and crew »"],
      "reviews": [
         "Director Amy Heckerling knows a thing or two about high school flicks, having directed the highly successful `Fast Times at Ridgemont High'. Heckerling put her talents to work thirteen years later for the next generation of high schoolers, writing and directing this hilarious satire of life at Beverly Hills H.S. Heckerling takes a different approach from `Fast Times', which found its comedy in the absurdity of reality, depicting situations into which teenagers really get themselves. Here Heckerling's comedy mostly comes from mocking the superficiality of the high school `in-crowd'. While this is not the first time this has been done, few have ever done it with such blistering wit. This film became the standard for a spate of 1990's high school flicks set on the west coast that borrowed many of its elements. The story focuses on Cher Horowitz (Alicia Silverstone), who is the most popular girl at Beverly Hills H.S. Cher seems to be a superficial airhead, but this belies her conniving and manipulative skills at getting what she wants. Superficial yes, airhead no! In a plot derived in part from Jane Austen's `Emma', Cher works behind the scenes to arrange love matches between various students. She even orchestrates a relationship between two teachers to improve their moods so they don't grade so harshly. Like Emma, she is a master of love for everyone but herself. Heckerling does a fantastic job of presenting what seems on the surface to be a cotton candy story with lightweight characters, but really runs much deeper revealing subtle truths about human nature. Her direction of the fledgling cast is superb, milking every ounce of comedy out of each scene. Silverstone sparkles in the role, which is probably not far from a reality with which she is very familiar. She actually attended Beverly Hills H.S. with co-star Breckin Meyer, although she didn't graduate due to career commitments (she received a G.E.D.). This film catapulted her to teen prominence with two MTV movie awards and an American Comedy Award as funniest actress in a leading role. She plays Cher with both arrogance and vulnerability, and her comic timing is impeccable. She also has a knack for physical comedy, with a broad range of contorted facial expressions and amusing use of body language. The rest of the teen cast is also great, especially Brittany Murphy as Tai and Breckin Meyer as Travis. Dan Hedaya is also priceless as Cher's work obsessed attorney father. This film is easy to like. It is a light and funny spoof, but it still has nuance. I rated it an 8/10. For those who enjoy high school comedies, this is required viewing.",
         "\"Let's set 'Emma' in a modern high school!\" Does this sound the obvious kind of movie gimmick that everyone uses nowadays? Perhaps, but it's an inspired idea all the same. Jane Austen's characters, and her readers, and the society in which her novels are set, like Jane Austen herself, are HEAVILY conscious of class and social standing. No atmosphere quite so snobbish exists in the modern world. EXCEPT, that is, in the corridors and courtyards of the right kind of high school. And where else in the modern world would you find so many people who seem to spend all their time calling on one another? I was reminded of how well Heckerling moulded \"Emma\" to fit a modern setting when I saw the idiotic 1998 version of \"Great Expectations\", adapted by someone who somehow failed to notice how important all the stuff about class and snobbishness was. It's clear that Heckerling understood her source. She isn't afraid to make changes - even radical changes, if the modern setting requires as much - and no character exists MERELY because they have an analogue in Austen's novel. (The most crucial thing is that the Emma-equivalent be sufficiently charming; and so she is.) The result is a film which is winning and satisfying, whether or not you know anything about the source material.",
         "\"Isn't my house classic? The columns date all the way back to 1972.\" When romantic high-school comedy Clueless (1995) was released, it was immediately vaulted into cult-status and firmly stapled as one of the most original teen-flicks of the 1990s. 'Original' is perhaps a term wrongly applied since it is based on the queen of romance Jane Austen's Emma (1815) . But what Clueless did was update the classic story by coating it with high school drama, teenage girls and shopping and sprinkle it with heavy doses of humour. Emma is no longer Emma; she is Cher (Alicia Silverstone), a spoiled rich girl walking around in her Beverly Hills mansion in a bubble of stereotypes and teen-clichés -- but with a great big heart. So big-hearted, in fact, that she takes on the lost goofy new girl in her school to find her love and popularity, knowing full-well that it could destroy her own reputation. Clueless thus sees Cher and her best friend Dionne (Stacey Dash) on a mission to do good. Real good. All the detours this mission entail are captured brilliantly in the film, taking the form of love-interests, parties, shopping and misunderstandings. From Cher's grumpy lawyer-father (an hilarious Dan Hedaya) and her nerdy step-brother (a likable Paul Rudd) to her eccentric group of friends at school, Clueless is a superb ride of teenage comedy camp. Only just over 10 years old, it is still extremely dated today. But no matter, because the 90s clichés like skateboarding, Marky Mark and the catch-phrase \"As if\" just make it so much more contemporary and fun to watch. What elevates Clueless (1995) above generic high school comedy is its use of stereotypes. In most films they are unintentionally there to create a subconscious effect, but in Clueless they are made fun of to a much higher degree -- they are overblown and glorious. It brutally satirizes rich kids and their 'problems' and juxtaposes them with a classic, heart-felt love-story. The kind that only Jane Austen can write. 9/10",
         "This movie is another one of those feel good pictures you can't go wrong with. It's light and breezy like cruising the boulevard with the top down and it offers lots of laughs to boot. Amy Heckerling has brought us another winner with a great supporting cast. A young teenage girl coming of age in of all places, Beverly Hills. The lead character, \"Cher\" played brilliantly by Alicia Silverstone, is a self centered high school girl in the beginning of the picture who's only interests include clothes, cars and credit cards. As the film progresses, she begins to mature and actually begins to care about other people, not to mention her environment. It's worth renting anytime. Just like \"European Vacation\" it doesn't matter how many times you see it, it still makes you laugh and that's worth it all.",
         "A silky-smooth, vanilla-coated pleasure about matchmaking in modern-day high school. Far from the insufferable smugness of all those '80s teen-flicks, \"Clueless\" is bright--in both senses of the word--clever, funny, fanciful and yet grounded in reality (a rich one). Alicia Silverstone is adorable, but the supporting cast is affable and seemingly carefully-picked (they all get their share of funny lines and star-making scenes, particularly Dan Hedaya, superb as Silverstone's father). Seems more inspired by Jane Austen's \"Emma\" than based upon it, with a few mean-spirited lines but plenty of lightly innocent laugh-getters. *** from ****",
         "This movie is way above so many of the others of its' kind. It's consumately likable, funny, sweet and sharp- the script is a killer, and the acting is fun and enjoyable. Part of the success of the film is due to the fact that it appeals to several different audiences, and on multiple levels. I first watched this movie with my mom, who loved the link it has to Jane Austen's Emma- all the main characters and the plot are direct modern equivalents to the novel. For instance, the famous passage in Emma inwhich Harriet burns all her \"mementos\" of Mr. Elton becomes the scene where Tai does so infront of Cher's gasfire. From this perspective alone, the movie is so fun and sharp to watch- even if your forte isn't usually American Teen High School comedy! But this movie works on a really dumbed down scale too- let's face it, not everyone is big on English literature. The movie has an awesome soundtrack, Paul Rudd is unbelievably cute as \"Mr Knightly\" or rather Josh- and my boyfriend leads me to believe that the same is true of Alicia Silverstone- who still sparkles 10 years later as a mid-nineties teen queen with good intentions, Cher. Her performance here is impossible not to warm too, unless you have some sort of grudge against Valley girls, inwhich case you might not like it so much. Seriously though, this film is a must see for anyone who likes some real quality comedy- I'm so fond of this film personally that I would suspect basically everyone would enjoy it.",
         "I wasn't expecting much of this movie, until I started seeing it. It turned out to be quite entertaining. \"Clueless\" is about the shallow and rather stupid rich girl Cher Horowitz, who only cares about herself and how popular she is. But then she starts this kind of 'project', together with her best friend. One of the aspects of this project is about making a new silly girl of their school look as 'cool' as they are. This 'silly' girl is very well performed by Brittany Murphy. I hardly recognized her! The lead role is for Alicia Silverstone who gives an excellent performance as well. Furthermore there is another great performance Paul Rudd (who we also know as Phoebe's boyfriend in \"Friends\"). Also Dan Hedaya and Breckin Meyer (Road Trip) are funny. Funny and very entertaining movie from the director of \"Look Who's Talking (Too). Definitely worth watching! 7,5/10",
         "Just the other day I watched Heckerling's wonderful romantic comedy satire 'I Could Never Be Your Woman' and I thought I'd revisit 'Clueless'. The last time I saw it was 10 years ago and today I enjoyed it just as much. Heckerling's adaptation of Jane Austen's 'Emma' may appear like a fluffy teen flick on the surface but there is a lot more to it. It works on multiple levels and 'Clueless', in a way, is a social commentary as it reflects a reality that still exists in today's society. First of all, the teen life is very realistically portrayed albeit with a sarcastic tone (such as the striving for high grades, obsession with image and partying). It somewhat reminds me of 'Heathers' (another excellent teen satire). While 'Heathers' is a much darker film that looks at teens in the 1980s, 'Clueless' looks at the adolescents of the 90s. Moreover, Heckerling brilliantly uses different kid of comedies through one-liner and dialogue, situational, and slap stick. Then the class distinction too is cleverly demonstrated through the eyes of Cher. The characters too work on multiple levels. Cher appears to be a popular stuckup bimbo type lass but once Hecklerling allows us to dig a little deeper, we see that she is unintentionally manipulative and knows how to use her strength (her power of persuasion). Yet, she is good at heart and even though her initial intentions of getting the two teacher together was to get an A grade, she's happy with the outcome of her matchmaking and the acts that follow are with more sincere purpose. Tai too appears to be the dumb new girl but she is far more experienced than Cher and when opportunity strikes she makes a place for herself in 'society' (i.e, highschool). Alicia Silverstone plays the part as though it was made for her. She has the right looks, age, excellent dialogue delivery and is a total natural in performing. 'Clueless' was the film that made her an overnight star and a very promising actress however, unfortunately, her following movies have been disastrous and the actress rapidly vanished into oblivion. She is supported by an equally great cast that includes a goofy Breckin Meyer, a weirdly fashioned but still gorgeous Stacy Dash, a naive Brittany Murphy, a laidback Paul Rudd, a hilarious Donald Faison, a bitchy Elisa Donovan and a fire breathing Dan Hedaya. For me 'Clueless' is among the top teen films along with movies like 'Heathers'. Those who childishly dismiss it as a fluffy chick-flick don't know what they missed. I was watching '10 Things I Hate About You' which is an adaptation of Shakespeare's 'The Taming Of Thew Shrew' and while that film failed to engage me for the most parts, 'Clueless' succeeds in all departments because it's much more than just another teen flick. It's a highly entertaining satire and it's a nuanced teen comedy with a subtle social comment.",
         "A generally quite well made, enjoyably stylish and interesting matchmaking tale aimed at teen audiences, the film manages to incorporate a number of very clever parallels to Jane Austen's matchmaking novel 'Emma' while also providing a good satire on high school life. The idea is somewhat simplistic, the plot is sort of predictable, and the young performers all look too old for their teenage characters, but these are all minor vices against this strong entry for the teen flicks genre, with a surprisingly very realistic and actually almost heartfelt performance by Alica Silverstone to top it all off.",
         "Cher (Alicia Silverstone) is a popular ditz at her local high school in Beverly Hills. She's a spoiled, pampered little princess with all the right social connections and endless wealth. However she has yet to find a man in her life - all the Baldwins (as she and her clique of friends call guys they like) have been taken. When Cher receives a foreign exchange student, she takes her under her wing and decides to try and find her a boyfriend - ironically without having her own yet. Predictability ensues. I read \"Emma\" in early high school as I'm sure most kids did, and the movie puts a clever spin on the tale. Alicia Silverstone is surprisingly good in her role, perfectly playing a blond bombshell without a brain but a good heart - only Reese Witherspoon has done such a good job recently at portraying the west coast bimbos. (No offense to the west coast bimbos out there.) The movie's director, Amy Heckerling, has always been rather reliable on the whole and her direction is solid here - she could have turned \"Clueless\" into a crude, unfunny sex comedy with little wit or brains, but instead she takes a rather dubious idea for a film and transforms it into a well-made, well-acted, funny, inspired, lively, witty satire. Much better than expected."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Cher, a high school student in Beverly Hills, must survive the ups and downs of adolescent life. Her external demeanor at first seems superficial, but rather it hides her wit, charm, and intelligence which help her to deal with relationships, friends, family, school, and the all-important teenage social life.",
         "Cher is rich, pretty, blonde, popular and knows how to talk anyone into doing just about anything. When she can't get a teacher to give her a better grade, she and her friend Dion match him up with another teacher to make him happier... and maybe a but laxer on his expectations. When a girl named Tai transfers to Cher's school, she and Dion give her a makeover and attempt to find her a boyfriend. Cher soon realizes that she wants a boyfriend herself, but no one seems right. She goes through a spiritual makeover and realizes that there's more to life than clothes and popularity before she finds the boy of her dreams.",
         "Cher Horowitz and her friend Dionne, two of the most popular sophomores in school, play matchmakers for two teachers. Inspired by their success, Cher takes under her wing Tai, a \"clueless\" transfer student. While trying to make an advantageous match for Tai, Cher attempts to find a boyfriend of her own. Several misfires take place, due to poor communication, before she finds the Baldwin of her dreams.",
         "Cher and Dionne are best friends who live in Beverly Hills. They are popular, rich, pretty, and charming. One day, they spot a new girl at school, Tai, and decides to do a makeover on her. They are very successful, but Cher realizes that she needed a makeover herself in a spiritual way. With this makeover, she learns about caring for others, going through pain, and love.",
         "A rich high school student tries to boost a new pupil's popularity, but reckons without affairs of the heart getting in the way."
      ],
      "budget": 12000000
   },
   "movielensId": 39,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1995-07-19",
      "dvdReleaseDate": "2005-08-30",
      "directors": ["Amy Heckerling"],
      "runtime": 97,
      "movieId": 39,
      "title": "Clueless",
      "mpaa": "PG-13",
      "actors": [
         "Alicia Silverstone",
         "Stacey Dash",
         "Brittany Murphy",
         "Paul Rudd",
         "Donald Faison",
         "Elisa Donovan",
         "Breckin Meyer",
         "Jeremy Sisto",
         "Dan Hedaya",
         "Wallace Shawn",
         "Twink Caplan",
         "Justin Walker",
         "Julie Brown",
         "Nicole Bilderback"
      ],
      "imdbMovieId": "0112697",
      "originalTitle": "Clueless",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["yHDcD_xhwAo"],
      "plotSummary": "Shallow, rich and socially successful Cher is at the top of her Beverly Hills high school's pecking scale. Seeing herself as a matchmaker, Cher first coaxes two teachers into dating each other. Emboldened by her success, she decides to give hopelessly klutzy new student Tai a makeover. When Tai becomes more popular than she is, Cher realizes that her disapproving ex-stepbrother was right about how misguided she was -- and falls for him.",
      "tmdbMovieId": 9603,
      "avgRating": 3.41553,
      "releaseYear": "1995",
      "numRatings": 29145,
      "posterPath": "/i8gEHh2sszB6YWLC0jl559sxAeN.jpg"
   }
}