{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "killing",
            "id": 627
         },
         {
            "name": "sports car",
            "id": 999
         },
         {
            "name": "go-go dancer",
            "id": 1663
         },
         {
            "name": "eroticism",
            "id": 1664
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "cult film",
            "id": 34117
         }
      ],
      "imdb_id": "tt0059170",
      "video": false,
      "title": "Faster, Pussycat! Kill! Kill!",
      "recommendations": [
         5722,
         22048,
         17278,
         22021,
         22049,
         905,
         26204,
         52633,
         46495,
         5506,
         74544,
         5822,
         61105,
         57230,
         2487,
         56539,
         32569,
         5741,
         28676,
         42837
      ],
      "backdrop_path": "/yWdNhSV37zHQIqCrufKqizzrNMc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Varla",
               "gender": 1,
               "credit_id": "52fe4236c3a36847f800cb17",
               "name": "Tura Satana",
               "profile_path": "/f6zYcgErVgJ9a3UgkVlLPW37wy.jpg",
               "id": 4592,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rosie",
               "gender": 1,
               "credit_id": "52fe4236c3a36847f800cb1b",
               "name": "Haji",
               "profile_path": "/oOR9LINqRf2WYKLLwWmvGhdIsBs.jpg",
               "id": 4593,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Billie",
               "gender": 0,
               "credit_id": "52fe4236c3a36847f800cb1f",
               "name": "Lori Williams",
               "profile_path": "/VAnNHz42znxlDP9R8cW3kal8WN.jpg",
               "id": 4594,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Linda",
               "gender": 0,
               "credit_id": "52fe4236c3a36847f800cb23",
               "name": "Sue Bernard",
               "profile_path": "/5srJqW8ksuoQEpi1s5o7Zc3cu9h.jpg",
               "id": 4595,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "The Old Man",
               "gender": 0,
               "credit_id": "52fe4236c3a36847f800cb27",
               "name": "Stuart Lancaster",
               "profile_path": "/d2oFUtn2pEEbLMO4MoUk7uwH2xd.jpg",
               "id": 4596,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Kirk",
               "gender": 2,
               "credit_id": "52fe4236c3a36847f800cb2b",
               "name": "Paul Trinka",
               "profile_path": "/8keVkkGl2egxltDshK7wspqeoD4.jpg",
               "id": 4597,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "The Vegetable",
               "gender": 0,
               "credit_id": "52fe4236c3a36847f800cb2f",
               "name": "Dennis Busch",
               "profile_path": null,
               "id": 4598,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Tommy",
               "gender": 0,
               "credit_id": "52fe4236c3a36847f800cb33",
               "name": "Ray Barlow",
               "profile_path": null,
               "id": 4599,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Narrator",
               "gender": 0,
               "credit_id": "52fe4236c3a36847f800cb37",
               "name": "John Furlong",
               "profile_path": "/31Zzdur5vqqtoVWOUL5pCK5qEx1.jpg",
               "id": 4679,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Gas Station Attendant",
               "gender": 0,
               "credit_id": "52fe4237c3a36847f800cb6b",
               "name": "Michael Finn",
               "profile_path": null,
               "id": 4685,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4236c3a36847f800cb13",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4237c3a36847f800cb3d",
               "name": "Eve Meyer",
               "profile_path": "/wXIzCHodJ97p3tmp60RJxb4V1Ds.jpg",
               "id": 4680,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4237c3a36847f800cb43",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4237c3a36847f800cb49",
               "name": "Paul Sawtell",
               "profile_path": null,
               "id": 4681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4237c3a36847f800cb4f",
               "name": "Bert Shefter",
               "profile_path": null,
               "id": 4683,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4237c3a36847f800cb55",
               "name": "Walter Schenk",
               "profile_path": null,
               "id": 4684,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4237c3a36847f800cb5b",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4237c3a36847f800cb61",
               "name": "Russ Meyer",
               "profile_path": "/4w6izR5bsjPNTQufl69K7qodcIb.jpg",
               "id": 4590,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4237c3a36847f800cb67",
               "name": "Jack Moran",
               "profile_path": null,
               "id": 4591,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 5.017233,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 315,
      "vote_count": 75,
      "budget": 45000,
      "overview": "Three strippers seeking thrills encounter a young couple in the desert. After dispatching the boyfriend, they take the girl hostage and begin scheming on a crippled old man living with his two sons in the desert, reputedly hiding a tidy sum of cash. They become house guests of the old man and try and seduce the sons in an attempt to locate the money, not realizing that the old man has a few sinister intentions of his own.",
      "similar": [
         10017,
         1696,
         275,
         8810,
         4771,
         562,
         507,
         984,
         398175,
         2142,
         2163,
         3134,
         948,
         298312,
         11564,
         1991,
         1949,
         101,
         681,
         949
      ],
      "original_title": "Faster, Pussycat! Kill! Kill!",
      "runtime": 83,
      "poster_path": "/4mld2L1vWqgqFQmKa7KU4HzLKPi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Eve Productions Inc.",
         "id": 170,
         "origin_country": ""
      }],
      "release_date": "1965-08-06",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Go-Go For a Wild Ride With the ACTION GIRLS!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Russ Meyer"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Jack Moran",
         "Russ Meyer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059170/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMzI5NjA1OF5BMl5BanBnXkFtZTYwMjQyMjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tura Satana, Haji, Lori Williams | See full cast and crew »"],
      "reviews": [
         "From the beginning, you know that this monochrome Meyerama is going to be incredible--an Outer Limits-style voice-over pontificating on the violence of women, followed by incredible shots of three luscious go-go girls doing the Watusi as the Bostweeds' wild theme song blasts from the jukebox. Then things move to the barren California desert for drag races, catfights, murders, straining blouses, and a lot of torrid action and satirically overwrought melodrama. Tura Satana, Haji, and Lori Williams have terrific screen presence as the three tough-as-nails villainesses. They're the kind of deliciously over-the-top antagonists that you root for, especially since the nominal heroine (Sue Bernard) is a ridiculous dimwit who couldn't act her way out of a paper bra--I mean, bag. Highest honors go to the amazing Satana, shouting most of her lines and dropping sexual innuendos while resting her boobs on the dinner table. As usual, Russ Meyer fills the screen with sharp dialogue (\"Breast or thigh, darlin'?\") and sharp camerawork. There is no nudity, since Meyer was trying to circumvent the censors in 1966, but there are some incredibly sexy scenes all the same. Excitement and laughs abound in this straight-faced send-up of action-flick conventions. This celebrated cult classic is one big-breasted Gothic melodrama-satire that really...um...stands out!",
         "I have watched and enjoyed most of Russ Meyer's output, and will quite happily defend his lesser works, but two of his movies have a life of their own and have managed to reach a larger audience than \"just\" card carrying Meyer nuts. They are 'Beyond The Valley Of The Dolls' and this one, 'Faster Pussycat! Kill! Kill!'. Both movies are trash classics and never fail to entertain no matter how many times you have seen them. 'Faster Pussycat!' really succeeds mainly because of the three strong leads, Tura Satana, Lori Williams and Haji. Any one of them would be enough for Meyer to plan a killer movie around, but all three together is dynamite! Satana, strangely enough, did very little movie work after this, mainly a couple of Ted Mikels turkeys. But it doesn't really matter because her screen immortality is assured. Her performance in this movie is more than enough! Williams also went on to very little, but she is very good here, and stylistically reminds me quite a bit of Erica Gavin in 'Vixen!'. In fact one could almost bet that if Meyer had been aware of Gavin when he made this movie she would have played the part of Billie. Haji appeared in a few more Meyer movies, including his masterpiece 'Supervixens', but this is probably her strongest role. All three women, who play go-go dancers by night, thrill seeking criminals by day, are simply wonderful and their chemistry and repartee are priceless. Meyer regular Stuart Lancaster is also in fine form as a dirty old man with more issues than a daily newspaper. There are so many unforgettable scenes in this movie it's difficult to single any out. The whole movie just rocks period. Many late 60s movies attempted to emulate a camp, comic book appeal ('Barbarella', 'Diabolik',etc.etc.) but in many ways Meyer beat them all, and did so without technicolor, large sets, multiple costumes, special effects and other gimmicks. Just crisp black and white photography and three chicks in the desert. Plus a brilliant theme song later immortalized by The Cramps. Russ Meyer divides most viewers. You either \"get it\" or you don't. If you aren't familiar with his work this is probably THE place to start. Watching this movie for many is a life changing experience! 'Faster Pussycat!' is one of the most original and entertaining movies made in the 1960s, and continues to amuse and inspire right into the 21st Century. Every time I watch this movie I am knocked out. This is a bona fide cult classic that gets better and better as the years go by. Absolutely essential viewing for anyone who loves exploitation movies, The Sixties, rock'n'roll and/or buxom babes!",
         "Three go-go dancers - Varla (Tura Satana), Rosie (Haji) and Billie (Lori Williams) - are racing their sports cars out in the desert when they meet up with a young man named Tommy (Ray Barlow) and his girlfriend Linda (Susan Bernard). Tommy is an amateur car racer who has come out to do some time trials. Varla challenges him to a race. When she cuts him off with her car it leads to a fight and she kills him. Dragging the frightened Linda with them the trio go into the nearest town to fill up with petrol. There they see a muscly young man (Dennis Busch) carrying his crippled father (Stuart Lancaster) to his truck. The petrol station attendant (Mickey Foxx) tells the girls that the muscle man is retarded and that his bitter old father is reputed to be rich, but must have his riches stashed away somewhere at his isolated homestead. The girls decide to drop in for a visit hoping to find the old man's riches. They pass off Linda as a rich man's runaway daughter they are bringing home against her will. What they don't know is that the old man is a misogynist who delights in kidnapping women for his son, whom he refers to only as The Vegetable, to rape. They will have to rely on their own deadly talents and the possible decency of the old man's other son Kirk (Paul Trinka). Russ Meyer's black and white \"ode to the violence in women\" made little impact when first released in 1965. Meyer had taken the world by storm with \"The Immoral Mr. Teas\" (1959), the film most often credited with kicking off the nudie cutie craze. And he would become a household name with the success of \"Vixen!\" (1968). But the films he made between those two landmarks, though some of them are among his best work, didn't attract much attention. But then John Waters, in his 1981 autobiography \"Shock Value\" wrote : \"'Faster, Pussycat! Kill! Kill!'...is, beyond a doubt, the best movie ever made. It is possibly better than any film that will be made in the future.\" Waters dubbed Meyer \"the Eisentein of sex films\" because his use of skillful editing to get maximum impact out of scenes of sex and violence is reminiscent of the methods by which the Russian director managed to powerfully convey his political messages. Waters' championing of \"Faster, Pussycat!\", in particular, led to it becoming a favourite on college campus's across America. If Meyer is \"the Eisenstein of sex films\" then \"Faster, Pussycat! Kill! Kill!\" is the \"Citizen Kane\" of trash films. I don't use the term disparagingly. For me a trash film is a film which appeals on a visceral rather than purely emotional level. In trash films realism is bad style. We must always know that we are watching a movie and enjoy it as a fantasy formed from our own base drives - from those uncivilised aspects of our nature that we must repress to live a civilised existence. Hence the term \"trash\" for the substance of these films is those aspects of ourselves which must be discarded. The violence in the trash film appeals to the knot in our stomach from every time we've had to bite back on our anger. It's prurient sexuality appeals to the lusts generated by everyday existence for which we may have insufficient outlet. We don't sympathise with the characters in a film like this, but we can identify with their actions because they take place in an obvious fantasy world. But the trash film has another appeal - the exhilaration that comes from the transgression of the bounds of good taste. And its sense of humour is the kind which elicits a belly-laugh. The anarchic spirit of the trash film has no less value than the more rarefied pleasures and intellectual stimulation of the art film. What makes \"Faster, Pussycat! Kill! Kill!\" great is the way that it takes the sex and violence of the trash film and distills them into something more iconic than explicit. Unlike most of Meyer's films, there is no frontal nudity or sex scenes. The violence is powerful, but not extended or shown in gory detail. Yet Tura Satana in her tight black jeans, half-exposed breasts practically bursting free as she eyes up a man like a side of beef or takes him out with karate chop to the neck, distills any amount of sex and violence into a single unforgettable mythic figure. Similarly the vastly underrated Stuart Lancaster is the very personification of sleazy misogyny. Add to this the brilliant build-up of the opening monologue, Meyer's masterful editing and Jack Moran's eminently quotable and often hilariously funny camp dialogue and you have a trash film masterpiece that just gets better and better the more times you watch it.",
         "I've got to admit, after the first ten minutes or so; I really didn't think I was going to like this film. However, it isn't long before Russ Meyer's film takes off - and before I knew it, I was watching one of the greatest pieces of trash ever to hit the silver screen! If you want a B-movie; this film has all the essential ingredients. We've got fast cars, fighting, killing, snappy dialogue and a trio of buxom beauties in the lead roles! It's quite clear that this film is made purely for entertainment value - as the plot is non-existent, and the characters don't go any deeper than the common B-movie stereotypes, but it doesn't matter - because entertain it does, and this is about as 'cult' as it gets! Shot in crisp black and white, and with all the energy of the Nouvelle Vogue cinema doing the rounds in sixties France, Faster Pussycat! Kill! Kill! (awesome trashy title) follows three women; dancers by night, and fast car riding killers by day! We follow them as they stumble upon an old farmhouse, inhabited by an old man as sick as they themselves. He's got some money hidden, and the lead chick wants it...only the old man and his sons stand in her way. It's immediately clear that acting isn't this film's strongpoint; the dialogue sounds forced and ridiculous, and none of the cast do good jobs of making their characters real - yet in true trash fashion, it's the ensemble that is this film's main asset. The trio of women are the main players, with the busty and exotic Tura Satana taking centre stage and being backed up by Haji, and the stunning Lori Williams. These three would make any film worth watching, and the way that Russ Meyer ensures that the girls are always the strongest presence on screen gives Faster Pussycat a lot of its cult value. The film moves quickly, and the action is fast edited and cut with an imminently cool soundtrack, thus making the film amazingly watchable and an obvious influence on the likes of Quentin Tarantino. The fact that this film pokes fun of cinematic violence by having women in the leads will always make it memorable; the fact that they've got big breasts only makes that more so. This is an absolute cult classic and, I suspect, a film that I'll be seeing over and over again. This is one of those films that has to be seen to be believed - so make sure you don't miss it!",
         "I loved \"Faster, Pussycat! Kill! Kill!\" from the beginning, together with its three great main actresses Haji, Lori Williams, but especially the outstanding Tura Satana. The film tells the story of three exotic dancers, who become outlaws, drive fast cars, wear provoking clothes and cheat and beat up men. The only not typical thing about this movie is, that none of the chicks has a nude scene, what is really a pity! On the first view, Russ Meyer´s flick is nothing else but a funny piece of trash from the swinging 60s. But on the second it´s a portrait about the power of female sexuality on men. The sex characteristics differ from the usual stereotypes: the male are the victims, the women are the offenders, who apply their \"weapons\" unscrupulous to reach their aims. Also they are physically stronger and more cunning than the naive guys in this film. Especially Varla becomes a sexy, but immense violent murder machine and that makes her being one of the most frightening women in the history of cinema! But \"Faster, Pussycat! Kill! Kill!\" is more than that: it´s a piece of modern art, every lover of real cult movies or pop art should have seen it! (8/10)",
         "While there are some who argue that it is a pro-feminist flick with lots of social significance, truth is FASTER PUSSYCAT KILL KILL is a very deliberately made bit of ultra-drive-in trash, a movie that glories in all things low-brow, low-rent, and low-neck lined. And it has a cast that makes up for their collective lack of talent with lots of attitude and lots of cleavage. The story is as hooty as the cast. Tura Satana, she of the lethal chest, leads minions Haji and Lori Williams away from the grind of their jobs at the go-go joint and out into the desert. They race their cars. They wrestle in the water and then in the sand. They dance the watusi. They bump off this guy who shows up wearing plaid shorts. (Given his attire you might read this as a mercy killing.) Then they set their sights on an old lech and his dum-dum sons, hoping to make away with their money. Faster Pussycat indeed! The script is deliberately absurd, with an emphasis on memorable one liners that try to out-cliché all known clichés. But the real attraction here are the \"pussycats.\" It isn't often that you see a 2D movie with 3D effects, but that's exactly what happens when Tura, Haji, Lori, and their six talents hit the screen. These are three big-busted, nip-waisted women with evil attitude, and they sneer, snarl, snap, and slither around the screen with all the aplomb of trailer park drag queens gone bad. It's more \"tacky cool\" than a 1965 plastic jewelry box explosion. Now, how much you like this sort of thing really depends on how warped your sense of humor is. Cheap though it is, the thing is remarkably well done, and taken in the right way the combination of trailer-park chic, retro-hysteria, and ultra-attitude is a lot of fun... and when the pussycats hit the screen you may think you're about to get a black eye, and I don't mean from their fists! Breakout the popcorn and some protective glasses: Tura and the Pussycats are coming at ya! GFT, Amazon Reviewer",
         "Please, take it from one who, until tonight, foolishly and ignorantly pigeonholed Russ Meyer as a Grade-B Soft-Core cult hero. What did I know? He's so much more than that. Think really good John Waters crossed with really bad Fellini (which is good, of course, in its own way) and you have just a hint of the inspired wickedness here. Three mean chicks in sports cars, on a road trip from hell, back in a blistering hot, black-plate California desert. The script is undisguised genius and the performances (particularly, of course, the sadistic, sneering Tura Satana) cross most known bounds. But you know what? Even with that firebrand in the lead, the others hold up incredibly well. Meanwhile, the cinematography is spot-on for the theme here, tilted and trenchant. The overall effect: bracing--blinding, almost--and more than a little surreal. FASTER, PUSSYCAT KILL! KILL! It's hideous and hip. Nightmarish, and nasty. Scathing and scabrous. Insane, but inventive. It's not a film for everyone. Some will call it sick, some will dismiss it as camp. It's all that and more. Hardly a wrong note, and with *so* many opportunities too... I was glued to the screen from beginning to end. Wicked fun. Captivating. Can you tell I liked it? PS: Also recommended for fans of NHB, male/female bare-knuckle boxing. You know who you are ;)",
         "The tendency to dismiss Russ Meyer's \"Faster, Pussycat! Kill! Kill!\" (1965) as just a cult classic is probably due to the most memorable feature of the film, the girls. First there are the two quintessential Meyer women, Tura Satana and Haji, towering brunettes with enormous breasts who dominate all the men around them; or at least Satana does, Haji's character (with a strange Italian-Mexican accent?) is more focused on Satana than on men. They actually come across as a feminist empowerment fantasy, which is consistent with Meyer's almost exclusive career focus on situations in which women wreak their will upon men. If they are too extreme for your tastes there is blonde free spirit Lori Williams and air-headed sweet young thing Susan Bernard. While arguably the two prettiest women to have ever graced a film, there is no argument that William's character is the sexiest of all time. Interestingly, it was the sweet-faced Bernard who became a Playboy centerfold just a few months after the movie (December 1966). But \"Pussycat's\" greatness comes from the visceral power of Meyer's unusual images (can you say Fellini). Add to this abundant humor, inventive camera angles, fast pacing, clever editing, violence, and a generally amoral cast of characters. The film gets even better with subsequent viewings, you connect better with the twisted dialogue and the wry humor.",
         "Expectations were very high when watching this, but its not Russ Meyers best. The superwoman are tough as nails or as a velvet glove dipped in iron as they say, almost all lines of the movie is memorable, Tura Satana and co shouts them out in the coolest fashion and this makes up for the strongest feat of the movie. I promise you'll laugh more than a few times by them.. Its cousin 'Motorpsycho' however was more accomplished than this was. The story doesn't have as much potency (no pun), the girls are good, but not all that and the absurdity reached in 'Supervixens' and 'Motorpsycho' is not reached here. Its still a campy classic though.",
         "Woo-hoo! For as long as I showed interest for eccentric cinema, I anticipated this film. It has the coolest sounding title ever and the posters couldn't look more ravishing. Unfortunately, the Russ Meyer collection is pretty hard to find where I'm from so it took me years to finally purchase it. I own it now and I can say it fully lives up to my expectations. It's a gorgeous film, and typically Meyer. That doesn't mean it's a masterpiece but he has the talent to make words like `trash' sound good. Faster Pussycat Kill kill handles about\u0085well\u0085not all that much, but that's the beauty of it. Three beautiful exotic dancers (with the exact right measurements) revolt against the masculine lifestyle and go out on a rampage. Riding fast cars, provoke men and sweet similar stuff. Leader of the pack is the gorgeous Varla (portrayed by the more than impressive Tura Satana). She's one massive heap of estrogen who kills men with her bare hands and enjoys riding over people with her car. Her two accomplices have a tad bit more humanity in them. They're Lori Williams (a gorgeous looking blond girl) and Haji (her accent alone causes chemical reactions inside a man's body). The lovely threesome ends up among rednecks in a farmhouse, somewhere in the middle of a desert. Meyer's style is a joy for all senses! The film is filled with memorable quote material and the screenplay is very ingenious at times. The male weirdoes in the farmhouse actually pre-date Tobe Hooper's Sawyer family with almost a decade! Faster Pussycat! Kill Kill has pretty much in common with Motor Psycho, a film shot by Meyer in the same year. There's a main villain, ultra-insane and prepared to go all the way while his followers merely fear him, rather than support him. So basically\u0085this IS Motor Psycho\u0085but with boobs!! Hey, I'm all for feminism so let's hear it for FASTER PUSSYCAT! KILL KILL!"
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": ["Eve Productions"],
      "summaries": [
         "Three strippers seeking thrills encounter a young couple in the desert. After dispatching the boyfriend, they take the girl hostage and begin scheming on a crippled old man living with his two sons in the desert, reputedly hiding a tidy sum of cash. They become houseguests of the old man and try and seduce the sons in an attempt to locate the money, not realizing that the old man has a few sinister intentions of his own.",
         "Three wild women in three fast cars take time off from stripping in clubs to go on a murder rampage. They kidnap and drug the girlfriend of one of their victims and hole up at a secluded ranch owned by a wheelchair-bound man and his two sons.",
         "Three strippers holding a young girl hostage come across a crippled old man living with his two sons in the desert. After learning he's hiding a sum of cash around, the strippers start scheming on him."
      ],
      "budget": 45000
   },
   "movielensId": 390,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-08-06",
      "dvdReleaseDate": "2005-06-14",
      "directors": ["Russ Meyer"],
      "runtime": 83,
      "movieId": 390,
      "title": "Faster, Pussycat! Kill! Kill!",
      "mpaa": "",
      "actors": [
         "Tura Satana",
         "Haji",
         "Lori Williams",
         "Sue Bernard",
         "Stuart Lancaster",
         "Paul Trinka",
         "Dennis Busch",
         "Ray Barlow",
         "John Furlong",
         "Michael Finn"
      ],
      "imdbMovieId": "0059170",
      "originalTitle": "Faster, Pussycat! Kill! Kill!",
      "genres": [
         "Action",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "m3JjyvQzSJI",
         "-0AJXt-p11g"
      ],
      "plotSummary": "Three strippers seeking thrills encounter a young couple in the desert. After dispatching the boyfriend, they take the girl hostage and begin scheming on a crippled old man living with his two sons in the desert, reputedly hiding a tidy sum of cash. They become house guests of the old man and try and seduce the sons in an attempt to locate the money, not realizing that the old man has a few sinister intentions of his own.",
      "tmdbMovieId": 315,
      "avgRating": 3.42544,
      "releaseYear": "1965",
      "numRatings": 912,
      "posterPath": "/u0YrGkpjL5H190qqEsQavZ2WrV5.jpg"
   }
}