{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0134630",
      "video": false,
      "title": "Duets",
      "recommendations": [
         23570,
         31633,
         25697,
         102947,
         40480,
         97313,
         18451,
         36709,
         32044,
         14578,
         27224,
         18316,
         42597,
         40001,
         52654,
         355264,
         50116,
         29691,
         61410,
         39233
      ],
      "backdrop_path": "/mjZ3dHhY0HOKZZUEkGfv9RuKH9W.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Liv",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096ce5",
               "name": "Gwyneth Paltrow",
               "profile_path": "/8x3jpWD7DEvyMXO1FOjwNdd1UZT.jpg",
               "id": 12052,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096ce9",
               "name": "Scott Speedman",
               "profile_path": "/hxDr3YjCYaHPEFbEfC0eXjMps0u.jpg",
               "id": 100,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Suzi Loomis",
               "gender": 1,
               "credit_id": "52fe475e9251416c75096ced",
               "name": "Maria Bello",
               "profile_path": "/tFkbad0JoWvYc6XYBITv6EfeLwR.jpg",
               "id": 49,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Todd Woods",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096cf1",
               "name": "Paul Giamatti",
               "profile_path": "/rX4LRmkYshMRfQ6lVbeZVAfqVKI.jpg",
               "id": 13242,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Reggie Kane",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096cf5",
               "name": "Andre Braugher",
               "profile_path": "/9VtD8RlQ0urgDKS7B8tR456dW50.jpg",
               "id": 6861,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ricky Dean",
               "gender": 2,
               "credit_id": "52fe475e9251416c75096cff",
               "name": "Huey Lewis",
               "profile_path": "/5x30rIs9NnV4r1AUMpPIhw9UhgQ.jpg",
               "id": 168702,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe475e9251416c75096cfb",
               "name": "Bruce Paltrow",
               "profile_path": "/nhcgRo6wVYZf1jzNzxgmng1w5lW.jpg",
               "id": 173607,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "564d2037c3a368603700893a",
               "name": "John Byrum",
               "profile_path": "/r2NoRtAuBWFtM0RDi6MuhMJNn4l.jpg",
               "id": 32767,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "564d20519251414dc4008179",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "5822e2229251410cae0090ae",
               "name": "Mark N. Tompkins",
               "profile_path": "/p7a7MPqqXrdvFL9pgL0qP0I7lUH.jpg",
               "id": 1546584,
               "department": "Crew",
               "job": "Scenic Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 4.082415,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18074,
      "vote_count": 46,
      "budget": 0,
      "overview": "Duets is a road-trip comedy which revolves around the little known world of karaoke and the whimsical characters who inhabit it. All roads lead to Omaha, site of a national karaoke competition where this motley group of singers and stars come together for a blow-out sing-off.",
      "similar": [
         812,
         10530,
         872,
         224141,
         11224,
         38757,
         8587,
         11631,
         114,
         15121,
         824,
         10545,
         703,
         134,
         252,
         3933,
         18947,
         19404,
         82695,
         41233
      ],
      "original_title": "Duets",
      "runtime": 112,
      "poster_path": "/mWQwMVXLzEjKeFIjvkpqNAM7UF7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Seven Arts Pictures",
            "id": 14159,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Beacon Pictures",
            "id": 10157,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "2000-09-09",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Six littles souls in search of a little harmony.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bruce Paltrow"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["John Byrum"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0134630/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwNTIxMjg5OV5BMl5BanBnXkFtZTcwNjIxODgyMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Huey Lewis, Gwyneth Paltrow, Paul Giamatti | See full cast and crew »"],
      "reviews": [
         "Director Bruce Paltrow assembled an impressive ensemble cast to deliver this story about a diverse group of people with many things in common-- more than they would probably ever realize or admit to, in fact. On the surface, the tie that binds is music; specifically that cultural phenomenon known as Karaoke, a world in which for three minutes or so, no matter who or what they are, the individual at stage center is a star. Underneath that particular aspect, however, the common thread runs much deeper. Because these are people who, in their own way, are all seeking to connect with something, even though they don't know what it is or even consciously know they're pursuing it. They're looking for their personal metaphor-- that one special thing, or someone, that will give meaning and purpose to their life. It's a road we all go down at one time or another, in one way or another, and it's that road that is explored by Paltrow in `Duets,' an affecting film that illustrates how universally elusive the answers we're all seeking in life are, and for the most part because we simply don't know the questions in the first place. Ricky Dean (Huey Lewis) is a singer/hustler on the Karaoke circuit; In Tulsa, on his way to a big competition in Omaha, he gets a call and detours through Las Vegas for the funeral of an old friend. While he's there, he meets up with someone with whom he has a special relationship, Liv (Gwyneth Paltrow), who decides she wants to join him on the road. Meanwhile, a salesman named Todd Woods (Paul Giamatti) suddenly realizes he's so burned out from being on the road that he doesn't even know what city he's in, making a pitch to a hotel conference room full of corporate types in Houston, thinking all the while he's actually in Orlando, Florida. When he finally gets home, his wife, Candy (Kiersten Warren), and his two kids are too self-absorbed to even say hello to him, so he goes out for a pack of cigarettes (even though he doesn't smoke), discovers Karaoke and makes a new friend, Reggie Kane (Andre Braugher). Then there's Billy (Scott Speedman), a young man who drives a cab (of which he is half owner), who due to a particular set of circumstances finds himself involved with one Suzi Loomis (Maria Bello), who is on her way to California, by way of the karaoke competition in Omaha. And, ultimately, Karaoke becomes the vehicle through which this eclectic bunch of individuals begin to discover just what it is they're looking for; and who among them ever would've thought it would be in Omaha, Nebraska? Working from an intricate and insightful screenplay by John Byrum, Paltrow has crafted an engrossing comedy/drama that is entertaining and poignant. There's a lot going on in this film, but Paltrow sets a pace that keeps it moving right along, and uses transitions that effectively eliminate any confusion that could easily have resulted from having so many storylines unfolding at once. The characters are well drawn, and Paltrow establishes exactly who they are and where they fit in almost as soon as they are introduced, which enables the viewer to concentrate on the story without having to figure out who fits where and why. After all, this is not a mystery; and Paltrow uses the screen time of his characters wisely to develop the drama that is being played out in their respective lives, rather than by throwing in unnecessary twists and turns just to maintain interest. It works, because the story is interesting enough, without the aid of any superficial enhancements, and Paltrow does an excellent job of blending it all together to deliver a satisfying and emotionally involving film. There are a number of outstanding and noteworthy performances in this film, but the most memorable is turned in by Paul Giamatti, who so successfully conveys the emptiness of this middle-aged man who has always played by the rules, and who now finds himself at a very real crossroads in his life. The fact that Todd has accrued 800,000 frequent flyer miles that he can't use, effectively puts his whole life into perspective; and Giamatti sells it with a portrayal that is affecting and incisive. And, as Reggie, the guy Todd takes up with on the road, Braugher hits just the right note, as well, and their scenes together provide some of the highlights of the film, as when they perform their duet of `Try A Little Tenderness'-- this is Karaoke at it's best. Gwyneth Paltrow provides a few highlights here, as well; besides creating a very real, believable character in Liv, it's worth watching the film just to see her sing `Bette Davis Eyes.' But there's also an exquisite gentleness in her nature she so ably expresses that makes her decidedly easy to watch, and there's an engaging duet she delivers with Huey Lewis on `Cruisin' that's a real showstopper. It's quite interesting, in fact, to note just how well the actors in this film deliver their songs (and, yes, they all did their own singing). Other musical highlights include Braugher's `Free Bird' and Bello's rendition of `Sweet Dreams.' This entire film, in fact, just may be the best thing that ever happened to Karaoke; it definitely raises the bar and gives it some mainstream credibility. The supporting cast includes Angie Dickinson (Blair), Lochlyn Munro (Ronny), Amanda Kravat (Redhead), Erika von Tagen (Julie) and Marian Seldes (Harriet). Early in the film, a truck driver asks a hitchhiker-- a guy just out of prison-- `What were you in for?' The guy replies, `An error in judgment.' And, in the final analysis, that's what `Duets' is really all about; the flaws, imperfections and `errors in judgment' that make up the music of life. It's about finding that right note and being able to share it with someone-- being able to perform a duet to the score of life. 9/10.",
         "I often wonder why I watch so many movies, and why I love them so. It isn't because they often explore new territory or challenge my intellect, but then there's a whole public library and a Barnes and Noble in every strip mall for that. No, I think it must be the escapist delight of allowing myself to be absorbed for a couple of hours in a well-crafted imaginary world where unbelievable things happen to unrealistic people. It's a guilty pleasure, but hey, sometimes I eat my dessert first. I can handle the guilt. With that said, as guilty pleasures go, this dessert is a banana split for two with extra nuts and cherries. And one spoon. Huey Lewis and the incomparable Gwyneth Paltrow are a father daughter team trying to get acquainted on the karaoke circuit. He's a karaoke hustler (who knew) and she's a third generation Las Vegas showgirl who is at once worldly and naive. Paul Giamatti is a shocker. He's amazing as the frustrated salesman who's out \"for a pack of cigarette.\" Along the way, he encounters Reggie Kane (Andre Braugher) a convict on the lam whose quiet desperation is a stark contrast to Giamatti's wanton abandon. Maria Bello is hilarious as the resourceful bohemeian chasing a dream of big money. Angie Dickenson graces the scene with a tasty cameo. And then there's the singing. OK, Todd Rundgren isn't worried about Giamatti's rendition of the classic \"Hello it's Me\", and Andre used a voiceover, but Gwyneth can really sing, and her duet with Babyface in the closing credits is a chart-topper in anybody's book. Directed by Gwyneth's dad Bruce, in his first feature since graduating from the small screen, the word \"Duets\" describes this enjoyable film in more ways than one. But in the end, the duet that matters is just you and this wonderful little film.",
         "Excellent! \"Duets\" is definitely outside of what I had expected it to be... it is outside of the only-on-it-for-the-money, watch-the-weekend-grosses Hollywood sell-out that everyone complains about. It is a wonderful story, full of surprises and charm. The characters are 3-dimensional, to be sure. Their stories are not always pretty, and certainly not predictable. I was always entertained, engrossed, and ultimately very uplifted. Huey lewis could make it as an actor, and Gwyneth Paltrow could make it as a singer, both without any gimmicky \"pr\" work to present them as a stunt. They, and the entire cast of unknown actors were top-notch here. The music is real, and means something to the movie, and it all meant a lot to me. Yaay \"Duets\"! Go see it-- it has tons of heart, and soul. You'll love it. I gave it a 10 out of 10.",
         "I admit it -- I'm a total sucker for this movie for all of the right reasons, and some of the wrong ones (like, it's very touching to me that Bruce Paltrow made this movie with his daughter Gwyneth and died a year or so later). Having Huey Lewis in the movie and singing a few of his monster hits is a plus all by itself, and it turns out he can actually act decently. The Paul Giamatti - Andre Braugher duo, both in terms of plot, their excellent acting, and their blow-you-away singing performance, is something I never tire of seeing, and I've watched this movie five times and have it on disk. The plot is superficially pedestrian but actually very engaging and psychologically legitimate despite the displays of craziness by the characters. People do get crazy and do that kind of stuff. As for Gwyneth Paltrow, there seems to be no role she can't get into and occupy with beautiful effect. This was never intended to be a Great Movie. It was a nice little story, made into a very fine, charming, stick-to-your memory movie with talent oozing out the corners. People who rate it mediocre are just not seeing the pearl for the oyster.",
         "Bruce Paltrow's film \"Duets\" basically centers on the relationships of vastly different people who all end up at a karaoke contest in Omaha. Liv (Paltrow) meets her dad Ricky (Lewis) for the first time at her mother's funeral. Ricky is a \"karaoke hustler\", a guy who walks into various competitions and not only wins the cash prize, but manages to get a sucker to bet on which of them is going to win. Ricky reluctantly lets Liv tag along with him on the circuit, and along with singing herself, she also tries to forge a relationship with her father. Todd (Giamatti) is a salesman who travels most of the year and comes home to a house where his children don't talk to him and his wife would rather spend time online than talk to him after one of his business trips. One day he has a \"moment of clarity\" and decides to use some of the 800,000 frequent flier miles he has racked up, taking off in his car and driving anywhere but near his home. The first night he gets a room, he walks into a hotel bar and is convinced to get up on stage for their karaoke night, where he finds he loves the freedom it allows and the attention it garners him. Along the way on his trek, he picks up a hitchhiker named Reggie (Braugher) a recent parolee with the voice of an angel, and the two strike up a very close friendship despite (or possibly because of) their many differences. Finally, there is Suzi (Bello), a drifter who travels her way to karaoke contests by eschewing all dignity and selling any part of her she can. At a stopover in Cincinnati, she encounters Billy (Speedman) a former seminary student who is now a gypsy cab driver that just discovered his girlfriend sleeping with his business partner. Bello convinces him to take her to California, but along the way, the lure of the $5,000 purse in Omaha gets the best of her and they make a stop there. \"Duets\" features several story lines, but other than karaoke, they all have one thing in common: They are all unhappy with either their past, their present or the prospect of a bleak or uncertain future. The film really isn't all that good, but there are a couple of good things about it. First and foremost, the chemistry between Giamatti and Braugher is fantastic. Completely casting aside the fact that they are two of my favorite actors, their connection was practically tangible. Hey, who knew Giamatti could sing, too? The rest of the stories were pretty clichéd or just not very compelling at all. I wasn't sure where they were trying to go with the Suzi/Billy arc but it ended up going nowhere for me personally. Huey Lewis, nothing more than a marginally average actor does an okay job in this film, but it obviously isn't much of a stretch for him. If you are not a fan of any of the actors, \"Duets\" is entertaining enough to sit through and not end up hating yourself afterward. Personally, the film deserves a slight edge because of the Giamatti/Braugher thing, but altogether, it gets a 6/10. In this case I'm rounding up from 5.5 for that edge. --Shelly",
         "This film brings some great things to it, actually 3 things- Paul Giamatti's performance, Huey Lewis's performance and every good singing person who (besides Lewis) surprised me with they're talents. Overall, the karaoke scenes overshadow the dramatic trio of tales (except for the free bird story with Giamatti and Andre Braugher) which is unfair because the talent on stage is somewhat better than the acting (Maria Bello is pretty damn sexy though). Overall, it's fair, more of a chick flick to say. B",
         "Yes I know, its a movie about the world of amateur singers and the disparate personalities that flock from around the country to win the big jackpot. If you are reading this then chances are that you have already seen the movie so there is no need to rehash it now. The one thing that I truly enjoyed, however, was the absolutely believable friendship that develops between the characters of Todd Woods and Reggie Kane. Sure, there are other good aspects of this movie, such as surprisingly good acting from Huey Lewis and a very low key, quirky representation of his daughter, played by Gwenneth Paltrow. This movie didn't enchant the critics upon its release...and judging by its box office performance, not much of the country either...but there is something very sublime about, not only the subject matter, but also the method in which this movies elements were pieced together...much like a dramatic jigsaw puzzle. What really made this movie special for me though was the ending. Reggie Kane's final performance and the aftermath...especially with regards to Todd's wife, almost made me weep. I found it very moving and genuine in its execution, and the low-key nature if the acting simply enhanced those qualities. So, to sum up: mediocre movie that has some really great nuances that combine to make a movie that, though slow and draggy at times, makes up for those lapses with the end results. P.S. as usual, Paul Giamatti is perfect! Everything that he gets involved with...with the possible exception of that \"re-envisioned\" Planet of the Apes...ALWAYS is made better by his presence!",
         "DUETS takes an interesting and unusual cast of character actors, mixes them up and puts them in a film where groups of characters will all meet up by the end. Instead of it being a political rally like in the Robert Altman classic NASHVILLE, the gathering is a karaoke contest in Topeka, Kansas. It seems that director Bruce Paltrow in stepping into the shoes of Robert Altman, but his results aren't as satisfying. There are three different stories in DUETS, which switch back and forth between each other, instead of making them into segments. The first story is about a father-daughter relationship. Ricky Dean (Huey Lewis) is a con artist who cons suckers into making a bet on who can sing better at karaoke, and Ricky usually wins. Ricky finds out that his ex-wife, or ex-lover (the story doesn't really explain) has just passed away and he meets Liv (Gwyneth Paltrow) a young woman who happens to be his daughter. Ricky heads off to Topeka to compete in the karaoke contest, with Liv following him, against his wishes. It turns out that Liv is quite a singer herself, and impresses Ricky. The second story deals with a workaholic man name Todd (Paul Giamatti). Todd goes from city to city and staying in different hotels so often that he forgets what city he is in. When Todd is at home in surban California he decides to go for drive to get some cigarettes, and keeps on drivng, to Santa Fe. There he is persuaded by a pretty young woman to give karaoke a shot. He does and he loves it, he loves it so much that he changes his attitude, from stiff-shirted to free minded. Todd then picks up a hitchhiker, Reggie (Andre Braugher) a criminal on the run who winds up singing karaoke with Todd to hide from the authorities. The third story deals with a young aspiring cab company owner in Cleveland (Scott Speedman) who after catching his wife sleeping with his best friend, decides to drink his worries away. At one of the bars, he meets Suzi (Maria Bello) a young and pretty woman who wants to become a professional singer, and she'll do anything without regret (including sexual acts) to become famous. In fact, Suzi will do sexual acts just to avoid paying for things. By the end of the film all of these people meet in Topeka and the climax isn't that exciting. I found DUETS to be a film that has great acting. All of the cast, including Huey Lewis, Gwyneth Paltrow and Paul Giamaiit to be enjoyable. If I said it once, I'll say it again, Huey Lewis isn't only an underrated singer, but also an underrated actor. You don't believe me, then see Robert Altman's SHORT CUTS and see for yourself. But what ruins DUETS is it's plot and plot structure. It's all too familar. DUETS appears to be a film that Robert Altman would consider to be too \"commercial\" so Bruce Paltrow takes over to make a too typical film. And even if the plot structure isn't like Altman, the plots of the multiple characters come out like a movie made for t.v. What's pretty amazing is that all of the actors are pretty darn good singers (except for Andre Braugher, which is reported to have a voice over for his singing). Gwyneth Paltrow takes her acting to a new level by becoming a singer, and she is a good singer. I'm thinking that former beau Brad Pitt is intimidated by now that the girl he made famous by dating her didn't only win a Oscar, but is a good singer. And it doesn't take a rocket scientist to figure out why a distinguished actress like Gwyneth Paltrow decided to star in this film (look at her last name and the director's). Paul Giamatti who is a very enjoyable character actor in HOWARD STERN'S PRIVATE PARTS, THE NEGOTIATOR, and THE TRUMAN SHOW shows off his talent further by being another good singer. And Maria Bello, who was recently in both PAYBACK and COYOTE UGLY shows that she too can carry a tune. But when you put these actors up along with Huey Lewis, it's like having amateur dancers dance aside with Fred Astire or Gene Kelly. In other words Huey Lewis does stand out with his singing, you just want to hear him sing more songs for the rest of the movie. But of couse, Paltrow wants to carry on with the story which makes it muddle. Overall, DUETS does have good acting, and good singing. But it's the plot that makes it an unimpressive film. If Bruce Paltrow changed the plot structure, the character's, and add some unexpected surprises , it would have been more interesting, but it isn't. The best way to describe DUETS is this: DUETS is like karaoke, we all know the words, it's just sung in a different way. *** (out of five)",
         "We loved the movie. It was very funny, poignant, sweet and the cast of characters was perfect. Gwyneth was fantastic and she sings great. I wasn't sure it was her, but today I read that she did it all. It was great see Huey Lewis, missed him for a long time. The other characters were also very funny and the music was super. We are going out to by the soundtrack after the weekend. Hooray for a great night of fun. That is what movies are for.Maria Bello and Andre Braugner were just perfect fits for their parts.",
         "The Duets is very charming, relaxing film. You can take your popcorn, sit back and enjoy adventure of middle age man who decided to put some action in his life and for sure many people will laugh hardly recognizing themselves and their funny moments in frustrations :) I don't want to spoil anything, you just watch this and enjoy in flow of sweet polite characters here and their story. Well, we all are sick from violence and swearing in movies and they are worst year by year so i hope you see this one and fill brain with joy,honesty and love. You can find that in The Duets. For sure. If IMDb allows me to share beautiful music video from this movie it will be great: https://vimeo.com/47710464"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Hollywood Pictures",
         "Seven Arts Pictures",
         "Beacon Communications"
      ],
      "summaries": [
         "Duets is a road-trip comedy which revolves around the little known world of karaoke and the whimsical characters who inhabit it. There's the struggling singer who dreams of making it to the big time, a frustrated salesman who ends up on an unexpected road trip, the dysfunctional family performers which includes a con-artist and his long lost daughter, and an escaped convict with the voice of an angel. All roads lead to Omaha, site of a national karaoke competition where this motley group of singers and stars come together for a blow-out sing-off.",
         "A professional karaoke hustler reconnects with his daughter and a bored suburban businessman turns outlaw karaoke singer, among other plotlines."
      ],
      "budget": 15000000
   },
   "movielensId": 3901,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-09-09",
      "dvdReleaseDate": "2001-05-08",
      "directors": ["Bruce Paltrow"],
      "runtime": 112,
      "movieId": 3901,
      "title": "Duets",
      "mpaa": "R",
      "actors": [
         "Gwyneth Paltrow",
         "Scott Speedman",
         "Maria Bello",
         "Paul Giamatti",
         "Andre Braugher",
         "Huey Lewis"
      ],
      "imdbMovieId": "0134630",
      "originalTitle": "Duets",
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["horNJVMqRw0"],
      "plotSummary": "Duets is a road-trip comedy which revolves around the little known world of karaoke and the whimsical characters who inhabit it. All roads lead to Omaha, site of a national karaoke competition where this motley group of singers and stars come together for a blow-out sing-off.",
      "tmdbMovieId": 18074,
      "avgRating": 2.83682,
      "releaseYear": "2000",
      "numRatings": 812,
      "posterPath": "/mWQwMVXLzEjKeFIjvkpqNAM7UF7.jpg"
   }
}