{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0182508",
      "video": false,
      "title": "Urbania",
      "recommendations": [
         46469,
         172854,
         47462,
         345001,
         5873,
         47619,
         21001,
         31978,
         33358,
         32728,
         87107,
         49221,
         5591,
         19555,
         84274,
         17021,
         77621,
         86955,
         84298,
         15850
      ],
      "backdrop_path": "/fTqHYmPv3QHyIVehxYUAD9cWlHv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe4967c3a368484e12999b",
               "name": "Dan Futterman",
               "profile_path": "/bVcDnTi6y1bzE9HINbBtctkvtcY.jpg",
               "id": 5346,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Steve",
               "gender": 0,
               "credit_id": "52fe4967c3a368484e12999f",
               "name": "Matt Keeslar",
               "profile_path": "/grucMGE9xHQ4uoE0QSD0dZVQTKe.jpg",
               "id": 35598,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dean",
               "gender": 2,
               "credit_id": "52fe4967c3a368484e1299a3",
               "name": "Samuel Ball",
               "profile_path": "/knII4e66jnaGEdVpVjFEJrFgSeU.jpg",
               "id": 21532,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe4967c3a368484e1299a7",
               "name": "Lothaire Bluteau",
               "profile_path": "/4T08wOIWv84KqMYYsd1VUSX1lFF.jpg",
               "id": 38524,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Brett",
               "gender": 2,
               "credit_id": "56b677c292514166150043bc",
               "name": "Alan Cumming",
               "profile_path": "/5U7rmz20snvKB099P30IJu2nmRb.jpg",
               "id": 10697,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Matt",
               "gender": 2,
               "credit_id": "56b677d9c3a36806e600a6f4",
               "name": "Josh Hamilton",
               "profile_path": "/uzqTbGXDrVp6j97OkbFBphJUmKf.jpg",
               "id": 52419,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Sam",
               "gender": 0,
               "credit_id": "56b67826925141677c000515",
               "name": "James Simon",
               "profile_path": "/iWhkDh3yzeOUnmEzM2YRzLXf655.jpg",
               "id": 1573675,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Deedee",
               "gender": 1,
               "credit_id": "56b6787ec3a3684816004645",
               "name": "Megan Dodds",
               "profile_path": "/nI0AsHa4AQco77RIKRb9ehwJCrE.jpg",
               "id": 17198,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Ron",
               "gender": 2,
               "credit_id": "56b67892c3a36807000098ab",
               "name": "Gabriel Olds",
               "profile_path": "/rsPF64LgMNaWQ3eoDUjZoyoMI9r.jpg",
               "id": 106435,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Clara - The Married Woman",
               "gender": 1,
               "credit_id": "56b678a6c3a36806e600a6ff",
               "name": "Barbara Sukowa",
               "profile_path": "/mGKhBMI9P2teTXC1v9HgS3WtL73.jpg",
               "id": 23378,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Don",
               "gender": 2,
               "credit_id": "56b678b8c3a368481600464d",
               "name": "Gerry Bamman",
               "profile_path": "/ybNlqyoXcAQ5pKz6fFD7Ff7LKcz.jpg",
               "id": 11517,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Judy - The Photo Lady",
               "gender": 1,
               "credit_id": "56b678ce9251413c01003420",
               "name": "Pamela Shaw",
               "profile_path": "/jLpfsMKLLWUCAVkkaPYxkipAJpu.jpg",
               "id": 111680,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Efraim - The Window Couple",
               "gender": 2,
               "credit_id": "56b678ec9251413ca10033c0",
               "name": "Christopher Bradley",
               "profile_path": "/efLSQiHOkueOjVGu4muU26eYFKm.jpg",
               "id": 182600,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4967c3a368484e129997",
            "name": "Jon Matthews",
            "profile_path": null,
            "id": 193390,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.367149,
      "production_countries": [],
      "id": 77332,
      "vote_count": 13,
      "budget": 0,
      "overview": "Charlie takes an odyssey through grief during a fall weekend in New York City. His encounters are planned and chance: with a homeless man who sleeps by his building, with a friend who's dying, with the couple who lives (and noisily loves) in the flat above him, with a bartender and a one-night-stand he follows home, and with a tattooed stranger whom he seeks out and befriends. Along the way, Charlie inhabits a city full of moments of violence and of stories and legends: a kidney thief, a microwaved poodle, a rat in a hot dog bun, a baby left on a car top, a tourist's toothbrush, needles in public-phone change slots. Charlie lives and tells his own stories. What caused his melancholy?",
      "similar": [],
      "original_title": "Urbania",
      "runtime": 103,
      "poster_path": "/qL2vKjQKgTzGUGXcsyBftUiwpLw.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-01-24",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Heard any good stories lately?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jon Shear"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Daniel Reitz",
         "Daniel Reitz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0182508/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxMTU4Mjc3OV5BMl5BanBnXkFtZTcwMjU1ODQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Dan Futterman, Scott Denny, Paige Turco | See full cast and crew »"],
      "reviews": [
         "If you're tired of gay-themed movies about groups of catty, superficial gays backstabbing each other over guys and then offering platitudes of eternal friendship, or treacly movies about English schoolboys in love set against the gritty urban backdrop of their working-class neighborhood, or movies about a fabulous woman's best friend who is clean-cut, bitchy, and dresses to the height of fashion but is in no way a gay stereotype AT ALL, then Urbania is for you. It stands apart from every gay-themed movie I've seen in that it's unsentimental, free of the feel-good sentiment almost every other gay movie is terrified to be without, and is a challenging piece of writing and film. It's the first gay movie I've seen that doesn't bend over backwards to excuse the fact that it's gay. This is a movie that is impossible to synopsize without giving away its biggest plot point, but suffice to say it's refreshing to see a movie that takes the depth and intellect of its gay characters for granted, and also assumes a decent level of intelligence of its audience. The movie contains complex characterizations and a challenging structure, exploring the dark side of human nature, especially the nature of those who have dealt with a number of additional issues revolving around being gay. This film begins a mile and a half past the starting point of other gay movies, who still seem stuck desperately trying to peddle a \"Gay is Okay\" agenda. The acting in this movie is also good, especially the main character, and the editing and cinematography keep the viewing experience tense and exciting. I did not enjoy watching this movie, the way one enjoys, say, \"Godzilla 2000.\" It's a harrowing and difficult film. But it's wonderful to see a movie like this coming out; one that is challenging and unsentimental, a real, thought-provoking work of film that happens to take gay men and their issues as its topic. It's a big step forward for gay film, and makes almost all other gay-themed films look as horribly amateurish, or just plain horrible, as they are. --- Check out website devoted to bad, cheesy and gay movies: www.cinemademerde.com",
         "Finally! A gay-themed movie with some depth! It is REALLY refreshing to see a movie about gay men that goes beyond their sexual orientation. It seems that most gay-themed movies in recent years are just about teenagers coming out to their parents. Although some of these films have been good (\"Edge of Seventeen\" for example), it is very nice to see a movie where the main character's sexuality is not the focal point of the film. While homosexuality plays a substantial role in what \"Urbania\" is about, it is not the centerpiece of the story. This film actually has a hauntingly resonant story, well-written and memorable characters, a terrific ensemble cast, and brilliant direction by Jon Shear in a directorial debut. I really loved how this film was directed in a non-linear fashion. You only gradually learn why the main character, Charlie, (Dan Futterman in a great performance) is so troubled. The climax of the film and the resolution are both heart-stopping and cathartic. And there are many great scenes that lead up to this finale that are alternately hilarious and emotionally moving. One of the best of the year 2000. I think I will see it again.",
         "A night in the life of obsessed Charlie (Dan Futterman) who, thanks to Daylight Savings Time, has one more hour of the night to fulfill his need \u0096 whatever it may be. Like a moth to a flame he is drawn to Dean (Samuel Ball) \u0096 but the question is: will the flame consume him? The story is told in a disjointed series of flashbacks that means you must actually pay attention to the complex story. This is one film where the term `cinematic style' cannot be under used. It is stylish, dark, atmospheric and intriguing from start to finish. It is also hilariously funny at times. It was nominated for many awards and won most of them; including Best Actor for Dan Futterman at the Seattle International Film Festival. He is most well-known for his role in `Birdcage' as Calista Flockhart's boyfriend. He plays against type as the obsessed gay man determined to make this one night in his life count for something important. Every urban legend ever repeated is exhumed; and as Charlie says near the end of the film `We would be the stuff of legend.' Jordan Beswisck (Casting) and Director Jon Shear did an especially remarkable job with the supporting characters. They slink in and out of Charlie's night like the creatures of the dark they are. Particularly notable are Josh Hamilton as Matt the bartender, Lothaire Bluteau as the street person that has taken up residence on Charlie's door step, William Sage as Charlie's upstairs neighbor Chuck and his girl friend Clara brilliantly played by Barbara Sukowa. What an amazing, yet disjointed, ensemble! The cinematography by Shane F. Kelly deserves special recognition: it is dark, fast, enigmatic and always brilliant. The producers Stephanie Golden and J. Todd Harris also need to be acknowledged for their bravery and foresight in bringing such a difficult film to the screen. They have the ability to see beyond the obvious to the golden moment that IS this film. This is not a film for everyone \u0096 but if you possess intelligence, wit and character it is a film you must see.",
         "\"Urbania\" is a film that deals with tough issues in a complex way. Directed by first-timer Jon Shear with amazing surehandedness, \"Urbania\" tells the story of recently-singled Charlie, who has seemingly become disillusioned from society. Shear's script, based on the play \"Urban Folk Tales,\" is a sharp and occasionally hilarious look at a gay man's search for redemption and love. Obsessed with a man he's only seen on the street, Charlie wanders the streets, looking for love, and hoping to rekindle his past relationship. It's a simple story, dealing with some hard issues in a non-linear way. Dan Futterman is heartbreaking in a very challenging role that requires him to gain our sympathy in spite of his problems. On top of it all, however, is Shear, who handles this material with affection and heart. His direction manages to be moody, atmospheric, suspenseful, and scary, all the while maintaining our sympathy for Charlie. Thankfully, just as the film gets too serious for its own good, Shear throws in numerous asides to urban folk tales and reenacts them. It's very funny, but in the end, it's as cathartic a film as you will see all year. Do yourself a favor and catch this emotionally-haunting film but remember: bring tissues. You'll need 'em.",
         "SPOILER ALERT ***** SPOILER ALERT ***** It is difficult to discuss this film without giving away key plot points. I'll try to do so without revealing too much - don't want to ruin someone's initial viewing, but if I do this inadvertently, please forgive me- hence the SPOILER ALERT. Charlie is a gay man, coping with the death of his lover, Chris, killed before his eyes by thugs, with Charlie being restrained and prevented from helping. He carries the guilt with him that he could not protect his lover. He recognized a tattoo on the arm of the killer and suddenly remembers cruising him. He has (oddly enough) chosen not to reveal the man's identity to the police - he wants to take his vengeance on him personally. (You may ask why the gang left him alive if they knew he could identify them, but that's a plot point I cannot resolve). So begins a journey of a Ulysses in Nighttown as he seeks \"stories\" from the flotsam and jetsam of humanity he meets while searching for Dean, the identified killer- a hunk of a beast who delights in abusing women and gay men. The odd assortment of types he is thrown up against - or manages to avoid are: a woman who seduces men, drugs them, and then cuts out one of their kidneys (a particularly gruesome and disturbing piece that opens the film); a woman who pays a bartender to expose himself, a homeless brain-damaged man, a friend who is dying of AIDS, a woman who places her wet poodle in a microwave to dry it (wrong move!), a straight couple he taunts at a bar, a bisexual tease he follows to a belligerent sexual encounter, etc. When he finally finds Dean, he begins a cat and mouse game, befriending the man while not revealing his gay identity, as he learns more and more about the hateful and abusive monster who killed his lover. Finally, he has him at his mercy, knife in hand, in an abandoned field. What makes this film so engrossing is the exceptional direction of Jon Shear, although the excessive violence left me quite queasy and disgusted, and the trio of exceptional performances - Dan Futterman (reminding me so much of Ben Gazzara), Samuel Ball, and Matt Keeslar. The romantic scenes between Futterman and Keeslar (in flashback and particularly in one set in a white heaven after life - a dream- a hallucination???) are amazingly palpable. You feel as if you are a voyeur allowed in to the most intimate of moments. How these actors achieved this connection is astonishing. Keeslar is strikingly handsome with a personality that is gentle and kind. He lets us FEEL Futterman's emotional pain at his loss by making us fall in love with him too. Ball is like an accident - incredible bone structure, containing a loathsome soul - you want to turn away, but you're fascinated to see if some part of him is redeemable. Lothaire Bluteau delivers an exceptional turn in a small role as a homeless man, Charlie befriends. Likewise, Alan Cumming is unforgettable in one scene. We wanted to see more of him. Christopher Bradley appears all too briefly in two scenes - barely a minute on screen. Futterman's emotional breakdown in the \"white room,\" confronting a lover who no longer exists, is so heartbreaking, you'll be in tears if you haven't gone there already. This is an incredibly powerful film - very hard to take - have the fast forward button handy during the violent scenes if need be. I can guarantee one thing- the images will stay with you - you'll never forget it.",
         "Urbania starts out with the protagonist asking us: \"Heard any good stories lately?\" Next, we see a couple well-known urban legends played out, and this sets the tone and theme for the rest of the film, which starts out to be about a man trying to come to terms with recent past events, while pursuing a potential love interest (but you don't really learn much about this man until the plot unravels.) This movie was so fascinating I watched it twice in one weekend. I rarely do that, but this seems to demand multiple viewings. This is easily the best movie I've seen about urban legends. It utilizes a bleak urban setting to weave this popular folklore with the story of one man's night and the difficult time he has struggling to face his past and gain control of his life. Fantasy and reality are appropriately difficult to separate, just as it is with urban legends. The cinematography is excellent and innovative, the script is tight, the acting is perfect (Dan Futterman is outstanding as the lead), the character development is exceptional. This is quite brilliant, really. Like a David Lynch film, every second, every sound, every word, every image tells you something important. Finally, this is a film that (going along splendidly with the urban legend theme) questions assumptions some groups of of people have about \"the other\" (and vice versa). My Rating: 9/10.",
         "Charlie (Dan Futterman) wanders around NYC one night looking for another man who (might) have something he is looking for. That's all I'm going to say about this--you have to see the film to understand it. The film starts off slow (and surreal) but quickly draws you in with fast, incredible images and a plot that becomes clearer as the movie goes on. Dan Futterman is just superb in his role...this had to have been a difficult part to play but he pulls it off. Actually no one is bad but Matt Keeslar (as his lover Chris) and Samuel Bell (as Dean) deserve special mention. This film is not for everybody. It challenges you and makes you think (how many films nowadays do that?) and is very dark, disturbing and depressing. It also demands multiple viewings (I had to see it twice to actually understand it). Also there is some violence that is jarring. But, at the end, I was in tears--I've seen this movie at least seven times and I STILL cry at the ending. It's actually a happy ending (sort of) but really hits hard. Basically this film deals with love, loss and coming to terms with it. Also there are urban legends played out during the film--they DO fit in. It deals with gay relationships primarily and there's plenty of kissing and flashes of nudity. Easily one of the best films of 2000 and it's in my list as one of the ten top films ever made. Just great--I highly recommend this. Try to see it on DVD--the commentary and extras really explain the story and themes more.",
         "I just caught \"Urbania\" on IFC. What a terrific surprise! I had no idea this film even existed. \"Urbania\" is one of those rare films that grabs you by the back of the neck and holds holds you hostage until the final credits. It's as if one were shadowing the lead character as he plays out the fate of a lonely and harrowing night, facing demons of circumstance as well as a few monsters he creates himself. Watching this film, I felt as if I was being forced to examine some disturbing sides of life when all I wanted to do was turn my head and look another direction. Much like driving upon a tragic car accident, it's hard not to stare but, by the brute force of some macabre fascination that lives deep in the human psyche, one feels compelled to do just that. While \"Urbania\" is a tragedy, the content is handled with a sense of grace and humility. During the final frames, one is left with a feeling of relief and healing, although tainted with the bitterness of loss. The direction, screenplay and style of \"Urbania\" is superb. The acting is fantastic. This film is a must see!",
         "I got this movie through Netflix. The first time I sat down to watch this movie, it was late at night and I thought it seemed sort of wierd. The first scene made me a bit squeemish, it didn't seem like what I was expecting, and I was being interrupted by phone calls anyway, and couldn't really give it my full attention, etc. so I thought, \"well, I'll put that one aside for now and think about whether I really want to watch it.\" Finally, one evening I was rummaging around for something to watch and I saw this lying there and said, \"OK, I'll give it another try.\" I am so glad that I did. As I let it play on from the beginning I found myself totally engrossed. Turns out it's very fast moving and you have to be on the ball to get everything out of the movie. The ending moved me to tears. This is a thriller with a dark thread of ironic comedy woven into a very serious and moving story. I love the writer's and director's use of urban legends. I think the film clearly illustrates how there really are injustices in this life, (ie: the story of the main characters), but how many horrible injustices in society get overlooked and dismissed as trivial, through the desensitization of being grouped together and schluffed off as 'just another one of those urban legends...it didn't happen in my back yard so it must never really happen...etc.'? But, as Charlie's character points out, \"s**t really does happen\". The truth is that these types of injustices happen often (whether to straights, gays, lesbians, people of color, homeless, handicapped, etc.) but it's always easy to overlook and dismiss as non-existant injustices that have never happened to you or anyone you know. No amount of denial can negate fact. No amount of mass ignorance can void truth. This film is not a good 1st or 2nd date movie and not a good choice for the person who has no depth of character, intellect or emotion. But if you are someone who has the ability to think deeply and see further than the end of your nose, and enjoy reflecting on a film after you see it, you will not be disappointed.",
         "I recently saw this movie and let me say this, WOW. I was blown away by the whole thing! I was shocked at the end especially. Director Jon Shear did a terrific job, and i am appauled that he recieved little or no recognition for this movie. It was powerful, totally redeeming the silly and love-stricken gay films of recent memory, (Beautiful Thing, Get Real and the like,). It gave the gay film industry and not to mention society a new face. Dan Futterman, (Bless him,) did an about-face on his career with this movie, as did Samuel Ball, Matt Keeslar, and Alan Cumming. If i could, id award ALL of those in this film. The depth, power and heat of Urbania are its real stunning feats. It plays as a hetero-flick, (at the beginning, i thought Charlie was straight,) and engulfs us in heart-warming and loving flash-backs. But towards the climax, the film reveals its true colors. Gay characters have never been played with such villanous or sinister-esque qualities. It is a slap in the face for those who think the homosexual community is weak and \"sissified.\" Futterman's brilliance for villany upheld the main idea and the motive behind Charlie's actions. I was shaken when the movie was over, shaken in a good way. If this movie had gone through mainstream release,(which it should have,) homosexuals would be seen in another light. A more darker light which would bring heterosexuals closer to accepting the gay community as the people they are. ****, (four stars out of four) -a shocking, brilliant, and redeeming work of art-"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Daly-Harris Productions"],
      "summaries": [
         "Charlie takes an odyssey through grief during a fall weekend in New York City. His encounters are planned and chance: with a homeless man who sleeps by his building, with a friend who's dying, with the couple who lives (and noisily loves) in the flat above him, with a bartender and a one-night-stand he follows home, and with a tattooed stranger whom he seeks out and befriends. Along the way, Charlie inhabits a city full of moments of violence and of stories and legends: a kidney thief, a microwaved poodle, a rat in a hot dog bun, a baby left on a car top, a tourist's toothbrush, needles in public-phone change slots. Charlie lives and tells his own stories. What caused his melancholy?",
         "A tour of The Anger Stage."
      ],
      "budget": 225000
   },
   "movielensId": 3903,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-01-24",
      "dvdReleaseDate": "2001-03-13",
      "directors": ["Jon Matthews"],
      "runtime": 103,
      "movieId": 3903,
      "title": "Urbania",
      "mpaa": "",
      "actors": [
         "Dan Futterman",
         "Matt Keeslar",
         "Samuel Ball",
         "Lothaire Bluteau",
         "Alan Cumming",
         "Josh Hamilton",
         "James Simon",
         "Megan Dodds",
         "Gabriel Olds",
         "Barbara Sukowa",
         "Gerry Bamman",
         "Pamela Shaw",
         "Christopher Bradley"
      ],
      "imdbMovieId": "0182508",
      "originalTitle": "Urbania",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["sBaoJ1qb5p8"],
      "plotSummary": "Charlie takes an odyssey through grief during a fall weekend in New York City. His encounters are planned and chance: with a homeless man who sleeps by his building, with a friend who's dying, with the couple who lives (and noisily loves) in the flat above him, with a bartender and a one-night-stand he follows home, and with a tattooed stranger whom he seeks out and befriends. Along the way, Charlie inhabits a city full of moments of violence and of stories and legends: a kidney thief, a microwaved poodle, a rat in a hot dog bun, a baby left on a car top, a tourist's toothbrush, needles in public-phone change slots. Charlie lives and tells his own stories. What caused his melancholy?",
      "tmdbMovieId": 77332,
      "avgRating": 3.33086,
      "releaseYear": "2000",
      "numRatings": 269,
      "posterPath": "/qL2vKjQKgTzGUGXcsyBftUiwpLw.jpg"
   }
}