{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0188694",
      "video": false,
      "title": "Uninvited Guest",
      "recommendations": [],
      "backdrop_path": "/zLSXDOGUds6h1IcvDPvwTo0qAGp.jpg",
      "revenue": 170832,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Silk",
               "gender": 2,
               "credit_id": "52fe455ec3a368484e0561f5",
               "name": "Mekhi Phifer",
               "profile_path": "/xrv9RDMPoTd9NsfpUzL81XglAmk.jpg",
               "id": 327,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe455ec3a368484e0561f9",
               "name": "Mari Morrow",
               "profile_path": "/ivvkGg3Oq36eiu1o4PFEJkT4rxp.jpg",
               "id": 42743,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Tammy",
               "gender": 1,
               "credit_id": "52fe455ec3a368484e0561fd",
               "name": "Malinda Williams",
               "profile_path": "/hx4vstXwizQOSuFQ8awWO7fcR7Y.jpg",
               "id": 74612,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Howard",
               "gender": 0,
               "credit_id": "52fe455ec3a368484e056201",
               "name": "Mel Jackson",
               "profile_path": "/e7qEqOblarMz922qWGdyE5Fm44Q.jpg",
               "id": 98622,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mo",
               "gender": 2,
               "credit_id": "52fe455ec3a368484e056205",
               "name": "Wanya Morris",
               "profile_path": null,
               "id": 98624,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Tre",
               "gender": 2,
               "credit_id": "52fe455ec3a368484e056209",
               "name": "William-Christopher Stephens",
               "profile_path": "/wNFPBwd9pL7y8x0hcOIhoWQ0Ax2.jpg",
               "id": 98626,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mecca",
               "gender": 1,
               "credit_id": "52fe455ec3a368484e05620d",
               "name": "Kim Fields",
               "profile_path": "/MYOL9TGBy4xVT9zvDOpIPcO8uV.jpg",
               "id": 98628,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe455ec3a368484e0561eb",
               "name": "Timothy Wayne Folsome",
               "profile_path": null,
               "id": 95646,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe455ec3a368484e0561f1",
               "name": "Timothy Wayne Folsome",
               "profile_path": null,
               "id": 95646,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.543621,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27665,
      "vote_count": 2,
      "budget": 0,
      "overview": "During a small gathering, a smooth, seductive stranger is invited into a couple's house party and falls in love with the wife. Turns out the stranger is an escaped convict who demands that the wife leave the country with him and threatens to kill anyone who stands in his way.",
      "similar": [
         274,
         10285,
         949,
         189,
         1949,
         2832,
         181283,
         336843,
         158011,
         910,
         996,
         654,
         1939,
         8834,
         12150,
         371608,
         4638,
         845,
         28902,
         72784
      ],
      "original_title": "Uninvited Guest",
      "runtime": 116,
      "poster_path": "/cTq2KWemD06dndZ8gnPZjOPbmIO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-06-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Timothy Wayne Folsome"],
      "runtime": 116,
      "synopsis": "Debbie and Howard are celebrating their wedding anniversary. Or so Debbie thought. A special night together turns into a nightmare when Howard lets a man into the house to use the phone. Who is the smooth stranger who immediately takes to Debbie? And what does he really want? Debbie and Howard soon find out the answer to the question, and when they do, their lives will never be the same again. Be careful who you let into the house. Especially the Uninvited Guest.",
      "writers": ["Timothy Wayne Folsome"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0188694/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5NzA2MzE0MV5BMl5BanBnXkFtZTYwODQxMDM5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mekhi Phifer, Mari Morrow, Malinda Williams | See full cast and crew »"],
      "reviews": [
         "Though a low budget movie, this is the stuff movies should be. There is no need for CG and glossing and there are a few times the plot is slow, but very few. Overall, with the twists and turns and the \"humanness\" of the characters, this movie is better than most, IMHO. The \"reality\" is high and that grabs the viewer in a way most big budget movies cannot do. The idea of many high-grossing productions is escapism, and that's fine, they do what they are supposed to do. But this movie drags you in rather than allowing an escape, wonderfully refreshing and well done. Cast, crew, and director, take a bow. The camera work also deserves high honors. No, it does not have the most erotic, gore-filled scenes. It does show what real people are capable of when driven by their own desires. Howie, the wannabe scriptwriter, willing to do anything, Tammi, the wannabe actress, in the same boat, Silk, the killer and psychopath doing what he does and then Howie's wife, and two friends, duped as they would be. I'd give it a solid 8 and hope for more from this talented group.",
         "The beginning of the movie i found to be to strung out. It took forever for the plot to start taking place and it was hardly scary at all. It was more of a erotic mystery film than a horror. I found the acting to be somewhat horrible and i think Mekhi Phifer, who played Silk, should have thought twice about doing this movie. The \"Scary\" scenes included mostly of guns being fired and inevitable shouting, wasn't horrifying at all. Acting on some scenes seemed to be unrealistic. Ending of the plot was twisted and good but wasted to much time getting to the plot. I definitely wouldn't pay to see this movie nor would i buy it to add to my collection",
         "A good thriller, keeps you unaware of how plot will develop and every time the bad guy is gonna be knocked down, a mishap happens, which leads to uncover the real story. Watch it till end! You won't regret. Movie is certainly far from perfection - budget definitely was scarce, at the same time all male characters are rather well played, female roles are less impressive, though not bad. Some did call this movie erotic, may be formally correct, but sex is shown in more innocent, one could have expect from erotic thriller. Still, the best in this movie I found - a screenplay. The very often used moral in most of US thrillers - DO NOT GET A STRANGER IN HOUSE! If you do, you're wrong!",
         "I saw this movie in Columbus, OH with my girlfriend and this movie was great!! It had everything a thriller should have!! The ending is just pure genius!! If you get the chance, go see this movie or rent, buy, but go see it!!",
         "A campy genre movie perfectly suited for your VCR, but not worth waiting in line for at the theatre. Just imagine an erotic thriller with few thrills and even less eroticism. By the end of movie, the filmmakers are determined for you to not care about a single character in the story.",
         "This is supposed to be a sort of mystery thriller but suffers from a totally unbelievable plot. For the first half hour I couldn't help laughing because some of the characters behave in such bizarre and unnatural ways. The acting isn't that bad, but what is it all for? Of course not everyone is who they appear to be, and there are all kinds of surprises and double crosses. We are supposed to be distracted by all the action, murder and jive talk so we never think about what it's supposed to be all about. Well here's the spoiler and you decide. You don't find out the full stupidity of the plot until the end, it mostly comes out a piece at a time. *SPOILER* Okay. Howard is an aspiring writer. He wants to take a shortcut to fame and fortune so he hires a violent thug, a stranger, right off the street to stage a home invasion at his nice middle class home, kill his two clueless friends, and by the way, have consensual sex with his wife, an event for which he carefully plans ahead of time by denying her sex for several weeks in advance so she will willingly submit to the slick advances of the home invader. So, actually, the guest is invited. What does Howard have in mind? He actually believes that if he's the victim of a brutal home invasion he will be able to write about it and sell the story and thereby get fame and money. That, of course, is crazy. How many victims of violent crimes can attain instant fame and fortune just by writing about the crime? None, or course. Not unless the crime gets nationwide media attention for being about some very famous celebrity. What if the hired home invader just kills Howard and takes his money? Did he ever think of that? What does getting his wife seduced by the thug have to do with anything? And the wife easily submits to the thug's advances so you're left wondering what's wrong with her. Is she in on the plot or is she just stupid? (It's the latter.) Yes, Howard is a sadist and a psychopath, but what he does doesn't make any sense. It is, in fact insane, though you are supposed to believe that he's just doing it for money and recognition. The problem is that the movie makers just didn't think this one through.",
         "In the tradition of \"Deathtrap,\" this script is well crafted and believable. Admittedly it needs cutting, but then so does real life. The acting is smooth (especially Mekhi Phifer as \"Silk\"--no pun intended) and the direction could have been a bit faster paced, but interesting none the less. If the viewer comes to this film unbiased by box office receipts as the ridiculous yard stick by which a \"product's\" worth is currently measured, he or she will appreciate the twists and turns, the depth of the characters of, \"Silk,\" and even the seriously neglected and scarred-by-loss, \"Debbie,\" well played by the stunning Mari Morrow. I enjoyed the skillful manipulation of my feelings toward Silk (the bad guy) and truly cared about Debbie. Identifying with characters and coming away from a film not feeling tricked but, instead, feeling like a \"fly on the wall,\" with a sense of Hollywood reality (an oxymoron, I realize) is always a hoot. I think Timothy Wayne Folsome, perhaps was ahead of his time, in that in the few short years since this was filmed, it has become shamelessly apparent that everyone's desire (even in the fly-over states) is to claim the fifteen minutes. Indeed now, any other behavior seems abnormal. Who is more apt to reach out and devise a plan than Howard, the ambitious, coked-up, married-for-money would-be script writer? Malinda Williams turns in her usual solid performance. William Christopher Stephens in his only credit, is just right, and Wanya Morris, \"Mo,\" formerly of, \"Boyz II Men,\" is a find. Bottom line: A very good little film with no loose ends, a question of love (as it always is), and even a bit of beauty thrown in the bargain by way of the thread in the form of a painting entitled, \"Life.\""
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Picture Me Rollin' Productions"],
      "summaries": ["Debbie and Howard are celebrating their wedding anniversary. Or so Debbie thought. A special night together turns into a nightmare when Howard lets a man into the house to use the phone. Who is the smooth stranger who immediately takes to Debbie? And what does he really want? Debbie and Howard soon find out the answer to the question, and when they do, their lives will never be the same again. Be careful who you let into the house. Especially the Uninvited Guest."],
      "budget": 0
   },
   "movielensId": 3904,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-06-01",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Timothy Wayne Folsome"],
      "runtime": 116,
      "movieId": 3904,
      "title": "Uninvited Guest",
      "mpaa": "",
      "actors": [
         "Mekhi Phifer",
         "Mari Morrow",
         "Malinda Williams",
         "Mel Jackson",
         "Wanya Morris",
         "William-Christopher Stephens",
         "Kim Fields"
      ],
      "imdbMovieId": "0188694",
      "originalTitle": "Uninvited Guest",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "During a small gathering, a smooth, seductive stranger is invited into a couple's house party and falls in love with the wife. Turns out the stranger is an escaped convict who demands that the wife leave the country with him and threatens to kill anyone who stands in his way.",
      "tmdbMovieId": 27665,
      "avgRating": 1.81818,
      "releaseYear": "1999",
      "numRatings": 11,
      "posterPath": "/cTq2KWemD06dndZ8gnPZjOPbmIO.jpg"
   }
}