{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "superhero",
         "id": 9715
      }],
      "imdb_id": "tt0181836",
      "video": false,
      "title": "The Specials",
      "recommendations": [
         13442,
         62107,
         52855,
         16155,
         14887,
         63844,
         19033,
         16433,
         34322,
         44015,
         18856,
         49804,
         26156,
         13072,
         24050,
         41852,
         30669,
         33152,
         20718,
         17207
      ],
      "backdrop_path": "/ttjJchqAbh3imijJpYxJLJnqvaO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nightbird",
               "gender": 1,
               "credit_id": "52fe45c1c3a368484e06d1cb",
               "name": "Jordan Ladd",
               "profile_path": "/bXTFdzN7CA8A6bh5rNkVSK5HUoq.jpg",
               "id": 20492,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Weevil",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1cf",
               "name": "Rob Lowe",
               "profile_path": "/yt6vMZVBXGCJL0xRE4jFa4SjzcQ.jpg",
               "id": 2879,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Amok",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1d3",
               "name": "Jamie Kennedy",
               "profile_path": "/fwvClPv21iaeAsF8Xdg1I0nF8ls.jpg",
               "id": 6213,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The Strobe",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1d7",
               "name": "Thomas Haden Church",
               "profile_path": "/a7a2cG0wtkKZ9NpkVfmcyn0UvOU.jpg",
               "id": 19159,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Minute Man",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1db",
               "name": "James Gunn",
               "profile_path": "/2w2mprJhSucgA8pbM5BRdBKl3p9.jpg",
               "id": 15218,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ms. Indestructible",
               "gender": 1,
               "credit_id": "52fe45c1c3a368484e06d1df",
               "name": "Paget Brewster",
               "profile_path": "/4yzWN3Up7HXvAmuq8D4CBxGjtlz.jpg",
               "id": 15423,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Alien Orphan",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1e3",
               "name": "Sean Gunn",
               "profile_path": "/tiolBlPytndQVGHO9vLnBKWWenq.jpg",
               "id": 51663,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Deadly Girl",
               "gender": 1,
               "credit_id": "52fe45c1c3a368484e06d1e7",
               "name": "Judy Greer",
               "profile_path": "/ooEejsGv4loFIKnbe2arzOwWy6H.jpg",
               "id": 20750,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mr. Smart",
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1eb",
               "name": "Jim Zulevic",
               "profile_path": null,
               "id": 59408,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Eight",
               "gender": 1,
               "credit_id": "52fe45c1c3a368484e06d1ef",
               "name": "Lauren Cohn",
               "profile_path": "/hbZbmJmHDGMIud6GORruv8oEoOa.jpg",
               "id": 41506,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "College Girl",
               "gender": 1,
               "credit_id": "58b91f10925141608400812f",
               "name": "Jenna Fischer",
               "profile_path": "/i8jVPF6H6OxuXcZwKUSNYJjkZJy.jpg",
               "id": 51856,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1f5",
               "name": "Craig Mazin",
               "profile_path": "/c59ILZnJ8RHlVvRLzIm1Viu9l0k.jpg",
               "id": 35796,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c1c3a368484e06d1fb",
               "name": "James Gunn",
               "profile_path": "/2w2mprJhSucgA8pbM5BRdBKl3p9.jpg",
               "id": 15218,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.373805,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29015,
      "vote_count": 12,
      "budget": 0,
      "overview": "America's 7th Best Superhero Team, the Specials, are a group of geeks and oddballs. We get to see one day in their lives as fan and new member Nightbird joins the group, just in time for the group to get a new line of action figures. But the members' extreme personalities and personal issues threaten to rip the group apart.",
      "similar": [
         99861,
         1924,
         141052,
         155,
         1452,
         8536,
         9531,
         40662,
         379291,
         13640,
         49521,
         209112,
         364,
         100402,
         24428,
         272,
         1771,
         299534,
         297762,
         30061
      ],
      "original_title": "The Specials",
      "runtime": 82,
      "poster_path": "/yW4T1Acjo5y9zai2Rq3slZKTEki.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mindfire Entertainment",
            "id": 8068,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Brillstein-Grey Entertainment",
            "id": 1606,
            "origin_country": ""
         }
      ],
      "release_date": "2000-09-22",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Craig Mazin"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["James Gunn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181836/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzMTI5MDYwM15BMl5BanBnXkFtZTcwNDk0MzEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Rob Lowe, Thomas Haden Church, Paget Brewster | See full cast and crew »"],
      "reviews": [
         "Nifty low-budget variant on MYSTERY MEN, with a script that's about four times as good. Here, the superheroes are less dysfunctional and more beset by the amorous pangs and gnawing dissatisfactions of everyday life; the humor ranges from the gulpingly broad to the surprisingly observant, deft, life-sized. The movie is visually hideous, but the script is astonishingly lively, and some members of the cast burst out at you. As the Shatneresque team leader, the Strobe, Thomas Haden Church is like a concentrated Swat team of extreme earnestness. And there is a lovely scene--not really funny, but you can feel the audience beaming at it--in which a mongoloid \"space orphan,\" dandled like a pinhead mascot through most of the movie, takes the stage at a techno nightclub and breakdances to \"Life Is a Rock (But the Radio Rolled Me).\"",
         "From the people who brought us \"Free Enterprise\", \"The Specials\" is clearly made by the same caliber of geek, but this time it dives into the fantasy. The conceit of this film is pure genius: make a superhero movie in which there are no battles, and nobody uses their powers; just focus on their personal lives and interpersonal conflicts, and play it mostly for laughs. I've seen several reviews here for whom that itself is the complaint. Let them go back to watching \"Spawn\". Those of you who are able to see the potential in the concept are in for a treat. Going in, I'd only heard of Rob Lowe and Thomas Haden Church, both of whom are excellent. The surprise is that the rest of the cast keeps step all the way. They all understand the joke here, which is that they are not in on the joke. They're funny by way of taking it utterly seriously. This is not the \"Airplane\" of superhero movies. These people are completely serious about their past exploits and their powers, which we glimpse only briefly, and hear of in conversation. The movie's length is perfect. It clocks in at under 80 minutes, disappearing long before the idea becomes tired or overused. I actually wanted to see more, which is far preferable to wishing it were over sooner. I could actually see a TV series based on this concept. 7 out of 10.",
         "this is a wonderful movie, but if you're looking for flashy effects and big action scenes, rent a terminator movie. This is a movie for people who want to see interesting characters and personal interactions. It's full of great one-liners, and the movie masters the art of the pause. It made me interested in the characters themselves and i wish it had developed their history more, but there is only so much you can do in one movie. However the webpage has additional information on each hero in the group. I both hope and fear a possible sequel. I want more specials, but i don't want caddyshack 2.",
         "The specials is nothing short of brilliant. The comedy is wonderful, with a nice Clerk's style hard edge to most of it. The characters well realized, and the superhero world is taken to a logical, and never used before conclusion. Most importantly though, is the fact that the film has real heart, and characters you want to see more of. Special indeed.",
         "This Film is a great example of the fact that you don't need a budget to be a great movie. solid cast performance and a brilliantly funny script show just how easy it is to be successful. while the film leans more towards the fans of the comic book genre with humor more in tune with that vein, which is why it was so good, it wasn't trying to be a movie for everyone... people who don't read comics wont enjoy this half as much as people who do, unless they like their humor dark. mystery men is the closest comparison i can think of, but mystery men tried to hard and lacked the small charm and witty profanity ridden dialogue of the specials, and while mystery men had its moments, it just seemed to rely on visual humor which i found works more for kids like it says in the Specials... \"the specials don't exist for the pretty people...they exist for the geek, the outcast\" yadda yadda pick this up and laugh...if you don't, well...what are you? dead?",
         "One way a superhero film ought to be is Blade. Or maybe X-Men. Where it's pretty much animation, but they shell out the money for Halle Berry's body as well as her voice. And most of it is just watching Wesley Snipes put on sunglasses and then hit people. It's nifty, and, frankly, worth the $8 to see. The Specials is the other way. Nobody paid $8 to see it, but now, we all ought to be shelling out $20 for a DVD (or $16.99, and spend the change on some fried chicken. And a can of beer). A mockumentary on a mediocre superhero team, the Specials is great 'cause the fight scenes are verbal. And there aren't any sunglasses. Good soundtrack through. It's absolutely cheeky and self-deprecatory, and shows that superheros are like ordinary people. But crazier. Just a pleasure to watch. Very clever, with absolutely genius performances by The Weevil (Rob Lowe) and Deadly Girl (someone I don't know, but really ought to. She was fantastic). I even teared up a tiny bit. Kinda. In a manly way.",
         "It's a funny superhero movie with a dance number and no displays of superpowers. Either that concept appeals to you, and you'll love this movie, or it turns you off, and you'll hate it. I've always been curious what a superteam does on a slow day, now I know.",
         "Ever wonder what Superheroes do when they're not out saving the world from mass destruction? Well enter the world of \"The Specials\" to find out what goes on. Follow Nightbird, the newest member of The Specials as she fulfils a lifelong dream to become a superhero. Don't expect a lot of battles in this movie. Don't expect to see huge prehistoric beasts flying around. Don't expect The Strobe's lasers to be shooting out at you. What you can expect is a quirky, well-crafted movie about the ordinary lives of superheros. The Strobe and Ms. Indestructable are having marriage problems, Mr. Smart has some equipment malfunction, Kosgrove Toys really messes up the new Action Figure line, and poor Stretchy Boy, well let's just say, he's not grinning anymore. I found myself really liking this movie. I wanted to learn more about these people. I found myself getting wrapped-up in their all too human problems. I urge everyone to give this movie a chance, the performaces are crisp, the dialog is witty, and Jordan Ladd as Nightbird is cute as a button.",
         "This low-budget improvement on Mystery Men is about real people with slightly unreal abilities that don't save them from personal problems you'll recognize. What saves them is each other. As a bunch of misfits with only their very mild \"super\" powers and illusions(?) about fighting evil to bind them, this bunch of pretty much ordinary folks is doing the best it can. You see nothing, really, of their comic-book abilities. Instead, we see how they deal with the notion that they have something to contribute to a world that doesn't really appreciate them as it should. Which, I dare say, will reach a lot of the intended audience of this film. I can't quite explain why, but the close-up look at mostly banal daily problems affecting these earnest do-gooders was heartening. They mean well, even if they can't quite cope any better than the rest of us. That's something we all wish we could say about ourselves, and know it was true. For this bunch, it is true and, deep inside, they do know it. That's, maybe, what actually makes them special. Their lives are a mix of joy and sorrow, victory and defeat, humor and despair. They are probably more fun to watch than to be, but if there were a bunch like this operating in my town, I'd want to join.",
         "The life of a superhero often seems very glamorous. Being able to fly, have incredible strength, live forever, and defeat the bad guys is the stuff of many child's dreams. Popular comics such as Action Comics and Detective Comics brought new creations Superman and Batman to American readers and they soon became part of the national conscience and inspired children the world over for generations to come. The life of a superhero however is not without its problems. Sure, there are the adoring fans, the admiration of the world, and the great powers, but what about the costs? There are super villains bent on your destruction, a secret identity to protect, and in many cases a day job to pay the bills. In `The Specials' we are introduced to a new collection of heroes and learn firsthand how tough it can be to be a superhero and what a burden having superpowers can be. The Specials are listed as the sixth greatest superhero team in America and when they are not battling bad guys, recruiting new members, or trying to work on their public image, they are one big happy family or so it would seem. Director Craig Mazin's making his debut film gives us a look into the secret order of superheroes in a film that is part documentary, drama, and comedy. The Specials are lead by The Strobe (Thomas Haden Church) as he strives to set a good example in the community and fight crime on all levels. The Strobe is married to Ms. Indestructible (Paget Brewster), a lady who when not fighting at her husbands sides, spends her day answering the phones and paying the bills at the Special's lair, a simple house in a quiet California residential area. The story opens with the arrival of Nightbird (Jordan Ladd), who as the newest member of the team is finally meeting her partners in the business. Other than The Strobe and Ms. Indestructible Nightbird has little knowledge of her new team. There is The Weevil (Rob Lowe) Deadly Girl (Judy Greer), Minute Man (James Gunn), and Amok (Jamie Kennedy). They all seem friendly towards her as do other members she meets during the course of the day, yet all is not as well as it seems. It turns out that the weight of not having the name recognition that other superhero groups enjoy has put a strain on the team. The strobe is always chastising Amock and The Weevil for their behavior in public as a tabloid has recently published a picture of them smoking in a bathroom stall. The Strobe thinks that this behavior is not only unprofessional, but it hinders their chances to gain respect and thus better work. It seems that the group are only given assignments when other heroes are busy or not interested in the work that is offered. There are also complaints that names are being mispronounced and that their costumes are not flattering bringing the Strobe's leadership skills into question. Attempting to improve what looks to be a sinking ship, The Strobe announces that he has come to terms with a toy manufacturer for a line of action figures based on the Specials. It is believed that the toys will not only increase their standings amongst the public and other heroes, but will increase the cash flow for the team. Sadly things do not go as planned, as The Specials soon find themselves faced with their biggest challenge yet, surviving each other as petty jealousies, personal ambitions, fears and desires soon threaten to rip the group apart. `The Specials' is a direct to DVD release that while short on special features and effects is filled with originality. Yes the film does not have much of a story, but the film does not take itself to seriously at all and neither should viewers. Instead, it is a interesting slant on what happens to heroes when the cameras are off and how they have to contend with many of the same issues that everyday people do and how their powers can be a hindrance far more than a blessing at times. Church is great as the Strobe as he presents a leader who is ready to boil over at a moments notice from the pressures he is under both at work and on the homefront. Lowe is great as the son of the Original Weevil who has issues with his father as well as an offer from a far more established supergroup to ponder as he tries to decide between personal ambitions and loyalty. I could go on for a while about the various members and their issues but that would spoil the charm of the film. `The Specials' is not for everyone as it is silly film without much in the way of plot. However if you are a fan of comic heroes you may enjoy seeing the dirty laundry being aired and seeing the side of superheroes that the comics don't or cant show. I for one would liked to have seen more and hope that the film will find an audience on DVD and we may yet hear more from `The Specials' as there is still more of their story to tell. 2.5 stars out of 5 Gareth Von Kallenbach"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Brillstein-Grey Entertainment",
         "Mindfire Entertainment"
      ],
      "summaries": [
         "America's 7th Best Superhero Team, the Specials, are a group of geeks and oddballs. We get to see one day in their lives as fan and new member Nightbird joins the group, just in time for the group to get a new line of action figures. But the members' extreme personalities and personal issues threaten to rip the group apart.",
         "The Specials, the sixth or seventh greatest superhero group in the world, count the geeks and the oddballs among their fans. They don't have the prestige or the money that a group like the Crusaders has. But they've found their niche as the Ringo Starr of superhero teams. There's the Weevil, the most popular member and the one pursued by other teams; the blue-skinned, foul-mouthed Amok; Minute (My-noot) Man, who is sensitive about his oft-mispronounced name; the ever-sneering Deadly Girl; the naive and boyish U.S. Bill; the Strobe, the leader of the team; the Strobe's wife, Ms. Indestructible, who is having an affair with the Weevil; the irritatingly perky Power Chick; the green-skinned weirdo, Alien Orphan; the fat and pompous Mr. Smart; and Eight, who has eight different bodies. The new member is a longtime fan who calls herself Nightbird. Unfortunately, she joins just when Cosgrove Toys creates a new line of action figures based on the Specials. The company's disastrous press conference could mean the end to this cut-rate super-group.",
         "The sixth or seventh best superhero team in the world pursue their rightful place in the harshly competitive world of toy tie-ins and fighting evil."
      ],
      "budget": 1000000
   },
   "movielensId": 3905,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-09-22",
      "dvdReleaseDate": "2005-02-22",
      "directors": ["Craig Mazin"],
      "runtime": 82,
      "movieId": 3905,
      "title": "The Specials",
      "mpaa": "R",
      "actors": [
         "Jordan Ladd",
         "Rob Lowe",
         "Jamie Kennedy",
         "Thomas Haden Church",
         "James Gunn",
         "Paget Brewster",
         "Sean Gunn",
         "Judy Greer",
         "Jim Zulevic",
         "Lauren Cohn",
         "Jenna Fischer"
      ],
      "imdbMovieId": "0181836",
      "originalTitle": "The Specials",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "America's 7th Best Superhero Team, the Specials, are a group of geeks and oddballs. We get to see one day in their lives as fan and new member Nightbird joins the group, just in time for the group to get a new line of action figures. But the members' extreme personalities and personal issues threaten to rip the group apart.",
      "tmdbMovieId": 29015,
      "avgRating": 3.23239,
      "releaseYear": "2000",
      "numRatings": 142,
      "posterPath": "/yW4T1Acjo5y9zai2Rq3slZKTEki.jpg"
   }
}