{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0170452",
      "video": false,
      "title": "Prince of Central Park",
      "recommendations": [
         444839,
         99754,
         279756,
         36790,
         369450,
         19667,
         110109,
         146538,
         39062,
         20310,
         73079,
         63516
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4cb0c3a368484e1c2999",
               "name": "Kathleen Turner",
               "profile_path": "/jM1gpAt7vsn81NsvWqJGVLhD8As.jpg",
               "id": 3391,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4cb0c3a368484e1c299d",
               "name": "Danny Aiello",
               "profile_path": "/UvPalkz4ynJJrTcrbpfD05gVoO.jpg",
               "id": 1004,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4cb0c3a368484e1c29a1",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4cb0c3a368484e1c29a5",
               "name": "Frank Nasso",
               "profile_path": null,
               "id": 94138,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4cb0c3a368484e1c29a9",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4cb0c3a368484e1c29ad",
               "name": "Lauren Vélez",
               "profile_path": "/xZiNlLg9E2zgRSewE1BeWUlaqYO.jpg",
               "id": 141610,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4cb0c3a368484e1c29b1",
               "name": "Jerry Orbach",
               "profile_path": "/95n3bLxEv1kRCwyfpA30J1IEc7N.jpg",
               "id": 725,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4cb0c3a368484e1c29b5",
               "name": "Mtume Gant",
               "profile_path": null,
               "id": 1183822,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cb0c3a368484e1c2995",
               "name": "John Leekley",
               "profile_path": null,
               "id": 188269,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53407b580e0a2679aa00091b",
               "name": "Steven Seagal",
               "profile_path": "/f8OFR4h3ngyFesiudCygrNFdsCE.jpg",
               "id": 23880,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53407b6b0e0a2679ad0008cf",
               "name": "Julius R. Nasso",
               "profile_path": null,
               "id": 58206,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53407b8c0e0a2679a7000905",
               "name": "John Leekley",
               "profile_path": null,
               "id": 188269,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53407b980e0a2679bf0008df",
               "name": "Evan Rhodes",
               "profile_path": null,
               "id": 959316,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [],
      "popularity": 1.996289,
      "production_countries": [],
      "id": 201724,
      "vote_count": 8,
      "budget": 0,
      "overview": "A young boy sets out to find his mother. After setting up camp in Central Park, he encounters a group of people even needier than himself.",
      "similar": [],
      "original_title": "Prince of Central Park",
      "runtime": 109,
      "poster_path": "/rsCsTY3WljrUwUmsDUXYyWITRWU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-09-22",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Leekley"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "John Leekley",
         "Evan Rhodes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0170452/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2MTA2MTc0OV5BMl5BanBnXkFtZTcwMjg1MjgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kathleen Turner, Danny Aiello, Cathy Moriarty | See full cast and crew »"],
      "reviews": [
         "A young boy flees the clutches of his foster-mother and decides to take up residence in Central Park. There he meets a few people that will help him to shape his future: a bully, The Guardian (a witty Harvey Keitel) and a couple with needs of there own (Aielo and Turner). This movie has some surreal undertones and can count on a very strong cast to make the story not too sentimental. A real treat for children of all ages.",
         "I watched this movie recently and found it to be pretty good. I was surprised at the low ranking it was given here. That was before i realized that it was a remake of another very popular film. I may or may not have seen the original, i can't recall, however I feel it's unfair to slam this one because it doesn't quite stand up against the original movie. There were a few scenes that were very well done and genuinely touched me. I loved the scene on the ferry when the boy was imagining his mom writing a letter about her love for her son. I really felt the character's sense of loss in that scene. This technique is repeated when the JJ goes and rides on the carosuel that he had shared with his mom. Having said that, the movie is a bit uneven. The cast was terrific except for the kid playing JJ. There were times when he wasn't effective but hey he's only a child and not all children can give emotional performances in movies. Something else that bugged me is the way JJ stays clean and well groomed while living with a dog in a cave. Not very realistic. I also didn't feel Kathleen Turner gave a terrific performance, perhaps a bit of miscasting there. Overall I was entertained for a couple of hours and yeah it could have been better but there were some very powerful scenes that made it worthwhile.",
         "The only reason I even stumbled across this film is because one of its young stars, Carmen Moreno who plays Sofia, was one of my students this past year. I know the film had a theatrical showing in New York, but it does not appear that it was ever picked up for national theatrical distribution. After finally seeing the film, this is not surprising; it's a film that cannot quite make up its mind what it wants to be JJ (Frankie Nasso) lives with an abusive foster mother Mrs. Ardis (Cathy Moriarty) in present day Staten Island, NY. He dreams of finding the mother who left him, and one day he leaves Staten Island for Manhattan with hopes of finding her. In a parallel story we meet Rebecca (Kathleen Turner) and Noah (Danny Aiello) as a well-to-do Manhattan couple whose marriage is inexplicably crumbling. In JJ's journey to find his mother he also encounters The Guardian (Harvey Keitel) an eccentric New York \"character\" who lives under a bridge in Central Park. Along the way we also discover that JJ is a musical prodigy who can play any melody he hears, well, not only play it, but turn it into a full blown musical piece. Once JJ and Rebecca meet (she has a grand piano that nobody has played for a long time) the film heads toward its inevitable conclusion. The producers claim that \"Prince of Central Park\" is a modern day retelling of Huck Finn. Okay . . . There are also borrowed plot elements from such diverse sources as \"Oliver Twist\" and \"Who's Afraid of Virginia Woolf?\". The problem is these exemplary literary sources don't really mix very well. Consequently, the film has a patchwork feel, the sum of the parts don't really equal an engaging whole. Still, there are pleasures to be had here. Frankie Nasso gives an engaging performance as JJ. There is an inherent sweetness to his performance which goes a long way toward helping the audience get by some of the gaping holes in the plot. We come to care about this character despite some of the situations that the filmmakers throw him into. Screen stalwarts Turner, Aiello, and Moriarty give fine performances even if the script does not always support their best efforts. Harvey Keitel (admittedly not one of my favorite actors) has a harder time with a character that strains credulity to its limits. Also of note are the performances of Carmen Moreno as Sofia and Tina Holmes as JJ's mother. Both are quite affecting. The film has a nice score as well.",
         "This is worth watching just to see Keitel in his outrageous mode. His part is small but as usual, one can't take their eyes off of him. Spoiler? At the end of the movie, he offers real hope for the future of one gang banger, whether the banger wishes it or not--always an interesting characterization from this man. I'll watch anything with Keitel in it so perhaps I'm not objective enough for this movie. I thought Turner was convincing as the grieving, self-tortured, mother. With Moriarty in it as well it was the battle of the sultry voices and both cast a bit off type which added interest to the plot. I'm glad they made the movie. And it has Central Park--so who wouldn't enjoy it for the scenery alone? The fairy tale of a boy on his own in the park, escaping from a less than caring foster care giver will not be believable in this day of dangerous nut balls, but suspend belief a little and join the fantasy of a preteen coming of age.",
         "A truly wonderfully directed film. Young Mr.Nasso is certainly some one to watch and the great pros -Ms. Turner and Mr. Aiello- never let you down. Lauren Velez (OZ) and Jerry Orbach (Law & Order) are perfection in their smaller roles. This story of a young man's journey (physically and emotionally) through horrible circumstances to loving possibilities, is inspiring and real. The whole family can watch together: laughing,crying and ultimately cheering. Enjoy!!!",
         "The auteur of \"Prince\" manages to take an excellent cast, a decent story, a mediocre script and carefully assemble them into one boring, monotonous, amateurish mess. In spite of a strong central performance by Frank Nasso, the Prince, this disjointed film wanders aimlessly from scene to scene, painfully disintegrating into hash. The result brings a sigh of relief at the end where the tears of joy should be. A sad waste of time and talent and a good example of how NOT to direct a film.",
         "Prince of Central Park (2000) is so utterly bad. It was a pure waste of my time and I can't believe I actually watched the whole thing. Please do not watch this movie, if it's the last thing you do!",
         "well to me this is the best movie I have seen in a long time!I've always wanted to see Kathleen Turner and Cathy Moriarty star together in a film!And they did great!I rate this a *10* I have always just enjoyed these kind of films!Don't ask why but I have!Well the thing is,is that it's a great movie and ya need to get up and go watch it!If ya want to write me be my guest!Enjoy!",
         "This movie is what life is all about. Most of all in New York. Also a lot of your foster homes. I'm sure a lot of people are in it for the money and that is all. But this movie a lot more people should watch.If nothing else, to see what a lot of young people go through living on the streets. It is so sad. I cryed and cryed through the movie I'm glad I watched it and have recommended my friends to watch it.",
         "Remakes are bad news. There have been many examples of this in the past decade. From movies like Bedazzled and Sabrina to TV-to-movie repurposings like Beverly Hillbillies and McHale's Navy, the field is littered with failures. One can only hope no director will ever have enough gall to remake Casablanca or Citizen Kane. I saw this movie only because an online TV listing misidentified this as the 1977 movie that I enjoyed so many years ago. That movie had a youthful joy and sense of innocence that was refreshing in the crime-ridden NYC of the '70s. Alas, apart from the boy's name and the fact that he ran off to Central Park, nothing else was even remotely similar. This JJ is not likeable at all. He's irresponsible and selfish and backed by a host of characters that I care little about, least of all the absurd Guardian, something of a second-rate Fisher King. It would have been nice to celebrate Central Park's sesquicentennial this year with a DVD of the first movie. For now, I'll have to continue searching and waiting for it to air."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Seagal/Nasso Productions"],
      "summaries": [
         "JJ's life has been miserable ever since his ill mother had to give him up. The only two good things he has are his best friend Sophia and his wonderful talent for music. Determined to know what happened to his mom, the young man escapes from his foster mother, a woman who encourages her charges to steal and bully. Following his memories, he takes shelter in Central Park. JJ becomes the new protégé of the Guardian, a homeless eccentric and self-appointed King of Central Park who promises to protect the boy and offers him the companionship of a dog called Mutt in exchange for food. Also, JJ's path crosses with Rebecca Cairn, another eccentric who lives in a brownstone overlooking the park. She takes particular interest in him, as does her estranged husband Noah Cairn who is always rescuing Rebecca when she grows depressed. JJ tries to shake off the help of these characters, thinking that his life would be better on his own. However, JJ's foster mother is looking for him, making his search for his mother dangerous. His growing relationship with the Carin's teaches him the truths about loss and letting go.",
         "A young boy sets out to find his mother. After setting up camp in Central Park, he encounters a group of people even needier than himself."
      ],
      "budget": 7000000
   },
   "movielensId": 3907,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-09-22",
      "dvdReleaseDate": "2000-11-07",
      "directors": ["John Leekley"],
      "runtime": 109,
      "movieId": 3907,
      "title": "Prince of Central Park",
      "mpaa": "",
      "actors": [
         "Kathleen Turner",
         "Danny Aiello",
         "Cathy Moriarty",
         "Frank Nasso",
         "Harvey Keitel",
         "Lauren Vélez",
         "Jerry Orbach",
         "Mtume Gant"
      ],
      "imdbMovieId": "0170452",
      "originalTitle": "Prince of Central Park",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A young boy sets out to find his mother. After setting up camp in Central Park, he encounters a group of people even needier than himself.",
      "tmdbMovieId": 201724,
      "avgRating": 3,
      "releaseYear": "2000",
      "numRatings": 25,
      "posterPath": "/rsCsTY3WljrUwUmsDUXYyWITRWU.jpg"
   }
}