{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0206420",
      "video": false,
      "title": "Woman on Top",
      "recommendations": [
         28320,
         18435,
         74026,
         114726,
         43267,
         63437,
         35886,
         33347,
         20682,
         54156,
         38132,
         67758,
         15503,
         15418,
         146955,
         250622,
         51333,
         37718,
         31633,
         36859
      ],
      "backdrop_path": "/zWdKyGn5K6HRVhHfOOUHLLrV61z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Isabella Oliveira",
               "gender": 1,
               "credit_id": "52fe460a9251416c7506b011",
               "name": "Penélope Cruz",
               "profile_path": "/dcPSUfxMa791NZvrFiBc3ReDdpU.jpg",
               "id": 955,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Toninho Oliveira",
               "gender": 0,
               "credit_id": "52fe460a9251416c7506b015",
               "name": "Murilo Benício",
               "profile_path": "/i6QWjYs4JUjPJPnzNq0tn78x6Ou.jpg",
               "id": 55824,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cliff Lloyd",
               "gender": 2,
               "credit_id": "52fe460a9251416c7506b01d",
               "name": "Mark Feuerstein",
               "profile_path": "/zYtVRDBZErmwVIffCuk5ig8CSTN.jpg",
               "id": 11365,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Alex Reeves",
               "gender": 0,
               "credit_id": "52fe460a9251416c7506b021",
               "name": "John de Lancie",
               "profile_path": "/bb3j02gYvgs5ApK2l2qKCweYW5z.jpg",
               "id": 11077,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "TV Director",
               "gender": 1,
               "credit_id": "52fe460a9251416c7506b025",
               "name": "Anne Ramsay",
               "profile_path": "/wC3Z0IZ8SkP1RZPdyTMZdB4G3qM.jpg",
               "id": 25023,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Claudia Hunter",
               "gender": 1,
               "credit_id": "52fe460a9251416c7506b029",
               "name": "Ana Gasteyer",
               "profile_path": "/quC9iC1ym9aBZ03Ke1KZQc8sveU.jpg",
               "id": 86267,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Monica Jones",
               "gender": 2,
               "credit_id": "52fe460a9251416c7506b019",
               "name": "Harold Perrineau",
               "profile_path": "/dvvViqumTolGoCut6YiGow666z2.jpg",
               "id": 6195,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe460a9251416c7506b02f",
               "name": "Fina Torres",
               "profile_path": "/5KKwRbEFjZInSKsoNfh1iTZWEIk.jpg",
               "id": 144277,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe460a9251416c7506b035",
               "name": "Vera Blasi",
               "profile_path": null,
               "id": 943014,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "56e5de4dc3a36807b2001122",
               "name": "Ashley Cusato",
               "profile_path": "/j4ZDE3xjmjaN46mddyhkC6oN61d.jpg",
               "id": 158155,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "56e5de70925141518e0009b8",
               "name": "Luis Bacalov",
               "profile_path": "/d9hYl7eX4KxIz4wZ9psdKjxmaSF.jpg",
               "id": 66675,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "56e5de819251416d46007953",
               "name": "Thierry Arbogast",
               "profile_path": null,
               "id": 997,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56e5de979251416525003890",
               "name": "Philippe Chiffre",
               "profile_path": null,
               "id": 1030407,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a7068a6c3a36847dd0118f2",
               "name": "Caique Martins Ferreira",
               "profile_path": null,
               "id": 1969490,
               "department": "Production",
               "job": "Line Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.602883,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14629,
      "vote_count": 62,
      "budget": 8000000,
      "overview": "Set to the intoxicating rhythms of Brazil, \"Woman on Top\" is a spicy, sexy comedy about the magic of food, love and music. Meet Isabella, a sultry enchantress born with the special gift of melting the palates and hearts of men everywhere. When she decides to break free from her rocky marriage and the stifling kitchen of her husband's restaurant in Brazil, she spirits off to San Francisco in pursuit of her dreams of a real culinary career.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         10735,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "Woman on Top",
      "runtime": 92,
      "poster_path": "/zzqnMAjkcC9O9gemN2Akz7L0zra.jpg",
      "spoken_languages": [
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
         "name": "Fox Searchlight Pictures",
         "id": 43,
         "origin_country": "US"
      }],
      "release_date": "2000-09-22",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Want to know how she got there?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fina Torres"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Vera Blasi"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0206420/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MTI0MzkyOV5BMl5BanBnXkFtZTYwOTQwMzg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Penélope Cruz, Murilo Benício, Harold Perrineau | See full cast and crew »"],
      "reviews": [
         "This is a fun film and has several things going for it. Firstly it is sexy without being vulgar, proving that comedy without vulgarity is feasible. Secondly it is easy on the eye (Penelope) and the ears (Latin Rhythms). Thirdly, it is a fairy tale, both in content and format and hence totally unbelievable. And like all fairy tales, this one too has a moral...which is for the viewers to discover. The best thing about the movie it its old world charms, which is so endearing. Though eminently forgettable once you are out of the cinema hall, while inside, it is worth every minute of yours. Recommended to take along someone you love.",
         "Isabella (Penelope Cruz) meets her soul mate in her native Brazil, marries him, and becomes the renowned chef at his restaurant. She suffers from motion sickness so she insists on driving the car, leading in a dance partnership and more. Husband Toninho (the handsome Murilo Benicio) tires of being second in command and develops the roving eye syndrome. Stunned by her husband's actions, Isabella flees Brazil and travels to San Francisco. Once there, she catches the eye of a television producer who helps her become a small-screen celebrity with her own cooking show. Out of the blue, ex-husband Toninho arrives and wants his wife back. What will she do? Penelope Cruz shines in the leading role; she's drop dead gorgeous and gives an irresistible performance. Benicio, also, initiates flutters in the hearts of any female viewers with his charming persona. The movie has many humorous plot elements (a cross-dresser, catty television employees) that keep the plot interesting. Those seeking an entertaining movie with charm and chuckles will be delighted to happen upon this lesser known movie.",
         "I saw \"Woman on top\" yesterday and I found it very nice. It's a very funny story set first in Bahia (Brazil) and then in San Francisco, when Isabella (Penelope Cruz) became a TV star in a TV program about food. Penelope Cruz is very good in the role but it would be better if the role of Isabella was given to a brazilian actress (like for example Giovanna Antonelli, who would be perfect for the role), because a Spanish actress, even if she is good, who plays a sensual brazilian cook do not sound such well. Murilo Benicio (Toninho), one of the best brazilian young actors, is very good, very funny and so handsome and sexy! The story is very colorful and the music is beautiful, with many brazilian bossa nova hits like \"Aquarela do Brasil\" and \"Vocè\". The idea of Isabella having a best friend who is a drag queen is very good and also the idea of the TV program about the passion in brazilian cooking is excellent (and it remembers the role of the sensual cook Dona Flora played by Sonia Braga in \"Dona Flor and her two husbands\" by Bruno Barreto). If you want to feel the passion, the color, the music of Brazil, you have to watch this movie, even if, I repeat again, a brazilian actress would be better for the main role. I give it a 7.",
         "This started off very well....really well...and slowly got stupid, very stupid. The film is a fantastic vehicle, however, for Penelope Cruz to show us her beauty. The two men chasing her are all right, neither one particularly annoying. The annoying part isn't the actors, it's the script. In this story, you can pray - and get a positive response - to the \"sea goddess\" - while other ridiculous curses and superstitions abound. Also, a lead character in here - portrayed as perfectly normal - is a transvestite. Despite these strange doings, the film has charm and beautiful, bold colors to it. If only the story wasn't so stupid.",
         "''Woman on Top'' is not a big movie. In fact, it's a little silly and easy to be guessed, although it has some nice elements to be showed. I am a Brazilian girl,so for me, it's nice to see a movie who tells a little bit about my country's story or traditions. But if you are a foreigner, please, do not think that all the cities of Brazil are like Bahia or have the same habits. Not everybody here practices Camdoblé as well. The best character of this movie got to be Harold Perrineau in the role of Monica: the guy had a complete transformation to be like a transvestite! And he has a great performance, I do need to say! Well, only brazillians who are going to watch this movie are going to see some famous faces around here, like Lazaro Ramos or Daniele Suzuki.",
         "I think you have to understand myth's and ideas in other parts of the world to be able to understand the movie. Personally, I loved it. It gives you that trip to Brazil without leaving your house. The music was great, the story was a bit cheesy but refreshing. Open your eyes to other cultures. Allow yourself to enjoy the simple things such as cooking. I think it was sensual, funny and refreshing. I think Penelope Cruz did a great job. Having seen most of her movies, I can say that her best movies are the ones that are not overly popular. Woman on top gives women the opportunity to be successful and show men that we can do it.",
         "WOMAN ON TOP is one of those films that was made, publicized and viewed as pastiche and because of its honesty as a simple romantic comedy, it rates higher than many of the over the top and overproduced competitors. The film is colorful, filled with wonderful Bossa Nova music, and has enough eye candy to almost make you forget the main dishes! Isabella Oliveira (Penélope Cruz) lives in Bahia, Brazil totally in love with Toninho Oliveira (Murilo Benício) where the two have a restaurant featuring Isabella's passionate cooking and Toninho's macho front man role. Isabella has a problem: motion sickness - she cannot fly, ride in a car, or assume the bottom position during sex or she becomes violently ill (it seems that the sea goddess compensated her problem by making her an inimitable chef). All is well until Toninho has a brief affair that drives the crushed Isabella to move to San Francisco alone despite her love for Toninho. There she moves in with her old friend Monica from Bahia (Harold Perrineau as a superbly enacted crossed dressed drag queen) and begins her unsuccessful search for a job. In order to overcome her longing for Toninho and regain her culinary skills she makes a pact with the sea goddess, forsaking ever loving Toninho again. Eventually Isabella lands a TV show on Passionate Cooking when desperate producer Cliff (Mark Feuerstein) gets a whiff of her talent. She is an immediate success. Meanwhile Toninho, unable to endure life in Bahia without Isabella, flies to San Francisco and begins a series of Bossa Nova serenades to win her back. Cliff places Toninho on Isabella's show as background music and the ratings soar. But it is the ultimately the conflict resolution between Isabella and Toninho that brings the story to its expected end. The story may be light and the script may be pedestrian, but the direction and camera work suffuse this film with Latin American magical realism and that keeps it lighthearted and fun. Cruz is terrific, Perrineau is the true star of the show displaying a sophisticated and sensitive acting skill that is very special, and Murilo Benício is not only a hunk and eye candy but also a fine singer and a warm actor who deserves a lot of attention. Story five, stars six. Have fun with this one! Grady Harp, March 06",
         "This is a modern day romantic fairy-tale, minus the charm. The storyline is silly, the treatment of the subject -- if there is one - is disappointingly silly, even for what's supposed to be a lighthearted romantic comedy. I don't know who the target audience of this film is; surely today's moviegoing young women know that a woman deserves better than to be stashed away in the kitchen; and surely they know that \"educating\" a boyfriend or husband is a difficult task (if at all achievable), requiring more than running away to fashionable S.F. and applying some hocus-pocus. Perhaps the film is aimed at men, who get an extended chance to drool at Penelope Cruz, who indeed looks lovely and \"fetching\". As for myself, I'd rather watch this lovely actress in better films, such as All About My Mother.",
         "Low rent pseudo passion and magic, without a trace of real emotion. Visuals are below par, except for the gorgeous Ms. Cruz. Too bad she lent herself to such self-conscious arty shallowness. Otherwise I really liked it.",
         "I loved this film! It's very picturesque, and imaginative and tells the story of love very well. The script is solid and has Penelope Cruz (pre-Hollywood rubbish and Tom Cruise days) starring as Isabelle, a beautiful young cook who moves to San Francisco when her husband cheats on her. She becomes a very popular and highly rated TV show host which helps her husband to track her down and try to win her back. This is a very romantic film! It just tugs at your heart, makes you laugh, makes you cry and makes you want this sort of romanticism in your life! Oh and by the way, What is San Francisco without a drag queen? and this film serves up one as one of the main characters in the most deliriously hilarious way! A+ A must see!"
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": ["Fox Searchlight Pictures"],
      "summaries": [
         "Isabella is a great cook, making her husband's restaurant in Bahia, Brazil, a success. To control her motion sickness, she must do the driving and be on top during sex, which drives her macho husband, Toninho, to infidelities. Heart-broken, she leaves for San Francisco, moving in with her childhood friend, Monica, a cross-dresser. To mend her heart, she makes an offering to Yemanja, the goddess of the sea. The goddess responds: Isabella no longer loves and the fish in Bahia no longer bite. Stricken, Toninho heads north to get her back; he finds her hosting a popular TV show, Passion Food, courted by its producer. Can he learn humility? Can she find happiness without him?",
         "Brazilian chef Isabella Oliveira moves to San Francisco when her husband, frustrated by her motion sickness, cheats on her."
      ],
      "budget": 8000000
   },
   "movielensId": 3909,
   "movielens": {
      "languages": [
         "Português",
         "English"
      ],
      "releaseDate": "2000-09-22",
      "dvdReleaseDate": "2001-02-13",
      "directors": ["Fina Torres"],
      "runtime": 92,
      "movieId": 3909,
      "title": "Woman on Top",
      "mpaa": "R",
      "actors": [
         "Penélope Cruz",
         "Murilo Benício",
         "Mark Feuerstein",
         "John de Lancie",
         "Anne Ramsay",
         "Ana Gasteyer",
         "Harold Perrineau"
      ],
      "imdbMovieId": "0206420",
      "originalTitle": "Woman on Top",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["UdMiq4UYpew"],
      "plotSummary": "Set to the intoxicating rhythms of Brazil, \"Woman on Top\" is a spicy, sexy comedy about the magic of food, love and music. Meet Isabella, a sultry enchantress born with the special gift of melting the palates and hearts of men everywhere. When she decides to break free from her rocky marriage and the stifling kitchen of her husband's restaurant in Brazil, she spirits off to San Francisco in pursuit of her dreams of a real culinary career.",
      "tmdbMovieId": 14629,
      "avgRating": 2.7983,
      "releaseYear": "2000",
      "numRatings": 704,
      "posterPath": "/zzqnMAjkcC9O9gemN2Akz7L0zra.jpg"
   }
}