{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "fear",
            "id": 13073
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "gospel singer",
            "id": 208282
         }
      ],
      "imdb_id": "tt0110186",
      "video": false,
      "title": "Jason's Lyric",
      "recommendations": [
         39310,
         28353,
         59930,
         20322,
         16097,
         45147,
         41478,
         39349,
         29461,
         92381,
         47816,
         28121,
         16096,
         21915,
         16158,
         12251,
         25462,
         24664,
         19848,
         8291
      ],
      "backdrop_path": "/qe0Fr4ZZHIX7nG88TZmt3T1Y99J.jpg",
      "revenue": 20851521,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jason Alexander",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e0151a5",
               "name": "Allen Payne",
               "profile_path": "/xJtew7b2oZRZjIzocnBZgkVlWWt.jpg",
               "id": 32486,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lyric",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e0151a9",
               "name": "Jada Pinkett Smith",
               "profile_path": "/Pb8KeGa4kTgJqS2ASoYvbNHbLr.jpg",
               "id": 9575,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joshua Alexander",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e0151ad",
               "name": "Bokeem Woodbine",
               "profile_path": "/OewCN9cV4xwvMwPwBw05kqKy2v.jpg",
               "id": 71913,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rat",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e0151bd",
               "name": "Eddie Griffin",
               "profile_path": "/jgz5HDtC3aXYXBSULqay1PKWQOL.jpg",
               "id": 62842,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e0151c9",
               "name": "Suzzanne Douglas",
               "profile_path": "/ldfCErLjjST3HBZSK8G4KBMDZhR.jpg",
               "id": 80622,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Marti",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e0151cd",
               "name": "Lisa Nicole Carson",
               "profile_path": "/tBSQsDwvA7G4hLzsHwE2wCi2Yzy.jpg",
               "id": 55274,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Ron",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e0151d1",
               "name": "Lahmard J. Tate",
               "profile_path": "/4WcFReePSxyGQJWV5wXGNfY0Y7o.jpg",
               "id": 98298,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Maddog",
               "gender": 2,
               "credit_id": "52fe4432c3a368484e0151d5",
               "name": "Forest Whitaker",
               "profile_path": "/4pMQkelS5lK661m9Kz3oIxLYiyS.jpg",
               "id": 2178,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sandy",
               "gender": 1,
               "credit_id": "52fe4432c3a368484e0151d9",
               "name": "Sandra 'Pepa' Denton",
               "profile_path": "/xpQee45R8e9mW1ZflPWFFNuc6q6.jpg",
               "id": 138037,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4432c3a368484e0151b3",
               "name": "Doug McHenry",
               "profile_path": null,
               "id": 67896,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4432c3a368484e0151b9",
               "name": "Bobby Smith Jr.",
               "profile_path": null,
               "id": 88286,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.889814,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22067,
      "vote_count": 14,
      "budget": 7000000,
      "overview": "The story of a young man who must confront his own fears about love as well as his relationships with family and friends.",
      "similar": [
         1903,
         13,
         38,
         8390,
         587,
         319,
         112160,
         122906,
         261470,
         1643,
         10691,
         342878,
         35,
         24420,
         2539,
         20943,
         19913,
         27022,
         40807,
         8967
      ],
      "original_title": "Jason's Lyric",
      "runtime": 119,
      "poster_path": "/3dYMkjzABC2KRvyHvBjhEg4gaBj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1994-09-28",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Love is courage.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Doug McHenry"],
      "runtime": 119,
      "synopsis": null,
      "writers": ["Bobby Smith Jr."],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110186/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzMjQ1MjIwM15BMl5BanBnXkFtZTcwODIzOTkyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Allen Payne, Jada Pinkett Smith, Bokeem Woodbine | See full cast and crew »"],
      "reviews": [
         "Boy meets girl. There are a mountain of movies that attempt to tell a love story and disappoint and fall flat. JASON'S LYRIC is... unforgettable -- a love movie to enjoy many times. The greatest strength to this love story is the same as the key strength in the world-wide hit LONG VACATION tv series exported from Japan: as the story unfolds the viewer deeply and personally cares about the boy and the girl. The characters become real and we feel as they feel. Intense. Unforgettable. Highly recommended, but keep in mind that there is grit, drugs and depictions of violence in this movie.",
         "It isn't often that you get to see a compelling film that deals with human sacrifices, love and the courage to find a true identity to lead a good moral life. . . Jason's Lyric was one film that became that testament of many issues combined. For me it's not just a film but more in terms of reaching out to those unfortunate souls living a somber life and helping to reflect on those wishing to make a change for the best. Allan Payne, Jada Pinkett and Bokeem Woodbine all give electrifying performances. One of the strongest issues the film dealt with was Payne's relationship as a brother to troubled Woodbine. The disturbing part for me though was Forest Whittaker's performance as the father who go's berserk after the Vietnam War, losing all sense of morality for himself and his family. A brilliant film, I can't recommend this film enough. 8/10",
         "One endeavor in filmmaking that quite frequently doesn't turn out well is mixing genres. \"Jason's Lyric\" combines crime drama, love story, and ghetto film-and does it surprisingly beautifully. The acting is remarkable, the script is remarkable, and the emotion is remarkable. This movie could have turned out very pretentious and very cheesy. Apparently, the directors, writers, and producers completely acknowledged this, and refused to let that happen. The characters are very well developed and, while the movie doesn't justify Josh's actions, it does convey compassion for him. It also provides new insight on what it's really like to live in a ghetto. If you can find this movie (after all, I saw it on Showtime and haven't the video in any stores) totally see it!!!!",
         "All of the characters had a back history. I could see the cause and effect (why the characters were the way they were) in the film. The actors were believable. Each time I watch it (at least twice a week), I see something new. \"Jason's Lyric\" has inspired me to get on the bus and stop watching it go past. The symbolism in the movie was refreshing. The cinematography was excellent as well, every part of the film enhanced the whole. \"Jason\" gave me hope that a man can commit in a relationship; he just has to want to do it. He made me dream again of lovely words and warm embraces. \"Lyric\" assured me that closing up was not the answer but trying to love again is the way to get the magic back....",
         "Jason's Lyric is a truly great love story with a superb cast. The performances by Bokeem Woodbine as Josh, and Forest Whitaker as MadDog are strong and convincing. Complemented by a superb soundtrack, this movie should not be missed. Jason's Lyric should have received more theatrical exposure letting the main actors and supporting cast shine.",
         "If Hollywood was more equitable in its hiring practices, Jada Pinkett would be in the league with Halle Berry, Sandra Bullock, and others of her generation. Pinkett, who gave a bravura performance (along with Queen Latifah) in the earlier \"Set It Off,\" is no less than brilliant as \"Lyric,\" sought after by the hard-working \"Jason,\" played by another neglected thespian, Alan Payne. Both Pinkett and Payne deliver as the lovers torn between the attraction to each other and the responsibilities of family and work that interferes with their relationship. Forest Whitaker is marvelous as Payne's father, a man that must deal with his own personal demons, along with an estranged relationship with his wife, wondrously played by Suzanne Douglas. The rest of the cast (Bokeem Woodbine, Lisa Nicole Carson, Eddie Griffin, among others) are exceptional in a story that is both tragic and uplifting. And the \"love scene\" between \"Jason\" and \"Lyric\" is enough to make the most open-minded of viewers blush.",
         "I was very surprised at how good this movie was. My rottweiler, Lyric, who is now 13 years old was in this movie when she was 7 weeks old. I named her Lyric after the role of Jada Pinkett. Lyric went on to be an American/Canadian Champion. Her show name is Am/Ca CH. Von Traeger's Lyric. The movie took place in the 3rd Ward in Houston, Texas. It was awesome being on the set during the filming of this movie. I am looking at showing Lyric at the \"Reliant Center World Dog Show\" in Houston this next Month. She will be shown in Veterens Class 12 years and older. This is a rottweiler specialty show. Thank you for letting me share. Kerri",
         "Jason's Lyric is clearly one of the best urban love stories ever put on film. The direction by Doug McHerny showed real talent as did his screenpaly. Allen Payne and Jada Pinkett both showed early lead acting roles in this good film. Finally I think Forrest Whitaker and Bokeem Woodbine both deserved Oscar nods for their work. I give it **** out of ****.",
         "SPOILER... I am sure I have seen this movie before, but never really \"saw\" it until I found it in WalMart's movie bin. I have always wanted to just watch old shows and movies when I retired, and now, I can see movies completely. It is an old movie, but by far the best movie I have ever cried over. Jada does not wait until she is older and more experienced to rock. The story contains lives of Afro-Americans who work for a living, hang on the streets, do time in prison, love, mistake love, crime and reality. When Jada meets the love of her life, (a hunk), they decide to move away, riding the greyhound bus. The very ending will make the strongest person in the world cry. Their love had problems as her boyfriend is the man of his house, helping mother to raise a troubled brother. The younger brother spends lots of time locked up, while Jason is troubled with nightmares. We find that one of the children shoots and kills their father when he once again abuses their mother. I am leaving out a lot because it is so wonderful to just watch this movie and wonder. You will not be sorry. Thanks to the makers, I found this film on a DVD that also included three other movies, all starring Afro-American Women. GET THIS MOVIE! Seeing it once will not satisfy you, and each time you will cry. The music to the movie is fantastic and the ending song will bring back the flood of tears.",
         "This film is captivating!!! It brilliantly tells a story of Love and Sacrifice. This cast was the perfect group for this production. Payne, Pinkett, Woodbine, Wittaker... Everyone has already stated how well their performances was; but, one that mustn't be forgotten is Lisa Carson (Marti - Alonzo's girlfriend/Pinkett's co-worker)... Her character left an impact on me because of how she faced her reality by quoting others. She played her facade but her hurt began to shed light during her last conversation with Lyric... I don't want to give away too much but I will say that if you're looking for a nice movie that will tap into your senses, make you laugh and cry, and one that is very relate-able... Give Jason's Lyric a try!"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Jackson/McHenry Company,The",
         "PolyGram Filmed Entertainment",
         "Propaganda Films"
      ],
      "summaries": ["The story of a young man who must confront his own fears about love as well as his relationships with family and friends. Allen Payne (I) plays Jason, a sales clerk at a T.V. store. He falls in love with Lyric (Jada Pinkett Smith) and finds happiness, but his family history and crazy father Maddog (played by Forest Whitaker) come back to haunt him before he can leave it all for a better life."],
      "budget": 7000000
   },
   "movielensId": 391,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-28",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Doug McHenry"],
      "runtime": 119,
      "movieId": 391,
      "title": "Jason's Lyric",
      "mpaa": "R",
      "actors": [
         "Allen Payne",
         "Jada Pinkett Smith",
         "Bokeem Woodbine",
         "Eddie Griffin",
         "Suzzanne Douglas",
         "Lisa Nicole Carson",
         "Lahmard J. Tate",
         "Forest Whitaker",
         "Sandra 'Pepa' Denton"
      ],
      "imdbMovieId": "0110186",
      "originalTitle": "Jason's Lyric",
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["xzeTvIWxhek"],
      "plotSummary": "The story of a young man who must confront his own fears about love as well as his relationships with family and friends.",
      "tmdbMovieId": 22067,
      "avgRating": 3.16136,
      "releaseYear": "1994",
      "numRatings": 440,
      "posterPath": "/3dYMkjzABC2KRvyHvBjhEg4gaBj.jpg"
   }
}