{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0211219",
      "video": false,
      "title": "Barenaked in America",
      "recommendations": [],
      "backdrop_path": "/q9bMzKI92sgCCSckkE9cI9nMhHG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 0,
               "credit_id": "52fe467a9251416c7507989f",
               "name": "Steven Page",
               "profile_path": null,
               "id": 1177696,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe467a9251416c750798a7",
               "name": "Tyler Stewart",
               "profile_path": null,
               "id": 1177701,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe467a9251416c750798ab",
               "name": "Jim Creeggan",
               "profile_path": null,
               "id": 1177707,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe467a9251416c750798af",
               "name": "Kevin Hearn",
               "profile_path": null,
               "id": 1177708,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe467a9251416c750798b3",
               "name": "Chris Brown",
               "profile_path": null,
               "id": 1177709,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "54e15c23c3a368454d006905",
               "name": "Ed Robertson",
               "profile_path": "/jKToMHsLu4pT6mgBD6zgdhwXLSx.jpg",
               "id": 230342,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe467a9251416c750798b9",
            "name": "Jason Priestley",
            "profile_path": "/skXfFcbZWPOBomGBSTMfiyzgi6q.jpg",
            "id": 19143,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.247205,
      "production_countries": [],
      "id": 15752,
      "vote_count": 1,
      "budget": 0,
      "overview": "A rockumentary about the Canadian rock band Barenaked Ladies's life, in a nutshell.  It follows the band on its Stunt Tour.",
      "similar": [],
      "original_title": "Barenaked in America",
      "runtime": null,
      "poster_path": "/2JIeGp6VnqnU1IdJYRtKKLZ1acy.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-01-01",
      "vote_average": 1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jason Priestley"],
      "runtime": 89,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0211219/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5OTY5MjIzN15BMl5BanBnXkFtZTYwMTYwMzg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steven Page, Ed Robertson, Jim Creeggan | See full cast and crew »"],
      "reviews": [
         "Barenaked Ladies (BNL) have more than paid there dues as one of Canada's most popular bands. They finally broke through into the American listening audience with their infectious rat-ta-tat hit \"One Week.\" But to like the band for this song alone is doing them an injustice. \"Barenaked in America\" tells why. Directed by Jason Priestly, \"Barenaked in America\" is a delightful 100-minute look at some highlights from BNL's tour of America. Risding on the heels of success generated by the 1998 \"Stunt\" album, BNL finally reached the American audience and Priestly was there to capture it on film. The band has the unusual ability to combine deft lyrics with layers of deph and insight, along with three to four part harmonies (they have more than once attributed this to the Beach Boys and the Beatles). Though their humor is as subtle as perinnial college favorites They Might Be Giant, their good-natured personalities shine brightly. Never ones to take part in the miost recent trend, BNL relishes in just being themselves, and do an excellent job at keeping their private lives private (lead singer Ed Robertson has a child, while Stephen Page clocks in with two). Overall, \"Barenaked in America\" is a nice review of BNL's breakthrough into America. Only complaint: too short.",
         "Back in January 1993, I returned to the U.S. from a two year mission in Chile. When I returned, I asked all my friends to catch me up with all the music that I had missed. One of them was this little Canadian band called Barenaked Ladies. I was so thrilled with them that I went out immediately and bought their CD, \"Gordon\". For the next few years, the Ladies would release album after album of quality music, but they were just kind of thrown to the side by radio stations. I know this because I worked at a station, and I kept begging my Program Director to play some of BNL's stuff, to no avail...until \"One Week\". Now it's been nearly 10 years, and the Barenaked Ladies are superstars! Watching \"Barenaked in America\" you can see their superstar status. \"Barenaked in America\" is one of the greatest Rockumentaries out there. It's not a bunch of pretentious rockers talking about how they wrote this song and how they made out with that supermodel. It's five guys having a blast doing something they love. By watching \"Barenaked in America\" you can tell that these guys really love their fans and their fans really love them. If you've never been to a BNL concert, you're missing out on one of the greatest shows you'll ever see. If you can't afford the ticket price, rent this movie and you'll get a glimpse of the band that is Barenaked Ladies.",
         "Not bad. I've never really had more than a passing interest in the Barenaked Ladies, but I liked the movie anyway. The personalities of the band really come out here, especially in the concert footage and the little anecdotes. As far as the technical side goes, it doesn't exactly shine. We've all seen better documentary footage. Still, it's a cute, harmless little movie. Not bad.",
         "For all fans of BNL--die hard, new or otherwise, this film is for you! I loved getting perspectives on the filming of their video for \"It's all been done\" (Ed's argument about the sight lines for cats is right on) to Steven's grousing about being pelted with Kraft Dinner, to Ty's outright silliness make this an enjoyable movie for fans of this truly creative band. The only scene I could have done without was the 5 minute shot of Ed Robertson grinning and shifting around on the commode with his pants down, supposedly deficating. That's an image I could have lived my entire life without seeing, but thanks to Jason Priestly, I've got it burned on my retinas. YUCK!",
         "I must say that I was disapointed with this film. I have never been a huge BNL fans, I find their songs kind of childish and obsessively nostalgic (this is me in grade 9, if i had a million dollars, shoe box of life etc). However, I have seen clips of their live show and I really like the improvisational and goofy nature of the show. I was hoping that this movie would highlight this which is, unfortunately, the most interesting part of the show because their music is well played yet somehow bland and not that compelling (there is a standup bass solo in the middle which was completely pointless and boring, despite how much Jim Creegan was digging himself). The film does not and shows only a few minutes of it (and you know they've had better moments, as in the Afgahnistan concert \"Koffee Anan, he's the man in charge, my name's Steve Paige and I'm really large\") . BNL are kind of like when I went to Europe a few years ago and heard that godawfull \"Blue\" song by Effeil 99 or whatever every 2 minutes, I came back to Canada and then a month later that song was all over the place *again*, I nearly chewed off my own arm. BNL is like that, years ago I remember many a fond memory of sitting around campfires in Canada listening to people play \"If I had a million dollars\". BNL was a cult phenomenon in Canada, and much of their humour has a particular Canadian slant to it (Kraft Dinner is a staple for many students up here, and the name \"Gordon\" is quintessentially Canadian) a few years went by where they slipped into obscurity and I was somewhat gratefull. Then all of a sudden they become huge in States, and everyone down there thinks they are this brand new band (yeah, they're brand new, but they're all in their 30's!) while the rest of Canada is going \"Oh geez, I thought those guys folded years ago, do I have to listen to 'million dollars' again?\" The concert footage is not bad, but I would have liked to have seen more of their stage routine, the shooting is not that great, and things like clips from their massive free show in Boston are glazed over much too quickly. The interviews are surprisingly dull for such a funny bunch of guys, I think they're all old and they have families and houses and stuff and have settled down a bit. There are times when they go into Spinal Tap type of material, where they deliver deadpan satire, then they break into laughs and giggles that kind of ruins it. The interviews with Moses Znaimer (a Canadian media mogule) and Terry David Mulligan (Music dude) are extremely pretentious and verge into Tap territory unintentionally. This movie doesn't really document very much either, I mean, it's basically one show and at the start of the film, they are already huge and have a massive touring entourage, it's not like we see them rising from obscurity and \"surprise\" they are popular, it's a methodically planned out event, so in the end it's rather lifeless, kind of half live concert, half documentary, and not much of either.",
         "May contain spoilers This documentary shows that BNL are not just a joke band-they take their music seriously and it shows. I like all of the backstage footage-you can get really intimate with the band. I am definitely a fan of their music now. The bass player seems really intense. A must-see documentary.",
         "I am a fan of BNL,but by no means am a die-hard.This band just continues to win me over.This documentary was funny,enlightening and enormously entertaining.Something I needed over the past week or so.What really impresses me about these guys is that they are just great over-all entertainers! They should look into acting(at least Ed and Steve)! Lots of good stories from the road ,too! Lots of fun!9/10!!!",
         "I'm familiar with The Barenaked Ladies from their frequent concert appearances in my home town of Rochester, NY and my visits to Toronto. While not being a full-fledged fanatic of the group, I've listened to their work prior to their CD \"Stunt\" and their last CD \"Maroon\". When it comes to concert documentaries, \"Barenaked in America\" doesn't rank as high as films like \"Woodstock\" or \"The Last Waltz\" but there is a lot to like about the documentary/concert film directed by Jason Priestley. \"Barenaked...\" takes an look inside a talented musical group from Ontario, Canada that's about to hit the big time: performing in large U.S. arenas, having the number 1 single in the U.S. (\"One Week\") and their album \"Stunt\" going platinum. Despite all of this, one member (keyboard player Kevin Hearn) was unable to join the group in their U.S. concert tour because he was diagnosed with Leukemia. It could have put a damper on the tour for the group but lead singers/guitarists Steven Page & Ed Robertson, bass player Jim Kreegan and drummer Tyler Stewart (with substitute Chris Brown on keyboard) still went on with the show. I like the way this near-tragedy was handled in the movie. But the film is not totally somber. It's alternately funny and insightful. It takes a look at the group's early years when they didn't have enough money to record a song in a studio so they performed in something similar to an instant photo booth, to asking people on the street if they knew who the Barenaked Ladies were and the comments that come out of the people's mouths was very funny. I tend to agree that fans of the Ladies will love this movie. I think a few people who may not have been fans of the group might be converted after watching the movie. But I'm happy to say that the conversion would be harmless.",
         "BARENAKED IN AMERICA / (1999) *** (out of four) By Blake French: \"Barenaked in America\" is part documentary, part music video following the Canadian band, Barenaked Ladies (Ed Robertson, Steven Page, Jim Creeggan, Kevin Hearn, and Tyler Stewart) during a two week US rock tour with the #1 single song \"One Week,\" in the 1998 album \"Stunt.\" The film is a behind-the-scenes look at the lives of an atypical band and the experiences they face while touring throughout the country. Naturally, this unusual production will entertain fans of the rock group in focus, with stories from the band's ten year career, comedic backstage traditions, humor-lacked frolics and fan nudity. The film also includes in depth interviews with each member of the band and conflicts experienced, including a member who struggled with cancer, and the task it was for the Canadians to discover an audience in America. The Barenaked Ladies began in 1988 when the band performed as part of Canada's alternative music scene. Blending easy-listening rock, jazz, and folk, the group toured throughout Canada and London-although hitting the jackpot in the USA was still out of their league until 1997, when appearances on national television programs and talk shows helped to achieve this dream. \"Barenaked in America\" is inquisitive and stylish, mixing the distinguished personalities of the Barenaked Ladies with zest and humor of the film's clever interviews. The Barenaked Ladies are a peculiar rock group, with interesting perspectives and an intriguing history of success. I also enjoyed the movie's many musical numbers, including the hit \"One Day,\" that not only inherits the film, but also provides an effective backdrop. The movie is directed by Jason Priestley, who's credits range from feature films like \"Eye of the Beholder,\" \"Love and Death on Long Island,\" and \"Tombstone,\" to the London production of Warren Leight's Tony Award-winning play \"Side Man,\" to his most famous role as Brandon Walsh in the popular Fox television series \"Beverly Hills 90210.\" With \"Barenaked in America,\" he captures the excitement of individual fans in the audience of the concerts, including one man who is offered one-thousand dollars to bare all-and excepts. \"Barenaked in America\" is insightful and cultural, although it has points in which electric verve seems to short-circuit itself with daul mumbo-jumbo and sequences lacking interest and motion. Candidly looking at a creative group of odd individuals, \"Barenaked in America\" may not consistently pack on the energy and pizzazz we crave, but it does show the earnest point of view of Rock and Roll through the eyes of a unique band. \"Barenaked in America\" shows you just how unique the Barenaked Ladies are.",
         "I caught a matinee of this limited release film in Georgetown, DC, in a tiny theater with the smallest movie screen I've ever seen with very few people in the audience. I've been waiting for this one for a while and I loved it. Of course, it's not for everyone. I can't see those who aren't already fans of Barenaked Ladies being terribly interested. For me, it was wonderful-- I've been listening to them since 1992 and I consider them my favorite band. I didn't really even learn much new about them, but the documentary was lovingly done and left me feeling good. Can't wait to see BNL in concert again. 9 out of 10."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Nettfilms"],
      "summaries": ["A rockumentary about the Canadian rock band Barenaked Ladies's life, in a nutshell."],
      "budget": 0
   },
   "movielensId": 3913,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": null,
      "directors": ["Jason Priestley"],
      "runtime": 0,
      "movieId": 3913,
      "title": "Barenaked in America",
      "mpaa": "",
      "actors": [
         "Steven Page",
         "Tyler Stewart",
         "Jim Creeggan",
         "Kevin Hearn",
         "Chris Brown",
         "Ed Robertson"
      ],
      "imdbMovieId": "0211219",
      "originalTitle": "Barenaked in America",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A rockumentary about the Canadian rock band Barenaked Ladies's life, in a nutshell.  It follows the band on its Stunt Tour.",
      "tmdbMovieId": 15752,
      "avgRating": 3.12879,
      "releaseYear": "1999",
      "numRatings": 132,
      "posterPath": "/2JIeGp6VnqnU1IdJYRtKKLZ1acy.jpg"
   }
}