{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "male friendship",
            "id": 3230
         },
         {
            "name": "in vitro fertilisation",
            "id": 4037
         },
         {
            "name": "romantic comedy",
            "id": 9799
         },
         {
            "name": "lesbian relationship",
            "id": 9833
         },
         {
            "name": "gay relationship",
            "id": 10198
         },
         {
            "name": "gay interest",
            "id": 10199
         }
      ],
      "imdb_id": "tt0222850",
      "video": false,
      "title": "The Broken Hearts Club: A Romantic Comedy",
      "recommendations": [
         19369,
         113460,
         21001,
         73252,
         17539,
         1812,
         20033,
         5591,
         26731,
         206729,
         19797,
         20116,
         51913,
         61072,
         31978,
         41645,
         32633,
         84038,
         41189,
         79908
      ],
      "backdrop_path": "/gMk8xMVBeBFTLYGM2eazVz31ssR.jpg",
      "revenue": 1744858,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Patrick",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a15b",
               "name": "Ben Weber",
               "profile_path": "/fZYe4IdsfGVv2Y4uVSjnQdzJEba.jpg",
               "id": 88961,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a15f",
               "name": "Timothy Olyphant",
               "profile_path": "/qPqm3mx3xzROFjlSGvh5dqR0XtV.jpg",
               "id": 18082,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Howie",
               "gender": 0,
               "credit_id": "52fe4447c3a368484e01a163",
               "name": "Matt McGrath",
               "profile_path": "/zrw8HWHNWvNmBGHBYZkicaNJg9A.jpg",
               "id": 2844,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Benji",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a167",
               "name": "Zach Braff",
               "profile_path": "/9FlETKKU88h8coz1YJhB7GwJJRZ.jpg",
               "id": 5367,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Cole",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a16b",
               "name": "Dean Cain",
               "profile_path": "/cICjOmo5KZWdfJLBvIExDE6Ma5f.jpg",
               "id": 21721,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Larry",
               "gender": 0,
               "credit_id": "52fe4447c3a368484e01a16f",
               "name": "Chris Payne Gilbert",
               "profile_path": "/7NGThqCD6IXU9wtVcKqmhnSf4cm.jpg",
               "id": 88962,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Female Shopper",
               "gender": 0,
               "credit_id": "52fe4447c3a368484e01a173",
               "name": "Nora Burns",
               "profile_path": null,
               "id": 88963,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a177",
               "name": "John Brandon",
               "profile_path": null,
               "id": 88965,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a17b",
               "name": "John Mahoney",
               "profile_path": "/jK2uDKxfysuYjNAgUxbwyhd4fKD.jpg",
               "id": 4251,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Leslie",
               "gender": 1,
               "credit_id": "52fe4447c3a368484e01a17f",
               "name": "Nia Long",
               "profile_path": "/q01J3WgNd96GR7CcSxx56N8qwSZ.jpg",
               "id": 9781,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe4447c3a368484e01a183",
               "name": "Mary McCormack",
               "profile_path": "/et3POqgfLTA1tNXr7nWvsIMejsw.jpg",
               "id": 1980,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Marshall",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a187",
               "name": "Justin Theroux",
               "profile_path": "/vnI9L0rXBAw1HeC0Q8hJGeJMGAW.jpg",
               "id": 15009,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Taylor",
               "gender": 0,
               "credit_id": "52fe4447c3a368484e01a18b",
               "name": "Billy Porter",
               "profile_path": "/9gSSABLdRmhMPfrv2paqd5CE8di.jpg",
               "id": 88966,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Josephine",
               "gender": 1,
               "credit_id": "52fe4447c3a368484e01a18f",
               "name": "Diane McBain",
               "profile_path": "/kdkt1nzaCaoGRdHNefufnoeNkkG.jpg",
               "id": 83462,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a199",
               "name": "Andrew Keegan",
               "profile_path": "/98PX1sKUois0GhoMxvq2Ez9nhy9.jpg",
               "id": 40979,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a195",
               "name": "Greg Berlanti",
               "profile_path": "/AbocIYSo4KXx7nT6lz2dj3qMD8H.jpg",
               "id": 88967,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53dd58a2c3a3686c51000205",
               "name": "Joseph Middleton",
               "profile_path": null,
               "id": 1593,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "53dd58bcc3a3686c5d000234",
               "name": "Julianne Kelley",
               "profile_path": null,
               "id": 1348796,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "53dd58d8c3a3686c4d000219",
               "name": "Mickey Liddell",
               "profile_path": null,
               "id": 48498,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53dd58e9c3a3686c5a00021d",
               "name": "Joseph Middleton",
               "profile_path": null,
               "id": 1593,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53dd58fdc3a3686c4d00021f",
               "name": "Greg Berlanti",
               "profile_path": "/AbocIYSo4KXx7nT6lz2dj3qMD8H.jpg",
               "id": 88967,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53dd5926c3a3686c4900020e",
               "name": "Mickey Liddell",
               "profile_path": null,
               "id": 48498,
               "department": "Sound",
               "job": "Music Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.279462,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22597,
      "vote_count": 30,
      "budget": 1000000,
      "overview": "A group of friends search for fun, love and ultimately themselves in West Hollywood. This movie is an entertaining, and sometimes cynical look into the lives of six gay men trying to come to terms with what being gay and single (or gay and partnered) means to them.",
      "similar": [
         449176,
         184352,
         26280,
         338189,
         258034,
         26371,
         376867,
         258480,
         428493,
         413666,
         380874,
         10938,
         11000,
         47643,
         9029,
         1966,
         1213,
         1429,
         401898,
         398818
      ],
      "original_title": "The Broken Hearts Club: A Romantic Comedy",
      "runtime": 94,
      "poster_path": "/jCZlHSsgQHwfeHn1Es4uXCJ7NOX.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [],
      "release_date": "2000-02-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Greg Berlanti"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Greg Berlanti"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0222850/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNjAzMzY5OF5BMl5BanBnXkFtZTcwMzE1OTUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Timothy Olyphant, Dean Cain, Zach Braff | See full cast and crew »"],
      "reviews": [
         "The day I was finally able to admit to myself that I was a gay man I rented this movie. That first viewing changed my life. It helped me envision a life a hoped was ahead of me. During my first year of being out I watched this movie so many times and still watch it about once a year. The first time I saw it I thought it was one of the best movies I had ever seen. Time has dimmed my view of it but it still a must see for any newly out (newbie) gay man. The script is well written. Some of the direction is a little off but it was a low budget film. It is also fun to see all these mainstream actors like Dean Cain, Timothy Olymphant and Andrew Keegan playing gay.",
         "Greg Berlanti's film is worthy of a lot of praise in a society where gay men tend to only fulfill certain stereotypes. A character, Howie mentions how he would like to see gay men being represented as something other than the woman's best friend, the hustler, the aids victim or the sex addict and this film does tend to try hard to avoid these stereotypes. The script is brilliantly written and sparkles when it is at its peak. At its worst, it may be a little bit cliche ridden but hey..it also has originality ( I have taken \"Meanwhile\" and now its commonplace down ere!) and is not afraid to portray gay men as just a group of lads who are falling in and out of relationships, liek any other group of young men. However certain characters do tend to bring the pace down a little and it does sometimes seem to have the sentiment that gay men have got it so bad compared to everyone else in the world. Timothy Olyphant stands out here in an able cast, made up primarily of TV actors. My only grumble was the inclusion of the lesbian couple who seemed to only be there to represent the ladies and also to give Howie a meatier role. 4/5",
         "I know people have their problems with this movie, but I happened to catch it at the perfect time in my life. I think every young gay male should watch this movie and see that there is life after coming out. It's nice to see a gay movie that isn't a GAY movie. The main characters all happen to be gay, but that is not the focal point of the movie. There is no sub-plots about AIDS or dealing with same-sex marriages or disapproving parents. The movie starts when all that stuff has already happened. It really makes you think. Two thumbs up! The cast is superb. Although not superstars, the movie has some well seasoned actors; including Fraiser star John Mahoney. Zach Braff does an excellent job as does Andrew Keegan, Dean Caine and of course Timothy Olyphant. Kerr Smith also has a small cameo but well worth it. This movie begins to break down the stereotypes of gay men and comes up with some great gay lingo that my friends and I have adopted.",
         "That statement is part of what makes this is a terrific film about love, friendship and betrayal -- betrayal of friends, the people you are supposed to care most about and ultimately yourself. This is also a film about facades, lying and truth telling. From the opening montage of `Gay or Not Gay' in a supermarket this is a film with many laughs and people that you want to care about. A true ensemble cast, ostensibly headed by Timothy Olyphant as Dennis, is only part of what makes this a fine piece of cinematic work. Dean Cain (Cole) as the pretty-boy actor at one point says about his obvious good looks: \u0091It's my way in ... and then I have to prove if I have the #@%* to back it up.' Mr. Cain proves that he does have the ability to back it up. Matt McGrath (Howie) as a man searching for love and doesn't realize he has it within his grasp, has a Mathew Broderick look that is very engaging. The always-interesting John Mahoney is outstanding as the coach of the `Broken Hearts Club' baseball team that wears the uniform of his restaurant and bar where the perennially losing team goes after their pathetic attempts at playing baseball. Colour becomes a character as embodied by Robert Arce as `Purple Guy.' He speaks only once in the film -- but it is worth listening to. There are many outstanding actors -- many currently in television series -- John Mahoney (Fraser), Zach Braff (Scrubs), Chris Payne and Ben Weber who have both done time on `Sex in the City.' But it was particularly nice to see Jennifer Coolidge who will always be Stiffler's Mom in the `American Pie' films. Andrew Keegan as Kevin the `newbie' is exceptional -- learning about himself and life in West Hollywood whether he wants to or not. This is very much writer/director Greg Berlanti's film -- these must be people he knows and so writes about. At one point one of the characters says 'they should make a movie about us.' Well, Mr. Berlanti did and it is quite an accomplishment because even though the characters are gay the lives they lead, the questions they ask, the problems they face and the joys they experience are universal.",
         "THE BROKEN HEARTS CLUB: A ROMANTIC COMEDY (2000) Aspect ratio: 2.39:1 Sound formats: Dolby Digital / SDDS The lives and loves of an LA softball team, comprised entirely of gay men. Greg Berlanti's heartfelt drama seems a little timid in the wake of confrontational entries like \"Queer as Folk\", but the former producer and co-writer of TV's gay-friendly \"Dawson's Creek\" makes an otherwise auspicious directorial debut with this familiar account of several gay friends looking for love and companionship in vanity-driven Los Angeles. As one character puts it: \"Gay men in LA are a bunch of 10's looking for an 11.\" Essentially the tale of a Queer sports team comprised of staff and management at a popular restaurant run by elderly patriarch John Mahoney (\"Frasier\"), the film's paper-thin narrative is roused by a combination of lively dialogue and well-defined characters, played to perfection by a terrific cast, culled mostly from the New York stage: Ben Weber is the 'Plain Joe' whose inability to attract a boyfriend is due more to his lack of self-esteem than absence of personality; Dean Cain (Superman himself!) is a hunky aspiring actor who leaves a trail of broken hearts in his wake; punk-style Zach Braff portrays a gym-queen, wilfully blind to the dark side of gym culture; Matt McGrath and Justin Theroux are ex-lovers who can't seem to let go of one another; and Andrew Keegan is the cute new kid who stumbles into this disparate group whilst struggling to come to terms with his burgeoning sexuality. The unofficial pack-leader (Timothy Olyphant) is smart and sassy, and increasingly aware of the personal opportunities he's sacrificed in his relentless pursuit of casual sex with strangers. The actors invigorate a fairly routine scenario, though Olyphant (whose demonic good looks have typecast him in too many villainous roles) dominates proceedings as a young man standing at the crossroads of his life, seeking confirmation of his own personal value. Mahoney is funny, wise and dignified as the Shakespeare-quoting softball coach, and Broadway singer-actor Billy Porter gets some of the best lines in a role that otherwise amounts to little more than comic relief. Beefcake is provided by supermodel-turned-actor Michael Bergin (\"Baywatch: Hawaii\") and Christian Kane (semi-regular on TV's \"Angel\") in cameo roles, and the lovely Kerr Smith appears briefly in one of the movie's best scenes. Watch out, too, for a memorable appearance by Jennifer Coolidge as a 'helpful' hair stylist who brings the house down with a single line of dialogue! However, a subplot involving Weber's sister (Mary McCormack) and her attempts to become a mother with long-term partner Nia Long is underdeveloped to the point of redundancy (memo to gay movie makers: if you're gonna include lesbians in these otherwise all-male offerings, do 'em properly or not at all!), and Cain's much-publicized 'kiss' with Keegan is coyly hidden by the angle at which it's filmed, a hideous cop-out (the eminently straight Olyphant has no such qualms - he kisses his male co-stars with reckless abandon!). Shot on location by cinematographer Paul Elliott (AND THE BAND PLAYED ON), the movie has the look and feel of a widescreen TV show, dominated by closeups and medium shots which invalidate Berlanti's use of the scope format. Gay cinema doesn't really need another romantic comedy, but while \"Broken Hearts\" doesn't offer anything new, it's salvaged by snappy editing, a quickfire pace, and first-class performances by some of America's finest young actors. And thanks to a clever, throwaway bit of name-dropping, the movie offers fleeting confirmation - at last! - of the role played by sex-god Antonio Sabato Jr. in the fantasies of hormonally-charged gay teenagers everywhere! Been there, done that...",
         "The Broken Hearts Club is one of the most genius films I have ever seen. I love the way each character is conveyed differently, proving the homosexual male stereotype wrong. This movie is very warm and heart-felt bringing a connection to the viewer and the characters.This film is smart, and a well put together comedy that will definitely have viewers laughing, crying, smiling, fussing, and cheering until the very end. I recommend everyone have an open-mind and see this film. There are few films that I would say won my heart after seeing it but The Broken Hearts Club did just that. This film shows that homosexual males go through many similar situations that heterosexual males also go through . This movie sends many different positive messages to it's audience. I definitely respect this film 100 percent. The Broken Hearts Club: A Romantic Comdey deserves a standing ovation.",
         "Quick evaluation: this movie does reflect my experiences of the past 25 years. As a nearing-50 gay man, I can relate to nearly all the principal characters, both personally and as they relate to my friends and acquaintances. Yes, at various times in my life I've been the cute, promiscuous one; the lonely one; the gym bunny (no drugs, though); the (self-perceived) ugly one. . .all those have helped me to become a better, more self-actualized person. Seems there are too many self-loathing queens commenting negatively on this film here. . .maybe they can't see themselves in the characters, but if they were to be honest, they'd realize that they do indeed exist in one or more of these characters. I enjoyed the film, laughed a little, cried a little. As I said, \"been there, done that.\"",
         "As a mature (61) gay man, I enjoyed the hell out of this film. At least there was a diversity of stereotypes. I guess it would be boring to show that most gays lead \"regular\" lives in all kinds of workplaces. The angst was, thankfully, less \"Dawson's Creek\" and more universal. The experienced straight actors helped it flow along nicely, a cut above the usual sloppy, Indie-style gay movie. The Lesbian subplot should have been expanded--or left out! I recommend this movie to all young lesbians and gays facing a still altogether ignorant homophobic society---but one that has improved since I was their age. Kudos to the people behind the camera too!",
         "This film gives gay men a meaning beyond stereotypes and the roles usually seen in gay movies. The theme is universal: friends stand by you to assure you that you are OK as you are. Some of the dialog is hilarious, and the characters ring true even though many of these people are played by straight actors. There is an amusing glossary of gay terms given on the screen from time to time so that straight audiences will understand the lingo of the gay subculture. The touching elements in the film include the loneliness of what one character describes as \"10s looking for 11s.\" The recognition that a person can be gay and average is the only antedote for this loneliness. We follow a group of young gay men, under the matronly supervision of John Mahoney, connecting and disconnecting as they try to find themselves in a world that doesn't seem to care who they are. It's a story of human beings. The fact that they are gay is incidental -- and this is a major step forward in gays being depicted in movies.",
         "How un-promising does a gay male Sex In The City sound? This one took me quite by surprise. It's a frequently very funny romantic comedy, that only occasionally dips into cliche. Why America remade Queer As Folk when they already had this is beyond me. Is \"Queer as folk\" ever an expression over there? Anyway, this includes Frasier's Dad and Superman amongst its gay baseball team, so it's good in my book."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "Banner Entertainment",
         "Meanwhile Films"
      ],
      "summaries": [
         "In the palm-shaded oasis of West Hollywood, we meet Dennis, a promising photographer. As he prepares to celebrate his twenty-eighth birthday, he laments, ' I can't decide if my friends are the best or worst thing that ever happened to me.' The gang includes Benji, the punkish innocent with a penchant for gym bodies; Howie, the psychology grad student who thinks too much and lives too little; Cole, the charismatic actor who accidentally keeps stealing everybody's guy; Patrick, the cynical quipster, and Taylor, resident drama queen, who, until recently, prided himself on his long-term relationship. Providing sage advice and steady work is Jack, the beloved patriarch whose restaurant is a haven for them all. When tragedy strikes the group, the friendships are put to the test.",
         "A group of gay friends in West Hollywood lean on each other to work their way through gay life, not always with success. They gather around Jack's Broken Hearts restaurant and lounge, Jack acting as their father figure and the coach and head cheerleader behind the inept Broken Hearts softball team. The group of friends includes Howie who can't break the physical or emotional ties with his ex-boyfriend, Marshall, even after Marshall starts dating someone else and despite Howie being the one to call their relationship off. Patrick has self-image issues. He has to make a major decision when his lesbian sister asks him to donate sperm to her lesbian lover. Cole is the narcissist, who treats men like playthings to throw away, never having been thrown away himself until he hooks-up with movie star Kip Rogers. Taylor is going through the many stages of dealing with a break-up with his long term partner, who had a history of cheating on him. Benji, attracted to muscle types, is in desperate need of acceptance from others at almost any price. The emotional core of the group is Dennis, an aspiring photographer. Dennis has hit a stage in his gay life where he wants something more than just meaningless sex. When he meets Kevin, a not even out gay young man, Dennis tests his new resolve. But Kevin needs support of his own as someone just coming to terms with his sexuality, something that Dennis may not be able to provide in its entirety."
      ],
      "budget": 1000000
   },
   "movielensId": 3914,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Pусский"
      ],
      "releaseDate": "2000-02-01",
      "dvdReleaseDate": "2001-03-06",
      "directors": ["Greg Berlanti"],
      "runtime": 94,
      "movieId": 3914,
      "title": "The Broken Hearts Club: A Romantic Comedy",
      "mpaa": "",
      "actors": [
         "Ben Weber",
         "Timothy Olyphant",
         "Matt McGrath",
         "Zach Braff",
         "Dean Cain",
         "Chris Payne Gilbert",
         "Nora Burns",
         "John Brandon",
         "John Mahoney",
         "Nia Long",
         "Mary McCormack",
         "Justin Theroux",
         "Billy Porter",
         "Diane McBain",
         "Andrew Keegan"
      ],
      "imdbMovieId": "0222850",
      "originalTitle": "The Broken Hearts Club: A Romantic Comedy",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["QRaWJy3NmFg"],
      "plotSummary": "A group of friends search for fun, love and ultimately themselves in West Hollywood. This movie is an entertaining, and sometimes cynical look into the lives of six gay men trying to come to terms with what being gay and single (or gay and partnered) means to them.",
      "tmdbMovieId": 22597,
      "avgRating": 3.43045,
      "releaseYear": "2000",
      "numRatings": 381,
      "posterPath": "/jCZlHSsgQHwfeHn1Es4uXCJ7NOX.jpg"
   }
}