{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0210075",
      "video": false,
      "title": "Girlfight",
      "recommendations": [
         24227,
         15486,
         21355,
         55027,
         67058,
         29901,
         64170,
         47841,
         50916,
         41647,
         36934,
         10496,
         18031,
         32304,
         88768,
         174376,
         76395,
         38244,
         35241,
         441
      ],
      "backdrop_path": "/m9STTiP7PIxHrPkaDo8P3OKDdIw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Diana Guzman",
               "gender": 1,
               "credit_id": "52fe47d29251416c750a6811",
               "name": "Michelle Rodriguez",
               "profile_path": "/v37VK0MNuRuJOCKPKJcZAJXRA5r.jpg",
               "id": 17647,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Hector Soto",
               "gender": 2,
               "credit_id": "52fe47d29251416c750a6815",
               "name": "Jaime Tirelli",
               "profile_path": "/tmQlW0qO4Hr2o4f6pk7knDjmYlf.jpg",
               "id": 59743,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sandro Guzman",
               "gender": 2,
               "credit_id": "52fe47d29251416c750a6819",
               "name": "Paul Calderon",
               "profile_path": "/2v8spXfKtaMbFZ25FrVsV0SAPwW.jpg",
               "id": 3137,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Adrian Sturges",
               "gender": 2,
               "credit_id": "52fe47d29251416c750a681d",
               "name": "Santiago Douglas",
               "profile_path": "/6sNLcAM5OzY67vC0WRoY8mDxEMs.jpg",
               "id": 84519,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tiny Guzman",
               "gender": 2,
               "credit_id": "52fe47d29251416c750a6821",
               "name": "Ray Santiago",
               "profile_path": "/3a5pbiX0owhDPVWCyg1Snb63Clz.jpg",
               "id": 52957,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ray Cortez",
               "gender": 0,
               "credit_id": "52fe47d29251416c750a6825",
               "name": "Víctor Sierra",
               "profile_path": null,
               "id": 84520,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Marisol",
               "gender": 1,
               "credit_id": "52fe47d29251416c750a6829",
               "name": "Elisa Bocanegra",
               "profile_path": "/nNf88dj04dZPIHMlL40rXm3ZbwK.jpg",
               "id": 84521,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Cal",
               "gender": 0,
               "credit_id": "52fe47d29251416c750a6839",
               "name": "Herb Lovelle",
               "profile_path": null,
               "id": 28025,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Ira",
               "gender": 2,
               "credit_id": "52fe47d29251416c750a683d",
               "name": "Thomas Barbour",
               "profile_path": "/eBRpaikFkZbfelnmzCFintMkRQz.jpg",
               "id": 138236,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Veronica",
               "gender": 0,
               "credit_id": "52fe47d29251416c750a6841",
               "name": "Shannon Walker Williams",
               "profile_path": null,
               "id": 1233888,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47d29251416c750a682f",
               "name": "Karyn Kusama",
               "profile_path": "/6KlEWWO7aZE6MZtExVZKoQ6Ddzs.jpg",
               "id": 54025,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47d29251416c750a6835",
               "name": "Karyn Kusama",
               "profile_path": "/6KlEWWO7aZE6MZtExVZKoQ6Ddzs.jpg",
               "id": 54025,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "564f9cbcc3a368071b00516a",
               "name": "Patrick Cady",
               "profile_path": null,
               "id": 50101,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "564f9ccc9251414b01004f4f",
               "name": "Susan Jacobs",
               "profile_path": null,
               "id": 232158,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "564f9cdfc3a36833e7000c1c",
               "name": "Lois Dilivio",
               "profile_path": null,
               "id": 1538826,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "564f9cf992514164c0000e2d",
               "name": "Gary Harris",
               "profile_path": null,
               "id": 1538827,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "564f9d1f9251414b01004f58",
               "name": "Plummy Tucker",
               "profile_path": null,
               "id": 53278,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "564f9d3f9251414af9004be7",
               "name": "Stephen Beatrice",
               "profile_path": null,
               "id": 1030591,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "564f9d5b92514178d7000899",
               "name": "Marco Cattoretti",
               "profile_path": null,
               "id": 1538718,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "564f9d679251414af9004bee",
               "name": "Luca Mosca",
               "profile_path": "/adtSrjn37EhoTSHFPfqxDmBTw6z.jpg",
               "id": 52682,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5910de8c9251414ead03579f",
               "name": "Sarah Green",
               "profile_path": null,
               "id": 16398,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5910de939251414e8d0363e1",
               "name": "Martha Griffin",
               "profile_path": null,
               "id": 54049,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5910de9a9251414edb038271",
               "name": "Caroline Kaplan",
               "profile_path": null,
               "id": 6511,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5910dea1c3a36864fc03740d",
               "name": "Maggie Renzi",
               "profile_path": "/6KeCgZsBKF8Wr0mAY8NlclHDF5d.jpg",
               "id": 20835,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5910dea99251414e89038bbc",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5910deb1c3a36864d4039260",
               "name": "Jonathan Sehring",
               "profile_path": null,
               "id": 6510,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5910deb8c3a36864fc037419",
               "name": "Craig H. Shepherd",
               "profile_path": null,
               "id": 40073,
               "department": "Production",
               "job": "Line Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.805238,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19348,
      "vote_count": 70,
      "budget": 0,
      "overview": "Diana Guzman begins to train as a boxer and achieves impressive success, blazing new trails for female boxers, all while keeping it a secret from her father.",
      "similar": [
         8923,
         9655,
         9291,
         22881,
         2300,
         10637,
         227306,
         323677,
         11287,
         43923,
         10474,
         455,
         2280,
         9563,
         27586,
         2323,
         86130,
         13416,
         8966,
         1359
      ],
      "original_title": "Girlfight",
      "runtime": 110,
      "poster_path": "/h9w0s4M7UAT6yMFv1Qw0Gp5qx9C.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Screen Gems, Inc.",
            "id": 127,
            "origin_country": ""
         },
         {
            "logo_path": "/e4dCQJpJjwL46i1WuGpTIO3srL6.png",
            "name": "20th Century Fox Home Entertainment",
            "id": 3635,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-05-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Prove them wrong.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Karyn Kusama"],
      "runtime": 110,
      "synopsis": "Breaking new ground in women's boxing may seem like an unlikely way to advance the cause of women's issues. Aren't there more important problems like pay equity and childcare to address? Yes, but boxing reaches out in a visceral way to viewers too worn down by life's own battles to do more than manage to pay the mortgage and get the kids off to school each morning. So by gaining access to the viewers through boxing, this film does further our national discussion of serious issues facing young women. Regardless of your position on the sport of boxing, this film allows views to address serious themes of sexism, gender identities for men and women, sexual stereotypes for both men and women, and the role of parental figures. The character development of Diana is somewhat formulaic, but some formulas work and should be applied in new arenas. This is a suitable arena for the hero's journey. And Diana (Michelle Rodriguez) notice the reference to the Greek goddess of the hunt embarks on a journey that is not easy as a woman, an athlete, or an \"at-risk\" teen. Girlfight does what movies are supposed to do: provide entertaining ways to introduce topics about the human experience that viewers end up discussing long after the popcorn and soda are gone.",
      "writers": ["Karyn Kusama"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0210075/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NjczMzcyOF5BMl5BanBnXkFtZTcwODg0NDYxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Michelle Rodriguez, Santiago Douglas, Jaime Tirelli | See full cast and crew »"],
      "reviews": [
         "Poverty is the great equalizer. Or at least one would think so. Imagine that in addition to financial instability you are a young Latino woman, with no aspirations, opportunities or positive role models, who does poorly in school, and has a powder keg temper. Welcome to Diana Guzman's life. Whether it's because she refuses to talk about lipstick and boys or because she settles disagreements with her fists, Diana is an outcast. After her fourth fight in as many months, the principal informs Diana that she's run out of chances - one more fight and she's gone. She files the incident under \"Whatever\", and curses about her detention as she heads to a squalid little athletic club on an errand for her father. When Diana walks into the gym, she is entranced by the combination of salty sweat, testosterone, and men boxing. In keeping with the atmosphere, she decks one of the boxers after he takes a cheap parting shot at her little brother after a bout. Rather than chastising her, the men edge back, affording her a measure of respect, the first she has ever experienced. And she likes it. Realizing that she has found her niche all she convince a skeptical, chauvinistic trainer to take her on, get money to pay him, and hide her passion from her abusive, dismissive, alcoholic father. Well, at least it's no tougher than anything else she's had to do. Anyone expecting a female \"Rocky\" will be disappointed - \"Girlfight\" is not about endorsements, glory or bone crushing slow motion boxing sequences - boxing here serves as the background for the film, not the main attraction. The film would more appropriately be described as - and I really hate this phrase - a coming of age story. But Diana is a much more complex than the typical lead in this genre - she struggles not only with the issues we normally associate with adolescence - awkwardness, a desire to belong, and racing hormones - but also with discrimination, blinding rage, and expectations that are constantly forced upon her. As Diana's training progresses, she grows both literally and as a person -she learns to control her anger, walk with confidence, discover who she is, smile and risk the vulnerability of romance. The acting is superb. From the initial appearance of her glowering image on screen, Michelle Rodriguez is superb. Chosen from among several hundred actors at a cattle call, Rodriguez, who had only previously worked as an extra, captures Diana's hostile intensity and indifference perfectly and has a screen presence that most actors would sell a couple of souls for. In addition to honing Diana's persona, Rodriguez underwent four and a half months of gruelling training to develop the necessary boxing skills and physique to match. The final product is one of the strongest performances I've seen since Hillary Swank's Oscar winning role in \"Boys Don't Cry\". Rodriguez is bolstered by a strong cast: Jaime Tirelli, who plays her Doubting Thomas trainer Hector, and Santiago Douglas, as Adrian, her sensitive partner in love and in the ring. Rather than opt for the clean Hollywood look, Girlfight feels like a documentary both in the locations and filming. From the dingy little hole in the wall gym plastered with mottoes written on cardboard (\"Champions are made, not born\") to the crumbling deadly projects where Diana lives, everything has that unpolished grit that is difficult to fake. The director also chose a departure from the accepted standard of choreography in boxing films - instead of the whiplash-in-action slow motion sequences, the sparring is shown from a first person perspective with the glove coming straight at the viewer's face. I flinched more than once. Take a date, or go alone. Either way you will agree that \"Girlfight\" works on many levels, and disappoints on none.",
         "The first step to getting off of that road that leads to nowhere is recognizing that you're on it in the first place; then it becomes a matter of being assertive and taking positive steps to overcome the negative influences in your life that may have put you on that road to begin with. Which is exactly what a young Latino girl does in `Girlfight,' written and directed by Karyn Kusama. Diana (Michelle Rodriguez) is an eighteen-year-old High School senior from the projects in Brooklyn, facing expulsion after her fourth fight in the halls since the beginning of the semester. She affects a `whatever' attitude which masks a deep-seated anger that threatens to take her into places she'd rather not go. She lives with her father, Sandro (Paul Calderon), with whom she has a very tentative relationship, and her younger brother, Tiny (Ray Santiago). With her life teetering on the brink of dissolution, she desperately needs an outlet through which to channel the demons that plague her. And one day she finds it, without even looking for it, when she stops by the gym where Tiny trains. Ironically, Tiny wants nothing to do with boxing; he wants to go to art school, but Sandro is determined that his son should be able to take care of himself on the streets, and pays the ten dollars a week it costs for his lessons. When Diana convinces Tiny's trainer, Hector (Jaime Tirelli), to take her on, and approaches her father for the money, under the guise of calling it a weekly allowance (she doesn't want him to know what she wants the money for), Sandro turns her down and tells her to go out and earn her own money. Ultimately, with Tiny's help she finds a way, and the ring soon becomes her second home. It's an environment to which she readily adapts, and it appears that her life is about to take a turn for the better. And the fact that she will have to fight men, not women, in `gender blind' competitions, does not faze her in the least. Diana has found her element. First time writer/director Karyn Kusama has done a terrific job of creating a realistic setting for her story, presenting an honest portrait of life in the projects and conveying that desperation so familiar to so many young people who find themselves in dead-end situations and on that road that leads to nowhere. And there's no candy coating on it, either; as Hector tells Diana when she asks him how he came to be where he is, `I was a fighter once. I lost.' Then, looking around the busy gym, `Like most of these guys, they're going to lose, too. But it's all they know--' And it's that honesty of attitude, as well as the way in which the characters are portrayed, that makes this movie as good as it is. It's a bleak world, underscored by the dimly lit, run-down gym-- you can fairly smell the sweat of the boxers-- and that sense of desolation that hangs over it all like a pall, blanketing these people who are grasping and hanging on to the one and only thing they have, all that they know. Making her screen debut, Michelle Rodriguez is perfectly cast as Diana, infusing her with a depth and brooding intensity that fairly radiates off of her in waves. She is so real that it makes you wonder how much of it is really Rodriguez; exactly where does the actor leave off and the character begin? Whatever it is, it works. It's a powerful, memorable performance, by an actor from whom we will await another endeavor with great anticipation. She certainly makes Diana a positive role model, one in whom many hopefully will find inspiration and the realization that there are alternative paths available in life, at least to those who would seek them out. As positive as this film is, however, it ends on something of an ambiguous note; though Diana obviously has her feet on the ground, there's no indication of where she's headed. Is this a short term fix for her, or is she destined to become the female counterpart of Hector? After all, realistically (and in light of the fact that the realism is one of the strengths of this film), professional boxing isn't exactly a profession that lends itself to, nor opens it's arms to women. And in keeping with the subject matter of the film, and the approach of the filmmaker, an affirmation of the results of Diana's assertiveness would have been appropriate. The supporting cast includes Santiago Douglas (Adrian), Elisa Bocanegra (Marisol), Alicia Ashley (Ricki) and Thomas Barbour (Ira). Though it delivers a very real picture of life to which many will be able to identify, there are certain aspects of `Girlfight,' that stretch credibility a bit, regarding some of what happens in the ring. That aside, it's a positive film that for the most part is a satisfying experience. I rate this one 7/10.",
         "\"Girlfight\" follows a project dwelling New York high school girl from a sense of futility into the world of amateur boxing where she finds self esteem, purpose, and much more. Although the film is not about boxing, boxing is all about the film. So much so you can almost smell the sweat. Technically and artistically a good shoot with an sense of honesty and reality about it, \"Girlfight\" is no chick flick and no \"Rocky\". It is, rather, a very human drama which even viewers who don't know boxing will be able to connect with.",
         "I first saw Michelle Rodriguez in The Fast and The Furious, and was sad that her character wasnt given more to work with because it was a role that could have been a great addition to the film. Just recently I saw her Girlfight which was the role that started and has so far highlighted her career. And to be honest I found it to be one of the best movies I have seen in the last couple years. The movie is about a girl named Diana played by rodriguez who has alot of pent up anger about herself and her mother's death. So her life at school is spent mostly by getting into fights, but that all changes when she visits her brother at a local boxing facility. Soon its her and not her brother being the one trained, and through boxing she finds a way to release her anger, and find something to concentrate on. One of the things I found that I loved about the movie was that at the end not all of her problems were taken care of, just some of them. And her dreams are not realized but just taken a step further which is all she really wants. But most of all it was Michelle's performance that made this movie the experience it is. Her character is REAL, and people aspiring to be actresses should watch her movie for pointers. She imbues her with the rage, and the full range of emotions that she shows through every scene. So watch it and love it 10/10",
         "In most sports movies, you'll have the corny story of triumph and it might be not too great. But this film is different. It uses it's independent edge (it won numerous awards at the Sundance and Caanes film festivals) to not be cornball, but to a good achievement. Michelle Rodriguez definately makes an credible debut as the troubled and always angry Diana, who decides a way to get out some of her aggression is in boxing, and it works, even when she has to face her boyfriend in the (improbable to be sure) ring. Better than I thought, but the liability is that Diana is always angry (so angry that any regular girl's worst day of PMS is Diana's best day) and she does some things to her family and friends that are very questionable, method and emotion wise which almost makes her not the best girl to emmulate. Pretty good, never-the-less. B+",
         "I saw this film for the first time last night and absolutely loved it. Michelle Rodriguez's performance was amazing (especiallty as it was her debut movie) she was completely believable as Diana the tough troubled girl. I liked the way that in the movie not everything worked out to provide a perfect ending, like how her Dad never saw her win her big fight and there was never a soppy 'I love you daddy' scene, it just showed a snapshot of her life and I am sure she would have continued to struggle and fight for what she wanted pretty much for the rest of her life. I also liked the ambiguity about her relationship with Adrian at the end, because after all this movie is not a fairytale! An excellent movie with brilliant performances from all especially Michelle.",
         "Girlfight is like your grandma's cooking: same old recipe you've tried a million times before somehow transformed into something fresh and new. Try and explain the story to people who haven't seen it yet: a young women from the wrong side of the tracks attempts to improve her lot in life by taking up boxing whilst dealing with a bitter, obstructive father and her growing attraction to a male rival blah blah blah. Watch them roll their eyes and ask to watch it just to play Count-the-Clichés. Yeah, we've seen it all before but I was hypnotized by Girlfight. It works so well because of the superb acting and dialog and the sensitive direction that makes it 'classic', not 'stale'. I avoided this at the cinema because it looked like complete crap but don't make the same mistake I did. Definiately worth a look.",
         "Being a regular troublemaker at school, Diana starts to entertain the idea of learning to box properly like her brother is allowed to do. Knowing her father will never let her do it she steals the money from him and starts to train with Hector. Quickly improving in the ring despite the hoots of derision aimed at her from her fellow boxers, Diana finds problems with a lack of female opposition, love in the shape of another up and coming amateur and a conflict on the horizon with her father bound to find out sooner or later. I'm not sure where I got the idea but for years I had the impression that this was a foreign indie film that had made a big impression and was critically praised. Mostly for these reasons I did really want to see it but never got round to it until it came onto television recently. By this point I had realized that it was an American movie with some indie aspirations but not the grit or adult content I had expected \u0096 anyway, this preconception was my fault so I put it out of my mind and settled to watch it. The story is a fairly straightforward tale of a teenage girl trying to cut an unusual path in her life, facing and overcoming obstacles along the way. In this regard it is all pretty standard stuff, although the boxing content made it more interesting for me. It is reasonably well written and brings in some themes of domestic violence, back story and so on, without ever really getting to grips with any of them that well. However what makes the film much better than it could have been was the realistic, convincing and moody playing of newcomer (at the time) Michelle Rodriguez. At times she pushes it a bit too close to being a typical \"whatever\" teenager and loses our interest but for the most part we can see real heart in her character and she keeps us onside with just enough of a look inside her to keep caring. The direction is also good \u0096 matching Rodriguez down-to-earth performance by not playing up the boxing scenes or any other aspect of Diana's life. Support is good from Tirelli, Calderon, Douglas and Santiago to name a few and they hold the ground well for Rodriguez to stand out. Overall this is not a great film, it is an enjoyable one but it rarely is more than par for the course in many areas. The script is OK but doesn't expand very well on the things it hints at, while the boxing scenes never get that exciting (although perhaps this is a strength). What makes it better than the sum of its parts though is a strong performance from Rodriguez delivering a down to earth performance that manages to be defensive and vulnerable at the same time, matched by a gritty tone to the direction throughout. Flawed and nothing special but its good points are enough to make it worth seeing.",
         "Casting unknown Michelle Rodriguez as Diana was a stroke of genius. She's perfect. Her acting inexperience actually works in her favor. We've never seen her before so it really feels like her story. She also brings across genuine toughness. This works against her though, because we never doubt her. You never have to cheer for her to win because she never goes up against any fighter we don't think she can beat. So as a boxing movie, it fails. Then again, this isn't really a boxing movie. How do you make a movie about a girl who wants to be a boxer that isn't a boxing movie? You don't. But Karyn Kusama has anyway. Like many indie films, \"Girlfight\" defies classification or genre and stands on its own as folklore that could darn near happen in real life. Diana is doing poorly in school. She beats up people she doesn't like (all the other girls in her school for example). She doesn't fit in. Her father is forcing her kid brother Tiny to learn to box so he can defend himself when things get tough. He gives Tiny money for his boxing sessions and gives Diana nothing, as if she has no need to defend herself, nor anything worthwhile to make of her life. Tiny wants to go to art school (cliche', yuck), so he gives up his boxing allowance to Diana, who actually wants to box. Things get complicated when Diana falls for another boxer, Adrian (Santiago Douglas), who's looking to turn pro. From there the story winds down toward the inevitable...the two meet in the amateur title fight. What left me cold was that I never found any of this all that interesting. It's all just a bit too believable. Kids with tough lives growing up in rough urban areas fall back on sports. A lot of professional boxers have risen from these circumstances. The mental and physical toughness this upbringing requires lends itself to a game like boxing, where anger is your friend. So this time it's a girl. Big deal. Or there's another position to take: finally, a boxing movie about a girl. Women's boxing has been around a long time. The brutality we usually see in boxing films is replaced here by discussions of people's their lives and their feelings. The whole fighting thing is used as a platform from which to paint a larger picture. Respect. Overcoming adversity. Self-discovery. I recommend \"Girlfight\" because it has a good spirit and is an example of some great work by a first time director. The dialogue never rises above soap opera quality, but the story itself actually changed my view on some things. Yes, the world now seems like a better place. A film did that. Grade: B-",
         "I was not expecting the powerful filmmaking experience of \"Girlfight\". It's an Indie; low-budget, no big-name actors, freshman director. I had heard it was good, but not this good. Placed in a contemporary, ethnic, working-class Brooklyn, Karyn Kusama has done an extraordinary job of capturing the day-do-day struggles of urban Latinos. Diana, the protagonist, is seething with anger and lashes out at her high school peers, getting in trouble with the school and her friends. She is being raised by her single father, who appears to love her and her brother, but applies a strict, sex-based double standard on his children. The father's double standard is illustrated by the fact that Tiny, the brother, is taking boxing lessons at the local gym, but Diana is denied similar pursuits. On an errand to the gym to meet Tiny, Diana is captivated by boxing. Tiny doesn't like boxing, so he and Diana trade places; he gets the money from Dad then gives it to Diana to take the lessons in his place. This is actually a feel-good movie, as Diana grows and learns about herself through boxing, meets a guy, and addresses some very serious issues head-on. There's no giggly, 'everything that can go right does go right' resolution a la \"Bend It Like Beckham\". The reality and attendant personal issues are too big for pat resolutions, but in my opinion, \"Girlfight\" is a better and more satisfying film for it."
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Green/Renzi",
         "Independent Film Channel (IFC)"
      ],
      "summaries": [
         "At 18, Diana has a chip on her shoulder; she's close to expulsion from high school for fighting, her mother is dead, her dad is surly, the popular girls at school set her teeth on edge, she knows men can cause pain. When she picks up her younger brother at a Brooklyn gym where he boxes to please his father, she decides she wants to train. Hector, a coach, reluctantly agrees to teach her. It's soon clear to him that Diana has talent; he pushes her. She spends time with another young fighter, Adrian, who has a girlfriend, but Diana intrigues him and stirs real feelings he tries to articulate. She, too, must accommodate her toughness and ironic detachment to her feelings for him.",
         "Diana, without her father knowing it, trains as a boxer and achieves impressive success, blazing new trails for female boxers."
      ],
      "budget": 1000000
   },
   "movielensId": 3915,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-05-01",
      "dvdReleaseDate": "2001-03-27",
      "directors": ["Karyn Kusama"],
      "runtime": 110,
      "movieId": 3915,
      "title": "Girlfight",
      "mpaa": "R",
      "actors": [
         "Michelle Rodriguez",
         "Jaime Tirelli",
         "Paul Calderon",
         "Santiago Douglas",
         "Ray Santiago",
         "Víctor Sierra",
         "Elisa Bocanegra",
         "Herb Lovelle",
         "Thomas Barbour",
         "Shannon Walker Williams"
      ],
      "imdbMovieId": "0210075",
      "originalTitle": "Girlfight",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "ZmMgPEcfwyQ",
         "XeQM3-g_aRY"
      ],
      "plotSummary": "Diana Guzman begins to train as a boxer and achieves impressive success, blazing new trails for female boxers, all while keeping it a secret from her father.",
      "tmdbMovieId": 19348,
      "avgRating": 3.5,
      "releaseYear": "2000",
      "numRatings": 838,
      "posterPath": "/h9w0s4M7UAT6yMFv1Qw0Gp5qx9C.jpg"
   }
}