{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "pop star",
            "id": 3490
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "surf",
            "id": 9828
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "beach movie",
            "id": 188583
         }
      ],
      "imdb_id": "tt0057887",
      "video": false,
      "title": "Bikini Beach",
      "recommendations": [
         26483,
         26879,
         27376,
         53617,
         38347,
         26484,
         84840,
         63083,
         38471,
         24512,
         26477,
         38463,
         61892,
         33394,
         38472,
         38470,
         3052,
         33393,
         42789,
         121716
      ],
      "backdrop_path": "/gmDzOnQ2U46PVvXSEPzGXQMWVXE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frankie",
               "gender": 2,
               "credit_id": "52fe46fa9251416c9106631d",
               "name": "Frankie Avalon",
               "profile_path": "/irGdUt04yfbwCioPYXBQHgwiWck.jpg",
               "id": 22092,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dee Dee",
               "gender": 1,
               "credit_id": "52fe46fa9251416c91066327",
               "name": "Annette Funicello",
               "profile_path": "/6nqrBDFDvjpVdrZS1RjfX9rTJ7S.jpg",
               "id": 82777,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "South Dakota Slim",
               "gender": 2,
               "credit_id": "52fe46fa9251416c9106632b",
               "name": "Timothy Carey",
               "profile_path": "/6wTL7aAjJflARVwR9giIIQSJhLs.jpg",
               "id": 2758,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Vivien Clements",
               "gender": 1,
               "credit_id": "52fe46fb9251416c91066341",
               "name": "Martha Hyer",
               "profile_path": "/pOIgxU2G7ZfCEN2fTOZhsEsoodM.jpg",
               "id": 16759,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Big Drag",
               "gender": 2,
               "credit_id": "52fe46fb9251416c91066345",
               "name": "Don Rickles",
               "profile_path": "/h5BcaDMPRVLHLDzbQavec4xfSdt.jpg",
               "id": 7167,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Eric Von Zipper",
               "gender": 2,
               "credit_id": "52fe46fb9251416c91066349",
               "name": "Harvey Lembeck",
               "profile_path": "/ylpix3VG43GY9D2kkxOxcR5FvSI.jpg",
               "id": 9109,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Himself (as Little Stevie Wonder)",
               "gender": 2,
               "credit_id": "52fe46fb9251416c9106634d",
               "name": "Stevie Wonder",
               "profile_path": "/wtuWq8CCBxpEXqvKevsXRQ14HSs.jpg",
               "id": 18746,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Sniffles",
               "gender": 1,
               "credit_id": "58f43001c3a36807fd0195bc",
               "name": "Delores Wells",
               "profile_path": "/kubmKf5ZAh7agOswtGUngPB4ClS.jpg",
               "id": 1243732,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Johnny",
               "gender": 2,
               "credit_id": "594a0b1792514145af008227",
               "name": "John Ashley",
               "profile_path": "/zICZ6S10MdwPtgrhD8A2M2MZja4.jpg",
               "id": 8331,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Deadhead",
               "gender": 2,
               "credit_id": "594a0b1fc3a36861db008ce8",
               "name": "Jody McCrea",
               "profile_path": "/8KWkYSdbO5wAwjLOXiuW1TRIFfb.jpg",
               "id": 148602,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Candy",
               "gender": 0,
               "credit_id": "594a0b2bc3a368613c006e39",
               "name": "Candy Johnson",
               "profile_path": "/rTcMFi8fAeaSoOT88xYLrD0j25C.jpg",
               "id": 1836715,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Animal",
               "gender": 1,
               "credit_id": "594a0b39c3a368617e00739e",
               "name": "Meredith MacRae",
               "profile_path": null,
               "id": 160580,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Donna",
               "gender": 1,
               "credit_id": "594a0b46c3a36861cb0089d9",
               "name": "Donna Loren",
               "profile_path": "/voVnSN9gjaaQtZnQxwdNhWuXsyp.jpg",
               "id": 148604,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Harvey Huntington Honeywagon",
               "gender": 2,
               "credit_id": "594a0b5a9251414582008000",
               "name": "Keenan Wynn",
               "profile_path": "/vKRcpt50Eh9AQ6yi9umy1YFZWyf.jpg",
               "id": 4966,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Lady Bug (voice)",
               "gender": 1,
               "credit_id": "594a0b7cc3a368613c006e82",
               "name": "Elizabeth Montgomery",
               "profile_path": "/pCbOD3ftWU8wBoY8kBGQ4U8DGTh.jpg",
               "id": 43975,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Clyde",
               "gender": 0,
               "credit_id": "5a3851810e0a264cc41e7cc3",
               "name": "Janos Prohaska",
               "profile_path": null,
               "id": 1214907,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Art Dealer",
               "gender": 2,
               "credit_id": "5a3851a50e0a264cbc1fb25a",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46fa9251416c91066323",
               "name": "William Asher",
               "profile_path": "/tZw2tQwUHBTgwNjR0lWpdzliRAr.jpg",
               "id": 95526,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fa9251416c91066331",
               "name": "William Asher",
               "profile_path": "/tZw2tQwUHBTgwNjR0lWpdzliRAr.jpg",
               "id": 95526,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fa9251416c91066337",
               "name": "Leo Townsend",
               "profile_path": null,
               "id": 95527,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fb9251416c9106633d",
               "name": "Robert Dillon",
               "profile_path": null,
               "id": 66919,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.623489,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39113,
      "vote_count": 10,
      "budget": 0,
      "overview": "A millionaire sets out to prove his theory that his pet chimpanzee is as intelligent as the teenagers who hang out on the local beach, where he is intending to build a retirement home.",
      "similar": [
         449176,
         57214,
         272693,
         8363,
         9880,
         43923,
         308369,
         286565,
         1581,
         4951,
         9377,
         37735,
         10147,
         2108,
         8193,
         315635,
         277217,
         222935,
         10229,
         634
      ],
      "original_title": "Bikini Beach",
      "runtime": 99,
      "poster_path": "/ntBYSb9O1TWWOwv2Mh3aux9ouJH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "American International Pictures (AIP)",
         "id": 9266,
         "origin_country": ""
      }],
      "release_date": "1964-07-22",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": "/dIrrW4QqenLKxKDlt0AbPVjSO1E.jpg",
         "name": "Beach Party Collection",
         "id": 338327,
         "poster_path": "/kIKGCP58y67SUvIA7qOIO8zL9nT.jpg"
      },
      "tagline": "It's where every torso is more so, and bare-as-you-dare is the rule!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["William Asher"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "William Asher",
         "Leo Townsend"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057887/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMzMwMzEwNF5BMl5BanBnXkFtZTYwMTY0NDc4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Frankie Avalon, Annette Funicello, Martha Hyer | See full cast and crew »"],
      "reviews": [
         "We red-blooded males who followed Annette Funicello's career from the time she was a nubile Mousketeer will be especially enamored of \"Bikini Beach,\" a superior entry in the, admittedly, mediocre \"Beach Party\" series. For once, Annette gets to play smart, sexy and slightly dangerous, possessing more than a passing interest in sex. Gone, thank goodness, is her usual \"Doris Day with mild PMS\" persona. I have a strong suspicion this is closer to the \"real\" Annette, here. I certainly hope so. Even Annette's singing is very good. I wish AIP would've sprung for the bucks to give \"Bikini\" better choreography. Annette, a trained dancer would have impressed even more. Annette's swimsuit is even more revealing than usual, about as close to a bikini as \"Papa Disney\" would allow her to wear. While the script, as usual, plays as if it were cribbed from the back of a cereal box, the gentle ribbing of British rock stars, modern art and drag racing are a welcome change from the usual \"Beach Party\" dross. Martha Hyer is along and provides some classy, mature-sexy glamor. \"Bikini\" even has a cameo by a very young Stevie Wonder. While Frankie Avalon won't win any acting awards, his alter-ego, \"Potato Bug\" is certainly a less annoying character than Mike Meyers' execrable \"Austin Powers\". Even Don Rickles is along, playing a character named \"Big Drag,\" a gentle pun on Don \"Big Daddy\" Garlits, a well-known drag racer and auto customizer of the era. Too bad, Rickles doesn't get to cut lose with his usual wise guy humor. Guess AIP was too cheap to spring for that. While no work of art, \"Bikini Beach\" is more than just watchable. It's actually, at times, enjoyable. I give \"Bikini Beach\" a weak \"6\".",
         "Annette Funicello is probably the most over-dressed beach bunny to ever hit the sands, but she's a stitch in her scenes with Frankie Avalon (as surfer Frankie) and pop-singer The Potato Bug (Avalon again, in a Beatle wig, funny teeth and English accent). Their repartee makes this a charming piece of Americana, but the thing is so stuck in a sterile time-capsule it's nearly impossible to believe that teenagers once got a charge from it. Drag-racing is the newest craze, and the beach gang gets shown up once Keenan Wynn puts a chimp successfully behind the wheel of a hot rod. For racing aficionados, we get a glimpse of the Mantra Ray, a $50,000 all-aluminum experimental \"dream rod\" with a King Cobra Ford engine. Annette poses prettily beside it... *** from ****",
         "O.K., O.K., I must take some exception with the two prior reviews in this thread. Bikini Beach has a lot more going for it those pieces implied. First, Frankie Avalon finally earned his AIP pay in this picture. While I really don't care for his 60s greaser college kid character in most of the other beach Party movies, here his dual roles (as \"Frankie\" the surfer who takes Dee Dee (Annette) for granted and as English invasion artist the \"Potato Bug\") are enjoyable to watch. He shows his reach as an actor far beyond what one would expect in a B movie like this. Secondly, for anyone interested in the history of drag racing, the strip scenes are interesting; textbook mid 60s drag environment. Few if any other examples of that are available in American film. Third, the music. Much better than what was in the movie that preceded it (\"Muscle Beach Party\" was one of the weakest of the series in terms of music) and many that followed. In Bikini Beach, you get to hear Annette sing a duet of a Styner-Hemrick ballad (\"Because You're You\") with Avalon that is good (if you have a copy of her Bikini Beach LP, her solo version of this song on it is arguably one of the most hauntingly beautiful recordings she ever made). The \"house club band\" at Big Daddy's in this film is the Pyramids, arguably one of the better now-forgotten west coast groups that played the role of the house band in these movies. Their instrumental version of \"Fingertips\" is classic early 60's surf instrumental. And a very young Stevie Wonder actually appears at the end. Fourth, the infamous Candy Johnson (the fringe-wearing, wild blond go-go dancer character who, with the swish of her hips, could put a man in a daze and send him flying through the air) finally comes of age in this movie, the club fight scenes actually feature her. As do the closing credits, where she fractures the camera lens at the end. Does all this make \"Bikini Beach\" a work of art? Heavens. no, but it's a heck of a lot better than Muscle Beach Party, Pajama Party, How to Stuff a Wild Bikini and the Ghost in the Invisible Bikini. In other words, out of the seven AIP Beach Party Movies, this is definitely in the top two or three (only bettered by Beach Blanket Bingo and arguably Beach Party).",
         "This is probably the best of the \"Beach Party\" films. The series pretty much hit its peak here and after this it was all downhill. Annette Funicello is her level headed best and Frankie Avalon is still her lunkheaded boyfriend who only can think about surfing. The thing I think is a little ironic about this film is the fact that Avalon in his portrayal of Potato Bug takes a swipe at The Beatles. Many forget that Avalon was one of the hottest singers in America until the \"Fab Four\" arrived the same year this film was released. After that it was downhill from there. The other shining moment in this film has to belong to Harvey Lembeck as the perpetually dimwitted leader Eric Von Zipper. This was his defining role and this film was his funniest yet.",
         "It's a colorful southern California summer of 1964. Frankie Avalon (as Frankie) hears nature calling him to Annette Funicello (as Dee Dee); but, she hears only wedding bells. In short order, the \"Beach Party\" gang goes ga-ga over popular English superstar Frankie Avalon (in a dual role, as \"The Potato Bug\"), arriving to fill out a romantic triangle for Mr. Avalon and Ms. Funicello. Newspaperman Keenan Wynn (as Harvey Huntington Honeywagon III) is also on hand; accompanied by his ape \"Clyde\" (Janos Prohaska); Mr. Wynn sets out to prove the \"sexually preoccupied\" teenagers are akin to monkeys. Adult beauty Martha Hyer (as Vivian Clements) thinks Avalon and company are just having a good time. Don Rickles (as Big Drag) and Harvey Lembeck (as Eric Von Zipper) help add drag racing and motorcycle fun. Returning more to the initial entry's \"Beach Party\" formula makes \"Bikini Beach\" an improvement over the series' recent dip into \"Muscle Beach Party\". The script is relatively snappy, and amusing. \"Clyde\" and \"Frieda\" have a great scene together; for example, when \"Clyde\" plays with Rickles' bird, in the dragster's beer joint (strictly for kids, Rickles explains, as he serves only beer and soda). Avalon's dual role is nicely played; and it is a timely, welcome nod to the mid-sixties musical \"British invasion\". Funicello, with a decent amount of navel displayed, is always charming; however, the added hair was unnecessary. The regular \"teenagers\" are attractive, and Ms. Hyer performs exceptionally well. Director William Asher uses bewitching wife Elizabeth Montgomery well; she reads the beginning of a newspaper article, and voices the French \"Lady Bug\". Despite the presence of Stevie Wonder, the Pyramids, and the Exciters; performing songs by the usual writers, the soundtrack is derivative, and unmemorable. Look for Gary Usher, Roger Christian, and Mike Nader among the \"Beach Boys\". Mr. Nader once told me he was in these movies, and now I see him. ****** Bikini Beach (7/22/64) William Asher ~ Frankie Avalon, Annette Funicello, Martha Hyer, Don Rickles",
         "This is a really fun movie with Frankie Avalon playing two characters, both of whom are trying to score with Annette, of course. The beach movies wouldn't have been the same without Harvey Lembeck's portrayal of Eric Von Zipper, as the most inept bike gang leader in the history of the movies. This character could be outwitted by a bar stool. The only odd point in the movie is at the end, at \"Big Drag's Pit Stop\". If you watch the bar scene at the end of the movie you'll notice that while Little Stevie Wonder is performing on stage, it shows a shot of him standing next to Don Rickles {as Big Drag} next to the stage, watching the show.",
         "One of the funniest beach party movies made by AIP (or anybody), with a great cast and pretty funny script with no story involved. Such as it is involves the arrival of the Potato Bug (Avalon in a double role), a John Lennon-esque Britisher that all the beach girls swoon over. Annette seems to decide the endless summer might never end, and jumps ship to the Bug. Frankie and the Bug have to drag race it out at Don Ricle's aptly named \"Big Drag\" -- Rickles is anything but a drag, constantly mugging with the lines they throw him and everyone else's too. Frankie Avalon's double performance may not go down in history as the modern equivalent of John Barrymore, but it's all good fun worth a hundred minutes of my lifetime. Looks like Mike Myers might have been watching this one pretty closely too.",
         "This sequel to MUSCLE BEACH PARTY (1964) is only slightly better: much of the teen cast returns, as well as Don Rickles (but, having now forsaken muscle-men for drag-strip racing) and even Stevie Wonder. We do get a number of new faces \u0096 eminent publisher Keenan Wynn (with a practiced simian in tow, he's intent on demonstrating that the youth of today have regressed to pretty much its primitive state!) and schoolteacher Martha Hyer constituting more or less the normal people (they start out as opponents but gradually come to understand and love one another), Harvey Lembeck as the overage leader of a motorcycle gang called Eric Von Zipper (actually, this character had already featured in BEACH PARTY [1963]: here, he's prone to falling victim, by his own hand, of Peter Lorre's paralysis-by-touch technique seen at the end of the previous film) and Timothy Carey (appearing very briefly as a pool-playing eccentric who has a werewolf, fitted with a leather jacket, for a sidekick!). There's even a second role for Frankie Avalon \u0096 doubling as a legendary mop-top and gap-toothed (essentially a cross between The Beatles and Terry-Thomas!) British singer/racer\u0085and, then, there's that great final gag involving Boris Karloff (seen a couple of times from behind throughout but only revealed at the very end as an art dealer interested in Rickles' abstract collection, quipping that he ought to tell his pal Vincent Price \u0096 noted for his taste in fine art and at the time also contracted to AIP \u0096 about it!). It's these quasi-surreal elements \u0096 including the monkey driving Wynn's car (to the recurring consternation of two traffic cops) as well as a dragster, and even doing a bit of surf\u0085but extending to the final credits as blonde-with-powerful-hips Candy Johnson is joined in her wild dance by an aged member of Wynn's old folks' home! \u0096 which render the film that much more enjoyable than its predecessor. Otherwise, we get a lot of the same shtick as before \u0096 though the beach scenes themselves are thankfully downplayed here; the climax, then, involves a Keystone Kops-type chase which culminates in yet another gratuitous bit of brawling slapstick (this time occurring at Rickles' pseudo-beatnik joint). Again, the songs are far from classics but, all in all, the film retains some interest (not least in the contribution of cinematographer Floyd Crosby, production designer Daniel Haller and composer Les Baxter \u0096 all of them synonymous with Roger Corman's contemporaneous horror films based on the writings of Edgar Allan Poe!) in particular for characterizing the transition between two trends in youth-oriented pictures i.e. the Juvenile Delinquent films of the 1950s and the Counter-Culture efforts (advocating drug use and Free Love) that would prevail soon after\u0085",
         "There's one thing it took me forever to notice about this series. In the early movies, they smoke and drink (beer, at least). In this one, \"Big Drag\" makes a point of saying that he doesn't sell liquor or cigarettes to the surfers. This might be before the phrase \"role model\" really took off, but maybe they were trying to get on the good side of parents. It might not be mentioned here, but \"Clyde\" the chimpanzee is played by Janos Prohaska, an actor who specialized in playing apes and monsters (he wore the same suit in a famous Outer Limits episode). One of Don Rickles best moments is when Keenan Wynnn is lecturing him - you really have to watch the frown on his face, because even for Rickles, it's hilarious. And Harvey Lembeck had some of his best moments of the series, when he becomes \"strange bedfellows\" with Wynn's character, then feels betrayed when Wynn sides with Martha Hyer - \"It's a regular Delilah and Simpson!\" I don't think anyone here has mentioned the cameo at the end, which, as usual, was by a horror actor. The man whose face is never shown (in other scenes) walks in during the fight between the surfers and the motorcycle gang, and it turns out to be Boris Karloff. He says a few lines, looks around at the fighting and says, \"Monsters.\"",
         "Evil Harvey Huntington Honeywagon III (Keenan Wynn of \"The Mechanic\") does not want teenage surfers cavorting around on the beach near his retirement home for oldsters and sets out to write a smear campaign against them until high school teacher Vivian Clements (Martha Hyer of Some Came Running\") comes to their rescue. Honeywagon complains that the girls run around half naked with boys in bathing suits and no chaperons in sight. Furthermore, Honeywagon plans to make them look bad with his talented chimpanzee Clyde (Janos Prohanska of \"Pussycat, Pussycat, I Love You\"), who can not only ride a surf board but also serves as a chauffeur for his wealthy but prudish boss. Incidentally, before his tragic death in 1972, Prohanska made a career out of dressing up in an obviously ersatz simian outfit on \"Gilligan's Island,\" \"Star Trek,\" and other shows. The wholesome teens in question are Frankie (Frankie Avalon of \"The Alamo\") and Dee Dee (Annette Funicello of \"The Misadventures of Merlin Jones\") and their gang, including Deadhead (Jody McCrea of \"Gunsight Ridge\")who are out of school for the summer. Meanwhile, a new arrival on the beach is the fabulous British rocker Potato Bug (Frankie Avalon in a dual role) and he turns Dee Dee on so she flirts with him. Of course, Frankie turns green-eyed and tries to figure out a way to get his gal back. \"Bikini Beach\" was the third entry in the BEACH movies that co-starred Frankie and Annette. No \"Beach Party\" movie would be complete with their nemesis, the infamous Eric Von Zipper (Harvey Lembeck of \"Stalag 17\") and his black-leather clad motorcycle gang the Rats and the Mice trying to thwart the antics of our heroes and heroines. The Potato Bug challenges Frankie to a drag race and Von Zipper and his cretins set out to sabotage the race. None of this sets too well with the raceway owner Big Drag (Don Rickles of \"Kelly's Heroes\") who dabbles in art. Basically, the plots for these sand, sun, and surf sagas revolved around Frankie and Dee Dee making each other jealous and their lame-brained pal Deadhead making a fool out of himself in his hillbilly hat. Believe it or not, it took three scribes to scrawl this hilarious nonsense. One of them was William Asher who directed over 100 episode of the classic Lucille Ball television comedy \"I Love Lucy.\" The bikini-clad babes are visual eye-candy and there is a cameo appearance by a famous horror movie star at the end. Mind you, \"Bikini Beach\" has all the depth of a bed pan, but the antics are so silly and stupid that you may wet yourself laughing. Perennial villain Timothy Carey of \"One-Eyed Jacks\" makes another appearance as pool hustler South Dakota Slim and Stevie Wonder does a sing-on as Little Stevie Wonder. Ironically enough, the Beatles were supposed to appear in \"Bikini Beach,\" but they hit it so big that their fee skyrocketed and Asher replaced them with a character that spoofed them. Indeed, \"Bikini Beach\" is an acquired taste like all the 1960 era teenage \"Beach\" party movies from American International Pictures. Incredibly, the Frankie & Annette beach party movies were a spin-off of the \"Gidget\" movies with the parents taken out of the mix. Despite the prominence of surfing in most of these movies, only Clyde the Ape surfs in this movie. Clearly, the name of the Keenan Wynn character was an movie inside joke because a honeywagon in Hollywood parlance is a toilet trailer."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["American International Pictures (AIP)"],
      "summaries": [
         "Millionaire Harvey Huntington Honeywagon III tries to prove to his colleague Vivian Clements that his chimp, Clyde, is more intelligent than American teenagers. Meanwhile Dee Dee is torn between Frankie and British recording star, the Potato Bug. Eric Von Zipper shows up to aid Harvey's anti-teen campaign. Big Drag shows up with others in a gag bit part.",
         "A millionaire sets out to prove his theory that his pet chimpanzee is as intelligent as the teenagers who hang out on the local beach, where he is intending to build a retirement home."
      ],
      "budget": 600000
   },
   "movielensId": 3922,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-07-22",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["William Asher"],
      "runtime": 99,
      "movieId": 3922,
      "title": "Bikini Beach",
      "mpaa": "NR",
      "actors": [
         "Frankie Avalon",
         "Annette Funicello",
         "Timothy Carey",
         "Martha Hyer",
         "Don Rickles",
         "Harvey Lembeck",
         "Stevie Wonder",
         "Delores Wells",
         "John Ashley",
         "Jody McCrea",
         "Candy Johnson",
         "Meredith MacRae",
         "Donna Loren",
         "Keenan Wynn",
         "Elizabeth Montgomery",
         "Janos Prohaska",
         "Boris Karloff"
      ],
      "imdbMovieId": "0057887",
      "originalTitle": "Bikini Beach",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["lL0zQklrDL0"],
      "plotSummary": "A millionaire sets out to prove his theory that his pet chimpanzee is as intelligent as the teenagers who hang out on the local beach, where he is intending to build a retirement home.",
      "tmdbMovieId": 39113,
      "avgRating": 2.46875,
      "releaseYear": "1964",
      "numRatings": 128,
      "posterPath": "/ntBYSb9O1TWWOwv2Mh3aux9ouJH.jpg"
   }
}