{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "fly the insect",
            "id": 181304
         }
      ],
      "imdb_id": "tt0053219",
      "video": false,
      "title": "Return of the Fly",
      "recommendations": [
         38125,
         61702,
         36456,
         44585,
         29058,
         40983,
         37626,
         831,
         35919,
         40761,
         23125,
         11815,
         28437,
         3165,
         99545,
         35911,
         28359,
         29484,
         42699,
         32652
      ],
      "backdrop_path": "/3yF5SNFatR463izWGMT6BtNkTZC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Francois Delambre",
               "gender": 2,
               "credit_id": "52fe46979251416c91059471",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Philippe Delambre",
               "gender": 2,
               "credit_id": "52fe46979251416c91059475",
               "name": "Brett Halsey",
               "profile_path": "/hjBkow0XlwQAwnDhV613YaMbK8G.jpg",
               "id": 31896,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Insp. Beecham",
               "gender": 2,
               "credit_id": "52fe46979251416c91059479",
               "name": "John Sutton",
               "profile_path": "/sTEet1qqS8onrjtARXpIOamh9DG.jpg",
               "id": 100589,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ronald Holmes, alias Alan Hinds",
               "gender": 2,
               "credit_id": "52fe46979251416c9105947d",
               "name": "David Frankham",
               "profile_path": "/nWfvSZ64kaHLnQmgL3No1ArAkra.jpg",
               "id": 16063,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Max Berthold",
               "gender": 2,
               "credit_id": "52fe46979251416c91059481",
               "name": "Dan Seymour",
               "profile_path": "/djciXDELxGKGsJoCwnHSW48GFJN.jpg",
               "id": 85943,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Cecile Bonnard",
               "gender": 1,
               "credit_id": "52fe46979251416c91059485",
               "name": "Danielle De Metz",
               "profile_path": "/wmTkN1FzRoDjXkLoO8x1fWMDUea.jpg",
               "id": 119734,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Granville (reporter)",
               "gender": 0,
               "credit_id": "52fe46979251416c91059489",
               "name": "Jack Daly",
               "profile_path": null,
               "id": 119735,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mme. Bonnard",
               "gender": 0,
               "credit_id": "52fe46979251416c9105948d",
               "name": "Janine Grandel",
               "profile_path": null,
               "id": 119736,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sgt. Dubois",
               "gender": 0,
               "credit_id": "52fe46979251416c91059491",
               "name": "Richard Flato",
               "profile_path": null,
               "id": 119738,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Cop",
               "gender": 0,
               "credit_id": "52fe46979251416c91059495",
               "name": "Gregg Martell",
               "profile_path": "/igBdlrADMn0RlKcmXlUsPeCchm7.jpg",
               "id": 103385,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Lt. MacLish",
               "gender": 2,
               "credit_id": "52fe46979251416c91059499",
               "name": "Barry Bernard",
               "profile_path": null,
               "id": 98497,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Insp. Evans",
               "gender": 2,
               "credit_id": "52fe46979251416c9105949d",
               "name": "Pat O'Hara",
               "profile_path": null,
               "id": 119739,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Priest",
               "gender": 0,
               "credit_id": "52fe46979251416c910594a1",
               "name": "Francisco Villalobos",
               "profile_path": null,
               "id": 119740,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe46979251416c910594a5",
               "name": "Joan Cotton",
               "profile_path": null,
               "id": 119741,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Gaston (watchman)",
               "gender": 2,
               "credit_id": "52fe46979251416c910594a9",
               "name": "Michael Mark",
               "profile_path": null,
               "id": 30163,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46979251416c91059467",
               "name": "Edward Bernds",
               "profile_path": "/n061MNq2CTLDyuxxy24jh8sthFk.jpg",
               "id": 34402,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46979251416c9105946d",
               "name": "Edward Bernds",
               "profile_path": "/n061MNq2CTLDyuxxy24jh8sthFk.jpg",
               "id": 34402,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5440f6ad0e0a262976001576",
               "name": "Bernard Glasser",
               "profile_path": null,
               "id": 133081,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5440f6ccc3a368053f001f08",
               "name": "Paul Sawtell",
               "profile_path": null,
               "id": 4681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5440f6da0e0a2628d900146a",
               "name": "Bert Shefter",
               "profile_path": null,
               "id": 4683,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5440f6ec0e0a2628d900146e",
               "name": "Brydon Baker",
               "profile_path": null,
               "id": 1088146,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5440f6f80e0a2628fb00150d",
               "name": "Richard C. Meyer",
               "profile_path": null,
               "id": 9584,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.899241,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38126,
      "vote_count": 41,
      "budget": 0,
      "overview": "Fifteen years after his father's experiments with matter transmission fail, Philippe Delambre and his uncle François attempt to create a matter transmission device on their own. However, their experiments have disastrous results, turning Philippe into a horrible half-man, half-fly creature.",
      "similar": [
         1694,
         3034,
         9426,
         3035,
         11815,
         9738,
         52520,
         384521,
         300668,
         126889,
         399055,
         336843,
         1927,
         9383,
         22825,
         9667,
         4961,
         18111,
         8078,
         1724
      ],
      "original_title": "Return of the Fly",
      "runtime": 80,
      "poster_path": "/kydIs26KGNsPtvj5QQ9hrsSklj8.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Associated Producers (API)",
            "id": 4141,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1959-07-01",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/1MMTGpmm0E9yXRTNyW0YebAs66S.jpg",
         "name": "The Fly (1958 series)",
         "id": 123213,
         "poster_path": "/if9PkF46yCeMp9WTYhUOjxnytAt.jpg"
      },
      "tagline": "Out of the World of Atomic Mutation It Rises - With the Dread Curse of the Father Upon It!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edward Bernds"],
      "runtime": 80,
      "synopsis": "The movie opens with title and credits shown over a stark white background and one solitary fly cleaning itself. It flies away and we zoom in on a graveside service for Helene Delambre. It is pouring rain and the handful of mourners hold umbrellas. A priest (Francisco Villalobos) conducts last rites at the graveside. Francois Delambre (Vincent Price) remembers his sister-in-law. His nephew, Philippe Delambre (Brett Halsey) stands in the pouring rain grieving for his late mother. Standing outside is Inspector Beauchamp (John Sutton). He was a member of the team investigating the death of Andre and is privy to the terrible family secret. The service concluded, everyone walks slowly away from the flower covered casket. A nosy reporter, Granville (Jack Daly) intrudes on Francois and Philippe as they walk to their car. Granville takes exception to being ignored and presses his inquiry about aspects of Andre's death. Beauchamp notices the hostile exchange and steps up when Philippe grabs the reporter. Beauchamp warns the reporter to cease such tactics. But Granville accuses, \"Well, Inspector Beauchamp, you were part of that big cover-up, weren't you? This is going to make nice reading, I promise you!\" The reporter storms off and Beauchamp walks over to talk to Francois. Francois and Philippe get into the mid-1950s Chrysler Imperial Limousine, and drive off. Philippe asks his uncle, \"Why was mother accused?\" Francois refuses to discuss the matter, but Philippe persists. He warns his nephew, \"If I tell you, Philippe, it will haunt you for the rest of your life.\" Philippe replies, \"Tell me. I've a right to know.\" Francois relents and orders the driver to take them to the old foundry of Delambre Freres. Francois escorts his nephew into the basement and is stopped by the night watchman, Gaston (Michael Mark). He asks the two men not to go into the lab, \"This place is cursed.\" He remembers, as he was the one to find Andre's crushed body in the hydraulic press. The cobwebbed lab is a shambles, the same as Andre left it. Philippe observes all the equipment is smashed. He also tells his uncle that his father was doing research in the transmission of molecular structures. Francois tells his nephew that Andre succeeded, \"Andre's machine actually disintegrated the molecules of solid matter and then reintegrated them again in a different place. Eventually, Andrew gained such confidence in his machine that he put himself through the disintegration-integration process. He successfully transmitted himself. Then on a tragic second attempt something went wrong. Unwittingly, he found himself in the disintegrator chamber but he was not alone. With him was a fly. The result was a creature with the body of Andre Delambre and the arm and the head of a fly.\" With Helene's help he used the hydraulic press to destroy all evidence of his head and arm. Philippe tells Francois he wants help to rebuild the equipment and vindicate his father's dream. Francois flatly refuses to help for two reasons: First, the safety of his nephew. And finally, financial. The company is nearly broke. Philippe vows to continue, with or without his uncle's help. Philippe enters the Electronic factory to talk to his friend Alan Hinds (David Frankham). He is also known as Ronald Holmes, an unsavory character with a criminal past, something Philippe will discover later to his regret. He invites Alan to pay him the same and start work immediately at his grandfather's house he inherited. They drive out to the mansion. Madame Bonnard (Janine Grandel), the housekeeper, admits Phil and Alan into the house. Cecile Bonnard (Danielle De Metz), the housekeeper's daughter, runs down to see the visitors. Philippe explains they were childhood friends. While tea is being prepared, Phil and Alan go downstairs to the wine cellar. Phil is converting it to a workshop and laboratory. It is a large room with plenty of space for expansion, privacy and the comforts of the main house. The old wine cellar is perfect for their work. While having tea, Phil hears the buzzing of a fly and freezes. He recoils slightly when he sees it crawling over sugar cubes in the tea service. All notice how visibly upset he has become. He admits he has always hated flies. Sometime later, they are in the lab. An electrical panel shorts out, an expensive item Phil admits he hasn't the money to replace. Alan agrees to defer salary until the project is a success. Francois stops by the house to see his nephew. He is annoyed and tells Philippe, \"I see you've gone ahead against my wishes.\" Phil asks his uncle for money, knowing Francois will say no. He plays his trump card and expresses his desire to sell his half of the company for cash to anyone. The gambit works and Francois agrees to finance the project, but he intends to supervise all aspect of the project to protect his headstrong nephew. Francois leaves and Phil and Alan drive into town. Phil drops Alan off. Alan immediately takes a taxi to an undertaker's shop. He walks through the entry parlor, through a room full of caskets on display, and into the office of the proprietor. Sitting at the desk, eating a large meal, is Max Barthold (Dan Seymour). The fat man addresses Alan Hinds as \"Ronnie\", but Alan correct his old business partner, \"No Ronnie. Alan Hinds, if you please.\" Max does not believe Alan has a business matter worth considering, but listens to the scheme. Alan wants Max to shop around for an interested buyer for the disintegrator-integrator. Alan asks for a 50-50 split. Max reminds Alan that he is wanted by the British police, so Alan reminds Max the last partnership deal that went sour ended in murder. When Alan exits the building, Phil drives up by chance and stops. Alan lies and tells Phil he was just visiting an old friend. A plain clothes policeman, Inspector Evans (Pat O'Hara) sees his quarry and follows. In the lab, Phil, Alan and Francois make final preparations for their first experiment on the completed machinery. An ashtray will be the first experiment. It is placed in the chamber. The machinery is fired up and the three men don eye protection goggles. In the receiving station the ashtray is perfectly transmitted. Sometime later, they are ready to try a live subject: a guinea pig. The animal is placed in the disintegrator cabinet and the machinery run. Unfortunately the receiving station contains a huge guinea pig--giantism is the problem. Philippe concludes, \"Must be in the amplitude control.\" They check the machine settings and review their notes. They fix the giantism and proceed to the next phase, \"Hold the subject in a disembodied state for a time then complete the cycle and bring the subject back.\" They cycle the machine for disintegration only, then agree to meet the next morning to bring it back. Alan eyes the documentation with lust. He must have a few key diagrams to offer as proof for sale to the highest bidder. A fly buzzing in the lab distracts Philippe. Alan kills the insect then shows Philippe, who recoils in revulsion. That evening, Inspector Evans enters the lab. Alan steals into the lab for a little espionage. He grabs a few documents and photographs them. He is unable to get into the storage cabinet. Evans attempts to arrest Ronald Holmes, now calling himself Alan Hinds. A chair thrown against an electrical panel causes confusion and Alan gets the upper hand. Alan disarms Evans and takes his keys. He puts the body in the machine and disintegrates it. Phil enters the lab and finds Alan inside the lab. Phil goes back to bed, but Alan decides he needs to get rid of the body permanently. He spots the car and decides to call Max for help in disposing of the body. Max is not eager to get involved. Alan runs the integration cycle to retrieve the body, but to his shock and horror Evans has the hands and feet of a guinea pig. The little guinea pig has human hands. Alan squishes it under foot, injuring it. To finish the job he drops some electronic equipment on the poor thing. He puts the dead creature in a box and wipes up the blood. He drags the body of Evans out of the lab and places him in the trunk of the policeman's own car. Alan drives away, but is seen clearly by Madame Bonnard from the window. Alan meets up with Max. He set the car to drive itself into a lake and rides back to the house in Max's car. While driving back Alan asks how the sale of the project is proceeding. He hands Max a roll of film. In the lab, Phil is waiting for his friend. A series of suspicious lies regarding noises and the blood stain from the guinea pig leaves Philippe unconvinced. Alan is not able to explain the handcuffs. Alan pulls a gun on Phil and demands he open the cabinet. A fight breaks out, but Alan manages to knock Phil out. Alan places Phil in the disintegrator cabinet and then starts the machinery. He deliberately captures a fly and adds it to the cabinet. The machine works and Phil disappears. Uncle Francois drives up and enters the house. He walks down to the lab as Alan grabs a handful of documentation and gets into the car. He shoots Francois and drives off. Madame Bonnard and Cecile help Francois into the house. Cecile helps Francois down to the lab. Police Sirens can be heard approaching. Francois tells Madame Bonnard to hold them off. He fires up the machinery assuming Phil was disintegrated, and re-integrates his nephew. Francois is horrified and Cecile screams. Philippe has returned with the enormous head of a fly. Three police officers rush down to the lab and break down the door. Philippe uses his fly arm to break the glass of the cabinet and makes his escape from the lab. Sgt. Dubois (Richard Flato) telephones the station to report the gunshot wound. He picks up the handcuffs. One of the other policemen chases Phil/Fly and fires at him with his police revolver. He is slowed down by his one fly foot. Sgt. Dubois hears the tiny voice of Philippe calling to Cecile for help. He spots the fly with the tiny human head of Philippe. He is shocked. Phil/Fly manages his escape. At the hospital, Francois is wheeled out of surgery to his room. Lt. MacLish (Barry Bernard) arrives and asks to speak to Francois. He confirms the handcuffs found belonged to Evans. A truck pulls up to a warehouse and Phil/Fly gets out. At the hospital, Francois is now awake. Dubois tries to question Francois, but he insists on speaking with Beauchamp. MacLish arrives and gets the same response to his inquiries. Dubois asks why Beauchamp is the only person he will speak to. Dubois asks if the secret involves a fly, then assures Francois he will contact Beauchamp at once. Max paces his funeral home. The phone rings. It is Alan/Ronnie and he asks about the money. Max is unhappy, \"I must say you've botched things thoroughly. There's no doubt of it. Young Delambre is looking for you.\" Beauchamp visits Francois in his hospital room. Francois tells him what happened to his nephew and reminds him the fly will be needed if his nephew can be returned to normal. A scraping sound piques Max's attention. He searches each room, but finds nothing. He returns to his office and closes the door. Phil/Fly is waiting for him. He smashes his way into the preparation room and kills the mortician. Francois is returned to the house and taken to a room upstairs to convalesce. Beauchamp asks to be taken to the lab. He searches until he finds the tiny fly with Phil's head. He places it safely in a jar. He tells Francois he caught it and fed it. He asks about lifespan and Francois tells him, \"Musca domestica, the common housefly, lifespan about three weeks.\" Alan/Ronnie drives over to see Max at the funeral parlor. He finds the dead body of Max on a gurney. He runs into the arms of Phil/Fly. Mortally wounded, Alan's body is stuffed into one of the caskets. A policeman (Gregg Martell) hears the commotion and finds Alan's gun. Alan tries to get out of the casket but collapses and dies. Beauchamp stops in to see Francois in his room. He reports that Alan Hinds and Max Barthold are both dead. Beauchamp suspects Phil/Fly will return to the house, and he does through Cecile's bedroom window. Her scream brings Beauchamp to her room. He orders Cecile to get Francois and help him to the lab. Beauchamp helps Phil/Fly to the lab, and then into the cabinet. He carefully retrieves the fly from the glass container and places it in the cabinet. Francois fires up the machine. They hope to untangle the two living creatures and return them to their original state. To their relief, Philippe is himself in the re-integrator cabinet. Cecile and Beauchamp help him out. Philippe and Cecile embrace. Francois hears the buzz of a fly and looks for the tiny insect. We close with a shot of the fly on the stark white background.",
      "writers": [
         "Edward Bernds",
         "George Langelaan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053219/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNDQyMTA1OF5BMl5BanBnXkFtZTcwNjk5MjUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent Price, Brett Halsey, David Frankham | See full cast and crew »"],
      "reviews": [
         "THE FLY was a fairly classy, atmospheric sci-fi movie with some horror overtones. It was fun and campy, but also somewhat disturbing in its depiction of a man losing his humanity, a theme which was explored more deeply in David Cronenberg's astonishing remake. RETURN OF THE FLY is basically a cheap follow-up which is better than it should be. This is mostly due to the always reliable Vincent Price, who returns as the brother of the scientist who became the fly-monster in the original. Here, he desperately tries to sway his nephew from following in his father's footsteps. The movie concentrates on the son's attempts to recreate his father's teleportation equipment with a hesitant Price helping out, then shifts gears as his other partner, a British ex-con, is discovered to be attempting to steal the research. This leads to a few misadventures with the teleportation machine resulting in a man becoming a human guinea pig (literally), and ultimately the son becoming a fly-monster himself. Shot in stark black and white (as opposed to the original's lush Technicolor), RETURN OF THE FLY has a sleazy, grindhouse quality to it. Whereas the original explored the horror of losing one's mind and physical being, this time it's basically just a \"monster roaming the countryside\" scenario, with any psychological or philisophical aspects thrown out the window in favor of cheap thrills. And while the make-up effects are somewhat improved upon, the ridiculous optical effect of the son's head on a fly's body is unintentionally funny. Overall, however, it's entertaining enough, and above average for the B-horror movies of the era, though it may be disappointing for fans of the original.",
         "BRETT HALSEY is one of those handsome young actors from the '50s who never quite made it to stardom, and following the trend of other such actors, he fled to Europe where he found a niche for a decade or so in adventure films. He was certainly a competent enough actor and it's a shame Fox never groomed him for major stardom. Nor did Fox have enough faith in this one to use technicolor (as they did for the original). As sequels go, it's just a fair job on an obviously shoestring budget--and basically, without giving any of the storyline away, it's a story of revenge. It's all suitably photographed in low key B&W lighting that gives it the proper atmosphere. The performers are capable enough--including Halsey, Vincent Price, John Sutton and Dan Seymour--but their material is scarcely worthy of their combined talents. Fans of this sort of science fiction will no doubt find it has a certain amount of interest. Anyone who enjoyed \"The Fly\" will want to see this and probably not be too critical of the shortcomings--although the special effects are not quite as harrowing as they could be. Summing up: Okay for a viewing, but not likely to be the kind of horror flick anyone will want to revisit.",
         "This is the kind of sequel that can be rather enjoyable as long as you don't hold it up to the standard of the original. It does bear the signs of a movie that was conceived primarily to capitalize on the popularity of its predecessor, and as a result it is hardly as carefully constructed. But as light entertainment, it works well enough. The first part of the movie connects things up pretty efficiently with the original story, and it's kind of fun to go back to André's wrecked lab, which looks just as it should. Brett Halsey plays André's son Philippe, who is determined to follow in his father's footsteps. While the setup could have led in a number of different directions, the story that actually follows puts an emphasis on action, and it uses the special visual effects rather more freely than in the original \"Fly\". From a scientific viewpoint, the whole premise of both movies is far-fetched at best, but in the original, you rarely thought about it because the story was so tightly constructed. In the sequel, the implausibility of the whole thing is harder to ignore. It doesn't detract that much from the entertainment value, but it is a noticeable difference from the first movie. Except for Vincent Price, the cast is new, but solid. While the production might have a couple of rough edges this time, most of it still looks good enough. Overall, with the right expectations this is a generally entertaining light feature.",
         "Phillippe the son of the infamous Dr. Delambre, who still has an air of mystery around his death, is now a young man who has taken over his father's work, which his uncle Francois wants him to forget about. Though he gets conned into backing the experiment and that's only if he can supervise the project, so it doesn't happen again. The experiment is going quite well, up until later on when Phillippe finds out his mischievous assistant has betrayed him, as he's secretly selling the idea of the teleportation device to another backer. So, to stop the word getting out, his assistant provides him with the same fate that his father had fought. Now, it's a race against time for Francois and Inspector Beecham to save Phillippe from the same aftermath of his father. Right of the back of the original film, comes a rather quickie of a sequel that doesn't push any limits. Firstly, no way does it come close to the superior original, but as an automatic b-grade monster feature, it's provides enough rollicking fun. Well, when you got Price on show, how can you go wrong? What we get is a bland story structure that lacks an ounce of life and astuteness, though it does have a few inspired moments, but these are far and in between many inferior sequences that come off just plain ordinary with some confusing plot details. The original managed to work around the silly context, but here it tends accept it by working in laughable story turns and monster effects. Even the dialog seems more like schlock, without the savvy and witty dialog that made the first film naturally engaging. The performances are all but cold and lifeless, but with the obvious exception of Vincent Price. He just has a spellbinding presence that when the words roll of his tongue, it has a Shakespearean vibe, no matter how bad the lines were. Price's performance is definitely this film's anchor. The rest of the characters I didn't care for, as they are rather unsympathetic and foolish. There was just more attention to fabricating unpleasant and cheap thrills, which are more out of control with a monster out for revenge hook-line. It's more violent than its predecessor too. I give it credit that it's more exciting in its basic dementia of its creation, but hell the treatment of the story and effects were laughable. That's unintentionally, though. This one seems more serious, but it's outlandishly executed in a drab fashion. But ironically everything works out in the long run with a happy ending for all\u0085 well for the good guys. Now the effects are decent, but when it came to the fly's head on the human body. Why was it that huge!? It looks stupid! Sure, it looks even more hideous, but you got to be kidding, it was funny watching the guy running along while holding onto it, so it doesn't fall off. You could easily tell the guy was having trouble with it, even so when walking! They really out did themselves on that one. Another note was that the pacing is rather brisk, gladly. Also it does provide slight dose of suspense and atmosphere, but more so it's preoccupied in its second-rate chills and mayhem instead. The flick is shot in black and white, and it does look rather sharp and crisp in detail. Plus there's some showy photography and framework that adds a bit more creative eye to the wailing production. The story's actions on this occasion were just too ridiculous to take seriously with it getting more risible the further it goes, but it seems pretty unaware to all of that. It's not all that bad, but the quality is replaced by big chunks of camp that's more interested in wowing us with ludicrous action, rather then the strain it has on the characters and their relationships. Still, there's b-grade fun to be had here.",
         "This rushed sequel to 1958's classic THE FLY is actually more entertaining than the original thanks to a faster pace and a greater emphasis on action and chills. The original fly's son, Philippe, is now a brilliant young scientist in his own right. He seeks to reconstruct the teleportation device that erroneously turned his pops into a frightening (well, silly, actually) insect man. With the project a success, a crooked assistant -- in an apparent murder attempt -- teleports Philippe along with a fly (clever writing, I must say). Like father, like son, this bug man is out to terrorize. But maybe, just maybe the man within the beast can be salvaged. With decent performances from Brett Halsey and the returning Vincent Price, this 1959 outing deserves its own place on the mantle of great black and white horror entries.",
         "While the fly \"makeup\" is as ridiculous as in the original, it's got nothing on the guinea pig paws. Add in obvious, under-lining music, delayed reactions, a clumsy fly-man, some overacting, action reminiscent of the old \"Batman\" series, \"help me, help me\" revisited, some fly-staring, 50s special effects - the \"disintegrator-integrator\" machine of the old beep-beep type (you can imagine the sounds), not to mention the creatures themselves, is amusing as anything - and some rodent-squelching, and you got yourself laughs aplenty. The editing is really messy and ugly; there's much dead air in between, even though the film barely runs for 80 minutes! The camera-work is awkward as well. The cliché-filled dialogue is often amusing, intentionally or not, with some of the highlights being the \"if I tell you, it'll haunt you for the rest of your life\" exchange, the whole bad guy routine and \"the murderous brain of the fly\". The what? I don't think this was done tongue-in-cheek. It's basically the same story as in the original, which makes it seem redundant, but hey, it's mostly entertaining, so I guess that evens it out. Notice how I used the word \"mostly\".",
         "To be honest I've always thought the original Fly movie a decent effort but no great shakes - it keeps horror mainly off-screen for a tragic romance, and while it's stylish-looking and engaging Vincent Price gets very little to do. Here, at least, he has a slightly more central role. It may be a hasty knock-off but the sequel is a more traditional horror movie and fun to boot. Of course the Fly here - played by Brett Halsey as the son of the original transmigration inventor Andre Delambre - looks utterly silly, with a massive over-proportioned head that is unintentionally funny. What is often missed is the frequently mentioned problem of giganticism in the movie, which makes it perfectly logical I suppose. Several times characters say they've cracked the problem; the evidence here suggests not! The action has moved on about 15 years, and opens with the funeral of Helene Delambre. The movie incidentally is crisply photographed in black and white, and in no time at all we are back at Delambre Freres, scene of the original experiments. Even Michael Mark, the actor who carried his drowned daughter into the village way back in the original Frankenstein, pops up as the watchman, and Phillipe Delambre quickly expresses his determination to carry on in his father's footsteps. He, is, however, not particularly on the ball when choosing his assistants..... Along the way we get a human crossed with a Guinea Pig (yes, really!) and this time the script is clever enough to make sure the human/fly hybrid is no accident. It is not so clever in explaining how on earth The Fly knows of the existence of the dodgy undertaker, though! So, yep, the movie may be silly once the Fly gets loose, but it remains enjoyable. Turn your nose up if you wish, but there are many worse films than Return Of The Fly.",
         "Not as good as the first one. But it is still good. I watched this recently because I bought the box set(I have yet to watch Curse of the Fly but I will soon) a month ago. Now on to my review. If you are expecting the Fly to return, then you are going to be disappointed because he does not. It is about his son. His son turns into a Fly. The movie should be called The New Fly. Phillipe as a man/Fly his head is even bigger then Andre's in Part 1. This movie takes place 15 years after Part one. If the first one takes place in 1958(the year it was made) then that means that this one takes place in 1973. Funny because I do not recall seeing disco balls in this movie. LOL. Well this was shot in 1959. I enjoyed this movie. I think that Vincent Price does a better job of acting then he did in the first one. He actually has a bigger role in this one. I recommend this film. If you liked the first part then you will like the second part I believe. My overall rating is 7 out of 10 flies. Enjoy. P.S. The scene where Vincent Price faints is priceless.",
         "Following the death of his mother, Philippe Delambre (Brett Halsey) decides to continue the work his father began 15 years previous. His father's experiments in matter transference ended disastrously. Philippe promises his uncle, Francois Delambre (Vincent Price), he'll be more careful and not make the same mistake that took his father's life. But as luck would have it, Philippe is destined to the same horrible fate. Through a one in a million accident, he's turned into a half fly, half human. Though he wasn't able to help Philippe's father, maybe this time Uncle Francois can find the fly and save Philippe. Return of the Fly is a quick and cheap follow-up to The Fly. Though there are things to enjoy, it's something of a disappointment given the original. The sequel lacks the mystery of the first movie. In this one, we are expected to just accept the whole transference process and that a man can be turned into a fly. No suspense, no atmosphere \u0096 nothing. And what about the son Philippe meeting the same fate as his father? I called it a million to one accident \u0096 well it's probably more like a trillion to one. Can't the Delambre family get some pest strips or hire an exterminator or something? The notion of a fly getting in the transference machine twice is ridiculous. There are other problems (the fly special effects and the theft subplot for example), but these are the two things that bothered me the most. Oh, but it's not all bad. The acting is okay. I've never been much of a fan of Brett Halsey, but here he's actually good. Vincent Price is always enjoyable even when, as here, he doesn't have much of anything to do. Also, the scenes of the fly stalking his prey in the funeral home are effective. I'll admit that I jumped every time he popped out of the shadows. Finally, despite the movie's problems and shortcomings, it's still fairly fun. As I've written any number of times now, entertainment is the most important thing when it comes to a movie for me. And while I wasn't bowled over or anything by Return of the Fly, I still had a decent time with it.",
         "It's not as howlingly bad as Plan Nine From Outer SPace but there are plenty of laugh inducing effects to sing your fly claws into but what do expect from a teensy budget and a director that was used to doing The Three Stooges Episodes with Shemp.Most of the cast strives for dignity in the face of a script that was hurriedly written and probably uncared for even though you do get the standard over the top moments that were in just about every 50's sci-fi. The effects are legendarily bad and many folks(myself included) have a fondness for them. Where else are you going to see a guinea pig with tiny human appendages? Glen Danzig of Misfits fame even writes about it in a song Return Of The Fly. \"Return Of The Fly,with Vincent Price.You guinea pig,Return of the Fly,human hands and feet,Return of the fly.\" It's a lot of fun and one of my Saturday night TV chiller show faves as a kid."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Associated Producers (API)"],
      "summaries": [
         "Fifteen years after his father's experiments with matter transmission fail, Philippe Delambre and his uncle François attempt to create a matter transmission device on their own. However, their experiments have disastrous results, turning Philippe into a horrible half-man, half-fly creature.",
         "15 years after the events of \"The Fly,\" Andre's son does some transportation experimentation of his own."
      ],
      "budget": 225000
   },
   "movielensId": 3923,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1959-07-01",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["Edward Bernds"],
      "runtime": 80,
      "movieId": 3923,
      "title": "Return of the Fly",
      "mpaa": "NR",
      "actors": [
         "Vincent Price",
         "Brett Halsey",
         "John Sutton",
         "David Frankham",
         "Dan Seymour",
         "Danielle De Metz",
         "Jack Daly",
         "Janine Grandel",
         "Richard Flato",
         "Gregg Martell",
         "Barry Bernard",
         "Pat O'Hara",
         "Francisco Villalobos",
         "Joan Cotton",
         "Michael Mark"
      ],
      "imdbMovieId": "0053219",
      "originalTitle": "Return of the Fly",
      "genres": [
         "Drama",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["Zri0vfCwoS0"],
      "plotSummary": "Fifteen years after his father's experiments with matter transmission fail, Philippe Delambre and his uncle François attempt to create a matter transmission device on their own. However, their experiments have disastrous results, turning Philippe into a horrible half-man, half-fly creature.",
      "tmdbMovieId": 38126,
      "avgRating": 2.56836,
      "releaseYear": "1959",
      "numRatings": 373,
      "posterPath": "/kydIs26KGNsPtvj5QQ9hrsSklj8.jpg"
   }
}