{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0058440",
      "video": false,
      "title": "Pajama Party",
      "recommendations": [
         39113,
         29474,
         84840,
         26484,
         242097,
         43391,
         86343,
         53314,
         37441,
         43249,
         26477,
         26879,
         86192,
         82465,
         43045,
         250622,
         56767,
         19317
      ],
      "backdrop_path": "/zLEqXxnaDomuncIncQDP5AKl4qE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Go Go",
               "gender": 2,
               "credit_id": "52fe4872c3a36847f8167589",
               "name": "Tommy Kirk",
               "profile_path": "/30E79Tjibru53EWmXNmAddZSKlx.jpg",
               "id": 83130,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Connie",
               "gender": 1,
               "credit_id": "52fe4872c3a36847f816758d",
               "name": "Annette Funicello",
               "profile_path": "/6nqrBDFDvjpVdrZS1RjfX9rTJ7S.jpg",
               "id": 82777,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Aunt Wendy",
               "gender": 1,
               "credit_id": "52fe4872c3a36847f8167591",
               "name": "Elsa Lanchester",
               "profile_path": "/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg",
               "id": 2926,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Eric Von Zipper",
               "gender": 2,
               "credit_id": "52fe4872c3a36847f8167595",
               "name": "Harvey Lembeck",
               "profile_path": "/ylpix3VG43GY9D2kkxOxcR5FvSI.jpg",
               "id": 9109,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "J. Sinister Hulk",
               "gender": 2,
               "credit_id": "52fe4872c3a36847f8167599",
               "name": "Jesse White",
               "profile_path": "/5q5wzKTgFEzjYHYQybm1OHi6ivk.jpg",
               "id": 93664,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Big Lunk",
               "gender": 2,
               "credit_id": "52fe4872c3a36847f816759d",
               "name": "Jody McCrea",
               "profile_path": "/8KWkYSdbO5wAwjLOXiuW1TRIFfb.jpg",
               "id": 148602,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Chief Rotten Eagle",
               "gender": 2,
               "credit_id": "52fe4872c3a36847f81675a1",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "Helga",
               "gender": 0,
               "credit_id": "52fe4872c3a36847f81675a5",
               "name": "Bobbie Shaw Chance",
               "profile_path": "/k246iuQxGiZPiZajp7H09XgH9sA.jpg",
               "id": 1033087,
               "order": 7
            },
            {
               "cast_id": 1010,
               "character": "Pajama Girl",
               "gender": 1,
               "credit_id": "54ed99559251417965003a2b",
               "name": "Teri Garr",
               "profile_path": "/dG1PeN7MdRlP6ZeSeRmaGwSeUWd.jpg",
               "id": 8437,
               "order": 8
            },
            {
               "cast_id": 1011,
               "character": "Socum",
               "gender": 2,
               "credit_id": "590f6b29c3a36864a7022c69",
               "name": "Frankie Avalon",
               "profile_path": "/irGdUt04yfbwCioPYXBQHgwiWck.jpg",
               "id": 22092,
               "order": 9
            },
            {
               "cast_id": 1012,
               "character": "Big Bang The Martian",
               "gender": 2,
               "credit_id": "590f6b429251414e8d022fe8",
               "name": "Don Rickles",
               "profile_path": "/h5BcaDMPRVLHLDzbQavec4xfSdt.jpg",
               "id": 7167,
               "order": 10
            },
            {
               "cast_id": 1013,
               "character": "Head Saleslady",
               "gender": 1,
               "credit_id": "5916a61e92514156f502d269",
               "name": "Dorothy Lamour",
               "profile_path": "/7H76LKezXlQala1wGW0iVU8qHDF.jpg",
               "id": 83400,
               "order": 11
            },
            {
               "cast_id": 1014,
               "character": "Vikki",
               "gender": 1,
               "credit_id": "594a0bd89251414582008087",
               "name": "Donna Loren",
               "profile_path": "/voVnSN9gjaaQtZnQxwdNhWuXsyp.jpg",
               "id": 148604,
               "order": 12
            },
            {
               "cast_id": 1015,
               "character": "Fleegle",
               "gender": 2,
               "credit_id": "594a0be0925141459b007ea3",
               "name": "Ben Lessy",
               "profile_path": null,
               "id": 167926,
               "order": 13
            },
            {
               "cast_id": 1016,
               "character": "Candy",
               "gender": 0,
               "credit_id": "594a0beac3a368617e007457",
               "name": "Candy Johnson",
               "profile_path": "/rTcMFi8fAeaSoOT88xYLrD0j25C.jpg",
               "id": 1836715,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4872c3a36847f816757f",
               "name": "Don Weis",
               "profile_path": null,
               "id": 148601,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4872c3a36847f8167585",
               "name": "Louis M. Heyward",
               "profile_path": null,
               "id": 82562,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.92118,
      "production_countries": [],
      "id": 53617,
      "vote_count": 8,
      "budget": 0,
      "overview": "A Martian teenager sent to prepare for an invasion falls in love with an Earth girl.",
      "similar": [
         872,
         812,
         11224,
         224141,
         38757,
         10530,
         14128,
         16119,
         15121,
         11970,
         824,
         10020,
         11631,
         621,
         703,
         15969,
         3933,
         46195,
         196867,
         114
      ],
      "original_title": "Pajama Party",
      "runtime": 82,
      "poster_path": "/7aJ7Tjud1dKMptOe8XYpw4eiomv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1964-11-11",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/dIrrW4QqenLKxKDlt0AbPVjSO1E.jpg",
         "name": "Beach Party Collection",
         "id": 338327,
         "poster_path": "/kIKGCP58y67SUvIA7qOIO8zL9nT.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Weis"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Louis M. Heyward"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0058440/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MDE2MDAwMV5BMl5BanBnXkFtZTcwNzUwOTc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tommy Kirk, Annette Funicello, Elsa Lanchester | See full cast and crew »"],
      "reviews": [
         "While none of them would qualify as brilliant film-making, this is easily the best of the drive-in \"beach\" movies produced by American International Pictures between 1963-67. This is the only beach movie I've ever sat all the way through without looking at my watch, and the IMDb rating of 3.0 it has as of today's date is unduly harsh. One of the reasons Pajama Party is more enjoyable than the rest is the absence of Frankie Avalon. We only see the back of his head throughout the film, his character only being revealed in the closing segment. For once, Annette (I believe her character is called Connie is this particular outing) is not subjected to Frankie's rather sexist treatment; in the other films he expects her to be chaste and faithful to him alone while he looks at other women and studiously avoids any kind of committed relationship until the finale'. In Pajama Party, the Frankie character has never existed, and Connie instead falls in love with Go-Go, with the biggest obstacle in their relationship presented by the fact that Go-Go is a Martian sent on a scouting mission to precede the invasion of earth by Don Rickles and some other Martians up to no good. Tommy Kirk does pretty well with the awfully shallow part of Go-Go, his only weak point being the unfortunate ballad he has to sing in the convertible with Connie (driving down the highway with the top down, yet there is no wind or noise\u0085!). The entertainment value in these films today is their ability to provide us with escape into an easier, more innocent time. Those of you familiar with my Mrs. Astor reviews here on IMDb know this is usually my primary objective with any old movie. This film is one non-stop romp through an endless carefree teenage summer. The kids must fight for their right to party against invading Martians, con-artists, and of course quasi-Nazi Erick von Zipper and his Rat Pack, who in this film are outraged that the teens have left footprints on \"their\" beach (our writers must be running out of reasons to justify Von Zipper's existence by this point). Guest stars Dorothy Lamour and Buster Keaton add much to the movie. Ms. Lamour is wonderful as the manager of the local dress shop. Mr. Keaton frequently appears in these films as an Indian, he has a brilliant scene here with the perfume counter girl, which can be attributed more to his fifty years of comedic work than any fit of genius that might have been borne by the writers of 1960's beach movies. The real spark of life in Pajama Party is brought by guest star Elsa Lanchester, always an absurd delight, here she is the aunt of the Jody McCrea character\u0085he's always named Chunk or Hunk or Junk, in this one he's named Lunk. Our third set of bad guys, headed by the Maytag Repairman, are out to steal Aunt Wendy's millions, and she is a delightful airhead who manages to continually foil their plots without ever really being aware of their presence. The film is further populated by the usual band of teens, all of the American International beach films have more or less the same cast, including Donna Loren, a singer far more talented than the material she is given, and Candy Johnson, who must surely be the most violent go-go dancer in the history of the world. TRIVIA NOTE: It's interesting how a bit of trivia can get out into the movie fan community and be repeated by dozens of folk who apparently don't verify it first. While numerous sources credit Teri Garr's first movie appearance as being in the 1968 film \"Head\" starring The Monkees, she does in fact appear in 1964's Pajama Party. I recently heard TCM Host Ben Mankowitz state that Ms. Garr \"appears just to the right of Annette Funicello in every major scene\", a comment that I have also seen repeated verbatim on other IMDb reviews. Interesting, but untrue. Ms. Garr plays the second model in the fashion show sequence (which begins approximately 37 minutes into the film), but the character of Connie does not even arrive at the dress shop until the fashion show is over. Teri Garr can be seen dancing to Annette's right in the final musical number, Pajama Party, but this is hardly \"appearing to Annette's right in every scene of the movie\". You may also spot Toni Basil. She is the girl in the red bikini in the first dance sequence, and the girl in the silver bikini at the fashion show. Slow it down, you can tell it's her pretty easy by the shape of her face. In summation, if you're interested in beach movies or just want some fun post-Camelot escapist entertainment, Pajama Party is the best of the lot. It will keep you smiling and tapping your foot and rooting for those clean wholesome kids. I wished I could just hop into my giant yellow convertible and tool down to the beach for the summer without a care in the world.",
         "This was what passed for entertainment when I was a teen. Speaking of which, I saw very few, if any, actual teens in this production. Did see the Maytag man though: this guy always leaves me in stitches for some reason. How well I remember his portrayal of Honest John in a segment of \"Beverly Hillbillies\". As to exactly why I remember this so well is well beyond me, I just do. Another highlight of this film was Don Rickles, one of my all time fave comics. But the ultimate high point of this or any of the sand and surf epics is none other than Eric Von and his cycle Ratz. They are without peer and I'll fight to the death over this belief. Ok, not to the death, but I do love Von Zipper. I have seen several of the beach pictures and this may be the zaniest one yet....you stupids!",
         "American International Pictures at their goofy best, hitting a \"Beach Party\" high-point with this insane slapstick opus. Having seen all the \"Beach Party\" flicks (including \"Ski Party\" and \"The Ghost In The Invisible Bikini\"), I have to say this may be my favorite. Frankie Avalon is relegated to a cameo playing a Martian leader--in scenes tinted red!--but Annette Funicello is here, having trouble with a new beau who says he's from Mars. Annette is very appealing warbling the title cut poolside (she gets dunked!) or crooning \"Stuffed Animal\" to a colorful toy monstrosity who winks at her. There are some big laughs: Buster Keaton's battle with the perfume spritz girl, Dorothy Lamour getting a lesson in today's fashions, Susan Hart's slow shimmy making a volcano erupt, the kid who hates \"mush!\", and Elsa Lanchester flitting around the teenagers, casting caution to the wind (one of the bikers calls her an \"older doll\"). Fun stuff! *** from ****",
         "Walt Disney refugees Annette Funicello and Tommy Kirk star in this Beach Party sequel where you can tell by the title, the action moves in doors. No, not that kind of action, we were still under the influence of the Code. These plots almost defy description but Tommy Kirk is a Martian teenager named Gogo which seems like a perfectly good name to use in the California beach environment. Nevertheless when he teleports to Elsa Lanchester's house, she greets him with Gracie Allen type blasé and renames him George. She likes him better than her late husband's nephew Jody McCrea who cares about volleyball more than women and that's putting a crimp into a relationship with Annette. Add to this a trio of con-men living next door who know Elsa keeps her money, not in banks played by Jesse White, Ben Lessy, and Buster Keaton in an Indian suit. And of course Harvey Lembeck and his brain dead motorcycle gang and you've got a Beach Party film. Frankie Avalon appears here too, but only to communicate with Kirk with Don Rickles playing Avalon's assistant. Dorothy Lamour is here to, a women familiar enough with beach settings in her films as Lanchester's dress shop manager. Lanchester's only weakness is operating a dress shop where she sells the latest trendy teen styles at a loss. It's kind of fun to laugh at how dumb the Beach Party films are, but their enduring popularity is proved out by Baywatch and its long run in the Eighties and Nineties. And I'm sure we'll see something similar in the next generation. But this one will not tax the brain cells too much.",
         "I was shocked (SHOCKED!) that this movie rated only a three. I mean WTF? I consider all of the beach party movies as at least 6 or more stars, if for nothing more than sheer historical value. Add to that that these movies are definitely entertaining, then add in some now-nostalgic music and you have a wonderfully amusing bit of film. And does anyone realize that Annette Funicello was the original Disney teen queen? She was Britney Spears, Hilary Duff, and Miley Cyrus' original predecessor. If that's not worth a few stars, what is? Perhaps I am understandably biased, but I don't think I am being too unfair about this. This particular romp finds Tommy Kirk as a Martian scout sent to prepare the way for a Martian invasion. Annette is his reluctant love interest (she thinks he's nuts), and all the other usual clowns are here as well. If you like beach movies, you'll enjoy this one as well. If 60's nostalgia cinema doesn't float your surfboard, then you should stay away. Great flick!",
         "One slightly odd thing about this one is that it looks ahead to a lot of little or big things. In one scene, Tommy Kirk (meaning it literally) says, \"I'm from Mars.\" Annette Funicello says facetiously, \"Really? I'm from Venus.\" When you see that scene now, you can hardly help thinking of self-help books. Also, it has a wall safe that works just like an ATM (though this idea has probably appeared elsewhere ; I don't know). When Elsa Lanchester \"withdraws\" a lot of money from it, she looks at her late husband's portrait, and says very sweetly, \"You always were a thoughtful husband.\" Then for just a moment, she gives a \"knowing\" look at the camera. Also, ages before \"observational\" comedians (as far as I know) seized on this, it had a scene about a perfume saleswoman bothering someone by spraying perfume at them. Buster Keaton and the actress in the scene (I can't think of her name) had perfect \"timing\" (hardly surprising in his case) when they acted out this relatively tiny joke. The movie even has a tiny bit of what would have to be called satirical humor. In each of the \"Beach Movies\", the motorcycle gang didn't wear those \"Wehrmacht\" items, like so many movie Hell's Angels, but each movie showed, at their hangout, pictures of Hitler and Mussolini, and in between them, a picture of \"Von Zipper\" (evidently to make him look extra scary). When Ben Lessy goes looking for teenagers to plant in the wealthy widow's home (as part of their scheme), he finds the \"Rats and Mice.\" He says something like, \"You look like typical wholesome kids,\" and as he says this, you see them in their leather jackets and those photos on the wall behind them. And on a completely different level, there's Susan Hart's dancing scenes. I don't know about the rest of the movie, but I would challenge anyone to find anything remotely \"dated\" about the titillation in those. And of course, instead of \"AIP\" horror actors, this movie's cameo at the end was even more of an inside joke - Frankie Avalon himself. Even if I weren't completely prejudiced IN FAVOR of beach movies, I would still say this one has a lot going for it.",
         "I just watched this beach flick and I'm certain that the music in Rocky Horror was influenced by this awesome surf and skin flick. There's even a scene where Tommy Kirk has a \"Transducer\". The story is less than ridiculous and that makes it enjoyable camp from the summer in America before the Beatles. West Side Story it's not, but the dancing and music are so expertly snychronized you'll think the actors are computerized. Look for Buster Keaton as \"Cowabunga\", he steals the show!",
         "\"Beach Blanket Bingo\" reigns as the best of AIP's \"Beach Party\" series, but \"Pajama Party\" takes the runner-up spot. True, there's no Frankie, but Tommy Kirk does fine as a teenaged alien trying to understand the ways of Earthlings (the plot was obviously inspired by \"Visit to a Small Planet\"). Annette has one of her best songs with the hilarious \"Stuffed Animals\" number. The often under-used Susan Hart looks terrific, especially when her dancing causes a toy volcano to erupt. In short, \"Pajama Party\" is a very entertaining piece of nostalgia. It's a shame that Tommy Kirk and Susan Hart were both wasted in the later lame series entry \"Ghost in the Invisible Bikini\".",
         "Having recently discovered both Buster Keaton and Avalon/Funicello Beach movies, I decided to go on fancast.com and watch Pajama Party. Instead of Frankie, Annette is paired with first Jody McCrea-playing not Bonehead but a similarly characterized Big Lunk-and then her Disney co-star in the Merlin Jones pictures, Tommy Kirk, here playing a Martian named Go Go. Along the way there's Elsa Lanchester, Jesse White, Keaton with usual AIP partner Bobbi Shaw, Harvey Lembeck in his usual role as Eric Von Zipper, dancer Candy Johnson, singer Donna Loren in her usual single number, and Susan Hart-who was about to become Mrs. James Nicholson, co-founder of American International-in an alluring fringe-bikini role where objects explode or wither. Oh, and there's also Dorothy Lamour-a native of New Orleans from my current home state of Louisiana-in a number about old customs versus new with some choice words like \"sarong\". This movie is mostly a silly mess with some good songs and some funny moments like when Buster and a perfume lady (Luree Nicholson, James' daughter) keep spraying each other or when that chair keeps closing in on White or when Buster inadvertently gets onto Ms. Shaw's body (while she's wearing a towel, of course!). And how about all those alarms that Ms. Lanchester keeps turning off in order to get at her late husband's money? Or when Ms. Shaw keeps kissing different men with the red cap? Otherwise, not much makes sense and after a while, you want the whole thing over real quick. Still, Pajama Party is harmless and painless fun and the end credits, as always, provide some visual amusement.",
         "With David Winters as a choreorgraher, Annette provesshe can really dance! The title song \"Pajama Party\" done at poolside reminds me of the old Hullabaloo series! Alot of catchy tunes! Candy Johnson is back with her wild go go dancig, and Susan Hart s very sexy! The DVD is crystal clear! The AIP studios must have used first rate film in these movies! A real winner!!!"
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": ["American International Pictures (AIP)"],
      "summaries": ["Gogo, a Martian teenager, is sent to Earth to prepare the way for an invasion. The first Earthling he meets, one Aunt Wendy, is a rich widow who runs a dress shop catering to teenagers. Her nephew, Big Lunk, is a volleyball-loving guy with little interest in romance, which causes frustration for his girlfriend Connie. Naturally, Gogo meets Connie and they fall in love. Meanwhile, Aunt Wendy's shady neighbor and his gang concoct a scheme to part Aunt Wendy from her cash. Also meanwhile, the local motorcycle gang wants revenge on the volleyball players for... getting footprints on their beach. Somehow all the subplots come together at the pajama party."],
      "budget": 200000
   },
   "movielensId": 3924,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-11-11",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["Don Weis"],
      "runtime": 82,
      "movieId": 3924,
      "title": "Pajama Party",
      "mpaa": "",
      "actors": [
         "Tommy Kirk",
         "Annette Funicello",
         "Elsa Lanchester",
         "Harvey Lembeck",
         "Jesse White",
         "Jody McCrea",
         "Buster Keaton",
         "Bobbie Shaw Chance",
         "Teri Garr",
         "Frankie Avalon",
         "Don Rickles",
         "Dorothy Lamour",
         "Donna Loren",
         "Ben Lessy",
         "Candy Johnson"
      ],
      "imdbMovieId": "0058440",
      "originalTitle": "Pajama Party",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["jZmsiLU5YOw"],
      "plotSummary": "A Martian teenager sent to prepare for an invasion falls in love with an Earth girl.",
      "tmdbMovieId": 53617,
      "avgRating": 2.85326,
      "releaseYear": "1964",
      "numRatings": 92,
      "posterPath": "/7aJ7Tjud1dKMptOe8XYpw4eiomv.jpg"
   }
}