{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "bet",
            "id": 622
         },
         {
            "name": "horse race",
            "id": 643
         },
         {
            "name": "florida",
            "id": 1196
         },
         {
            "name": "hungary",
            "id": 1244
         },
         {
            "name": "card game",
            "id": 1317
         },
         {
            "name": "american dream",
            "id": 2355
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "cleveland",
            "id": 2357
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0088184",
      "video": false,
      "title": "Stranger Than Paradise",
      "recommendations": [
         1554,
         37997,
         11305,
         8284,
         15383,
         3121,
         8416,
         17295,
         934,
         10217,
         16642,
         776,
         216,
         25188,
         19426,
         1818,
         10403,
         9343,
         339,
         1859
      ],
      "backdrop_path": "/Ug80ZiiiXhpR7LUOLJVrBJygTb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Willie",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d8b",
               "name": "John Lurie",
               "profile_path": "/izPEjdTrWUy3gPEdJ8f2OOnBW3f.jpg",
               "id": 6394,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Eva",
               "gender": 1,
               "credit_id": "52fe4247c3a36847f8011d95",
               "name": "Eszter Balint",
               "profile_path": null,
               "id": 6395,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Eddy",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d99",
               "name": "Richard Edson",
               "profile_path": "/7YegwxrBppretnwGEEMxEI453Ef.jpg",
               "id": 6396,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Aunt Lotte",
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011d9d",
               "name": "Cecillia Stark",
               "profile_path": null,
               "id": 6397,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Billy",
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011da1",
               "name": "Danny Rosen",
               "profile_path": null,
               "id": 6398,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Man with money",
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011da5",
               "name": "Rammellzee",
               "profile_path": null,
               "id": 6399,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Airline Agent",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011da9",
               "name": "Tom DiCillo",
               "profile_path": "/epndh7usUrwI958G3Mbk6h4KXMU.jpg",
               "id": 6400,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Factory Worker",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011dad",
               "name": "Richard Boes",
               "profile_path": null,
               "id": 4811,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Poker player",
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011db1",
               "name": "Rockets Redglare",
               "profile_path": "/ytzTZMZifn86lpZhMCc8UhFbVz3.jpg",
               "id": 6401,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Poker player",
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011db5",
               "name": "Harvey Perr",
               "profile_path": null,
               "id": 6402,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011d91",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011dbb",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4247c3a36847f8011dc1",
               "name": "Sara Driver",
               "profile_path": null,
               "id": 6403,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4247c3a36847f8011dc7",
               "name": "Otto Grokenberger",
               "profile_path": null,
               "id": 6404,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011dcd",
               "name": "John Lurie",
               "profile_path": "/izPEjdTrWUy3gPEdJ8f2OOnBW3f.jpg",
               "id": 6394,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011dd3",
               "name": "Tom DiCillo",
               "profile_path": "/epndh7usUrwI958G3Mbk6h4KXMU.jpg",
               "id": 6400,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4247c3a36847f8011dd9",
               "name": "Jim Jarmusch",
               "profile_path": "/kCGt4RCjVyyhusGeKsZp97HAxfQ.jpg",
               "id": 4429,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4247c3a36847f8011ddf",
               "name": "Melody London",
               "profile_path": null,
               "id": 6406,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.891934,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 469,
      "vote_count": 150,
      "budget": 0,
      "overview": "Rootless Hungarian émigré Willie, his pal Eddie, and visiting sixteen-year-old cousin Eva always manage to make the least of any situation, whether aimlessly traversing the drab interiors and environs of New York City, Cleveland, or an anonymous Florida suburb.",
      "similar": [
         8065,
         639,
         101,
         1213,
         1429,
         594,
         9277,
         394117,
         553,
         241239,
         549,
         11260,
         9919,
         3116,
         2639,
         12994,
         4978,
         9517,
         152599,
         546
      ],
      "original_title": "Stranger Than Paradise",
      "runtime": 89,
      "poster_path": "/Ett7TAy9y5R0p08REDgErVmLPf.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [],
      "release_date": "1984-10-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Jim Jarmusch"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Jim Jarmusch"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088184/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2ODUxMjk5NV5BMl5BanBnXkFtZTgwODQ5NjYzNDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Lurie, Eszter Balint, Richard Edson | See full cast and crew »"],
      "reviews": [
         "Odd and inspiring. This film rings true with rich detail in its depictions of utter loneliness. Smoking many Chesterfields, watching television, playing solitaire, visiting Aunt Lottie, sightseeing at Lake Erie (for God's sake). It alters from tragic to comic from almost moment to moment, and often has a foot in both pools. Jarmusch is minimalist to the core with this one, and yet manages to pull off a solid story. A small black and white gem that deserves a larger audience.",
         "Reading over the comments so far, it seems that most people think this film is great, with a rare few criticizing it for being a boring 'student-film'. People, this is for sure not a film for those who've been brutalized by too much Hollywood cinema - it's a quiet movie that you absorb slowly. It's very well done and quite absorbing. Sure it makes me think of so-called student-films (my brother is in film school), but that's not to say it's not a damn good one. There's something to be said for beautiful photography (the black and white images go so well with the feelings of emptiness and coldness) and the search for a meaning in life. These people are desperately in need of meaning and affection, none of which they seem to be able to find - or give. This is a movie about that desperate search. And it's well worth seeing - for those with a bit of patience and artistic sensibility. It's a movie about emptiness for sure, but is by no means 'boring'. I'd give it 4/5 stars.",
         "Stranger Than Paradise, which put filmmaker Jim Jarmusch on 'the map' in the small but superlative crop of independent filmmakers of the eighties (he was the first, then came the Coen Brothers, then Spike Lee, and then culminating in the 90's with the 'new wave' of independent filmmakers). What he presents here is a unique little treatise on youth, on the subtle and disconnected qualities that go in life when you don't have much to do. In a way it's an existentialist film without many very serious questions to deal with story or even character-wise (except until maybe the last fifteen minutes in the \"Paradise\" segment). Like a French New-Wave film, to which Jarmusch was heavily influenced by (i.e. the gorgeous, grainy black and white photography by Tom DiCillo), he leaves more for the audience to ponder, as they go along on their journey. One of the things that Stranger Than Paradise has going for it is a sort of realism that, like and not-like a Wes Anderson film for example, is off-beat. Only here it is more of an urban sort of landscape and interiors that Jarmusch gives us with, along with its three principles. John Lurie as Willie is very good at having attitude when he needs it, but in reality is rather low-key in his 'hip-ness'. His cousin from Hungary pays him a visit (Eszter Balint as Eva, maybe too low-key at times, though appropriately observant of foreign territory). There is also his faithful companion Eddie, played in a great supporting tone and style by Richard Edson. The first segment of the film deals with her in New York. The second one has Eddie and Willie go to Cleveland to pay Eva a visit. Then in the third segment they go down to Florida to have some fun, only to have anything but. In other words, those looking for a film where a lot of things 'happen' may be disappointed, or just bored. I've seen the film twice now, and on the first viewing I was a little detached from what was going on on screen, which is just little things going on with the characters, like one would see in everyday life. But on the second viewing I somehow connected more with these characters, the youth that seem to drift needlessly along. The editing of the film is also the most simplistic, though highly effective, in adding to the disconnected quality of Jarmusch's direction- no cuts during dialog, just fading to black, fading up, fading to black, fading up (Jarmusch would continue this with Down by Law and Dead Man, though not as frequent or strategic). In fact, the whole film is rather deliberate in its style, but as the song that plays several times in the film \"I Put a Spell On You\" from Screamin' Jay Hawkins plays, it does work to bring a viewer in...or not. Like many in the \"art-film\" world, almost all of Jarmusch's films are either liked or not, and I think that's appropriate for his stories, which often deal with low-key characters dealing with unusual but either realistic or metaphorical situations. One thing I can say for certain, much like the French new-wave films inspired by it, it's imitated, but not equaled in its form.",
         "An excellent example of why independent films are so invaluable, `Stranger Than Paradise,' written and directed by Jim Jarmusch, is a bare-bones production that never would have found the light of day in the mainstream. Essentially a character study, the story is a glimpse into the lives of three people: Willie (John Lurie); his cousin, Eva (Eszter Balint), recently arrived in New York from Hungary; and Willie's friend, Eddie (Richard Edson). After a couple of weeks in the Big Apple with Willie, Eva moves to Cleveland to live with their Aunt; a year later, Willie and Eddie are off to visit her. One thing leads to another, and the trio wind up in Florida (the designated paradise of the title). Watching this film is like spending time with some people you know; the characters are real people, so much so that watching them becomes almost voyeuristic, the camera somehow intrusive, exposing as it does the private lives of these individuals. It succinctly captures their lack of ambition, the ambiguity with which they approach life, and the fact that they seemingly have no prospects for the future beyond whatever a lucky day at the track affords them. The action, such as it is, is no more than what you would find in the average day of someone's life. The dialogue is what drives the film, though frankly, nothing they have to say is very interesting. And yet, this is an absolutely engrossing film; sometimes amusing, at times hilarious, but mesmerizing throughout. The performances are entirely credible, and again, you never have the sense that these are actors, but rather real people who happen to have had some moments from their lives filmed and presented to the audience for perusal. Jarmusch has an innate sense of capturing the essence of the everyday and transforming the most simplistic and mundane events into refreshingly documented, worthwhile viewing. It's an inspired piece of film making, helped to some extent by the stark black&white photography that adds to the realism of the overall proceedings. The use of brief blackouts during transitions works effectively, as well as providing the film with a unique signature. Original music is by Lurie, but the highlight is the use of the song `I Put A Spell On You,' by Screamin' Jay Hawkins, used recurringly throughout the movie, and which exemplifies that special touch Jarmusch brings to his projects. And there's a superb bit of irony at the end that really makes this gem sparkle. The supporting cast includes Cecillia Stark (Aunt Lotte), Danny Rosen (Billy), Tom DiCillo (Airline Agent), Richard Boes (Factory Worker) and Rockets Redglare, Harvey Perr and Brian J. Burchill (as the Poker players). `Stranger Than Paradise' may not be to everyone's liking, but to those seeking an alternative to the typical Hollywood big-budget fare available, it just may fit the bill and provide a satisfying, entertaining experience. I rate this one 8/10.",
         "I just finished watching Stranger Than Paradise on DVD - the first time I'd seen it since its year of release. I'd always recalled the film with fondness, although I could never remember why I liked it. Several years after seeing the movie I came across the John Lurie soundtrack and bought it without stopping to listen, and been slightly taken aback by it. The haunting pieces were more emotionally esoteric than I expected, and it took some time for the album to grow on me. Seeing the movie again, I understand why. The only piece of popular music in the film is Screamin' Jay Hawkin's \"I Put a Spell on You\" and, although I had forgotten that it was there, I guess that I had expected the soundtrack to be more like those of mainstream movies and have songs and such-like. I think that Lurie's music is perfect in situ and, as I've said, the soundtrack has also grown on me as standalone pieces. The movie itself is a masterpiece. The black and white images present a starkness and a clarity that heightens the alienation of self in a land that was supposed to be the new hope for immigrants from a decaying old world. Instead we see Eva walking through a deserted ghost world of New York where the graffiti says \"Yankee go home\". America is only a dream, a collective vision of a better world; paradise somewhere on earth. As Willie and Eddie journey west after winning some money, we see that the supposedly beautiful city of Cleveland is cold and desolate with a frozen lake. The further trip to Florida ends in the middle of nowhere next to a bleak and windswept ocean. Paradise is still somewhere out of reach. I think that's why the movie appeals to me. It shows that the America of popular mythology - the home of the brave, land of the free, protector of the downtrodden, guardian of democracy in the free world - is merely a construct. Too many people these days believe in the child's fantasy of America being some paradise that Iraq and Afghanistan should emulate. Jarmusch reminds us that it is people who give meaning to a symbol, not the other way around. He allows for the ability of people to make their own meanings and evolve beyond the stagnation of popular culture. At a time I originally saw this movie I had recently left home and got my first job, moving from the country to the city, and maybe to some extent I identified with Eva - moving from Budapest to America. It was also my first taste of grownup film, if I recall correctly, and confirmed me with a lifelong fascination with the cinema. I have a lot to thank Jim Jarmusch for.",
         "Watched for the second time the other night, and was struck how formal this really is. Every scene is a single take, some static, some with very stylized camera movement (static shot up the street to an approaching car; pick up car and track it as it passes, static again as it drives off). Occasionally an actor wanders off screen to the right, despite the camera trying to keep up; just this slight effect, surrounded as it is by so much silence and stillness, is enough to produce a slight frisson of tension. Blackouts separate the scenes, but either ambient sound or music cues continue as transitions during the cuts. The main characters' costumes underline their alienation from the world around them. Judging from the props & surroundings, film seems to be set in contemporary (early-1980s) time. Willie and Eddie dress and act like late-Fifties/early-Sixties racetrack touts, and they seem most at ease in the retro living room of Aunt Lotte, who presumably left Hungary during that period. Eva's costumes likewise proclaim 'outsider,' though the dreary black she wears can signify either a refugee from East Europe or a jaded bohemian poseur. First viewing a number of years back, I thought the film was offhanded and casual, with not much going on. A second viewing changed my mind - the absolute minimalism of the plot and dialogue leave plenty of space to explore Jarmusch's technique, composition, etc. It made me laugh out loud a couple of times, too.",
         "Jarmusch was never much of a guy to dip in the mainstream; \"Ghost Dog: Way of the Samurai\" is about as Hollywood as you're going to get from him. His recent \"Coffee and Cigarettes\" might have alluded to his roots as an indie filmmaker, but its stories are monochromatic and offer little emotional variety save for the Albert Molina vignette. His best film might be this one, a miniature masterpiece that is underrated when compared to his other stuff. The basic premise of the film revolves around a New York immigrant from Eastern Europe, his goofy buddy, and his female cousin who comes to visit him and America as they jump from state to state. There isn't much of a plot for sure, but Jarmusch more than compensates for this fact by creating three distinct characters that manage to be sweet without resorting to cheap sentiment. These guys might be rude and frivolous at times, but they never lose their sense of embarrassed compassion, nor as a direct result their humanity as complete characters as well. There's a morose wit to all of these proceedings. All three actors truly seem to have a playful camaraderie, working the motions of a natural friendship with Jarmusch's direction that shows them at their happiest only to be disappointed again and again, like a kid getting clothes instead of video games at Christmas once more. This honest and easygoing subtext doesn't include undemanding Hollywood moments of syrupy tenderness or mawkish emotion. For once, the clichéd adage of characters writing themselves is probably true here, as the film has an almost improvised quality to it. Jarmusch gets the careful balance between static ugliness and a subtext of natural warmth just right. While the great heart of this film lies in its characterization, it's catapulted into greatness because of Jarmusch's quiet touch. In nearly every one of his films the director is obsessed with the awkward silences that make up nearly every relationship. He's much more revealing with the silences here, fleshing out character development in a car ride or while staring out at the blankness of snowy Cleveland. This brings me to my final point that Jarmusch again does with intelligence. When the characters move from city to city, they have a passionate belief that what they will find is something unbelievable. But the New York we see is a bunch of back alleys and graffiti. Cleveland is a blank white expanse, strangely vapid as opposed to pictorial. And Florida has to be the ugliest Florida ever depicted on screen, consisting mainly of a \"Welcome to Florida\" sign and a decrepit motel. While the main message is that life is often full of disappointments, that life is rarely full of transcendent moments, people can still connect with each other regardless of their surrounding environments. It's Jarmusch's best statement yet, and it's for these reasons this one must be seen even before even his fine \"Mystery Train.\" The film, essentially a three-character comedy, is also thankfully kept brief, becoming genuinely meaningful and moving as a result.",
         "\"Stranger than Paradise\" (1984): Jim Jarmusch's first film. Often listed as a \"comedy\" \u0096 and yes, I suppose there ARE a few oddly funny moments \u0096 for the most part I find it an intensely bleak film, empty of almost all life but for a few lone cruiser characters who are detached from everyone else. The photography is astoundingly beautiful black & white. They are almost shot as individual stills with minor movements in them, and divided by blatant black divisions, which one can think of as the black pages of an old photo album. The velvety rich blacks, grays, and whites, plus the composed \"still\" scenes, cause me to think Jarmusch was trained as a static, 2-D artist first. Just a guess. This film is NOT about acting, which is limited at best, but doesn't really need much. We observe an alienated set of scenarios which are only enhanced by the stiff, awkward exchanges and pauses of the characters, and the lack of movement in the camera work. Ambient sound adds to the gritty reality of emptiness. Funny or not, this is a low-key, lost-souls story of detachment and aimlessness.",
         "Yes, it's slow...yes, it's in black and white with minimal sets...and yes the acting is somewhat flat, but I still like this movie a lot! Perhaps it's Eva's dryness and her deadpan quality as she comes to the fabulous USA for the first time. Maybe it's the mid-80's Reagan era hopelessness that I can still remember...Eva ends up taking her cousin on an adventure he didn't expect and pulling him out of his dull life (to an even duller Cleveland!). It doesn't move fast, and it's not as witty as some films...but if you remember that this movie was made 10 years before the mega-indie rebirth.......Pulp Fiction, etc, it may give you some perspective...in 1983, amidst ET, the Star Wars Sequels, etc. etc. this film is a charming, if spare, breath of fresh air!",
         "The New World: The teenager Eva Molnar (Eszter Balint) arrives from Budapest, Hungary, and goes to the house of his cousin Willie, a.k.a. Bela Molnar (John Lurie) in a dangerous neighborhood in New York. Eva intends to travel to Cleveland to stay with her Aunt Lotte (Cecillia Stark), but the old woman is in the hospital and Eva has to stay with the idle Wille, who is absolutely indifferent to her. They spend their empty days smoking Chesterfield, watching television and playing solitaire and Eva befriends Willie's friend Eddie (Richard Edson). Then Willie and Eddie are connected to Eva and they miss her when she travels to Cleveland. One Year Later: Willie and Eddie win a large amount in the poker game and they borrow a car and travel to Cleveland to visit Eva. They spend a couple of boring days in the house of Aunt Lotte. Paradise: Willie and Eddie invite Eva to go on vacation in Florida. However they lose their money in the dog racing. Willie decides to bet their last money in the horse racing and they win money. Meanwhile Eva is wrongly taken by another woman and receives a large amount from a stranger. She leaves money for Willie and Eddie and goes to the airport expecting to travel to Europe, but there is only one flight to Budapest. Meanwhile Willie and Eddie seek her out in the airport. Will Willie find Eva? \"Stranger than Paradise\" is an ironic and weird tale of emptiness and boredom by Jim Jarmusch, filmed in black and white and divided in three segments (acts). There are funny moments, like for example, when Willie has a phone conversation with his Aunt Lotte and tells that Eva will put his life on hold since the guy spends the days smoking, watching television, playing solitaire and gambling in the horse racing. Then he misses Eva, probably the only different thing that had happened in his boring and empty life. In the end, it is hilarious when Eddie asks to himself: What will Willie do in Budapest? \"Stranger than Paradise\" is not for every audience but those viewers that also enjoy cinema as art. My vote is eight. Title (Brazil): \"Estranhos no Paraíso\" (\"Stranger in the Paradise\")"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cinesthesia Productions",
         "Grokenberger Film Produktion",
         "Zweites Deutsches Fernsehen (ZDF)"
      ],
      "summaries": [
         "A self-styled New York hipster is paid a surprise visit by his younger cousin from Budapest. From initial hostility and indifference a small degree of affection grows between the two. Along with a friend, they eventually end up visiting their aunt in the wastelands of Cleveland and then proceed to Florida where they lose all their money gambling before unwittingly gaining a fortune.",
         "The New World: The teenager Eva Molnar arrives in New York City from Budapest, Hungary, and visits her cousin Willie, A.K.A. Bela Molnar. Eva intends to travel to Cleveland to stay with her Aunt Lotte, but the old woman is in the hospital and Eva has to stay with the idle Wille, who is absolutely indifferent to her. They spend their empty days smoking Chesterfields, watching television and playing solitaire and Eva meets Willie's friend Eddie. Then Willie and Eddie are connected to Eva and they miss her when she travels to Cleveland. One Year Later: Willie and Eddie win a large amount in the poker game and they borrow a car and travel to Cleveland to visit Eva. They spend a few boring days in the house of Aunt Lotte. Paradise: Willie and Eddie invite Eva to vacate to Florida with them. Shortly after arriving there, they lose their money in dog racing. Willie decides to bet their last money in the horse racing and they win money. Meanwhile Eva is wrongly taken for another woman and receives a huge amount of cash from a stranger.",
         "Willie is a pre-slacker-era slacker living in New York City. His cousin Eva from Hungary visits him for several days before going to Cleveland to stay with their Aunt Lotte. A year later, Willie and his friend Eddie take a road trip to Cleveland to visit Eva and Aunt Lotte."
      ],
      "budget": 90000
   },
   "movielensId": 3925,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1984-10-01",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["Jim Jarmusch"],
      "runtime": 89,
      "movieId": 3925,
      "title": "Stranger Than Paradise",
      "mpaa": "",
      "actors": [
         "John Lurie",
         "Eszter Balint",
         "Richard Edson",
         "Cecillia Stark",
         "Danny Rosen",
         "Rammellzee",
         "Tom DiCillo",
         "Richard Boes",
         "Rockets Redglare",
         "Harvey Perr"
      ],
      "imdbMovieId": "0088184",
      "originalTitle": "Stranger Than Paradise",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["MwefGellnhk"],
      "plotSummary": "Rootless Hungarian émigré Willie, his pal Eddie, and visiting sixteen-year-old cousin Eva always manage to make the least of any situation, whether aimlessly traversing the drab interiors and environs of New York City, Cleveland, or an anonymous Florida suburb.",
      "tmdbMovieId": 469,
      "avgRating": 3.88343,
      "releaseYear": "1984",
      "numRatings": 1334,
      "posterPath": "/Ett7TAy9y5R0p08REDgErVmLPf.jpg"
   }
}