{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shrew",
            "id": 53994
         },
         {
            "name": "flesh eating",
            "id": 162521
         },
         {
            "name": "poverty row film",
            "id": 207405
         }
      ],
      "imdb_id": "tt0052969",
      "video": false,
      "title": "The Killer Shrews",
      "recommendations": [
         22727,
         22749,
         31393,
         34077,
         34078,
         38269,
         43248,
         23125,
         3165,
         83413,
         85682,
         38946,
         27625,
         38750,
         89751,
         83409,
         29468,
         43715,
         31244,
         27717
      ],
      "backdrop_path": "/7pmiDey2dzffaQQAXXW4m8B12E2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Thorne Sherman",
               "gender": 2,
               "credit_id": "52fe462dc3a36847f80f0eb9",
               "name": "James Best",
               "profile_path": "/gEb11akJXaCYWF28RPPnTX5mnmC.jpg",
               "id": 40185,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ann Craigis",
               "gender": 0,
               "credit_id": "52fe462dc3a36847f80f0eb5",
               "name": "Ingrid Goude",
               "profile_path": "/5hX2v9ccYiZFUizqLQ7EgsAvACq.jpg",
               "id": 248787,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jerry Farrell",
               "gender": 2,
               "credit_id": "52fe462dc3a36847f80f0ebd",
               "name": "Ken Curtis",
               "profile_path": "/kHEdY7rK6nNkWj278e65iqCrXjO.jpg",
               "id": 30554,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dr. Radford Baines",
               "gender": 2,
               "credit_id": "52fe462dc3a36847f80f0ec1",
               "name": "Gordon McLendon",
               "profile_path": null,
               "id": 999981,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Marlowe Craigis",
               "gender": 0,
               "credit_id": "52fe462dc3a36847f80f0ec5",
               "name": "Baruch Lumet",
               "profile_path": "/kd0dxX0NA4XXR3zqP4dyC8vhuKC.jpg",
               "id": 248789,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "'Rook' Griswold",
               "gender": 0,
               "credit_id": "580ac266c3a36829730043cd",
               "name": "Judge Henry Dupree",
               "profile_path": null,
               "id": 1697687,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mario (as Alfredo DeSoto)",
               "gender": 0,
               "credit_id": "580ac277c3a36829730043d4",
               "name": "Alfredo de Soto",
               "profile_path": null,
               "id": 1697688,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe462dc3a36847f80f0eab",
               "name": "Ray Kellogg",
               "profile_path": null,
               "id": 114562,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe462dc3a36847f80f0eb1",
               "name": "Ken Curtis",
               "profile_path": "/kHEdY7rK6nNkWj278e65iqCrXjO.jpg",
               "id": 30554,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe462dc3a36847f80f0ecb",
               "name": "Jay Simms",
               "profile_path": null,
               "id": 98248,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe462dc3a36847f80f0ed1",
               "name": "Jay Simms",
               "profile_path": null,
               "id": 98248,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.159844,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43109,
      "vote_count": 22,
      "budget": 0,
      "overview": "Trapped on a remote island by a hurricane, a group discover a doctor has been experimenting on creating half sized humans. Unfortunately, his experiments have also created giant shrews, who when they have run out of small animals to eat, turn on the humans....",
      "similar": [
         4951,
         24920,
         80280,
         298584,
         157424,
         24923,
         20367,
         173672,
         41800,
         23014,
         50153,
         3125,
         29570,
         226018,
         129524,
         27877,
         43125,
         253650,
         71951,
         39441
      ],
      "original_title": "The Killer Shrews",
      "runtime": 69,
      "poster_path": "/gCUmIRMjG6uYTl5DyyAYi6czpOq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Hollywood Pictures Corporation",
         "id": 10747,
         "origin_country": ""
      }],
      "release_date": "1959-06-25",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "All that was left after...THE KILLER SHREWS!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Ray Kellogg"],
      "runtime": 69,
      "synopsis": "We open with a stormy sky as background and a narrator telling us, \"Those who hunt by night will tell you that the wildest and most vicious of all animals is the tiny shrew...in March, first in Alaska, and then invading steadily southward there were reports of a new species, the giant, killer shrew.\" A supply boat cruises across an open sea, with Captain Thorne Sherman (James Best) and his deckhand and mechanic Rook Griswold (Judge Henry Dupree) discussing the weather and the ramifications of an approaching hurricane. They still have a few hours before they reach their destination--a small island inhabited by a research team headed by Dr. Marlowe Craigis. This is Sherman's first run to the island; he recently bought the concession from the previous operator, Ferguson. They secure the boat for the storm, then row ashore in a dinghy and tie up to a small pier. On a low bluff they spot a small group approaching, and Sherman observes that something seems strange about it. Sherman and Griswold approach the group. Sherman is immediately taken with Dr. Craigis' daughter, Ann (Ingrid Goude). Craigis (Baruch Lumet) introduces himself and shakes Sherman's hand. Craigis inquires as to the previous captain bringing them supplies, and is told, \"I wouldnt know, I just bought his run.\" All the time Sherman stares, noticeably, at Ann. He hands the manifest to Jerry Farrell (Ken Curtis) who is holding a shot gun. Craigis tells Sherman after unloading supplies he wants to send his daughter back on the boat. To everyone's surprise, Sherman informs them that they are not leaving today or even unloading supplies. The approaching hurricane will delay everything. Sherman is growing suspicious, but can't really identify his concerns. He tells Rook that if he comes ashore later to wear a gun. The group, including Sherman, return to the house. Sherman is struck by how fortress-like the structure appears. He notices the radio antenna and asks if they were aware of radio reports about the approaching storm. He is informed the radio has been out of order for a week. At that moment, Mario (Alfredo DeSoto) opens the door on a 10-foot high fence and welcomes the group back. Ann suggests Sherman join them for a cocktail. Craigis tells Mario to mix them up some martinis. Sherman accepts and they step inside. They enter the patio compound, then the house and Sherman notices that Jerry very deliberately slams, locks and verifies locking the gate. In the living room, Ann, Sherman and Dr. Craigis enjoy their martinis. Craigis informs Sherman that they are self-sufficient: cows for fresh milk and chickens for eggs. Ann adds that they even have saddle horses. Sherman observes that they picked a lonely little island. Ann dismisses herself to go change clothes. Sherman tells Craigis that he suspects that the delay in departure isn't the only thing bothering Ann. Before Craigis can respond, his research colleague, Dr. Radford Baines (Gordon McLendon) walks into the room, so engrossed in his research papers, he is unaware they have a guest. Craigis introduces him to Sherman. Baines tells Craigis that two new litters were born and support their theory. Craigis apologizes for his colleagues strange behavior. He tells Sherman he is brilliant but absent minded. Sherman asks about his specialty and is told Baines is a Biologist, specializing in genetics and heredity. He also tells Sherman their objective, as practical research, is to decrease an animals size, but keep a low metabolism so an existing food supply will go further with a longer life span. Overpopulation is the concern, not now, but later. Ann, having changed into something less formal, returns to join her father and Captain Sherman. She asks to speak to her father, out of earshot of Sherman. Sherman finishes his drink. He asks if Craigis has ever been through a hurricane before. Craigis tells him they've only been on the island nine months and that prior to that the island was unoccupied for years. Sherman advises hurricane preparations, then talks to Ann about the weather. Ann tells her father she's invited Thorne for dinner, which surprises him, as they had no such conversation. Sherman declines as Baines comes into the room with a shrew in his hands. Craigis explains to Sherman that they are the subjects of the research. Sherman picks it up and comments that it \"looks like a small rat, but smells like a skunk.\" When Sherman asks, how big do they get? There follows a dramatic pause, then Craigis tells him that it is an adult, but one look at Ann tells him that Craigis isn't telling him the whole truth. When a shutter crashes against the house, Ann screams. She is dying to tell Sherman the whole story. At the beach, we see Rook rowing back to shore with a check line from the boat. The hurricane is close to the island. Craigis explains the shrew's behavior, that when hungry, they'll tackle anything, regardless of size. Their metabolism is such that they need to feed constantly and will turn to cannibalism if necessary. Ann, visibly upset at the conversation, interrupts her father to ask for another drink. Mario escorts Sherman to the bathroom to freshen up for dinner. Mario asks whether or not he will be leaving tomorrow. Ann tells Jerry that his drunken stupidity has caused the problem they now face. Jerry let some of the shrews loose and they've grown into the monsters that now threaten the party. When Sherman enters the living room, Jerry leaves. They are engaged to be married, and Jerry suspects Ann is developing feelings for Sherman. Jerry comes back and he and Ann continue their earlier argument. Rook comes ashore with the check line and ties it to a tree near the beach. Hearing a strange sound, he spots something, pulls his gun and fires. A pack of dog sized creatures chases him into the woods. He climbs a tree and they jump trying to get him. He calls for help, but the wind, rain and thunder mask his screams. The branch he's on breaks and he falls into the pack, which finish him off. Sherman tells Ann he's going back to his ship. She tries to dissuade him, and finally has to pull a gun to stop his departure. Outside a pack of shrews is jumping on the fence. Ann tells him the truth about their research and the giant mutations they accidently created. \"There are two or three hundred giant shrews out there, monsters weighing between fifty and and hundred pounds.\" Dr. Craigis enters the room and agrees that Sherman should be told the entire story. Six months before a litter of giant shrews escaped and began to breed. Their food supply is nearly gone, which is why they are waiting by the house. The shrews attack the barn and eat the livestock. Sherman goes outside because he thought he heard a human voice, Jerry follows and attacks him to keep him from opening the gate. Once safely back inside, they begin to plan their escape for the next morning. They must make it through the night first. As a precaution, they decide to patrol the house all night in shifts. At 3:00 a.m., Mario finishes his rounds and goes to get Jerry for the next shift. Jerry is very drunk and convinces Mario to take his shift. A shrew enters the house through a broken shutter in the kitchen. It goes down in the basement. Mario notices the broken shutter and secures it, but realizes a shrew is in the cellar. He goes to see Sherman to help him kill the shrew. Armed, the two search the cellar, but Mario doesn't see the creature hiding under the stairs. It attacks and bites him. Sherman shoots and kills it, but Mario collapses, apparently from blood loss. Sherman hastily improvises a tourniquet out of some cloth and his revolver. Ann has summoned help, and Craigis and Baines assist Sherman with Mario. Craigis pronounces him dead. Baines suggests hemotoxic syndrome, and Craigis concurs, but says that the autopsy will confirm the cause of death. Testing the animals saliva they discover that a poison they put out to eradicate the giant shrews was absorbed by the shrews. They now realize that a bite or even a scratch from one of them is lethal to anyone exposed. Ann explains to Sherman that she is a zoologist and that she also played her part in the research and is also responsible for the problem they created. Her specialty is their diet. The shrews find an entry into the house. Everyone is holed up in the living room. When they bait the outside, with the dead shrew that killed Mario, and it remains untouched for twenty minutes, they feel a run for the boat is now advised. Sherman and Jerry leave the house. Before they get too far, Jerry threatens Sherman with the gun. He is jealous, and Sherman quickly disarms him. They walk to the beach and call for Rook. They search and only find a few articles of clothing and conclude Rook came ashore and was killed and eaten. They return to the house followed by a pack of shrews. Jerry makes it back first and slams the gate shut, trapping Sherman outside to the approaching pack. Sherman shoots and kills a shrew, then scales the fence and attacks Jerry. He gives him a severe beating, then carries him up and prepares to throw him over the fence to the pack. He comes to his senses and puts him down. Back in the house he explains to Baines and Ann that Jerry twice tried to kill him and he had it coming. He also informs them that Rook is dead. Craigis helps Jerry inside and puts him on the couch. Ann opens the kitchen door to make some coffee and lets a shrew into the living room. It bites Dr. Baines, who sickens and dies very rapidly. Sherman dispatches it with his revolver. Jerry is visibly shaken and starts to drink again. He picks up the revolver and starts firing into the kitchen door, wasting a lot of ammunition. A shrew starts digging through the wall into the living room. Jerry is now very drunk and hysterical. It is now apparent that the only safe place is the patio, with the roof as a last refuge. While barricading the wall to the house, they discover some metal drums or barrels. Sherman sees them as a means of escape. He proposes to lash them together, get inside and walk down to the beach and swim out to the boat. He finds a welding torch and cuts eye holes into the barrels. They quickly rig a rope to the gate and prepare to leave. Jerry goes up on the roof and refuses to join them. When they notice a shrew digging through the wall into the patio area they decide to leave Jerry on the roof and escape. They get inside the barrels and open the gate. They are immediately set upon by the pack. They walk to the beach, then out into the ocean. When the water is deep enough they escape the barrels and swim to the boat. Once Jerry sees no more shrews he comes off the roof and makes a run for the beach. He only gets a few hundred yards when he is attacked and killed by another pack. Ann, Sherman and Dr. Craigis climb aboard the boat. Craigis explains that with no more food the pack will turn on itself, and the last one will then die of starvation. Ann and Sherman kiss.",
      "writers": [
         "Jay Simms",
         "Jay Simms"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052969/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTA0MDQwMTE4NV5BMl5BanBnXkFtZTYwMDA1Njk5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: James Best, Ingrid Goude, Ken Curtis | See full cast and crew »"],
      "reviews": [
         "Having seen any number of bad movies, I can state that this is significantly better than most of them, and even better in part than movies not considered bad at all. However, in those aspects in which this movie is bad it is not merely bad, it is awful. We have the usual formula of two-fisted hero (James Best), damsel in distress (Swedish Ingrid Goude), the damsel's mad-scientist father (non-Swedish Baruch Lumet), and the villain (Ken Curtis). The formula in this case is less clichéd than usual. The hero is fairly articulate and the mad scientist is actually quite urbane, tossing off his creation of hundreds of giant, poisonous, man-eating shrews with the line \"unusual experiments lead to unusual results\". The dialog is competently written and the acting is above par (with the exception of the Swedish eye-candy, who is at least good eye candy). The general concept is compact and dramatically efficient: a group of people are trapped first by a hurricane and then by an outside menace in a stronghold which gets less and less strong as time, ammunition and group cohesion all grow short. However the execution is at times illogical. One problem is that the stronghold is made out of...adobe. On a rainswept island crawling with usable timber? The thrilling conclusion is also somewhat implausible. The main reason for the film's abysmal reputation is the legendary and quite obvious use of ordinary dogs in bathmats to play the part of giant shrews. I suppose this just has to be overlooked. As a sidelight, it is interesting to see Dukes of Hazard sheriff James Best tall and handsome as the hero, and it is apparent that producer/villain Ken Curtis labored long and hard in the trenches before gaining fame as Festus.",
         "The Killer Shrews is a low budget B horror movie from 1959. Are there problems with it? Does it seem simple and not as scary as modern horror films? Yes and yes, I just said it was a low budget B movie from 1959. Don't expect too much. Considering this, I've watched this movie several times over the years and find it to be a fun, suspenseful, and entertaining movie. I also believe it to be under rated and well worth viewing. Being under rated, it also is very reasonably priced. You just have to sit back, relax and enjoy it. This type of movie however could not stand up to a close examination. If it's taken too seriously or is put under a microscope, it just won't be able to stand the inspection.",
         "When will the doctors learn? On a desolate and exotic island a doctor with a heart of gold screws up and damn near destroys the world. Am I referring to Fulci's Zombie, no? How about that island with Marlon Brando? Nope, wrong again. In the Killer Shrews this tome around on that deserted tropical island as seen a hundred times we have mutated shrews threatening to chomp down on our trapped scientists and a boat crew unlucky enough to be carting supplies to the island. Poisonous and hungry these shrews are gonna clean the island and suck the marrow from your bones\u0085burp. This fun little clichéd cheese fest moves along are a pretty quick pace. The acting is on par with the era, a bit over blown, but who cares. You have to love those shrew monsters. The effects are a bit *ahem* shrewd and laughable. Not to mention the long shots of the animals that appear to be dogs or maybe pigs dressed up in costumes, complete with tail. Good fun to be had by all with a hankering for b-grade sci-horror.",
         "This movie may seem hokey by today's standards: special effects, cgi, and all the things that make modern sci-fi/horror movies what they are. However that may be, I seem to remember seeing this movie for the first time,when it first came out in 1959, and let me tell you, it scared the bejesus out of me, as I watched through the crack between the theater seats in the row in front of me. I recently came across a 50 movie horror movie collection which, lo and behold, had in it \"The Killer Shrews\" and I promptly purchased it. I just finished watching the movie, and 47 years later, I still remember many different scenes like it was yesterday. That is the impression \"The Killer Shrews made on my 10 year old self. Sure the shrew suits are primitive by today's standards, but in 1959 they were impressive let me tell you. Still fun to watch and reminisce.",
         "Okay, it's a bad movie. Laughably bad. Hideously bad. MST3K bad (and they DID, too...). It's the kind of bad that makes you wonder just what color of shoe polish the producer was drinking when he agreed to buy it. It's also LOADS of fun. I highly recommend anyone who likes campy old flicks to pick this up for the laughable screenplay. The characters aren't bad; in fact, they're the bright spot of the movie, more or less wasted on a sad production. The acting really wasn't too bad in this film, nor were the characterizations, themselves. James Best, as Captain Thorne Sherman (que macho, eh?), stands out as the best-acted of the troupe in his role as the freelance boat captain stranded on the island by a hurricane, and forced to rally the few inhabitants against the menace of the shrews. I'm not going to kid you; against, say, 'Citizen Kane' or 'The General', this movie won't even RATE. But in the annals of B-grade or worse thrillers, this is definitely a must-see.",
         "The story is intriguing: a scientist experiments with rodents, who turn into giant mutants, running loose on a island of seven people, including his daughter. When their food supply runs out, the creatures turn cannibalistic. Ingrid Goude is good as the lone female, while James Best is best as a seaman who tangles with a drunkard (Ken Curtis) for her affections. But the romantic entanglements soon dissipate when the giant shrews, seeking food, start gnawing at the house of the islanders. This theme predates \"The Birds\" (1963), \"Night of the Living Dead\" (1968), even \"Signs\" (2002).If the monster costumes disappoint, the music, sound effects, performances, atmosphere and pacing more than compensate.",
         "****SPOILERS**** With their little beady eyes and murderous poison-tipped fangs flashing a wolf-pack of some 200 to 300 giant killer shrews have overrun an almost deserted island off the US Atlantic coast devouring everything on it in order to stay alive and not starve to death. These killer shrews were a experiment in world population control that went wrong by Dr. Mio Craigis, Bruch Lumet, and his colleague Dr. Baines, Gordon McLendod, who were on he island with Dr. Craigis' gorgeous daughter Ann, Ingrid Goude, and the doctors assistant, Jerry, Ken Curtis, and the handyman Mario, Alfredo De Soto. It was Jerry who while in a drunken stupor left the cages of the shrews open for them to escape and multiply in the wild and become the deadly threat that they are now. Jerry also became the shrews main course for lunch the next afternoon. In the middle of all this the skipper Capt. Thorne Sherman, James Best, and his good friend and 1st as well as only mate \"Rook\" Judge Henry Dupree come ashore to bring the monthly supply of food and medicine for the island staff not knowing just what their in for. Trying to keep the news of the deadly shrews from them, the skipper an his mate, \"Rook\" is later killed and eaten by a gang of shrews as he went back to bring the supplies ashore. With the skipper now taking charge he and the people on the island try to hold off the deadly shrews as they devour everything alive on the island as they plan to keep the shrews outside their compound long enough for them to cannibalize each other until their all destroyed before devouring them, but the deadly shrews have other planes. Fairly good horror thriller with the skipper saving the day as well as the island survivors, Dr. Craigis & Ann, as well as in the end getting the girl Ann and planing with her to re-populate the earth. In spite of the acute food shortage that Ann's father Dr. Craigis was trying to alleviate. Even though many people and critics made fun of the killer shrews looking like dogs wearing badly moth-eaten fur coats they were as real and as terrifying as Hollywood could make them look back then, 1959. The movies ending was both tense as well as exciting as the skipper the doctor and the girl escaped with steel drums turned over on them and tied together to protect them from the shrews. As they slowly trekked from the island compound to the sea and then swam to the skippers boat to freedom and safety. Gordon McLendon easily stole the show as the absentminded Dr. Baines who you sometime needed sub-titles to understand his babbling all kinds of scientific lingo that nobody in the theater audience, as well as almost every one in the movie cast, could understand. Baines was so focused on his work that when Mario died from a killer shrew bite he excitedly said that isn't it wonderful that the poison that we put out as bait to kill the shrews was absorbed in their systems and has now become part of their natural chemistry! WHAT A NUT!!! Also later when Dr. Baines was attacked and bitten by a charging killer shrew he goes to his typewriter and typed out the symptoms of the poison from the bite that would eventually kill him up until the moment that he expired!",
         "I won't recount the plot - such as it is - of this campy classic, because several others have already done so. I'll just give a couple of reasons why it's SOOOO bad that it's hilarious ... which makes it good, or at least entertaining, in a perverse way. First, the \"shrews\" are quite obviously dogs wearing mop-like wigs and/or bathmats. Easily the worst \"monsters\" ever put on film. Second, it's clear that Ray Kellogg was on such a tight budget that they weren't going to waste film with reshoots no matter HOW badly a scene went. At one point, one of the actors obviously forgot his lines, so Ingrid Goude prompts him on-camera, saying \"Aren't you wondering about my strange accent?\" Truly a great moment in cheesy movie history! Rated \"straight\" this movie gets about 2 points on a ten-point scale, just above the all- time stinkers like Plan 9 and Manos: Hands of Fate. As unintentional comedy, however, it's pretty entertaining and might rate 5/10.",
         "I've seen The Killer Shrews several times and despite the low budget and reading bad reviews, isn't that bad. It was released in the UK on VHS as part the Screamtime Video series, long deleted but luckily I own a copy. A small group of people on a remote island are stranded there by a hurricane. One of this group is a scientist who been doing experiments on shrews and as a result, these have turned into giant mutant monsters and have escaped and are hungry. They start trying to get into the house and gradually, members of the group are killed and eaten until there are three survivors and these escape to the sea by using old barrels welded together. Not surprisingly, two of the survivors declare their love for each other at the end. The giant shrews in this movie are actually dogs with shaggy coats and large teeth. The Killer Shrews's cast is mostly made up of unknown B-movie actors including James Best, Ingrid Goude and Ken Curtis, who also produced. This movie is worth looking at, despite its low budget. Rating: 3 stars out of 5.",
         "In this cheesy b-movie horror yarn, sailor Thorne Sherman (James Best) finds himself delivering supplies to a small group of scientists who are conducting experiments into the prevention of overpopulation. After taking something of an interest in the beautiful but apprehensive Ann (Ingrid Goude \u0096 Miss Universe 1957) he accompanies the group back to their home where he meets the rest of the team and has a pleasant drink. With a hurricane imminent, Thorne wishes to travel back to his boat but it is only when the otherwise timid Ann points a gun at him that he decides to stay, and in turn, learns the shocking truth of what the experiments have unleashed upon the island. Far from great but still mildly entertaining, \u0091The Killer Shrews', was the directorial debut of regular special effects artist Ray Kellogg who created effects (some photographic) for more than eighty movies during the Forties and Fifties. Interestingly, the special effects work in \u0091The Killer Shrews' left quite a lot to be desired and one has to question just how much input Ray had on the final results. In something of a stark contrast to the effects present in other Fifties creature features such as \u0091Them!' (1954), there is a distinct requirement for a great deal more imagination to see the creatures (mutated shrews) as anything more than what they actually were. One can easily be forgiven for finding amusement in seeing dogs (collies I believe) jumping up walls while wearing somewhat silly rubber masks and what appear to be mop-heads. Close up shots of the mutated shrews show the viewer a remarkably cheap looking puppet. However, the movie relies more on the implication that the shrews may be near or inside the building rather than overexposing the viewer to imagery of the shrews. In that respect, the movie works. Removing the poor effects from consideration for a while, the movie itself plays out nicely. Although the first fifteen minutes of this relatively short film move slowly it is not long before a fairly interesting, multi-narrative film. While the shrews take precedence in the film there is an interesting and on-going clash between Thorne and Jerry (Ken Curtis). In fact, in some ways one could argue that \u0091The Killer Shrews' plays out as an early draft of George A. Romero's \u0091Night of the Living Dead' (1968). The rather wonderful, ominous musical scoring help to create something of a foreboding atmosphere which, unfortunately, Ray Kellogg's direction fails to capitalise on. Without condemning the direction as bad, there were moments when a stronger director would have been able to turn a potentially unnerving scene into an exhilarating thrill-ride. Sadly, Kellogg's direction was awfully basic and while the potential was there throughout the movie, Kellogg failed to capitalise and regrettably kept \u0091The Killer Shrews' in something of a stalemate. Unfortunately, the often wonderful musical score occasionally added to the continual moments of absurdity that were present throughout the movie and generated laughs rather than fear. Jay Simms, who wrote a number of similar films, was responsible for the somewhat impressive screenplay which, despite featuring sporadic moments of incoherence, was the foremost reason that \u0091The Killer Shrews' worked in any way. One would suggest that a more experienced director may have been able to make something more of \u0091The Killer Shrews' but as it stands; the movie is still enjoyable for one watch. \u0091The Killer Shrews' features generally credible and effective acting performances and a fairly interesting and entertaining story. It sadly lacks in the effects and direction departments. Fifties monster-movie fans should probably check it out although the movie does border on ludicrous. This one is apparently quite popular amongst fans of `bad' films. My rating for \u0091The Killer Shrews' \u0096 6/10."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Hollywood Pictures Corporation (II)"],
      "summaries": [
         "A disparate group are trapped on a remote island by a hurricane. On the island, a doctor works to make humans twice as small as we already are. This, apparently, will help prevent over population. Unfortunately, his experiments have also created some giant shrews. As the shrews run out of smaller animals to eat, they move in on the people in the house.",
         "Boat Captain Thorne Sherman and his black sidekick, \"Rook\" Griswold (played by an actor named John Henry Dupree, whose nickname was 'Judge\" but he was not a judge), arrive to deliver supplies to a remote and isolated island, inhabited by a scientist, his daughter and his aides. Sherman soon learns that the scientist and company have created out-of-control, flesh-eating, monstrous giant shrews. A hurricane hits and all the stranded humans become either meals for or meal-targets for the shrews.",
         "On an isolated island, a small group of people are terrorized by giant voracious shrews in the midst of a hurricane."
      ],
      "budget": 123000
   },
   "movielensId": 3933,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1959-06-25",
      "dvdReleaseDate": "2000-08-29",
      "directors": ["Ray Kellogg"],
      "runtime": 69,
      "movieId": 3933,
      "title": "The Killer Shrews",
      "mpaa": "",
      "actors": [
         "James Best",
         "Ingrid Goude",
         "Ken Curtis",
         "Gordon McLendon",
         "Baruch Lumet",
         "Judge Henry Dupree",
         "Alfredo de Soto"
      ],
      "imdbMovieId": "0052969",
      "originalTitle": "The Killer Shrews",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["nhG8vLz9PUA"],
      "plotSummary": "Trapped on a remote island by a hurricane, a group discover a doctor has been experimenting on creating half sized humans. Unfortunately, his experiments have also created giant shrews, who when they have run out of small animals to eat, turn on the humans....",
      "tmdbMovieId": 43109,
      "avgRating": 2.15172,
      "releaseYear": "1959",
      "numRatings": 145,
      "posterPath": "/gCUmIRMjG6uYTl5DyyAYi6czpOq.jpg"
   }
}