{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0093996",
      "video": false,
      "title": "Slumber Party Massacre II",
      "recommendations": [
         27767,
         27475,
         40446,
         40760,
         34312,
         85160,
         59762,
         54133,
         27420,
         43033,
         30996,
         69165,
         83857,
         30644,
         36089,
         34311,
         50719,
         24097,
         63590,
         44444
      ],
      "backdrop_path": "/uQovzsHA07y8gJotl4TCypbMBM0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Mrs. Bates",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057d6d",
               "name": "Jennifer Rhodes",
               "profile_path": "/auNxS9GPM84mAQjpZgsU1eeLyce.jpg",
               "id": 27568,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Amy",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057d71",
               "name": "Kimberly McArthur",
               "profile_path": "/ge4ARdepDRp7rUfjoPbb7rX7z88.jpg",
               "id": 939789,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Matt Arbicost",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057d75",
               "name": "Patrick Lowe",
               "profile_path": null,
               "id": 170193,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Sheila Barrington",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057d79",
               "name": "Juliette Cummins",
               "profile_path": null,
               "id": 98583,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Sally Burns",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057d7d",
               "name": "Heidi Kozak",
               "profile_path": "/wihXxwEpc8ZJsgcxCoJhexcIIQD.jpg",
               "id": 88523,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Valerie Bates",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057d81",
               "name": "Cindy Eilbacher",
               "profile_path": null,
               "id": 101902,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "The Driller Killer",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057d85",
               "name": "Atanas Ilitch",
               "profile_path": null,
               "id": 1068857,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Courtney Bates",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057d89",
               "name": "Crystal Bernard",
               "profile_path": "/puAY1Aam0AtZyC8lH9BppzJQO4.jpg",
               "id": 1226789,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "T.J.",
               "gender": 2,
               "credit_id": "59dc1902c3a368623e0664fb",
               "name": "Joel Hoffman",
               "profile_path": null,
               "id": 1020221,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4564c3a368484e057d3f",
               "name": "Deborah Brock",
               "profile_path": null,
               "id": 112921,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4564c3a368484e057d45",
               "name": "Deborah Brock",
               "profile_path": null,
               "id": 112921,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4564c3a368484e057d4b",
               "name": "Deborah Brock",
               "profile_path": null,
               "id": 112921,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4564c3a368484e057d51",
               "name": "Don Daniel",
               "profile_path": null,
               "id": 97796,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4564c3a368484e057d57",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4564c3a368484e057d63",
               "name": "Thomas L. Callaway",
               "profile_path": null,
               "id": 33618,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4564c3a368484e057d69",
               "name": "William Flicker",
               "profile_path": null,
               "id": 551881,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59c77e9a9251415b6e052c45",
               "name": "Richard Cox",
               "profile_path": null,
               "id": 1893869,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.843592,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27764,
      "vote_count": 37,
      "budget": 0,
      "overview": "Courtney, the sister of a survivor from the 1st movie and the members of her rock band go to a condo for the weekend to play music and have fun with their boyfriends. Courtney's dreams are of her sister, who is in a mental institution, warning her of having sex, and the dreams begin to spill into real life, threatening Courtney and her friends as they begin experiencing an attrition problem.",
      "similar": [
         258480,
         10735,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         634,
         437557,
         242224,
         17130,
         43923,
         11634,
         141,
         297762,
         376867,
         394117,
         370663,
         376660
      ],
      "original_title": "Slumber Party Massacre II",
      "runtime": 75,
      "poster_path": "/9kbVSIPP6060q950s1y2cjW4SP8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1987-10-30",
      "vote_average": 5,
      "belongs_to_collection": {
         "backdrop_path": "/d90ninW84rPsHNajdsxM5fQauBR.jpg",
         "name": "The Slumber Party Massacre Collection",
         "id": 138971,
         "poster_path": "/hbNwVI7tOr4uWeigv8p7q42MUS7.jpg"
      },
      "tagline": "The party begins when the lights go out!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Deborah Brock"],
      "runtime": 75,
      "synopsis": null,
      "writers": ["Deborah Brock"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093996/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNzE2ODg1OV5BMl5BanBnXkFtZTcwOTc4NzgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Crystal Bernard, Jennifer Rhodes, Kimberly McArthur | See full cast and crew »"],
      "reviews": [
         "God Bless DVD, they are releasing alot of hard to find movies on it and I managed to get this one. I wasn't expecting anything big but boy was this movie FUN. The killer was cool, the suspense was good, the deaths were GORY but the ending DOES suck. I gave this movie 9/10 (no I'm not on drugs) it was just alot of fun.",
         "Has there ever been a movie that would have been hurt by having a plot? I point to Slumber Party Massacre II. Who was the killer? Where did he come from? Why was he killing them? Where can I get a guitar like that? Why did he continually do the intro to \"wipe-out?\" Was it all a dream? Or was it a memory of a dream of a hallucination of a dream? Does the director want me to believe that break-dancing is frightening? Why didn't the girl with large breasts get naked? Why did the ugly girl get naked at all? Why the blow-up doll? Why did they build up the romance of the girl from Wings (the sitcom, not the parade of stock footage from the Discovery channel which was much more entertaining) and Rob Lowe's little brother , only for him to be the first to get drilled? Was the killer made out of oily rags? What was happening at all in this movie! Frankly, I don't care. A lucid plot would have been a dead weight on this movie, dragging it down and holding it back from becoming the paragon of movie making that it is. All movies should be written and directed while drunk and filmed over a weekend in a housing development while the foreman was in the port-a-jon. A rocker with a drill on his guitar! Breakdancing! Blow-up dolls! Unlike the killer, I got satisfaction!",
         "SLUMBER PARTY MASSACRE II (1987) starring: Crystal Bernard, Atanis Ilitch, Kimberly McArthur, Juliette Cummins, Patrick Lowe, Heidi Kozak, Joel Hoffman, Scott Westmoreland, Jennifer Rhodes, Cindy Eilbacher. plot: Five years after the original, Courtney (Crystal Bernard) is having a pretty good life. She's in a band with her best friends Amy (Kimberly McArthur), Sheila (Juliette Cummins) and Sally (Heidi Kozak). She's also dating the hunky boy Matt (Patrick Lowe). But her life also has a few downs. She's having nightmares of the murders she witnessed in the original and a new Driller Killer (Atanis Ilitch) going after her, her sister Valerie (Cindy Eilbacher) (who is in a mental hospital), her mother (Jennifer Rhodes), and her friends. Soon, Courtney goes with the rest of the band to Sheila's condo where they practice for the school dance and the guys (Joel Hoffman, Scott Westmoreland) also arrive. Soon enough, Courtney's dreams cross into reality and a rock-n-roll and gore fest begins. the good: This takes a different path than the original and is a tribute to NIGHTMARE ON ELM STREET instead of HALLOWEEN. The down-to-earth characters are still here (Courtney, Amy, Amy's boyfriend), but so are some stereotypical slasher characters (Sheila, Sally, Sheila's boyfriend). This is one cheese-fest though, lots of fake gore and strange hallucination scenes (all about the attack of the headless chicken). The Driller Killer this time is a lot different. He dresses in leather, uses a guitar with a drill at the end, smokes, sings, and spits out one-liners as he kills. And dare I say, he was extremely sexy! the bad: Everything bad in this film adds to the fun! 8/10",
         "I'm a fan of the original \"Slumber Party Massacre\" and its half-hearted attempt at breaking slasher rules. Included on the DVD is an insane trailer for this sequel, and I bought it because I thought the trailer was so hilarious. I knew it would be an awful movie. Almost everything about it is technically bad. I was a bit bummed that the trailer gave the whole movie away (and, in my opinion, was more entertaining than the movie!) Even still, this is a super fun piece of 80s camp. We have an all-girl rock band (a la The Bangles) who go out to a condo for a slumber party/band practice weekend. The lead character is a grown-up Courtney, the youngest girl who survived the original SPM, played by Crystal Bernard of TVs \"Wings.\" She has terrible nightmares about her institutionalized sister and the Driller Killer. Except the killer isn't the nasty old schizo from the original. He's a sexy leather-clad psychobilly (think Lux Interior of the Cramps) with a spiky red electric guitar that has a drill coming out of the neck! Courtney's dreams start to seem all too real, and just when her friends begin to think she is insane, the driller killer crosses over from her dreams into reality and starts offing her friends, performing an obligatory song and dance before each kill. The basic plot is a ridiculous cross between \"A Nightmare on Elm Street\" and \"Friday the 13th,\" but that doesn't matter because the movie is just an excuse to be hilariously twisted (the driller killer, a flying dead chicken, a gigantic exploding zit). This movie clocks in at 75 minutes, with most of the drilling occurring in the last 20 minutes or so. But if you like cheesy 80s horror and sleazy rocknroll, then \"Slumber Party Massacre II\" is for you. I loved it! My rating: 7/10",
         "Ok who in their right mind comes up with weapons like electric guitar DRILLS? B******d if I know but these people must be seriously twisted. Anyway in this case the guitar/drill is a very novel, unique choice for a weapon which makes this movie very interesting. The death scenes are very twisted, as you can probably imagine because the killer plays the guitar and sings as he kills his victims. WHO thinks of this (wacko).Back to the review, this movie is definitely worth seeing if only for amusement value, oh and to check out the excellent camera angles in the dream sequences",
         "Oh...My..GOD! Where has this movie been all my life and how come I never heard about it until now?!?!?! Me and a friend rented this on a whim, it had the cover design of a porno movie with the slick presentation of an 80's mastercheese horror flick. I never saw this coming. My face is still sore from laughing so hard 24 hours later. Slumber Party Massacre 2 is the greatest movie to kill a 12 pack of Pabst Blue Ribbon to. Seriously. I got what I expected out of it, and SO MUCH MORE! Where do I begin! The Driller Killer! He is cooler than Freddy Krueger has been in years. His one liners were hilarious, his dance moves supreme and that kick ass guitar with the drill on it ruled. I also dug the 50's Rockabilly soundtrack. This is the single greatest Horror/Comedy/Rock n' Roll movie of all time. Joe Bob Briggs would have loved it. Better than the Rocky Horror Picture show.",
         "This review is only about the last twenty minutes of the film (aka: THE GREATEST MOMENT IN CINEMA!). Granted, the first fifty minutes is just like any other film, but that is before the killer shows up. If they wanted to create some sort of sympathy for the characters they shouldn't have made the killer the coolest guy on the whole f***ing planet! Atanas Ilitch single-handedly makes this my favorite movie of all time. Sure he kills the annoying characters, but he does it with style. Everyone uses a butcher's knife or a chainsaw. Who else uses a demonic drill guitar? How many slashers dance before giving the thirty-year-old-teens an extra body cavity? Only Atanas Ilitch: The Driller Killer. BUY THIS MOVIE!",
         "Here's a gem. Can anyone tell me what the hell is going on here? I had so many questions at the end of this movie. Like how come at first the killer was only in Courtney's dreams, and then all of a sudden he was real? How did that fool kill all those kids without anyone being able to stop him? Why won't Blockbuster refund my money for this junk? Overall, though, this movie rocks because it's so atrocious. The characters are all so lame that you end up rooting for the killer because he's the coolest guy in the movie! He's also got some sweet lines that should never be said anywhere unless you don't like having friends, because they're so corny. If you love bad-- and I mean really bad-- movies, rent this turd. It's an entertaining 90 minutes of your life that you can never have back.",
         "What could very well have been a highly entertaining little slasher movie is nothing more that a stupid teen explotion flick. It's nice to see that filmmakers decided not to comptly rip off Friday the 13th for this sequal, just to bad they decided to rip off NIghtmare on Elm Street indtead. IT's 5 years after the first slumber party killings, Courtny (Valeries little sister all grown up) is plagued with nightmares of the initial incident. Her and 3 other friends decide to have a wild weekend of sex and booze (will they never learn), but the driller killer is back. This time in the form of a ghost of a 50's rockstar who uses a heavy metal guitar with a huge drill bit attatched to the neck to kill off the girls. The film tries to be original but looses itself in all the corny dialogue and cheesy dance numbers(?). BUt fear not all you horror fans, the film has enough gore to make even Jason Voorhees turn his head in disgust. A word of advice to filmmakers, you know your movie is bad when the best performance comes from a blow up doll.",
         "The Plot = After Vicki's friends were brutally murdered at a slumber party a couple of years ago she was admitted to an asylum. Her younger sister, Courtney is all grown up now though and is getting ready to leave for a slumber party weekend with her girlfriends. What she doesn't know is that someone is all ready there, waiting for them... or is it all in Courtney's mind? Naked girls in pillow fights, a killer with a drill at the end of his guitar and weird hallucinations, wow did this sequel change the story completely or what. The first \"Slumber Party Massacre\" was good, this sequel however is just too strange, It definitely ain't as good as the first one, I mean the dream sequences are just weird and the killer is far from scary to be honest I found him rather stupid He looks like he was pulled out from some 80s rock band with his leather jacket and very customised guitar. I guess they tried to make it a bit more original than the first one. Either way, It's is still a very entertaining movie and if you liked the first one, you will definitely like this one as well."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Concorde Pictures"],
      "summaries": ["Courtney, the younger sister of the \"new girl across the street\" in the first film is all grown up now, but suffers from nightmares about the Big Wet Incident. She and the other members of her female rock group go to a condo for the weekend to play music and have fun with their boyfriends. Courtney's dreams are of her sister, who is in a mental institution, warning her of having sex, and the dreams begin to spill into real life, threatening Courtney and her friends as they begin experiencing an attrition problem."],
      "budget": 0
   },
   "movielensId": 3939,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-10-30",
      "dvdReleaseDate": "2000-08-29",
      "directors": ["Deborah Brock"],
      "runtime": 75,
      "movieId": 3939,
      "title": "Slumber Party Massacre II",
      "mpaa": "R",
      "actors": [
         "Jennifer Rhodes",
         "Kimberly McArthur",
         "Patrick Lowe",
         "Juliette Cummins",
         "Heidi Kozak",
         "Cindy Eilbacher",
         "Atanas Ilitch",
         "Crystal Bernard",
         "Joel Hoffman"
      ],
      "imdbMovieId": "0093996",
      "originalTitle": "Slumber Party Massacre II",
      "genres": [
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Courtney, the sister of a survivor from the 1st movie and the members of her rock band go to a condo for the weekend to play music and have fun with their boyfriends. Courtney's dreams are of her sister, who is in a mental institution, warning her of having sex, and the dreams begin to spill into real life, threatening Courtney and her friends as they begin experiencing an attrition problem.",
      "tmdbMovieId": 27764,
      "avgRating": 1.85758,
      "releaseYear": "1987",
      "numRatings": 165,
      "posterPath": "/9kbVSIPP6060q950s1y2cjW4SP8.jpg"
   }
}