{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "wound",
            "id": 2820
         },
         {
            "name": "yoga",
            "id": 5828
         },
         {
            "name": "blood splatter",
            "id": 8636
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "basement",
            "id": 9866
         },
         {
            "name": "blood",
            "id": 11221
         }
      ],
      "imdb_id": "tt0112702",
      "video": false,
      "title": "Coldblooded",
      "recommendations": [
         136984,
         49597,
         20648,
         73952,
         50835,
         107814,
         80919,
         22792,
         19033,
         47686,
         35225
      ],
      "backdrop_path": "/v9YBIlecw3S4r6Cq0vYJrufU5yI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Tim Alexander",
               "gender": 2,
               "credit_id": "56b9d871c3a3681e7d0022fd",
               "name": "Michael J. Fox",
               "profile_path": "/2CwTJuL6UHqPJ82oh8WpWUw8Q0V.jpg",
               "id": 521,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Cosmo Reif",
               "gender": 2,
               "credit_id": "52fe44d49251416c9101e45b",
               "name": "Jason Priestley",
               "profile_path": "/skXfFcbZWPOBomGBSTMfiyzgi6q.jpg",
               "id": 19143,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Jasmine",
               "gender": 1,
               "credit_id": "52fe44d49251416c9101e44f",
               "name": "Kimberly Williams-Paisley",
               "profile_path": "/nVp4F4VFqVvjh6huOULUQoiAguY.jpg",
               "id": 70696,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Honey",
               "gender": 1,
               "credit_id": "52fe44d49251416c9101e457",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 3
            },
            {
               "cast_id": 2,
               "character": "Gordon",
               "gender": 2,
               "credit_id": "52fe44d49251416c9101e453",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Steve",
               "gender": 2,
               "credit_id": "56b9d83c9251416872001228",
               "name": "Peter Riegert",
               "profile_path": "/yPgaRZBMVy9eoNNuiPIm0wzG9sD.jpg",
               "id": 20899,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Randy",
               "gender": 2,
               "credit_id": "56b9d8c0c3a3681e7d002309",
               "name": "Josh Charles",
               "profile_path": "/gO5zHbDQ38bZKJULUk9wIrFW1w4.jpg",
               "id": 2694,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lance",
               "gender": 2,
               "credit_id": "56b9d8cdc3a3681e6d0022b5",
               "name": "David Anthony Higgins",
               "profile_path": "/oQvcJp7JciyEce28MBOZArznIue.jpg",
               "id": 78102,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Rose",
               "gender": 0,
               "credit_id": "56b9d8e392514106a4002192",
               "name": "Doris Grau",
               "profile_path": null,
               "id": 1213763,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "568080ef9251414d98004821",
            "name": "Wallace Wolodarsky",
            "profile_path": "/dvmEq92L4UwL20uO2BOQ8vnpPBP.jpg",
            "id": 486,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.199867,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32502,
      "vote_count": 17,
      "budget": 0,
      "overview": "Cosmo, an affectless mob bookie who lives in the basement of a retirement home, is promoted to hitman. He learns his new trade from Steve, a seasoned killer. He falls in love with a yoga teacher, Jasmine, and must figure out a way to leave the mob so they can be together.",
      "similar": [
         10651,
         445954,
         984,
         341006,
         2749,
         15762,
         1572,
         96,
         156022,
         245891,
         241554,
         8456,
         4638,
         395990,
         357096,
         4771,
         948,
         44147,
         2142,
         15069
      ],
      "original_title": "Coldblooded",
      "runtime": 92,
      "poster_path": "/oRZRUO11vOnsSnHMQATeNM06Lsu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Snowback Productions",
            "id": 33419,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Motion Picture Corporation of America (MPCA)",
            "id": 11061,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Polygram Filmed Entertainment",
            "id": 31080,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Propaganda Films",
            "id": 278,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wallace Wolodarsky"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Wallace Wolodarsky"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112702/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5NDM3OTE0OV5BMl5BanBnXkFtZTYwNTkwMjQ5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Priestley, Kimberly Williams-Paisley, Peter Riegert | See full cast and crew »"],
      "reviews": [
         "I went to see this at the Seattle International Film Festival in 1995. I went because the synopsis sounded interesting. Plus the guy who had written and directed it was connected with the Simpsons, surely a major plus when it comes to comedy. The audience was filled with teenage girls, obviously drawn by the name of Jason Priestly on the marquee. It made the subsequent viewing of the film THAT much funnier (well, at least to me) to sit there and wonder what these girls were thinking as the film progressed and Priestly started killing folks with such wonderful deadpan indifference. This movie is incredibly funny. Peter Reigert is top-flight comedy gold in every scene he has as the burned-out veteran hit-man but the real revelation is how funny Jason Priestly can be when given a chance. His character here is almost like Peter Sellers from BEING THERE; he is so impassive and deadpan, yet the film revolves around his performance and it must be good for a film like this to work; well, Priestly delivers. His character is goofy and sweet and yet somehow chilling too in his casual attitude to murder. Why this film has languished in total obscurity is a mystery. When i saw the film, most of the audience didn't know what to think; the teenage girlies were rather shocked;they didn't find it amusing to see their 90210 heartthrob pistol-whipping people before icing them, but I did. When the film ended, the director, Wallace Wolodarsky, was just sitting there, alone.He had introduced the film briefly beforehand and said he'd be happy to field questions when it was over. I approached him (since no one else was going to) and I think I frightened him a bit with my exuberance; I had a shaved head at the time and i looked a bit weird and I said, too loudly, \"That movie was brilliant! It was hilarious!\" He said,\"Thank you,\" and slowly backed away from me. I thought, \"Well, you can't win them all.\" And I left him in the theater filled with people who didn't understand his movie.",
         "This little film is so tasty. I will bet you that you cannot think of a character in another movie that is similar to that of Cosmo. There is a hole in this man's soul where his moral compass should be, and we like it! I can see why Michael J. Fox liked this project. Its got the Teen Wolf kind of humor but its played completely straight. Not strictly a gangster movie. I hate gangster movies. This I loved.",
         "There are fewer and fewer \u0091labours of love' in the movies these days- you start with a clever guy and a clever idea (right there most projects grind to a halt) get together a few bucks and some close \u0091famous' friends-far too big a stars for this little project\u0085and go out for an obscenely FEW amount of days and locations, add a little spit and bailing wire, and somehow come away with a movie. Two Girls and a Guy is a good example, Let it Ride another one, but for my money, COLDBLOODED is the best of them all. It's just that good. Wallace Wolodarsky (supervising producer of The Simpsons) wrote and directed this darker than dark, black, dark black comedy about a young hit man protegee and his kooky environs. Jason Priestly (as Cosmo Reif) shows the acting form not of Bev Hills 90210, but a foreshadow of his later work in Love and Death on Long Island. Kimberly Williams is perfect as the ingenue girlfriend, and Peter Riegert is spectacular as Cosmo's mentor Steve. Robert Loggia, Janeane Garofalo and even Michael J Fox show up in smaller roles. Not available on laser, you'll have to dig this one up on video, or on some of the more obscure cable options-but well worth the effort.",
         "I can't believe this movie doesn't have a higher rating (although 6.6 isn't that bad on IMDB). I'm not a Jason Priestley fant at all, but he is just fantastic in this movie. The story is totally strange, very low-budget it some ways, but it has some great acting by Priestley and Peter Riegert. Although her part is small, Kimberly Williams is also impressive and the bit parts of Michael J. Fox, Talia Balsam (his movie wife, though very short lived, no pun intended), Janeane Garofalo, are also great. Robert Loggia can't be a bad actor in anything, so we don't even have to bring him up. This is my favorite \"unknown\" movie. It seems few people have seen it and I will buy it the second it comes out on DVD. I catch it on cable every chance I get. Yes, I did rate it a 10!",
         "I rented this movie a few years ago on a friend's recommendation. I did not want to see it, strictly because of Jason Priestly. Boy was I wrong! This is one of those rare gems that you wish you could show to all your friends. This movie is what others like \"The Big Hit\" and such crime/comedy movies WISH they could be. It is smartly written, greatly acted (and subtly acted, no over-the-top histreonics as an attempt at humor) and excellently cast. Robert Logia is fantastic as the new Mob leader. Priestly is great as the title role. Please watch this movie with an open mind and be ready to be shocked, both at the black humor, and at the intelligence and care the story receives.",
         "this movie is completely underestimated. Jason Priestley really shocked me that he was able to play such a good character after what i've seen from him in the past. i highly recommend this movie to anyone with an intelligent sense of humor. the only thing I'm not too happy about is that this movie has not been released as a DVD yet but hopefully that will change. it's a dark comedy for anyone that is into them. one of the best ones i've ever watched. i caught this movie late one night about 3:00 in the morning knowing i had to get up for school at 6:00 a.m. and lets just say i had a rough day at school the next day. i couldn't take my eyes off of it from the first second i saw it. it's rare that a movie can actually have that effect on me especially that late at night. once again if you ever have a chance to see this movie, take the opportunity, Preistley is magnificent. Catch it on VHS at the video store if you have a VCR still",
         "This is a movie I think you could say is in the same category as the classic Pulp Fiction. Where can you see a guy going around killing people in cold blood seemingly without any reason, if not in these two films. I really liked the way Jason Priestley plays his character, from a innocent, retarded kid to a cold-blooded assassin. I must say it seemed as a B-movie in the beginning, but as the movie went on, it only got better and better. Something else that was fun is Michael J. Fox's appearance in the movie. Great scene. A must see!",
         "I watched this film at an obscenely late hour the other night, and it was like a breath of fresh-air. As soon as I saw Jason Priestly, I assumed it would be one of those terrible straight to TV movies that involved a cast of C-list celebrities wondering what on earth they were doing making such rubbish. Not so. As the film progressed I realised, to my utter surprise, that I was actually really enjoying it. The dialogue was funny, the characters interesting and the ending inspired. Priestly was excellent, only ever achieveing such dizzy acting heights in another quirky classic, 'Love and Death on Long Island', and the supporting cast were genuinely talented. It wasn't perfect; it could have been longer, but it definietly had all the assets of a cult movie.",
         "I saw a trailer for this movie on an old video, and it intrigued me. I came to IMDB right away to see if it's good, and having the approval I needed, I started my quest to find it. Luckily there's a video store in my town that has a lot of the older movies and never throws them out. As for the movie, I thought it was great. Cosmo is so emotionless that his hits are actually funny. And I loved the relationship between him and the hooker in the retirement home. This is a truely great movie, and it makes me kinda angry that hardly anyone will see it. If you get a chance, RENT THIS MOVIE 9/10",
         "With so many over-hyped major releases of recent years proving to be bitter disappointments, it's a real treat when I get to watch an older, lesser-known film with no expectations and am blown away by what I see. Director Wallace Wolodarsky's Coldblooded is such a film. Jason Priestley (of Beverley Hills 90210 fame) plays Cosmo, a socially inept loner working as a bookie for an organised crime syndicate, who unwillingly becomes a hit-man when his gangster boss makes him an offer he can't refuse. After being sent to work alongside seasoned gunman Steve (Peter Riegert), in order to learn the ropes, Cosmo discovers that he is a natural when it comes to dishing out death. Completely ruthless, quick thinking, and a great shot, he takes to the job like a duck to water, but also finds that wasting people for a living is rather stressful. In order to try and relax, he begins yoga, and soon falls for the pretty teacher who takes his class. But is it possible for him to continue in his line of work and be in love at the same time? A quirky blend of dark humour and extreme violence, Coldblooded is a delight from start to finish. Priestly excels as Cosmo, a character that you cannot help but like, despite his monstrous ability to shoot complete strangers without skipping a heartbeat. The young killer's deadpan expression and bizarre mannerisms suggest that his mind functions in a manner different to most\u0097his perception of right and wrong is certainly severely distorted\u0097and whilst this doesn't excuse the fact that he is a brutal murderer, it makes his actions little easier to understand and, perhaps, even forgive. The smart script, also by Wolodarsky, brims with offbeat moments, great incidental characters, and inky black comedy, and his talented cast (which includes great turns by Robert Loggia, as Cosmo's boss, and Kimberly Williams as his girlfriend, plus fine cameos from Janeane Garofolo and Michael J. Fox) don't put a foot wrong, delivering some truly excellent performances. If you too are weary of overblown summer blockbusters that don't live up to the hype, track down this little gem of a movie to be reminded how good cinema can be when it's done right."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Thriller"
      ],
      "productionCompanies": [
         "Motion Picture Corporation of America (MPCA)",
         "Polygram Filmed Entertainment",
         "Propaganda Films"
      ],
      "summaries": ["Cosmo, an affectless mob bookie who lives in the basement of a retirement home, is promoted to hitman. He learns his new trade from Steve, a seasoned killer. He falls in love with a yoga teacher, Jasmine, and must figure out a way to leave the mob so they can be together."],
      "budget": 0
   },
   "movielensId": 394,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-15",
      "dvdReleaseDate": null,
      "directors": ["Wallace Wolodarsky"],
      "runtime": 92,
      "movieId": 394,
      "title": "Coldblooded",
      "mpaa": "",
      "actors": [
         "Michael J. Fox",
         "Jason Priestley",
         "Kimberly Williams-Paisley",
         "Janeane Garofalo",
         "Robert Loggia",
         "Peter Riegert",
         "Josh Charles",
         "David Anthony Higgins",
         "Doris Grau"
      ],
      "imdbMovieId": "0112702",
      "originalTitle": "Coldblooded",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Cosmo, an affectless mob bookie who lives in the basement of a retirement home, is promoted to hitman. He learns his new trade from Steve, a seasoned killer. He falls in love with a yoga teacher, Jasmine, and must figure out a way to leave the mob so they can be together.",
      "tmdbMovieId": 32502,
      "avgRating": 3.36713,
      "releaseYear": "1995",
      "numRatings": 143,
      "posterPath": "/oRZRUO11vOnsSnHMQATeNM06Lsu.jpg"
   }
}