{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0100639",
      "video": false,
      "title": "Slumber Party Massacre III",
      "recommendations": [
         27764,
         40446,
         40760,
         69165,
         27475,
         87704,
         30996,
         34312,
         83857,
         54133,
         9940,
         26960,
         50719,
         26961,
         27476,
         335753,
         46695,
         26958,
         19287,
         316744
      ],
      "backdrop_path": "/81JGJRzKbzrhpTyJZUIoLfFBN85.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jackie Cassidy",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057e85",
               "name": "Keely Christian",
               "profile_path": "/xyUnGePRBtnnOBlcCmDs2Kxq5AI.jpg",
               "id": 98942,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Ken",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057e89",
               "name": "Brittain Frye",
               "profile_path": null,
               "id": 98943,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057e8d",
               "name": "Maria Ford",
               "profile_path": "/gvdUFforg6OTJm8H22bHev1zFRU.jpg",
               "id": 97880,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Janine",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057e91",
               "name": "Hope Marie Carlton",
               "profile_path": "/rHV6awTrcHMmSU3Xovpp6ZVhTIv.jpg",
               "id": 98944,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Diane",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057e95",
               "name": "Brandi Burkett",
               "profile_path": "/tIMY9YYawuLECCRhA0SOiyibkuq.jpg",
               "id": 98945,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Susie",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057e99",
               "name": "Maria Claire",
               "profile_path": null,
               "id": 88527,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Duncan",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ea1",
               "name": "David Greenlee",
               "profile_path": null,
               "id": 98947,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "The Weirdo",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057ea5",
               "name": "Yan Birch",
               "profile_path": null,
               "id": 98948,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Tom",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ea9",
               "name": "David Kriegel",
               "profile_path": "/ZaFsIbsB9Tt9ReoB7vLPNzBeaX.jpg",
               "id": 52418,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Morgan",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ead",
               "name": "Michael Harris",
               "profile_path": "/eKUvQvW9VlSfw2MSHBRphF8xrf6.jpg",
               "id": 98950,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057eb1",
               "name": "Garon Grigsby",
               "profile_path": "/1ut7i6FpCsbae0nBRPm0t4Pl1Xl.jpg",
               "id": 98951,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Frank",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057eb5",
               "name": "David Lawrence",
               "profile_path": null,
               "id": 98952,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Sarah",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057eb9",
               "name": "Devon Jenkin",
               "profile_path": null,
               "id": 98954,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Officer O'Reilly",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ebd",
               "name": "Wayne Grace",
               "profile_path": "/cLpzZ67EY36fChyzW83pjynoAfp.jpg",
               "id": 52145,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Detective Davis",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ec1",
               "name": "Alexander Folk",
               "profile_path": null,
               "id": 9299,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Pizza Girl",
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057ec5",
               "name": "Marta Kober",
               "profile_path": null,
               "id": 92758,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Juliette",
               "gender": 1,
               "credit_id": "59b1e470925141072308e2a6",
               "name": "Lulu Wilson",
               "profile_path": null,
               "id": 98946,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Uncle Billy",
               "gender": 0,
               "credit_id": "59b1e470c3a3682d8703d455",
               "name": "Ron Smith",
               "profile_path": null,
               "id": 1292605,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057e75",
               "name": "Sally Mattison",
               "profile_path": null,
               "id": 98939,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4565c3a368484e057e7b",
               "name": "Catherine Cyran",
               "profile_path": null,
               "id": 98940,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057e81",
               "name": "Jürgen Baum",
               "profile_path": null,
               "id": 98941,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ecb",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.356727,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27767,
      "vote_count": 25,
      "budget": 0,
      "overview": "After a hard day of volleyball at the beach, a teen whose parents are away decides to have a slumber party with her girlfriends. Their boyfriends predictably show up to scare them, but a stranger from the beach is also seen lurking around the house. Soon the group begins experiencing an attrition problem.",
      "similar": [
         10735,
         27586,
         3981,
         858,
         112160,
         634,
         948,
         437557,
         242224,
         258480,
         17130,
         43923,
         1991,
         141,
         401898,
         297762,
         394117,
         244772,
         376660,
         129139
      ],
      "original_title": "Slumber Party Massacre III",
      "runtime": 87,
      "poster_path": "/h6Uyoi3Ppb5viyTPVtx3ysO1xnp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1990-09-07",
      "vote_average": 5.2,
      "belongs_to_collection": {
         "backdrop_path": "/d90ninW84rPsHNajdsxM5fQauBR.jpg",
         "name": "The Slumber Party Massacre Collection",
         "id": 138971,
         "poster_path": "/hbNwVI7tOr4uWeigv8p7q42MUS7.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sally Mattison"],
      "runtime": 87,
      "synopsis": "A group of teenage friends are playing volleyball at a Los Angeles beach. Jackie is sitting with Diane talking when a strange man appears and sits at the beach near them and stairs at the girls. Duncan walks up to the weirdo and tells him to keep his eyes to himself. Duncan then mentions to Diana and Jackie about a party, but they tell him that it is a slumber party and guys are not invited. Juliette goes to get the volleyball and talks to her boyfriend Ken. As they are leaving, Jackie goes back to for something and drops her address book. When Sarah gets into her car, she is grabbed by an unseen person and a drill is run through her stomach from behind the car seat. Frank drives Jackie home and they kiss for a minute. When they approach the front door, they see that it is wide open. Inside the house is Morgan, who though it was an open house since Jackie's parents are moving. Jackie says that he can stay and look around for a while. After Jackie listens to a mysterious voice on her answering machine, an apparently nervous Morgan finally leaves. Later, Jackie's friends arrive for the slumber party and telling her that Sarah did not answer at home and suggests that she may have flaked out on them. Morgan calls the girls (while he is spying on them through a telescope from his house across the street) and he asks Jackie if he can look at the house again. Jackie responds negatively. A little later, when Juliette and Maria playfully perform a striptease, Frank, Tom, and Michael scare them with masks. Jackie tells the guys to leave. The weirdo from the beach is hanging outside the house, spying on the girls. Frank and Tom go to get something for the girls, and Michael goes to apologize for scaring them. He knocks on the front door, and girls ignore him. When he walks away he has an encounter with a masked person and he runs back to the door and bangs for help. He gets impaled with a \"house for sale\" sign post. The masked killer drags his body away and returns the post to the front yard. A little later, Ken calls Juliette wanting to speak with her, and she invites him over. Duncan waits outside and sees a pizza delivery girl arriving with a pizza. He bribes the pizza girl to switch shirts and let him have the pizza. Duncan delivers the pizza to the girls and to say \"I'm sorry\" to them for the prank earlier. The girls let him into the house. The pizza girl (wearing Duncan's shirt) is walking down the street when she is chased by the unseen killer and drilled in the back. At the house, Jackie is talking with Diane when they hear a noise and see the weirdo outside. Jackie calls the police, but Officer O'Reilly on the other end of the line thinks that it's \"just a bunch of girls with overactive imaginations.\" The girls let Frank and Tom inside, and Ken appears right behind them and enters the house too. Frank gives Jackie some flowers and apologizes. Meanwhile, the weirdo from the beach gets into the basement. Susie shows her boyfriend, Tom, a swordfish on display in the basement and the two of them kiss. Upstairs, Juliette is upstairs making out with Ken and when her hand moves over to his crotch, he stops her. Janie hears them and tells the others \"they're doing it!\" Tom accidentally drops the pizza on the carpet and Susie gets some bleach to clean it up. Juliette goes into the bathroom to shower, and Ken leaves. She finds a vibrator in the bathroom, she plugs it in and laughs. While Juliette is in the bathtub, the lights go out and someone enters the bathroom, turns on the vibrator, and throws it into the bath water, electrocuting Juliette. A few minutes later, Maria enters the bathroom, dries up some of the water that is on the floor, opens up a closet to get another towel and finds the dead Juliette. The group gathers together in the living room and Maria suggests that the weirdo from the beach killed their friend. Jackie calls the police again, but Officer O'Reilly still does not take their call seriously and hangs up. Ken suggests that he make a run for it and find his uncle, who used to be a police officer. As he runs out the front door, Tom joins him. As the two are running down the street, Ken stops by a lumberyard and suggests getting tools for better weapons. Tom finds a sledgehammer and gives it to Ken, who suddenly whacks Tom with it. Tom and Ken fight until Ken finally gets a chain saw and slices into Tom's legs. After Ken leaves, Tom sits up and begins to crawl away. Back at the house, Jackie goes with Frank to check the basement. After seeing the swordfish with the \"sword\" broken off, the find the missing piece sticking in the dead weirdo in a trunk. They realize that the weirdo is not the killer. Just then Ken calls the house from a payphone where he tells them that his uncle said it would be safer to stay inside the house. After Ken hangs up, he goes to a van and inside are photos of his cop uncle, the dead bodies... and the drill. Ken is the driller killer. Back at the house, Duncan goes to answer a knock on the front door and Ken barges in and drills him in the chest. Frank jumps on Ken from behind and the two men struggle. Morgan (still looking through his telescope) calls the police and reports a disturbance. Jackie hits Ken with a lamp, and Frank is knocked down by the drill. Jackie sits by Frank and tells Ken that he killed him. The other girls run but cannot get the back door open (because Ken had apparently lodged something between the sliding doors). Maria is separated and Ken approaches her. She sees Tom dead by the window after he bled to death after crawling back to the house. Janine runs in and knocks Ken on the head with a glass bowl. Janine and Maria run to the door, but Maria is swiped by Ken's drill. Janine jumps through the glass back door and collapses on the patio. \"What a waste,\" Ken says to himself as he starts up the drill to finish Janine off. Ken goes upstairs to look for the remaining girls. He walks into a room where the wounded Maria and terrified Susie are hiding. He finds Susie in a closet, pulls her out, and throws her onto a bed where he hits her. After Maria comes out of hiding, she hits Ken on the head with a lamp. Maria, Jackie, and Diane run down into the basement. They try crawling out of a window to escape, but Ken appears. Jackie shoots him with a spear gun, hitting him in the leg. They run back upstairs and find the dead Janine and her innards on the patio. When the wounded and angry Ken staggers up from the basement, Susie puts bleach in a bucket and throws it at him, blinding him. He swings wildly with his drill and hits Maria again, who pleads with Ken not to kill her. She says she knows he has been hurt and she seems to relax him by letting him touch her. He blindly gets on top of her, and Maria reaches for the drill. Ken becomes upset when her other hand moves around too much and correctly assuming she's trying to get at the drill, he manages to get to it first and kills Maria. Still blinded, Ken hears Susie's voice coming from the kitchen. Jackie and Diane are standing by the front door to the kitchen waiting for him to make his move. Ken heads for Susie until Diane calls out and gets his attention. They knock the drill away from Ken and throw a volleyball net over him, while Diane whacks him with a baseball bat until he is knocked out. Having finally subdued him, Jackie goes to call the police in the next room. Ken wakes up and his vision begins to return as Susie and Diane stand guard over him. Ken thinks back to his insane Uncle Billy whom apparently motivated him to become the killer that he is. Ken then jumps up and grabs Diane. Susie tries to stab him, but he knocks her to the side and fatally stabs Diane. Jackie runs in, seizes the drill, and drills Ken to a bloody death. Relieved that it's finally over, Jackie finds on the dead Ken a photograph of Uncle Billy with a young Ken.",
      "writers": ["Catherine Cyran"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100639/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNzA2Njk1MF5BMl5BanBnXkFtZTcwNzM2MzUxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Keely Christian, Brittain Frye, Michael Harris | See full cast and crew »"],
      "reviews": [
         "I love the first SLUMBER PARTY MASSACRE partially for nostalgia value but mostly because it's a genuinely fun movie, so I figured I'd give a go at this one, ignoring warnings such as the 4 Star Joe Bob review on the front of the video box. I watched it with several friends, and I'll tell you what, we never had such a good time making fun of a brain-dead exploitation movie before. This one really does reach new depths of stupidity, and for that reason alone I adore it! The plot is basically summed up in the title - Jackie (Keely Christian, whoever she is) throws one last sleepover party for her giggly high-school friends (who look no younger than 25), some dumb guys sneak over and try to scare them and a psycho killer shows up with his portable electric drill and starts laying into these idiots. Apparently the ladies in the house don't know how to open a door or window to escape, which becomes almost a running gag after awhile. They also hilariously fail to subdue the killer despite being given half a dozen chances to do some serious damage. The list of possible suspects is pretty ridiculous, especially the peeping tom next-door-neighbor, who spies on the girls dancing topless with his telescope, and \"The Weirdo,\" a mute voyeuristic albino who earlier in the day was caught staring at the girls during their beach volleyball game. There's one moment of sheer hilarity when the psycho surprises a guy at the door with his large, high-powered drill, sending a half-dozen lingerie-clad babes shuffling back and forth in front of the camera in a panic. Another highlight is Maria Ford's gratuitous bare-ass shot as she tries to escape up through the basement window but keeps falling. And we've all seen the standard electrocuted-in-bathtub death scene countless times before, scene, though instead of the usual hair dryer or radio being tossed in the tub, this time it's caused by a vibrator that one character plugs in and leaves sitting on the sink while she's taking a bath. A guy who gets his feet cut off with a chainsaw manages to crawl all the way back across town to the house in a matter of minutes. The acting (aside from the guy who plays the killer, who's awful) really isn't too bad for this type of film, some of the songs on the soundtrack are pretty good and if you like your movies trashy, bloody and silly, you'll find a lot to enjoy here. For sheer entertainment it gets a 7 out of 10 but playing by the rules of movie reviewing (i.e. quality), it's about a 3. I'll go ahead and give it a 4.",
         "This flick is loaded with those great ingredients that make a great slash flick. But this flick actually has moments of intensity with a truly insane psycho driller killer with some hilarious dialogue. This flick also has the dumbest slash victims in slash history. These girls are trapped in their own home. They have about 100 chances to escape and yet they stick around and run upstairs to hide. Awesome! I want extra cheese on my slash flicks. This flick has a big body count, a truly crazy killer, and a dozen red herrings- oh yeah and these girls are in their underwear for most of the flick. You got to love these type of flicks.",
         "This movie was very good for a B movie. The last 20 min of mayhem were wonderful. Maria Ford's acting was superb. Our favorite character was Janine because she was a dits. Hope Marie Carlton was good for the role. We loved Keely Christian's (Jackie) voice. Suzie was the sickest character. Get away from me Suzie. We are going to order this movie through the mail because it is so exciting! Dylan and Anthony",
         "After a hard day of partying on the beach a group of girls head to Jackies house for a slumber party. Little do they know a weirdo has followed them home. As the party begins, the girls drink beer, a weird neighbour spys on them and the freak from the beach hangs around outside spying on them. The guys turn up to scare the girls and get invited to the party. One of the girls invites a guy named Ken that she meet on the beach to the party. Before long a dead body is found in the closet and the girls panic. It's not long before they are all being chased by a psycho wielding a drill. WOW, I truly loved Slumber Party Massacre III, it was a great movie, but I had to look past a few things, most of the girls and guys could not act, the character were very stupid, they kept knocking out the killer then running off, leaving him to get up and resume killing. If you look past the stupidity of this movie you begin to see how much fun it is. The twist with this one is that the killer is one of the teenagers, or one of the weirdos, we don't find out until halfway through, the killer also has more of a character, he isn't just an escaped mental person, or someone that just decided to show up for no reason. The is alot of gore in this movie (and I saw the cut version) the deaths aren't all drills, there is a chainsaw and even a for sale sign comes into play. Over all this is the best of the three, many might disagree with me, but it's my opinion and I love this trilogy and I think the third is the best.",
         "If you didn't enjoy any of the previous films, than you probably will find no enjoyment from this one. However, I did enjoy this first film and I absolutely hated the second one. Now, we have another group of beautiful California co-eds who decide to throw a slumber party because someones parents are out of town for the weekend. Once these girls bust out their bikinis and brew, the terror begins. However, this time, it's not Russ Thorn or a 1950's resurrected rock star. Instead, it's a rather normal looking individual. And yes, he comes along with a drill. Check this movie out if you want to see people getting drilled from the front seat of a car, electrocuted in a bathtub and then stuffed in a garment bag, or maybe you want to see someone get impaled with a house for sale sign. There's plenty of good stuff here with SLUMBER PARTY MASSACRE III. 9/10",
         "This movie was so hilarious. The guy who wore all black was really weird. I never thought that I would be surprised at who the killer really turned out to be. The title of this movie does have a significance to it, that this is a movie made not only for slumber parties (very much so it is), but also for people who love slasher flicks (like myself). On a scale of 1 to 10, I give this movie an 8 (good enough to view).",
         "Third instalment of the SLUMBER PARTY MASSACRE series, despite the title & makers of the previous two films, is an in name only entry that has no connections to the first two films & is nothing more than a remake of the 1982 original, done much more violently & is not as inventive as the first film. With yet another crazed killer attacking the usual pretty heroines who are running around in their underwear & their lust filled beau's who decided to crash the party. The producers this time tried to give us a mystery killer to make it a little different from the two entries that proceeded it. But unless the box art you got is different than mine, they failed, the killer is revealed on the back of the video box! This time the killer is not a mental patient, but rather a traumatized youth, who was molested by his uncle & sets out to make his new found friends feel the brunt of his wrath as a result of what happened. Staying true to the previous entries, he also happens to love power drills, from which he uses one to bore holes into everyone of them, with the remaining intended victims attempting to stop his bloody rampage. The problem with SLUMBER PART MASSACRE III, is that a lot of the scenes from the original were repeated here, the pizza delivery person who gets drilled to death, the boyfriends who show up unannounced, the next door neighbour (in this case a creepy older male, while in the first, it was a pretty girl their age who winds up saving the remaining intended victims) who the girls shun. The boyfriend who pleads with the girls to open the door only for them to ignore his plea's while the killer gets to him first. A soon to be victim who opens the door assuming everything is alright only to get drilled (in this case a boy, while in the first film it was a dark girl who opens the door & gets killed) Thus there was hardly any suspense to the scenes & the likable teens from the previous entries (Well at least some of them were likable) is almost scarce here & the film falls back on the usual clichés of the girls calling the cops for help & the cops not believing them, running up the stairs when they have so many opportunities to gather together & run out the front door to escape him (but I guess if they did we wouldn't have a movie) The films killer is interesting though, he's fairly good looking & is a good actor, making the girls crush on him really believable & I thought he was creepy when he slipped into slasher mode, as he often times switches personalities, to a wise cracking killer, to a scared frightened little boy, which he does when he recounts his childhood during the rampage running & hiding from his uncle (at one point he cries & says he doesn't want to play this game anymore), he's sympathetic at times, almost as if he's forgotten the murders he's committed thus far & actually shows feeling (he cries a little after he sees his girlfriends body stuffed in a garment bag), like he's disgusted with what he is seeing, to transforming into his uncle's abusive personality & recounts some of the things his uncle yelled at him when he was younger (the killer barks out commands for the girls to do as he says & treats them like he's scolding little kids). That aside however, although I liked the film it's not inventive, the first did a sex switch take on the usual females stalked by a maniac slasher movie, the girls in the first were tough, sassy, smart & sophisticated, with a lot of the roles usually played by men in these kinds of movies, given to wome n, such as a gym coach, electrician etc. the girls in the earlier entry fought back against the killer, suffered much less horrible fates, while, the guys were the dumb ones that needed saving, SPM 3, however decided to follow the path of the vast majority of slasher films, although all the males dies horrible deaths as well, it's the men here that are smarter & tougher & come to the rescue of the girls, while make the female characters weak, frail, terrified, dumb & suffer far more horrible deaths, with one of the girls raped in a disturbing scene towards the end of the film. The killers past when revealed as to what happened to him & his violent rampage as he beats up the girls, before killing them & their beau's & his constant personality switches, as he recounts his emotions during certain times, as he was running from his uncle or mistreated & is also somewhat disturbing in the LAST HOUSE ON THE LEFT vein. Nonetheless the film is better than most of what is languishing on the shelf & fans of the series should love this, but if you hated the first two then don't bother with this. PROLOX TRIVIA: On the back of the box art for the original VHS release scenes from JIM WYNORSKI'S SORORITY HOUSE MASSACRE 2 were added by mistake, since both films were filmed at the same time & in the same house & bored almost similar titles & plots. *** stars",
         "SLUMBER PARTY MASSACRE III (1990) starring: Keely Christian, Brandi Burkett, Maria Ford, Maria Claire, Hope Marie Carlton, David Lawrence, David Kriegel, Brittain Frye, Lulu Wilson, Garon Grigsby, M.K. Harris, David Greenlee. plot: Jackie (Keely Christian) decides to invite her girlfriends over for a slumber party before she has to move away with her parents. Jackie is made a little uneasy when a strange man stares at her and her friends at the beach and her weird neighbor, Morgan (M.K. Harris) looks around the house suspiciously. By night, the girls are having fun just when the guys show up. But just when the guys show up, a drill-wielding masked psychopath stalks and kills them one by one. When the killer is revealed, the remaining survivors ban together to try and make it out of the house alive! the good: Yes, this is not very original, it borrows a killer motive from a very famous slasher film that I will not mention here, it borrows killer P.O.V. shots taken right out of HALLOWEEN and it has the same plot-line from the original THE SLUMBER PARTY MASSACRE, but all that does not say that this movie is bad, and not fun. SLUMBER PARTY MASSACRE 3 is a simple slasher film, a group of girlfriends gather for a slumber party, their boyfriends show up and they are killed off one-by-one by a masked killer, using the famous power-drill which is used in all three films. One thing that impressed me was that three of the main characters, Jackie (Keely Christian), Diane (Brandi Burkett) and Susie (Maria Claire) all seemed very real and down-to-earth. Even though Christian and Burkett look like the usual bimbos, they are not. I'm glad that these three lasted the longest, although 1 or 2 of them might die, I won't give it away. The final 20 minutes are also fun when the killer reveals themself while there are still a lot of character left to die, making many suspenseful and action filled scenes. The score by Jamie Sheriff was also very creepy and it worked for the film. the bad: The identity of the killer is not surprising at all. First of all it is just plain obvious, but it is also shown on the back of the movie box and in the trailer. It also seemed pretty dumb that certain characters said dumb lines after they discover that there friends are dying. Like a scene in the living room when the characters are waiting for two of the guys to come back with weapons, one of them looks at the pizza stain on the rug and says \"Jesus, the rug looks like crap!\" Or when two of them are going in the basement to lock the window, one spots a sword-fish on the wall and just says \"Nice fish!\" What kind of a friend finds you dead in a garmet bag and complains about a pizza stain or makes a joke about a fish less then an hour later?!",
         "This one is a lot better than the first one....it may not be up there with the greats, but it's worth seeing if ya wanna see girls running around in their bras and getting drilled to death! There should've been a special award given to this movie: Best Usage of a Drill! I haven't seen the 2nd one in the series...I plan to sometime...",
         "Director Sally Mattison and screenwriter Catherine Cyran eschew the usual playful humor that distinguished the first two immensely enjoyable films in this series in favor of a much darker, more harsh, and unpleasant approach to relating the standard story of an all-girls slumber party that's savagely crashed by a vicious killer brandishing an enormous power drill. The violence this time is extremely gory and sadistic, with the killer's distaff victims getting offed in assorted grisly and appalling ways (an electrocution by vibrator rates as the definite alarming highlight). The handsome and outwardly charming Brittain Frye makes for an unusual and interesting choice as the murderous Ken, who's the angry and unstable victim of sexual abuse by his police officer uncle. The gals are spunky and attractive, with stand-out contributions from Keely Christian as the cute and appealing Jackie Cassidy, the adorable Hope Marie Carlton as the cheery Janine, and Maria Ford as the foxy Maria, who sports a massive hairdo and bares her breasts prior to suffering a brutal and disturbing near rape by Ken and then meeting an especially gruesome untimely end. Moreover, the tone is quite grim and mean-spirited, with the deceptively breezy and lighthearted opening giving way to a much more cruel, twisted, and no-holds-barred ferocious sensibility that's anything but silly or inoffensive. It's this latter take-no-prisoners gritty and unflinching edge that in turn makes this slice'n'dice outing a movie that's deserving of greater respect and appraisal for boldly breaking away from the generally inane and innocuous mindset that was the prevalent attitude of the series prior to this last, most serious, and truly upsetting installment."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Concorde Pictures"],
      "summaries": [
         "After a hard day of volleyball at the beach, a teen whose parents are away decides to have a slumber party with her girlfriends. Their boyfriends predictably show up to scare them, but a stranger from the beach is also seen lurking around the house. Soon the group begins experiencing an attrition problem.",
         "School's out - everyone heads to the beach - a typical vacation. However, a mysterious murderer armed with a drill is killing people, yet at the beginning nobody notices him 'till it's too late. Meanwhile, a group of teenage girls decide to have a slumber party, and some of their boyfriends drop by. Soon, people begin to disappear. Then, an all out drill massacre begins..."
      ],
      "budget": 350000
   },
   "movielensId": 3940,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-09-07",
      "dvdReleaseDate": "2000-08-29",
      "directors": ["Sally Mattison"],
      "runtime": 87,
      "movieId": 3940,
      "title": "Slumber Party Massacre III",
      "mpaa": "R",
      "actors": [
         "Keely Christian",
         "Brittain Frye",
         "Maria Ford",
         "Hope Marie Carlton",
         "Brandi Burkett",
         "Maria Claire",
         "David Greenlee",
         "Yan Birch",
         "David Kriegel",
         "Michael Harris",
         "Garon Grigsby",
         "David Lawrence",
         "Devon Jenkin",
         "Wayne Grace",
         "Alexander Folk",
         "Marta Kober",
         "Lulu Wilson",
         "Ron Smith"
      ],
      "imdbMovieId": "0100639",
      "originalTitle": "Slumber Party Massacre III",
      "genres": [
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": ["3Zk8RZxp_4Q"],
      "plotSummary": "After a hard day of volleyball at the beach, a teen whose parents are away decides to have a slumber party with her girlfriends. Their boyfriends predictably show up to scare them, but a stranger from the beach is also seen lurking around the house. Soon the group begins experiencing an attrition problem.",
      "tmdbMovieId": 27767,
      "avgRating": 1.68103,
      "releaseYear": "1990",
      "numRatings": 116,
      "posterPath": "/h6Uyoi3Ppb5viyTPVtx3ysO1xnp.jpg"
   }
}