{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0215545",
      "video": false,
      "title": "Bamboozled",
      "recommendations": [
         49471,
         157036,
         85637,
         34152,
         68440,
         22067,
         70342,
         28121,
         282879,
         46902,
         81619,
         62522,
         26580,
         38809,
         45147,
         62330,
         69333,
         281710,
         76142,
         57978
      ],
      "backdrop_path": "/uSPOydK9mDMjcHJxW3MQZ9ALurx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Pierre Delacroix",
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e3ef",
               "name": "Damon Wayans",
               "profile_path": "/pdSOalf1r7GKlcUhpKeBntAqgA6.jpg",
               "id": 22675,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Manray / Mantan",
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e3f3",
               "name": "Savion Glover",
               "profile_path": null,
               "id": 80623,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Womack / Sleep'n Eat",
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e3f7",
               "name": "Tommy Davidson",
               "profile_path": "/q0f7F4jYfZ5XvcaeBxtbQlfltLX.jpg",
               "id": 88059,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sloan Hopkins",
               "gender": 1,
               "credit_id": "52fe44a3c3a368484e02e3fb",
               "name": "Jada Pinkett Smith",
               "profile_path": "/Pb8KeGa4kTgJqS2ASoYvbNHbLr.jpg",
               "id": 9575,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Thomas Dunwitty",
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e3ff",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mau Mau: Big Blak Afrika",
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e403",
               "name": "Yasiin Bey",
               "profile_path": "/x51WKi3gxwobt9Sov5HeS5kKHUe.jpg",
               "id": 4239,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mona",
               "gender": 0,
               "credit_id": "52fe44a3c3a368484e02e407",
               "name": "Cheryl Lynn Bowers",
               "profile_path": "/fyqCbnYoJ63s8v0zic5T2TaCUdW.jpg",
               "id": 163962,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Honeycutt",
               "gender": 2,
               "credit_id": "5861c8bfc3a3681a6803e0a3",
               "name": "Thomas Jefferson Byrd",
               "profile_path": "/pFmHmzQ3rS9ZD8A2eDXzk6wkHT6.jpg",
               "id": 98889,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Junebug",
               "gender": 2,
               "credit_id": "5903f129c3a3684a760034e9",
               "name": "Paul Mooney",
               "profile_path": "/1Z47JEvyzlzIA1QsBNahZfvpUv8.jpg",
               "id": 81149,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "59179557c3a36842d603adcf",
               "name": "Matthew Modine",
               "profile_path": "/tEQG1Us5IuoKYtufZe6waWtxfeg.jpg",
               "id": 8654,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Herself",
               "gender": 1,
               "credit_id": "5917957092514156f503a4ca",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Papo",
               "gender": 2,
               "credit_id": "59179688925141583c038d85",
               "name": "Coati Mundi",
               "profile_path": "/aXqV0MhjbU9yTHuHK5inO7cA2Eo.jpg",
               "id": 33662,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e3eb",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58f186c19251412fb900039b",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "58f186e99251412fb50003d3",
               "name": "Ellen Kuras",
               "profile_path": "/4q0al0rnELLMn9vt9sMyAEqfxeo.jpg",
               "id": 313,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5903f193c3a3684b0700334a",
               "name": "Terence Blanchard",
               "profile_path": "/vwmLEwopuomO3avDEYlDQ1QN9sh.jpg",
               "id": 5287,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "591795269251415852039cfe",
               "name": "Jon Kilik",
               "profile_path": null,
               "id": 4446,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "591796b2c3a36840aa034b91",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "591796d892514156f503a5d8",
               "name": "Samuel D. Pollard",
               "profile_path": null,
               "id": 18747,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.096766,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24664,
      "vote_count": 32,
      "budget": 0,
      "overview": "TV producer Pierre Delacroix (Damon Wayans) becomes frustrated when network brass reject his sitcom idea. Hoping to get fired, Delacroix pitches the worst idea he can think of: a minstrel show. The network not only airs it, but it incredibly becomes a smash hit. Michael Rapaport co-stars in this searing satire.",
      "similar": [],
      "original_title": "Bamboozled",
      "runtime": 135,
      "poster_path": "/fQSSto6W417GTH9wZmKrgObn1Q5.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "40 Acres & A Mule Filmworks",
            "id": 4319,
            "origin_country": ""
         },
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-10-06",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Spike Lee"],
      "runtime": 135,
      "synopsis": "In a New York City residence, Pierre Delacroix (Damon Wayans) rises to begin his daily routine. Brushing his teeth, he gives us by voiceover a definition of satire. He tells us that with the rise of the Internet, video and interactive games, his field as a television writer has seen a drop in popularity. Meanwhile, in a dilapidated building, squatter Womack (Tommy Davidson) wakes up his friend Manray (Savion Glover) for a day of work. This consists of travelling to the CNS (Continental Network System) building where Delacroix works, and Manray tapdancing to entertain the workers. They then collect money from the workers. The men see Delacroix, and ask him for monetary help in the form of work of some kind. Delacroix walks into a staff meeting late and is immediately castigated by his boss, Thomas Dunwitty (Michael Rapaport). Dunwitty informs the staff that CNS has poor ratings. He tells them that he wants them to write funnier material, and adjourns the meeting. In the privacy of Dunwitty's office, he tells Delacroix that the material he's been writing for Dunwitty seems like it's about white people with black faces. Dunwitty asserts that Delacroix is an \"oreo\" with his Harvard education, because he won't write a \"n----r show.\" The next day, Delacroix and his assistant Sloan Hopkins (Jada Pinkett Smith) talk. They've decided that Manray is the solution to his problem. Delacroix plans to write a show that will be so \"offensive and racist,\" it will prove his point that the network only wants to see black buffoons on the air. Delacroix simply hopes to be fired, so he can be let go of his contract with CNS. Manray and Womack ask at the receptionist's desk for a \"Delapoint\" and the men working there tell them to step outside. However, Sloan steps into the lobby, sees what's happening, and escorts Manray and Womack to Delacroix's office. Delacroix explains to them that he has an idea for a television pilot, and they can make money with it. His main request is that Manray changes his name to Mantan, in an apparent homage to black character actor Mantan Moreland. On Sloan's walk home, she runs into her big brother Julius (Mos Def). In Sloan's apartment, Julius and Sloan argue about his values, and he tells her to introduce him and his political hip-hop crew, the Mau Maus, to Delacroix. Delacroix has a meeting with Dunwitty. Delacroix suggests that the network start a variety show called Mantan: The New Millenium Minstrel Show. Delacroix says that new faces are needed for the show, and has Sloan bring in Manray and Womack. The two men, renamed \"Mantan\" and \"Sleep 'N' Eat,\" will exhibit a range of stereotypical traits, Delacroix explains. Sloan is opposed to the proceedings, and warns that there will be protest of the show they are planning. To seal the package, Manray dances atop a table in front of Dunwitty. Delacroix, Sloan and another woman hold auditions for the show. The first group of people (The Roots) audition to be the show's house band, The Alabama Porch Monkeys. After they perform, a dancer, a vulgar man shouting \"I be smackin' my hoes,\" and a didgeridoo player all audition. The next hopeful is Honeycutt (Thomas Jefferson Byrd), an actor who bungles Shakespearean quotes and proclaims \"N----s is a beautiful thing.\" Delacroix looks over a revised script for the show and confronts Dunwitty and his co-writer, Jukka. Delacroix says that he won't be responsible for their changes, which Dunwitty says are to make the show funnier. Dunwitty says he knows black people better than Delacroix does, telling him, \"Look at all the brothers on the wall.\" Dunwitty tells him not to interrupt them, and Delacroix expresses impotent rage at this before leaving. A dressed-up Honeycutt steps onto a stage and introduces himself to a TV studio audience. Backstage, Womack and Manray create blackface from burned cork, apply it to their faces, and don fire-truck red lipstick. Mantan, Sleep 'N' Eat and the Alabama Porch Monkeys are unveiled to the audience. People in the audience are shocked and dismayed as the two men employ self-deprecating racial humor and Mantan tapdances. The white people in the audience are mostly scared to laugh or vocally show their enjoyment, but black people around them clap and laugh. The whites thus feel sanctioned in enjoying the show. A sign near the stage says \"Howl!\" and the non-blacks, seeing the entertained blacks around them, applaud. To Delacroix's displeasure, the CNS executives order 12 shows of Mantan for a mid-season replacement. As the show becomes more and more popular, sides are chosen in the resulting battle over representation, and finally, tempers fly, resulting in a tragic conclusion.",
      "writers": ["Spike Lee"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0215545/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2ODIzMjUyMV5BMl5BanBnXkFtZTYwNzEyMzY3._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Damon Wayans, Savion Glover, Jada Pinkett Smith | See full cast and crew »"],
      "reviews": [
         "The film \"Bamboozled\" has caught a lot of heat for it's portrayal of blackface (an issue that wasn't really talked about until the release of \"Bamboozled\") Writer Pierre Delacroix (Damon Wayans) sees his pitches for TV shows being rejected one after another. He is upset with his job and his boss Thomas Dunwitty (Mike Rappaport) He is under contract, he cannot quit because he will be sued. So he decides to get himself fired. He plans on reviving blackface and hopes that it'll be so controversial that CNS will be under fire and he'll get fired. He recruits two street performers Manray (Savion Glover) and Womack (Tommy Davidson) and pitches the show to his boss. The show gets green lighted, but unfortunately it becomes a big hit and destroys his whole plan. Spike got some heat for this (mainly because he criticized previous films for the way blacks are shown, then he made a film with blackface) But what people don't understand is that this is a satire. The images of rappers and \"Timmi Hillnigger\" are all poking fun at today's society. \"Bamboozled\" is clever and one of Spike's most explosive films next to \"Do the Right Thing\" and \"Malcolm X\". This film has Tommy Davidson performing in blackface, in a very funny routine. I wanted to laugh but at the same time it made me think. This sketch was making me laugh at every stereotype about my people that I hated. That was the smart thing about \"Bamboozled\", it caught you in the act of doing something and made you think. \"Bamboozled\" is a well thought, mentally challenging film that'll change your life. Bamboozled- rated R **** out of ****",
         "I am absolutely embarrassed right now that I have never watched a Spike Lee film before. I have always wanted to see Do the Right Thing, which is generally considered his best film, and I even rented it once, but never got around to watching it. When Bamboozled opened last year, it sounded very interesting, but after the critics dismissed it as a failed attempt at satire, I decided to catch it later on, perhaps after I saw Do the Right Thing. Then I saw it was going to be played on television, so I found the time and sat down to watch. What I saw was something absolutely amazing. And that's not to say that Bamboozled doesn't have its flaws. I would personally deem it a flawed masterpiece, a very flawed masterpiece. The critics were right: Lee's satire is misplaced. He's far too hotheaded an artist to have realized this immediately, but he should have when the New York Times refused to run the movie's add, which depicted a sambo character eating a watermelon, because they feared protests. Bamboozled asks us to suspend our disbelief - a disbelief which Spike Lee may not have had himself - and accept that a TV network would produce the New Millennium Minstrel Show and that the public, a la Mel Brooks' The Producers, would eat it up. Lee's argument in the press is that this was already happening. His targets were rap videos and a show on the WB network that only produced something like 6 episodes (the show was about Abe Lincoln's black servant who single-handedly ran the country; Lincoln was the buffoon). The reason that the New York Times didn't run Lee's add is the exact same reason Lee wrote the film in the first place: African American political activists, including Lee, often have very knee-jerk reactions to such things. The show about Lincoln, which Lee argued was set during the \"holocaust\" of his people, actually showed the white people to be the buffoons and the blacks to be their manipulators. He missed the point (which could very well have been due to the fact that the show sucked anyhow). Add to this the fact that, besides clips of Good Times and The Jeffersons, both of which, I ought to add (in my own opinion), Lee is taking out of context (he would have been much better off to feature Diff'rent Strokes, which is somewhat offensive), all of the clips he uses to demonstrate the abuse of his race must have been downright difficult to dig out of film archives. None of these cartoons or movies that are shown, nor most of the sambo toys, have been seen for some thirty years or more, most probably not since before Spike Lee was born. We all know they exist, and, as Sloan (Jada Pinkett Smith) says in the film, we oughtn't to forget whether we're black or white, but it doesn't work as satire to show these things. They aren't at all harmful now, not until you drag them up again. Then they're only offensive when knees start jerking. None of this matters, in fact. Not to me, anyway. In my opinion, film today has become far too complacent. Bamboozled is an enormous jolt to our current, apathetic world. The fight may be misdirected and wholly fabricated by a paranoid man, but Spike Lee is indeed a masterful director. In fact, I would very favorably compare this film to Jean-Luc Godard's Le Week-End, which was also somewhat misdirected in its satire. Both of these films are excellent. Bamboozled moves with a speed and passion almost completely foreign to the world of filmmaking today. It's angry, it's brazen, and it makes your heart pound with fear, sadness, and intensity. It also raises more difficult issues than any film I've seen in a very long time. It manages to do this while remaining funny, too, although I was always wondering whether Spike Lee would slap me for laughing at this stuff. I especially loved the Tommi Hilnigger Jeans commercial. But even the New Millennium Minstrel Show is presented in a humorous way. A lesser artist, I believe, would have made it more clearly offensive. As it stands, it's difficult not to laugh at Mantan and Sleep-N-Eat (probably the most jaw-droppingly funny and ballsy name I've ever heard) as they perform. Tommy Davidson and Crispin Glover put enough energy in these stage performances to electrocute you. Their performances are awesome - often the dialogue they do have is cliched, but in many small moments their faces clearly express, and subtly, too, how their lives are crumbling. I would also like to compliment Jada Pinkett Smith, who turns in the film's finest performance. I have a feeling she's just going to get better and better, if someone would give her another decent role. Michael Rapaport, although perhaps a little too cartoony, is still very funny. Damon Wayans has the most difficult part. I'll bet money that he and Lee KNEW that the critics would immediately jump on Wayans' fake white accent. I can't imagine they thought it was all that funny or believable. However, I'm not sure why they did it. It does detract a little from the film, though not as much as many critics claimed it does. Personally, I would have either had that accent fade as the film went on. It sounds especially bad when it comes back at the end, after all those powerful (if pointless) scenes of African Americans in the cinema. Although, as that very phony voice is brought back, we recall the way the film began... Other aspects of the filmmaking are excellent as well. I have already praised Lee's direction. It is quickly paced and he really knows how to move his camera. The editing is fantastic. A powerful rhythm is established right away and never abandoned. In fact, the film pulls a daring change from satire to melodrama about halfway through, another aspect of the film that people complained on end about. It is all done with gusto, especially in the editing. The cinematography - wow! This and Lars von Trier's Dancer in the Dark show how worthwhile digital video is. Lee and his DP use it to an amazing degree! When characters are moving fast, which happens most often when Mantan is tap-dancing, a blur is left on the screen for a split second. Late in the film, when Mantan is trying to free himself from the show, Lee causes these blurs to remain onscreen for a prolonged period of time. The effect is simply powerful. One major complaint I have is the score. It's often manipulative. I think it would have been better to have had a minimalist score, which would have made the film seem even more immediate. Like I said, there are many major and legitimate complaints against Bamboozled, but critics and audiences forgot what's going for it: it is EXCELLENT CINEMA. 9/10.",
         "Being white, and european, I'm not really sure about the point of this movie seen in an american perspective. But as a european it really opened my eyes to a strange fact: if your only knowledge about black America comes from television, you WOULD really think, that all afro-americans were gangsters, rappers or Urkel-like comedians, that is: stereotypes. You very rarely see an american show, or movie, where a black american is portrayed as a complex human being. And that really IS scary.",
         "I approached this film with trepidation due to the mixed reviews(in particular, the flat-out negative review of Ebert at the Movies). Knowing Lee's penchant for controversy, but knowing also his unflinching honesty and passion about his position, I decided to give this film a chance. I consider myself an educated, articulate, middle-class black-american. And I was wary of Lee's supposed satire which centers on the creation of Minstrel show for the new millenium. By the time I credits rolled, I was applauding. In this film, Lee takes no prisoners, he neither excuses the white establishment for its entrenched and hard-to-expose racism nor does he excuse the blacks and other non-whites who become the literal agents of this process. This story of two young black men's rise to financial and commercial glory through demeaning themselves, their talent and by example the group of people from which they hail, is an allegory. Rather than getting stuck in a discussion of this film's form, viewers should consider what it means about the world around them. The disturbing and unnerving finale, is a suitable response to our rising awareness of inner-city violence, hip-hop culture, the prison industrial complex, and the police state in which many blacks, poor or not, find themselves a part. Instead of offering us solutions this film offers us, as in many other of Lee's films, a wake up call. As in the body of Lee's work, the camera work gives a gritty cinema verite feel to the scenes, and the performances of Glover, Davidson, Pinkett, Wayans, and Rappaport are dead-on. The cast has a good chemistry and the dialogue will have have you howling with disbelief and laughter. An incredibly important film, for any consumer, and by definition, any creator of popular culture who may be responsible for the perpetuation and dissemination of DAMAGING and DEGRADING stereotypes. Thank you, Mr. Lee.",
         "I was lucky enough to see the Philadelphia premiere of this movie at the U. of Penn, with Spike Lee in attendance, and I left the theatre feeling almost speechless. I've seen most of Lee's films and have mixed emotions and reviews of each of them; however, this film is truly a MASTERPIECE of filmmaking. Without giving away the many-layered plot, which must be experienced to be appreciated, the subject is a touchy one --- controversial and poignant, embarrassing and humiliating, enlightening and insightful. Mainstream white audiences ( of which I am a part ) may find the subject to be uncomfortable --- obviously one of Lee's goals here --- and all audiences will find certain parts of the movie to be terrifying. Besides the storyline, the acting is wonderful across the board, and Daman Wayans deserves an Academy Award for his over-the-top role. Spike Lee's \"Bamboozled\" should go down in history as one of the most important films about race vs. social status and the misconceptions and stereotypes that surround them, as well as being a magnificent movie about popular culture and the almighty dollar. It is alternatingly hysterical, contemplative, witty and violent, and I left the theatre in tears, totally speechless. Unfortunately, this will probably be a short-lived film in your local cineplex, but hopefully it will gain enough serious attention to win the accolades it deserves, as well as open some closed eyes and minds.",
         "This is Lee's best film. It isn't heavy handed despite the explosive topic. In fact I would argue that the images in this film are less offensive then some of the depiction of African-American life seen on MTV or BET. Less heavy handed then some of the vulgar depiction of my community that is allowed to be foisted on my community as entertainment. The modern minstrels show can be seen any night of the week on America's cable music networks. Which is more embarrassing Lil'John, 50 cent or Mantan? Which has had a bigger impact on the daily lives of African-American children, images of Step- N-Fetch it or Lil'John? Which are the stereotypes that are used to justify racial profiling in the larger public of the country in 2006, Gangstas or minstrels performers? It is a film about the power and responsibility of black America to control the images that define it. I think Lee for the first time in a long time had a story he actually wanted to tell. The script was solid if not great. As usual Spike had a tough time with his female characters. The women in his films tend to be two dimensional. All good or all bad. It wasn't a perfect film but I think it will be remembered as one of Spike's most interesting.",
         "This could have been a brilliant film. The problem I had with this film is that Spike Lee had too many ideas he was trying to pursue, and should have kept to the single focus. Yet, there were some brilliant scenes. We see a black gangsta group of hip-hoppers and one scene shows a member drinking out of a bottle shaped like a rocket. Later on we see a commercial for this product. Subtle and interesting. The film clips from old films and the display of of toys during the endtitles, were fascinating and could have made an interesting documentary. One thing I didn't like, besides the stereotypical white bigots, was Lee's focusing upon 40s black comedian Mantan Moreland as the epitome of black humiliation. Moreland was a brilliant comic who stole the show from the white actors of the day. Whites and Blacks turned against Moreland during the civil rights movement and the man could hardly make ends meet. Before he died in the early 70s, opinion changed again and he was seen as a pioneer. He once again managed to get some work in films and tv before his death. A better target for Lee should have been Stepin Fletchit, who made a career out of playing a lazy black freeloader. I have to agree with Lee on hip-hop as a minstrel show. The gold chains, oversized sport jerseys, and baseball caps worn sideways are clownish and not far removed from the olden days when blacks played buffoons to entertain white people. The show is still going on....",
         "Director Spike Lee has a big quantity of people who love his movies and people who hate them.The people who critic him say his movies which contain a message about racism produce damage.The people who love his movies say that Lee gives that messages to remind the people the facts with the intention that they have not to repeat anymore.Personally,I think Lee is a unique and extraordinary director who makes films with a big stylistic and narrative impact.And,the best thing of all,Lee leaves the spectator thinking after watching his movies.Bamboozled is another great film directed by this awesome director.Bamboozled is a very powerful movie with brilliant dialogs.The performances are perfect.Damon Wayans is a great actor very natural and expressive.Jada Pinkett Smith is excellent on her role.Michael Rapaport is a brilliant actor and,here,he brings the best performance of his career.Bamboozled is a great,fun and totally intelligent film directed by an awesome director.",
         "first, the criticisms: the acting is bad. the camera-work is only competent. the narrative is weak. now the praise: my jaw dropped a number of times during the viewing. I couldn't believe I was watching an American movie. more so than other movies, bamboozled is entirely a result of entertainment. the world the movie depicts is centered on a TV network (entertainment producers and distributors), the narrative within the movie looks at entertainment (they're making a TV show!), and there is the film itself (which is entertainment). but the things the actors say! if there is such a thing as a monolithic white America and a monolithic black America, many many lines that spike wrote can NOT be said in polite company. and the events that transpire! the very idea of a c.2000 minstrel show is enough to provoke discussion and examination. the non stop barrage of highly charged race signifiers (speech, clothes, ideas, the blackface fabrication and application, etc) contributed to a very specific tone of outrage and cynicism. so it's fascinating because it's brilliantly done. but it's a failure because it's not quite a movie. could spike really have intended to make a satire of a movie, where the story of the movie is to make a satire on TV? in short, the (often intense) reaction this movie engenders is worthwhile in itself. however, the movie feels to me like an intentioned, crafted harangue, which lowers its worth as entertainment, and establishes itself as a diatribe.",
         "TV writer Pierre Delacroix (Damon Wayans) is tired of having his TV concepts rejected by the studio. Accused by his ultra-\"hip\" white boss Dunwitty (Michael Rappaport) of not being \"black\" enough, an enraged Pierre comes up with an outlandish idea: a modern-day minstrel show, complete with black-face, musical revue numbers, racial epithets, and the most ridiculous stereotypes imaginable. He enlists the aide of his reluctant secretary Sloane (Jada Pinkett Smith) and two street dancers Manray and Womack (Savion Glover and Tommy Davidson) desperate for a buck. Pierre is flabbergasted when the network accepts the show, and then becomes a pop culture phenomenon. But not everyone enjoys the racial epithets the show provides, and the Maumaus, a group of wannabe gangstas/rappers, decide to take matters into their own hands - with tragic results. Spike Lee's \"Bamboozled\" is certainly an ambitious film. It is an unremittingly vicious satire of the portrayal of blacks in popular media, a topic all too open to attack from Lee's inflammatory eye. However, having set up a potentially great and scathing satire, Bamboozled ultimately fails by being just too broad and over-the-top in its target. Lee is certainly right in attacking media portrayal of African-Americans. And for the early sections, it works. The most effective is the portrayal of pop culture - namely gangsta rap and hip-hop. The Maumaus are ridiculous posers who don't even notice that one of their number is white. The TV ads for Blow Cola and Timmi Hiln!gger showcase the artificiality and toxic nature of gangsta culture. Women are hos, bitches, and sluts; the men are cool because they do drugs and kill people. Lee's double-edged sword goes after the white media (embodied by the embarrassingly patronizing boss Dunwitty) for perpetuating such images, but also the blacks who embrace it. Very few societal targets, regardless of race or position, escape Lee's critical eye. The film's use of clips from minstrel shows of the past, as well as cartoons and other caricature portrayals, as well as the commentary of Sloane, to make the point reverberate. All of this is brilliantly done, and the witty dialog and character interactions of the first half indicate that Lee has winner on his hands. But the film ultimately fails due to the methods it employs. Seriously... is there a sentient human being alive who thinks that there would be a TV audience for a MINSTREL SHOW? Black face is such an inherently, blatantly offensive concept that it's impossible to take it seriously. For lack of a better word, it's overkill. And by showing it again and again, Lee rather overdoes (and undermines) his point. We get it; this show is racist and humiliating. Wouldn't Lee have better made his point by keeping the focus on the contemporary equivalent, or at least gone about it in a more subtle manner? Of course, \"Bamboozled\" is a satire, so hyperbole is expected. But, there are limits to this, particularly within the media of film. Be too outlandish and over-the-top, and the point is lost. Jonathan Swift's \"A Modest Proposal\" works because it is a written essay, where the venom beneath Swift's seemingly earnest tone is almost undetectable. In \"Bamboozled\", however, we see starkly outrageous images of minstrel shows about black-faced, watermelon-eating, chicken-stealing blacks (and the black-faced fans who love and emulate them). And that image in and of itself blots out the point Lee is trying to make with such images. We don't remember that the media is demeaning towards blacks; we remember the minstrel show. The movie is also damaged by its cop-out ending, which uses violence as an easy solution to the problems it has set up. One could argue that Lee was attempting to show the detrimental effects Delacroix's show had on society. Thanks, but I'm not buying that. Whatever justice that argument has is killed by the ham-fisted, rushed way the climax is executed. The acting is uniformly solid. Damon Wayans, an actor I usually dislike, makes Pierre an intriguing character. Pierre's descent into hell - ultimately embracing the stereotypes he presents through his work - is fascinating. Jada Pinkett-Smith gives a quietly effective performance as the film's conscience, although her actions at the end seem ridiculously out-of-character. Savion Glover and Tommy Davidson are both extremely likable as two characters who slowly realize what they're doing is wrong. Michael Rappaport's hopeless studio VP is hysterical, and provides some of the film's best moments. In short, \"Bamboozled\" is an extremely ambitious film that starts out great, then becomes so outlandish and over-the-top its point is obscured. Regardless, one should note it is very much a point worth making. 6/10"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "40 Acres & A Mule Filmworks"
      ],
      "summaries": [
         "Dark, biting satire of the television industry, focusing on an Ivy-League educated black writer at a major network. Frustrated that his ideas for a \"Cosby Show\"-esque take on the black family has been rejected by network brass, he devises an outlandish scheme: reviving the minstrel show. The hook: instead of white actors in black face, the show stars black actors in even blacker face. The show becomes an instant smash, but with the success also comes repercussions for all involved.",
         "A frustrated African American TV writer proposes a blackface minstrel show in protest, but to his chagrin it becomes a hit."
      ],
      "budget": 10000000
   },
   "movielensId": 3943,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "2000-10-06",
      "dvdReleaseDate": "2001-04-17",
      "directors": ["Spike Lee"],
      "runtime": 135,
      "movieId": 3943,
      "title": "Bamboozled",
      "mpaa": "R",
      "actors": [
         "Damon Wayans",
         "Savion Glover",
         "Tommy Davidson",
         "Jada Pinkett Smith",
         "Michael Rapaport",
         "Yasiin Bey",
         "Cheryl Lynn Bowers",
         "Thomas Jefferson Byrd",
         "Paul Mooney",
         "Matthew Modine",
         "Mira Sorvino",
         "Coati Mundi"
      ],
      "imdbMovieId": "0215545",
      "originalTitle": "Bamboozled",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["aPBmOEpviOg"],
      "plotSummary": "TV producer Pierre Delacroix (Damon Wayans) becomes frustrated when network brass reject his sitcom idea. Hoping to get fired, Delacroix pitches the worst idea he can think of: a minstrel show. The network not only airs it, but it incredibly becomes a smash hit. Michael Rapaport co-stars in this searing satire.",
      "tmdbMovieId": 24664,
      "avgRating": 3.13551,
      "releaseYear": "2000",
      "numRatings": 797,
      "posterPath": "/fQSSto6W417GTH9wZmKrgObn1Q5.jpg"
   }
}