{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "tap dancing",
         "id": 4345
      }],
      "imdb_id": "tt0210584",
      "video": false,
      "title": "Bootmen",
      "recommendations": [
         70515,
         410259,
         25758,
         198318,
         43334,
         362583,
         258548,
         22915,
         211085,
         347627,
         365452,
         41760,
         60778,
         387889,
         56087,
         64523,
         43079,
         17190,
         185440,
         16216
      ],
      "backdrop_path": "/zYbsfhGi7G5AzLizqzurvuj6z6n.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sean Odken",
               "gender": 2,
               "credit_id": "52fe4416c3a368484e00ebad",
               "name": "Adam Garcia",
               "profile_path": "/mNN5sBCsBbx1F9pG6QTqQtQ7vA3.jpg",
               "id": 28472,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe4416c3a368484e00ebb1",
               "name": "Sophie Lee",
               "profile_path": "/egZfY3iDlbKAOhZojG0SgEzJqh7.jpg",
               "id": 3053,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mitchell",
               "gender": 2,
               "credit_id": "52fe4416c3a368484e00ebb5",
               "name": "Sam Worthington",
               "profile_path": "/9XzAE3ZnCnazub4xrSY8YBN7sNq.jpg",
               "id": 65731,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sara",
               "gender": 1,
               "credit_id": "52fe4416c3a368484e00ebbf",
               "name": "Susie Porter",
               "profile_path": "/yGBEkCewo9itoskguyCjo0hD97Z.jpg",
               "id": 51671,
               "order": 3
            },
            {
               "cast_id": 24,
               "character": "Gary",
               "gender": 2,
               "credit_id": "556572c3c3a3687ad700107c",
               "name": "Richard Carter",
               "profile_path": "/8Qo8Gp5zwKM82MK0Gh6rF1ullrx.jpg",
               "id": 44838,
               "order": 4
            },
            {
               "cast_id": 25,
               "character": "Kim",
               "gender": 1,
               "credit_id": "556572d8925141354f0010e7",
               "name": "Justine Clarke",
               "profile_path": "/mb73uo0iyPo2LZQOSyUz9WYhguJ.jpg",
               "id": 79692,
               "order": 5
            },
            {
               "cast_id": 26,
               "character": "Huey",
               "gender": 2,
               "credit_id": "556576a0925141354c00117a",
               "name": "Anthony Hayes",
               "profile_path": "/6Uros6khPptET5CgkmYkU0hJla7.jpg",
               "id": 75711,
               "order": 6
            },
            {
               "cast_id": 27,
               "character": "Walter",
               "gender": 2,
               "credit_id": "556576bc925141353d001125",
               "name": "William Zappa",
               "profile_path": "/qt379Fu9Mqv4y27pWl1tCtlpFf2.jpg",
               "id": 83771,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ebbb",
               "name": "Dein Perry",
               "profile_path": null,
               "id": 87465,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "55656f5bc3a3683c0f000f63",
               "name": "Jane Moran",
               "profile_path": null,
               "id": 957731,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55656f85c3a3687aca001164",
               "name": "Steve Worland",
               "profile_path": null,
               "id": 1236195,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55656f9fc3a3687aca001168",
               "name": "Hilary Linstead",
               "profile_path": null,
               "id": 1013424,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "55656fb5925141354f001084",
               "name": "Dein Perry",
               "profile_path": null,
               "id": 87465,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "55656fbf925141354f001088",
               "name": "Steve Worland",
               "profile_path": null,
               "id": 1236195,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "55657001c3a3687acf001135",
               "name": "Steve Mason",
               "profile_path": null,
               "id": 51981,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5565700fc3a3687ad9001121",
               "name": "Cezary Skubiszewski",
               "profile_path": null,
               "id": 75940,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5565701cc3a3687aca001178",
               "name": "Murray Picknett",
               "profile_path": null,
               "id": 75762,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5565702992514135460010ea",
               "name": "Tess Schofield",
               "profile_path": null,
               "id": 1470977,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "55657036925141354f00109f",
               "name": "Christine King",
               "profile_path": null,
               "id": 12203,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5565705e92514135430010a9",
               "name": "Hilary Linstead",
               "profile_path": null,
               "id": 1013424,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55657069925141354c0010da",
               "name": "Dein Perry",
               "profile_path": null,
               "id": 87465,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "55657075c3a3687aca00117a",
               "name": "Antonia Barnard",
               "profile_path": null,
               "id": 957391,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "55657096c3a3687acf001140",
               "name": "Sue MacKay",
               "profile_path": null,
               "id": 79143,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "556570ab9251413549001165",
               "name": "Lea Worth",
               "profile_path": null,
               "id": 1470980,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "556570b7c3a3687ad700104b",
               "name": "Jon Rohde",
               "profile_path": null,
               "id": 75763,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "556570dbc3a3687ad9001142",
               "name": "Victoria Sullivan",
               "profile_path": null,
               "id": 1470982,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "55657110c3a3683c0f000fa0",
               "name": "Marcus D'Arcy",
               "profile_path": null,
               "id": 11650,
               "department": "Crew",
               "job": "Post Production Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.805163,
      "production_countries": [],
      "id": 21370,
      "vote_count": 15,
      "budget": 0,
      "overview": "Sean Odkin loves to dance much to his fathers distain. When the woman he loves cannot return his love Sean goes in search of the only thing that can make him whole again and that is dancing.",
      "similar": [
         9836,
         8328,
         3080,
         16858,
         28293,
         16082,
         490854,
         43817,
         89417,
         43897,
         16560,
         43513,
         95037,
         243265,
         207738,
         152062,
         150476,
         245984,
         264570,
         151749
      ],
      "original_title": "Bootmen",
      "runtime": 89,
      "poster_path": "/lPfB78iLYYJtNj8KhMP2tEd1Ipw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-10-05",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dein Perry"],
      "runtime": 93,
      "synopsis": "Sean Odkin loves to dance much to his fathers distain. When the woman he loves cannot return his love Sean goes in search of the only thing that can make him whole again and that is dancing. But the mill his father is working at is going to shut which will kill the towns economy. Sean then gets together with his childhood friends as well as his brother and put on one of the most incredible shows ever. Tap at its finest.",
      "writers": [
         "Steve Worland",
         "Hilary Linstead"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0210584/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMzc5OTg3OV5BMl5BanBnXkFtZTcwNjIzMjYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Vaughan Sheffield, Christian Patterson, Lisa Perry | See full cast and crew »"],
      "reviews": [
         "Most of the negative comments about this film seem to come from its birth place, Australia. Frankly, \"Bootmen\" is not a horrible movie by any stretch of the imagination. The film shows some originality in the way the director Dein Perry sets the film in the steel works factory that is about to close and having Sean and his mates practice in another abandoned place that seems to be saying a lot about how industries do away with people that have given their best to make them better. Adam Garcia, playing Sean, is one of the best things in the film. The other asset is Sam Worthington, who plays Mitch, the brother that seems to attract trouble wherever he goes. Also, Sophie Lee, as the brothers' love interest makes an effective contribution to the movie. The dancing numbers reminded us of Stomp, the musical that has been playing here for a long time now, in that unusual ways of tap dancing are practiced on the most unconventional ways, which makes \"Bootmen\" more likable. The best way to watch the film is to sit back, relax, and let it unfold, as it will win the viewer over with the inspired tap dancing.",
         "As a resident of Newcastle who is familiar with the Dein Perry story I was very interested in seeing this movie. The fact that it was shot in Newcastle and features a few Newcastle actors only increased my interest. As a local it was fantastic to see our often stereotyped city (we are the sixth largest Australian city) look as good as it does. They didn't just focus on the normal shots of the steel works or the beach, and they used references to places in Newie that only we could get. As a tap-dancing fan it was wonderful to see tap making its way into the cinema in a non-Fred Astaire way. As a movie fan it was great to note that something I assumed to be a chick-flick was actually a very blokey film with a bit of dancing thrown in. Perry and the crew have done a magnificent job in not only opening up the eyes of the world to tap-dancing they've also been wonderful in showing everyone a different side to Newcastle, while still maintaining what we are really about.",
         "The image that flashes through my mind when I hear the word \" Aussies \" is of a bunch of butch hard drinkers who enjoy nothing better than waking in a police cell after a drinking session followed by a bar room brawl .... and that`s just the women . According to my mate Dr Sebastian who spends a lot of time down under this is a laughably cliched stereotype and Australians are the nicest friendliest people on Earth . Mind you Seb is a six foot three Scotsman so everyone`s nice to him . You can see what I`m getting at about stereotypes though ? because strangely BOOTMEN does feature the type of Aussies who take a drink and commit crimes and enjoy the sound of knuckle against cheekbone . Even stranger despite the mythical portrayal of Australians in this movie no one really gives the main protagonist Sean a hard time for wanting to become a dancer even though he works at a steel mill . A worker at an Australian steel mill wants to become a dancer and no one accuses him of being \" A bloody wooftah \" , now that takes some swallowing and I guess that`s why some people dislike BOOTMEN , it is slightly obvious that the story was written around the dance sequences but it could have been far worse , it could have been a plagaristic cross between THE FULL MONTY and BILLY ELLIOT or a camp Baz Luhrmann type production but at least BOOTMEN has an identity all of its own . BOOTMEN is a simple story of people trying to pursue their dreams , it`s funny , romantic , sometimes gritty and foul mouthed , sometimes violent but always entertaining with an absolutely brilliant dance sequence at the end and is by far the greatest Australian film since ROMPER STOMPER. If you`ve ever seen the dance troupe Stomp or these idents on BBC1 featuring the dancers and thought \" Hmm that lifts the spirits \" then you`ll enjoy this movie . I know I certainly did",
         "This film was done to promote the Tap Dogs show and dance group, so don't expect complicated or sophisticated plot, cunning twists or even amazing acting. You can pretty much guess what happens, just from watching the trailer. There is nothing, plotwise, that hasn't been done before and the characters are all tried and tested stereotypes. Cinematography is solid and production quality is safe. There is a fair degree of bad language, which seems a touch out of place given that this film will appeal to a lot of young dance students. But none of this detracts from the basic underlying premise of the film... Basically, sit back, shut up and enjoy the fabulous tap dancing - That's what it's about and in that respect, it does NOT disappoint!!",
         "Well, I've just seen Bootmen a second time, and let me say that its even better second time round! Seeing it twice really gives you the opportunity to focus on the stuff you missed out the first time. For example, I was looking at the smaller details instead of all the same stuff as the first time. I've just read my first review thing and I realised I said that dancing at the beginning was not so spectacular. I'm an idiot! I meant to say the acting! The acting wasnt so hot at the beginning but quickly picks up towards the middle. Again, the dancing was awesome, the actors were awesome and Adam Garcia is definitely beyond awesome! I love the man's hair! And I just realised that it is Dein Perry himself as that Anthony guy at that dance show in Sydney that Sean gets into. Awesome! Awesome! Awesome! Awesome! Awesome! Awesome! Awesome!",
         "When this movie focuses on the dancing, it is amazing and joyful. Unfortunately, far too much time is spent on the extremely pedestrian story of underdog dancers, star-crossed love lives and gang fights. While the story was trite, the acting and the dancing were superb. Both main male leads do a terrific job, with Adam Garcia (previous film: Coyote Ugly) an absolute standout as the guy with the dream that he makes come true despite the odds. I'm glad I didn't pay full price, but for a matinee price - you can ignore the story and concentrate on the dance numbers. Those *are* worth the price of admission.",
         "'Bootmen' is a cross between 'The Full Monty' and 'Billy Elliot' but the comparisons have to stop there, as this film contains neither the depth nor the humor of the other two. It is one of the few Australian Films I have seen that, either purposefully or not, looks more like a Hollywood flick, and perhaps coincidentally it ranks lower than most Aussie films on my list. The characters are developed haphazardly, and the tone of the movie follows a similar chaotic path, with excellent dancing not quite making up for a weak script and a feeble, unoriginal plot. Although at parts moving or amusing (or occasionally both at once) the film as a whole lacks focus, and it could be seen as a way to bring the Directors talent as a choreographer into the limelight. Impressive dancing, but otherwise nothing special, and towards the end it appears to lose touch with reality.",
         "I was born in Newcastle where this film was set, and was still living there at the time when this was filmed and when released was very interested in watching it. All I can say is that Adam Garcia was fantastic and showed his amazing dancing skills - he is also a great singer as well as shown on An Audience with Kylie Minogue last year and he is definitely such a versatile performer and one to watch in years to come. Seeing areas of where I grew up in Newcastle was surreal and I even recognised some local faces as extras. The theatre they used when Adam's character was in Sydney was really the Civic Theatre which is located in Newcastle. Sophie Lee has come a long way the past few years and definitely deserves higher recognition - I'm not saying this because she is also a Newcastle girl but I thought she outshone Kate Winslet in Holy Smoke and gave Toni Collete a run for her money in Muriel's Wedding and it was a shame she didn't have a bigger role. Australian movies are really hit or miss and this is definitely a hit, along with The Dish which was released around the same time. The dancing sequence is heartpounding and this is definitely one film worth a look.",
         "i actually liked the movie a lot. i happened to see it one day on IFC, and enjoyed it so much i made my Australia native fiancé watch it after he said everyone he knew that saw it back when it came out said it was crap. i thought it was very predictable...but cute still. All those little tap dancing Aussie all cute and tapping for a cause. All the drama, dead mom, dead brother, pregnant semi-girlfriend by brother, dad against his tapping, and a cynical instructor. i enjoyed it very much and would watch it again if i were to see it on. I think the idea behind the movie was very original...very funny at times. I particularly enjoyed comments about \"poofters\" and \"root\".",
         "The concept is good - to try to capture the style of the \"Tap Dogs\" and turn it into a feature film. Sadly, the transition to the big screen was not entirely successful. In order to reach the big tap finale, we had to wade through an hour and a half of paper thin plot - nice guy fails to make it in the big city, father-son conflict, brother-brother conflict and small scale organized crime racket. The quality of the acting left a bit to be desired (this is to be expected as the guys were selected for their tap ability, rather than their acting pedigree), and Sophie Lee was ... well, Sophie Lee (I'm yet to be convinced that she is an actor). The bleak industrial landscape and cinematography were quite good, as were the actors in the small supporting roles. So when push comes to shove - was the final tap spectacular worth sitting through the movie? Sure was, it's just a shame there wasn't a bit more of it."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Bootmen Productions (Hilary Linstead-Dein Perry)",
         "Fox Searchlight Pictures"
      ],
      "summaries": [
         "Born charmer Sean Okden gave up tap-dancing when he started working in the steel mill, but as that's going down the hill he grabs his chance being the only candidate in his coastal Australian home town Newcastle selected for a Sidney show. Being sacked soon just for a row with the arrogant lead dancer, he returns to find his girlfriend in bed with his brother Mitchell, and decides to start his own tap-dance group wearing hardhats, which he soon gives an original edge when the steel mill inspires him to weld metal on their shoes and dance on industrial steel, so it the metallic acoustics fit well with a local rock group. Financing their local debut is so expensive, even when the mill allows them free us of its premises -opening some acrobatic perspectives- while even his father won't allow him to touch his mother's inheritance for the project, that the 'Bootmen' need to steal the cheerleaders' podium in a televised sports match to get media attention. Sean generously helps his brother when attacked, at the price of their motorbikes, only to learn his assailant Huey and Mitch rival as car (part) thieves, but still allows him into the group - only to see his fatal fall during an attack by Huey's goons. Even when the mill announces phasing out Sean continues, now as a benefit for the sacked workers' retraining.",
         "Charismatic tap dancing Sean tries to find a way out of working at the steel mill. When failure brings him home he starts his own dance group wearing hardhats. He must then find inspiration in the steel mill he once tried to escape."
      ],
      "budget": 0
   },
   "movielensId": 3944,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-10-05",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Dein Perry"],
      "runtime": 89,
      "movieId": 3944,
      "title": "Bootmen",
      "mpaa": "PG-13",
      "actors": [
         "Adam Garcia",
         "Sophie Lee",
         "Sam Worthington",
         "Susie Porter",
         "Richard Carter",
         "Justine Clarke",
         "Anthony Hayes",
         "William Zappa"
      ],
      "imdbMovieId": "0210584",
      "originalTitle": "Bootmen",
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sean Odkin loves to dance much to his fathers distain. When the woman he loves cannot return his love Sean goes in search of the only thing that can make him whole again and that is dancing.",
      "tmdbMovieId": 21370,
      "avgRating": 2.59412,
      "releaseYear": "2000",
      "numRatings": 85,
      "posterPath": "/lPfB78iLYYJtNj8KhMP2tEd1Ipw.jpg"
   }
}