{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "video game",
            "id": 282
         },
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "loss of energy",
            "id": 5019
         },
         {
            "name": "egg",
            "id": 5698
         },
         {
            "name": "computer",
            "id": 6104
         },
         {
            "name": "good vs evil",
            "id": 10842
         },
         {
            "name": "internet",
            "id": 11615
         },
         {
            "name": "based on video game",
            "id": 41645
         },
         {
            "name": "giant egg",
            "id": 160189
         },
         {
            "name": "animal trainer",
            "id": 178853
         },
         {
            "name": "superhero kids",
            "id": 191219
         },
         {
            "name": "anime",
            "id": 210024
         }
      ],
      "imdb_id": "tt0259974",
      "video": false,
      "title": "Digimon: The Movie",
      "recommendations": [
         75571,
         97787,
         12599,
         10991,
         10228,
         98299,
         11052,
         36201,
         336975,
         17101,
         15575,
         33875,
         381547,
         73245,
         36198,
         12600,
         36200,
         57355,
         10080,
         36199
      ],
      "backdrop_path": "/k7xihmVuxlTZj4qeQdAQHnG42jW.jpg",
      "revenue": 16600000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Kari / Young Kari (voice)",
               "gender": 1,
               "credit_id": "52fe43e7c3a368484e005025",
               "name": "Lara Jill Miller",
               "profile_path": "/pkLCbyjPqNjHEmZfTMGV8b7v2Fi.jpg",
               "id": 174462,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Young Tai / Tai (voice)",
               "gender": 0,
               "credit_id": "52fe43e7c3a368484e005029",
               "name": "Joshua Seth",
               "profile_path": null,
               "id": 1189931,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Red Greymon (voice)",
               "gender": 2,
               "credit_id": "56c47a64c3a3687203002512",
               "name": "Bob Papenbrook",
               "profile_path": null,
               "id": 168992,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43e7c3a368484e005031",
               "name": "Doug Berholt",
               "profile_path": null,
               "id": 1189933,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Computer Voice 1 / Poromon / Flamedramon / Raidramon / Magnamon (voice)",
               "gender": 2,
               "credit_id": "593533b49251417dd8033187",
               "name": "Steve Blum",
               "profile_path": "/cpO0muunoigq1WHegeOEI1AIQAo.jpg",
               "id": 571562,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Sora / Male Student (voice)",
               "gender": 1,
               "credit_id": "593533f69251417dea033882",
               "name": "Colleen O'Shaughnessey",
               "profile_path": null,
               "id": 1212864,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Matt (voice)",
               "gender": 2,
               "credit_id": "593534249251417dd403436c",
               "name": "Michael Reisz",
               "profile_path": null,
               "id": 1213735,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Young T.K. / Little Girl 1 / Party Girl 1 / Little Kokomon (voice)",
               "gender": 1,
               "credit_id": "593534349251417de203254d",
               "name": "Wendee Lee",
               "profile_path": "/4hZsZj6YItnzaXSHdsCxSDA3s4l.jpg",
               "id": 79051,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Koromon / Kuramon (voice)",
               "gender": 1,
               "credit_id": "593534489251417e030335df",
               "name": "Brianne Siddall",
               "profile_path": null,
               "id": 571564,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e005015",
               "name": "Mamoru Hosoda",
               "profile_path": "/oh1GS6x8cdGkyL4QPKmpMSaD6Wu.jpg",
               "id": 81718,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e7c3a368484e00501b",
               "name": "Shigeyasu Yamauchi",
               "profile_path": null,
               "id": 81853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "568767e9c3a3684be9020c50",
               "name": "Akiyoshi Hongo",
               "profile_path": null,
               "id": 1221440,
               "department": "Crew",
               "job": "Creator"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.125981,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 20455,
      "vote_count": 93,
      "budget": 5500000,
      "overview": "The first story focused on Tai and Kari Kamiya four years before their adventure in the Digital World. It shows their first encounter with Digimon and what happened to them (as well as the other children). Tai and Kari wake one morning to find a Digi-Egg that came out of their computer the night before and the egg soon hatches, revealing a Botamon. The Digimon then evolves into Koromon and then Agumon (not the same one that became friends with Tai in the series, and yet, somehow, both Koromon and Kari remember each other), who then goes out and unintentionally destroys a good part of the neighborhood with Kari riding on his back. A second Digi-Egg appears in the sky to reveal an evil digimon, Parrotmon. Agumon then Digivolves to Greymon but isn't strong enough to beat Parrotmon and is knocked out. Tai grabs Kari's whistle and wakes up Greymon, who defeats Parrotmon and disappears with him.",
      "similar": [
         588,
         128,
         49017,
         68735,
         390734,
         351460,
         81,
         9312,
         340677,
         860,
         378064,
         396263,
         10991,
         2312,
         97,
         13754,
         10428,
         277685,
         295830,
         276624
      ],
      "original_title": "Digimon: The Movie",
      "runtime": 82,
      "poster_path": "/1VVJoSgGLxRE0DGDIE8eztOjUXv.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Toei",
            "id": 5822,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Saban Entertainment",
            "id": 2106,
            "origin_country": ""
         }
      ],
      "release_date": "2000-03-17",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/vfwyCkgzgoQ1l0trt7wIr77VL4Q.jpg",
         "name": "Digimon Collection",
         "id": 39244,
         "poster_path": "/eHRPNtZMjJKHosAMD87dn7HGM9r.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Mamoru Hosoda",
         "Shigeyasu Yamauchi"
      ],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Akiyoshi Hongo",
         "Jeff Nimoy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0259974/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1MTI2ODM5M15BMl5BanBnXkFtZTcwNDgwMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lara Jill Miller, Joshua Seth, Bob Papenbrook | See full cast and crew »"],
      "reviews": [
         "Except for the previews for several horrible kid movies and an excruciating ten minute Angela Anaconda short, Digimon: The Movie was a great film! I think that my friend and myself were the only people in the theatre who understood it, as the little kids and their parents probably had no idea what was going on or why. It's a deeper movie than I expected, and hard to understand if you haven't been following the TV show to become acquainted with the characters and their world. The animation is great and fun to look at, there's a lot of comedy, interesting characters and rad monsters. I was surprised to find there was even a little poop. If you're a fan of the show, you'll probably love every second of the movie, although a lot of it is apt to fly right over little kids' heads.",
         "I really can't bring myself to insult this movie as it got me into anime. Actually, to rephrase that, it got me interested in the idea of anime: Akira got me into PROPER anime. As for the film, it is actually pretty good. Digimon is one of those anime series that, while aimed at younger audiences, is actually very enjoyable. There are funny moments, and the fight scenes are cool without being too violent. The film is split into three loosely linked sections, the first really just setting the story up, but containing a cool fight scene at the end. The second part is the longest and most enjoyable: it features Tai and Izzy trying to stop a Digimon with a virus that has taken over the internet. This section contains the best jokes and interaction between the characters, and has a good plot and animation. The third part I didn't like so much, but for the record is takes place later, and deals with the aftermath of what happened, this time set in the USA. Obviously, Digimon: The Movie is just a kids picture, and the animation and plot are pretty basically, but it will be enjoyed by fans of the series, children who are into anime, scifi, etc. and even my more mature (i.e. older!) anime fans like myself who just want a fun little film to pass the time with.",
         "For those of you who think Digimon rips off Poke'mon guess what?DIGIMON CAME FIRST!Although Poke'mon appeard here in america first,it was Digimon that came first in Japan where it all started,so Poke'mon is the rip off!Anyway,about the film.This is a good movie,with some great action,poor comedy,and some of the best drama found,and unlike most movies of a show,this one is linked with the Tv series,I recommend this,and the show to anybody,you'll like it,if you don't,better call for some help,if you know what I mean whacko!",
         "I was watching this movie today, having not seen it for about two years, and I noticed a LOT more in it this time than when I last saw it: 1. The stunning animation. Not the Americanised, simplistic anime but a prettier and more detailed style. Smoother animation, too. 2. The plot - a more developed version of what you get on the series, which is what fans like to see! :) 3. The humour! I have always loved Digimon's humour and it is definitely improved further in this movie. 4. The fight scenes are as good as ever! 5. Great soundtrack! (apart from that Digimon Rap thing at the start - it got on my nerves o_O;;) So, overall, this movie is great entertainment. Obviously I recommend this especially to Digimon fans but it also appeals to other audiences. I myself was a Digimon fan about 6 years ago, and hadn't seen it, and when I saw the old videos I have of the series and the movie recently after pulling them out of my shelves I remembered why I liked Digimon so much :D As everyone else has said, beats Pokemon any day! And this is coming from an ex-Pokemon fan too! Maybe the reason it beats Pokemon (apart from the reasons above) is because Digimon shows a lot more human emotion, rather than just fight fight fight pull Brock away from girls and more fighting and getting shiny badges. Three word summary: BIG Digimon adventure",
         "I like the second part of the movie best because of the way Izzy looked liked when he was about to burst. Furthermore, this movie serves as to what happens after the first series ends. To me, I loved how it was told and I loved how Tai got frustrated over a silly letter to his friend Sora. It was funny to see the movie, especially when Izzy ate all that bad food of Tai's mother. But its purpose of it will never be forgotten for this movie really rocks.",
         "Four years ago, when I first heard that my favorite animated series was being brought to the big screen, needless to say I was ecstatic. Over time, I've seen plenty of disappointing adaptations of TV series, such as the much anticipated \"Pokemon the First Movie\" and, most recently, the weak \"Yu-Gi-Oh the Movie\". But Digimon was different. Although it may not have been a perfect movie in the myriad of overall excellent films, It was the perfect Digimon movie. I do not think they could have done a better job. There was a perfect balance of drama and humor, seriousness and sarcasm, just what Digimon is all about. A great comprehensible plot is depicted, plus it expanded on the Tai/Sora romance hinted in Season 1. Overall if you are a digimon fan or just want to know what it's all about, don't miss this one. Animated Movie Score (10/10) Overall Movie Score (8.5/10) Recommended",
         "I'll start with the bad news. Anyone who has never seen the series could get very confused. Glad thats over. Digimon is a great movie, the sound track is awesome, the comedy is classic and the story line rocks. The animation harks back to the Japanese style of 10/20 years ago, and is less simple and Americanised than the series. The script is full of one liners and hilarious slapstick. The humour will have kids and adults laughing out loud so parents can have a good time too. The action is very fast paced and this where non-fans could fall down. It could get a little confusing even avid watchers of the show could get lost. This was nothing like Pokemon, and cannot be called a rip off as there is no similarity apart from \"mon\" being in the title. But I greatly advise any fan off the growing \"mon\" world to see this one.",
         "When I was in Vermont me and my sister was looking forward to seeing the digimon movie. Of course, we found out that it got such bad reviews that they made a news article about it. When my sister, my sister's friend and me went to see the movie, I was surprised. C'mon guys, it wasn't THAT bad! The animation was cheap, but detailed (an example of an oxy-moron). Some parts of the movie were even funny. Example: Tai: \"Hello, my name is Tai, Taaaiii. An this is my sister, Kari, Kaaarrriii\" Koromon: \"Hello Tai Tai Kari Kari!\" (lol). Alot of the movie was pretty violent, but at least it had good plots. This could beat a pokemon movie any day! Those reviewers should get their heads examined!",
         "It took me forever to figure it out, but after enough searching, I found out why. I found that the movie was a lot like the show, so close that it seemed like they had just thrown three episodes together. The only reason I put up with this, these three 'episodes' were effectively on their own and were referred to briefely in the series (well, 2 of them were). It ends up that I was half right. after searching, I found out that it isn't three episodes strung together, but currently there are some 6 digimon 'movies' released in Japan, and three of them are in this single movie that we saw in the western world. It seems that the Japanese form of a movie is 30 minutes long (how this works is beyond me). Outside that, it was enjoyable. I had fun watching it, taping it and watching it again, and catching all the jokes they had. It's what makes the series enjoyable, and it sure saved the movie.",
         "For an animation, this film was the best I've ever seen. It had exceptional quality throughout and it actually convinced me to watch the television series. I like the way it spans different time lines and explains the whole story, rather than the Pokemon movie. It entertained me every step of the way with a great sound track, dialogue, and characters. The plot seems rather simple when you first hear what it's actually about, but its modern approach makes it original and likeable. The only problem was, the screenplay was a little too quick, even for people who watch the television show, and I lost track in some parts of the movies; in fact, I had to watch it twice to properly understand the entire film. But, everything else aside, I really liked this film and I'd seriously recommend it to anyone, adults or children. If you think it's just another Pokemon movie, you're wrong."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Saban Entertainment",
         "Toei Company",
         "Fox Family Films"
      ],
      "summaries": [
         "Three Japanese movies in one. There is narration by a continuing character, Kari. The first involes an encounter with a digimon of the third kind. The two kids Kari and Tai, raise this fast growing digimon from egg to giant monster. It's a good thing it showed up too, as an awsome fight ends this segment. The second of the movies involves Tai and Izzy. Some sort of computer virus sweeps th internet. It turns out to be a digimon. The digimon are uploaded to the internet and Tai tries to get others to help. Matt and T.K. help as well, with some more outstanding fight scenes. The third and Final segment starts in N.Y. with Kari and T.K., now years older, and they see 2 digimon fighitng and a kid with them. They try to follow him and they get there friends to follow as well. One of the new digimon belongs to Willis, the other, does as well, except this digimon seems to have a virus. The kids find a new power and once again, the fight scenes look spectacular.",
         "Three different stories involving digital creatures collide together."
      ],
      "budget": 5000000
   },
   "movielensId": 3945,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2000-03-17",
      "dvdReleaseDate": "2001-02-06",
      "directors": [
         "Mamoru Hosoda",
         "Shigeyasu Yamauchi"
      ],
      "runtime": 82,
      "movieId": 3945,
      "title": "Digimon: The Movie",
      "mpaa": "PG",
      "actors": [
         "Lara Jill Miller",
         "Joshua Seth",
         "Bob Papenbrook",
         "Doug Berholt",
         "Steve Blum",
         "Colleen O'Shaughnessey",
         "Michael Reisz",
         "Wendee Lee",
         "Brianne Siddall"
      ],
      "imdbMovieId": "0259974",
      "originalTitle": "Digimon: The Movie",
      "genres": [
         "Fantasy",
         "Animation",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["gFuNXUCG4Bs"],
      "plotSummary": "The first story focused on Tai and Kari Kamiya four years before their adventure in the Digital World. It shows their first encounter with Digimon and what happened to them (as well as the other children). Tai and Kari wake one morning to find a Digi-Egg that came out of their computer the night before and the egg soon hatches, revealing a Botamon. The Digimon then evolves into Koromon and then Agumon (not the same one that became friends with Tai in the series, and yet, somehow, both Koromon and Kari remember each other), who then goes out and unintentionally destroys a good part of the neighborhood with Kari riding on his back. A second Digi-Egg appears in the sky to reveal an evil digimon, Parrotmon. Agumon then Digivolves to Greymon but isn't strong enough to beat Parrotmon and is knocked out. Tai grabs Kari's whistle and wakes up Greymon, who defeats Parrotmon and disappears with him.",
      "tmdbMovieId": 20455,
      "avgRating": 1.9897,
      "releaseYear": "2000",
      "numRatings": 534,
      "posterPath": "/1VVJoSgGLxRE0DGDIE8eztOjUXv.jpg"
   }
}