{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ritual",
            "id": 4720
         },
         {
            "name": "pornographic video",
            "id": 5593
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "car crash",
            "id": 9844
         },
         {
            "name": "dvd",
            "id": 159938
         }
      ],
      "imdb_id": "tt0208988",
      "video": false,
      "title": "Get Carter",
      "recommendations": [
         2636,
         10375,
         2142,
         9874,
         2099,
         10477,
         11398,
         9405,
         11258,
         6723,
         2163,
         9972,
         10632,
         9618,
         11074,
         9691,
         12138,
         9333,
         9604,
         9091
      ],
      "backdrop_path": "/25QzBmimwYBW1cqJs3BR3tbp6jG.jpg",
      "revenue": 19412993,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Carter",
               "gender": 2,
               "credit_id": "52fe43749251416c75011069",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gloria Carter",
               "gender": 1,
               "credit_id": "52fe43749251416c7501106d",
               "name": "Miranda Richardson",
               "profile_path": "/kTs3t6pnO3zR7WYSVYzQfJ9yKMW.jpg",
               "id": 8436,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Doreen Carter",
               "gender": 1,
               "credit_id": "52fe43749251416c75011071",
               "name": "Rachael Leigh Cook",
               "profile_path": "/cotGJui5H2Te2ThYERndc3DOVOm.jpg",
               "id": 38581,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cyrus Paice",
               "gender": 2,
               "credit_id": "52fe43749251416c75011075",
               "name": "Mickey Rourke",
               "profile_path": "/AvGzQ8fvjurGmZW3W1wlQ5WfSeT.jpg",
               "id": 2295,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe43749251416c7501109d",
               "name": "Johnny Strong",
               "profile_path": "/mai8GzxPcvdIo1RzymbwBwayhxe.jpg",
               "id": 12796,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Geraldine",
               "gender": 1,
               "credit_id": "52fe43749251416c750110a1",
               "name": "Rhona Mitra",
               "profile_path": "/5iaixWY0qTK9ouHA1wmlXi3t0ie.jpg",
               "id": 25702,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Con McCarty",
               "gender": 2,
               "credit_id": "52fe43749251416c750110a5",
               "name": "John C. McGinley",
               "profile_path": "/6AJL0ylRtJ9vcR57yEenhWHXHFt.jpg",
               "id": 11885,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Jeremy Kinnear",
               "gender": 2,
               "credit_id": "52fe43749251416c750110a9",
               "name": "Alan Cumming",
               "profile_path": "/5U7rmz20snvKB099P30IJu2nmRb.jpg",
               "id": 10697,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Cliff Brumby",
               "gender": 2,
               "credit_id": "52fe43749251416c750110ad",
               "name": "Michael Caine",
               "profile_path": "/vvj0JMSFpOajXCE46Hy4dyqSP2U.jpg",
               "id": 3895,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Audrey",
               "gender": 1,
               "credit_id": "52fe43749251416c750110b1",
               "name": "Gretchen Mol",
               "profile_path": "/46mBoe7xf3pJgQLEYNw6Msniq3r.jpg",
               "id": 15370,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Thorpey",
               "gender": 2,
               "credit_id": "52fe43749251416c750110b5",
               "name": "John Cassini",
               "profile_path": "/x6on7gR2Q8iQknmrmEL6hMZWZPJ.jpg",
               "id": 12055,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Girl #1",
               "gender": 1,
               "credit_id": "55e6acf8c3a3685f9800255c",
               "name": "Crystal Lowe",
               "profile_path": "/Ceoa65Zc6QXvT1zFpPmQx5dY5M.jpg",
               "id": 58393,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Jim Davis",
               "gender": 2,
               "credit_id": "58f0d0b192514125b101103a",
               "name": "Mark Boone Junior",
               "profile_path": "/riibKDljUzdSfIZygymhKx9yNPx.jpg",
               "id": 534,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Bud #1",
               "gender": 2,
               "credit_id": "58f0d0d7c3a3686b4d011819",
               "name": "Tyler Labine",
               "profile_path": "/rRc5H2pMFh3dlqs68xLbnthj3DS.jpg",
               "id": 51383,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Les Fletcher (voice)",
               "gender": 2,
               "credit_id": "58f0d13f92514125c6011bb3",
               "name": "Tom Sizemore",
               "profile_path": "/soINOuacuiThRb2LyPD4tTWve7C.jpg",
               "id": 3197,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43749251416c7501107b",
               "name": "Stephen T. Kay",
               "profile_path": "/wN9Vxi5dvDNSV70kV3P1LQvx5EM.jpg",
               "id": 56435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75011081",
               "name": "Mark Canton",
               "profile_path": null,
               "id": 46088,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75011087",
               "name": "Neil Canton",
               "profile_path": null,
               "id": 1059,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c7501108d",
               "name": "Ted Lewis",
               "profile_path": null,
               "id": 65366,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75011093",
               "name": "David McKenna",
               "profile_path": null,
               "id": 818,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75011099",
               "name": "Mauro Fiore",
               "profile_path": null,
               "id": 18265,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55464596c3a3680cd5007027",
               "name": "Kevin Fair",
               "profile_path": null,
               "id": 1362798,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "564d1edac3a3682a1a003791",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "564d1f50c3a368602e008423",
               "name": "James Bamford",
               "profile_path": null,
               "id": 113194,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 1,
               "credit_id": "56bd33c2c3a368180a0017db",
               "name": "Helen Jarvis",
               "profile_path": null,
               "id": 22061,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5aa5205fc3a3687c32021125",
               "name": "Melissa Matthies",
               "profile_path": null,
               "id": 1995909,
               "department": "Art",
               "job": "Assistant Property Master"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 6.957115,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10461,
      "vote_count": 192,
      "budget": 63600000,
      "overview": "Remake of the British classic. Jack Carter, a mob enforcer living in Las Vegas, travels back to his hometown of Seattle for his brother's funeral. During this visit, Carter realizes that the death of his brother was not accidental, but a murder. With this knowledge, Carter sets out to kill all those responsible.",
      "similar": [
         1592,
         26389,
         27582,
         27205,
         9737,
         10483,
         470,
         604,
         1700,
         293768,
         10358,
         310,
         1640,
         19912,
         35056,
         10591,
         23047,
         2142,
         340677,
         638
      ],
      "original_title": "Get Carter",
      "runtime": 102,
      "poster_path": "/5Dv9QJNJx4cF96lDtX4KGtplNTJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Canton Company",
            "id": 22351,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Franchise Pictures",
            "id": 1403,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-10-06",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "The Truth Hurts",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Kay"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Ted Lewis",
         "David McKenna"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0208988/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMDk3Njg3NF5BMl5BanBnXkFtZTYwNTIzMzU3._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Sylvester Stallone, Rachael Leigh Cook, Miranda Richardson | See full cast and crew »"],
      "reviews": [
         "A mob enforcer goes back to his native Seattle to sort out the suspicious death of his brother. The original film is one of the best English thrillers of all time and despite being made nearly thirty years ago still packs a punch. Sadly this film is not really in its league, despite a bigger budget and more ground coverage. The main problem is that the authors clearly love the original and this leaves so much of what happens as a question mark to the new viewer. Characters are thrown in from nowhere and Carters involvement with his bosses' girl is almost in another movie. Micheal Caine's small role (as a barman) is funny in that he was the original Jack Carter, here reprised by Sly Stallone. While quick to admit this is mediocre stuff you have to say that you get your share of car chases (well done too), fights, creeps, sleaze, family bonding, shoot outs and even the odd bit of light humour. The fight between Stallone and Mickey Rouke (here playing a buisnessman-stroke-creep) for example. This film features interesting cinematography, with strange forward jump cuts (ripped off from The Limey), odd angles and the use of colour filters. In short, the producers trying to make more out of the material than is in the script. The choice of a wet Seattle is also curious and different. Presumably the nearest to Newcastle-Upon-Tyne (the setting of the original) that the producers could think of. So it is only an average product, but will see much worse than this in our lifetime and it does move along at a fair and steady clip. People are getting to knock Stallone for being Stallone, but he doesn't do bad a job here, a stonefaced enforcer that is prepared to shed a tear when needs be! Not great acting, but he looks the part. Don't be put off by the low IMDB ratings, plenty of worthy films are two or three points higher but are far more boring. Popcorn fodder it may be, but I thought it was worth seeing through and even declared myself modestly entertained at the end of it. Not as good as the original but not a lot is. Footnote: This is actually not the first remake of Get Carter. A blackspolitation version was made in the 1970's called \"Hitman.\"",
         "A remake of the 1971 film with Michael Caine. Las Vegas mob enforcer Jack Carter travels to Seattle to investigate his brother's mysterious death. Local crime lords want him out, but Carter unrelentingly proceeds in finding the truth. Starting with a promising beginning (though it remains amusing that someone thought that Stallone can match Caine's acting) the film soon slumps into a bad case of mediocrity. It has the same idea as the original and tries to be as badass with its kinetic and almost experimental direction, but ends up being just poor. Stallone's Carter is given an almost soft side that goes complete against the character from the first film. On top of that there are some enjoyable car chases, but they serve as sensationalism that was critically lacking from the first film. Then there is the ending, which has some merit (since the film already establish Carter as softer then the original), but even so, it is still pretty stupid and leaves the film with little to say or resonate with. That ultimately makes this is second rate crime movie that you might enjoy, but don't count it. --- 5/10 Rated R for violence and profanity",
         "For some unknown reason, the industry 'suits' have decided to black-list Sylvester Stallone, not giving him large leading roles, and when they give him a role, they refuse to heavily market his films. This trend started, I believe, sometime during the early 90s, probably after his last big hit, \"Cliffhanger.\" Nevertheless, Stallone has continued to make films, most of them actually pretty good. That said, \"Get Carter\" is probably one of Stallone's better films of the last ten years (I think it's second to \"Cop Land\"). He portrays his role as the 'financial adjuster' (as he described it) Jack Carter. The remainder of the supporting cast, including Mickey Rourke, Rachel Leigh Cook, John C. McGinley, Alan Cumming and Michael Caine, each deliver convincing performances, conveying their characters' emotions with amazing quality. I really noticed the way the film's editing and photography changed towards the end of the film, after beating up McCarty (McGinley) in the elevator. The way the film swiftly cuts ahead a couple of seconds is simply spectacular to watch. The many odd photography angles describe the uncertainty of the scenes, and make me feel unsure as well. Living in the Seattle area, seeing the great landmarks I see every day on the screen is quite something else. And for the record, it doesn't rain nearly as much here as people think. If you haven't watched this film and have heard all the negative reviews given by the industry-paid critics, ignore them and rent it. You'll be pleasantly surprised.",
         "I simply do not get what certain people have against this movie. Sure, it's not a cinematic breakthrough, but it is very sharp, smart and focused. Jack Carter's brother, Richie, dies under mysterious circumstances. Jack goes back to his home town to check things out and perhaps find out the truth. What he finds is not all that easy to get to grips with. This is not your usual run of the mill revenge movie. The story has some layers to it and I am surprised to see that people did not appreciate that. Jack Carter is not a good guy. He is a bad man working in bad town doing bad things. Always was a bad guy. But he reaches a moment in his life when the things that take place between him and his boss's girl Audrey, the things that he finds out about his brother and his brother's family, all of them act as a catalyst. For once in his life he tries to set things right. How does he do that? By doing what he knows to do. He does bad things. The guys he goes up against are a little a out of the reach of the law. To wait for justice to set things right is not a concept Jack is familiar with. The only things he knows is to take care of his own dirty laundry. And at the moment his life is his dirty laundry. He was not there for his brother, for his niece and he missed some oportunities... Time to set things right. But he does only bad things in this movie. He kills people by shooting them, by throwing them out of the balcony, by beating them up in the elevator. WHY? Because these are the same things that would happen to him if he let his guard down. Great acting performances form most guys in the movie. Stallone seems to have found some serious acting genes within himself. This is some of his best work and his best is very good. Not only for the genre. Although when looking back at Oscar (his 1991 comedy), D-Tox (a very underrated movie) and Copland I have to say that this is not a one off. No sir. When the script, the director and the rest of the cast are good he can act big time. Michael Caine made a very good movie called get Carter back in 1971. I love that movie and is always one of my favorites to watch on Turner Classic Movies. The remake, I felt, is just as good. Sure it has the sort of usual happy ending, but that is just the American Way of ending action movies. They love a hero. Mickey Rourke, Alan Cummings, Michael Caine and Rachael Leigh-Cook are very good in this one. Somehow Miranda Richardson seemed a little over the top in her angry widow/mother scenes. Michael Caine acted in this one simply because he knew it was good. The movie could have been done without him, without a doubt. But he did it because unlike other remakes, this one is just as good as the original. It has it's own style, a somewhat different story and a happier ending. Otherwise, they are two very similar movies. And even if some consider the original as better, they should not write this one off. The layers are there, you just have to dig. And this only because the producers did not get this movie. The director, the cast, everybody got this movie and knew what they were making except for the producers who seem to have been thinking of another movie. Michael Caine seems to have given his seal off approval to Stallone's acting in this one. The producers wanted a classic 80's action movie. At least that's what I feel. So, this is a very good movie. Just as good (or almost as good, depending on how you look at it) as the original. It has great acting, sharp directing, nice car chase scenes, nice action scenes, some great moments, some wonderful music, a simple yet effective storyline that keeps you guessing and wanting to see more. And as someone put it, crap like XXX, The Fast and The Furious (+sequel, at least is has some cars), Charlie's Angels (+sequel. could not even watch) and other such teen-hormone-slang-flash-driven movies have a higher rating, IT SIMPLY ISN'T RIGHT!!!!!! 7.5/10",
         "The central figure of this film, Jack Carter, is a Las Vegas gangster who returns to his roots in Seattle following the death of his brother. This was officially reported as an accident, but Jack suspects that his brother may have been murdered by members of the local criminal underworld. The film charts Jack's attempts to find out the truth and to take revenge. This is, of course, a good example of Hollywood's cannibalising of the British and European film industries in its endless search for a good story. It is a remake of Mike Hodges's classic from 1971, one of the few great British gangster films. That film was one that grew out of, and yet at the same time transcended, a particular place and time, the North-East of England in the early seventies. This was a time of rapid social change in Britain, marked by increasing social mobility, growing permissiveness and relative prosperity, elements all reflected in the film. Like many of the best British films, it had a strong sense of place. Its fidelity to a real time and place was not a weakness but a strength, helping to establish it firmly in the realm of reality and to convey its major theme, the sterility and futility of the criminal lifestyle. Its view of the underworld acted as a necessary antidote to the tendency, very prevalent in the late sixties and early seventies, to glamorise criminals (\"The Thomas Crown Affair), sentimentalise them (\"The Italian Job\") or mythologise them (\"The Godfather\"). Stephen Kay's film attempts to establish a similar sense of place to the original; the Seattle we see has a bleak, forbidding atmosphere, always shrouded in rain or mist. It has a much more star-studded cast than the original, with at least one reasonably good performance from a convincingly thuggish Mickey Rourke. Despite this, however, it is a far inferior film when compared with the original. The main reason is the way in which the character of Jack Carter has been changed. Michael Caine's Carter was, for all his sharp suits and fast cars, no more than a ruthless street thug, a poor boy made bad at a time when other poor boys were making good. Sylvester Stallone's character, by contrast, may have a rough exterior (Stallone plays him as outwardly impassive, with a gruff, emotionless voice) but beneath it he is one of the good guys. The plot has been rewritten to make Carter less brutal and ruthless and to allow him to survive at the end. The original was a morality play on (as another reviewer has pointed out) the theme of \"those who live by the sword shall die by the sword\". The remake is simply a revenge thriller with a hero whom the audience can root for. This illustrates one of the perils of the remake. Kay's film has kept the title, the bare outlines of the plot and even some of the names of the characters, but completely fails to capture the spirit of the original. Moreover, it is unable to replace that spirit with anything new. If the film-makers had wanted to make an exciting goodie-versus-baddies revenge thriller, they could have chosen a better starting-point than the plot of a film made some thirty years earlier with a very different aim in mind. It has become something of a tradition for remakes to feature cameo appearances by the stars of the original films. Martin Scorsese's \"Cape Fear\", for example, featured no fewer than three actors who had appeared in the earlier J. Lee Thompson version, Gregory Peck, Robert Mitchum and Martin Balsam. That, however, was a rare example of a remake that we as good as, or even better than, the original. Kay's \"Get Carter\", however, is not in the same class as Hodges's. It was, therefore, rather disappointing to see Michael Caine appearing in a remake that can only diminish one of his best films. 4/10",
         "CONTAINS SPOILERS. As someone who ranks 'Get Carter' (1971) on my top ten list, I probably should have avoided this, but curiosity got the better of me and I finally got a copy of the re-make on VHS in a sale. It started well and there were some nice nods to the original film, notably Carter's traveling to Seattle by train, the theme music and of course Caine's cameo. Did anyone notice that the guys sent from Vegas came in a Jaguar? I assumed that Seattle was a good US version of Newcastle, northern, wet and gloomy. Unfortunately as the film progressed it became obvious that this was not in the same class as the original. In fairness, there was some good acting from Stallone and Rourke and the action sequences were well-handled and stylish, particularly the car chase. Unfortunately, that wasn't enough to save the film. The problem was that no matter how hard I tried, I couldn't help comparing it to the 1971 version. In the original Carter is cold and calculating beyond anything we have seen before to the point of being irredeemable and it was this facet that shocked audiences then and still does. He only shows emotion once, when he sees the 'blue' film, but this only stirs him into violence rather than reason. He kills without compunction everyone he feels responsible for his family's fate and those he can't kill he leaves open to the authorities. He is the ultimate 'hard man,' and when he says 'with me it's a full time job' you know he means it. Stallone's Carter should be in group therapy by comparison. He comes across as actually quite weak by the end of the film. In the original we never know for sure that Doreen is his daughter (rather than niece), but it is signposted. In the Hollywood version it is made explicit and the story loses a lot of impact, replaced by some sort of father-daughter bonding that is out of touch with Carter's character. BIG SPOILER - YOU HAVE BEEN WARNED. The ending really put the cap on things. For those of you still reading this who have not seen the original (you have been warned), Carter is shot dead by a hit man after killing Paice. The irony is that Kinnear has ordered this not knowing that he is about to be arrested by the vice squad for peddling under-age pornography. All of this is lost in the re-make as Stallone's Jack Carter drives off into the sunset, presumably redeemed by his experiences. And with that, a classic is reduced to a good, but not great thriller.",
         "By far, the most entertaining moment on the DVD of \"Get Carter\" is the hilariously outdated 1971 theatrical preview for the original version of the film, which starred Michael Caine. (Caine does appear in this Stallone update.) Sadly, this update stinks. Sylvester Stallone's Jack Carter, a Las Vegas button man, skips town without his boss's permission and heads up to his old stomping grounds in Seattle to investigate the mysterious death of his brother, whom he hasn't seen in five years. That's the pitch. The action is surprisingly restrained and impressionistic. For example, when one of the minor bad guys gets killed, we see the result of a headlong plunge but not the actual slaying. But this kind of restraint doesn't dovetail with the promise of the previews: an ass-kicking Stallone in a Rat Pack suit. The director tries to gloss over the many plot holes with slick, faux-Fincher cuts and zooms, but he's just covering. Here's the tragedy. Action-thrillers don't require good acting, but they sure are enhanced by it. Most of the actors in \"Get Carter\" have the ability to far outshine this genre, much the way the actors in 1998's \"Ronin\" did-within the context of the plot, the cast of \"Ronin\" delivered their lines with utter conviction. Not necessarily so here. Those stars in \"Get Carter\" who have real talent weren't used enough, and those who don't have the strongest dramatic chops were given boatloads of screen time. Sly is wooden at times (as per usual), but has some fine moments. Miranda Richardson, as Carter's widowed sister-in-law, is solid, but underutilized. Mickey Rourke, as an internet porn purveyor, has obviously been working out some more, but it's still apparent that he peaked in \"Diner.\" The big surprise was just how much actual characterization they allowed Rachael Leigh Cook--as Carter's bereaved niece--to show off. Any one of these actors, given enough on-screen opportunity, might have saved \"Get Carter\" from its ridiculous plot holes and incongruities. But they didn't. Do yourself a favor: avoid this film.",
         "Approximately 1/10th as good as the original, this version of GET CARTER doesn't even have the courage to use the original ending. And it is edited in today's hyper-trendy style using extremely brief shots edited together in a welter of images hoping to create an impression of kinetic action. Instead, it's just indecipherable chaos. Stallone tries his best, but his mustache and goatee have the odd effect of squeezing his lips together increasing his resemblance to a fish. He's also saddled with long, boring scenes with his niece (or maybe she's his daughter) that really don't lead anywhere. This has a different main villain than the original, but it's hardly a surprise since Mickey Rourke's character gives it away in his first scene. (But what happens to Mickey Rourke later? If he's dead, why wasn't there some kind of reaction from the numerous bystanders?) Stallone needs to forget about the audience liking him, and go for the realism of the character, but he never, never will show that kind of imagination and integrity. Showy, trendy junk.",
         "In our times, the idiots, cretins, imbeciles seem to prevail; yet it is still astonishing that a movie like this crap ,this mega\u0097crap, ever gets being made, released ,etc.. Our times are maybe poor for the Hollywoodian cinema, with several trends of lifeless flicks occupying the first ranks; yet this Stallone flick is outrageous even being given that. What kind of morons, of retards, of cretins are those who dared to get this rubbish on the market? (Let alone any comparison with one of the masterpieces of the thrillers, the Caine film I mean. Is Stallone the man to replace \u0085Caine? How dumb must one be to even dream of this?) It is bad AS exploitation, violence, brutality, etc.; it is an outrageous movie for its genre. Its problem it's not its genre; on the contrary\u0097it is its failure as a genre movie. It completely fails to be a genre movie. It is not for those who like genre films.",
         "In 1971, the first of these action, violence prone films was offered. In the original novel, written by Ted Lewis, it was Michael Caine who was the unstoppable, revenge filled Gangster out to discover who killed his brother. In this updated version directed by Stephen Kay, we have Sylvester Stallone playing Jack Carter. Both versions were very well conceived. The updated film has added the blood, gore and non-stop drama which is common with newer versions. The story remains the same in that Carter (Stallone) learns his younger brother died under suspicious circumstances and he is determined to learn why. Along the way, he is met with business types who are not interested in helping Carter find the truth. To that end, John C. McGinley, Mickey Rourke and even Michael Caine get in the action. The movie is filled with dark sequences, black violence and thrilling chase scenes, all of which add to the final outcome. Great movie and a worthy successor to the original. ****"
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Morgan Creek Productions",
         "Franchise Pictures",
         "Canton Company, The"
      ],
      "summaries": [
         "Years ago, Jack Carter left his Seattle home to become a Las Vegas mob casino financial enforcer. He returns for the funeral of his brother Richard 'Richie' after a car crash during a storm, atypical of the careful house-father. Talking to the widow, daughter Doreen and enigmatic Geraldine, Jack suspects it was murder. Cliff Brumby, whose club Richie ran, is financially linked to porn and prostitution baron Cyrus Paice, who claims to be just a front-man for ITC tycoon Jeremy Kinnear. Someone hired goon Thorpey to make Jack return to Las Vegas. There Jack's partner Les Fletcher is restless, apparently about their boss Con McCarty whose wife had an affair with Jack. Someone breaks into Richie's home, looking for a crucial CD.",
         "Jack Carter, a mob enforcer living in Las Vegas, travels back to his hometown of Seattle for his brother's funeral. During this visit, Carter realizes that the death of his brother was not accidental, but a murder. With this knowledge, Carter sets out to kill all those responsible."
      ],
      "budget": 40000000
   },
   "movielensId": 3946,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-10-06",
      "dvdReleaseDate": "2001-02-13",
      "directors": ["Stephen T. Kay"],
      "runtime": 102,
      "movieId": 3946,
      "title": "Get Carter",
      "mpaa": "R",
      "actors": [
         "Sylvester Stallone",
         "Miranda Richardson",
         "Rachael Leigh Cook",
         "Mickey Rourke",
         "Johnny Strong",
         "Rhona Mitra",
         "John C. McGinley",
         "Alan Cumming",
         "Michael Caine",
         "Gretchen Mol",
         "John Cassini",
         "Crystal Lowe",
         "Mark Boone Junior",
         "Tyler Labine",
         "Tom Sizemore"
      ],
      "imdbMovieId": "0208988",
      "originalTitle": "Get Carter",
      "genres": [
         "Action",
         "Drama",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["8vhxyEcR-FM"],
      "plotSummary": "Remake of the Michael Caine classic. Jack Carter, a mob enforcer living in Las Vegas, travels back to his hometown of Seattle for his brother's funeral. During this visit, Carter realizes that the death of his brother was not accidental, but a murder. With this knowledge, Carter sets out to kill all those responsible.",
      "tmdbMovieId": 10461,
      "avgRating": 2.38015,
      "releaseYear": "2000",
      "numRatings": 1239,
      "posterPath": "/5Dv9QJNJx4cF96lDtX4KGtplNTJ.jpg"
   }
}