{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0112849",
      "video": false,
      "title": "Desert Winds",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Eugene",
               "gender": 2,
               "credit_id": "535e69ee0e0a264fe1006609",
               "name": "Michael A. Nickles",
               "profile_path": null,
               "id": 126837,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Crazy Venezuelan",
               "gender": 2,
               "credit_id": "535e6a060e0a264feb0064ee",
               "name": "Adam Ant",
               "profile_path": "/yR263tgbm02rLS044xLCDkFDyKu.jpg",
               "id": 45042,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jackie",
               "gender": 1,
               "credit_id": "535e6a220e0a264feb0064f0",
               "name": "Heather Graham",
               "profile_path": "/rHIEhPAnZQn8BTbB1EVQ5ggEOX7.jpg",
               "id": 69122,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Young Jackie",
               "gender": 0,
               "credit_id": "535e6a360e0a264fe500694d",
               "name": "Jessica Hamilton",
               "profile_path": null,
               "id": 1314585,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Eugene's Father",
               "gender": 2,
               "credit_id": "535e6a500e0a264fe8006602",
               "name": "Jack Kehler",
               "profile_path": "/huxiFLWgthatgaEIT4u36muUJMg.jpg",
               "id": 1240,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Alluring Woman",
               "gender": 1,
               "credit_id": "535e6a780e0a264fdb006425",
               "name": "Kay Parker",
               "profile_path": "/jUjZIH0alF84DzZCiD5Q1ZbX5KG.jpg",
               "id": 107048,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Sweaty Man",
               "gender": 2,
               "credit_id": "535e6a900e0a264fe8006605",
               "name": "Nick Searcy",
               "profile_path": "/v9GX9SeQsWwAzRIw5RUB0eG8VT8.jpg",
               "id": 12538,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Jackie's Mother",
               "gender": 1,
               "credit_id": "535e6aa70e0a264fe1006619",
               "name": "Grace Zabriskie",
               "profile_path": "/ibBabuSM1UyPYFFo0wBXhGbqElk.jpg",
               "id": 6465,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "535e69b80e0a264fdb006416",
               "name": "Michael A. Nickles",
               "profile_path": null,
               "id": 126837,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "535e69c60e0a264fe80065ef",
               "name": "Michael A. Nickles",
               "profile_path": null,
               "id": 126837,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.852907,
      "production_countries": [],
      "id": 267188,
      "vote_count": 0,
      "budget": 0,
      "overview": "Jackie and Eugene are joined by a mystical wind tunnel which enables them to speak across a 500-mile desert. Believed by the Indians to be an omen of good luck, the wind inspires both characters to face their fears and follow their hearts.",
      "similar": [],
      "original_title": "Desert Winds",
      "runtime": 97,
      "poster_path": "/vvceS641s5Sh4ec660nhnMXHnh2.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1997-12-31",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "It began with a whisper",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael A. Nickles"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Michael A. Nickles"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112849/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0NDc0NTU3OF5BMl5BanBnXkFtZTcwMzMyNDkyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Adam Ant, Heather Graham, Jessica Hamilton | See full cast and crew »"],
      "reviews": [
         "I'm always looking to discover small films that might hold something unique and interesting, so when I read a comment about Desert Winds that caught my interest I decided to watch it. And I'm not sorry I did. I should state right up front that this will almost definitely not be to everyone's taste because there is almost no action and there is a lot of dialogue -- or monologue, depending on how you want to view it. But it will also be a very pleasant experience for many out there, possibly the same group of viewers who remember Richard Linklater's film Before Sunrise with pleasure. I was constantly being reminded of that film while watching Desert Winds. Even though the production values of this film show a limited budget it is still very well conceived and executed despite that. Michael Nickles and Heather Graham were never uninteresting to watch and listen to as they tentatively revealed themselves to each other across a huge chasm. The whole idea and concept was intriguing. While Nickles still has a way to go as a writer, he clearly is on his way there and I will definitely be interested in whatever else he does.",
         "When Jackie (Heather Graham) was thirteen years old, she spoke through a wind tunnel through the desert with a young man 500 miles apart. Seven years later, the romantic Jackie and the skeptical Eugene (Michael A. Nickels) make contact again with each other, when they exchange their hopes, failures, expectations, frustrations and life experiences. 'Desert Winds' is a low budget movie, having an intriguing, weird and bitter romance through the dialog between Heather Graham and Michael A. Nickels. The story is disclosed in a very slow pace and it is recommended for viewers who like to find different and unknown movies like me. I bought this VHS just because of the name of Heather Graham and I do not regret. My vote is six. Title (Brazil): 'Ventos do Deserto' ('Desert Winds')",
         "This was not too bad a movie about a far-away romance. A young girl wanders out to a desert plateau in New Mexico and speaks into the wind. She is shocked when she gets a response, from a guy 500 miles away in Arizona. It seems as if they have found a wind tunnel which enables them to communicate over a great distance. Seven years later, they reconnect and discuss life's circumstances. I thought the movie was OK. It had themes about following your heart and desires and encouraging others to do the same. I also thought it was too slow in some places, but that wasn't too bad. It had nice touches of romance and good conversations between the too leads. It was a decent movie at best. ** 1/2 out of ****",
         "I saw this charming little film on cable late at night in 1996 or so. It was the first time I noticed Heather Graham, and I was spellbound. Watching her face with those huge blue eyes and full red lips was absolutely mesmerizing. The film itself was strangely alluring. The cinematography, especially the fire-lit facial close-ups, was very pretty. I felt compelled to watch it. Also, I was intrigued by the unusual device of having the characters being able to communicate remotely via a \"wind tunnel.\" I agree with the other poster's comment that it allowed the two principal characters to develop an intimacy that would have been unlikely otherwise. Those looking for plot development or action needn't bother. This is a study of two characters and how they get to know each other in an unusual way. It's a nice alternative to most Hollywood crap.",
         "...will pretty much get their chance by renting this video. The story, what there is of it, concerns a young woman in an uncomfortable living situation and a sexually jaded man with a dying father (Nickles), who are able to talk in a conversational voice over a 300 mile or so chasm. This was a production that did not cost the studio very much - the two leads almost never had to share the same shot together. The rest of the movie consists of a couple of dreary sex scenes (no, Heather is not included) and Graham and Nickles having short supposedly meaningful conversations with their parents. While I find Ms. Graham as alluring as the next guy, I suspect most viewers, like me, will find this movie a handy nonchemical substitute for Sominex.",
         "This intelligent film is a work of true originality. It is a coming-of-age story full of complicated emotions, but its style of storytelling is elegantly simple. Eugene (Nickles) and Jackie (Graham) are both young, drifting soul-searchers who have been wounded by their life experiences. They separately stumble upon a mystical \"wind tunnel\" which enables them to communicate to each other, carrying their voices across hundreds of miles of desert. This strange phenomenon allows them an intimacy they've never imagined-- despite the fact that the two have never even met face to face-- and the experience transforms them. Although shot on a very modest budget, the cinematography is first-rate, handling both the sweeping shots of the picturesque Southwestern landscape and the firelit close-ups of the actors' expressive faces with equal skill. This film is clearly the product of the filmmakers' passion to convey something meaningful to people (rather than the usual cheap desire to set box office records). It's a moving story about hope, true love and the perseverance of the human spirit. A unique, artistic achievement."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": ["Achilles Films"],
      "summaries": ["Jackie and Eugene are joined by a mystical wind tunnel which enables them to speak across a 500-mile desert. Believed by the Indians to be an omen of good luck, the wind inspires both characters to face their fears and follow their hearts."],
      "budget": 0
   },
   "movielensId": 395,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-12-31",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Michael A. Nickles"],
      "runtime": 97,
      "movieId": 395,
      "title": "Desert Winds",
      "mpaa": "NR",
      "actors": [
         "Michael A. Nickles",
         "Adam Ant",
         "Heather Graham",
         "Jessica Hamilton",
         "Jack Kehler",
         "Kay Parker",
         "Nick Searcy",
         "Grace Zabriskie"
      ],
      "imdbMovieId": "0112849",
      "originalTitle": "Desert Winds",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Jackie and Eugene are joined by a mystical wind tunnel which enables them to speak across a 500-mile desert. Believed by the Indians to be an omen of good luck, the wind inspires both characters to face their fears and follow their hearts.",
      "tmdbMovieId": 267188,
      "avgRating": 2.86111,
      "releaseYear": "1997",
      "numRatings": 18,
      "posterPath": "/vvceS641s5Sh4ec660nhnMXHnh2.jpg"
   }
}