{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "awol",
            "id": 169123
         },
         {
            "name": "fort polk louisiana",
            "id": 169125
         },
         {
            "name": "target practice",
            "id": 169129
         },
         {
            "name": "guitar player",
            "id": 169130
         },
         {
            "name": "exhaustion",
            "id": 169131
         },
         {
            "name": "simulated battlefield",
            "id": 169134
         },
         {
            "name": "military hardship discharge",
            "id": 169136
         },
         {
            "name": "military discharge",
            "id": 169140
         },
         {
            "name": "stockade",
            "id": 169141
         },
         {
            "name": "fort leavenworth kansas",
            "id": 169143
         },
         {
            "name": "peace sign",
            "id": 169144
         }
      ],
      "imdb_id": "tt0170691",
      "video": false,
      "title": "Tigerland",
      "recommendations": [
         11022,
         10652,
         2055,
         1365,
         11468,
         13715,
         3536,
         12100,
         10592,
         6723,
         12395,
         9545,
         11983,
         8665,
         9952,
         10479,
         13291,
         4909,
         8649,
         9333
      ],
      "backdrop_path": "/fjHKnEnlgTswengC5eCjUM6by3m.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "55abdb1ec3a368648e0060a4",
         "content": "Just because you wear those sergeant's stripes doesn't mean you ain't gonna die.\r\n\r\nTigerland was the name of a U.S. Army training camp located at Fort Polk, Louisiana. Tagged as the second worst part of the Earth, it was a recreation of the Vietnamese jungle and was used to prepare American soldiers for the hellish terrain they were soon to be fighting in. \r\n\r\nDirected by Joel Schumacher, Tigerland stars Colin Farrell as Private Roland Bozz, a reluctant recruit to the war effort who upsets his superiors by having a canny knack for exploiting loop holes in the rule book. However, it's evident that Bozz has leadership qualities, but can the officers convince him he is born to lead? \r\n\r\nBy the time of Tigerland's release, the Vietnam movie had apparently run its course. The announcement that Joel Schumacher was to delve into the conflict for his next movie was met with less than enthusiastic responses. This was after all the director who had not too long prior reduced the once darkly watchable Batman franchise to comedy campy ham overdrive. Alarm bells were further starting to go off when it was revealed that it was to be a short low budget shoot of 28 days, with a cast of unknowns and filmed in grainy 16 millimetre. Yet two things were forgotten by his many detractors. One was that Schumacher had showed himself capable of guiding a young vibrant cast to high levels of watch-ability (The Lost Boys), and two, that he had made Falling Down in the early 90s, thus tricky and darker edged material was not beyond him. \r\n\r\nTigerland is a fine film, there is no actual conflict to observe other than the interactions between Bozz, his fellow squadies and his superiors. This is more boot camp drama than a film about military engagements. But the impact is much the same as our group of young men prepare for a fate that doesn't exactly have favourable odds; their respective reasons for being there in the first place containing varying degrees of bravado or disbelief. To which, much to his initial bemusement, Bozz simultaneously becomes a beacon of hope to many and a figure for revilement. The out-shot of this is that Tigerland winds up an expertly crafted movie, one that is propelled by great acting and one that quietly sneaks up on you and cloaks you in sadness. \r\n\r\nSchumacher is not the sole reason for why the film works so well though, he had some quality help. Ross Klavan and Michael McGruther's screenplay rises above the character clichés that exist in every army training camp based movie. Helped enormously by Klavan drawing on his real life experiences in the army, Tigerland doesn't hurtle towards its climax (a climax that is understated and poignant), it takes its time, characters are formed and with the then unknown Farrell on stupendously bewitching form, it's as engaging as a Vietnam film gets. This in spite of the grim look of the piece as Matthew Libatique's cinematography strips away vibrant colours and uses murky greys and greens to put the viewer right in there with them at boot camp. The look, the feel and the story all pull together nicely, making Tigerland fit to be mentioned in the same breath as those popular Vietnam movies from the previous decades. 8/10",
         "url": "https://www.themoviedb.org/review/55abdb1ec3a368648e0060a4"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Pvt. Roland Bozz",
               "gender": 2,
               "credit_id": "52fe43a39251416c750182ff",
               "name": "Colin Farrell",
               "profile_path": "/pgMM9r5ll99RXSmz1J4sj8zaddW.jpg",
               "id": 72466,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pvt. Jim Paxton",
               "gender": 2,
               "credit_id": "52fe43a39251416c75018303",
               "name": "Matthew Davis",
               "profile_path": "/crjsdQlWTVKFPS5XKuLOcVMFFNd.jpg",
               "id": 56045,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Pvt. Miter",
               "gender": 2,
               "credit_id": "52fe43a39251416c75018307",
               "name": "Clifton Collins Jr",
               "profile_path": "/31FbXPcEwKLE1eiQ8ceyQpsnheE.jpg",
               "id": 5365,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Pvt. Cantwell",
               "gender": 2,
               "credit_id": "52fe43a39251416c7501830b",
               "name": "Tom Guiry",
               "profile_path": "/3LcbdkpjePcQk8q4QbRg7uhNMgN.jpg",
               "id": 4729,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Pvt. Wilson",
               "gender": 2,
               "credit_id": "52fe43a39251416c75018327",
               "name": "Shea Whigham",
               "profile_path": "/xlLI0hrutcyKOIHs4b47iSh65NU.jpg",
               "id": 74242,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Staff Sgt. Thomas",
               "gender": 0,
               "credit_id": "52fe43a39251416c75018337",
               "name": "James MacDonald",
               "profile_path": "/1Ktzfgvq7wdTbavMC594rKYvx7R.jpg",
               "id": 1188456,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Sgt. Filmore",
               "gender": 2,
               "credit_id": "57cb3854925141643e0021c2",
               "name": "Michael Shannon",
               "profile_path": "/5yGCJ6znHM96zTfW2LNP6uPPDCZ.jpg",
               "id": 335,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018311",
               "name": "Joel Schumacher",
               "profile_path": "/ijI5sCPqDvT18NRWCeBqw8BJIZx.jpg",
               "id": 5572,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018317",
               "name": "Nathan Larson",
               "profile_path": null,
               "id": 2863,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c7501831d",
               "name": "Mark Stevens",
               "profile_path": null,
               "id": 5583,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018323",
               "name": "Matthew Libatique",
               "profile_path": "/wUnEHGYRQRa459aGoTZpqYRwAIK.jpg",
               "id": 4867,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c7501832d",
               "name": "Ross Klavan",
               "profile_path": "/20bIeNhwRyWICJ4DAf7t4a6PqnQ.jpg",
               "id": 66599,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a39251416c75018333",
               "name": "Michael McGruther",
               "profile_path": null,
               "id": 66600,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 6.273918,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 10687,
      "vote_count": 193,
      "budget": 10000000,
      "overview": "A group of recruits go through Advanced Infantry Training at Fort Polk, Louisiana's infamous Tigerland, last stop before Vietnam for tens of thousands of young men in 1971",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         97630,
         101,
         205,
         141,
         339692,
         281957
      ],
      "original_title": "Tigerland",
      "runtime": 101,
      "poster_path": "/yyW54WcjMFX4NTRy1NnKIeaWhLS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "KirchMedia",
            "id": 73949,
            "origin_country": ""
         },
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Haft Entertainment",
            "id": 1363,
            "origin_country": ""
         },
         {
            "logo_path": "/hNuGhsKVlmhnwSRcmOejDBDjh6w.png",
            "name": "New Regency Pictures",
            "id": 10104,
            "origin_country": ""
         }
      ],
      "release_date": "2000-09-22",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "The system wanted them to become soldiers. One soldier just wanted to be human.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joel Schumacher"],
      "runtime": 101,
      "synopsis": "At Fort Polk, Louisiana, in September of 1971, Private Bozz ( Colin Farrell) joins an infantry company after spending time in corrective custody, set for eight weeks of training to be concluded with a final test at Tigerland, a U.S. training ground that serves as the last stop before Vietnam. Bozz has no desire to go to war and acts like it. Even though his weekend leave is withdrawn he still goes to town and ends up going to a hotel room with two girls and fellow soldier Paxton ( Matthew Davis). Bozz and Paxton make friends despite their different outlooks; Paxton has enlisted for service and wants to go to Nam for the experience. At the base, while Bozz shows that he is capable of being a good soldier when he wants to, he continues to attract disciplinary penalties as well as the anger of fellow privates, especially one named Wilson ( Shea Whigham). The higher ranked personnel are abusive, especially Sergeant Thomas ( James MacDonald), who one night knocks young Private Cantwell ( Tom Guiry) to pieces. When Bozz learns that Cantwell is married and a father to four children he helps Cantwell get out of military duty. Soon after, Private Miter ( Clifton Collins Jr.), made platoon leader, is left a nervous wreck when officers abuse him for not managing to control his group. Though Bozz continues to disobey orders, Sergeant Landers ( Afemo Omilami) is determined to turn him into a soldier and makes him new platoon leader. When Miter breaks down and wants to leave base, Bozz helps him get out of the army for mental health reasons. Bozz soon has a reputation for getting soldiers discharged, and his superiors don't like it one bit. On the weekend before Tigerland, Private Wilson starts a fight with Bozz; when Bozz wins the fight, their animosity is sharpened. At shooting practice soon after, Wilson almost shoots Bozz, stopped only by a weapon malfunction, and Captain Saunders ( Nick Searcy) removes Wilson from the platoon. Tigerland. Under the supervision of Sergeant Cota ( Cole Hauser), who shares his own experiences from Vietnam, the men make their way into the forests. Paxton falls behind, exhausted. When they face another platoon in a war simulation, Wilson turns out to be leading the other platoon. He loses his temper with Bozz and Paxton, and his platoon loses the exercise. At night, Bozz is about to make an escape when Private Johnson ( Russell Richardson) convinces him to stay. Next morning they once again engage Wilson's platoon in an exercise. As Bozz leads his mean down a stream, Wilson organizes an ambush and loads his gun with live ammunition. When Bozz comes into sight he shoots; he misses, and Cota disarms him, but Bozz uses a moment of confusion to shoot a blank at Paxton's head so that he can't go to Vietnam. In the final scene, Paxton thanks Bozz and says goodbye as the platoon leave on a bus. Paxton says he will write a book about Bozz, but Bozz has Paxton's notebook and starts tearing it up as the bus drives away. Paxton's narration tells us he never saw Bozz again and can't be sure what happened to him.",
      "writers": [
         "Ross Klavan",
         "Michael McGruther"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0170691/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5ODMyNTI5NV5BMl5BanBnXkFtZTcwNTYyMTcyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Colin Farrell, Matthew Davis, Clifton Collins Jr. | See full cast and crew »"],
      "reviews": [
         "I thoroughly enjoyed this movie, but it is nothing new. Everyone here is grouping it with other war movies, this movie has been miscategorized! Its not a war movie any more than \"One flew over the cuckoos nest\" is a asylum movie or \"Cool Hand Luke\" is a prison movie. This is a movie about individuality, nonconformity, self-confidence and the costs of that personality type. The plot is the same as \"One flew over the Cuckoos nest\" and \"Cool Hand Luke\", its in GOOD company, and it holds its own. Its these movies it should be held up against and compared, not \"Apocalypse Now\" or \"Platoon\". Eric",
         "Tiger Land is a tough training camp for the US military. In 1971 it is the final step before the squads go to the war in Vietnam. In training before Tiger Land, one squad of young men is joined by troublemaker Roland Bozz, who continues his military trend of dissention and insubordination. However, his actions do not just affect him and he starts to change his ways slightly, but the stresses and the potential for death in Vietnam push all the men to breaking point. Sold as a war movie, this film is more like the first half of Full Metal Jacket than a full on war movie set in a combat zone. As such it plays more like a drama than any sort of antiwar movie or outright thriller. The focus of the film is the character of Bozz as told from the biographical point of view of Paxton. The events of the film are pretty predictable for anyone who has seen this type of film before - the internal fights, the crazy soldiers, the domineering sergeant majors etc. However it still manages to be enjoyable and entertaining even if it never really feels original or new. It is a pretty nondescript film with no specific edge on it - and that is part of the reason I think it really didn't do that good business when it was released here in the UK. It relies very heavily on the characters to keep the audience involved in the story and preventing it being seen as just a collection of old ideas; this aspect is helped by the fact that it is drawing on original material, experiences and people. A much bigger part of the characters being engaging is the playing of them by the cast. Farrell is the lead actor and is miles ahead of everyone else. This film is one of many that made him the star he now is, and he does deserve it off the back of this and he is really good here - coming across as likeable and difficult. Outside of him, everyone plays well but are generally in their various stereotypes; aside from Farrell, Collins is the standout role - too often seen playing gang bangers and such on TV cops shows, he delivers a solid character and presents a believable breakdown over the course of the film. Keeping my habit of never paying to see an Schumacher film since Batman & Robin took the last faith in his talent, I waited for this to come onto TV. I was surprised however to see that Schumacher managed to do the film without spoiling it - in fact he came across as rather able! He uses mainly handheld cameras and delivers a gritty feel to the whole film that is fitting to the material. I hate to admit it, but he actually did a reasonable job here and he has now done a couple of films that he hasn't ruined in one way or another! I may have to change my mind about not paying for his films - well, maybe not. Overall this is a rather undistinguished film but one that is enjoyable as a character driven drama, trading on the usual clichés of the genre. It goes where you more or less expect it to but it goes there and takes you with it. Farrell makes a good leading man and on this evidence he is worthy of leading man status where he has good support.",
         "While it was filmed at a Florida National Guard site, \"Tigerland\" totally reminded me of Fort Polk, LA., firing ranges, maneuver areas, waist-deep water and all. The movie was fairly authentic and the characters similar to those same ones at my AIT in 1974. The difference between the Tigerland year, 1971, and mine of 1974 is all the drill sergeants and instructors knew they weren't going back to Vietnam, as it was pretty much all over, so training was very relaxed - not a challenge at all. That was the precursor to all our troubles in the 70s and 80s, which I know for a fact as I stayed in until 2004. I never heard anyone mention \"Tigerland\" but the Army did have realistic Vietnam training villages at different bases across the U.S. Vietnam Vets tell me that up to 1972 Basic & AIT could be pretty rough and rugged, because the trainers had been there and were mandated to train Vietnam-bound men those skills to make it, although that was not always the case. Both a drill sergeant at Polk and later one of my Vietnam Vet NCOs, when we had become instructors at a basic training brigade at Fort Bliss, told me there was nothing they could do to get anyone ready and people just had to find out and figure out for themselves. This movie rates high.",
         "TIGERLAND Aspect ratio: 1.85:1 Sound format: Dolby Digital Louisiana, 1971: During basic training, a rebellious army conscript (Colin Farrell) causes dissension within the ranks. Given Joel Schumacher's reputation as a schlockmeister par excellence, most critics were caught off-guard by this low-budget drama, filmed without any of the frills and fripperies normally associated with Hollywood blockbusters, and headlined by little more than obscure (but hugely experienced) character actors and talented newcomers, including Farrell, whose bravura performance launched him to international stardom. Far removed from the extravagant Vietnam-operas favored by Francis Ford Coppola and Oliver Stone, Schumacher's film examines the contradictions of war and the dehumanizing effect of combat on ordinary men through the experiences of Farrell's anti-hero, a compassionate man who despises the self-serving patriotic nonsense peddled by his superiors, and who refuses to compromise his own ideals, despite the sometimes painful repercussions of his disobedience. Though backed by a major studio, TIGERLAND has the look and feel of a low-budget indie production, using hand-held camera-work and grainy film-stock for documentary effect, and this uncompromising 'Dogme'-like approach allows Schumacher to focus his attention on the characters and their situation rather than the pyrotechnics which usually dominate such movies. Farrell may be the star of the show, but he's matched by debut actor Matthew Davis (BLOODRAYNE) as his closest friend and fellow combatant, an aspiring writer who volunteered for duty and who favors intellect and reason over Farrell's reckless bravado. Fine supporting cast, excellent technical credits.",
         "War drama that takes place in Louisiana in 1971. It follows a bunch of recruits through basic training and then Tigerland--an accurate portrayal of Vietnam on American soil, before they're shipped over. It focuses on two men--Booz (Colin Farrell) and Paxton (Matthew Davis)...how they meet, become friends and deal with a corwardly squadron leader (Clifton Collins Jr.) and a borderline psycho (Shea Wingham). A surprisingly non-commercial film directed by Joel Schumacher. He uses a hand-held camera throughout most of the movie and uses digital video for the combat scenes. It works very well--the film looks gritty (as it should) and uncomfortably realistic. Farrell successfully covers up his Irish brogue and adopts a pretty convincing Southern accent. His performance is just superb--he's an extremely talented young man. Davis, unfortunately, is not that good. He's tall, muscular, very handsome--and very bland. The rest of the cast however is just great. This film was thrown away by its studio. It had no stars in it, a familar story and was considered \"just another war film\". It only played a week in Boston! It's well worth catching on video or DVD. Also, Farrell and Davis have a lengthy nude scene.",
         "I really like this movie. Bozz is an ultra-cool, not to be intimidated soldier who does not want to go to war. His persona is similar in a way to Yossarian in Catch-22, Joseph Heller's classic novel about men and war. This film, however, is not set in a war zone, but in a pre-war combat prep training. This wonderful film is all about the sickening realization that the Vietnam war was a mistake and those men who were pegged to be sacrificed for a losing cause. Colin Farrell is brilliant as Bozz, a soldier who showed as much genuine love and compassion for his fellow soldier as he did disdain and irreverence for the establishment that was trying to kill him. Bozz is totally cool and non-plussed, testing and tweaking his military superiors, getting their goat at every opportunity. He is a Jesus Christ figure with a psychology degree, \"saving\" his fellow soldiers and showing the ones in genuine need, the way out of this man's army. The acting and action is crisp and believable and as a \"Sleeper\", Tigerland goes down with Apocalypse Now and Full Metal Jacket as one of the top three Vietnam films in my opinion. FIVE STARS, a top pick.",
         "I had an uncle who committed suicide after serving in Vietnam because of mental problems he experienced after coming back. So when I saw part of this movie one night on a pay-for-view channel I was intrigued. I wanted to know what my uncle went through and felt as he got ready for Vietnam. I went out and rented this movie and I have to say it is the most heart-wrenching film I have ever seen. I bought the DVD immediately after renting it. The way it pulls you in so many different directions emotionally is something I've never experienced with any other film. As far as Vietnam subject films go, I think it is the best one, although Platoon runs a close second. Besides all of that, I think it is also Colin Farrell's best performance as an actor. I like him in most of his movies but in this one he was incredible. I gave this a 10 rating because it is one of my top five favorite movies.",
         "TIGERLAND (2000) ***1/2 Colin Farrell, Matthew Davis, Clifton Collins, Jr., Thomas Guiry, Shea Whigham, Russell Richardson, Nick Searcy, Afemo Omilani, James McDonald, Keith Ewell, Arian Ash, Haven Gaston, Cole Hauser. Filmmaker Joel Schumacher makes an audacious attempt to rekindle his directing juices in this low-budget semi-independent film about Vietnam with a cast of unknowns that works remarkably well. Set circa 1971 Louisiana in a special Army training camp for new recruits prior to shipment in the ongoing war and told in flashback by one of the survivors the film centers its bare bones plot around the able shoulders of Irish newcomer Farrell in a potential star-making turn as Private Roland Bozz (think 'One Flew Over the Cuckoo's Nest' in fatigues and you get the overall impression), a feckless troublemaker of his platoon whose antics have a method to his madness: keeping yourself alive despite the odds. Raw and uncompromising are best suited to describe the film's gist and in particular its focus of Bozz leading his comrades in arms through their hellish grunt duty prior to their fated dooms. Original and smartly written by Ross Klaven and Michael McGruther giving their characters a fresh spin on an all too familiar genre with humanity at its core.",
         "American military authority is the enemy for Pvt. Roland Bozz (Colin Farrell), a nonconformist trainee who, along with other infantry trainees, endures brutal, sadistic treatment in preparation for combat in Vietnam. Tigerland is a swampy, steamy camp near Fort Polk, Louisiana that is supposed to simulate conditions in Vietnam. The story is set in 1971. The amount and severity of physical and verbal aggression displayed in this film may be a tad overstated. But the point the film is making is that many, if not most, of the young guys drafted into the army in the late 60s and early 70s absolutely did not want, or deserve, to be there. Roland Bozz is one of those young men. He's angry at the war, angry at the army. The army won't release him because they know that's what he wants. If Bozz can't get himself out, the next best thing is to try and get other recruits out. That will be his revenge, his way to fight the system. A fellow trainee shares his background with Bozz, who then tells the trainee: \"I know army regulations the way prisoners know the law. You're a hardship discharge, man, if ever I saw one. Okay. I'll get you out of the army\". Bravo for Roland Bozz, a young rebel with a mission, a cause, trapped like the others by an oppressive, controlling institution. Acting is very, very good. Colin Farrell is terrific, at a time when he, and the rest of the cast, was largely unknown. No need for overpaid A-list actors. The film's acting style trends naturalistic, spontaneous, and emotionally intense. None of the acting seems forced. With a hand-held camera, combined with grainy film stock, and using quick zooms and unexpected cuts, the cinematography and editing convey a documentary look and feel, which results in sequences that are quite realistic. Lighting is mostly natural. Sets are plain and unadorned. Background music is minimal. Much better than I ever expected, \"Tigerland\" is a well-made film with an intense, anti-war theme. It's about putting others ahead of one's own selfish interest. That Hollywood largely shunned this low-budget film is all the more reason to see it.",
         "TIGERLAND / (2000) ***1/2 (out of four) By Blake French: Throughout the years audiences have seen and understood war films with every point of view possible, and somehow producers and writers always come up with new and innovative methods of portraying various soldiers on the battlefield. Joel Schumacher (\"8MM,\" \"A Time to Kill\"), easily one of the riskiest directors currently working, has found resemblance with \"The Thin Red Line\" in the way his new drama \"Tigerland\" steps in an individual soldier's shoes. This movie, written by Ross Klavan and Michael McGuther, has more guts and irony than \"The Thin Red Line\" or even \"Saving Private Ryan.\" Although the movie's dramatic impact is somewhat lessened due to the perversity of the material present, it certainly enlightens us on a new perspective of young men training for war. I would want to know Joel Schumacher's experiences with the army. Are the men really this unabashed and brutal? I am sure some of them are, but the movie views its uncompromising world through the eyes of a young man named Roland Bozz (Colin Farrell), who is rebellious against the ideas of war. His personality instantly counteracts with several other characters, one who becomes his best friend, Paxton (Matthew Davis), and another, Wilson (Russell Richardson), whose flamed temper often exasperates Bozz's tension with the idea of going to war. The war depicted in this production is not found on a battlefield, but on training grounds of a Louisiana-based instruction camp between conceptions and fears of the soldiers in training. This film is specifically about the preparation for war, nothing more nothing less. It ends when the soldiers finally go to war, kind of disappointing since witnessing the characters in action would have served as a supurb payoff. Shot on location in about 28 days using 16mm stock and a minuscule budget, Joel Schumacher accurately displays a gritty, perverse, cruel, and unmerciful atmosphere using hand-held cinematography, unique lighting techniques and direct sound. Schumacher's grainy and blown-out images make the movie feel like a documentary feature. This unusual style of filmmaking only contributes to the hard core realism of the movie, quite graphic in its use of coarse language, perhaps a little too disturbing. Waves of four-letter words pound the audience, some in shock of what they are hearing. Even the extreme amount of vulgarism does not keep the dialogue from prevailing as heartbreaking, true, and emotional. If anything, \"Tigerland\" provides us with a minor appreciation of how much our soldiers go through for our country in the beginning stages of combat. Such bravery must it take to enlist in the army during times of war, knowing the hardships and risks that are being taken. Such thought-provoking ideas are made possible through the heartbreaking performances by the young aspiring actors who portray the various trainees. This movie is not for all audiences, but one that young men should take a look at before enlisting themselves in the army...and adult audiences should watch to appreciate the courage needed to do such."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Haft Entertainment",
         "New Regency Pictures",
         "KirchMedia"
      ],
      "summaries": [
         "In September 1971, a platoon of recruits arrives in Ft. Polk, LA, for infantry training before leaving for war. The final week takes place in Tigerland, a swamp similar to Vietnam. Jim Paxton has enlisted; he wants to experience everything and write books later. He befriends Roland Bozz, a cool Texan with a gift for getting into trouble and for helping misfits get discharges. At least one sociopath in the platoon hates Bozz, even as the sergeants grudgingly recognize his leadership abilities. As the platoon heads into its week in Tigerland, Paxton's body gives out, Bozz makes plans to go AWOL, and the sociopath gets hold of live ammo. Is the Louisiana swamp more dangerous than the DMZ?",
         "A group of recruits go through Advanced Infantry Training at Fort Polk, Louisiana's infamous Tigerland, last stop before Vietnam for tens of thousands of young men in 1971."
      ],
      "budget": 10000000
   },
   "movielensId": 3950,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-09-22",
      "dvdReleaseDate": "2001-04-17",
      "directors": ["Joel Schumacher"],
      "runtime": 101,
      "movieId": 3950,
      "title": "Tigerland",
      "mpaa": "R",
      "actors": [
         "Colin Farrell",
         "Matthew Davis",
         "Clifton Collins Jr",
         "Tom Guiry",
         "Shea Whigham",
         "James MacDonald",
         "Michael Shannon"
      ],
      "imdbMovieId": "0170691",
      "originalTitle": "Tigerland",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["LABt1rwmIgg"],
      "plotSummary": "A group of recruits go through Advanced Infantry Training at Fort Polk, Louisiana's infamous Tigerland, last stop before Vietnam for tens of thousands of young men in 1971",
      "tmdbMovieId": 10687,
      "avgRating": 3.53015,
      "releaseYear": "2000",
      "numRatings": 1443,
      "posterPath": "/yyW54WcjMFX4NTRy1NnKIeaWhLS.jpg"
   }
}