{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prank",
            "id": 9864
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "bank robbery",
            "id": 15363
         }
      ],
      "imdb_id": "tt0113014",
      "video": false,
      "title": "Fall Time",
      "recommendations": [
         230358,
         59199,
         20263
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Officer Lyle",
               "gender": 0,
               "credit_id": "52fe45adc3a368484e068aaf",
               "name": "Steve Alden",
               "profile_path": null,
               "id": 240086,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe45adc3a368484e068ab3",
               "name": "David Arquette",
               "profile_path": "/p5l4pnL9xhbHiKSipcdsCekoD52.jpg",
               "id": 15234,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "Leon",
               "gender": 2,
               "credit_id": "52fe45adc3a368484e068ab7",
               "name": "Stephen Baldwin",
               "profile_path": "/w2nZjBsEsjboQDZJXEkysuGgue4.jpg",
               "id": 9045,
               "order": 2
            },
            {
               "cast_id": 1003,
               "character": "Florence",
               "gender": 2,
               "credit_id": "52fe45adc3a368484e068abb",
               "name": "Mickey Rourke",
               "profile_path": "/AvGzQ8fvjurGmZW3W1wlQ5WfSeT.jpg",
               "id": 2295,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "Patty / Carol",
               "gender": 1,
               "credit_id": "52fe45adc3a368484e068abf",
               "name": "Sheryl Lee",
               "profile_path": "/zgGpEcAywZu1tx5OVj5I6j7PpxW.jpg",
               "id": 6726,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45adc3a368484e068ac5",
               "name": "Paul Warner",
               "profile_path": null,
               "id": 1142481,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45adc3a368484e068acb",
               "name": "Steve Alden",
               "profile_path": null,
               "id": 240086,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45adc3a368484e068ad1",
               "name": "Paul Skemp",
               "profile_path": null,
               "id": 1207062,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.229088,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28732,
      "vote_count": 8,
      "budget": 0,
      "overview": "Three young men decide to plan a mock kidnapping, but everything goes wrong because a real bank robbery was already planned by two other guys.",
      "similar": [
         3134,
         11564,
         8810,
         281,
         507,
         2142,
         22323,
         133805,
         948,
         298312,
         14433,
         483,
         1359,
         101,
         681,
         949,
         12162,
         23483,
         8923,
         769
      ],
      "original_title": "Fall Time",
      "runtime": 88,
      "poster_path": "/zCdFbHgOPgxkVikuPvUKYlakXuf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bates Entertainmant",
            "id": 16835,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Capitol Films",
            "id": 826,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Live Entertainment",
            "id": 285,
            "origin_country": ""
         }
      ],
      "release_date": "1995-05-13",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Wrong People, Wrong Place, Wrong Time.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Paul Warner"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Steve Alden",
         "Paul Skemp"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113014/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjc0NzQwMzYyOF5BMl5BanBnXkFtZTcwMjQ5NjIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Alden, David Arquette, Stephen Baldwin | See full cast and crew »"],
      "reviews": [
         "Rebellious post-high school buddies Tim (Jason London), Dave (David Arquette), and Joe (Jonah Blechman) are in the middle of their last summer together. Tim is off to college in the fall, and wherever the other two wind up, it will not be in the same place he will be. So the three of them, the bored threesome decide to pull of their most elaborate prank of all time. The plan is simple. Tim, all decked out in a nice suit that makes him slightly more than conspicuous in a small town like Caledonia, Wisconsin, will stand on a street corner near the bank, while the other two pull up fast in their black Buick (stolen from Dave's cruel father) and pretend, with blanks, to gun him down in the street, toss him into the trunk and speed away. After this reports about the Buick will be all over the news, and Dave's father will have a heavy dose of explaining to do. But while they plan the lark, ex-cons Florence (Mickey Rourke), and Leon (Stephen Baldwin) are planning to rob the very same bank. When the boys mistakenly abduct Leon (who is dressed in a suit similar to Tim's), and in effect, foil the crime, the stronger Florence immediately hunts down the suspicious Tim, and strong-arms him into assisting in the heist without Leon. Leon, meanwhile, once out of the trunk, easily detains Dave and Joe, and begins a paranoid investigation of their true motives before forcing Dave to reel off a conspiracy tale about himself and Florence, exactly what the very edgy Leon wants to hear. Leon, who is shown through his homosexual relationship with Florence (which began while the two served time) as being subservient and pliant, explodes when given the opportunity to call the shots for the two young boys, and becomes unhinged to the tune of torturous interrogation scenes that are almost too emotionally painful to watch. What follows is a violent, icy depiction of loss of innocence in the Eisenhower America, which ends the only way it can, with bodies on the floor. Though the film, made in 1995, was denied a theatrical release by co-stars bickering over billing, director Paul Warner spins a tightly wound tale of a adolescent joy-ride that goes awfully wrong. And perhaps the most interesting spin on the script is the parallel between the subservient relationship of Leon to Florence to the hero-worship Joe holds for Dave, and even paralleling Leon's treatment of the boys with the relationship of Dave to his father. This amounts to a perverse little twist of script that Freudians would love, where the two criminals do serve to provide a sort of perverse fathering of the children. The young cast is outstanding, exuding the requisite disbelief and innocence we expect from these boys. A particular standout is Arquette, who I previously did not feel could act his way out of a paper bag. Mickey Rourke is absolutely chilling as Florence, and Baldwin gives perhaps even a better performance than he did in The Usual Suspects, an absolutely brilliant turn as the explosive Leon. In all, Fall Time is a very good movie that snuck through the cracks, and is well worth a look if you can find a copy.",
         "This is the kind of movie which makes you wondering all the time how the madness created by coincidences will end, which is also the strength of the movie; it doesn't get bored. Fall time fits in the new type of genre that is introduced in the 90's: 'nouvelle violence'. The character of these movies are formed by the excessive use of hard violence, mostly in the crime circuit. As you'll probably know, the leading man in this genre is Quentin Tarantino, with movies like reservoir dogs and true romance (movies who look a bit like fall time). The role of Mickey Rourke is almost made for him, and also Baldwin gives honor to his name. It surprised me a bit that so few people voted for this movie, hence I would suggest that if you don't mind hard violence and you like a surprising end, go rent this movie, it won't let you down.",
         "My goodness. I thought for a moment there that these five guys were going to take off their clothes and have a orgy. The Plot Summary in the IMDB database said there were some homosexual overtones in this movie. I really don't think they were overtones. They were out loud thrown in your face, and you just had to smile to yourself. The three younger boys, with their grab ass and pulling down underwear and slow dancing and coming within a half an inch from each other mouths putting on each others ties in their little \"Fort\", which is what David called it. It seemed more to me that this was their little secret hideaway. Now as far as the two ex-cons, the very cute Steve Baldwin and the ever beautiful Mickey Rourke. These guys just made you feel like you were about to spill your beans. It was so obvious that these two had to be lovers. With all of the \"You know I love you\" and the hand holding and mouths coming only inches away from each other, and the feeling each others bodies, I was just waiting for them to take off their clothes in the middle of the road and do it on the cement. This is how powerful the \"Homosexual Overtones\" came off. One thing that really kind of p***ed me off about this movie, is this jerk water town were everything was supposed to take place. These people in this town were just lockjawwed morons. I mean one example was when this guy with a Johnny Suede/Elvis Presley haircut, ran to call the police when he thought something was going to go down at the bank. He runs to the pay phone in this town, I don't remember the exact name, something like Colidine, anyway he calls the operator and ask, \"Give me the Colidine Sheriffs Department\". I mean duh, this guy lives in Colidine, why in the world did he not just ask for the \"Sheriffs Office\", or even dialed the number himself. It's not like when he dialed \"0\" he got the International Operator in Istanbul, I mean come on. All in all with all of the stupid town people, including the Sheriff himself, it had a pretty good story line. Rent it on a weekend, something to smile and think about.",
         "Fall Time is an incredibly absurd crime drama that fails on most levels. David Arquette, Jason London, and Jonah Blechman star as three teenage lads who decide to play a prank on the grownups in their boring 1950s backwoods town. Normal, run of the mill teens would TP town hall, put itching powder in the school principal's undergarments, or short sheet each others beds. These bright sparks decide to stage a phony assassination outside the local bank, where, just by chance, two real cons (Mickey Rourke, who phones in his performance, and Stephen Baldwin) are about to hold up the joint. The prank and the robbery go the way of a Reese's Peanut Butter Cup (\"you got your practical joke in my two-bit heist!\" \"No, you got your two-bit heist in my practical joke!\") and mayhem, torture, gunplay, and a homo-erotic subplot take us the rest of the way. Though someone clearly spent a lot of time making sure the period details were right, someone else--presumably screenwriters Steve Alden and Paul Skemp-- larded their absurd story with too many handy dandy coinkidinks. The film also suffers from a portentous score from composer Hummie Mann, which elevates the final scene--involving a fresh baked pie from good ol' Mom--to the overdone levels of a Richard Harris and Jimmy Webb collaboration. Fall Time also features the world's least believable sex scene (involving Sheryl Lee). This is one of those American indies that thinks it's being deep, but merely buries itself in pretentious tomfoolery.",
         "All right I've read the other comments and feel I'm one of those who had a hard time with this movie. Director, Paul Warner, brings three young boys together with a chance meeting with two not so young men. It's all about a prank gone wrong and the aftermath of the game. Mickey Rourke, who always seems to get these weird roles of emotionally disturbed people, once again, talks in whispers. He also manipulates others, as he's done in past films. In other words, there doesn't seem to be any change in his style. However, Stephen Baldwin, his victim, gets a chance to show more than his usual tough guy image, with a sensitive performance. Is he gay? It's never made clear, but through Baldwin's performance you would assume he is. This is why he becomes weak in the knees when Rourke commands him. Of the three young boys, Jason London got more to do with his part. The other two, David Arquette and Jonah Blechman, were somewhat less convincing. The girl, Sheryl Lee, didn't impress me. Except when she began to undress London. I thought finally something is about to happen. But unfortunately it didn't. The violence, blood and bruises were abundant throughout this movie. As though this was what audiences would be impressed with. When you have as much as this film presented, after awhile it becomes boring. The mother baking the pie, without words, was all camp. Was she for real? Placing the cherry on top of the pie and tripping as she was carrying a birthday cake, were among my favorite moments. And Baldwin's acting. 6 out of 10 is my vote, in favor of Baldwin, London and Arquette.",
         "Ambitious in its use of Gay leads (no overtones here, completely in your face), period setting, and crazy goings on. The Movie starts sort of weak with overacting by the three teenagers wildly flailing about and trash talking incessantly. But once our two ferry-land psychos enter, the thing sort of becomes entertaining in a low rent hoodlum kind of way. Although it goes to some length to be 1950's kitsch some of the props look like modern thrift shop and antique store borrowings as they are worn out and do distract somewhat from believability. But that is a minor quibble because things do perk up and turn into some fun. The convoluted plot and some of the explanations of some of the behavior develop confusion, it is the violence and the Gay behavior of the characters that bring this home with a different feel and is a near winner despite some of its missteps. This is one of Stephen Baldwin's best performances and Mickey Rourke is, well the always interesting Mickey Rourke.",
         "***SPOILERS*** ***SPOILERS*** Someone wrote on his comment before that the movie is homo-erotic. It totally is, and I absolutely loved it. We need more movies like this. There's a huge demand for this sort of thing. Females enjoy a bit of male action just as much as guys like lesbians. Too bad they only make a film like this once in a decade. Damn. Mickey Rourke is brilliant and unbelievably sexy, and who could resist those blue eyes of Stephen's? ;) I was blown away by the great acting of these gentlemen but the plot wasn't very credible, although it didn't matter much. But why did Florence tell Leon that the third man was dead and left at the bank in the end when he could have walked in the door any second? And why did Florence have to kill Leon? And what the hell was Patty up to in the end? Anyway, good flick. Highly recommendable.",
         "I didn't know what to think at first because there were so many nutty things going on in this juicy little film. Yea, now that I read some of the other reviews, the homoerotic thing fits. I wondered if I was imagining things, or what. All the touching, close contact,. . . is he going to kiss him?! Mickey Rourke was amazing! And he had the best lines many of which were sheer poetry/philosophy/Rourke. I was sure he wrote the script, but no. Baldwin was also in excellent form. Actually they all were. Sheryl Lee was a riot having fun with the role -almost too much fun, as the clever \"girl who got away.\" See the film!!! Oh, and the Mom who was always baking pies -too funny. Not a word from her, but she stole the scenes from the ranting Dad.",
         "So extraordinarily bad on so many levels. It made no sense at any juncture. Characters never did one thing a normal person would do. The script doesn't explain anything. It actually made me hurt in my stomach. Didn't one single person who had a level of power over this film look at it and say it is incomprehensible? Didn't anyone like the producer think it might be a good idea to let a small group of people see it just to make sure it made sense? I needed extra lines to make this review long enough so I'm sticking them here. This film doesn't deserve any more discussion. It deserves to buried in an active volcano. Is this enough lines for this baby to get published? How about now? One thing you will learn from this film: Steven Baldwin is actually a functioning mongoloid.",
         "Three life-long pals stage a gag at a bank and run into some criminals planning to rob the bank. The criminal boss is Rourke a creepy psychopath exploiting his gunsel, Baldwin, the piteously warped product of a prison upbringing. The pals have Arquette as their ring leader, who's escaping the rage and numbness his parents model. To Jason London these guys are brothers, his surrogate family. Blechman, the lowly little guy, hero worships Arquette, who in his crazy way is his mentor. (If these guys seem gay to you, get well so maybe you can have a friend someday.) The two gangs get mixed up and separated at the bank, then Rourke makes a bad situation desperate and, for Baldwin, tragic. When Sheryl Lee shows up the power balance goes seismic in the best noir style. Rourke controls with intimidating innuendo that shocks by turning the tables on us and our usual voyeuristic experience of some cliché villain leering while he cuts a bra away. To say you'll be the one who feels discomfort doesn't begin to describe the debasement and violation he exerts with his cold games. (Those who find these any kind of erotic need to get well also.) The acting, direction, and writing go beyond the now familiar story of a botched bank heist to explore how the hunger to be with others spares from danger only the least human."
      ],
      "genres": [
         "Drama",
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Bates Entertainmant",
         "Capitol Films",
         "Live Entertainment"
      ],
      "summaries": [
         "Three young men live in the 50s somewhere in America. They've grown up and and now they plan to do a mock robbery of a bank. But in an other place, Florence plans a real bank robbery. The destination is the same...",
         "Surrealistic tale of three teen boys practical joke gone astray as it becomes interwoven into a ex-con and his friend's real crime. There is an undercurrent of repressed gay attraction between and from the ex-cons. Throughout the movie there are several small character parts that are slightly out of kilter giving it additional surrealistic leanings.",
         "Three young men decide to plan a mock kidnapping, but everything goes wrong because a real bank robbery was already planned by two other guys."
      ],
      "budget": 4000000
   },
   "movielensId": 396,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-05-13",
      "dvdReleaseDate": "2001-11-20",
      "directors": ["Paul Warner"],
      "runtime": 88,
      "movieId": 396,
      "title": "Fall Time",
      "mpaa": "",
      "actors": [
         "Steve Alden",
         "David Arquette",
         "Stephen Baldwin",
         "Mickey Rourke",
         "Sheryl Lee"
      ],
      "imdbMovieId": "0113014",
      "originalTitle": "Fall Time",
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Bh_d3EN9LyE"],
      "plotSummary": "Three young men decide to plan a mock kidnapping, but everything goes wrong because a real bank robbery was already planned by two other guys.",
      "tmdbMovieId": 28732,
      "avgRating": 2.51429,
      "releaseYear": "1995",
      "numRatings": 35,
      "posterPath": "/zCdFbHgOPgxkVikuPvUKYlakXuf.jpg"
   }
}