{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "animation filmmaking",
         "id": 217987
      }],
      "imdb_id": "tt0113104",
      "video": false,
      "title": "Frank and Ollie",
      "recommendations": [],
      "backdrop_path": "/dDmNQccstaMRg8Tn4fgQWhy1LaS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "59fceeb7c3a3686853000b3d",
               "name": "Frank Thomas",
               "profile_path": "/gfxSwlnGBikBjneXC3lWnENAQgo.jpg",
               "id": 63646,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "59fceec292514146f5000ac6",
               "name": "Ollie Johnston",
               "profile_path": "/76RFwErmaMm7tx8OHFU0eYCvMMr.jpg",
               "id": 143786,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4624c3a36847f80ef0a5",
            "name": "Theodore Thomas",
            "profile_path": null,
            "id": 129216,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.761466,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42981,
      "vote_count": 5,
      "budget": 0,
      "overview": "Before computer graphics, special effects wizardry, and out-of-this world technology, the magic of animation flowed from the pencils of two of the greatest animators The Walt Disney Company ever produced -- Frank Thomas and Ollie Johnston. Frank and Ollie, the talent behind BAMBI, PINOCCHIO, LADY AND THE TRAMP, THE JUNGLE BOOK, and others, set the standard for such modern-day hits as THE LION KING. It was their creative genius that helped make Disney synonymous with brilliant animation, magnificent music, and emotional storytelling. Take a journey with these extraordinary artists as they share secrets, insights, and the inspiration behind some of the greatest animated movies the world has ever known!",
      "similar": [
         17654,
         51828,
         41630,
         200727,
         10358,
         10096,
         38,
         28468,
         18239,
         35056,
         11322,
         388,
         4233,
         2667,
         254470,
         11216,
         16869,
         639,
         668,
         301337
      ],
      "original_title": "Frank and Ollie",
      "runtime": 89,
      "poster_path": "/rHt6UxKhtW1LhV0lscbG0XbIAtJ.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Theodore Thomas Productions",
            "id": 90509,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-10-20",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Theodore Thomas"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Theodore Thomas"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113104/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MTAzNTc1M15BMl5BanBnXkFtZTcwNjQyNTQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Frank Thomas, Ollie Johnston, Sylvia Roemer | See full cast and crew »"],
      "reviews": [
         "The problem with documentaries is that, short of \"The Sorrow and the Pity\" and \"Nanook of the North,\" most of them are only interesting if you have a fascination with the subject. Me, I'm into dinosaurs, flight, and movies. But I guess most of all I'm interested in animation, so \"Frank and Ollie\" is right up my alley, even though it could be argued that a movie like this (written, directed, and produced by Frank Thomas' son, Theodore) isn't really important or in any way art. First of all, this isn't really a Disney picture, despite the fact that Disney released it--there is not the same tone of self-congratulatory propaganda (i.e. Disney is Great/Remember the Magic) that Disney-done documentaries such as the Making of Fantasia featurette from the Fantasia DVD (in which, other than the descriptions of the techniques, the only interesting thing actually said is that Leonard Maltin used to watch the Rite of Spring section in Science class) tend to have. This is evident in the first few minutes of the movie, when various nude drawings the animators drew in college are shown. This is as much a documentary on the two animators (as mundane as some of their details may be) as it is about Disney. One of the most interesting things revealed by Frank and Ollie is how all the animators used to draw caricatures of each other to get their creative juices flowing (and to blow off steam). Again, a movie like this is only interesting if you enjoy the subject. I don't like basketball, so I don't care for Hoop Dreams. But if you enjoy animation of any sort, \"Frank and Ollie\" might just suit you fine, too. 9/10.",
         "\"Their friendship changed the face of animation.\" What is interesting is that these two were planning on anything but becoming animators much less becoming innovators in the profession. They met at Stanford as college students and took road trips to a distant college to do nudes because Stanford would not allow \"such behavior\" in their art department (imagine that today). Somewhere during these trips a lasting friendship was built between them. The \"painted for dinner and played piano for beer\" along the way on these trips and seem to have made many friends in the places they frequented as well. Their lack of fear, presence of love and capacity to laugh at themselves opened one door after another. I was amused time and again to see them model the characters they created. It was also quite interesting to see how they climbed inside of their characters and brought them to life. It was apparent to me that they enjoyed what they were doing and in-so-doing were blessed to be eternally youthful. I am hard pressed to think of another friendship that would allow two human beings to share so much without petty jealousy getting in the way. Their wives were incredibly understanding about the childlike ways and seemed to understand what a blessing their husbands were, not only to their family, but to the world in general. There is not a country on the face of this earth that has not seen one of their characters, I would suppose. I would also gather that they have touched many millions of young hearts over the years. A young heart, by the way, need not be in a young body. That was apparent in this film as well. I will never see Disneyland the same, because behind each of the characters that I see, I will imagine the facial expressions of these two men. I will remember that one got his best ideas while shaving and developed the ideas while walking on a worn path in his front yard. They did talk about artistic frustration brought on by the fact that they were so involved and connected to what they do. It was also interesting to note that their release from tension was also artistically motivated and expressed through music and model railroading. I thoroughly enjoyed this viewing and will never forget the wisdom chiseled into the faces and depth sparkling from the eyes of these two wonderful human beings.",
         "This was the documentary on Oliver Johnston and Franklin Thomas, the two men responsible for what Walt Disney is remembered today- Character Animation. In this film we find out how these two men became friends and how through that friendship raised character animation to the standard it is done today in the movies. The good-The documentary goes through the duo's history. It shows some of the classical figure drawings as well as rough pencil drawings of famous Disney characters-Bambi and Pinnocchio included. The bad-John Culhane,what a bloated, pompous asshole. I love the work that Frank ad Ollie did in the Disney movies but the way this guys interpreted it was almost to a Godlike degree. I cant stand this guy on film. Supposedly Milt Kahl, one of Disneys best animators, designed the character of Mr.snoops in The Rescuers with this windbag in mind. Rent this film to se who is actually responsible for Uncle Walt's fame-and I don't mean Mickey Mouse. Then afterwards, read The Illusion of Life. The quintissential book on Disney Animation written by the same to men who the documentary is based on.",
         "'Frank and Ollie' is the touching story of Frank Thomas and Ollie Johnston, two of the original Disney animators. Lifelong friends and collaborators they tell the story of how their beginnings at Disney animation and the classic films they worked on together. Using archival footage, interviews with Frank and Ollie's respective wives and current Disney animators, the film brings to life the rich picture of the unique and enduring friendship of these talented animators.",
         "Done by 1 of Frank's sons. This film is a must for Disney fans. Very interesting. We learn about the last of the Nine Old Men of Animation Sad they are all gone now Frank passed away in 2004, Ollie in 2008. I thought a personal note of interest to me. Frank lived for a time in my home town when he was young. This city is nothing to brag about. Besides learning about them you of course get behind the scenes Disney facts from the early days. You see Ollie & his personal train. Just like Walt had at his home. They lived right next door to each other. We Disney fans sure do miss them."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Theodore Thomas Productions",
         "Walt Disney Pictures"
      ],
      "summaries": ["A documentary about two famed Disney animators, Frank and Ollie."],
      "budget": 0
   },
   "movielensId": 398,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-10-20",
      "dvdReleaseDate": "2003-11-18",
      "directors": ["Theodore Thomas"],
      "runtime": 89,
      "movieId": 398,
      "title": "Frank and Ollie",
      "mpaa": "PG",
      "actors": [
         "Frank Thomas",
         "Ollie Johnston"
      ],
      "imdbMovieId": "0113104",
      "originalTitle": "Frank and Ollie",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Before computer graphics, special effects wizardry, and out-of-this world technology, the magic of animation flowed from the pencils of two of the greatest animators The Walt Disney Company ever produced -- Frank Thomas and Ollie Johnston. Frank and Ollie, the talent behind BAMBI, PINOCCHIO, LADY AND THE TRAMP, THE JUNGLE BOOK, and others, set the standard for such modern-day hits as THE LION KING. It was their creative genius that helped make Disney synonymous with brilliant animation, magnificent music, and emotional storytelling. Take a journey with these extraordinary artists as they share secrets, insights, and the inspiration behind some of the greatest animated movies the world has ever known!",
      "tmdbMovieId": 42981,
      "avgRating": 3.37069,
      "releaseYear": "1995",
      "numRatings": 58,
      "posterPath": "/rHt6UxKhtW1LhV0lscbG0XbIAtJ.jpg"
   }
}