{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "south africa",
         "id": 3644
      }],
      "imdb_id": "tt0112749",
      "video": false,
      "title": "Cry, the Beloved Country",
      "recommendations": [
         18713,
         48918,
         41386,
         59930,
         49803,
         92968,
         157919,
         49427,
         52856,
         54989,
         26408,
         50875,
         59995,
         29530,
         41714,
         56441,
         18856,
         42570,
         28742,
         92965
      ],
      "backdrop_path": "/v8QIF0xj5xp0D3P1gMaVi7lFYPD.jpg",
      "revenue": 676525,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Rev. Stephen Kumalo",
               "gender": 2,
               "credit_id": "52fe456f9251416c91032385",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "John Kumalo",
               "gender": 2,
               "credit_id": "52fe456f9251416c91032389",
               "name": "Charles S. Dutton",
               "profile_path": "/ajXBoMz8xGgDDcn8xpRi8LmXKKa.jpg",
               "id": 17764,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Ian Jarvis",
               "gender": 0,
               "credit_id": "52fe456f9251416c9103238d",
               "name": "Jack Robinson",
               "profile_path": null,
               "id": 123831,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Child",
               "gender": 0,
               "credit_id": "52fe456f9251416c91032391",
               "name": "Tsholofelo Wechoemang",
               "profile_path": null,
               "id": 123833,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Ramalao Makhene",
               "gender": 0,
               "credit_id": "52fe456f9251416c91032395",
               "name": "Ramalao Makhene",
               "profile_path": null,
               "id": 123834,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "James Jarvis",
               "gender": 2,
               "credit_id": "52fe456f9251416c91032399",
               "name": "Richard Harris",
               "profile_path": "/64jkJJtL5sins6nwGKOERduLSEA.jpg",
               "id": 194,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Mrs. Kumalo",
               "gender": 0,
               "credit_id": "52fe456f9251416c9103239d",
               "name": "Dolly Rathebe",
               "profile_path": null,
               "id": 89307,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Mary Jarvis",
               "gender": 1,
               "credit_id": "52fe456f9251416c910323a1",
               "name": "Jennifer Steyn",
               "profile_path": "/qFwxa6FTMmRayqwOv459UejbMFH.jpg",
               "id": 111179,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Evans",
               "gender": 0,
               "credit_id": "52fe456f9251416c910323a5",
               "name": "Ian Roberts",
               "profile_path": "/HiVItNtPii0NreWhBN5F7fDNkL.jpg",
               "id": 1035098,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Clerk of the court",
               "gender": 0,
               "credit_id": "5464d1610e0a26294a002110",
               "name": "David Clatworthy",
               "profile_path": "/sYy5IKaWGDlsEm8uiABzIxRlnAr.jpg",
               "id": 1073473,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe456f9251416c91032375",
               "name": "Darrell James Roodt",
               "profile_path": null,
               "id": 16730,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe456f9251416c9103237b",
               "name": "Ronald Harwood",
               "profile_path": "/kFxKyfaXcaWd4E0tOm0B1FLYnBC.jpg",
               "id": 3558,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe456f9251416c91032381",
               "name": "Alan Paton",
               "profile_path": null,
               "id": 123828,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5909ca459251411cf300d245",
               "name": "Joshua Sinclair",
               "profile_path": "/o43987ZpGESRszlIbcbxzrYA29s.jpg",
               "id": 3774,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.37427,
      "production_countries": [{
         "iso_3166_1": "ZA",
         "name": "South Africa"
      }],
      "id": 34615,
      "vote_count": 13,
      "budget": 0,
      "overview": "A South-African preacher goes to search for his wayward son who has committed a crime in the big city.",
      "similar": [
         22954,
         192136,
         17654,
         10637,
         28468,
         783,
         59961,
         50124,
         27066,
         470114,
         20415,
         12506,
         14433,
         14211,
         1874,
         868,
         74997,
         60011,
         15102,
         84334
      ],
      "original_title": "Cry, the Beloved Country",
      "runtime": 106,
      "poster_path": "/ymA7HQqRiyo1xrnFFv1ZrwNpwlb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Miramax",
            "id": 53009,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alpine Pty Limited",
            "id": 89840,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Distant Horizon",
            "id": 85681,
            "origin_country": ""
         }
      ],
      "release_date": "1995-12-15",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Africa",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Darrell Roodt"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Ronald Harwood",
         "Alan Paton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112749/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwMDU1OTEwOF5BMl5BanBnXkFtZTcwMTg5NjEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Harris, James Earl Jones, Vusi Kunene | See full cast and crew »"],
      "reviews": [
         "I could not believe as I read other reviewers of this movie that they thought it \"irrelevant\"! The struggle for equality, peace and love is NEVER irrelevant. This was a movie that by any standards is brillant and moving. James Earl Jones does a magnificent job of playing the main character with dignity and restraint. He makes you suffer with him as a result. A drama coach I once had told me, don't you cry, let them cry. He does both through his amazing minimalist acting. He doesn't waste himself on meaningless gestures & histronics, he lets you see the suffering of his soul. Equally brillant is Richard Harris as the father of the son killed by Jones' son. These two men are brought together in the worst of circumstances and that is when the true character of the man is revealed. Despite all his racist comments earlier in the movie, he overcomes his own self-hate (translated to Africans) to see the bigger picture that his own son knew all along. Someone once said, you cannot hate anything in someone else, unless it reflects something you hate within yourself. Through the pain & death of his son, he transcends his own sense of self-loathing. He sees with the eyes of love that people are just people, no matter what color their skin is. A movie that communicates that is never irrelevant or unimportant.",
         "Rev Kumalo receives a letter from Johannesburg telling him that his sister, who went there many years ago to look for her husband, is very sick and that he should come immediately. When he arrives he is robbed but finds a home with the sender of the letter. His sister is working as a prostitute in a brothel in town and his quest to help her soon turns to finding his brother and then his own son. However events will bring the nature of the racial divide into full focus. It has been many years since I read the book but I always remember it as it was quite thought provoking \u0096 bringing in wider issues into the framework of the main story. I was surprised to find this version made by Disney and was prepared for almost a child's film, happily I was wrong. The plot is quite well developed in terms of the central story and, although I wasn't moved to the point of tears, I did find it pretty involving and moving to some degree. What it failed to do though was bring out wider issues from the period and setting. True it let us see the places and the divide but there was no subtext \u0096 only visual images. The direction is good \u0096 whether it is the outdoors, a rain swept church or a small indoors room, it all has a good sense of place and time. The cast is all pretty good. Jones is the strongest and acts as the moral backbone of the story \u0096 he is seeing these things for the first time just like we are as an audience. The late Richard Harris is also good but has less screen time. I think his character needed more as it is he who has the biggest journey of discovery \u0096 where Kumalo's is physical, his is more into himself and learning to overcome his feelings. The South African cast are mainly very good and give good support \u0096 the only real flaw was that I wasn't totally convinced that Kumalo's relatives were really his relatives \u0096 only Dutton managed to bring out an emotional history and have a sort of bond with Jones, the rest were a little too distant. Overall this is a good version of the book albeit with the focus more on the core narrative than other themes. The leads are good and it is an involving story. Not fantastic but a good drama about one man's strength.",
         "What makes this film so good, is that it deals with the issues of Apartheid in a sensitive, and moving way. There is no overt message of hatred, but shows rather how lives both black and white are affected by division and hatred. The words of Jarvis's dead son are incredibly powerful, significant, even to this day. I grew up in Natal, and lived in Johannesburg, and experienced the evils of Apartheid. Yes, the film is in a way too soft in this regard, but this is not what the film is about. James Earl Jones's depiction of an African Cleric in this time period is amazingly accurate. I had tears in my eyes watching his performance. Harris too shines. This is a movie for today, and is as relevant now, as it was 50 years ago. Must see viewing.",
         "As a Student taking my English proficiency exams I was obliged to read the novel by Alan Paton. As an African born every title related to this land appeals to me. The film is a good translation of the book, nevertheless I liked the book more than the film. James Earl Jones was a good choice to play Rev. Stephen Kumalo an in the whole it matched my imagery of the novel and the apartheid policy in South Africa. The center of the drama is very well transcript to the screen:The holy black man´s son who kills the mighty white man´s son,in the sinful city far away from the origins in the peacefull countryside where the black people, however already threatened by the apartheid brought from the urban centers, are still respected and free to have their ownn choices and ideals.",
         "I've seen this movie twice and I absolutely love it! I think it's highly underrated with the average of 6.4 from the imdb voters. This is a movie about black and white. A welknown theme in Hollywood, but I've never seen a movie which deals with this subject so excellent as this one. I couldn't help crying at the end. my rate: 10",
         "This is a wonderful movie, based on the famous book. It features excellent camera work, which took full advantage of the beautiful scenery in the South African countryside. It also features an exceptional score by John Barry. In addition, the performances were quite good, although I've heard some people say they thought that James Earl Jones made Rev Kumalo too \"soft around the edges\". In any case, this is a quite good movie.",
         "i thoroughly enjoyed this movie, and am using it as the basis for my human geography paper on Class issues of the 'new' south Africa. i am south African but live in new Zealand now as a result of apartheid. James Earl Jones is amazing as rev Khumalo, very believable how a man so strong can at times look so powerless in this role of a father who can do nothing. I also enjoyed the portrayal of Jarvis, fantastic acting. I was surprised that most of the movie was shot in Cape Town, although i might be mistaken as the video that i watched was poor quality. Amazing to compare something set in 1946 and to realize that not much has changed, REALLY, but that , even then there were opportunities to break the barrier that humans created. Loved the movie,",
         "Emily, a senior, is reading the book as an assignment for her English class. We watched to movie on VHS, as part of her getting extra credit. She hadn't finished the book yet, but commented that much of the movie was directly out of the book, so I suspect overall it is faithful to its source. James Earl Jones is Rev Stephen Kumalo, living in the country, and goes to Johannesburg to find his son and a young woman. Much of the first half of the movie can be bordering on boring as the characters are established. Richard Harris is wealthy white James Jarvis, who also lives in the country near Kumalo. They have seen each other, but do not actually know each other. Jarvis also has a son, who is in Johannesburg, and works with the poor, even the poor blacks, in a life that the elder Jarvis doesn't quite understand. He still subscribes to the idea that \"they have their place and we have ours\", apartheid. The movie is competently done, with competent acting, but comes across as a simple, no-frills movie. The message is important, but the movie itself is rather bland. SPOILERS. Jarvis's son turns up dead, murdered by three black men who are in his home to rob him. The shooter is Kumalo's son, who confesses, but says he was scared, didn't mean to kill anyone. After a trial the son is found guilty and sentenced to hang. On the day of the hanging, the dad goes up to the mountain to reflect, and Jarvis meets him there. Through this tragedy both men come to appreciate each other, and the need for healing amongst the blacks and whites in S. Africa.",
         "It's been a long time since I read the Alan Paton book upon which this film is based. Paton was banned in his own country and officially silenced but the book was universally popular throughout the 1960s. James Earl Jones once again renders a bravura performance as the African minister whose son has accidentally killed a white man. One can feel his grief and his burden as he tries to straighten the mess out. His son has confessed but others involved have denied knowledge of the offense. Richard Harris plays an equally difficult role that of Mr Jarvis the white boy's father. One feels his grief and pain especially when he finds to his surprise that his son had disowned \"baaskap,\" the over-lordship of the white race, something accepted as a given by most whites without a second thought just as the white housewife perfunctorily dismissed the black cleric in priestly garb as if he were a pesty door to door salesman. Will mercy be extended to the preacher's son who accidentally pulled the trigger and cooperated with authorities or will he suffer the ultimate penalty while accomplices go free? Yet for all the misery the movie, surprisingly without excessive preaching, ends on a flicker of hope for the future.",
         "With this film, I am pleased to say, they (the producers/director/actors) finally got one right: South Africa, caught in the throes of a growing racial divide already had much to atone for. Sooneror later, justice had to prevail. And it did, though much later and at great cost in the innocent lives lost. The film's setting is Natal Province, South Africa during the early apartheid era. Albeit 'the separation of the races' was not officially sanctioned by the state at that time. Still, the prejudice against the blacks was practiced by practically all of the foreign settlers. It didn't matter whether you were of British descent or of Boer blood. The 'pecking order' with whites atop of the ladder had to be maintained. And it was preserved with little or no regard to the loss of human dignity and lives. Richard Harris delivers an outstanding performance as James Jarvis. He's a wealthy white landowner. To his family and peers, Jarvis is more than respected. He's revered. To his workers, especially the African natives he's feared. They all call him 'Baas Man'. That title says it all. On the other side of the racial divide, we encounter Rev. Stephen Kumalo. Make no mistake: James Earl Jones portrayal of the quiet man was so intense yet sensitive it almost moved me to tears. In fact, it did on at least two occasions, maybe more. Although they live in the same remote rural community, the two respective leaders of their 'volk or tribe' rarely if ever have met even in public. Soon, that would change. In Joburg, the largest city and also the commercial hub of the Republic, a gruesome murder has taken place. This random act of violence though unbeknown to either Jarvis or the Reverend Kumalo, will ultimately unite the two disparate men. They both would suffer the loss of a son: Jarvis through murder, and Kumalo through capital punishment. No doubt, nothing short of a cruel fate was necessary to draw both men closer to themselves and eventually each other. Now as a citizen living abroad, after having sojourned in the Republik for many years, I will say I was deeply moved by each man's journey. Save the political message (way too much liberalism) I believe the film first and foremost conveyed a single, laudable tenet: as human beings, we owe it to God to walk in our neighbor's shoes even though we've grown so comfortable in our own, 'private' space. By Jove, this film achieved just that emotive plane. And thank Almighty God too for inspiring Alan Paton's novel of the same title as well. Moreover, I am certain the silver screen adaptation did the author, the beloved country and the characters much righteous justice."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Alpine Pty Limited",
         "Distant Horizons",
         "Miramax"
      ],
      "summaries": [
         "South African church minister Steven Kumalo is summoned from his village to Johannesburg. There he finds that his son Absolom has been jailed in connection with a robbery in which a white man was killed. The father of the white man, James Jarvis, is a supporter of apartheid, the separation of the races which is the law of South Africa. When they encounter each other, both Kumalo and Jarvis come to unexpected realizations not only about their sons, but about the nature of their own humanity.",
         "A South-African preacher goes to search for his wayward son who has committed a crime in the big city."
      ],
      "budget": 0
   },
   "movielensId": 40,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-15",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Darrell James Roodt"],
      "runtime": 106,
      "movieId": 40,
      "title": "Cry, the Beloved Country",
      "mpaa": "PG-13",
      "actors": [
         "James Earl Jones",
         "Charles S. Dutton",
         "Jack Robinson",
         "Tsholofelo Wechoemang",
         "Ramalao Makhene",
         "Richard Harris",
         "Dolly Rathebe",
         "Jennifer Steyn",
         "Ian Roberts",
         "David Clatworthy"
      ],
      "imdbMovieId": "0112749",
      "originalTitle": "Cry, the Beloved Country",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A South-African preacher goes to search for his wayward son who has committed a crime in the big city.",
      "tmdbMovieId": 34615,
      "avgRating": 3.64905,
      "releaseYear": "1995",
      "numRatings": 946,
      "posterPath": "/ymA7HQqRiyo1xrnFFv1ZrwNpwlb.jpg"
   }
}