{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0112889",
      "video": false,
      "title": "Dos Crímenes",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d29c3a36847f8252135",
               "name": "Damián Alcázar",
               "profile_path": "/vzitB2xSqHHHjhiL37Z1gVb2Xzp.jpg",
               "id": 7370,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d29c3a36847f825213d",
               "name": "Pedro Armendáriz Jr.",
               "profile_path": "/vqg8f4FeCKUD7jTVM2gLpElNZuh.jpg",
               "id": 7372,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d29c3a36847f8252141",
               "name": "Dolores Heredia",
               "profile_path": "/iBDhc3pqreLpIoF8pSzcyBOYjt5.jpg",
               "id": 224507,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "55663c5b925141478d00006a",
               "name": "José Carlos Ruiz",
               "profile_path": "/tXcF9IgBFKkIyuhvDYQOpjfydMT.jpg",
               "id": 47885,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4d29c3a36847f8252131",
            "name": "Roberto Sneider",
            "profile_path": null,
            "id": 16401,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.067813,
      "production_countries": [],
      "id": 172923,
      "vote_count": 1,
      "budget": 0,
      "overview": "Greed and playing into the hand of providence provides the focus of this Mexican comedy adapted from a novel by Jorge Ibarguengoitia. Marcos, an architect, has just returned to the home of his wealthy uncle Ramon after squandering his money in Mexico City and subsequently finding himself falsely accused of a crime. Although he is flat-broke, he conceals this from Ramon, telling him that he has returned home to buy a local gold mine. Marcos finds the lies come easily as begins trying to induce his uncle to fund his endeavor. Irascible Ramon, who likes Marcos for his similar love of drinking and smoking is duped, but Ramon's sons are not fooled by Marcos. To them he is a threat, and they fear he will be placed in the will. Soon all of them are trying to out-manipulate each other. Even Ramon, who is not as innocent as he appears is involved in the mayhem.",
      "similar": [],
      "original_title": "Dos Crímenes",
      "runtime": null,
      "poster_path": "/1L15fJfWfOUK9Ht15OLLmgW90h8.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-05-26",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roberto Sneider"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Jorge Ibargüengoitia",
         "Roberto Sneider"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0112889/",
      "coverLink": null,
      "actors": ["Stars: Damián Alcázar, José Carlos Ruiz, Pedro Armendáriz Jr. | See full cast and crew »"],
      "reviews": [
         "I expect much from Sneider now he's filming \"Arrancame la vida\". This because \"Two crimes\" (correct translation of the movie's name) was delicious. This novel written by the Mexican Jorge Ibargüengoitia and published in 1979 (or before), is a great dark comedy. Funny and unpredictable, delightful and well acted, the movie presents characters real and familiar to any Mexican. Sneider understands and respect the story, all the twists, the humor, the rhythm and dialogs of the author. By doing so, he succeeds in keeping the viewer's interest through all the movie. Go see it! Don't pay any attention to the horrible title in English: \"Kissing cousins\"",
         "This movie is obviously connected in some way to the 1994 movie \"Greedy,\" with Michael J. Fox. The essential story line is pretty much the same: dying rich family member, blood sucking nephews and nieces want to get a piece of the pie before the old geezer dies. However, there are a few interesting twists in the plot that add a little spice to the movie that \"Greedy\" obviously misses. Add to this the fact that the actors are of a high caliber...Marcos is a delight to watch, his toothpaste smile charming everybody, and the beautiful Lucarno is enticing. The setting is quasi exotic and the movie is well scripted, adding that sensual touch and the rude language that otherwise used would be merely sex and swearing. The twist in the end is particularly interesting...I won't spoil the plot. Suffice it for me to say that this movie is better than average entertainment value.",
         "The writer Jorge Ibargüengoitia is well known for his highly ironic books, and the \"Dos Crimenes\" novel is a delight of black humor. If you like Bierce's Devil's Dictionary humor, you'll like also the movie. That looks like a plain description of provincial greediness at first sight. Nope! the irony is in the details; the police that fabricates a terrorist plot, the hero governed by his hormones, the romantic and/or greedy young girl, the hot respectable mom, the corrupt prosecutor and police inspector and so on. Nothing happens as planned except for the banker... Excellent satire of the Mexican society.",
         "This is not a great film but quite pleasant to watch. It requires little effort. A group of relatives decide how they will divide up their sick Uncle Ramon's inheritance when he dies. All goes well until cousin Marcos (a murder suspect) arrives on the scene. They try to buy out his share whatever it happens to be. The whole household is a suspicious-looking lot and when Uncle dies the story becomes a \"Who-dunnit?\" The culprit is fairly obvious. Poison in drinks, mistaken identity, reading of a will are all old themes we've seen before. The sex scenes in various beds and in the shower are not new either. Despite lack of originality the film has a great look but spoilt perhaps by a melodramatic ending. If there's a message in this film it's this: Always pour your own drink!",
         "This is a pretty empty film. The characters are cardboard (sex objects at best, in a Hollywood sort of way), except perhaps for uncle Ramon who is less of a chiché than the others. Screenplay lacks follow-through and editing. The one redeeming thing about the film would be the sound track, which contains some good Latin American folk songs."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Cuévano Films",
         "Fondo de Fomento a la Calidad Cinematográfica",
         "Instituto Mexicano de Cinematografía (IMCINE)"
      ],
      "summaries": ["After being falsely accused of a murder, Marcos (Alcazar) runs away to the small and quiet town of Cuevano, where he has relatives. There he finds that the family matters are more complicated than his, and that the complexities of small-town life are richer (and more dangerous) than his apparently sophisticated life in the big city."],
      "budget": 0
   },
   "movielensId": 403,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-05-26",
      "dvdReleaseDate": null,
      "directors": ["Roberto Sneider"],
      "runtime": 0,
      "movieId": 403,
      "title": "Dos Crímenes",
      "mpaa": null,
      "actors": [
         "Damián Alcázar",
         "Pedro Armendáriz Jr.",
         "Dolores Heredia",
         "José Carlos Ruiz"
      ],
      "imdbMovieId": "0112889",
      "originalTitle": "Dos Crímenes",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Greed and playing into the hand of providence provides the focus of this Mexican comedy adapted from a novel by Jorge Ibarguengoitia. Marcos, an architect, has just returned to the home of his wealthy uncle Ramon after squandering his money in Mexico City and subsequently finding himself falsely accused of a crime. Although he is flat-broke, he conceals this from Ramon, telling him that he has returned home to buy a local gold mine. Marcos finds the lies come easily as begins trying to induce his uncle to fund his endeavor. Irascible Ramon, who likes Marcos for his similar love of drinking and smoking is duped, but Ramon's sons are not fooled by Marcos. To them he is a threat, and they fear he will be placed in the will. Soon all of them are trying to out-manipulate each other. Even Ramon, who is not as innocent as he appears is involved in the mayhem.",
      "tmdbMovieId": 172923,
      "avgRating": 2.36111,
      "releaseYear": "1995",
      "numRatings": 18,
      "posterPath": "/1L15fJfWfOUK9Ht15OLLmgW90h8.jpg"
   }
}