{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "scotland",
            "id": 388
         },
         {
            "name": "morocco",
            "id": 1629
         },
         {
            "name": "good and bad",
            "id": 46958
         }
      ],
      "imdb_id": "tt0110027",
      "video": false,
      "title": "Highlander: The Final Dimension",
      "recommendations": [
         8010,
         12211,
         13360,
         12088,
         8009,
         9594,
         11342,
         9610,
         8831,
         5550,
         10861,
         5549,
         849,
         11037,
         9349,
         9057,
         11649,
         12764,
         5470,
         5765
      ],
      "backdrop_path": "/opz4bVpTa6zViVovC3l0SarIDJI.jpg",
      "revenue": 36800000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Connor 'The Highlander' MacLeod",
               "gender": 2,
               "credit_id": "52fe448dc3a36847f809c693",
               "name": "Christopher Lambert",
               "profile_path": "/sIl2F9LDTjfnAVBxEG5CTtZGuJU.jpg",
               "id": 38559,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kane",
               "gender": 2,
               "credit_id": "52fe448dc3a36847f809c697",
               "name": "Mario Van Peebles",
               "profile_path": "/ciIe7kUrTA2nL8dPDA4L88DcBZX.jpg",
               "id": 16214,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alex Johnson / Sarah",
               "gender": 1,
               "credit_id": "52fe448dc3a36847f809c69b",
               "name": "Deborah Kara Unger",
               "profile_path": "/ye75IqbNmFdEuvU9Td0eFKwtA0i.jpg",
               "id": 13549,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nakano",
               "gender": 2,
               "credit_id": "52fe448dc3a36847f809c69f",
               "name": "Mako",
               "profile_path": "/gU3eoZP8OQZLFMPZ9MYWa6pajvT.jpg",
               "id": 10134,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Stenn",
               "gender": 2,
               "credit_id": "52fe448dc3a36847f809c6a3",
               "name": "Martin Neufeld",
               "profile_path": null,
               "id": 53596,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Takamura",
               "gender": 0,
               "credit_id": "52fe448dc3a36847f809c6a7",
               "name": "Daniel Do",
               "profile_path": null,
               "id": 53597,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jack Donovan",
               "gender": 2,
               "credit_id": "52fe448dc3a36847f809c6af",
               "name": "Michael Jayston",
               "profile_path": "/yoTNX1Bx2YqEaEHyzQXlkTZ5Iq2.jpg",
               "id": 29069,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Pierre Bouchet",
               "gender": 2,
               "credit_id": "5a9347c5c3a368250b025073",
               "name": "Louis Bertignac",
               "profile_path": null,
               "id": 53598,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448dc3a36847f809c6b5",
               "name": "Andrew Morahan",
               "profile_path": null,
               "id": 53599,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53f635dac3a368340b00409c",
               "name": "Paul Ohl",
               "profile_path": null,
               "id": 32870,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53f635eac3a36833f400402f",
               "name": "Brad Mirman",
               "profile_path": null,
               "id": 22007,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "53f635f6c3a36833fd004015",
               "name": "William N. Panzer",
               "profile_path": null,
               "id": 53867,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "58c14e47c3a3687e00005222",
               "name": "Steven Chivers",
               "profile_path": null,
               "id": 42177,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 9.317199,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 8011,
      "vote_count": 147,
      "budget": 26000000,
      "overview": "Starts off in the 15th century, with Connor McLeod (Christopher Lambert) training with another immortal swordsman, the Japanese sorcerer Nakano (Mako). When an evil immortal named Kane (Mario Van Peebles) kills the old wizard, the resulting battle leaves him buried in an underground cave. When Kane resurfaces in the 20th century to create havoc, it's up to McLeod to stop him.",
      "similar": [
         346,
         197,
         616,
         64686,
         8009,
         10096,
         10661,
         1724,
         1771,
         253,
         24428,
         8392,
         10204,
         24,
         51876,
         51739,
         59108,
         274854,
         315635,
         667
      ],
      "original_title": "Highlander III: The Sorcerer",
      "runtime": 99,
      "poster_path": "/8ZeckjmtObR3QPjzSm4X656vFS2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Trans-Film",
            "id": 2662,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fallingcloud",
            "id": 30655,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Initial Groupe",
            "id": 22240,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lumière Pictures",
            "id": 25129,
            "origin_country": ""
         }
      ],
      "release_date": "1994-11-29",
      "vote_average": 4.5,
      "belongs_to_collection": {
         "backdrop_path": "/gY5NPUGGJJdaGPlEM6f2pfHNtit.jpg",
         "name": "Highlander Collection",
         "id": 8050,
         "poster_path": "/mNIXoyFicGseg9NoG3NHKZolKze.jpg"
      },
      "tagline": "Throughout time they have hunted each other fulfilling the prophecy, that there can be only one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew Morahan"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Gregory Widen",
         "Brad Mirman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110027/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NTQ0MDE2Ml5BMl5BanBnXkFtZTcwMzk0MDU1MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Lambert, Mario Van Peebles, Deborah Kara Unger | See full cast and crew »"],
      "reviews": [
         "Just to be up-front about this - I enjoy these films. The original - Highlander - was the only one in the series which really stands the test of time (Endgame has now joined it in this), and stands head and shoulders above the others for artistic merit and originality, but still, I liked the others well enough. I also like the much maligned Christopher Lambert. He's an odd actor to be sure - far from the Hollywood norm in appearance, style and accent, but he's nothing if not original and once you understand his understated style, you might just see that the guy has some serious talent. Read on if these statements resonate with you. Otherwise, feel free to move on without reading or rating this review. Lambert is good, Unger is good, Van Peebles is campy as hell, alternating between absurdist humor and menacing poseur-ship. The script is OK, certainly less grandiose and more mindless than II (and closer to the original in feeling, pace and plot), but not particularly original. The production values are a slight step up from II, about as good as Endgame, and almost up to the original's standards. Conor McLeod has reclaimed something of his humanity - imagining himself to be the last immortal on earth, but of course, he is wrong. Sorcerer Kane, who has stolen the magic of one of McLeod's former teachers, is hunting his head. McLeod has adopted a child and is about to fall in love again, the last thing he needs is an attack by an enemy who has no corporeal body. The film is entirely predictable, and is nothing more than a fan film. So what? It's harmless entertainment with some very pretty scenes from Scotland and some other gorgeous landscapes, and, if you don't expect much, you might just have a good time with it.",
         "In 1995, with the enormous international success of the \"Highlander\" TV series, producers Bill Panzer and Pete Davis once again teamed up to unleash another \"Highlander\" sequel upon us. This time, it's \"Highlander III: The Sorcerer\" or, as it was known in the U.S., \"Highlander: The Final Dimension\". (Don't ask me where the hell that came from) The film finds Connor MacLeod (Christopher Lambert) enjoying a peaceful life with his adopted son, deceived that he has won the Prize. However, the evil sorcerer Kane (Mario Van Peebles) has broken free from the Japanese mountain he was entombed in, and now he wants the Highlander's head. One of the parts of the film I enjoyed the most was Christopher Lambert's portrayal of Connor. For once the character isn't a severely depressed maniac, and in fact, he's better in this film than any other. Mario Van Peebles makes a good, if not unbelievable villain, with Deborah Unger as the sexy Highlander girl. Andy Morahan's direction is good. The script is good and very entertaining, but the film's problem is this: although it has all the right materials to make a good film, they are either wasted, put in the wrong place or dropped quickly. It makes you wonder if the franchise is cursed. The film's score, by J. Peter Robinson, was very nice as well. Loreena McKennit's \"Bonny Portmore\", featured twice in the film, is a beautiful and outstanding song that has now become the theme for the series. All in all, while \"Highlander III\" (Sorcerer/Final Dimension) is an entertaining film, it can't come anywhere near comparing to the original film, although it is a major improvement over \"Highlander II\".",
         "What can I say, Highlander was the kind of movie that simply does not allow for a sequel. Highlander III may be enjoyable, but certainly doesn't come anywhere near the original one, which is a Classic. There are so many things that impressed me in Highlander; sadly, I can't say much about Sorcerer. Watch it, but don't expect too much.",
         "This is definitely more of a sequel than Highlander 2: The Quickening was. With respect to the first Highlander this film actually follows it pretty well. It's funny though because it totally disregards the existence of Highlander 2. In Highlander 2 they show Brenda Wyatt (the main girl in the first Highlander film) dying from the effects of a depleted ozone layer, but in this film they mention that she was killed in a car accident. Anyhow, if you pretend that Highlander 2 doesn't exist, this actually makes a good deal of sense with regard to the original Highlander. The only qualm I have with the film is how could Connor MacLeod think he has \"the prize\" when there are still 3 more immortals out there? That doesn't really seem to make sense, but maybe some die-hard Highlander fan can explain it to me. Anyhow, all in all, I thought this was a really good film. I loved all the actors, Christopher Lambert does a great job as Connor MacLeod as always and I was really impressed with Mario Van Peebles, he did a fantastic job, and looked really menacing throughout the film. Deborah Unger was a nice addition, she's definitely a looker, and not a bad actor either. The story was pretty good, but it's nothing terribly complicated. The special effects are very nicely done. I'm not a die-hard Highlander fan, but I do like the films, and I thought this film was great. I hope you enjoy the film as well. Thanks for reading, and be sure to read my other Highlander reviews. -Chris",
         "Christopher Lambert reprises his role as Connor McCleod who this time goes up against an evil immortal Kane(Van Peebles in a terrible performance) who is thawed out of suspended animation, of course once he defrosts, it's up to McCleod to put him (back) on ice. I admit that this is probably my favorite sequel, only because the beginning reminds me of kung fu sequel, with Mako teaching Lambert swordsmanship and kung fu, however that aside the movie is fairly uninspired but not too dull and really it makes logical sense, even in comparison with the original (The only sequel to do so.) The suspended animation thing is a lame way to bring up a new enemy but at least it doesn't explain that they are from a different planet, or completely contradict the original like the fourth. The fight sequences are decent and the production values while somewhat cheap play passably on screen, so overall it's a mediocre sequel. Nothing special but at least semi-watchable. * * out of 4-(Fair)",
         "First of all Highlander III: The sorcerer is the french title used for this film, I just thought I'd clear that up real quick. Those of us that live in America know Highlander III as Highlander: The Final Dimension. Highlander is heavly criticized due to the fact that Highlander II: The Quickening came before it. I look at it this way, Highlander II is like Halloween III it has nothing to do with the rest of the series the only exception is that it does involve Conner Macleod, unlike Halloween III which doesn't involve Michael Myers at all. I did not see the theatrical version of Highlander: The Final Dimension, I just recently came across a copy of the R rated Directors Cut of this film. This cut of this film is excellent and it is a nice sequal to the original Highlander if you forget about Highlander II. I think I can understand why this film was criticized, the theatrical version was probably released half assed with the scenes all cut up. The Directors Cut is pure and complete. I'd like to comment on the love scene in this film between Conner and the female lead, it is almost on a pornographic level and it is no wonder that they wouldn't allow that to get into theatre's. It is greatly welcomed in this release though. Mako does an excellent Job as Macleod's new trainer at the beginning of the film, he knows he is going to die and on at least three occasions gives Conner the opportunity to take his head, he idiotically refuses and his trainers powers fall into the hands of evil an evil that would hunt MaCloud many centuries later. Those that say that this is a remake of the original are greatly mistaken and should rent the directors cut of this film and watch this one again. MaCloud did win the prize in the original film, it just so happens that when the sorcerer is resurrected the game begins again,Macloud is actually defending the prize he already won, he gets an even greater prize when he kills the Sorcerer, he recieves the powers and knowledge of his trainer and his power of illusion, besides the overall prize. Many have asked about Highlander: Endgame, this film only works if you think of it as many years later, this film also is based on the television series too, we have both Conner and Duncan in this one. IF you see the pilot of that show Conner is there, we learned that he trained Duncan after finding him almost dead after a battle. This film pretty much wraps up that series and it tries to finish off the film series as well, it is confusing but you can make sense out of it if you try. The Villian in that film tops them all as he doesn't care about the rules, in fact he breaks every one including the Holy Ground rule. If anyone else can figure out the link between Highlander I, III, the series and Endgame, feel free to write another commentary with updated information and your own thoughts of what if. Highlander: The Final Dimension is under-rated and the Directors Cut of this film should be viewed for best performance. There can be only one, yes in the end there can be only one, we do not know when the end will be, it could be the end of time for all we know, immortals are always being born throughout the centuries and years, we don't know who they are or where they are, at the time end of time one man shall stand alone, at that point there can be only one, but it will be almost an eternity before every immortal is killed in fact the game has the potential to last an eternity. Those were just some words to think about next time you watch any of the Highlander films(except II) and when you watch the show.",
         "A good revenge plot drives this third Highlander installment. An old enemy similar to the Kurgan of the first film, escapes an entombment after 400 years and begins a quest for the head of McLeod. Kane- the Sorceror -makes a great villain and blends into modern America easily with his tattoos and piercings. The film also boasts some Conan elements with Mako again playing a wizard named Nagano and there also some f/x similar to T-2 as the sorceror's power is made apparent. Debra Unger is also a plus as a smokin' leading lady who provides the best and sweatiest sex scene of the \"Highlander\" cycle. There are also some great locales used in the film. From snowy Japan to African deserts to the Scottish Highlands, the film features all three beautifully. McLeod also has an adopted son and is hounded by a new NYC detective who is wise to his immortal habits. But through it all, he keeps his cool demeanor. However, the soundtrack leaves much to be desired. 7/10. Check out the DVD!",
         "(A word of warning there may be a few spoilers within so if you haven't seen this or any of the other films or the series I recommend you not read this yet) First of all Highlander III: The sorcerer is the french title used for this film, I just thought I'd clear that up real quick. Those of us that live in America know Highlander III as Highlander: The Final Dimension. Highlander is extremely criticized due to the fact that Highlander II: The Quickening came before it. I look at it this way, Highlander II is like Halloween III it has nothing to do with the rest of the series the only exception is that it does involve Conner Macleod, unlike Halloween III which doesn't involve Michael Myers at all. I did not see the theatrical version of Highlander: The Final Dimension, I just recently came across a copy of the R rated Directors Cut of this film. This cut of this film is excellent and it is a nice sequal to the original Highlander if you forget about Highlander II. I think I can understand why this film was criticized, the theatrical version was probably released half assed with the scenes all cut up. The Directors Cut is pure and complete. I'd like to comment on the love scene in this film between Conner and the female lead, it is almost on a pornographic level and it is no wonder that they wouldn't allow that to get into theatre's. It is greatly welcomed in this release though. Mako does an excellent Job as Macleod's new trainer at the beginning of the film, he knows he is going to die and on at least three occasions gives Conner the opportunity to take his head, he idiotically refuses and his trainers powers fall into the hands of evil an evil that would hunt MaCloud many centuries later. Those that say that this is a remake of the original are greatly mistaken and should rent the directors cut of this film and watch this one again. MaCloud did win the prize in the original film, it just so happens that when the sorcerer is resurrected the game begins again,Macloud is actually defending the prize he already won, he gets an even greater prize when he kills the Sorcerer, he recieves the powers and knowledge of his trainer and his power of illusion, besides the overall prize. Many have asked about Highlander: Endgame, this film only works if you think of it as many years later, this film also is based on the television series too, we have both Conner and Duncan in this one. IF you see the pilot of that show Conner is there, we learned that he trained Duncan after finding him almost dead after a battle. This film pretty much wraps up that series and it tries to finish off the film series as well, it is confusing but you can make sense out of it if you try. The Villian in that film tops them all as he doesn't care about the rules, in fact he breaks every one including the Holy Ground rule. If anyone else can figure out the link between Highlander I, III, the series and Endgame, feel free to write another commentary with updated information and your own thoughts of what if. Highlander: The Final Dimension is under-rated and the Directors Cut of this film should be viewed for best performance. There can be only one, yes in the end there can be only one, we do not know when the end will be, it could be the end of time for all we know, immortals are always being born throughout the centuries and years, we don't know who they are or where they are, at the time end of time one man shall stand alone, at that point there can be only one, but it will be almost an eternity before every immortal is killed in fact the game has the potential to last an eternity. Those were just some words to think about next time you watch any of the Highlander films(except II) and when you watch the show.",
         "The other reviews say it all : you will have a good time watching this film if you don't expect something too smart or original but just wish to be entertained with some action and fantastic images. But I wish to add that paying attention to the music is also worth the shot. From the eerie chants in the most unsettling moments to the timeless Celtic songs accompanying the grandiose shots and peaceful passages, the music is a faithful and enhancing companion to the plot.",
         "After fans was disappointed with Highlander II: The Quickening William Panzer and Peter S. Davis decided to try again and make the true sequel to Highlander meaning Highlander III: The Sorcerer would have to disregard Highlander II: The Quickening, a movie which could be considered a stand alone film since it's plot completely changes the Highlander mythology. Highlander III: The Sorcerer does have some flaws, the main flaw is that this movie tries to hard to mimic the style of the original but lacks the punch that made the first film such a cult classic. A prime example is the main villain Kain, he seems like a rehashed version of the Kurgen. Mario Van Peebles is a great actor and does a good attempt at copying the Kurgan but sadly he can't match Clancy Brown's performance. Another example is the car scene where Kane tries to scare the kid by playing chicken with planes. It's just a copy of the scene in the original Highlander except changed slightly. The chemistry between Connor and Ramirez was one of the things that made Highlander so memorable. It was like a father and son relationship, sadly the chemistry between Connor and Nakano isn't the same. Mako does a great performance but sadly the film doesn't give him enough screen time, if the film delved deeper with the mentor training Connor it might of had the same power the original had. The flashback scenes are pulled off well giving the movie more depth. The training scene in Scottland is beautifully shot and the song \"Bonny Portmore\" definitely makes it more powerful. The sword fights are choreographed well and move at a good pace. The special effects are okay. The plot of Highlander III sees Connor MacLeod living with his adopted son John in Marakesh until an evil Immortal named Kane is released. Centuries ago Connor was training with a sorcerer named Nakano, Kain and his two henchmen stormed his hideout searching for Macleod. Nakano fought back but was killed by Kane, while absorbing the Quickening the cave collapsed. When Kane beheads one of his henchmen Connor senses it, so he decides to leave Marakesh and return to New York. The game is back on and the prize is at stake once again Highlander III: The Sorcerer lacks the charm of the original but despite it's flaws Highlander III is a watchable sequel."
      ],
      "genres": [
         "Action",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Fallingcloud",
         "Initial Groupe",
         "Lumière Pictures"
      ],
      "summaries": [
         "The third Highlander movie takes place at 1994, which means it's a prequel of the second film. After the death of his beloved wife Heather some centuries ago, Connor MacLeod left the highlands of Scotland and wandered around the world. Finally, he got to Japan, where he met the famous sorcerer Nakano, who was an Immortal too. Soon, they became friends, and Nakano taught Conor some tricks. But one day, an old enemy, Kane, came to Japan willing to find Nakano's cave and kill him. Although he succeeded, after cutting Nakano's head the mountain collapsed and Kane was trapped. Now, centuries after, an excavation reveals Nakano's cave...",
         "In feudal Japan, Connor McLeod, the immortal highlander, seeks out an immortal master of illusion in order to learn the magician's art. He is unknowingly followed by an evil immortal, Kane, who want Connor's head. They fight and Connor gets away while Kane is trapped in a cave. Now in the present Connor's peace is destroyed once again as the evil Kane is released from his imprisonment and the struggle of the Gathering begins again. Using Connor's loved ones and his acquired powers of illusion, Kane lures Connor in for a fight where there can be only one winner.",
         "Deceived that he had won the Prize, Connor MacLeod awakens from a peaceful life when an entombed immortal magician comes seeking the Highlander."
      ],
      "budget": 26000000
   },
   "movielensId": 405,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-11-29",
      "dvdReleaseDate": "2005-04-05",
      "directors": ["Andrew Morahan"],
      "runtime": 99,
      "movieId": 405,
      "title": "Highlander: The Final Dimension",
      "mpaa": "R",
      "actors": [
         "Christopher Lambert",
         "Mario Van Peebles",
         "Deborah Kara Unger",
         "Mako",
         "Martin Neufeld",
         "Daniel Do",
         "Michael Jayston",
         "Louis Bertignac"
      ],
      "imdbMovieId": "0110027",
      "originalTitle": "Highlander III: The Sorcerer",
      "genres": [
         "Action",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["eW_HzYMNOng"],
      "plotSummary": "Starts off in the 15th century, with Connor McLeod (Christopher Lambert) training with another immortal swordsman, the Japanese sorcerer Nakano (Mako). When an evil immortal named Kane (Mario Van Peebles) kills the old wizard, the resulting battle leaves him buried in an underground cave. When Kane resurfaces in the 20th century to create havoc, it's up to McLeod to stop him.",
      "tmdbMovieId": 8011,
      "avgRating": 2.45605,
      "releaseYear": "1994",
      "numRatings": 3868,
      "posterPath": "/8ZeckjmtObR3QPjzSm4X656vFS2.jpg"
   }
}