{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109785",
      "video": false,
      "title": "Federal Hill",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d15c3a36847f824db89",
               "name": "Nicholas Turturro",
               "profile_path": "/i9m7ox3KoSkqeKvyGqLHZovUN5Q.jpg",
               "id": 32897,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d15c3a36847f824db8d",
               "name": "Anthony DeSando",
               "profile_path": "/b7LiBIdaquQDfRJYAvy2TEurb2h.jpg",
               "id": 176628,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d15c3a36847f824db91",
               "name": "Libby Langdon",
               "profile_path": "/tar86bzpswsBwcOIySIhSABu6d4.jpg",
               "id": 177692,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4d15c3a36847f824db85",
            "name": "Michael Corrente",
            "profile_path": "/5ZZRgK9fonWGJt3rfeidwgCTkDd.jpg",
            "id": 77076,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.12361,
      "production_countries": [],
      "id": 171857,
      "vote_count": 2,
      "budget": 0,
      "overview": "In Providence's Italian neighborhood, Federal Hill, five young are immersed in drugs, crime and violence. Everything changes when one of the guys in the band know love.",
      "similar": [],
      "original_title": "Federal Hill",
      "runtime": 97,
      "poster_path": "/79qtZM5nPGnslmrWjXWHdawwQhd.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-02-24",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Michael Corrente"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Michael Corrente"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109785/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxOTY4MzMzNF5BMl5BanBnXkFtZTcwMzM4MTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Nicholas Turturro, Anthony DeSando, Libby Langdon | See full cast and crew »"],
      "reviews": [
         "Being from Rhode Island and working on Federal Hill, I feel that this movie truly captured the essence of the Italian American young adult in it's day and age. Believe me, the characters are soooooo close to home.. Corrente really was able to portray the \"spacone\" better than a lot of other directors were able to do.. Definitely watch this movie.... and if your from Rhode Island and haven't seen it yet.... rent it.. buy it.. watch it.. get some haven brothers and watch it.... I had a lot of laughs watching these guys run around the state to places that I can relate to... everything from food spots to night clubs.. I love the scene when Nicky cooks for his girlfriend.. really funny.. it reminds me of myself..",
         "Providence, Rhode Island, and in particular its neighbourhood of the title, serves as but one among many interesting personalities in this well-wrought feature film debut of its director/scriptor Michael Corrente. Completed in less than one month and having a sparse budget, the skillfully edited work benefits from a forcefully driven narrative that includes several parallel plot strings. Five Italian-American friends share the major portion of the scenario, with brothers Ralphie (Nicholas Turturro) and Nicky (Anthony DeSando) having their close relationship jeopardized by the latter's romantic involvement with a Brown University co-ed. At the same time, their cousin Bobby (Jason Andrews) finds himself dangerously in debt and when collection time nears, Ralphie agrees to help him raise the needed cash through an ingenious and illicit scheme. Based upon an early single act play by Corrente, later expanded to a full-length piece, \"Ledge Street\", this production displays a strong motif dealing with the difficulty of overcoming class distinctions. Shot with black and white stock, appropriate for its mise-en-scène, the picture was slated by its distributor, Trimark, for colourization to make it palatable for movie theatre audiences, but Corrente did not back away from his chiaroscuro vision and it remained as his perception dictated, although he permitted colour processing (under his oversight) for its video release, it therefore owning an odd distinction of being the only modern U.S. black and white film that had colour added for home consumption. The interlaced lives of the principal characters are strongly portrayed by the cast, Turturro nabbing acting honours with a passionate and layered performance, with only the female lead, in her initial feature, failing to convince in her rôle. Cinematographer Richard Crudo obviously is a creative partner here of Corrente, and there is a great deal of originality within his compositions, while he is able to make something fresh with use of closeups. A feeling is generated that the Federal Hill district has its distinctive persona, and incisive dialogue binds a viewer's attention to Ralphie and Nicky's widely variable states of mind in a film that carves a niche for its cinematic métier and for its director.",
         "Ralph and Nicky are friends but are very much like brothers, the former a small-time crook, the latter a street drug dealer in Federal Hill. Both are close and part of a group of young men who hang around on the fringes of society but very much part of the neighbourhood. Nicky's relationship with promising college student Wendy offers him more than it seemed he had ahead of him. Meanwhile their cousin finds his outstanding debts are coming back on him as the lenders start to call it in and he turns to Ralph for help, putting him in the pot against some of the biggest men in the neighbourhood. Filmed in grainy black and white, this film was based on a short play by Corrente and does a good job of painting life in Federal Hill while also delivering a fairly interesting couple of stories. It helps that Corrente has a personal insight into the community and the characters because it does add to the material and makes it better than it could have been. On one level I can see why some viewers dismiss it as a cheap Italian \"boys in the hood\" because if you glance at it without thought then that is probably what you'll surmise it to be. However if you watch it there is more to this than just a simple collection of small time Italian American hoods. The trap of the community is well portrayed in the main thread involving Nicky and Wendy as contrasted with Ralph's refusal to aspire to more than what he was born into. This also could appear a simple narrative arch but it is strengthen by convincing characters. The relationship between Nicky and Ralph is interesting for what is on the surface as well as what is unsaid. Some have commented that the scene of gay-bashing was unnecessary and gratuitous but on the contrary I felt it helped establish an element of restrained and denied sexuality within Ralph. This never becomes more than a subtext but it does enrich the character somewhat. Outside of him the rest do fit into the clichés one would expect but they are still well done and the film relies less on Bobby, Fredo and Joey than it does on Nicky and Ralph. Corrente's direction is good and his cinematographer captures a convincing neighbourhood without using too much unnatural style. Good performances are drawn from the main cast. DeSanto is solid in the lead even if he does struggle at times to convince in some regards. Turturro has a better character to work with and his performance is strong throughout and probably one of the best I have seen him give. Support from Langdon is OK while Raynor, Turano, Vincent and others do good background characters that fit with the story. Overall then this is not a brilliant perfect film but it is certainly much more than what I thought it was going to be. At first glance the plot is like a Mean Streets copy but this is smarter than that and while painting a convincing community it delivers a couple of characters that are more complex than they appear and hold the interest as a result. The performances mainly do what is required but a couple are better than that \u0096 in particular a layered delivery from Turturro as Ralph.",
         "Many critics say this film gives off an anti-gay message. Ralph (played by Nicholas Turturro ) throughout the film mentions several gay remarks that are tasteless and crude. Hard to ignore, Ralph makes it clear to the audience that he has a problem with gay people. The reason for this is not because he hates gay people. The reason is because Ralph himself is gay! Take a good look at the relationship between Raplph and Nicky while you watch the film. I believe Ralph seems prejudice towards gay people to hide the fact that he is. An excellent independent film, Federal Hill was shot in Providence, Rhode Island. Good acting, great direction, and a powerful story, It is one of Nicholas Turturro's best performances.",
         "Good movie about a group of Italian American twentysomethings centering around two Nicky and Ralph and their criminal ways and relationships. The story is kind of borrowing from MEAN STREETS but it has its own little twists. Pretty good movie I recommend to fans of GOODFELLAS and MEANSTREETS.",
         "Overall the movie was okay. I never thought about Nicky and Ralphy's relationship and you are right, now I think about it, Ralph seem very jealous of Nicky's relationship with a woman. A lot foul language and tough acts throughout the film...typical of hoodlum type of movies. I like to get the \"run you away\" theme song of the movie...can't seem to find it."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Eagle Beach",
         "Trimark Pictures"
      ],
      "summaries": ["In Providence's Italian neighborhood, Federal Hill, five young men face their choices as they become adults. Bobby, who's sort of dim, owes $30,000 to a counterfeiter who's demanding payment; he asks Ralph, a gifted cat burglar, to help and Ralph comes up with a plan. Later, Frank's dad, who is one of the Hill's top mobsters, wants to have a talk with Ralph about some of this plan. Meanwhile, Ralph's best friend Nicky falls hard for Wendy, a rich blond from Brown, and Nicky begins to imagine a future with her away from Providence. Ralph thinks Nicky's making a big mistake and sets out to prove it. When Ralph insults Frank's dad, things come to a head."],
      "budget": 80000
   },
   "movielensId": 406,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-02-24",
      "dvdReleaseDate": "2005-02-08",
      "directors": ["Michael Corrente"],
      "runtime": 97,
      "movieId": 406,
      "title": "Federal Hill",
      "mpaa": "",
      "actors": [
         "Nicholas Turturro",
         "Anthony DeSando",
         "Libby Langdon"
      ],
      "imdbMovieId": "0109785",
      "originalTitle": "Federal Hill",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "In Providence's Italian neighborhood, Federal Hill, five young are immersed in drugs, crime and violence. Everything changes when one of the guys in the band know love.",
      "tmdbMovieId": 171857,
      "avgRating": 3.07971,
      "releaseYear": "1995",
      "numRatings": 69,
      "posterPath": "/79qtZM5nPGnslmrWjXWHdawwQhd.jpg"
   }
}