{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rodeo",
            "id": 1019
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "cowboy",
            "id": 155291
         },
         {
            "name": "bull riding",
            "id": 190078
         }
      ],
      "imdb_id": "tt0109021",
      "video": false,
      "title": "8 Seconds",
      "recommendations": [
         83489,
         143928,
         73249,
         78364,
         25646,
         46925,
         30796,
         32872,
         33156,
         36911,
         58628,
         48660,
         47874,
         34322,
         231082,
         39140,
         256511,
         31605,
         15652,
         140166
      ],
      "backdrop_path": "/xfb9JIE8Sx7Usb4pyofe1o33kNG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lane Frost",
               "gender": 2,
               "credit_id": "52fe475d9251416c75096c39",
               "name": "Luke Perry",
               "profile_path": "/78TAr0wLoRHyubnYxjyHNCt70V2.jpg",
               "id": 8395,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tuff Hedeman",
               "gender": 2,
               "credit_id": "52fe475d9251416c75096c3d",
               "name": "Stephen Baldwin",
               "profile_path": "/w2nZjBsEsjboQDZJXEkysuGgue4.jpg",
               "id": 9045,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kellie Frost",
               "gender": 1,
               "credit_id": "538bce630e0a266708002e0e",
               "name": "Cynthia Geary",
               "profile_path": "/6ovufvSpcZD3Et7vBjzJJG9UzWR.jpg",
               "id": 162945,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Clyde Frost",
               "gender": 2,
               "credit_id": "538bce6f0e0a26670e002dc3",
               "name": "James Rebhorn",
               "profile_path": "/cRbeDNPpcWKP0nLkXo5Bi1tq61w.jpg",
               "id": 8986,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Elsie Frost",
               "gender": 1,
               "credit_id": "538bce7b0e0a266702002d43",
               "name": "Carrie Snodgress",
               "profile_path": "/66oMosRyNaTrB8kyYupSEdeQGSY.jpg",
               "id": 44831,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Martin Hudson",
               "gender": 2,
               "credit_id": "538bcead0e0a26670e002dcc",
               "name": "Linden Ashby",
               "profile_path": "/thzvdpk4TV5hvmKxGrCKGZPrRkw.jpg",
               "id": 57251,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe475d9251416c75096c43",
               "name": "Monte Merrick",
               "profile_path": null,
               "id": 15673,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe475d9251416c75096c49",
               "name": "John G. Avildsen",
               "profile_path": "/siyDKiK6rHXoU94pnLaE6jFe5dk.jpg",
               "id": 16513,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.828343,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18069,
      "vote_count": 33,
      "budget": 0,
      "overview": "This film chronicles the life of Lane Frost, 1987 PRCA Bull Riding World Champion, his marriage and his friendships with Tuff Hedeman (three-time World Champion) and Cody Lambert.",
      "similar": [
         11564,
         2142,
         3134,
         948,
         8810,
         298312,
         14433,
         141,
         185,
         101,
         205,
         142,
         949,
         769,
         793,
         4771,
         241,
         550,
         281,
         228205
      ],
      "original_title": "8 Seconds",
      "runtime": 105,
      "poster_path": "/dNkJp1oOZxiEYFSRyZfcEreGZNS.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1994-02-25",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "Hang on for the ride of your life!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John G. Avildsen"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Monte Merrick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109021/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzE4MjczOTc2MF5BMl5BanBnXkFtZTcwNDMxNTYyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Luke Perry, Stephen Baldwin, James Rebhorn | See full cast and crew »"],
      "reviews": [
         "This is a great movie and Luke Perry does a great job of playing Lane Frost. While it is not entirely factual, it does give a fairly accurate description of life in the rodeo. This is one of those movies I can watch over and over again. If you don't like bulls, dirt, and the cowboy way..... don't rent this movie. However it is a must see for any rodeo fan.",
         "For those who don't know, 8 Seconds is the length of time one has to remain on the back of bucking bull in the bull riding event at a rodeo. I'm sure that those cowboys feel that those 8 seconds are like an eternity. This picture is about one of the very best at his profession, Lane Frost. The three principal players at the time this film was made, Luke Perry(Beverly Hills 90210), Stephen Baldwin(The Young Riders) and Cynthia Geary(Northern Exposure) were all at the height of exposure from popular television series' and brought a built in audience to the show. It helps by the way that Luke Perry bears an absolutely uncanny resemblance to the real Lane Frost. During the end credits there is some interview footage with the real Lane Frost so I'm sure there were a lot of oohs and aahs from the audience as the movie ended. I remember reading about Luke Perry and that his background before he became a teen heart throb was from a really tiny Ohio town. I'm sure that Perry understood the character of Lane Frost very well who hailed from a small town in Oklahoma. This film now joins other good movies about the rodeo scene, like The Lusty Men and Junior Bonner. Only difference is this one had an actual rodeo champion as a hero/protagonist. The portrayal of Lane Frost was as genuinely nice young man who rose to the top of his chosen profession through, skill, hard work, and dedication. He was doing as so few of us are privileged to do, actually make money doing what he loved. He gained a celebrity status in his field and was prey to the temptations that accompany fame. The Lane Frost, Perry gives us is a man who was very human. Doesn't detract in the least from his accomplishments. Cynthia Geary is fine as the wife who wins, loses, and wins Perry back ultimately. She's also rodeo people, the real Mrs. Frost was a barrel racing champion. And Stephen Baldwin as Tuff Hedeman who was Frost's best friend and eventual successor as bull riding champion registers well in his role. In 1994 the very year that 8 Seconds came out, professional bull riding spun out on its own as a sport with the formation of the Professional Bull Riders. It's champion in 1995 was none other than Tuff Hedeman. And in 1996 Tuff Hedeman and Lane Frost with both inducted in the PBR Ring of Honor, the equivalent of their Hall of Fame. It's a good biographical picture and should have gotten much more attention than it did.",
         "Luke Perry stars in this sentimental account of the interesting life of Oklahoma bull rider Lane Frost. Hard work and faith led to winning the 1987 PRCA Bull Riding World Championship before rodeo finally took his young life. Perry is very believable leading the cast that also features:Cynthia Geary, Stephen Baldwin and Red Mitchell. Some country dance tunes by Brooks & Dunn and Vince Gill. Worthwhile and recommended for the whole family.",
         "After I watched this film on video, I did a Google search on Lane Frost and was pleasantly surprised by the excellent web sites in tribute to his life. Evidently the film follows Lane's life fairly accurately, and the diversions from the truth are acceptable when you consider films are in the business of making money and must appeal to a wider audience than those \"who are in the know\". It is fitting that his parents said \"If people remember one thing about Lane we want it to be that he was a kind person and knew Jesus.\" I am not a religious-churchy person at all and I add this here show you that this film is about a decent, good person; don't worry though, the film does not preach, etc. The acting is very good, and the characters are quite believable. This is a nice film to watch with the family. I suppose if you cannot connect with the American West, or horses, or rodeos, you may want to leave this film alone, but otherwise it is a refreshing alternative to the usual Hollywood car chases, gun fights, sex and cheap jokes. My hat comes off to Lane Frost, a person to admire.",
         "This movie was actually quite good. The story of ill-fated bullrider Lane Frost met my expectations and featured just the right amount of romance, drama, rodeo scenes, action, tear-jerking scenes, and country singer cameos to suit most needs. I liked Luke Perry's performance, and Cynthia Geary's wasn't bad. If you see this, I guarantee you will not be disappointed. *** out of ****",
         "This is a great sports movie. And frankly, I think it's better than John Avildsen's other sports movie, Rocky (1976) http://www.imdb.com/title/tt0075148/combined . A story about a country boy turned world champion bullrider. It is about time, is all I can say. Lane Frost was a great cowboy, and he died doing what he loved. I have watched the real thing, and these boys deserve some real credit out there, doing what there doin. I just hope that some of the proceeds of this film went to the cowboys who need it. When Lane Frost died, a big part of PBR died along with him. I salute him for what he loved to do. At my school, we always watched this movie in our FFA class. It is definitely a favorite of mine, because, for one thing, it is much better than a lot of westerns you see these days. This movie is also a great love story between Lane and his wife, Kellie. If you love westerns, or romance movies, this one here is for y'all. I give it 9 of 10.",
         "Just happened on to this movie. Could not turn it off. Love rodeos--live and on TV. Had sort of followed these \"cowboys\" for several years.Really enjoyed seeing a bit of their lives. Lane Frost was basically a good person and it was nice to see him depicted that way. None of us are perfect and I guess it was ok to depict that side also. Glad the movie did not dwell on the negative and Lane and Kellie were able to work things out before he died. I believe I remember when he died. My Dad was a \"cowboy\"--not rodeo--just a real cowboy for many years. Don't miss this movie.",
         "This is a biopic about Rodeo superstar Lane Frost. It tells his story of living in his fathers footsteps and becoming a legend in his sport. It tells of how he met the love of his life and the ups and downs of his career full of broken bones and broken homes. A must see for anyone who knew his story, or followed Rodeo competitions. It will be enjoyed by those who like a good honest story about a real person. The acting was really good here and although Luke Perry was a huge star on Beverly Hills 90210, to me this is by far his best acting role. Stephen Baldwin is th only guy I wish they had replaced, those Baldwin's (with the exception of Alec in some roles) are just bad actors. The movie was good production wise, and whoever is responsible for shooting and arranging the bull-riding sequences did a great job too. It has a lot of heart. Lane is a great guy and everyone loves him, but he wants his dad to be as proud of him as the rest of the world is, doesn't every boy that looks up to their dad deserve to be told how proud they are. The movie shows that it takes a lot sometimes to know what love is, and it truly shows that following your dreams can make and often break a person. This movie was a good little drama. It was slow at times and thats what hurt it for me, it has some very dated stuff which makes it cheesy. I wish they had made it a little more exciting, but it has tons of dialog and lovey dovey appeal. It is often labeled as an action and other than the bull-riding it is not action at all, and its often called a family movie, but although it has a pg-13 rating, I think it is not family friendly, not for younger kids anyway. If you like sad drama's give it a try, or if you like rodeo stuff. I still can't give it more than 3 stars cause it didn't do a whole lot for me. Yee Haw!",
         "Of all the movies that my family has watched, this is the only movie that we don't intentionally rent. The first time Lane gets hurt is just too much for my husband to watch. Otherwise, 8 seconds would be on TV once a week if it were up to me. This is the only movie that I have seen in the theater where everyone remained seated through the credits. We were with another couple. I looked over to see my brother-in-law with tears streaming down his face as the end credits rolled and two songs played. In fact, most of the people sitting around us were crying. I was hesitant about watching Cynthia Geary after seeing her strong character on Northern Exposure (tv). I think her performance here is cheesy. Better casting would have sent my vote to a 10 out of 10 but this one gets 9 from me. Most of it's appeal comes from the soundtrack and how moved everyone feels after watching it. If a movie ever influenced me, it is this one. To this day I follow Tuff Hederman's career, though I wasn't interested in rodeo before seeing 8 Seconds.",
         "I saw '8 Seconds' a little while ago and thought it to be pretty good. It does contain some language and they did change the story line slightly from Lane Frosts real life, but overall it was a interesting video with likable characters. I'm a big rodeo fan so I especially enjoyed the bull riding and barrel riding scenes (Kelly Frost is a barrel rider) and the behind-the-chute action that the normal rodeo goer isn't able to see. I was a bit disappointed that they didn't mention that the real Lane Frost was a strong Christian, that they made his character in the movie have conflicts with his father when in reality they had a wonderful relationship, and that they included a cheating scene which never happened (the real Lane and Kelly Frost did split up for awhile, but there never was any cheating done by either side) I recommend this movie, especially if you have a language filter on your player :P although do be forewarned that there are some 'references' as well."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Sport",
         "Western"
      ],
      "productionCompanies": [
         "Jersey Films",
         "New Line Cinema"
      ],
      "summaries": ["This film chronicles the life of Lane Frost, 1987 PRCA Bull Riding World Champion, his marriage and his friendships with Tuff Hedeman (three-time World Champion) and Cody Lambert."],
      "budget": 7000000
   },
   "movielensId": 408,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1994-02-25",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["John G. Avildsen"],
      "runtime": 105,
      "movieId": 408,
      "title": "8 Seconds",
      "mpaa": "PG-13",
      "actors": [
         "Luke Perry",
         "Stephen Baldwin",
         "Cynthia Geary",
         "James Rebhorn",
         "Carrie Snodgress",
         "Linden Ashby"
      ],
      "imdbMovieId": "0109021",
      "originalTitle": "8 Seconds",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["I2Sgit4QPlM"],
      "plotSummary": "This film chronicles the life of Lane Frost, 1987 PRCA Bull Riding World Champion, his marriage and his friendships with Tuff Hedeman (three-time World Champion) and Cody Lambert.",
      "tmdbMovieId": 18069,
      "avgRating": 3.23066,
      "releaseYear": "1994",
      "numRatings": 711,
      "posterPath": "/dNkJp1oOZxiEYFSRyZfcEreGZNS.jpg"
   }
}