{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "sport",
         "id": 6075
      }],
      "imdb_id": "tt0109035",
      "video": false,
      "title": "Above the Rim",
      "recommendations": [
         16136,
         8291,
         39310,
         14469,
         14398,
         12489,
         10952,
         12888,
         13098,
         22314,
         16161,
         13408,
         26352,
         39119,
         28033,
         41478,
         56441,
         23196,
         12251,
         10426
      ],
      "backdrop_path": "/omc3XGvgUYwh8Ktsw6EcGfnw1dI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kyle Lee Watson",
               "gender": 2,
               "credit_id": "52fe47b99251416c750a3573",
               "name": "Duane Martin",
               "profile_path": "/k39pQoTLnRj9q4pPMZhgC5pKFTC.jpg",
               "id": 84077,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Birdie",
               "gender": 2,
               "credit_id": "52fe47b99251416c750a3577",
               "name": "Tupac Amaru Shakur",
               "profile_path": "/qPpFzmTKEcxEea6J4UTI5ic1tsf.jpg",
               "id": 54422,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Flip",
               "gender": 2,
               "credit_id": "52fe47b99251416c750a357b",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bugaloo",
               "gender": 2,
               "credit_id": "52fe47b99251416c750a357f",
               "name": "Marlon Wayans",
               "profile_path": "/yMBaTsPrthko9eYtSjfVduws5Cn.jpg",
               "id": 9562,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Shep",
               "gender": 2,
               "credit_id": "53bf8cd10e0a261585005e40",
               "name": "Leon",
               "profile_path": "/ctcZ94ykGlCSh0s8QwRkYPCKAsq.jpg",
               "id": 12974,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Motaw",
               "gender": 2,
               "credit_id": "53bf8ce00e0a261585005e44",
               "name": "Wood Harris",
               "profile_path": "/u88haG6iG7zwV0PTk9tSG5obaeP.jpg",
               "id": 65829,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Richie",
               "gender": 2,
               "credit_id": "53bf8cf20e0a26157c005cf7",
               "name": "Michael Rispoli",
               "profile_path": "/mRS7DAXhuLu8Z7PAlicm6kP0EZz.jpg",
               "id": 18313,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47b99251416c750a3589",
            "name": "Jeff Pollack",
            "profile_path": null,
            "id": 88060,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.356628,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19092,
      "vote_count": 54,
      "budget": 0,
      "overview": "Story of a promising high school basketball star and his relationships with two brothers, one a drug dealer and the other a former basketball star fallen on hard times and now employed as a security guard.",
      "similar": [
         13416,
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         323677,
         4942,
         10474,
         9563,
         2323,
         86130,
         1578,
         5925,
         12163,
         1367,
         1374,
         107,
         612
      ],
      "original_title": "Above the Rim",
      "runtime": 96,
      "poster_path": "/1ng4sowDKOPMJk9xO2G1g1c2DRs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1994-03-23",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Some games you play. Some games play you.",
      "adult": false,
      "homepage": "http://www.newline.com/properties/abovetherim.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Pollack"],
      "runtime": 96,
      "synopsis": "Leon in this film plays basketball by himself with no ball",
      "writers": [
         "Jeff Pollack",
         "Benny Medina"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109035/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMjc1MDAwNF5BMl5BanBnXkFtZTcwNjgzMDYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Duane Martin, Tupac Shakur, Leon | See full cast and crew »"],
      "reviews": [
         "This movie deserves more credit then critics should give. This movie had an all star cast as the up and coming Marlon Wayans,Tupac Shakur,Leon,Duane Martin,Henry Simmons,Bernie Mac,and the lovely Tonya Pinkins. Each actor played their part magnificiently and it was hip,touching,and realistic. The beginning was a little off when Leon dreamed of his best friend's death and then focused mainly on Duane Martin's basketball skills,and him trying to get into Georgetown University. Marlon Wayans was the comic relief in the film who's been released from prison. Bernie Mac was the homeless man who was interested in basketball but never made it. Tupac was the ruthless street hustler and the coach of a dirty playing basketball team. There were other former R&B stars who starred in the movie but only had small parts. To wrap it up in a nutshell Above the rim to me is one of the most memorable urban basketball movies I've ever saw.",
         "Can you believe that this movie was made over 10 years ago? It is very hard to believe but this movie has stood the test of time and it is highly regarded as one of the greatest basketball/hip-hop movies ever made. Here you have a star studded cast which features Duane Martin, Tonya Pinkins,Marlon Wayans,Bernie Mac,Leon and the late great rapper/actor Tupac Shakur(2Pac). Here you can see why Tupac was highly respected not only as a celebrated gangsta rapper,but also a great actor with an impaccable skill and broad range and here in this movie you see why. A film that is not to be missed. Rating:***** five stars.",
         "This movie has a real street feel to it,and it shows the meaning of true friends and how difficult some kids have growing up in world with drugs and crime. One of my favorit movies in this genre,and this movie also contains some real cool basketball scenes.",
         "This movie is definitely a memorable hood movie, don't know why it's not up their with the others. The thing that stood out the most in this movie was that it is not a basketball movie. It's a hood movie. I was expecting it to be a basketball movie set that just happens to be in the hood, but no. Still, it's got a lot of action packed exciting basketball scenes in it. While it's not a basketball movie, any fan of basketball should enjoy it. Overall it's a good movie. Should be a good watch for fans of hood movies, fans of basketball, or both.",
         "This is one of my guilty obsession type films. Most of the young actors (at the time), gave their best performances. The film is a bout a young basketball player who goes through a lot of trouble in his last year as a high school star point guard. Duane Martin shines in this role, perfectly casted, nice performance by the young actor. Tupac Shakur gives his best performance ever, better than his over-the-top Juice in which he was also impressive. Marlon Wayans, also gives one of his best early performances, not doing too much, didn't annoy me here. Leon's performance wasn't that great, hes not the best actor. I also liked Bernie Mac in a very hilarious role. The film is not perfectly acted, but Martin and Shakur carry it. Its a good screenplay, directed well, with great basketball scenes as well. great film 9/10",
         "this was one of tupac's best movie ever.The story line was great and so was his peformence.I enjoy basketball and for those of you who are a huge fan of the sport or watching ghetto movies.Go to the video store and rent,you will like this movie so much that you would want to see it over and over again.",
         "When i read some of comments that have been posted on this movie i felt as though something was missing. Someone needed to comment on this film who was actually a part of the culture that is being shown in this film. I am a black male who went to see this movie the weekend that it was released. As far as the hood is concerned, this is a classic movie. The cast was perfect, especially for the time of it's release. It was a movie set in the East Coast, but Tupac was a stand out star, and the entire soundtrack was done by Death Row. Shakur gave a great performance through out, along with Dwayne Martin. Leon was also featured in another film celebrated by the black community more than anywhere else, The Five Heartbeats. Not to mention Marlon Wayans doing what he always does. Wood Harris, who later goes on to \"The Wire\" fame, portrays a very aggressive character. The comedic legend Bernie Mac is featured in a good role also. I know that movies aren't black or white. They are just movies, but it is evident that there are a slew of movies that are celebrated a lot more in the black community than anywhere else. Menace II Society, Juice, New Jersey Drive, Above the Rim, Belly, Paid in Full, and this film are \"Hood\" classics. If you want to even begin to understand the logic behind some of the themes of this genre, then this is a very good movie to start with.",
         "An absolute all rounder. The cast, the plot, the basketball all come 2getha 4 an absolute stunner of a film. The Medina/Pollack influence is clear (Fresh Prince), the film offers a realistic portrayal of life in the hood.Wayans is on a mental one the entire film, while Leon gives a far more sombre, dark performance as the traumatised player who could have had it all.Tupac......Tupac is Tupac and it don't get any better (or realer) than that. The film has some slight issues regarding the love interest (Kyle's mom and Shep)which I don't feel is entirely necessary, but my girlfriend thought it was cute so the film has the potential to appeal to all.But it, rent it, watch it, steal it, borrow it...do something to see this film and remember....\"Recognise mother******!\"",
         "Kyle Lee Watson (Duane Martin) is the star basketball player at his high school, but his overly developed ego limits him from reaching his full potential. However via trials and tribulations he slowly starts finding the right path, in some part thanks to an unwilling mentor in the form of the school security guard Shep (Leon), who used to be NBA material, until one day tragically (and unintentionally comically) his best friend plummets to his death after trying to dunk. His brother on the other hand is local badboy Birdie (Tupac Shakur), who took to crime after Shep bailed out on the family. Despite B-movie credentials the presence of Tupac Shakur seems to have torpedoed the popularity of \"Above the Rim\". The story however remains derivative throughout, whilst the secondary plot is more than a tad schmaltzy, thrown in for good measure to introduce a father figure for Kyle. In addition to that the director Jeff Pollack goes extremely by the book, avoiding any turns or twists. Keeping it simple doesn't however work, as the resulting story is plot-thin and scarce of emotion. Once it gets to the ultimate and predictable show-down no connection has really been created between the viewers and the characters, hence no real enjoyment in watching this purposeless flick. Some key scenes are plain funny, unwillingly drawing a smirk to your face, while certain situations are blunderingly solved with disregard to logic and reason.",
         "The film, Above The Rim is no Star Wars, It's just a darker version of \"White Men Can't Jump\" with more creativity on the well developed basketball dribbling and dunks visuals. It's a must see for any sport/rap fan with the best soundtrack - thanks to Tupac Actor/Rapper dropping monster rhymes. The plot is a little light, but can't we all understand that we are not watching this movie for the plot but for the action. The basketball and music culture of America is superbly linked into the grim, street culture of the ghetto. The subtle use of basketball as a view into the street culture of America, is unique and original to this movie. This movies is a must for all DVD collections and deserves a 10. Thank You."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["New Line Cinema"],
      "summaries": [
         "Story of Kyle-Lee Watson, a promising high school basketball star, and his relationships with Birdie, a powerful drug dealer, and Birdie's brother, Thomas 'Shep' Sheppard, himself once a promising high school star at Kyle's school, now employed as a security guard.",
         "Story of a promising high school basketball star and his relationships with two brothers, one a drug dealer and the other a former basketball star fallen on hard times and now employed as a security guard.",
         "Story of a promising high school basketball star and his relationships with two brothers, one a drug dealer and the other a former basketball star fallen on hard times and now employed as a security guard."
      ],
      "budget": 0
   },
   "movielensId": 409,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-03-23",
      "dvdReleaseDate": "2003-01-14",
      "directors": ["Jeff Pollack"],
      "runtime": 96,
      "movieId": 409,
      "title": "Above the Rim",
      "mpaa": "R",
      "actors": [
         "Duane Martin",
         "Tupac Amaru Shakur",
         "Bernie Mac",
         "Marlon Wayans",
         "Leon",
         "Wood Harris",
         "Michael Rispoli"
      ],
      "imdbMovieId": "0109035",
      "originalTitle": "Above the Rim",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["sEsCXWD7-Cc"],
      "plotSummary": "Story of a promising high school basketball star and his relationships with two brothers, one a drug dealer and the other a former basketball star fallen on hard times and now employed as a security guard.",
      "tmdbMovieId": 19092,
      "avgRating": 3.04415,
      "releaseYear": "1994",
      "numRatings": 487,
      "posterPath": "/1ng4sowDKOPMJk9xO2G1g1c2DRs.jpg"
   }
}