{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "shakespeare",
            "id": 497
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "king",
            "id": 13084
         }
      ],
      "imdb_id": "tt0114279",
      "video": false,
      "title": "Richard III",
      "recommendations": [
         28448,
         4173,
         25497,
         42134,
         31656,
         2321,
         20620,
         115332,
         82686,
         49299,
         18389,
         84090,
         34145,
         27448,
         18774,
         965,
         43232,
         35847,
         43336,
         22423
      ],
      "backdrop_path": "/uCGFpcWrZSoSOJyzH5ag5m4svf5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Richard III",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f591",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "52fe44669251416c9100f595",
               "name": "Annette Bening",
               "profile_path": "/q8pCSQzGLrhgtVXBKzMnwfoeBlH.jpg",
               "id": 516,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "The Duke of Buckingham",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f599",
               "name": "Jim Broadbent",
               "profile_path": "/50TV6UKJKjmqdn1GQNuuCIYHLzP.jpg",
               "id": 388,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lady Anne",
               "gender": 1,
               "credit_id": "52fe44669251416c9100f59d",
               "name": "Kristin Scott Thomas",
               "profile_path": "/9NuZGaPn3Z1svlbF9ZkdtjgrHZo.jpg",
               "id": 5470,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "James Tyrrell",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f5b9",
               "name": "Adrian Dunbar",
               "profile_path": "/2dbNGBaqpnn55pOivsPh4B3dVQJ.jpg",
               "id": 42566,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Duchess of York",
               "gender": 1,
               "credit_id": "52fe44669251416c9100f5bd",
               "name": "Maggie Smith",
               "profile_path": "/kkMNu2iqkBPkbjhNBmDaUX7FHr.jpg",
               "id": 10978,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "William Catesby",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f5c1",
               "name": "Tim McInnerny",
               "profile_path": "/wxO1c0e5N1WHn2wLHmEbvrfqnnX.jpg",
               "id": 41043,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Earl Rivers",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f5c5",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Lord Stanley",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f5c9",
               "name": "Edward Hardwicke",
               "profile_path": "/21PRsSZBTaTrqq2wPwDUjRLSUjG.jpg",
               "id": 3545,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "The Duke of Clarence",
               "gender": 0,
               "credit_id": "52fe44669251416c9100f5cd",
               "name": "Nigel Hawthorne",
               "profile_path": "/jKG3trCa3RGE6h5yzjMOramfoed.jpg",
               "id": 15788,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Lord Hastings",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f5d1",
               "name": "Jim Carter",
               "profile_path": "/ycS14B6YHA2k4IlEPNgh0eQOv7u.jpg",
               "id": 20070,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "The Earl of Richmond",
               "gender": 2,
               "credit_id": "52fe44669251416c9100f5d5",
               "name": "Dominic West",
               "profile_path": "/56zmVMiuUhqas13xn700hvXUA32.jpg",
               "id": 17287,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "King Edward IV",
               "gender": 2,
               "credit_id": "584a35ffc3a368141401c3b5",
               "name": "John Wood",
               "profile_path": "/bWt4JT9eGxFtu3q0iCAKFtNv5XK.jpg",
               "id": 8937,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Archbishop Thomas",
               "gender": 2,
               "credit_id": "584a3623c3a368141401c3d1",
               "name": "Roger Hammond",
               "profile_path": "/p81yHkWRbxDoKcwBKZoduEoSl9c.jpg",
               "id": 27660,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Sir Richard Ratcliffe",
               "gender": 2,
               "credit_id": "584a363792514119bc01b429",
               "name": "Bill Paterson",
               "profile_path": "/lLIPguoZJZeZ04niI4PaG1cv3Xf.jpg",
               "id": 104795,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Brackenbury",
               "gender": 2,
               "credit_id": "584a365492514119bf01b23f",
               "name": "Donald Sumpter",
               "profile_path": "/gqNTtHmpiUs4bbGhHTNPSJUR6ZW.jpg",
               "id": 20425,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "1st Subaltern",
               "gender": 2,
               "credit_id": "584a3664c3a368141a01c8d3",
               "name": "James Dreyfus",
               "profile_path": "/9cuGSOrWJxKF8qScKsTHaVrUQVQ.jpg",
               "id": 7027,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Ballroom Dancer (uncredited)",
               "gender": 2,
               "credit_id": "584a368492514119b601adcf",
               "name": "Derek Lyons",
               "profile_path": "/oO7dJlNLJhYyqdTsoUQAFXp1UQS.jpg",
               "id": 1271092,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44669251416c9100f5a3",
               "name": "Richard Loncraine",
               "profile_path": "/j700yY5SyI1EZegFpL4h77Otu5W.jpg",
               "id": 33315,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546110c3c3a3686f31000401",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "546110d00e0a2672aa0003d7",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "546110dcc3a3686f350003e8",
               "name": "Richard Loncraine",
               "profile_path": "/j700yY5SyI1EZegFpL4h77Otu5W.jpg",
               "id": 33315,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59fc74d4c3a3681a3f02808e",
               "name": "Tony Borrough",
               "profile_path": null,
               "id": 1916735,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5ab29e1a0e0a261db600cade",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 3.729994,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 31174,
      "vote_count": 60,
      "budget": 0,
      "overview": "Shakespeare's Play transplanted into a 1930s setting.",
      "similar": [
         4771,
         445954,
         984,
         18587,
         15069,
         26390,
         12150,
         979,
         1949,
         275,
         281,
         75780,
         395990,
         281957,
         357096,
         123109,
         133805,
         2142,
         25376,
         21484
      ],
      "original_title": "Richard III",
      "runtime": 104,
      "poster_path": "/e8nuS9GQoSFaqld4hW5erk2ccag.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mayfair Entertainment International",
            "id": 34237,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Screen",
            "id": 871,
            "origin_country": ""
         }
      ],
      "release_date": "1995-12-29",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "I can smile, and murder while I smile",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Richard Loncraine"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "William Shakespeare",
         "Ian McKellen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114279/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3MzMwMzIxMF5BMl5BanBnXkFtZTYwNTM0Nzc5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ian McKellen, Annette Bening, Jim Broadbent | See full cast and crew »"],
      "reviews": [
         "From the very first Shakespeare film (a silent version of \"King John,\" of all things), filmmakers have sought to impose their own unique visions on Shakespeare; in the case of \"King John,\" it was fairly simple (a scene of John signing the Magna Carta, which isn't in Shakespeare's play). Ever since, Shakespeare adaptations have faced the difficulty of remaining true to the greatest writer in the history of the English language while bringing something new to the table; filmed plays, after all, belong on PBS, not in the cinema. Luckily, the minds behind this adaptation of \"Richard III\" is more than up to the challenge. To be fair, putting the movie in an alternate 1930's Fascist England doesn't serve the sort of lofty purpose that, say, Orson Welles' 1930s updating of \"Julius Caesar\" (intended to condemn the Fascist governments in Europe at that time) did. What it does do is allow the filmmakers to have a lot of fun. It's not necessarily more accessible -- the Byzantine intrigues and occasionally confusing plot can't be tempered by simply moving the setting ahead 500 years -- but it's definitely more entertaining. There's just something inherently amusing about Richard sneaking off for a pee after the \"winter of our discontent\" speech (still rambling on as he, ahem, drains the main), or giving the \"my kingdom for a horse!\" bit while trying to get his Jeep out of the mud. To be sure, the Fascist England shown in the film isn't very convicing -- from OUR historical hindsight -- but this isn't our world, this is a world fashioned from the imagination that just happens to look like our own, just as Shakespeare's were. You can't criticize \"King Lear\" for its faux-historical setting any more than you can criticize this film for the same reason. The complaint registered by a previous commentator -- more or less, \"if you're going to move Shakespeare to a new period, you need to be true to that period\" -- is utter bollocks, really. After all, it is inherently \"untrue\" to have people running around speaking Elizabethan dialogue in the 1700s, 1800s, 1900s, etc., so if you try to remain \"true,\" you end up stripping away the dialogue -- the very essence of Shakespeare. I agree with the even more controversial Shakesperean theatre director Peter Sellars in that words are not what makes Shakespeare great, but rather his characters and ideas. But Shakespeare communicated those through his words, and if you change them, it's not Shakespeare anymore. The same commentator pointed to Branagh's more faithful interpretations as a counterweight to this film, yet Branagh's \"Hamlet\" is not only set in the 18th century but in a country that looks nothing like 1700s Denmark, even though the characters refer to it as such. The complaints about McKellen's \"hamminess\" are equally unfounded. What are they using as their basis of comparision? Olivier? Olivier's Richard makes McKellen's look positively restrained by comparision. Richard is egotistical, bombastic, and prone to spouting lines like \"thine eyes, sweet lady, have infected mine.\" I have little doubt in my mind that Skakespeare did not intend Richard to be played \"straight\" -- indeed, if Shakespeare had any concept of what we call \"camp,\" he was probably thinking of it when he wrote the play. From this point of view, the \"silly\" little touches like the Al Jolson song at the end and even the newsreel of Richard's coronation fit in perfectly. As with most Shakespeare films, the plot has been streamlined -- nearly all of the characters are here, but scenes and speeches have been truncated and removed, but despite what some have said, these aren't fatal to the plot or the characters. Richard's seduction of Anne does seem to occur to quickly, but it's not a completely successful one, seeing how she lapses into drug addiction later in the film. Besides, Richard's evil has nothing to do with the fact that his \"inability to experience romantic love.\" Richard isn't a psychological portrait like Hamlet, he's a ruthless bastard, a piece of Tudor propaganda. When people praise \"Richard III\" (the play), it's not for its character depth. I notice I've focused more on answering the film's detractors instead of dilineating its merits; in a way, I guess this expresses how much I like it. The cinematography, direction, and acting are all top-notch. The sets are perfect, once you realize that this is NOT historical England -- the power plant subbing for the Tower is more imposing than the real thing could ever be, and the factory ruins that serve as Bosworth Field are certainly more interested than a bunch of tanks and Jeeps roaming around the open countryside. Shakespeare purists will, of course, hate it, but then they hate anyone who dares to put anything more than a cosmetic spin on the Bard, be it Welles' \"Voodoo 'Macbeth'\" or Brook's stage production of \"Titus Andronicus.\" For everyone else, read the play, then see the movie -- it'll help increase your appreciation of both.",
         "I'm not always comfortable with Shakespeare in modern dress, nor with Ian McKellen's apparent assumption of the mantle of Olivier and Gielgud. Neither did I think that anything could top the experience of seeing Antony Sher play the role on the 500th anniversary of the Battle of Bosworth. So after all the unfavourable comment, I was shocked to find this version comprehensively squashing all such reservations. It's brilliantly thought out, superbly played and totally gripping from start to finish. The updating to a non-specific inter war period is not just apposite but genuinely illuminating. The games McKellen plays with the changing techniques of warfare in the period, the rise of fascism, realpolitik and the undermining of royalty by the Wallis Simpson affair, push back the boundaries of Shakespeare on film in all directions. For example, at the very moment you're thinking that all this mayhem is a bit much in English period costume, the helmets change, then the uniforms get darker, the red flags appear and Richard's acceptance speech turns into an underground Nuremburg Rally - a stark reminder of just how deeply the country flirted with fascism in the 30s and just how short and steep the descent can be. Stanley's troops, crucially uncommitted, stood off overlooking the real Battle of Bosworth. McKellen's Richard has control of the railway network here, but Wing Commander Stanley denies him the all-important air support in a superb piece of updated analogy. Throughout, modernity is so carefully and relevantly overlaid on the plot structure that it becomes one of the great pleasures and achievements of the piece. Lots of surprises, not the least of which comes as the play's most famous line is perfectly re-engineered and delivered and lots of great players at the top of their form. McKellen, Scott Thomas, Broadbent, Downey Jnr and Annette Bening are all worth the price of admission individually, but there's hardly a flaw in any of the performances. I simply can't see what the detractors are on about at all. Really. An epic piece of work. Easily the best version on film. Easily the most thought provoking Shakespeare on film.",
         "Shakespeare's tragedy set in 1940s war-torn England. As someone who loves Shakespeare, I grant a lot of latitude and respect to any person who can get these modern versions produced. The vogue now is to alter the time period, while still holding, generally speaking, to the original plot and language. As usual with the movies, its now done so often that traditional Shakespeare has become a custom more honored in the breach than in the observance. (forgive me!) This is ok, it takes the evil Richard III and plops him into the role of fascist usurper and dictator, during the notorious fascist period of England's history. I know, try and not overthink it. The acting and collection of performers are both first rate, and the film offers interesting moments for both the novice and expert Shakespearean student. There is one thing and it is what prompted me to even write this. If you notice during Richard's ascendance, a formal ball is thrown and a Vera Lynn type woman is shown singing a Glenn Miller type tune. You know you have never heard it, but yet is eerily memorable. I find out years later (today in fact) it is a Christopher Marlowe poem, clevely fitted to a WW2 sounding musical number. Somehow, its just real creepy and its in keeping with the mood of the entire movie. Upsetting and unnerving, with the evil spread just a little too generously over the characters. If you have a big blender, and throw in a copy of 1984, Richard III, and Godfather III, this is what you would end up with.",
         "There are two definitive film productions of Richard III: - Sir Laurence Olivier's 1955 film version, which he directed and in which he plays the title role, supported by Sir Cedric Hardwicke as King Edward, Sir John Gielgud as Clarence, the delectable Claire Bloom as the Lady Anne and a host of other brilliant performers - and Ian McKellen's 1995 version, screenwritten by McKellen and director Richard Loncraine, in which McKellen also plays the title role. While the Olivier version is the definitive classic presentation of the play on film and should serve anyone who wants to see the play as it was intended to be seen (albeit the Colley Cibber adaptation), McKellen's adaptation captures the spirit of the play in modern context. The movie opens with the Lancastrians in their war room receiving word of Richard, Earl of Gloucester's holding Tewksbury by teletype, then soon their war room is breached by a tank, behind which swarm raiders in gas masks, one of whom slays the Prince of Wales and then the King himself, before removing his gas mask (one of the old goggle-eyed full-face models the Russians still use) to reveal himself Richard, duke of Gloucester. The scene shifts rapidly to a typical 1930s rich people's fete, complete with mellow-voiced torch singer and live orchestra, at which Richard III delivers the \"sun of York\" soliloquy as a toast to his father Edward and the assembled party - and then the scene shifts again to Richard completing the soliloquy to the camera, as he does throughout the film. The address to the camera is a little jarring - McKellen's smiling, evilly smirking delivery is a little over the top, what you'd imagine the Blackadder films would have been if they hadn't gone for laughs. But Ian McKellen carries the role off very well... his not-quite-sane, quite unbalanced and power-mad schemer Richard III is entirely plausible as a 1930s dictator-king in the central European mold. The uniforms shift from the standard British armed forces' khakis to the blacks and greys of Hitler and Mussolini as Britain slides into fascism under her scheming \"Lord Protector.\" The screen action is taut, visually compelling - even when McKellen bellows \"A horse, a horse, my kingdom for a horse!\" from a World War II Dodge weapons carrier/\"command car,\" the scene doesn't degenerate into incongruous, unintentional comedy, because by then the viewer is caught up in the tale of this wild-eyed sociopath who has just about run out of rope - and since the truck is axle-deep in sand, stuck, a horse is just what Richard could have used around then. There's just enough realism in the 1930's props to help with willing suspension of disbelief - no more. Military history buffs will not be happy. No matter. What is communicated very well is the senseless welter of fully-joined battle, fiery slaughter and Richard III's lashing out in senseless rage, eventually as much against his own men as the enemy. The Duke of Stanley's last-minute defection against Richard's forces in the final battle is all the sharper for Stanley being the commander of the air force (his loyalty to Richard III in the coming battle with Henry, Earl of Richmond seemingly assured by his young son's being held hostage in Richard III's war train) - so that the viewer no sooner hears the news of the defection in the play's dialogue than Richard's forces are strafed and bombed by Stanley's war planes as Richmond's forces swarm into Richard's assembly area, cutting the Ricardian army to pieces. Lots of interesting touches in the screenplay, such as Queen Elizabeth and her brother Earl Rivers (played ably by Annette Bening and rather indifferently by Robert Downey, Jr - who only manages to convince in the scene when he is assassinated in bed while submitting to the erotic ministrations of a Pan Am stewardess) playing their roles as Americans - using the homage to Wallis Simpson and her husband the Duke of Windsor (who abdicated his kingdom to marry Simpson because she wasn't only a commoner but a divorced American) to bring needed tension among the royals to the play. In case the viewer's a little too thick to realize that Downey's character is an American, not only does he lay the flat, nasal accent on thicker than Hell, but on landing in England, he steps out of an airliner painted in bright Pan-American Airlines livery, where he is met by his royal sister Elizabeth and her children. Bening's performance is more nuanced and sympathetic than Downey's - the conundrum of Elizabeth's brother being a Peer and obviously an American at the same time is just left out there. But before long, we're McKellen's willing co-conspirators and agree to forget this lapse. Maggie Smith as Richard's mother Queen Margaret is stellar in her portrayal of a mother torn between the remnants of love for her twisted, lethal offspring and mourning the rest of her family dead because they stood in Richard's way to the throne. Her delivery of Margaret's of the advice Elizabeth asks for on how to curse Richard (Act 4, Scene 4): \"QUEEN ELIZABETH O thou well skill'd in curses, stay awhile, And teach me how to curse mine enemies! QUEEN MARGARET Forbear to sleep the nights, and fast the days; Compare dead happiness with living woe; Think that thy babes were fairer than they were, And he that slew them fouler than he is!\" is one of the best-delivered lines in Shakespeare on film I have seen. In closing one compares McKellen's Richard III to Anthony Hopkins' Hitler in \"The Bunker\" - an eerie channeling of one of history's foulest personalities, so that one feels one's self in his foul presence watching the show. Masterful work.",
         "I think updating Shakespeare's plays to more modern eras can be a good idea, but attempts quite often fail due to \"modernizing\" of the original text into the current vernacular, adding modern slang terms and modern pop-political slants and such things. Happily, Richard Loncraine's version of 'Richard III' works very well, being set in a surreal WW2 era setting, more reminiscent of Terry Gilliam's 'Brazil' than London as it actually was at that time; an alternative world is suggested which adds a touch of nightmare-fantasy to the film. I think this sort of intelligent interpretation of the text, placed into the mouths of people we can relate to more readily than we do to Elizabethan personages, is valuable and helps people otherwise unfamiliar with, or daunted by, Shakespeare's strange language is a good thing. All of life is covered in Shakespeare's plays, and after reading them it becomes apparent that nothing new has appeared in the world since, as far as fundamental life issues are concerned, making them invaluable tools in the history of literature as lynch-pins for people trying to navigate the shoals of human quirkiness without succumbing to depression and despair at the human condition. For instance, when O.J. Simpson's trial was going on I kept thinking of Othello and Desdemona, a tragedy of passion and murder being re-enacted for millions on the television. Richard III is all about power and how it corrupts. Richard is presented as a Hitler-like character. It's an ugly story, yet the light of goodness shines through in the roles of the Duchess of York, Maggie Smith, and Queen Elizabeth, Annette Beining. The cast is superb. I was put-off at first by Robert Downey Jr's Anthony, Earl of Rivers, because of his very-American accent. But Rivers has just returned from overseas, and given the setting, he could very well have returned from a long stint in New York. Once used to this he settled in nicely with the balance of the cast. Beining's accent is less noticeable. She is a fine, well-trained classical actress and knows what Shakespeare is all about. In the end she is a powerful foil to Ian McKellan's riveting Richard III. The use of '40s swing tunes works wonderfully, I especially enjoyed the tune that accompanies Richard to his death, it's very funny, and horrifying all at once. Even if you don't like Shakespeare I recommend this film. It's a great story and the technical aspects of it are top-drawer.",
         "Many productions throughout the years have presented Shakespeare in updated formats in order to make his plays more contemporary with varying results. This production is one of the most successful. Sir Ian McKellan's extraordinary performance makes his character, although thoroughly self-serving, incredibly magnetic. The film is enhanced by many other exceptional performances, most notably by Robert Downey Jr., Jim Broadbent and Kristin Scott Thomas. The setting makes the story more realistic to modern viewers, which helps it to avoid the stiff, stagy quality seen in most productions of this work. Making Shakespeare more accessible to today's viewers without butchering his amazing language is no mean feat, but this film accomplishes it handily.",
         "\"Richard III\" may not have the all-encompassing understanding of uman nature seen in \"Hamlet\" or the grace and mastery of \"The Tempest\", but for my money is one of the greatest plays ever written and certainly Shakespeare's most entertaining. It may be lacking in character development and psychology, but it more than makes up for that with a brilliant concept: have the villain as main character and make the audience his playful confident. The concept is aided further by eminently quotable lines and one great scene after the other of scheming, fiendishness and confrontations. One of the few pieces of criticism you can successfully throw at Shakespeare is that his central characters are often meek or feeble. Not so here! Tudor propaganda this might have been (it quite grotesquely disregards historical fact in a few places), this is storytelling at its finest. Richard Loncraine's 1995 film places the story in a fictitious 30s England reminiscent of early Nazi Germany. The device serves to make the proceedings more accessible (if only marginally since the original language has thankfully been preserved). It also makes for amusing situations (Richard of York telling his monologue while taking a leak in a public restroom - \"my Kingdom for a Horse!\" bellowed from a paralyzed jeep) and serves as further proof of the Bard's timelessness. Beyond the structural and technical feats - and they are quite excellent without exception, including Trevor Jones underrated dark jazzy score - lies what should be our main concern: the cast. Sir Ian McKellen as Richard is a Machiavellian wonder, blowing both Lawrence Olivier's rendition and McKellen's earlier work away. His fiendish creation is a joy to watch and root for, despite the increasing gruesomeness of his crimes. The byzantine plot demands that recognizable faces be cast in supporting roles and the characters are magnificently portrayed by eminent actors giving it their best and succeeding admirably. Maggie Smith, Jim Broadbent and Kristin Scott-Thomas are expectedly great, but the truly outstanding supporting performances come as surprises: Annette Benning is all grief and fury, Adrian Dunbar is eerie yet very human as Richard's pet killer Tyrell and Nigel Hawthorne is incredibly moving as the meek Clarence. Even Robert Downey Jr. manages to hold his own against this impressive array of actors. All in all if you can appreciate the language (that only gets better with repeated readings/viewings) and have a thirst for fine acting, it would be criminal to ignore this masterpiece.",
         "This is one of the movies you remember for a long time - and for all the good reasons. Transplanting Shakespeare in a different time and giving his historical plots a modern political sense is not such a new idea. What is really strong and works well here is the perfect fit between the characters as Shakespeare intended them and the background which is so different from the original historical one. Each one of the characters is both shakespearian as intended, a perfect citizen of the fictional time created by the director - a fascist England in the 30s - and more than everything else a human being: sensual, hating and loving as only humans do. Perfectly acted, almost flawlessly directed, with very little overweight, this film is a feast for the intelligent spectator, a brutal, well-paced and expressive piece of art - and exactly as Shakespeare would have loved it, a mirror of his time, of our time, and of any time. 9/10 on my personal scale.",
         "This film sets Shakespeare's Richard III in an alternative to WWII era England, where fascists and royalists maintain their own militias and play power games with kings and thrones. The first scene sets the tone for the entire film. A young officer is settling down to dinner with his dog chewing on a bone nearby. The building begins to shake and a low rumbling is heard. Soon enough, a tank erupts through the fireplace and stormtroopers charge in automatic rifles ablaze. Ian McKellan removes his gas mask and spouts a few lines of Shakespearean dialog. The action and the intrigue never really let up, as the film follows Richard's (McKellan) rise to infamy and power. Neither does the Shakespearean dialog. Somehow the cast manages to make the dialog fit the action and setting effortlessly. Richard III is jarringly strange - perhaps the most innovative of the recent Shakespeare updates - very well acted and directed. Although I recommend the film, I have to warn you - it's not for everyone.",
         "I am surprised how many people seem to hate this film. I am not a Shakespeare expert,but I love history and the 1930s and 1940s are my favourite period,so I love the way the our odd Royal Family is shown in this film,we know that members of the royal family were pro fascist in the 1930s so why not update the original story. The locations and the production design are great and the acting is impressive throughout. As for the comment about the murder in bed,it seems like a good plan to me,if you were busy with a flight attendant you are not going to notice an assassin under the bed. If you have not seen this I urge you to do so,you can watch it as a war movie or as a version of the play."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Mayfair Entertainment International",
         "British Screen",
         "Bayly/Paré Productions"
      ],
      "summaries": [
         "William Shakespeare's classic play is brought into the present with the setting as Great Britian in the 1930s. Civil war has erupted with the House of Lancaster on one side, claiming the right to the British throne and hoping to bring freedom to the country. Opposing is the House of York, commanded by the infamous Richard who rules over a fascist government and hopes to install himself as a dictator monarch.",
         "Based upon the famous National Theatre production Shakespeare's story of Richard III is set in a mythical fascist London of the 1930s. Richard seeks to gain the throne from his elder brother, Edward, by any means within his grasp including murder, marriage, and fratricide. But aside from Edward, his other brother (Clarence) and Edward's two young sons also stand between Richard and the crown of England.",
         "This film adaptation of Shakespeare's famous play is set into a hypothetical 1930's Europe. As sneering, leering Richard of Gloucester's ruthless machinations bring him ever nearer the throne of England, royal blood is mercilessly spilt. Finally, only one foe remains to challenge his grasping claim--valiant Richmond! Will he prevail? Heavy Nazi-like pageantry and iconography color this modern adaptation of a classic Shakespearean History.",
         "The classic Shakespearean play about a murderously scheming king staged in an alternative fascist England setting."
      ],
      "budget": 6000000
   },
   "movielensId": 41,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-29",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Richard Loncraine"],
      "runtime": 104,
      "movieId": 41,
      "title": "Richard III",
      "mpaa": "",
      "actors": [
         "Ian McKellen",
         "Annette Bening",
         "Jim Broadbent",
         "Kristin Scott Thomas",
         "Adrian Dunbar",
         "Maggie Smith",
         "Tim McInnerny",
         "Robert Downey Jr.",
         "Edward Hardwicke",
         "Nigel Hawthorne",
         "Jim Carter",
         "Dominic West",
         "John Wood",
         "Roger Hammond",
         "Bill Paterson",
         "Donald Sumpter",
         "James Dreyfus",
         "Derek Lyons"
      ],
      "imdbMovieId": "0114279",
      "originalTitle": "Richard III",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["OXc0-EME0C8"],
      "plotSummary": "Shakespeare's Play transplanted into a 1930s setting.",
      "tmdbMovieId": 31174,
      "avgRating": 3.84994,
      "releaseYear": "1995",
      "numRatings": 5078,
      "posterPath": "/e8nuS9GQoSFaqld4hW5erk2ccag.jpg"
   }
}