{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "stand-up comedy",
         "id": 9716
      }],
      "imdb_id": "tt0111804",
      "video": false,
      "title": "Martin Lawrence: You So Crazy",
      "recommendations": [],
      "backdrop_path": "/3rxaYdvfh7WbxV8cRCJZz9mCdkX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 4,
            "character": "",
            "gender": 2,
            "credit_id": "59e392fd9251410b670003ff",
            "name": "Martin Lawrence",
            "profile_path": "/uBVQuIdS3wGCpYaZFEeKZBuiZ2l.jpg",
            "id": 78029,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46979251416c910594c3",
               "name": "Thomas Schlamme",
               "profile_path": "/qwpO1XxptBjW5MAMET9suEopddp.jpg",
               "id": 15106,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46979251416c910594c9",
               "name": "Martin Lawrence",
               "profile_path": "/uBVQuIdS3wGCpYaZFEeKZBuiZ2l.jpg",
               "id": 78029,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.517449,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38129,
      "vote_count": 4,
      "budget": 0,
      "overview": "Stand up comedy by Martin Lawrence, filmed in the Majestic Theater in New York City. Martin Lawrence talks about everything from racism, to relationships, to his childhood.",
      "similar": [
         200133,
         416477,
         35595,
         34512,
         16290,
         62206,
         49013,
         703,
         812,
         270946,
         13015,
         39377,
         34163,
         23483,
         51828,
         67308,
         34509,
         4543,
         86130,
         435126
      ],
      "original_title": "Martin Lawrence: You So Crazy",
      "runtime": 84,
      "poster_path": "/sXoIo05zEY47L6ICjG0RqiVoDwj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "HBO Independent Productions",
         "id": 21222,
         "origin_country": ""
      }],
      "release_date": "1994-04-27",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "Uncut. Unrated. Unbelievably Funny.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thomas Schlamme"],
      "runtime": 84,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111804/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTg5ODM5ODY0OF5BMl5BanBnXkFtZTcwNjA2NDAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Martin Lawrence | See full cast and crew »"],
      "reviews": [
         "These projects have three components. Making the studio audience laugh. If they do, we are presumed to. Touching us in some way that matters. That's indicated by laughter but depends on deeper connections, usually with standup measured as \"insight.\" And then there's the film-related skills used to convey these two. In this case, they are amateurish, but it hardly matters. That's because this man has no talent for this sort of thing. He DOES make his audience laugh, but that uses a simple strategy: talk about things that are slightly outside the normal discourse: smelly vagina's and such. The audience titters, prebonded and rebonded. Black performers get a free ride for the first three- quarters of the effort when among black audiences because he belongs, so far as he establishes his bona fides. But the question for you, dear reader is whether this will matter to you, today, in its video form. And I suspect for nearly everyone the answer is no. Its not just that this is bad, but there is so much better. I'm talking about Chris Rock. Richard Pryor invented this form. Lawrence tries it and fails; Rock masters it. Its a s simple game: Gather a group who has ethnic identity, consisting of mainly stereotypes imposed and self-generated. Start out each joke sequence inside those stereotypes. Accept them, grow them, validate and celebrate them and then slyly turn the tables, showing how thin and ridiculous they are. Then segue into another set of stereotypical characteristics that seems to resolve this, or perhaps merely distract and start again. Rock is essentially perfect in this. Clearly there was some conscious thought in this, and some professional writers. But it all revolves around intuitive timing. I dare you to watch the two comics one after another. One is demeaning, the other intelligent and enobling. Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.",
         "I laughed through the whole thing, Martin is animated in a good way. Kevin Hart tries to be like Martin with the face expressions but will NEVER be on Martin's level. The way Martin delivers his jokes is just hilarious. And doesn't only rely on delivery but his jokes are actually funny. Really hopes he gets back into the game and start to take the world back by storm. Martin is one of the only comedians that really makes me laugh. He's funny in shows and stand up. The way he brings humor to racism is just super funny, especially when he imitates stereotypes of different races including his own. There was not a boring moment during this stand up and I laughed all the way through.",
         "Many people find Stand-up comedies tedious,but it ain't the fact cause not only some of them are not worthless,meaningless joke,but also they contain very handy,useful tips and advice which are very likely to lead us to a very sound,healthy,great life. This one conveys a lot of good and moral things,like it gives you a lesson.We all know Martin Lawrence for movies like NOTHING TO LOSE,BLUE STREAK,WILD HOGS,etc.In 1994 he conducted this hilarious stand-up comedy in the way that came as a shock to everyone, I mean almost everybody liked it. In this program he makes fun of White people and talks a lot about Racism,Relationship between girlfriends and boyfriends,the destructive influence of drugs and so on.",
         "Man, when you thought that stand up comedy could only be so funny, then this movie comes along! My God, this has to be one of the funniest stand up comedy movies around! Martin Lawrence does an excellent job keeping his audience laughing out of their seats with his combined mixture of racy jokes, including prison jokes (you know how those go...dropping the soap, etc.), racism, sex, and relationships. And boy, Lawrence holds-no-bars as he goes all out and is totally RAW and UNCENSORED (as you can tell because of the NC-17 rating). If you're chillin with a bunch of friends and you're looking to laugh your ass off, then this one will definitely do it for you. Check it out, but don't expect Blockbuster or Hollywood video to carry this 'bad boy'.",
         "I have to say that without a doubt Martin Lawrence was, is, and always will be my favorite comedian of all time. And with all the drama that he's been through in his life with the drugs and his coma, and all the other films he's done in between 'you so crazy' and now, he's definitely mellowed out. But if you're like me and always want to enjoy the Martin from the early 90's...when he was fresh off of 'Def Comedy Jam' and 'Martin' was still running, then you've gotta see this. I think however only true Martin fans can really appreciate this. True there's a lot of cursing and sex talk, but 'You So Crazy' can go up against Eddie Murphy's 'Raw' and Richard Pryor's 'Live On Sunset Strip' anyday. *** 1/2",
         "You So Crazy proves that Martin Lawrence is so crazy and funny. I laughed all the way through. I loved the way he would try imitating white people. It was hilarious! This was way, way, way better than RUNTELDAT. The only movie better than this one was The Original Kings of Comedy, and why wasn't he apart of that movie? Well he's definately THE KING OF COMEDY in my book. I give this a 10/10.",
         "\"You So Crazy\" has to be one of the best stand-up acts I have ever seen. I laughed practically through the whole thing. I had never even heard of it until i saw it on HBO for the first time two years ago. I caught it in the middle and couldn't stop watching it. It was freakin' hilarious. I decided to go rent it and watch the whole thing. Everyone I know that has seen \"You So Crazy\" thinks its funny as hell. If you don't like Martin Lawrence, rent this movie and it will change your mind.",
         "This is the funniest movie I've ever seen! And even though it's not really a movie but more of a stand up comedy act it's still hilarious. If in any way you like the TV show Martin or like any of his movies then you will love this. Although some viewers may be offended at the racist jokes, sexual humor, etc.",
         "Only someone who understands nothing about relationships and many of the life situations being discussed in this stand-up can say that somehow this is not funny. Martin Lawrence is a comical genius and he proves it in You So Crazy. Stop hating and open your mind.",
         "This was without a doubt the worst standup comedy film ever produced. Martin Lawrence is a decent actor, but his standup sucks. He couldn't write his way out of a paper bag. This performance is full of crude, off-color jokes and myriad curse words (all attesting to the film's NC-17 rating), none of which are funny. This movie sucked, and it makes me have no desire to see \"Runteldat\", Lawrence's newest standup film."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": [
         "HBO Independent Productions",
         "You So Crazy Productions"
      ],
      "summaries": ["Stand up comedy by Martin Lawrence, filmed in the Majestic Theater in New York City. Martin Lawrence talks about everything from racism, to relationships, to his childhood."],
      "budget": 0
   },
   "movielensId": 411,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-04-27",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Thomas Schlamme"],
      "runtime": 84,
      "movieId": 411,
      "title": "Martin Lawrence: You So Crazy",
      "mpaa": "",
      "actors": ["Martin Lawrence"],
      "imdbMovieId": "0111804",
      "originalTitle": "Martin Lawrence: You So Crazy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["Nl-U_R7VEr8"],
      "plotSummary": "Stand up comedy by Martin Lawrence, filmed in the Majestic Theater in New York City. Martin Lawrence talks about everything from racism, to relationships, to his childhood.",
      "tmdbMovieId": 38129,
      "avgRating": 2.77823,
      "releaseYear": "1994",
      "numRatings": 124,
      "posterPath": "/sXoIo05zEY47L6ICjG0RqiVoDwj.jpg"
   }
}