{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "staatsanwältin",
            "id": 4171
         },
         {
            "name": "cops",
            "id": 8233
         },
         {
            "name": "stakeout",
            "id": 41158
         },
         {
            "name": "police stakeout",
            "id": 155446
         }
      ],
      "imdb_id": "tt0106292",
      "video": false,
      "title": "Another Stakeout",
      "recommendations": [
         10859,
         10694,
         2620,
         11384,
         20242,
         14628,
         26261,
         10631,
         11352,
         11591,
         9873,
         10551,
         12518,
         27224,
         11584,
         11037,
         6472,
         11821,
         11566,
         10407
      ],
      "backdrop_path": "/4bKLQL3mECkUNEtim6u07WPIt8u.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 19,
               "character": "Det. Chris Lecce",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3ed9",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 0
            },
            {
               "cast_id": 18,
               "character": "Det. Bill Reimers",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3ed5",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "A.D.A. Gina Garrett",
               "gender": 1,
               "credit_id": "52fe44f4c3a36847f80b3ed1",
               "name": "Rosie O'Donnell",
               "profile_path": "/76ZWoNK1Fr6gmJUH1zhEBMsT9DT.jpg",
               "id": 12929,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Brian O'Hara",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3ecd",
               "name": "Dennis Farina",
               "profile_path": "/o649nAtUimSZxEV6xa5JbMSgsED.jpg",
               "id": 1117,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Tony Castellano",
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3ee3",
               "name": "Miguel Ferrer",
               "profile_path": "/fvRncqShcaV8R45IJGYZ7IAvrsO.jpg",
               "id": 15860,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Luella Delano",
               "gender": 1,
               "credit_id": "56060bfc92514130640009a3",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Pam O'Hara",
               "gender": 1,
               "credit_id": "56060c0492514130580009ce",
               "name": "Marcia Strassman",
               "profile_path": "/7ZtYDqLLCiqUK4z18H1tKusBQnL.jpg",
               "id": 57418,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "Capt. Phil Coldshank",
               "gender": 2,
               "credit_id": "56060c0cc3a368121b000962",
               "name": "Dan Lauria",
               "profile_path": "/uxJWnRJoSkpGbK882ptdNi2WrtP.jpg",
               "id": 29774,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Maria McGuire",
               "gender": 1,
               "credit_id": "56060c17c3a3681207000b3d",
               "name": "Madeleine Stowe",
               "profile_path": "/jqd70MNVUs3nTbxn3B3G6UNV4Oc.jpg",
               "id": 289,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44f4c3a36847f80b3ea5",
               "name": "Lynn Kouf",
               "profile_path": null,
               "id": 58424,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3eab",
               "name": "Jim Kouf",
               "profile_path": null,
               "id": 21155,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f4c3a36847f80b3eb1",
               "name": "Lynn Kouf",
               "profile_path": null,
               "id": 58424,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3eb7",
               "name": "Jim Kouf",
               "profile_path": null,
               "id": 21155,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3ebd",
               "name": "Frank Morriss",
               "profile_path": null,
               "id": 12419,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3ec3",
               "name": "Arthur B. Rubinstein",
               "profile_path": null,
               "id": 12845,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f4c3a36847f80b3ec9",
               "name": "Roy H. Wagner",
               "profile_path": null,
               "id": 21362,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f4c3a36847f80b3edf",
               "name": "John Badham",
               "profile_path": "/vWzb3cQz4qYtfXQ6qyCrSTw61xA.jpg",
               "id": 12840,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.418033,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9409,
      "vote_count": 74,
      "budget": 0,
      "overview": "Chris and Bill are called upon for their excellent surveillance record to stakeout a lakeside home where a Mafia trial witness is believed to be heading or already hiding. Unlike their earlier _Stakeout_, this time they are accompanied by Gina Garret from the DA's office and her pet rottweiler 'Archie'; their cover, husband and wife with son Bill.",
      "similar": [
         156022,
         2069,
         10651,
         8012,
         769,
         154400,
         7516,
         9679,
         245891,
         241554,
         324542,
         9462,
         2252,
         186,
         238,
         1422,
         9366,
         261023,
         1948,
         155
      ],
      "original_title": "Another Stakeout",
      "runtime": 105,
      "poster_path": "/zDQrp5ZL29j98nOk1SKZENAfYs0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1993-07-22",
      "vote_average": 5,
      "belongs_to_collection": {
         "backdrop_path": "/w8iUdmVdeOIc1AAOJLAu8hEl7g3.jpg",
         "name": "Stakeout Collection",
         "id": 162028,
         "poster_path": "/arVMKLlXLFcROIGB7o8KGeO0kwb.jpg"
      },
      "tagline": "They're on the look out for thrills, action and adventure.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Badham"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Jim Kouf",
         "Jim Kouf"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106292/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3MzEzNzMwNl5BMl5BanBnXkFtZTcwNTI5MjIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Dreyfuss, Emilio Estevez, Rosie O'Donnell | See full cast and crew »"],
      "reviews": [
         "Where to start... I genuinely appreciated Rosie O'Donnels performance in this film. Totally believable. The action scenes were epic, and I think influenced a lot of movies that came after it... specifically buddy cop sequels. The jokes were hilarious and the comedic timing was perfect. It was the first time I've seen a storyline like this in a story about cops. So that was very refreshing for me. Richard Dreyfuss and Emelio Estevez... A duo that you wouldn't expect to see on film... But wow... Total chemistry!! Line after line was just gold for me. I highly recommend this movie. I've told all my friends about it and they agree.",
         "The first time I saw Another Stakeout was on opening night back in 1993. I had just gone through a nasty divorce and was living out of my Saturn. And I was floored by this movie. As the final credits rolled I applauded so loudly and hard that I bruised the bone in my left palm and several movie goers murmured \"He must be drunk...\" I finally stood up and yelled \"You're drunk and stupid if you didn't get this masterpiece.\" I didn't leave the theater and sat there through three more consecutive showings. And I haven't looked back ever since. And with the exception of the one time I had a stroke while watching Another Stakeout and wasn't discovered for two days while I stared at a paused image of Dreyfuss and Estevez, I have enjoyed all 428 times I have seen this movie. This film isn't just funny, action packed and filled with characters we can relate to, it's a world we find ourselves wishing we could live in rather than the dark and nasty one we currently reside in. And though we quote the movie and dress up as characters from it every Halloween the sad truth is that the world doesn't work like Another Stakeout. When you watch someone through a window of their home you don't end up falling in love and there isn't a buddy next to you to crack wise with. The police show up and people yell and cry... Ordinarily I say \"to each his own\" when it comes to opinions about movies, but if you don't like AS 2 then you're not worth a cup of feces with a cigarette butt in it.",
         "\"That's it, nobody calls me Ed McMahon!\" - Emilio Estevez saying the funniest line from a rather dry sequel \"Another Stakeout\" was six years in the waiting. After the first film, \"Stakeout,\" made a huge splash at the box office in 1987 (the same year another cop-buddy film came out--can you guess which one?), everyone anticipated an unnecessary--but perhaps funny--sequel that would inevitably result after box office earnings were tallied up by film executives in an office somewhere. Alas, the six years passed, and we got...this mess? Richard Dreyfuss and Emilio Estevez reprise their roles as stakeout cops who get paired with a new partner in this watered-down sequel. The new partner is played by Rosie O'Donnell, who is so startlingly unfunny in this it almost makes you involuntarily switch off the television as soon as you see her chubby face smiling at you. The story starts with a bang--literally--as a trial witness being protected by the CIA is unsuccessfully assassinated--and by that I mean: They die, she lives. What a surprise. (This is the type of scene where the villain is able to blow up a house but the witness just happens to be taking a stroll outside as it happens--or something like that--preventing her from dying along with the other agents who were previously protecting her. This type of thing was spoofed greatly in the truly underrated \"Last Action Hero.\" It's not a joke in \"Another Stakeout.\") Unfortunately for the United States, the trial witness never returns--she runs away and doesn't let anyone know where she is. Afraid she may be in danger, afraid to lose a star witness, and believing that she might try to contact old friends, the gruff chief of police assigns the unlucky trio of Dreyfuss, Estevez and Donnell to watch the her old pals to see if she turns up. She eventually does, of course, but first we get some painfully unfunny buddy-buddy moments between Dreyfuss and Estevez and O'Donnell. She brings a bunch of clothing and a dog with her. They don't like it. Har-har. This was used a bit better in \"Spaceballs,\" in which Princess Vespa brought along that entire luggage through the desert (remember?). This is just a copy of that scene, minus the punch line. Estevez also shaves his mustache, which is supposed to be a type of sacred moment and is referenced at least ten times throughout the film (he goes to stroke his mustache, he complains about chopping it off, Dreyfuss complains about it, etc.). But for heaven's sake, he's only been in one film so far--we've only seen the mustache once--so a better thing to do would have been this: make a few more sequels and, when the last entry comes, have him shave it off. By then the audience realizes that his mustache is part of him, and that losing it is like losing part of his soul. But I'm glad they didn't make any more than one sequel. One of the things that kept the \"Lethal Weapon\" franchise going was the fresh ideas, fresh buddies, and fresh scripts. (Great actors never hurt an action comedy, either.) The \"Stakeout\" franchise--which didn't even last long enough to spawn more than one sequel--tries to copy this formula but isn't sure how. The introduction of Joe Pesci in \"Lethal Weapon 2\" was great because he thereby became the Third Stooge, whereas O'Donnell's entry into the series is nothing but a humiliating reminder that talk show hosts can't always act in front of a camera and maintain the same type of humor they may (or may not) exhibit on their (awful) TV \"talk show.\" (Which is, by the way, consumed of entirely staged so-called \"interviews.\") And whereas Pesci, as Leo Getz, added a type of silly vibe to the \"LW\" series, O'Donnell just seems like a carbon copy clone of Estevez from the first \"Stakeout.\" Dreyfuss didn't like him at first, and--guess what--they suddenly became best buds. The same thing happens in the sequel, much to the audience's chagrin. Of course, \"Lethal Weapon\" and its sequels were never more than a few years apart (the first coming out in 1989, two years after the original). But \"Stakeout\" had six years to make a respectable sequel, and it fails. It fails the same way that many prolonged sequels do. But, for once, it's not because the audience has forgotten the original film--it's because the audience is fed up with the same routine. The film was directed by John Badham, which is surprising, since he's a talented director (\"Saturday Night Fever,\" \"The Hard Way,\" \"Stakeout\"). Here he jumps through all the hoops, turning his own series into a pale retread of the original--only watered down: minus the violence, language, nudity, and humor. I'm not saying a movie has to be R to be funny. But if you've got a sequel to an R-rated movie like \"Stakeout\" and you decide to turn its sequel into a cutesy-tutesy children's entertainment program, you'd better advise the audience before they sit down expecting something funny and fresh. What a disappointment. 2/5 stars. - John Ulmer",
         "Having just seen \"Another Stakeout\" for the first time since 1995, I decided to check out the online info about the locations that were used in the movie and, so far, haven't seen any credit given for the island off the BC coast where most of the filming was done. It was filmed on beautiful Bowen Island, a 15 minute ferry trip from Horseshoe Bay, just to the northwest of Vancouver. The initial scenes involving driving off the ferry were done in Snug Cove (they substituted the name 'Bainbridge Island'), and most of the exterior and interior shots were on the south side of the island in an area called Fairweather where, as you saw or will see in the film, the homes are gorgeous and perfectly suited for the plot (however meager you thought it to be). I've seen a number of comments about the filming having been done on an island in Puget Sound. A lot was shot in Seattle, but the majority was on Bowen Island - I should know - I was living there at the time. Just thought I'd set the record straight. (You can see the homes used for filming clearly on Google Earth, if you're interested.)",
         "Before we get started, a little caveat for the reader: this may not be the easiest film to find. Your standard video rental outlets will be hit or miss, as well as libraries. Your best bet will be an online rental service or a strong and fervent prayer. But if you ask me, it is worth it. You may also be scratching your head at the biographical information above. Why should you care about a 1993 sequel to a forgettable buddy cop flick? Simple. It is a great film. Not only has it obviously influenced many contemporary films, but it also trumps these films on a variety of levels. Allow me to elaborate\u0085 Prior to Another Stakeout, John Badham made a handful a good films (Wargames, Short Circuit). Shortly thereafter he helmed an unfortunate number of Hollywood films (American Flyers, Point of No Return) that may be considered guilty pleasures at best. He was also called upon by fellow director Peter Jackson to head up the second unit on all three Lord of the Rings films but declined. So what is the point of this little history lesson? Hollywood kills good directors (John Woo and Sam Raimi, prime examples). But, I digress. Despite the a lackluster couple of decades, John Badham does have a grand if only marginally well known legacy in Another Stakeout. Science fiction and horror fans will recognize and appreciate the premise; Detective Chris Lecce (Richard Dreyfuss) wakes up one day, goes through the motions like any and every other day, and slowly realizes that he is, inexplicably, on another stakeout. The scenario plays out basically as is expected but it is the manner of the presentation and plotting that make it remarkable. The film ultimately has only three characters, whose dynamic, touches on Alfred Hitchcock and Shakespeare without any pretense. Chris' subtle and deliberate decline into the reality of his new position in the world leads to him swinging from disbelief to depression to mania to megalomania to acceptance and back to disbelief. The storytelling and character interaction allow for empathy without distraction and the science fiction elements are beautifully woven into the fabric of the drama so that the one doesn't overshadow the other. There are several mysteries involved in the story that are revealed with wonderful precision by the director through a series of well placed flashbacks and the subtlety of mood and movement, but you'll have to find the film and watch it to understand the full glory. This is not a flashy film. It is however a master stroke. It is unfortunate that this film has all but vanished into obscurity, along with its director but they both still exist and there's always a second wind. Always.",
         "Director John Badham created a classic in the \"buddy action\" genre when he directed the original \"Stakeout\". He blended gritty cop drama with fun action sequences, romance, and humor resulting in a unique and entertaining cinema experience. So what to do in the sequel? Badham wisely chose to make \"Another Stakeout\" it's own movie and not just a clone of the original. Had he simply remade the first movie the sequel probably would have been successful but soon forgotten about. Instead, the filmmakers go a different route. They downsize the action, grit, and romance while focusing on the humor. The three leads from \"Stakeout\" (Richard Dreyfus, Emilio Estevez, and Madeline Stowe) all return in this film. But this time around they are joined by funny lady Rosie O'Donnell. Madeline Stowe and the whole relationship storyline from the original take a back seat in this one. Even Estevez' role is trimmed down. This movie belongs entirely to Dreyfus and O'Donnell. The story here is pretty unimportant, but we will review it briefly. Bad guys are trying to silence an important witness played by Cathy Moriarty. Their plans to kill her fail but she disappears during the attempt. Cops Richard Dreyfus and Emilio Estevez are assigned to find the witness and stop the bad guys. They are joined by Assistand District Attorney Rosie O'Donnell. They take off to the mountains and rent a house in order to spy on Dennis Farina and Marcia Strassman in order to stop the bad guys. That is just about the entire story here. But the thin storyline is simply a premise for Dreyfus and O'Donnell to show off their comedic skills. And they come through in a big way. Everything in the film is built around humor, even the action scenes. For example, an early action sequence involving the chase for a murder suspect ends in tragedy. The suspect is killed by a witness with Dreyfus' gun. During this dramatic moment, Dreyfus looks down at his holster to see that his gun has been replaced by a dead fish. This is not a serious movie. It's a fun one. In the first movie, Badham's taut direction and thrilling action sequences took center stage. This time, the director let's Dreyfus and O'Donnell, along with some stunning cinematography, guide the film. The result is a non-complicated and fun movie that everyone can enjoy.",
         "I've not seen the original movie so I don't know how this sequel compares in comparison, but on it's own merits, 'Another Stakeout' isn't too bad and actually quite enjoyable, despite Rosie O'Donnell getting on my nerves throughout. Richard Dreyfuss & Emilio Estevez play DET.Chris Leece & DET.Bill Reimers respectively and are joined by 'comic-relief' Assistant D.A Gina Garrett played by the universally annoying Rosie O'Donnell along with her Rottweiller pet dog as all three are staking out a lakeside home on a remote Island, where a Mafia trial witness is supposed to be going to, so as cover they pretend to be Husband,Wife & son with 'hilarious' results.... The comedy is absolutely dire and does jar with the occasional bouts of violence. co-starring Dennis Farina & Miguel Ferrer all in all not a great film by any means but worth watching if you've nothing better to do *** out of *****",
         "Reading others comments on Another Stakeout, I can't believe we watched the same film. It is one of our family's favorite movies. It's not deep or meaningful, but when you talk about sheer comedic genius while at the same time having a well-paced drama, with some of the best performances I've seen from these actors, well, we call this one a winner. While not quite The Fugitive, it has the same sense of story, suspicion and climax. Yes, the explosion is a bit over-the-top (viewed several times from different angles) but the bad guy is really bad, and the good guys really hilarious. Rosie O'Donnell gives, imho, a FABULOUS performance, and the dog is such a perfect touch! My favorite scene? \"No, Archie...not the bunny Archie...\" and then her warbled scream...perfection. I think those who said nasty things just don't appreciate some other aspect of her life, as it's certainly not her acting ability. The cops are wonderful, and the lines so funny you'd swear most of it is ad-lib. Take my advice if you're in the mood for something dramatic, but funny...this is it. When we get together during those rare times now when our entire family is together, it's the one film we can count on that everyone will like, and we've all seen it at least thirty times. Not for kids under about 13 without adult supervision, in my opinion.",
         "Don't ask me why but when I was younger I would often watch this movie and the first one; \"Stakeout\". Of those two movies this is the one that has always stayed most in my mind. Basically this movie is just great entertainment. Like all those type of movies from that period there isn't much to the story and the movie is all about its characters and actors playing them. Compare it to the 'Lethal Weapon' movies, minus all of the action. This movie does have some fine characters and actors portraying them. Even better is the chemistry they all have. Richard Dreyfuss form Emilio Estevez a great 'buddy' cop duo and Rosie O'Donnell is also a fine addition to the two, basically since she is such a fine comedy actress. It also sort of makes you wonder why Richard Dreyfuss hasn't appeared in more comedy roles. He obviously has the talent and certainly the right timing for it. Guess he better wants to be remembered as a 'serious' actor and who can really blame him for that. The movie further more features Dennis Farina, Miguel Ferrer and Madeleine Stowe. The movie is filled with some great comedy moments. that mostly, again, work out due to the characters and actors of the movie. The movie has some guaranteed laughs and make this a perfect typical 'no worries' movie. Just sit back and enjoy watching it! It also shows that John Badham is actually a fine genre director! The timing is great and the pace, editing and positioning all make sure that the comedy in the movie works out even better. It's too bad that the story just mostly distracts from the movie and its humor. It's just not anything solid, interesting or something that hasn't been done before. But then again, this is all quite typical for the genre and time period it was made in. Basically if you enjoyed one or more of the 'Lethal Weapons' movies, you'll surely enjoy this movie as well. Guess the movie could had impressed some more by putting in some more and bigger action. The movie now feels quite simple and cheaply made at times, which at times becomes distracting but overall doesn't take away any of the fun of the movie. Great entertainment! 8/10 http://bobafett1138.blogspot.com/",
         "This belated sequel to the Box-office hit 'Stakeout' 6 years earlier is not bad - it's lifted by the performances of returning stars Richard Dreyfuss and Emilio Estevez (What happened to him?) But this time round the plot is lame to the extreme and the jokes fall flat time and time again making this movie about as funny as Scary Movie 2, and the casting of Rosie O'Donnell was a big mistake. Stakeout (1987) U.S BOX OFFICE $65,000,000 This movie just scraped over the $20,000,000 mark and you can see why. If there's nothing else on TV - I do recommend a watch but don't be surprised if you looking at the OFF switch after the first 30 Minutes My Rating 7/10"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Stakeout II Productions",
         "Kouf/Bigelow Productions"
      ],
      "summaries": [
         "Chris and Bill are called upon for their excellent surveillance record to stakeout a lakeside home where a Mafia trial witness is believed to be heading or already hiding. Unlike their earlier _Stakeout_, this time they are accompanied by Gina Garret from the DA's office and her pet rottweiler 'Archie'; their cover, husband and wife with son Bill.",
         "A witness against the Mafia is being secretly held till the trial when a violent attempt against her is made that kills several of her guards. She disappears and Bill and Chris are sent to another stakeout. This one is arranged by the D.A.'s office and comes with Gina (and her pet Rottweiler) who is to keep an eye on them since the observation post is a vacation resort community in the home of a judge. Bill and Chris are annoyed and are every bit as childish as before.",
         "When a woman who's suppose testify against the mob is placed in protective custody. However a mob hit man finds the safe house and blows it up. The woman's body is not found. Now the D.A. tries to find her so he ask the cops to keep an eye on all the places she could go. And one of these places is in Seattle so Detectives Chris Lecce and Bill Reimers are sent to cover the place and accompanying them is A.D.A. Gina Garrett. And the three of them pretend to be a family.",
         "Prankster cops Chris and Bill are joined by a Gina from the DA's office to stakeout a lakeside home."
      ],
      "budget": 0
   },
   "movielensId": 415,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-07-22",
      "dvdReleaseDate": "2002-08-13",
      "directors": ["John Badham"],
      "runtime": 105,
      "movieId": 415,
      "title": "Another Stakeout",
      "mpaa": "PG-13",
      "actors": [
         "Richard Dreyfuss",
         "Emilio Estevez",
         "Rosie O'Donnell",
         "Dennis Farina",
         "Miguel Ferrer",
         "Cathy Moriarty",
         "Marcia Strassman",
         "Dan Lauria",
         "Madeleine Stowe"
      ],
      "imdbMovieId": "0106292",
      "originalTitle": "Another Stakeout",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["td96S3aGqBQ"],
      "plotSummary": "Chris and Bill are called upon for their excellent surveillance record to stakeout a lakeside home where a Mafia trial witness is believed to be heading or already hiding. Unlike their earlier _Stakeout_, this time they are accompanied by Gina Garret from the DA's office and her pet rottweiler 'Archie'; their cover, husband and wife with son Bill.",
      "tmdbMovieId": 9409,
      "avgRating": 2.81461,
      "releaseYear": "1993",
      "numRatings": 3312,
      "posterPath": "/zDQrp5ZL29j98nOk1SKZENAfYs0.jpg"
   }
}