{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "wild west",
            "id": 155573
         },
         {
            "name": "blonde woman",
            "id": 155658
         },
         {
            "name": "fast draw",
            "id": 168405
         },
         {
            "name": "tough  girl",
            "id": 168406
         },
         {
            "name": "gun fu",
            "id": 168416
         },
         {
            "name": "pistol duel",
            "id": 168418
         },
         {
            "name": "small western town",
            "id": 168422
         }
      ],
      "imdb_id": "tt0109198",
      "video": false,
      "title": "Bad Girls",
      "recommendations": [
         10859,
         9409,
         10694,
         9057,
         918,
         4954,
         44968,
         12280,
         9625,
         26337,
         4823,
         26261,
         12661,
         10057,
         2612,
         10337,
         10551,
         47608,
         10433,
         12278
      ],
      "backdrop_path": "/1gN0lrzk9IpMMX1qbHjFchbYe8I.jpg",
      "revenue": 15240435,
      "reviews": [{
         "author": "John Chard",
         "id": "589d3b179251412cc30025d8",
         "content": "Gunslingerettes line up for the atrocity exhibition.\r\n\r\nBad Girls is directed by Jonathan Kaplan from a screenplay by Ken Friedman and Yolande Turner. It stars Madeleine Stowe, Mary Stuart Masterson, Andie MacDowell and Drew Barrymore. The plot sees the four girl actors playing prostitutes on the run following a justifiable homicide and a hanging escape. Suffice to say that they get into scrapes & double crosses whilst being pursued by the Pinkerton's.\r\n\r\nBeing asked to suspend disbelief is one thing, being force fed drivel masquerading as pro-feminism is entirely another. Bad Girls is a mess of a movie, an insult to the Western genre, the fans of the lady actors, to the lady actors themselves; who simply deserve much much better and arguably worst of all; to women in general. The script is laughable, serving only as an excuse for the gals to sling those guns and hips when possible, and be abused and saved by \"men\", while the plotting is by the numbers as everything falls into place readily. There's even slow-mo shots where they serve no purpose of enhancement. Throw into the mix that three of ladies look nothing like on the run outlaws, all shine and span and make up with nice hair (Masterson the exception as she has a modicum of believability about her), well it's rather a depressing experience all told. Sure, as a red blooded guy I'm not going to be turned off by Barrymore's shapely thighs adorned in white stockings, or Stowe's truly gorgeous face, but when the highlights of a \"girl\" Western is something that's only aesthetically sexy for men, then they clearly have got it wrong.\r\n\r\nSo what's the justification for it being so bad? Well the back story offers up the answer. Film was meant to be directed by a woman, Tamra Davis (erm-Billy Madison & Crossroads), but she was jettisoned a couple of weeks into production. The plan with Davis at the helm was for it to be a Western told from a female point of view. However, Kaplan (The Accused/Unlawful Entry) was brought in quickly and the screenplay rewritten in a hurry. And boy does it show. Technically it's a duffer too, Jerry Goldsmith's score is cheap in texture and Jane Kurson's editing is choppy to say the least. There's no eye catching cinematography (Ralf D. Bode), while the acting away from the script hindered girls (ie: the men), is either a waste of time them being in it (Nick Chinlund) or badly directed (James Russo). While Dermot Mulroney seems only to exist as being a link to Young Guns; the \"boy\" version that this is clearly trying to ride the coat tails in on. If you want a good Western about the girls fighting the good fight then seek out George Marshall's 1957 film The Guns Of Fort Petticoat. It's a fun movie that at least has believable women fighting back under duress. Bad Girls, tho, is just bad in every department. 2/10",
         "url": "https://www.themoviedb.org/review/589d3b179251412cc30025d8"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cody Zamora",
               "gender": 1,
               "credit_id": "52fe44939251416c75039a81",
               "name": "Madeleine Stowe",
               "profile_path": "/jqd70MNVUs3nTbxn3B3G6UNV4Oc.jpg",
               "id": 289,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Anita Crown",
               "gender": 1,
               "credit_id": "52fe44939251416c75039a85",
               "name": "Mary Stuart Masterson",
               "profile_path": "/jQLmmJWumj0MsxE2DjvMHbf5ysz.jpg",
               "id": 31140,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Eileen Spenser",
               "gender": 1,
               "credit_id": "52fe44939251416c75039a89",
               "name": "Andie MacDowell",
               "profile_path": "/znSR45ZcNNlb1sNP1gYmVACYI2a.jpg",
               "id": 1533,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lily Laronette",
               "gender": 1,
               "credit_id": "52fe44939251416c75039a8d",
               "name": "Drew Barrymore",
               "profile_path": "/y8GKPHsBXVGIGBdDzdNxjm0IbKF.jpg",
               "id": 69597,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Kid Jarrett",
               "gender": 2,
               "credit_id": "52fe44939251416c75039ab5",
               "name": "James Russo",
               "profile_path": "/tV4X0uEuqu6XYml3yEs9rsG9EzW.jpg",
               "id": 785,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "William Tucker",
               "gender": 2,
               "credit_id": "52fe44939251416c75039ab9",
               "name": "James Le Gros",
               "profile_path": "/rqBjmSkcRGwtwpb2tTjGcqLtKyG.jpg",
               "id": 6474,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Frank Jarrett",
               "gender": 2,
               "credit_id": "52fe44939251416c75039abd",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Josh McCoy",
               "gender": 2,
               "credit_id": "52fe44939251416c75039ac1",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Pinkerton Detective Graves",
               "gender": 2,
               "credit_id": "52fe44939251416c75039ac5",
               "name": "Jim Beaver",
               "profile_path": "/6CVkwZqhAU8X8mYWUwMk4x30tq4.jpg",
               "id": 29862,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44939251416c75039a93",
               "name": "Charles Finch",
               "profile_path": null,
               "id": 58047,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44939251416c75039a99",
               "name": "Ken Friedman",
               "profile_path": null,
               "id": 6912,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44939251416c75039a9f",
               "name": "Jonathan Kaplan",
               "profile_path": "/sv953vXFS4YD5BZ4GBjrSWQsiMW.jpg",
               "id": 42171,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44939251416c75039aa5",
               "name": "Ralf D. Bode",
               "profile_path": null,
               "id": 25212,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44939251416c75039aab",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44939251416c75039ab1",
               "name": "Jane Kurson",
               "profile_path": null,
               "id": 6900,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 6.934885,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11853,
      "vote_count": 84,
      "budget": 0,
      "overview": "Four former harlots try to leave the wild west (Colorado, to be exact) and head north to make a better life for themselves. Unfortunately someone from Cody's past won't let it happen that easily.",
      "similar": [
         281957,
         3134,
         357096,
         264656,
         979,
         2652,
         8456,
         588,
         238636,
         156022,
         281,
         395834,
         9093,
         45569,
         291356,
         445954,
         133805,
         6312,
         9654,
         364
      ],
      "original_title": "Bad Girls",
      "runtime": 99,
      "poster_path": "/eaGOVOI4BZG7xFOzMdDpfAhDOWJ.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ruddy Morgan Organization, The",
            "id": 89311,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-04-22",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "It was a dangerous time to be a woman. And a good time to have friends.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Kaplan"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Albert S. Ruddy",
         "Charles Finch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109198/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTE4ODIwMzU0MF5BMl5BanBnXkFtZTcwNjgyOTcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Madeleine Stowe, Mary Stuart Masterson, Andie MacDowell | See full cast and crew »"],
      "reviews": [
         "Agreed, the acting could have been a bit less melodramatic but the actresses concerned did a good job when they weren't looking like supermodels. The trick about it was \"they had to look good\" and they did look good. Madeleine Stowe's \"Cool Cody\", Andie McDowell's Elegant Eileen, Mary Stuart Masterson's \"Arch Anita\", and Drew Barrymore's tomboyish \"Li'l Lilly\", were fetching and gave rise to Girl Power credence. I couldn't take my eyes off Barrymore who had come a long since E.T. and her drug/alcohol fuelled periods of teen angst/pain. The fight at the end in the corral blew me away, those girls proved they could outshoot anything on two legs!!! There should be a sequel!!! 4 out of 5",
         "Jonathan Kaplan's Bad Girls leaves an interesting taste in my mouth. It is an energetic and fun film, offset by its ridiculous characters and plot. The believability factor in this flick is low, which encourages its audience to view it as a swirling maelstrom of metaphor and symbol. Woman, as defined by the early 90's, can overcome any impediment and still be beautiful, no need to become manly (and lose her femininity) to assert herself. The Western genre serves as a perfect tableau for this discourse because it is one traditionally dominated by men. Likewise, the men in Bad Girls each represent an institution of American culture that is dominated by men and their mentality, conveniently dispatched by the bad girls. Four whores raise hell by killing a Colonel and running out of town, complete with unnecessary slow motion of Drew Barrymore shouting \"heeyah!\" and the humiliation of every man who crosses their path. The military, traditional justice, and Christianity are trampled upon, left wondering how these motivated and hard working women could escape their clutches. The film from here takes some twists and turns, and several complete circles. In short, the whores chase a dream of establishing a home for themselves around a mill that Mary Stuart Masterson's late husbands owned, countering the murderous advances of men with their own sexual flaunting. Gunfights, smarmy dialogue, pseudo-lesbianic encounters, and female flesh fill the film to to a near bursting capacity, much like Barrymore's bosom. It is not what I would call a smart film, however it does present itself as an interesting fable about the empowerment of women by women who remain women. I would liken Bad Girls to that of the Freudian dreams of those who struggle against \"the man.\" I feel that it deserves to be seen at least once.",
         "Best expression of women in westerns I have seen so far. This eclipses the Sharon Stone film The Quick and the Dead. The latter film softens the lead character by making her survival depend wholly on the Russel Crowe character. In Bad Girls Madeline Stowe eats up the dust on the west and shows a no nonsense gunslinger that has been rare since the Man With No Name hit his stride with a trilogy of spaghetti westerns that made Clint Eastwood a universal star. I can hardly ignore the great cinema style and the substance of this movie that transcends the gender of it's hero. Make no mistake about it this is Stowe's movie to win or lose and she comes away having broke the bank at Monte Carlo. See it with open eyes if you like westerns. If you don't see something else as this will surely disappoint. It is a western all the way.",
         "When I pick a movie to watch there are four elements that draw me to it. The cast, the story line, excitement and most of all I want the movie to be fun to watch. Bad Girls incorporates all four of these elements. The story centers on four former saloon prostitutes who are on the run after one of them shoots and kills a prominent citizen of Echo City. The four girls, Cody Zamora played by Madeleine Stowe, Anita Crown, played by Mary Stewart Masterson, Eileen Spencer played by Andie MacDowell and Lilly Laronette played by Drew Barrymore are great together. The story line may not be totally accurate from a historical standpoint but the action and acting are good and more than make up for whatever may be wrong. For me the story was more about the relationship that existed between the four girls without going over the line and making it sexual. For me, Bad Girls was a winner.",
         "I really liked this movie because I love horses and I like the actors in this movie. The storyline is simple and it is a great action chick flick. It has humor, adventure and a great overall girl bonding feel to it. It is the story of four friends who work in a parlor house who find themselves getting into trouble and having to go on the run. It is a story of the depth of friendship, strength, starting over, finding love and fighting back. Who said women can't kick some butt. A real feel good movie that is great to watch on a rainy Sunday afternoon. I would recommend adding this movie to one's movie collection. This is one movie where women are the heroes of the movie.",
         "Bad Girls is directed by Jonathan Kaplan from a screenplay by Ken Friedman and Yolande Turner. It stars Madeleine Stowe, Mary Stuart Masterson, Andie MacDowell and Drew Barrymore. The plot sees the four girl actors playing prostitutes on the run following a justifiable homicide and a hanging escape. Suffice to say that they get into scrapes & double crosses whilst being pursued by the Pinkerton's. Being asked to suspend disbelief is one thing, being force fed drivel masquerading as pro-feminism is entirely another. Bad Girls is a mess of a movie, an insult to the Western genre, the fans of the lady actors, to the lady actors themselves; who simply deserve much much better and arguably worst of all; to women in general. The script is laughable, serving only as an excuse for the gals to sling those guns and hips when possible, and be abused and saved by \"men\", while the plotting is by the numbers as everything falls into place readily. There's even slow-mo shots where they serve no purpose of enhancement. Throw into the mix that three of ladies look nothing like on the run outlaws, all shine and span and make up with nice hair (Masterson the exception as she has a modicum of believability about her), well it's rather a depressing experience all told. Sure, as a red blooded guy I'm not going to be turned off by Barrymore's shapely thighs adorned in white stockings, or Stowe's truly gorgeous face, but when the highlights of a \"girl\" Western is something that's only aesthetically sexy for men, then they clearly have got it wrong. So what's the justification for it being so bad? Well the back story offers up the answer. Film was meant to be directed by a woman, Tamra Davis (erm-Billy Madison & Crossroads), but she was jettisoned a couple of weeks into production. The plan with Davis at the helm was for it to be a Western told from a female point of view. However, Kaplan (The Accused/Unlawful Entry) was brought in quickly and the screenplay rewritten in a hurry. And boy does it show. Technically it's a duffer too, Jerry Goldsmith's score is cheap in texture and Jane Kurson's editing is choppy to say the least. There's no eye catching cinematography (Ralf D. Bode), while the acting away from the script hindered girls (ie: the men), is either a waste of time them being in it (Nick Chinlund) or badly directed (James Russo). While Dermot Mulroney seems only to exist as being a link to Young Guns; the \"boy\" version that this is clearly trying to ride the coat tails in on. If you want a good Western about the girls fighting the good fight then seek out George Marshall's 1957 film The Guns Of Fort Petticoat. It's a fun movie that at least has believable women fighting back under duress. Bad Girls, tho, is just bad in every department. 2/10",
         "This is actually a fairly handsomely mounted and rather traditional western, if it wasn't for the unrelenting glamorousness of the protagonists. Even when they are dirty, you get the impression that it's designer dirt. But that's OK, because the glam factor is one of the things which sells this western. It sure isn't the story, because there are few surprises (although, to be fair, there are a couple of moments which aren't entirely expected). The confusing thing is that the movie is resolutely feminist, yet trades on the very un-feminist element of hot chicks. I suppose this enables it to appeal to two apparently contradictory demographics. The movie is a romp, which makes it a touch puzzling that Madelyn Stowe plays it very straight and serious. But, taking everything into consideration, it is entertaining, undemanding, and easy on the eyes.",
         "When the prostitute Cody Zamora (Madeleine Stowe) shoots a military man in self defense and is about to be hanged, she is rescued by her three companions (Masterson, Barrymore, MacDowell). They want to leave for Oregon, but are pursued by Pinkerton agents and their paths cross with Kid Jarrett, the local thug, and his mob. The movie itself is pretty fine; the problem is that it appeared too late. After such landmarks as \"Unforgiven\", or even \"Dances With Wolves\" - not to mention the classic antiwesterns of the 1960s and 1970s - a western which is nothing more but a pure entertainment appears somewhat empty and unfocused. Also, it is somewhat underwritten: the good chicks are individualised, clean and smart, the bad guys are a mass of dirty, drunken, constanly sinisterly laughing, idiotically-behaving, stereotypical villains. In the 90s? please! The movie could have worked as a tribute to classic old westerns, but what worked fine in the case of \"Silverado\" is here neglected - sadly, because this would significantly improve the picture. All in all, not a bad movie - just nothing new and original. 5/10",
         "This movie is pretty silly. The plot is laughably obvious, although there is a bit of interest at the end. It's cute though because the female outlaws are so perky. The leading ladies are ex-prostitutes who want to run their own ranch. One of them has a deed to some land, but en route to where they're going, they get involved accidentally with a robbery. The plot gets more unbelievable from there. This is a good movie if you're looking for a grin. Don't expect high action or compelling drama.",
         "Are the four titular lead women really all that bad in Jonathan Kaplan's 1994 Western thriller Bad Girls? Perhaps it's the nature of what they do lined up against what's expected of them that makes them so \"bad\", that is to say, putting their necks on the line and obliterating whatever male dominated spectrum exists within the world they occupy as they strive for independence and individualism. Perhaps that's what makes them bad, the fact that they refuse to roll over for the majority of the men in the film and act like good little whores suitable to be looked at but nary heard. The titular girls do kill people, but most certainly in self-defence; they fight and they battle away, but do so against fair degrees of sexism; they're on the run, but their running is purely a result of pent-up rage and sustained marginalisation. As it happens, Bad Girls is a guilty romp through a west you couldn't really entitle \"wild\" about four gals just wanting a 'straight' American dream infused life but having to fight both misogyny and false charges brought against them along the way. The film covers the misadventures of a handful of women in pre-20th Century America, the ringleader and toughest of the lot of whom is Madeline Stowe's Cody Zamora; a woman nary afraid to stand up to men nor those lecherous and out to harm either herself or one of her kind, evident when we observe her react with violence to a patron's over exuberance at sampling the services of Drew Barrymore's Lilly Laronette. Stowe's reaction lands her in some seriously hot water, the death sentence carrying with it an air of disenchanted inevitability about it in that Zamora stands before the gallows on account of preventing the elderly man from having his way rather than defending a girl from rape. After a straight faced Zamora demands the execution party \"gets on with it\", her three accomplices, with whom she has been working most of her life and will spend the majority of this film with, bound out of the wilderness and save both the day and Stowe's neck before charging off with her in tow. Fugatives to the law, Zamora; Laronette; Andie MacDowell's Eileen Spenser and Mary Stuart Masterson's Anita Crown hole up out of town after a verbal demonisation from those back at the party point out they are both the enemies of the people, religion and all things righteous. What transpires from this is effectively a weak rendition of 1992's Unforgiven, only minus Eastwood's character and Freeman's character; a tale about strong natured prostitutes maltreated but then themselves consequently being the ones whom go on the run as it's they whom are additionally stalked by a pair seeking their own brand of justice. Those men are two Pinkerton Marshals named O'Brady (Chinlund) and Graves (Beaver), men hired to track them down in this sprawling road movie of sorts and bring them to justice as the girls themselves attempt to get on with a more honourable way of living: the allure of opening a saw mill in far off anywhere appearing particularly appealing. The film has fun with placing women at the forefront of its plot, allowing its lead characters to charm; trick and seduce their way out of tight spots and usually into tighter ones when they require some money rather than to throw around weight they do not have as might have been the case had male characters driven the film. The film isn't without flaw; its goofiness encapsulated by the fact each of these girls maintains a relatively photogenic look throughout, not once the years of abuse nor the results of their previous line of work really worming its way into either of their expressions nor overall demeanour and thus holding the film back from being the grittier tale it might have been. As time had passed and the four of them worked at that seedy tavern, each of them appeared to master the fine art of gunslinging and sharpshooting; Zamora managing to make best-friends/worst-enemies with a certain Kid Jarrett (Russo), a bandanna sporting low life thief with a small army of bandits whom waltzes around with a belt of bullets around his ribs, along the way. The chase element is surprisingly effective, a love plot to do with a young man named Josh McCoy (Mulroney) whom becomes mixed up in things, or more specifically Laronette, daft as it is good natured; a later sequence featuring this additionally consistent, in an unrealistic manner, photogenic young cowboy arriving to save his dame on horseback out of a dynamite caused cloud of smoke, suit of armour all that is missing, rather ridiculous but then spun around when it is he whom needs the collective power of the four women to save his own life. There's a glum and rather seedy sub-plot to do with Jarrett and his past-involvement, romantically, with Zamora which doesn't quite sync up with the rest of the film's boisterous tone of romp and circumstance; while Laronette's own swiping from the rest of the crew feels a little preordained, or more obligatory than is desired, since it is she who is the youngest of the four titular bad girls and it is she whom must then where the little dress her captors have lined up for her. You additionally feel their treatment of her might have been a little more sordid than it actually is, but a ruthless sticking to the overall tone of the film demands a watered down version of whatever might have happened in the real wild west; the taking of Laronette the result of Barrymore's sexuality when compared to the other three than that of any realistic plot driven reasons or mechanics. Flaws and frustrations aside, and there are a glowing number, Bad Girls is a daft but enjoyable frolic through hazy female empowerment and both action and western genre demands but done in a relatively fetching manner."
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Ruddy Morgan Productions"
      ],
      "summaries": [
         "When saloon prostitute Cody Zamora rescues her friend Anita from an abusive customer by killing him, she is sentenced to hang. However, Anita and their two friends Eileen and Lilly rescue Cody and the four make a run for Texas, pursued by Graves and O'Brady, two Pinkerton detectives hired to track them. When Cody withdraws her savings from a Texas bank, the women believe they can now start a new life in Oregon. But Cody's old partner Kid Jarrett takes Cody's money when his gang robs the bank, and so the four so-called \"Honky- Tonk Harlots\" set out to recover the money, with the Pinkertons hot on their trail.",
         "Four prostitutes join together to travel the Old West."
      ],
      "budget": 0
   },
   "movielensId": 416,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1994-04-22",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Jonathan Kaplan"],
      "runtime": 99,
      "movieId": 416,
      "title": "Bad Girls",
      "mpaa": "R",
      "actors": [
         "Madeleine Stowe",
         "Mary Stuart Masterson",
         "Andie MacDowell",
         "Drew Barrymore",
         "James Russo",
         "James Le Gros",
         "Robert Loggia",
         "Dermot Mulroney",
         "Jim Beaver"
      ],
      "imdbMovieId": "0109198",
      "originalTitle": "Bad Girls",
      "genres": [
         "Romance",
         "Western"
      ],
      "youtubeTrailerIds": ["7b69nY28Rkk"],
      "plotSummary": "Four former harlots try to leave the wild west (Colorado, to be exact) and head north to make a better life for themselves. Unfortunately someone from Cody's past won't let it happen that easily.",
      "tmdbMovieId": 11853,
      "avgRating": 2.70655,
      "releaseYear": "1994",
      "numRatings": 1847,
      "posterPath": "/eaGOVOI4BZG7xFOzMdDpfAhDOWJ.jpg"
   }
}