{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "barcelona spain",
            "id": 107
         },
         {
            "name": "navy",
            "id": 3588
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0109219",
      "video": false,
      "title": "Barcelona",
      "recommendations": [
         25985,
         32636,
         117233,
         106222,
         63443,
         28614,
         23333,
         48862,
         40562,
         97406,
         45174,
         20471,
         46280,
         88052,
         38244,
         55372,
         47059,
         253277,
         94666,
         82432
      ],
      "backdrop_path": "/ag09uIgXBXCoV5FgnRNh2RWw3Cb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ted Boynton",
               "gender": 2,
               "credit_id": "52fe46ea9251416c75087b77",
               "name": "Taylor Nichols",
               "profile_path": "/yls98pv22GPdHpUF8U4uZJydyef.jpg",
               "id": 4944,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Fred Boynton",
               "gender": 2,
               "credit_id": "52fe46ea9251416c75087b7b",
               "name": "Chris Eigeman",
               "profile_path": "/4JXp2loLNrssBipfrvnhmXfhcaz.jpg",
               "id": 78190,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marta Ferrer",
               "gender": 1,
               "credit_id": "52fe46ea9251416c75087b7f",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Montserrat Raventos",
               "gender": 1,
               "credit_id": "52fe46ea9251416c75087b89",
               "name": "Tushka Bergen",
               "profile_path": "/5ok6xYGHpx2Bv0raKiXdj6bEZnY.jpg",
               "id": 65058,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Ramone",
               "gender": 2,
               "credit_id": "52fe46ea9251416c75087b8d",
               "name": "Pep Munné",
               "profile_path": "/90gcn8bhvGFSHTyV9vV8uvJYl2e.jpg",
               "id": 16950,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ea9251416c75087b73",
               "name": "Whit Stillman",
               "profile_path": "/9LXExrWE8yOxvbUYFzP6mkF56IG.jpg",
               "id": 78188,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ea9251416c75087b85",
               "name": "Whit Stillman",
               "profile_path": "/9LXExrWE8yOxvbUYFzP6mkF56IG.jpg",
               "id": 78188,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.940778,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16771,
      "vote_count": 22,
      "budget": 3200000,
      "overview": "During the 1980s, uptight Ted Boynton is a salesman working in the Barcelona office of a Chicago-based company. He receives an unexpected visit from his cousin Fred, a naval officer who has come to Spain on a public relations mission for a U.S. fleet. Not exactly friends in the past, Ted and Fred strike up relationships with women in the Spanish city and experience conflicts -- Ted with his employer, and Fred with the Barcelona community.",
      "similar": [
         11564,
         4771,
         339692,
         507,
         2142,
         429733,
         3134,
         8012,
         948,
         8810,
         298312,
         11798,
         14433,
         6075,
         141,
         185,
         979,
         101,
         205,
         627
      ],
      "original_title": "Barcelona",
      "runtime": 100,
      "poster_path": "/ykfnXaAvepoUeGpDlqQTLAcTjjr.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Barcelona Films",
            "id": 16737,
            "origin_country": ""
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         }
      ],
      "release_date": "1994-07-29",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Americans. Anti Americans. In Love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Whit Stillman"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Whit Stillman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109219/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MTkxODI1N15BMl5BanBnXkFtZTcwODU3ODgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Taylor Nichols, Chris Eigeman, Tushka Bergen | See full cast and crew »"],
      "reviews": [
         "There are people in this world who think \"Barcelona\" is just a film about soft-living, navel-gazing preppies with perfect hair and term-paper vocabularies. These are the same people who like Vinyl Hampton music. What's not to love about this sensitive, off-kilter love story about a young, too-earnest salesman Ted and his sly, disruptive Ugly American cousin-with-issues Fred? Nothing. The film grabs you from their first bickering exchange in Ted's apartment building, and never lets go, not because of fast-paced editing or shiny visuals (though the film doesn't drag and Barcelona at night is a wonder) but because of the clever dialogue. Whit Stillman makes films for people who love to read, yet they are not stilted exercises in \"Masterpiece Theater\"-style draftsmanship but laugh-out-loud exchanges of opinion between engaging people who just happen to see the world in sometimes very/ sometimes slightly different ways. It's like \"Friends\" if that cast suddenly grew brains. Give this movie five minutes, and it will suck you in like a vacuum. Ultimately, what grabs me is how the film is so chock full of life, of people who haven't got much of a clue about life winging it and hazarding the consequences. I remember those days. Ted pledges to date \"only plain or even homely women\" because he thinks beauty obscures the true essence of love. Fred tells people his cousin is into the Marquis de Sade and leather underwear because he thinks it makes Ted more interesting to the ladies than the Bible-reading goody-goody Ted really is. Actually, Fred may be on to something. It seems to help Ted in meeting his dream woman Montserrat. Ted and Montserrat are an odd couple. He wrestles earnestly with his religion and believes in salesmanship as a means of understanding life, while she is a free-living, free-loving Spaniard who thinks leaving her native land for America will condemn her future children to a life of hamburger-eating zombiedom. I was in Barcelona in 1981 myself and saw first-hand how beautiful and magical the place truly is. I also saw the anti-Americanism and anti-\"OTAN\"ism prevalent there. Stillman isn't overselling the negative attitudes many in Spain and throughout Europe had of the United States during those critical days of the Cold War. It's a good thing they got that out of their system, huh? The movie could have been heavy-handed in this way, but never allows itself to be, not with all those funny ant analogies. Ramon, the left-wing writer who fingers Fred for being a member of the CIA (or the AFL-CIA, as Ramon is convinced the labor union and the intelligence agency are somehow connected), is not stupid or mean, but just like Ted and Fred, a little too caught up in his own ideas of how things are, or as Ted puts it in a moment of truth at the hospital, another person given to filtering reality through his own colossal egotism. Whit Stillman seems to be averaging two films a decade now, and it's a shame. He and Chris Eigeman need to make more movies together. I never get tired of Eigeman's snarky charm, or Stillman's ability to create films equally rich in one-liners and in context. \"Barcelona\" was the finest of Stillman's three efforts, with the best story and backdrop, but the earlier \"Metropolitan\" was not far behind. \"Last Days of Disco,\" the most recent Stillman film, wasn't as good as the first two, but is engaging and absorbing enough on its own terms. If you haven't seen any of them, start with this one. [The DVD contains several interesting deleted scenes and an alternative ending which might have made the film a bit darker but wouldn't have disrupted anything essential. Still, it's hard to argue with an ending that has Montserrat bite into an authentic American hamburger and pronounce it \"incredible.\" At least unless you're a vegetarian, in which case Fred would probably say that's your problem.]",
         "Barecelona is a vastly underrated movie that achieved little success outside of art-house theatres on its release. This is a shame because the movie is both intelligent, funny and has broad appeal. It concerns the adventures of two Americans who find themselves in Barcelona in the early Eighties at the height of the cold war. Ted is an uptight and repressed businessman while Fred is his airforce cousin who's a great deal more relaxed. The film starts with Fred forcing himself on his reluctant cousin's hospitality having just arrived in Barcelona. Yet this isn't a buddy movie. In fact, it's very hard to classify and is by no means typical of an American movie. It's far more European in style. The movie is about clashes of cultures and it's here that the humour is generated. Fred and Ted's differing attitudes and intelligence levels rub up against each other, and the old debate about the differences between male and female outlooks get a look in too. But the largest culture clash is that of urban left-wing Northern Spain versus the naturally conservative and bullish Americanism. This sounds heavy and intellectual but it isn't - the film makes fun of the American culture of living according self-help guides, for example, but also makes fun of a Spanish journalist-cum-philosopher who turns out to be equally shallow. The strongest elements of the movie are the script, which is as tight as any top-notch sitcom, and also the cast. There are some excellent performances all around from some very strong actors. Fans or Mira Sorvino won't get to see a great deal of her, however, as she has a relatively minor supporting role. The film is effectively a celebration of Barcelona and also of the situations that arise when different cultures meet. This might make it hard for some Americans to warm to but, ironically, that merely underlines the movie's main theme - that the world is bigger than the American continent and infinitely wider in its cultural scope.",
         "This very unusual movie exudes such charm and creates a great well of sympathy for its anxious and innocent central characters. They find themselves throughout in worlds they find alien - a world of puerile anti-Americanism, of foreign women, and either commercial sales or the Navy (\"well, you were ROTC, weren't you?\" said disparagingly to a former bond trader now Navy officer). The movie is very funny, the main American characters very likeable, naive, impressionable and voluble, the Spanish male character and several of the Spanish female characters, enjoyably detestable in every way. There were two things I particularly enjoyed. First, every American who has lived in Europe for any period of time will find the movie rings all kinds of bells of memory - the woeful ignorance but insufferable patronizing tone of Europeans discoursing on American history and politics (e.g., the whole discourse on the \"terrible union AFL-CIA that subverted democratic movements in Europe\" is a hoot). Many young Europeans have exhibited since the War such an astonishing combination of ignorance, facile categorization and jealousy toward American life, history and policy that the American finds himself suddenly overwhelmed by both uninformed European prejudice and an astonishing unwillingness to be educated about a country that Americans obviously know far better than the lecturers. This movie is almost a tribute to that suffering. Second, this movie is a nice antidote to the usual pedestal-placing of women, particularly foreign women, as the pawns of men. In this, the women are FAR more predatory and exhibit a deceit that is commonplace in most movies about male wolfishness. It's nice to see the tables turned. The movie is also quite good on the relationship between two young Chicago men - and the way in which their lives as children affect their continuing view of each other - and how that changes. The movie is off-beat, and has a peculiar pace. Do pay attention because there are about 5 female characters who are easy to confuse. Do see it- you'll enjoy it. (Oh, and in contradiction to the reviewer below, I think it quite normal, though funny, for a man to happen to speak - even though still in bed - to a girlfriend about his worry that he may be shaving the wrong way).",
         "\"Barcelona\" is a conversational movie, driven by witty, inventive dialogue. The two main protagonists are cousins; white collar, American, male twenty-somethings. One is the Barcelona sales representative of an American company, the other a recently arrived Naval attaché. Set in the early 1980s, together they navigate the Spanish singles scene while trying to excel in their chosen professions. This doesn't sound like much, but it's really a hoot. The movie's core is the pair's verbal jousting, both with one another, and with the Spanish women they try to woo. It has a couple of sub-plots to keep things interesting, and just bubbles along. I recommend this highly, especially as a movie to see with a date.",
         "This is one of those movies that get better with age. I first saw it ten years ago, when Mira Sorvino was an unknown actress, and I was surprised to learn later that she wasn't really Spanish. (I lived in Spain for five years, so I'm not easily fooled.) If you've been to Barcelona, you'll like the glowing glimpses of the city, sun-drenched during the day, lit by neon and fireworks at night. There is much charming, often subtle, humor in the film. Who could resist Taylor Nichols dancing alone in his dining room while reading the Bible? Or Chris Eigeman using a felt tip pen to change anti-American graffiti from \"American pigs\" to \"American deer\"? Sure, the film is talky, but it doesn't take itself too too seriously.",
         "Back when I wasn't really into buying films on video, I bought this one. The humor is subtle, understated, ironic, and tremendously well-written. It is just ending as I write this. Every time I see it I notice a few more things that make me laugh. None of it is the shocking, laugh-out-loud style of humor, but there are several intellectual chuckles. For some people, it will seem too intellectual and therefore it will strike them as pretentious. That is not a criticism at all, only a warning. I don't find it pretentious at all. The best part is the interesting characters. They are written as complete, well-developed people who have wildly different outlooks on Spain-U.S. relations. While Whit Stillman does a great job of analyzing these relations, the central focus of the movie is how these characters relate to each other in the arena of these larger ethnic relations. I firmly believe that anyone who enjoys dialogue-driven, non-action-oriented films will love this one. I gave it a \"10.\"",
         "I have not looked at this movie in over a year, yet it is still so fond to my recollection...that I have to stop here and share my thoughts. First, this is a genuinely warm film and some of the sunniness of the setting, I think, permeates the mood it creates and the feeling that is left with the viewer. And this is despite the sterility of Ted Boynton's work and the comparable hollowness of his sales \"ethos.\" I know what people say about Whit Stillman's films (ie. that they are peopled with talking heads and not much feeling is generated)....but this is absolutely NOT the case with BARCELONA. In spite of Ted Boynton's pragmatic and brainy approach to life, he is still shown the value of love and life...and learns some of the humility he has been so sorely lacking. It has to do, also, with his consciousness of being a foreigner: he has lowered his expectations to the point where the slightest display of kindness (by Montserrat and her friends) is a revelation to him. I think anyone wanting to work abroad should see this film first! There is much to admire in here: the crispness of Stillman's dialogue, the excellent performance by Taylor Nichols and his comic, verbally-sparring, exchanges with Chris Eigeman. It teaches us to never lose our wonder and become complacent when becoming established in a foreign country. It offers a lesson to intellectuals and would-be intellectuals everywhere that there is still plenty to be learned where the human heart is concerned. I liked this movie a lot and rate it as Stillman's clearest and most entertaining work to date.",
         "A great joy in a life with film is to discover a film that is competent and coherent, that exists cinematic ally but which on reflection has dynamics worth rejecting. After all, you build your life not so much on absorption but on paring. A great sorrow in film is to encounter a film that isn't quite competent and therefore doesn't project a coherent world. This is the latter. Its mildly interesting in that we can see the writer's sketchbook: he started with three pairs: men and women; two differing and sometimes competing cultures and two \"odd couple\" cousins. Each of these pairs has some inner dynamics: now triangulate among them all and shake out a story. Spanish passion, falling in love with a dancing woman, a death, another in a coma who recovers. Sounds a lot like \"Talk to Her,\" and in fact you might even find this film interesting if you see it together with Almodovar's gem. But otherwise, all you'll see is a writer's exercise gone awry. There's even a paucity of jokes: only the one about the AFL-CIA. I viewed this only because of the promise of the setting in Barcelona. Like the three dualities of the story, the city is bicameral. It is half African and half European; nominally Spanish, it has its own culture and language half French half Spanish. But its architecture is the thing. There are some Gaudi masterpieces which have influenced a unique approach which is half socialist architecture (yes, there is such a thing) and half wan decorative attempts at Gaudi's space jazz. This all adds to create a special ambiance; one is rarely happy about leaving Barcelona, and I hoped to get some of that environmental joy here. Nope. This could as easily been set in some dreary place like Madrid. Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.",
         "This movie is hilarious. I have seen it at least a dozen times and I still crack up repeatedly. Stillman managed to give a glimpse of his genius in \"Metropolitan\", and he failed badly in the subsequent \"Last Days of Disco\" (that was a lazy effort with a few hilarious joking references to the two previous movies, but it's a huge disappointment), but this time he hits the right tone. The story is about two cousins in Barcelona one summer, and the text of the movie is entertaining enough, but what is wonderful is the way he steps back and shows the absurdity of these characters while still allowing you to have some affection for them. The final scene in the movie where the two cousins and a friend stare out over the lake in fatuous contentment is sheer perfection.",
         "During the 1980s, at the height of the Cold War, two American cousins and childhood friends, who are now a businessman and a naval officer (played by Taylor Nichols and Chris Eigeman) get to live some time in Barcelona, where they face (but finally overcome) the political distrust of many Spaniards. Director Whit Stillman lived some time in Spain and he surely based part of the movie on his own experiences. The movie is fine skewing the unthinking Antiamericanism of Europe's intellectual class (though Stillman is too much of a gentleman to be too biting in his criticism). Sometimes the dialogue is foolish when it tries to be witty (as when the Americans try to explain to some Spaniards the greatness of Hamburgers) but mostly the screenplay is quite fine. Stillman is an interesting filmmaker if only because his preppy conservative point of view is not often showed on movies. Mira Sorvino plays one of the Spanish girls in one of her earlier roles."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Barcelona Films",
         "Castle Rock Entertainment",
         "Fine Line Features"
      ],
      "summaries": ["Ted, a stuffy white guy from Illinois working in sales for the Barcelona office of a US corporation, is paid an unexpected visit by his somewhat less stuffy cousin Fred, who is an officer in the US Navy. Over the next few months, both their lives are irrevocably altered by the events which follow Fred's arrival, events which are the trivial stuff of a comedy of manners at first but which gradually grow increasingly dramatic."],
      "budget": 3200000
   },
   "movielensId": 417,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1994-07-29",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Whit Stillman"],
      "runtime": 100,
      "movieId": 417,
      "title": "Barcelona",
      "mpaa": "PG-13",
      "actors": [
         "Taylor Nichols",
         "Chris Eigeman",
         "Mira Sorvino",
         "Tushka Bergen",
         "Pep Munné"
      ],
      "imdbMovieId": "0109219",
      "originalTitle": "Barcelona",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["qJGU08RaoNU"],
      "plotSummary": "During the 1980s, uptight Ted Boynton is a salesman working in the Barcelona office of a Chicago-based company. He receives an unexpected visit from his cousin Fred, a naval officer who has come to Spain on a public relations mission for a U.S. fleet. Not exactly friends in the past, Ted and Fred strike up relationships with women in the Spanish city and experience conflicts -- Ted with his employer, and Fred with the Barcelona community.",
      "tmdbMovieId": 16771,
      "avgRating": 3.51778,
      "releaseYear": "1994",
      "numRatings": 3402,
      "posterPath": "/ykfnXaAvepoUeGpDlqQTLAcTjjr.jpg"
   }
}