{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "arkansas",
            "id": 5521
         },
         {
            "name": "oil",
            "id": 10590
         },
         {
            "name": "based on tv series",
            "id": 10988
         },
         {
            "name": "billionaire",
            "id": 12547
         },
         {
            "name": "hillbilly",
            "id": 14559
         },
         {
            "name": "beverly hills",
            "id": 163047
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0106400",
      "video": false,
      "title": "The Beverly Hillbillies",
      "recommendations": [
         9066,
         35645,
         31220,
         12475,
         11164,
         25330,
         13962,
         8986,
         27281,
         34314,
         15489,
         9438,
         12154,
         12121,
         14671,
         13203,
         9409,
         11894,
         17745,
         18935
      ],
      "backdrop_path": "/3kaTRZxfvKchmer3g8Cs4UbqvEH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jed Clampett",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022cc9",
               "name": "Jim Varney",
               "profile_path": "/eIo2jVVXYgjDtaHoF19Ll9vtW7h.jpg",
               "id": 12899,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jethro Bodine",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022ccd",
               "name": "Diedrich Bader",
               "profile_path": "/ek6c21ennQEMXCJwTvKnPkGn60C.jpg",
               "id": 5727,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Elly May Clampett",
               "gender": 1,
               "credit_id": "52fe43e99251416c75022cd1",
               "name": "Erika Eleniak",
               "profile_path": "/7ZdUGY78qpB2MkTzAQvYEYzncwN.jpg",
               "id": 23764,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Granny",
               "gender": 1,
               "credit_id": "52fe43e99251416c75022cd5",
               "name": "Cloris Leachman",
               "profile_path": "/8ByYhjEHavhZiQYriHVXsWUfu8c.jpg",
               "id": 9599,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Miss Jane Hathaway",
               "gender": 1,
               "credit_id": "52fe43e99251416c75022cd9",
               "name": "Lily Tomlin",
               "profile_path": "/eVEt45q7QIEoZQwINx7RfTE6Sk6.jpg",
               "id": 10437,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Laura Jackson",
               "gender": 1,
               "credit_id": "545142b0c3a3680242004d0f",
               "name": "Lea Thompson",
               "profile_path": "/gaZhgJdLmWkEdqkkfomnBQn16uo.jpg",
               "id": 1063,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Dolly Parton",
               "gender": 1,
               "credit_id": "545142be0e0a262d460024de",
               "name": "Dolly Parton",
               "profile_path": "/wjnZVSGaI1s2tcIq2D6JtZ6YQdG.jpg",
               "id": 67274,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Woodrow Tyler",
               "gender": 2,
               "credit_id": "545142ccc3a368023600493e",
               "name": "Rob Schneider",
               "profile_path": "/vDbjHkAc4OMKObi9W5xW9OuDhDI.jpg",
               "id": 60949,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Milburn Drysdale",
               "gender": 2,
               "credit_id": "545142dbc3a368023300475f",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Aunt Pearl",
               "gender": 0,
               "credit_id": "565003ec9251414af500626d",
               "name": "Linda Carlson",
               "profile_path": null,
               "id": 1212058,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Morgan Drysdale",
               "gender": 2,
               "credit_id": "5853d4799251416f63030748",
               "name": "Kevin Connolly",
               "profile_path": "/rNWJMAz8iIHTiaBW1Qp4QwQAqZw.jpg",
               "id": 16666,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Zsa Zsa Gábor",
               "gender": 1,
               "credit_id": "595814c4c3a368265d01195c",
               "name": "Zsa Zsa Gábor",
               "profile_path": "/spsHbBoqF6aeLhqjYvsgvL5EBMp.jpg",
               "id": 44715,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43e99251416c75022cdf",
               "name": "Penelope Spheeris",
               "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
               "id": 58448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022ce5",
               "name": "Lawrence Konner",
               "profile_path": null,
               "id": 2100,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022ceb",
               "name": "Mark Rosenthal",
               "profile_path": null,
               "id": 2103,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022cf1",
               "name": "Jim Fisher",
               "profile_path": null,
               "id": 67908,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022cf7",
               "name": "Jim Staahl",
               "profile_path": "/uOJkXJmX7MacWVaWvPD9WoKYlaV.jpg",
               "id": 44894,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022cfd",
               "name": "Ian Bryce",
               "profile_path": null,
               "id": 9987,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e99251416c75022d03",
               "name": "Penelope Spheeris",
               "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
               "id": 58448,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022d09",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022d0f",
               "name": "Robert Brinkmann",
               "profile_path": null,
               "id": 56988,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022d15",
               "name": "Ross Albert",
               "profile_path": null,
               "id": 66756,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 5.243171,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11041,
      "vote_count": 117,
      "budget": 0,
      "overview": "Jed Clampett and kin move from Arkansas to Beverly Hills when he becomes a billionaire, after an oil strike. The country folk are very naive with regard to life in the big city, so when Jed starts a search for a new wife there are inevitably plenty of takers and con artists ready to make a fast buck",
      "similar": [
         858,
         112160,
         634,
         437557,
         43923,
         8810,
         141,
         297762,
         216015,
         242224,
         7350,
         2771,
         10735,
         5781,
         157360,
         27586,
         248774,
         9587,
         3134,
         11236
      ],
      "original_title": "The Beverly Hillbillies",
      "runtime": 93,
      "poster_path": "/idzXsphp93p4a2CurbjACcqTVMq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1993-10-15",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "The day they moved in... Beverly Hills moved out.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Penelope Spheeris"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Paul Henning",
         "Lawrence Konner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106400/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDI0MjA4NzQwMF5BMl5BanBnXkFtZTcwODY4MTcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Diedrich Bader, Erika Eleniak, Jim Varney | See full cast and crew »"],
      "reviews": [
         "I liked this film version of the television show because it makes me laugh on a rainy day or when I am having a bad day. The casting is excellent. I feel that Jim Varney plays an excellent Jed Clampett. I wish there was a sequel when he was still alive. Sadly, he's gone. I think we saw him apart from his Ernest character a lot more in Jed. He seem to feel right at home in this character. Cloris Leachman is a hoot as Granny and I really felt that she enjoyed the role. Erika Leniak does an actually good job as Elly May Clampett. She seems to fit at right home with the role. I liked Diedrich Bader as both Jethro and his twin sister Jethrine. Bader is really an excellent comedic actor. I thought Lily Tomlin played Ms. Jane Hathaway in her own updated style. I felt this Jane had more gusto than Nancy Culp did in the series. Dabney Coleman is always fun to see and in this one as Drysdale. I liked him and Tomlin together. I liked Penny Fuller as Mrs. Drysdale and Kevin O'Connell who plays their son, Morgan. I felt Morgan and Elly could have gotten together. I liked Linda Carlson as Jethro's mother. I wished she was on more. Rob Schneider and Lea Thompson really do a good job as con-artists after the Clampetts. But I really enjoyed watching this film to see the stars like Zsa Zsa Gabor, Miguel Ferrer, Buddy Ebsen as Rockford, Dolly Parton, etc. Their cameos made it worth while to see them. It's nice to see Zsa Zsa poke fun at herself on screen in anything.",
         "I enjoyed the bulk of the film - the middle part. It was just the first 20 minutes and the last 20 minutes that I thought were incredibly too stupid to enjoy. In that middle segment, Diedrich Baker's and Lily Tomlin's facial expressions were the highlight. I didn't mind staring at Erica Eleniak and Lea Thompson, either! It is an entertaining cast, I'll give it that, with Jim Varney, Cloris Leachman, Dabney Coleman and Rob Schneider among others. There also is some very good country music in the soundtrack, too. Otherwise, there isn't a whole lot of positive things to say because, really, much of the humor is Dumb, yes - with a capital \"D.\"",
         "In the spirit of the original series, this beloved production possesses one attribute no other movie can claim: a believable, serious, and endearing dramatic performance delivered by Jim Varney. Having lived in the southern US for years, I learned rather quickly that there is a stark distinction between the hillbilly and the American redneck. Hillbillies are more family oriented, while rednecks seem to care more about the toys they have and keeping up with Bubba (the southern American version of Keeping Up With the Joneses). Bubba has a rad gun collection; a shiny new truck complete with roll bar, wench and lift kits, mud-flaps and tires large enough to get you out of the mud bog with a truck bed laden with deer carcasses. Frankly, I was amazed at the quality of performance contributed by Mr. Varney. I (as was most of the world) was under the mistaken impression that Ernest was the best this actor had to give. What a grievous error! It is, indeed, unfortunate that Mr. Varney was not to be with us much longer after this attempt. I have missed the Ernest movies, to be honest, but I was also looking forward to another dramatic beneficence from him. This attempt was done with love, executed with a witty tongue-in-cheek delivery, and presented to those who held the series in regard with a more than capable star-studded cast. While the wit was at the expense of a group of people who should be respected for their deep country philosophical ideals and witticisms, so was the series. Frankly, if you didn't like the series, I see no reason to watch and then dog this movie. Cloris Leachman was a joy as Granny. She gave us the same sort of tenacity and spirit as did Irene Ryan. Her performance was delightful in spite of the somewhat small stature of her character. Diedrich Bader's Jethro was cleverly drawn from instinct and heart. Rather than one dumb crack after another, he relied greatly on facial expression as well as physical comedy to entertain his audience; a very wise decision on Bader's behalf considering he is not moron. And as this is his first screen attempt, you will see a strong pattern of characters throughout his career to this point which demonstrates his commitment to perfecting this type of role. Erika Eleniak as Elly May (Playboy model-cum-actress) was the only thing which disappointed me with this production. I believe that she tried and gave her best, but she just wasn't Elly May. I expected to feel that way about Jed or Granny, but not Elly May. Her work here was a bit stiff, in my opinion. I remember that her performance as a Playboy bunny in Under Siege was a little stiff, too. I do not know if her talents as an actress have progressed since this attempt as I've never cared to watch anything else in which she's been featured. Lily Tomlin and Lea Thompson were both dead on their characters. Although Tomlin's character was preconceived and Thompson's was a one-time plot element, they both contributed above-par performances in this work. And, true to the series, there's always some shifty character trying to take the Clampett billion away from Drysdale; enter Rob Schneider. Some critics have stated they did not understand his character's presence in this endeavor, but it fit right in with the theme of the television series. He was entertaining, delivered a good performance, and more importantly...he was funny. Dabney Coleman is Milburn Drysdale in every way, shape and form. He could have been the original participant in the series, as far as I'm concerned. He turned in an impeccable performance here. Although the story line was good, I felt it could have had a little more depth. However, the touching moments between Jed and Elly May appeared to be heart felt and honest, lending a very endearing quality to this production. The most important point I could make here is simply that Jim Varney was (and is) the best thing about this movie. Even if you aren't a fan of his Ernest franchise, you will still enjoy his performance in this movie. This was far superior to his previous performances in any other work. It rates a 6.8/10 from... the Fiend :.",
         "I admit, I was never a serious fan of the TV show, at least not until after I saw this movie. But in my opinion, this movie may have helped reintroduce the story of the Beverly Hillbillies to a new audience. I loved it. Plot: It all starts when Jed Clampett discovers oil on his property. Then Aunt Pearl convinces him to move to Beverly Hills. What am I saying? Y'all know the story. It's the same story as the TV show. That's one of the best things about this movie; that it stays true to the TV show. In addition, Jed has decided to come to Beverly Hills mainly to \"get hitched.\" Now this sounds like a funny story. Cast: The actors were probably one of the biggest aspects of the movie. The cast was funny, but also believable. The late Jim Varney (Jed) was great in one of his best \"non-Ernest\" roles. Dabney Coleman (Mr. Drysdale) was convincing in his role. He probably got the experience from doing \"9 to 5,\" which also starred his co-star Lily Tomlin. Lea Thompson and Rob Schneider (Laura and Tyler) play two cons who are trying to steal the Clampett fortune. They should've known better than going up against the Clampetts. There were many other great and hilarious performances from stars like Cloris Leachman, Erika Eleniak, and Diedrich Bader. Humor: There was the prefect balance of humor and seriousness in this movie. And the crude humor was low. If there was too much stupid or crude humor, it would've brought down the whole movie. But there was just the right amount of humor, so the movie was good. This one may be a bit too much for the younger viewer, unless it's been edited for a few bad jokes. I recommend this one for anybody who just wants to see a funny movie.",
         "Making a film from a book or play, regardless of how many times it was previously made is different than recasting an old TV sitcom and turning into a feature film. The difference is that in the first instance the films are based on characters as written down on paper from the mind of it's creator. No matter how many times A STREET CAR NAMED DESIRE is remade it always goes back to the characters, not the actors who portrayed them. Audiences will keep going back to the same play or film each time it is recast to see the subtle difference the recasting will change the role. That is why film versions of hit Broadway plays can be so successful. Remaking a TV sitcom is different. The new cast is not portraying the characters as originally written, they are portraying the actors' characterizations. So in films like THE BEVERLY HILLBILLIES we are treated to what is essentially a Saturday Night Live style parody. Of course, some of the best SNL skits are parody and it is fun to watch when done well (impressions done well, and of course a good sense of poking fun at a beloved show). THE BRADY BUNCH MOVIE was perhaps the best example of this. THE ADDAMS FAMILY was a remake, opting to go back to the original characters as created by Charles Addams in his comic strip. BATMAN and SUPERMAN also went back to their roots in the comic books and skipped most references to the TV show. In THE BEVERLY HILLBILLIES, the characters of Jed Clampett, Granny and the rest of the clan were created by Buddy Ebsen, Irene Ryan, etc...and I really doubt any of the new cast searched out notes of the characters so much as they just reviewed the old shows. This is all right and in good fun and we have to keep in mind that Jim Varney is not so much playing Jed Clampett as he is playing Buddy Ebsen's Jed Clampett. Recently, someone went ahead and remade Laurel and Hardy (in which the characters and the actors were one and the same). It flopped because it wasn't a parody and the film treated the characters as if the original Stan and Ollie were merely players. THE BEVERLY HILLBILLIES does not make this mistake, opting to literally morph the new cast out of our memories of the old cast. This movie has a cast that is hip, fun, and funny (you got to love a film that boasts a perfect, if not quite obvious casting of Jim Varney, Erika Eleniak, and Lily Tomlin--all giving great comedic performances). Is it better than the original? No, and I don't think it was suppose to be. It was just suppose to be a way to laugh at our past, and perhaps give fans a feeling that they are not alone with their adoration of one of the great TV shows of all time.",
         "What a wonderful, silly, entertaining movie! Diedrich Bader is especially hilarious as Jethro/Jethrine, but everyone in this movie is funny. The Clampetts are great. They are the kind of people that one should have as friends. Not only are they nice, they will treat you as a friend. Jim Varney was perfect as Jed and we cannot forget mentioning Dabney Coleman whose performance as usual added to the humor. This is an unpretentious, humorous, entertaining movie and the kind of movie that is not only watchable but provokes nonstop laughter. This special movie compares favorably with the sitcom. Both are humorous without being nasty and both show that nice people can actually finish first. If you enjoy nonstop laughs then this movie is for you.",
         "I watched this movie from beginning to end and it was great! Seeing it in 2007 really brought back the memories from seeing it when it was released in 1993. For the most part it was funny and it had some great actors in it and was enjoyable to watch. It was a good remake of the original Beverly Hillbillies TV show. Most parts of this movie I liked and it had some good stuff in it. The music was good and I thought it really brought the movie to life and what the film is about. However, I don't understand why this film is rated so low? I know that it wasn't a big picture but it should be given some credit for being a good movie and I highly recommend it. Very watchable! 8/10",
         "Jed Clampett Jim Varney \u0096 Ernest) is out hunting jackrabbit one day on his property when he stumbles onto the largest privately owned oil deposit in the world. Next thing widower Jed knew he was a billionaire with more money than any of us would ever see. But simple-minded Jed wants nothing more out of life than a wife to tame his young tomboy daughter Elly May (Erika Eleniak \u0096 Playboy). So he packs up his kinfolk including Granny (Cloris Leachman) and Jethro (Diedrich Bader) and heads for Beverly Hills to get his daughter some refinement. But these simple folk soon become the target on unscrupulous city folk who want nothing lea than all their money. This sweeping southern epic that lays \"Gone with the Wind\" to shame\u0085.Oh who am I kidding. I couldn't say that with a straight face if I tried. \"The Beverly Hillbillies\" is a fun in a \"throw your brain out the window and pass the popcorn\" sort of way. The TV show (far from a classic, but well loved) gets a modern reworking that would suit the fans (yeah you in the back) just fine. Gawlee that there Elly May is sure pretty Uh huh!",
         "Ever since I was a kid, I've loved this movie Everybody did an awesome job, and was a great tribute to the classic series! When Jed Clampett is hunting, he accidentally finds oil, and is given 2 billion dollars. He takes Elly May, Granny, and Jethro to Bevery Hills to live the sweet life. When arriving at their mansion, Miss Hathaway thinks they are criminals, because of the way they dress. After everything is sorted out, Jed wants to get married. He falls in love with a beautiful con artist named Laura Jackson, who is only after his money. Soon, it's up to Granny and Miss Hathaway to stop the wedding. I highly recommend THE BEVERLY HILLBILLIES!!! Yall come back now, ya hear?",
         "The Beverly Hillbillies (1993): Jim Varney, Cloris Leachman, Lily Tomlin, Diedrich Bader, Erika Eleniak, Lea Thompson, Rob Schneider, Dabney Coleman, Dolly Parton, Buddy Ebsen, Kevin Connolly, Penny Fuller, Lyman Ward, Linda Carlson, Leann Hunley, Zsa Zsa Gabor, Eric Edwards, Robert Easton, Don McNatt, James Schmid, Charlie Heath, James O'Sullivan, Stan Mazin, Anushka Jones, Lisa Montgomery, Micahel B. Moynahan, Mike Norris....Director Penelope Spheeris, Screenplay Paul Henning, Lawrence Konner, Mark Rosenthal, Jim Staahl, Jim Fisher. Released in 1993 from Director Penelope Spheeris, a female director at a time when there weren't many of them, this was the Beverly Hillbillies movie, based upon the classic 60's comedy. Because more than one writer worked on the script, and because the cast was a pretty talented group of comic actors - Jim Varney (He was the \"Hey, Vern!\" guy, Ernest in various comedy films in the 80's) Diedrich Bader (he would be a regular on Drew Carey), Cloris Leachman needs no introduction and neither does Lily Tomlin. Plus, there are cameos by Dolly Parton, Buddy Ebsen, the original Jed Clampett and Zsa Zsa Gabor. The premise is the same, except this time the setting is in the early 90's. Jed Clampett (Varney) discovers oil in his Arkansas mountain home and becomes a millionaire over night. He moves his family - daughter Ellie May (Erika Eleniak), cousin Jethro (Diedrich Bader) and his elderly grandmother (Cloris Leachman) to Beverly Hills, at a time when it was still hip and elitist, the zip code to billionaires. The Clampetts put their money in the bank of Milburn Drysdale (Dabney Coleman) who becomes their financial planner. Jane Hathaway (Tomlin) becomes their accountant. But another couple - Laura and Woodrow (Leah Thompson and Rob Schneider)have set their sights on taking the Clampett fortune. Laura poses as a French teacher to Ellie May and wins Jed's heart, making him propose marriage. With one click of a computer, she can get his money to her Swiss bank account. Will the Clampetts end up on top ? This movie is entertaining and one of those comedies that require good acting and plot and it's not just visual jokes or tawdry jokes. Few comedies are made like this nowadays but still, Beverly Hillbillies was one of the many good comedy films of the early 90's which saw films like \"Don't Tell Mom The Babysitter's Dead\" \"Encino Man\" and the Ace Ventura Pet Detective films. The film does not contain adult content and the language is not offensive, so it's entertaining for the whole family, but it got a PG-13 rating because some of the jokes go over the heads of smaller children who wouldn't understand."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Jed Clampett and kin move from Arkansas to Beverly Hills when he becomes a billionaire, after an oil strike. The country folk are very naive with regard to life in the big city, so when Jed starts a search for a new wife there are inevitably plenty of takers and con artists ready to make a fast buck.",
         "A feature adaptation of the classic TV show, when nice guy redneck Jed Clampett strikes it rich when he finds black oil, and moves he and his kin to posh Beverly Hills."
      ],
      "budget": 0
   },
   "movielensId": 419,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-10-15",
      "dvdReleaseDate": "2004-12-14",
      "directors": ["Penelope Spheeris"],
      "runtime": 93,
      "movieId": 419,
      "title": "The Beverly Hillbillies",
      "mpaa": "PG",
      "actors": [
         "Jim Varney",
         "Diedrich Bader",
         "Erika Eleniak",
         "Cloris Leachman",
         "Lily Tomlin",
         "Lea Thompson",
         "Dolly Parton",
         "Rob Schneider",
         "Dabney Coleman",
         "Linda Carlson",
         "Kevin Connolly",
         "Zsa Zsa Gábor"
      ],
      "imdbMovieId": "0106400",
      "originalTitle": "The Beverly Hillbillies",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["zrfOOZWK49o"],
      "plotSummary": "Jed Clampett and kin move from Arkansas to Beverly Hills when he becomes a billionaire, after an oil strike. The country folk are very naive with regard to life in the big city, so when Jed starts a search for a new wife there are inevitably plenty of takers and con artists ready to make a fast buck",
      "tmdbMovieId": 11041,
      "avgRating": 2.49267,
      "releaseYear": "1993",
      "numRatings": 5185,
      "posterPath": "/idzXsphp93p4a2CurbjACcqTVMq.jpg"
   }
}