{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "war veteran",
            "id": 1543
         },
         {
            "name": "vietnam",
            "id": 2956
         },
         {
            "name": "heist",
            "id": 10051
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "african american",
            "id": 11243
         },
         {
            "name": "loss of virginity",
            "id": 11254
         },
         {
            "name": "redemption",
            "id": 11436
         },
         {
            "name": "revolutinoary",
            "id": 18231
         },
         {
            "name": "mercy killing",
            "id": 159643
         },
         {
            "name": "armored truck",
            "id": 159660
         },
         {
            "name": "medic",
            "id": 180507
         },
         {
            "name": "1960s",
            "id": 208992
         },
         {
            "name": "ptsd",
            "id": 238190
         }
      ],
      "imdb_id": "tt0112819",
      "video": false,
      "title": "Dead Presidents",
      "recommendations": [
         15745,
         4997,
         9430,
         20306,
         10952,
         12489,
         10668,
         17006,
         11468,
         6071,
         16096,
         13199,
         16295,
         19382,
         91767,
         9516,
         13715,
         14112,
         10410,
         26618
      ],
      "backdrop_path": "/tF6KlwHkVlLgckuFyEbcmkyUPJP.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "55698b6d9251416afc00141b",
         "content": "Brothers In Arms.\r\n\r\nAlbert and Allen Hughes direct, produce and co-write (with Michael Henry Brown) this tale about Anthony Curtis (Larenz Tate), a South Bronx boy who goes off to fight in Vietnam, to then return after his tours of duty to find things just aren't the same anymore. The follow up to their incendiary debut, Menace II Society, the Hughes brothers deliver another in your face picture that is quite frankly on a perpetual downer. This is no bad thing, though, as long as you are not looking to be cheered up.\r\n\r\nThat's Uncle Sam for you! Mean Green.\r\n\r\nThe pic very much harks back to the glory days of film noir in the 40s and 50s, where some talented film makers began to tell stories of returning war veterans finding what they left behind is now alien to them - with some characters, as is the case here - deeply scarred by their experiences. Add in some gangster elements and the coup de grâce that is the scintillating heist, and clearly the brothers have seen many an old classic film. That the narrative is tried and tested stops the piece hitting greater heights, this in spite of some super acting (especially Tate and the always value for money Keith David) and the hard hitting violence that pierces the senses. Predictable yet potent, and certainly memorable, it's well worth a look for the tough of mind and the classic era film of heart. 7/10",
         "url": "https://www.themoviedb.org/review/55698b6d9251416afc00141b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Anthony Curtis",
               "gender": 2,
               "credit_id": "52fe44409251416c7502e19b",
               "name": "Larenz Tate",
               "profile_path": "/ApN0l0NF1fUp61PwffW09ZqEUMW.jpg",
               "id": 18291,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kirby",
               "gender": 2,
               "credit_id": "52fe44409251416c7502e19f",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Skip",
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1a3",
               "name": "Chris Tucker",
               "profile_path": "/9RQvgEi1GnPK4QzqOGHL3jP3VZr.jpg",
               "id": 66,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jose",
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1a7",
               "name": "Freddy Rodríguez",
               "profile_path": "/mlWlBZHsncujfC0Jt6H982TNDVl.jpg",
               "id": 6862,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Juanita Benson",
               "gender": 1,
               "credit_id": "52fe44409251416c7502e1ab",
               "name": "Rose Jackson",
               "profile_path": null,
               "id": 69447,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Deliah Benson",
               "gender": 1,
               "credit_id": "52fe44409251416c7502e1eb",
               "name": "N'Bushe Wright",
               "profile_path": "/3OpD0lvYcqEAwFL3JKEpal7JemR.jpg",
               "id": 10824,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Cutty",
               "gender": 2,
               "credit_id": "588e50dd925141183a00efe2",
               "name": "Clifton Powell",
               "profile_path": "/hBw76xJtCwKS2v5rZtzDBqvKLN6.jpg",
               "id": 58924,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Cowboy",
               "gender": 2,
               "credit_id": "588e50f2925141183f00f166",
               "name": "Terrence Howard",
               "profile_path": "/MZeLxOH0PgL7xcvt865WVBvQDw.jpg",
               "id": 18288,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Cleon",
               "gender": 2,
               "credit_id": "588e5102c3a368749a00dd44",
               "name": "Bokeem Woodbine",
               "profile_path": "/OewCN9cV4xwvMwPwBw05kqKy2v.jpg",
               "id": 71913,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Martin",
               "gender": 2,
               "credit_id": "588e511dc3a36874a700c3a5",
               "name": "Sticky Fingaz",
               "profile_path": "/YqrVoLdvcXpby1J7tt2a7VY38u.jpg",
               "id": 1277051,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Betancourt",
               "gender": 2,
               "credit_id": "588e5137c3a368749400dc32",
               "name": "Clifton Collins Jr",
               "profile_path": "/31FbXPcEwKLE1eiQ8ceyQpsnheE.jpg",
               "id": 5365,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Marisol",
               "gender": 1,
               "credit_id": "588e515dc3a368749400dc53",
               "name": "Elizabeth Rodriguez",
               "profile_path": "/lwJXQ7DDRY9W4pdzQzJKdeKuCFl.jpg",
               "id": 65421,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "D'ambrosio",
               "gender": 2,
               "credit_id": "588e5191925141183d00ee0a",
               "name": "Michael Imperioli",
               "profile_path": "/3AupsGJOUaAiXXaq626wzKaLiZ8.jpg",
               "id": 11486,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1b1",
               "name": "Albert Hughes",
               "profile_path": "/cZpZYwtjYoHb90vJbycOKKH8hpg.jpg",
               "id": 11447,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1b7",
               "name": "Allen Hughes",
               "profile_path": "/mXsXXvuUSAMpWP8I2ly4mfoUWlB.jpg",
               "id": 11448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1bd",
               "name": "Michael Henry Brown",
               "profile_path": null,
               "id": 69448,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1c3",
               "name": "Albert Hughes",
               "profile_path": "/cZpZYwtjYoHb90vJbycOKKH8hpg.jpg",
               "id": 11447,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1c9",
               "name": "Allen Hughes",
               "profile_path": "/mXsXXvuUSAMpWP8I2ly4mfoUWlB.jpg",
               "id": 11448,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1cf",
               "name": "Darryl Porter",
               "profile_path": null,
               "id": 69449,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1d5",
               "name": "Danny Elfman",
               "profile_path": "/pWacZpYPos8io22nEiim7d3wp2j.jpg",
               "id": 531,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44409251416c7502e1db",
               "name": "Lisa Rinzler",
               "profile_path": null,
               "id": 5271,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44409251416c7502e1e1",
               "name": "Dan Lebental",
               "profile_path": null,
               "id": 11455,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 9.394614,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11443,
      "vote_count": 98,
      "budget": 10000000,
      "overview": "Depicts a heist of old bills, retired from circulation and destined by the government to be \"money to burn\". However, more broadly, it addresses the issues of Black Americans' involvement in the Vietnam War and their subsequent disillusionment with progress in social issues and civil rights back home in the United States, during the 1960s.",
      "similar": [
         949,
         1369,
         1368,
         13,
         75656,
         9350,
         273895,
         2604,
         203,
         10995,
         11826,
         326285,
         842,
         10654,
         11909,
         31642,
         27521,
         33258,
         31657,
         14911
      ],
      "original_title": "Dead Presidents",
      "runtime": 119,
      "poster_path": "/2dLyvXVvJXUR9otoqERkYpao1bB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Underworld Entertainment",
            "id": 476,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1995-10-06",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "In this daring heist, the only color that counts is green",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Albert Hughes",
         "Allen Hughes"
      ],
      "runtime": 119,
      "synopsis": "(this first appeared on www.realmoviereview.com) This action drama was the second film by the movie-making twins, Albert and Allen Hughes. The two started their careers with the urban drama, Menace II Society, and this effort has a 70s urban setting. The style and skill of these talented filmmakers is immediately apparent and the script which they co-wrote with Michael Henry Brown has well-developed characters and great tension along with explosive action scenes framed with an engrossing small scale story. The acting is excellent, but the real star here is the Hughes direction which is cool and inspired. Larenz Tate is Anthony Curtis, a good-natured high school kid in 60s New York who is enjoying life with his girlfriend, Delilah and good friends, Skip (Chris Tucker in an early role) and Jose (Freddy Rodriguez) and running numbers for a local tough guy, Kirby (Keith David). Those days are not to last, however, as all three of the young friends end up in Vietnam. Following a fairly lengthy and well-done segment in the Nam, all three end up back in the old neighbourhood, where Anthony finds adjusting to civilian life difficult. Soon (and rather suddenly), the whole bunch of them are planning an armoured car heist, and ohhhh boy, what a heist it turns out to be. n the spring of 1969, Anthony Curtis (Larenz Tate) is about to graduate from high school. However, Anthony is not going to college, but needing to get away from home to find himself, he enlists in the U.S. Marine Corps shortly after graduating high school. He is sent to Vietnam, leaving behind a middle-class family, a pregnant girlfriend (Rose Jackson), and a small time crook, Kirby (Keith David), who is like a second father. Anthony voluntarily joined the military in 1969; his close friend Skip (Chris Tucker) later joined Curtis's squad after flunking out of college, and Jose (Freddy Rodriguez), got drafted into the Army also in 1969. Once in the Marines, Curtis meets the gung-ho lieutenant, Dugan (Jaimz Woolvett), and his wartime friend, Cleon (Bokeem Woodbine), a religious yet deadly staff sergeant. During their tour in Vietnam as members of a Force Recon unit, they experience the horror of war, losing several fellow Marines during combat. The Marines (specifically, Cleon) also commit atrocities, including executing enemy prisoners and beheading corpses for war trophies. One of their squad is the victim of terror tactics of the North Vietnamese: D'ambrosio (Michael Imperioli), who is disemboweled and castrated alive. While waiting for medevac, Anthony, succumbing to the request of the dying D'ambrosio, gives the man a fatal dose of morphine. One of their squad is killed by stepping on a land mine and a night ambush ensues, with NVA troops and half of Anthony's team killed; Dugan is killed after Skip \"freezes up\" during the gunfight when he is ordered to cover him. Cleon manages to hold off the enemy long enough for Anthony and the last of the crew to escape. When Anthony returns to The Bronx in 1973, after four years of service and presumably multiple combat tours in Vietnam, i.e. multiple tours of duty, and attaining the rank of sergeant, he discovers that returning to \"normal\" life isn't easy or pleasant. He finds his friend Skip, who used drugs during the war, is now a heroin addict. Jose, after serving as a demolitions expert, during which he lost his hand, has become a pyromaniac. Cleon is now a devoted minister. And Kirby has since become legitimate due to police cracking down on his criminal business. Anthony is laid off from his job in a butcher shop and finds himself unable to support his daughter. During a pool game at Kirby's Cowboy ( Terrence Howard ) makes fun of Anthony and informs him that Cutty ( Clifton Powell ) was having sex with his girlfriend Juanita while he was deployed in Vietnam, he beats up Cowboy with a pool stick out of anger. Anthony pesters Juanita into admitting to sleeping with Cutty to provide for their daughter (who may not even be Anthony's). Anthony meets his girlfriend's sister Delilah (a member of the \"Nat Turner Cadre\", a fictional group similar to black revolutionaries), who has always had a crush on him and decides to help him with a plot he devises. Anthony, Kirby, Skip, Jose, Delilah and Cleon plan to rob an armored car making a stop at the Noble Street Federal Reserve Bank of the Bronx. Skip and Cleon act as lookouts, Kirby is the getaway driver, Delilah waits in a dumpster across the street and Anthony and Jose hide under the loading docks, all armed. Though they plan the heist very carefully, it goes horribly wrong when a policeman stumbles on the scene. The policeman interferes, resulting in Kirby's attacking him, only to be shot in the arm, and Skip's shooting the policeman in the head. The security guards engage the robbers in a gunfight, ending with Anthony and Delilah's killing most and Delilah's dying while saving Anthony as the truck leaves. After Kirby tries to block the truck with his car, Jose makes use of an excessive amount of explosives, destroying the armored car and burning most of the cash. They escape with what money is left, but Jose has been killed after being struck by a police car. The surviving four try to lie low after the robbery. Cleon however begins handing out cash to members of his congregation, also buying a new Cadillac car which he obviously cannot afford. Anthony and Skip give out presents to poor children on Christmas. Cleon is finally arrested at his church and gives up the other thieves. NYPD officers storm Skip's apartment to find that he has died of a heroin overdose. As Kirby and Anthony prepare to leave the country, they are ambushed at Kirby's pool hall by the police and arrested. In court, Anthony is tried, convicted, and sent to prison for 15 years with an L. Anthony berates the judge (Martin Sheen), a war veteran himself, who also goes so far as to call him a disgrace to any person who put on uniform and served his country. Upon receiving his sentence, Anthony gets angry and throws the chair at the judge. After the court, Anthony on a police bus and goes to jail.",
      "writers": [
         "Allen Hughes",
         "Albert Hughes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112819/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzE0NTI0MTM5MV5BMl5BanBnXkFtZTcwMzYwMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Larenz Tate, Keith David, Chris Tucker | See full cast and crew »"],
      "reviews": [
         "The Hughes Brothers tried to play up the same angle with \"Dead Presidents\" as Micheal Cimino and Louis Garfinkle did with \"The Deer Hunter\" by portraying the social effects that the Vietnam war had on its young veterans. And for a while, it seemed as though they were quite successful. But in the end, it became apparent why \"The Dead Presidents\" fell short of the Academy recognition that \"The Deer Hunter\" won. Set in the late 60s and early 70s, the plotline of \"Dead Presidents\" follows a promising and popular inner-city high school graduate, Anthony Curtis (Larenz Tate), who decides to forego college and enter the Vietnam War as a member of the Marine Corps. Anthony survives a graphic and arduous three-plus-year stint in the jungle, but upon his homecoming, he realizes that the \"real world\" can be just as trying as war. His low-paying job provides little support for his new family and he becomes desperate to make ends meet. He enlists the help of some old friends and plans a daring armored car heist which, if successful, could serve to amend his past and brighten his future... The first seventy-five minutes of this movie were really well done. Character traits and relationships were well-established and the mood was properly set as suspense built for the anticipated war scenes--a perfect \"epic-caliber\" introduction. But instead of continuing with a detailed flow, the directing crew tried to cram about ninety minutes worth of material into the final forty-five minutes, and consequently did not leave themselves enough time to totally develop any strong climactic progression or aptly characterize any of the cast members into their sudden postwar \"criminal complex.\" Thus, the \"heist scene,\" which based on advertising was probably supposed to be one of the more memorable and authoritative parts of the film, seemed to be almost too \"spur-of-the-moment\" and lacked motivation and definition. All in all, the film's running time, which was approximately 119 minutes, was simply far too short for the storyline. The postwar segment of the film (the last forty-five minutes) was indeed key in separating a decent movie like \"Dead Presidents\" from a epic masterpiece like \"The Deer Hunter.\" Besides the first seventy-five minutes, a couple of notably good performances given by Chris Tucker as Skip (Anthony's best friend) and Rose Jackson as Juanita (Anthony's girlfriend) do make \"Dead Presidents\" a movie worth seeing at least once. That said, I would warn not to create a preconception based on the title, tagline or any publicity images that you might have seen, because they apply only to a small portion of the action.",
         "This was a great movie, and I think it was overlooked. It is one my favorites due to the unique storytelling and action. This movie is way better than 90% of the crap that comes out today. The acting is also superb, and I think it Chris Tucker's greatest performance. Even though the story has a lot of action, it's very believable, which is hard to do in Hollywood. For those who haven't seen this movie I suggest you go and rent it now, it's a modern day classic. Sit back and be prepared to watch a great moment in filmaking. It's definitely underrated. I think if it was promoted better it might have done better, especially since most war movies do well.",
         "For all those who liked the movie \"Menace 2 Society\",you are going to love this one. This movie features the star from Menace to Society \"Larenz Tate\" and the well known \"Chris Tucker\". This is a very violent movie and have a few very gory scenes of the Vietnam war,but that is okay because this movie really shows how difficult it must have been for a black man growing up in the Bronx in the 60's.And it shows how life is for him and his friends after coming home from the Vietnam war. The language in this movie is of course very tough and rough and I could actually count the f-word 247 times in this movie and that speaks for it's self. This is an extremely well made movie that really shows the reality of how hard the world can be for some people. I advice everybody to go out and pick up this movie, because it is a story that you got to hear.",
         "Gripping, poignant story about a young black man growing up in the 1960s Bronx whose parents groom him to follow in the footsteps of his college grad older brother. He has his own plans however, and enlists in the Marine Corps where he survives four years of brutal warfare in Vietnam. He returns home to try and make a new life for himself, but a struggling economy and lack of formal education gradually draw him into a life of crime. An effective portrayal of black involvement in Vietnam, with good performances, powerful scenes, and shockingly graphic violence. Tate is commanding in the lead, and Tucker a real surprise as his drug-addicted pal. Not for all tastes, but well-crafted and well-made. ***",
         "I really enjoyed this movie. Everyone in it did an excellent job and it was very gripping. It keeps you on the edge of your seat from beginning to end. Larenz Tate, in his best role ever, plays Anthony Curtis, a young black man from late 1960's The Bronx, who is just a regular guy who hangs out with his friends played by Chris Tucker also in his best role ever as Skip, and Freddy Rodriguez as Jose. Shortly after graduation from high school, Anthony decides he doesn't want to follow his big brother's path of going to college but instead, joining the Marine Corps and fight for his country. Shortly thereafter, we are taken to Vietnam with the boys and we meet some other interesting characters, one of them a psychotic preacher, Cleon, played by Bokeem Woodbine,and the Vietnam sequences are executed very realistically and are very bloody. After a while, we are taken back to the boogie down Bronx, where Anthony upon returning to the old neighborhood after four years,realizes that things are even worse than before, and everyone, including his pre-Vietnam girlfriend, Juanita, all have taken their lives in a different direction. Anthony is now a father, and cannot find a job anywhere and realizes that his own country has turned his back on him and many young black veterans from 'Nam, including his old boys Skip and Jose. We also meet Kirby, played by Keith David, a once cold and ruthless hustler, who has now left the life because the corruption of the city has forced him to quit his old habits, and Juanita's sister Delilah, played by N'Bushe Wright, who is an activist with the Black Panthers. Pretty soon all of these characters, save Juanita, fed up with their lives and their situation, get together to plan a stickup on an armored truck that is making a pickup of old dollar bills and is taking them to a location in Washington to burn them. The stickup sequence is very well made, but of course, bloody. This movie is filled with great performances, the best coming from Larenz Tate, Bokeem Woodbine and Keith David, heart-pounding action and good dialogue. A Hughes Brothers' classic. 9.5 out of 10.",
         "Dead Presidents is an okay movie. Not bad, not great. Okay. I give it a B-. I give Dead Presidents high marks for casting and acting. Larenz Tate, Chris Tucker, and the rest did a fabulous job. I also like the war scenes--very gripping, very scary. The problem that I have with the movie is that it spans too many genres and as a result, just seems to drag on and on. The tag line would make you believe that this is a cops and robbers film centered around a major heist. But that is terribly misleading. The heist doesn't happen and isn't even an issue until late in the film. Up to that point you could consider this a life in the ghetto movie, trying to escape the ghetto movie, a Viet Nam war movie, a what life was like for blacks in the late 60's early 70's movie, a what the Viet Nam war did to those who survived it movie, so on and so on. By the time it came around for the big robbery, I was wondering when this movie would end. This problem of too grand a scope keeps the movie from getting an A.",
         "Chris Tucker is hilarious in this movie, he has great on screen charisma, and he speaks his lines very fluidly, as if he was improvising. Larenz Tate is great as well, being able to pull off the young version of his character, since he has a boyish face. And Bokeem Woodbine reminds me of Samuel L. Jackson in this movie. The cinematography is also great and so is the acting overall. Like everyone says, its not so much as a heist movie, but a reflection on the hardships of the black individual, such as finding work and drug abuse; after fighting a war that wasnt really meant for them or their country.",
         "I thought I had seen one of the most intense horror films ever when I saw the Hughes Brothers' debut \"Menace II Society\" (yes, I do mean 'horror' in the figurative sense). Then I saw \"Dead Presidents,\" and I saw they took it up a notch. This film is set in Harlem in the mid 60's, a young man named Anthony Curtis, who's unsure of what to do with this life after high school and is not really interested in the usual route of college. He decides to enlist in the Marine Corps and no doubt ends up in Vietnam, in a special armed forces unit. Although he makes it out alive unscratched after four years of service, he returns home to find himself, his Marine buddies and their families - including his own new growing family - ravaged physically, emotionally, psychologically and economically by the war. When things seem to really go bleak, Anthony and his friends decide to rob an armored bank truck to get themselves back on track. \"Dead Presidents\" confirms the suspicions that were aroused by \"Menace\" that the Hughes Brothers are without question going to become master filmmakers. There is an obvious graduation in their skills here, look at the brilliant way they segue into Vietnam by showing Anthony hop over backyard fences with dogs barking in the background that suddenly fade into shotgun blasts and officer commands, then with one pass over another fence Anthony is suddenly is Vietnam blasting his shotgun. Be warned, the Vietnam sequence in the film contains the most grotesque war scenes ever filmed (much more brief in length than \"Saving Private Ryan\" but just as intense). Larenz Tate gives a strong performance as a man with a do-good heart but a warped mind that's been tarnished by war. Keith David is also skilled as Kirby, the neighborhood elder who serves as Anthony's mentor. N'Bushe Wright is miscast as a Black militant activist who entices Anthony towards the heist, she's a really bad actress and the Hughes Brothers were smart for cutting her screen time. \"Dead Presidents\" speaks volume about Black Americans' involvement in Vietnam and the consequences they suffered for doing so. Not a happy film, but an honest and skillful one.",
         "\"Dead Presidents,\" the Hughes Brothers' ambitious 1995 follow-up to their equally ambitious debut, the gritty and ultraviolent 1993 drama \"Menace II Society,\" is about as ambitious as most films can get, and in some ways it's better than their previous film, and in some ways it's not. Many have taken note of co-directing team Allen and Albert Hughes' referencing to their cinema heroes like Martin Scorsese and the bloody gangster classic \"Scarface.\" Indeed, observant viewers will note the explicit bloodshed that's prevalent in \"Dead Presidents\" as being homage to the graphic gangster pictures of yesteryear, and that doesn't make it bad. \"Presidents\" takes a look at the role that the color green played in the lives young black men before and after Vietnam. In fact, on the killing fields of good old 'Nam, mankind is seen at its absolute lowest, where soldiers on both sides of the conflict commit horrific atrocities, including a scene where a black soldier decapitates a (dead) Viet Cong and keeps the head for good luck, or when an American soldier is gutted and castrated. Obviously, the Hughes Brothers have some real big qualms about black mens' involvement in that conflict, and the film's central character, Anthony Curtis (Larenz Tate), finds little prospects awaiting him in the Bronx after doing two tours in Vietnam. Before he left, however, he'd impregnated his girlfriend Juanita (Rose Jackson) and while in country, he doesn't permit himself to think of what he's left behind in America. So when Anthony's forced to leave his low-paying job as a meat cutter, it's not a surprise that he's already begun plans to knock off an armored truck to get some \"dead presidents,\" which is street slang for dollar bills. So, together with his two involuntarily enlisted Vietnam buddies Skip (Chris Tucker) and Jose (Freddy Rodriguez), Anthony's Uncle Kirby (Keith David), Juanita's radicalized sister Delilah (N'Bushe Wright) and Cleon (Bokeem Woodbine), they proceed to knock over the truck and make way with its valuable assets. The film is most definitely a gritty look at the \"black experience\" during the Civil Rights era and the Hughes Brothers certainly pay a lot more attention to the details of the picture. It's not better than \"Menace,\" but is certainly better-made, now that they have been given a more reasonable budget. 10/10",
         "When I saw this movie it reminded me of the 1930's crime movies put out by Warner Brothers which advance the premise that environment and circumstance make the criminal. Larenz Tate is excellent in the lead and the entire cast play out their roles realistically. Vietnam is not the ruin of young Anthony Curtis (Tate) but a society devoid of opportunity for a young man who made the wrong choice in life (joining the Services rather than going to college like his brother) is at the root of his problems. Dead Presidents has cadences that match with other movies - The Deer Hunter, for instance. What makes this a very good movie is its recognition of the duality of some who end up as criminals. This is no awful matey heist movie where crime is a romp, rather it is a believable story about a young man who takes the wrong road. Doom lies in the composition of the gang - the spaced out explosives expert, the junkie lookout, the girl revolutionary to whom the exercise is the ultimate expression of rebellion, the one legged failed numbers racketeer (not an ideal getaway driver). These are not a gang that would inspire confidence in any but a desperate man and by the time the heist comes we can taste Curtis' desperation - its ultimate expression lying in his choice of Cleon - who chopped off a Viet Cong's head and carried about as a good luck charm when serving in 'Nam - as the final member of the gang. By now Curtis has drifted right outside the mainstream of society and is shocked when he pulls a life sentence from outraged judge Martin Sheen (a brilliant 2 minute cameo acting as a counterpoint to the sympathy we have come to feel for Curtis) This is a first rate, well acted movie combining action with a sophisticated argument about the motivation which may lie behind a basically decent man who goes bad. A hard pitch to make, but one at which the Hughes brothers succeed admirably. 8 out of 10"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller",
         "War"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Hollywood Pictures",
         "Underworld Entertainment"
      ],
      "summaries": [
         "This action film, directed by the Hughes brothers, depicts a heist of old bills, retired from circulation and destined by the government to be \"money to burn.\" However, more broadly, it addresses the issues of Black Americans' involvement in the Vietnam War and their subsequent disillusionment with progress in social issues and civil rights back home in the United States, during the 1960's.",
         "A Vietnam vet adjusts to life after the war while trying to support his family, but the chance of a better life may involve crime and bloodshed."
      ],
      "budget": 10000000
   },
   "movielensId": 42,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-06",
      "dvdReleaseDate": "1998-05-20",
      "directors": [
         "Albert Hughes",
         "Allen Hughes"
      ],
      "runtime": 119,
      "movieId": 42,
      "title": "Dead Presidents",
      "mpaa": "R",
      "actors": [
         "Larenz Tate",
         "Keith David",
         "Chris Tucker",
         "Freddy Rodríguez",
         "Rose Jackson",
         "N'Bushe Wright",
         "Clifton Powell",
         "Terrence Howard",
         "Bokeem Woodbine",
         "Sticky Fingaz",
         "Clifton Collins Jr",
         "Elizabeth Rodriguez",
         "Michael Imperioli"
      ],
      "imdbMovieId": "0112819",
      "originalTitle": "Dead Presidents",
      "genres": ["Action"],
      "youtubeTrailerIds": ["eETnzbLwTs8"],
      "plotSummary": "Depicts a heist of old bills, retired from circulation and destined by the government to be \"money to burn\". However, more broadly, it addresses the issues of Black Americans' involvement in the Vietnam War and their subsequent disillusionment with progress in social issues and civil rights back home in the United States, during the 1960s.",
      "tmdbMovieId": 11443,
      "avgRating": 3.04824,
      "releaseYear": "1995",
      "numRatings": 2612,
      "posterPath": "/2dLyvXVvJXUR9otoqERkYpao1bB.jpg"
   }
}