{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "drama",
            "id": 8029
         }
      ],
      "imdb_id": "tt0109305",
      "video": false,
      "title": "Blue Chips",
      "recommendations": [
         35233,
         41852,
         29973,
         19118,
         13554,
         19143,
         16232,
         18495,
         27224,
         10896,
         29804,
         83489,
         53287,
         31563,
         56179,
         31643,
         6071,
         61225,
         38554,
         28368
      ],
      "backdrop_path": "/wAWLrrdGLCJBXE7Bdi9j5hQA91q.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Pete Bell",
               "gender": 2,
               "credit_id": "52fe47f29251416c750aac47",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Neon",
               "gender": 2,
               "credit_id": "52fe47f29251416c750aac43",
               "name": "Shaquille O'Neal",
               "profile_path": "/ZyJsGaqE6DxcFkdvxAoq5PfDyl.jpg",
               "id": 35806,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jenny Bell",
               "gender": 1,
               "credit_id": "52fe47f29251416c750aac4b",
               "name": "Mary McDonnell",
               "profile_path": "/4NcE9BcnLB3oWns51r9peH8GhN8.jpg",
               "id": 1581,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Happy",
               "gender": 2,
               "credit_id": "52fe47f29251416c750aac4f",
               "name": "J.T. Walsh",
               "profile_path": "/39KZjhJSyDjvBhKGj0IbGVteFAm.jpg",
               "id": 22131,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ed",
               "gender": 2,
               "credit_id": "52fe47f29251416c750aac53",
               "name": "Ed O'Neill",
               "profile_path": "/pw37XR7Rvw50GWZ3c7rEibn8oAi.jpg",
               "id": 18977,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lavada McRae",
               "gender": 1,
               "credit_id": "5422536cc3a36808760009dc",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Vic",
               "gender": 2,
               "credit_id": "52fe47f29251416c750aac57",
               "name": "Bob Cousy",
               "profile_path": null,
               "id": 85189,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Father Dawkins",
               "gender": 2,
               "credit_id": "542259b8c3a3680887000a3a",
               "name": "Louis Gossett, Jr.",
               "profile_path": "/ggWZg5ADOjhMLqfr9canl7gNTGD.jpg",
               "id": 20959,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Marty",
               "gender": 2,
               "credit_id": "54225456c3a368087d000ad7",
               "name": "Robert Wuhl",
               "profile_path": "/7bboXtHrq8qOtQBdcZko3KJfFyH.jpg",
               "id": 4040,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Butch McRae",
               "gender": 0,
               "credit_id": "5422538b0e0a263b74000a85",
               "name": "Penny Hardaway",
               "profile_path": null,
               "id": 1236761,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f29251416c750aac5d",
               "name": "William Friedkin",
               "profile_path": "/1iBd92izRHpkSH4hOhcUBmF2cv7.jpg",
               "id": 15175,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47f29251416c750aac63",
               "name": "Ron Shelton",
               "profile_path": null,
               "id": 4037,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58e01d0e9251415e4000e4e0",
               "name": "Tom Priestley Jr.",
               "profile_path": null,
               "id": 13931,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58e01d219251415e7f00ea23",
               "name": "Robert K. Lambert",
               "profile_path": null,
               "id": 17886,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58e01d289251415e3c00ebb6",
               "name": "David Rosenbloom",
               "profile_path": "/zvScb6TbJ1EDwKVY1kpyiGVknzU.jpg",
               "id": 17816,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58e01d2f9251415e4800e9f2",
               "name": "Louis DiGiaimo",
               "profile_path": null,
               "id": 949,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58e01d36c3a3683d2a00e102",
               "name": "James D. Bissell",
               "profile_path": null,
               "id": 9967,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58e01d3fc3a3683d4600dd2a",
               "name": "Jeff Beck",
               "profile_path": "/bUEf25Vr3OnqhJr3Z4T6cClWVEU.jpg",
               "id": 107602,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58e01d479251415e7f00ea4e",
               "name": "Jed Leiber",
               "profile_path": null,
               "id": 1788056,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58e01d4ec3a3683d1e00e604",
               "name": "Nile Rodgers",
               "profile_path": "/bD5bQNACHNhIey4EwixVQIyHQwk.jpg",
               "id": 4613,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58e01d57c3a3683d0b00e092",
               "name": "Ron Shelton",
               "profile_path": null,
               "id": 4037,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58e01d5ec3a3683d3500ebd3",
               "name": "Michele Rappaport",
               "profile_path": null,
               "id": 1586978,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58e01d66c3a3683d4600dd4d",
               "name": "Wolfgang Glattes",
               "profile_path": null,
               "id": 8915,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58e01d6dc3a3683cbe00df8c",
               "name": "Ed Verreaux",
               "profile_path": null,
               "id": 4953,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "58e01d73c3a3683d4600dd55",
               "name": "Thomas L. Roysden",
               "profile_path": null,
               "id": 4712,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "58e01d7cc3a3683cff00e893",
               "name": "Bernie Pollack",
               "profile_path": null,
               "id": 4150,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.730357,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19819,
      "vote_count": 55,
      "budget": 0,
      "overview": "Pete Bell, a college basketball coach is under a lot of pressure. His team aren't winning and he cannot attract new players. The stars of the future are secretly being paid by boosters. This practice is forbidden in the college game, but Pete is desperate and has pressures from all around.",
      "similar": [
         9655,
         9291,
         22881,
         8923,
         2300,
         10637,
         323677,
         10474,
         9563,
         17108,
         2323,
         86130,
         13416,
         5925,
         1374,
         289,
         612,
         9390,
         8456,
         70
      ],
      "original_title": "Blue Chips",
      "runtime": 108,
      "poster_path": "/upew7DDF9ueZ0Wq9jT71fPpCtiK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1994-02-18",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Friedkin"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Ron Shelton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109305/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwMzI3MDk0MV5BMl5BanBnXkFtZTcwMzMxMzgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Nick Nolte, Mary McDonnell, J.T. Walsh | See full cast and crew »"],
      "reviews": [
         "Blue Chips looks at the greed, cheating, and winning at all costs in the world of college basketball. Nick Nolte plays the stressed out coach on the verge of his first losing season, who hits the road in search of new players not already signed by other big name schools. He finds three prospects, a Chicago sharp shooter (Anfernee Hardaway), a farm boy (Matt Nover), and a talented troublemaker (Shaquille O'Neal). All three, wise to the ways of college basketball recruitment, make excessive financial and lifestyle demands before they can be persuaded to come to the school; Nolte, already haunted by accusations of underhanded dealings, doesn't want to dig himself in any deeper, but has no choice if he wants to win again. Blue Chips is a very underrated sports movie, there are plenty of cameos from basketball stars (at the time) and legends you may enjoy.",
         "\"Blue Chips\" is a vastly under-rated sports film which deals with the shady dealings of colleges and their players. Nick Nolte plays a college basketball coach who is so desperate to return to his glory days that he breaks the rules by giving his newest recruits (Shaquille O'Neal, Anfernee Hardaway, and Matt Nover) basically anything they and their families want. School alumnus J.T. Walsh is the catalyst to these shady dealings and now the college has a winning team again, but at what price? \"Blue Chips\" is another one of William Friedkin's films that is much deeper than it first appears on the surface. With the exception of \"The French Connection\" and \"The Exorcist\", this is his finest film as a director. His documentary-style makes you feel as if you are in on all the action. Numerous parts are played by real basketball players and coaches, adding a great bit of realism to the story. \"The French Connection\" benefited from this style by having real cops in key roles and \"The Exorcist\" did the same having priests play themselves. Shaquille O'Neal, Anfernee Hardaway, and Matt Nover do surprisingly well with the material. They are all three-dimensional characters and shine throughout the film. However with that said, it is Nick Nolte who is the primary factor that makes the film well worth while. Far from perfect, but still a very good movie. 4 out of 5 stars.",
         "This movie seems to have a funny and interesting idea from the outlook. Yet this movies never quite takes off in the right direction or any direction. Through the first half of the movie it builds up as a comedy. In the second half it tries to alter itself into an engaging drama. Personally I had no problem with Shaq and Penny Hardaway in the movie. Nick Nolte with his character fit perfectly. Still the writing was totally unimpressive and horrible except for the one scene with Nick Nolte at the end with his press conference. Everything else in this movie seems to be cliché and would not amuse anyone except for small kids. The supporting cast other than the three basketball players and Nolte's ex-wife fit perfectly or should I say match the poor and cliché writing of this movie. For example J.T. Walsh was cast as Happy. Happy was in charge or at least had connections that helped Nolte get his top notch recruits with illegal strategies such as buying houses, giving money and buying other luxurious items for the recruits' families. J.T. Walsh seemed very easy to spot as a corrupt and horrible man even though his character is supposed to have a low profile and be behind the scenes. This presents a huge problem for a key character who does seem to be quite believable. He is supposed to be the man doing things under the table instead he is totally visible to the public. As I said before the writing in this movie does not engage the audience because it doesn't take on its own identity. It is hard to call this a comedy with too few jokes and attempts to amuse the audience and it is hard to call this a drama with the movie trying to be portrayed as a comedy. This movie could have been easily fixed if there was more work done on the writing and the casting. Blue Chips attempts to show the corruption in college sports but it fails to show the many aspects of it. Such as the corporate sponsors and the pressure an athletic director is under of loosing their job. It does not show the competing colleges vying for the top recruits and most of all it does not show you how such pure and genuine feeling such as playing a sport can be so easily corrupted by the pressure and the need for winning from coaches and colleges to fans and corporate sponsors. This sounds like a lot but could have been very easily included in the movie without having to overextend this into a 2 1/2 hour movie.",
         "I'm not a big sports movie guy, so I went into this not really expecting much other than killing 90 some minutes. I loved it! To see the struggle of a school and coach as they attempt to create a legit winning team in an environment of corruption was interesting. Then when they join that corruption it becomes exciting, you just know it's gonna blowup some time. Nick Nolte carries this film throughout it's entirety, and amazingly the real life players do a great job of acting and the rest of the cast is perfect. I love how they took real players and coaches and brought them into this film, it fits perfectly. The last 35 minutes of this film is brilliant. I've seen many people here talk of how bad this film is, I wonder if they just don't care about sports that much like myself, or have some underlying bias about admitting the corruption exists and always has in much of college sports. I don't care for sports! But I loved this film. The ratings this film gets on here really ticks me off, what is it, a 5.5 star average? I've learned one thing on here and other review sites, if you let others judge for you, you'll miss a lot of good movies.",
         "Pete Bell is a college basketball coach. He's under pressure to win and is under pressure to get the players by any means necessary. How will he stand up to the pressure or will he give in to pressure? Basketball movies are often the `weak team overcomes' type and are not exactly great. Some are good (Hoosiers) but most are mildly distracting at best (The air up there), few reach the heights of Hoop Dreams. However Blue Chips is good because it manages to cast a critical eye over the real world of college ball \u0096 there are no small town winners, there are no `kids with hearts of gold' etc \u0096 instead it is as much a business as the NBA and the stakes are high to get the best players. Bell shows us how he must juggle doing what's right but also doing what the players want in order to get a winning team. This is refreshing \u0096 rather than yet another sports movie with the same old cliches. The down side is that it doesn't go far enough in my mind and it doesn't offer solutions. Nolte is good and is really convincing as a coach \u0096 even if he's a bit OTT at times on the sidelines. His support is great in the form of McDonnell, Walsh, Woodard and the real players of Shaq and Penny do OK. The cast is also filled out with plenty of coaches, commentators and such from real life \u0096 so there's plenty to see. Overall this is one of my favourite basketball movies simply because it tells it like it is \u0096 even if it does have it's weaknesses.",
         "This movie can't come out on DVD soon enough! I have loved this movie since that first time I saw it. As someone that has always played basketball, I found it very entertaining. The acting was good, but the story line was great. After playing intercolligiate athletics, athletes being coaxed to do things outside of the NCAA rules is very relevant in any sport. I think that any sports fan would enjoy watching this movie. As a University of Kentucky basketball fan, I enjoyed seeing Bobby Knight get a little mad!!! Pete Bell was a man with a lot on his mind and finally realized that his career had gone far away from what basketball and sports should be...having fun! I really wish this DVD would be released!!!",
         "I think this film is very underrated! Nick Nolte gives a perfect performance as coach Pete Bell who can't decide between the legal and the illegal way to get some excellent players to make his team better. Finally success will be more important than his own honor and he chooses the wrong way when accepts the help of Happy. This movie shows the inner changes of Pete Bell (with his weakness)and problems that coaches have to face when they try to be honest. I liked the play of Penny Hardaway and Shaq O' Neal in spite of that they don't give an unforgettable performance. 'Blue Chips' is a very exciting basketball movie with Nolte's lovable character!",
         "While the story was rather interesting, it seemed like it was too sensationalized for it own good. Unfortunately, in a movie about basketball players, one cannot find 7-foot actors, which meant Shaq O'Neal was one of the few people who could fill the role. This entire film tries to hard, accentuating points too harshly, and showing how corrupt the entire system in a manner that doesn't appear believable. I will say this, Nick Nolte really embodies the uber-Bobby Knight character, and what happened to Matt Nover? He was clearly the only good actor amongst all of the basketball players in the film.",
         "This movie is very underrated, it hasn't gotten nearly the credit it deserves. I thought it was very well done, although it wasn't perfect, it was still very good. It is the first movie to talk about a problem that is very prominent in todays colleges and their methods of recruiting. The film is very well written and Nick Nolte does a great, great job playing the conflicted coach.",
         "Blue Chips gives us a view of high pressure college sports.It is a film about basketball that stars Nick Nolte as a college coach,Pete Bell,who was based loosely on Coach Bob Knight of Texas Tech,together with real- life basketball stars Shaquille O'Neal,Anfernee \"Penny\" Hardaway and Matt Nover as talented recruits. Blue Chips examines greed, cheating, and \"winning at all costs\" in the world of college basketball. Pete Bell is the stressed-out coach on the verge of his first losing season, who hits the road in search of new players not already signed by a bigger school. He finds three prospects: a precision Chicago shooter Butch McRae,a giant farm boy Ricky Roe and a talented troublemaker Neon. All three top prospects, wise to the ways of college basketball recruitment, make excessive financial and lifestyle demands before they can be persuaded to come to the school.Coach Bell, already haunted by accusations of underhanded dealings, doesn't want to dig himself a deeper hole but has no choice. The movie was started really well.Director William Friedkin and Writer Ron Shelton made an accurate depiction of the reality of college recruitment and the morality play that schools figure in on the college sports.There was also a story about how college players get involved with game fixing themselves.The acting was great on Nick Nolte as usual.While the performance of Shaq was good for his first screen appearance.But in the end,it \"chickened out\" and opted for an implausible and resolved for a Hollywood ending. But given its poor ending,Blue Chips is still an entertaining movie to watch especially for basketball fans."
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Pete Bell, a college basketball coach is under a lot of pressure. His team isn't winning and he cannot attract new players. The stars of the future are secretly being paid by boosters. This practice is forbidden in the college game, but Pete is desperate and has pressures from all around.",
         "A college basketball coach is forced to break the rules in order to get the players he needs to stay competitive."
      ],
      "budget": 0
   },
   "movielensId": 424,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-02-18",
      "dvdReleaseDate": "2005-03-29",
      "directors": ["William Friedkin"],
      "runtime": 108,
      "movieId": 424,
      "title": "Blue Chips",
      "mpaa": "PG-13",
      "actors": [
         "Nick Nolte",
         "Shaquille O'Neal",
         "Mary McDonnell",
         "J.T. Walsh",
         "Ed O'Neill",
         "Alfre Woodard",
         "Bob Cousy",
         "Louis Gossett",
         " Jr.",
         "Robert Wuhl",
         "Penny Hardaway"
      ],
      "imdbMovieId": "0109305",
      "originalTitle": "Blue Chips",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["3FC5zdcct9s"],
      "plotSummary": "Pete Bell, a college basketball coach is under a lot of pressure. His team aren't winning and he cannot attract new players. The stars of the future are secretly being paid by boosters. This practice is forbidden in the college game, but Pete is desperate and has pressures from all around.",
      "tmdbMovieId": 19819,
      "avgRating": 2.70885,
      "releaseYear": "1994",
      "numRatings": 802,
      "posterPath": "/upew7DDF9ueZ0Wq9jT71fPpCtiK.jpg"
   }
}