{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nuclear missile",
            "id": 3312
         },
         {
            "name": "history",
            "id": 9682
         },
         {
            "name": "nymphomaniac",
            "id": 9838
         },
         {
            "name": "dysfunctional marriage",
            "id": 10061
         },
         {
            "name": "mental illness",
            "id": 41329
         }
      ],
      "imdb_id": "tt0109306",
      "video": false,
      "title": "Blue Sky",
      "recommendations": [
         31633,
         66599,
         118915,
         12280,
         10551,
         40509,
         157036,
         113843,
         125769,
         61418,
         117904,
         88818,
         40480,
         18551,
         19317,
         78406,
         26176,
         46924,
         12623,
         3526
      ],
      "backdrop_path": "/bkynjXW0eAB1hhpKyvk4Ate46Gz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Carly Marshall",
               "gender": 1,
               "credit_id": "52fe4947c3a36847f819256b",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Hank Marshall",
               "gender": 2,
               "credit_id": "52fe4947c3a36847f819256f",
               "name": "Tommy Lee Jones",
               "profile_path": "/gRXugLFvr1oHZ6alLUxmYDq8cgW.jpg",
               "id": 2176,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Vince Johnson",
               "gender": 2,
               "credit_id": "52fe4947c3a36847f8192573",
               "name": "Powers Boothe",
               "profile_path": "/3nNL6AvMAYq0BmHKM79RnRZVq3i.jpg",
               "id": 6280,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Vera Johnson",
               "gender": 1,
               "credit_id": "52fe4947c3a36847f8192577",
               "name": "Carrie Snodgress",
               "profile_path": "/66oMosRyNaTrB8kyYupSEdeQGSY.jpg",
               "id": 44831,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Alex Marshall",
               "gender": 1,
               "credit_id": "52fe4947c3a36847f819257b",
               "name": "Amy Locane",
               "profile_path": "/6F3aO7rTxHSXTW0Eax3EHSU9Eu2.jpg",
               "id": 21412,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Glenn Johnson",
               "gender": 2,
               "credit_id": "52fe4947c3a36847f819257f",
               "name": "Chris O'Donnell",
               "profile_path": "/pjIwKa4AkgTzDO2Onz9dPn5KZTr.jpg",
               "id": 5577,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4947c3a36847f8192555",
               "name": "Tony Richardson",
               "profile_path": "/m3t3S4847wWEgQRmPZvKe5NTLzZ.jpg",
               "id": 32765,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4947c3a36847f819255b",
               "name": "Rama Laurie Stagner",
               "profile_path": null,
               "id": 227010,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4947c3a36847f8192561",
               "name": "Arlene Sarner",
               "profile_path": null,
               "id": 62016,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4947c3a36847f8192567",
               "name": "Jerry Leichtling",
               "profile_path": null,
               "id": 62015,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4947c3a36847f8192585",
               "name": "Rama Laurie Stagner",
               "profile_path": null,
               "id": 227010,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5675ed68c3a368167c003d2b",
               "name": "Jack Keller",
               "profile_path": null,
               "id": 1551320,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "598db438c3a3687524010cae",
               "name": "Jack Nitzsche",
               "profile_path": null,
               "id": 7066,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "598db43f92514178a4012a50",
               "name": "Steve Yaconelli",
               "profile_path": null,
               "id": 55232,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "598db445c3a3687524010cb9",
               "name": "Robert K. Lambert",
               "profile_path": null,
               "id": 17886,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "598db44ec3a36875770125b3",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "598db45692514178b8012658",
               "name": "Robert H. Solo",
               "profile_path": null,
               "id": 39106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "598db45d92514178b1011885",
               "name": "Timian Alsaker",
               "profile_path": null,
               "id": 1385909,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "598db46492514178ac0123d0",
               "name": "Gary Constable",
               "profile_path": null,
               "id": 50718,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "598db47892514178b8012683",
               "name": "Leslie E. Rollins",
               "profile_path": null,
               "id": 6191,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "598db48092514178ac0123f5",
               "name": "Jane Robinson",
               "profile_path": null,
               "id": 1144738,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.881533,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 57834,
      "vote_count": 38,
      "budget": 0,
      "overview": "Hank Marshall is a tough, square-jawed, straitlaced Army engineer and nuclear science expert, assigned to help conduct weapons-testing in 1950's America. Hank has become a thorn in the side of the Army, though, for a couple of very different reasons. He is an outspoken opponent of atmospheric testing, though his superiors hold contrary views and want to squelch his concerns...and his reports. The other problem is his wife, Carly. She is voluptuous and volatile, wreaking havoc in his personal life and stirring up intrigue at each new Army base.",
      "similar": [
         12289,
         4421,
         289,
         2652,
         676,
         935,
         947,
         787,
         44214,
         249397,
         227306,
         258216,
         600,
         45317,
         22972,
         76203,
         81774,
         82693,
         228150,
         193756
      ],
      "original_title": "Blue Sky",
      "runtime": 101,
      "poster_path": "/wTj6LHt0Q1ReMqLuehawOjXh0ch.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Orion Pictures Corporation",
            "id": 14150,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Heathrow Productions",
            "id": 18070,
            "origin_country": ""
         }
      ],
      "release_date": "1994-09-16",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "In a world of secrets, love is the most powerful weapon.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tony Richardson"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Rama Laurie Stagner",
         "Rama Laurie Stagner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109306/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTQ1NTA3MTU5Ml5BMl5BanBnXkFtZTcwMzc3NDcyNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jessica Lange, Tommy Lee Jones, Powers Boothe | See full cast and crew »"],
      "reviews": [
         "1994 was a year of weak female performances, but Jessica Lange's Oscar-winning turn in \"Blue Sky\" is a real sight to behold. She stars as the alcoholic wife of a well-to-do military nuclear engineer (Tommy Lee Jones). Jones knows of a cover-up by the military to keep nuclear testing in Nevada a secret in the early-1960s. This testing has no visual effect on anything in the environment (thus the name \"Blue Sky\"). Needless to say this is an intriguing film that is somewhat based on true testing which took place in sparsely populated areas of Nevada, Arizona, and New Mexico in the late-1950s and early-1960s. However, this film almost never saw the light of day. It was produced in 1991, but sat in an Orion Pictures vault for over three years. The film was finally released to generate revenue for the soon to be disbanded Orion. No one was ever clear on why the film was not initially released in 1991. Many speculate that director Tony Richardson's AIDS-related death may have had something to do with the studio's reluctance to release the film. This is just speculation, there is no proof of that. Its inability to get released is a bit of a mystery though. I mean a film with Jessica Lange and Tommy Lee Jones should have no trouble being released in my mind. Anyhow, this is Jessica Lange's greatest role. Tommy Lee Jones and Powers Boothe also give great supporting turns. 4 out of 5 stars.",
         "In its only nomination in the Oscar sweepstakes for 1994 Jessica Lange won for Best Actress in Blue Sky. After watching Blue Sky I can certainly see why. Blue Sky is set in the years of the Kennedy Administration and it's plot concerns a dedicated Army Major, Tommy Lee Jones and his family consisting of wife Jessica Lange and daughters Amy Locane and Anna Klump. Jones is more than an army officer, he's a nuclear scientist and deeply concerned about the collateral effects of radiation on the population. I well remember the time. President Eisenhower in his second term of office made an unilateral executive decision to stop above ground nuclear testing, but the Russians continued. I well remember Premier Khrushchev in a bit of saber rattling, exploded a one hundred megaton hydrogen bomb. Anyway President Kennedy decided at one point to resume nuclear testing to get the Russians back to the bargaining table for a nuclear test ban treaty. That's the background for this story and we all know that the first thaw in the Cold War was that test ban treaty that was ratified during the summer of 1963. Anyway Jones is looking to ban it all, writing all kinds of reports that the army isn't taking too seriously and in fact transfers him from California to Alabama where he's told in no uncertain terms by his commander Powers Boothe to cool it. The military wasn't exactly thrilled with what Kennedy was trying to do. But Jones has some pressing concerns on the domestic front. Jessica Lange is a lusty woman with needs and her husband isn't doing right by her. She looks like Marilyn Monroe and really does have all the army polishing its brass for her. Including Powers Boothe who sends Jones away so they can play. It all ends in disaster, but Jessica summons up a lot more character than we would have first given her credit for to right the situation. It's in those last scenes that Jessica Lange brought home Oscar. Young Chris O'Donnell is in the cast as well as Carrie Snodgrass as the son and wife of Boothe and O'Donnell the young man about to go to West Point finds out just what kind of rat his father really is. And Boothe does very well as the rat. But in the last twenty minutes of the film Jessica's change in character dominates the film and it's reason enough to check out Blue Sky",
         "The film is about the relationship of husband and wife, their troubles and how they cope with it. It also had a side plot about underground nuclear testing, which I don't think was that powerful or had that much of an impact for it to carry though as the finale, which also seem to be wrapped up uneventfully. But the main story is their troubled relationship, and how through good, bad and worse they get through it with each other's support. Jessica Lange's performance as an unstable woman was amazing, not over the top in which it would have been typically done, but was portrayed truely and its fine nuance conveyed the subtle change in her mental state.",
         "wow! Jessica Lange is so good in this movie it is embarrassing! She owns the screen in every one of her scenes. Tommy Lee Jones to his credit- lets her be the star of the movie. Though the plot is a little implausible- just like David sent off Bathsheba's husband to certain death- to seduce her- the army didn't reckon with the power of a strong and slightly crazy woman. The teenagers in the film add to its poignancy. On the surface the Marshall family seems dysfunctional- but actually- with love they function very well.",
         "This film had some really interesting scenes that made me watch the movie twice but that was enough. The story overall is a bit too messy. Jessica Lange was a hoot as the manic-depressive flirtatious wife of Army Major \"Hank Marshall.\" Boy, poor Hank had his hands full with \"Carly\" as his wife. Lange plays the role a little over-the-top but that's what makes her interesting here. It turns out to be a military soap opera film, if there is such a thing. The soap angle came in not just between the Major trying to control his out-of- control wife, but the couple's poor daughters who had to live with this under their roof. Amy Klempp and Amy Locane played the sympathetic daughters. There's more to the story, such as incidental things like nuclear bomb testing but, believe-it-or-not, that takes a back seat to Jones and Lange's marital woes. Frankly. when I write this, over 10 years after seeing the film, I wonder why I bothered watching this twice. I was a big fan of Jones, and maybe that was it, plus Lange looked good back then playing the blonde bombshell. This is one of the last films in which she looked this good as her \"Tootsie\" days were starting to wan.",
         "Tony Richardson's final film was well-done. Carly Marshall (Jessica Lange) is the wife of military guy Hank Marshall (Tommy Lee Jones) in charge of atomic tests. Due to his frequent absence, she's beginning to lose her grip on mental sanity. Somewhere along the line, she reaches the breaking point, which also makes her see the folly in Hank's propagandistic work. She has no choice but to undermine it. Jessica Lange finally won a well-deserved Best Actress Oscar for \"Blue Sky\" (she should have gotten one for \"Frances\"). Maybe some parts are a little hokey, but it's overall a good movie, looking at the nuclear age and also relationships.",
         "There is an old Calypso ditty that states \"If you want to be happy for the rest of your life, never take a pretty woman to be your wife.\" If you want to have a career in the Army, you might also want to avoid bi-polar women. Tommy Lee Jones (The Three Burials of Melquiades Estrada) was an Army Major, a nuclear engineer working on atomic tests, that had a gorgeous wife who was a little crazy. Jessica Lange (Broken Flowers) was awesome as his wife and won every award that year for her performance. She deserved every win in a movie that was a testament to love. No matter how crazy, Major Marshall (Jones) was there for her because of his love. And her love brought her out of her disorder long enough to save him. This was director Tony Richardson's last film and he made it a winner all the way.",
         "Shot in the Fall/Spring of 1989-90, \"Blue Sky\" wasn't actually released until 1994. The story involves a military family in the early 60s who move to an Alabama base. The wife (Jessica Lange) is erratic & bipolar and behaves like a loony Marilyn Monroe while the husband (Tommy Lee Jones) is unshakably faithful. The two daughters lament their mother's disorder, but the family's strong nevertheless. When the father goes to Nevada to work with bomb testing the commander of the base (Powers Boothe) has his eyes on the sexpot wife. I don't follow film awards, but Jessica won an Oscar for her performance as the hysterical wife and she deserved it. For this reason many hail the first two acts of the film, and Tommy Lee as well. Unfortunately, her character comes across as unlikable and even scary. You start to feel sad for the daughters! Some people criticize Boothe as being too dastardly of a villain. Don't believe it. Do these critics really think there aren't any high-ranking military personnel with a Genghis Khan complex? Men who think they're above the rules and can get away with anything their arrogant butts' desire? Boothe's character comes across as a solid military leader who's tempted by a subordinate's sultry wife and then does everything he can to save himself. This type of behavior is older than David and Bathsheba. Some complain about how unbelievable the last act is. Two things: (1.) This is a movie and movies always amp up the dramatics. The filmmakers essentially have to do this because, well, it's a movie and they only have 2 hours to tell the story. (2.) Besides, the film's making a point about Lange's character and it's important to the story. ***SPOILER ALERT*** It shows that, as erratic and unlikable as she is in the first two acts, she redeems herself by literally risking everything for her husband. It's a powerful and necessary point. ***END SPOILER*** This is also a good film about life on a military base, like \"The Great Santini\" with some similarities to \"Desert Bloom\", albeit not quite as good as either. The film was shot in Selma, Alabama, Florida and El Paso, Texas. It runs 101 minutes. GRADE: B",
         "Jessica Lange's Oscar-Winning Performance in 'Blue Sky', is Stunning! The 2-Time Academy-Award Winning Legendary Actress once again lights the screen on fire by delivering such a stunning performance. 'Blue Sky' is set in the 1960's, where a nuclear engineer faces a lot of difficulties in his professional & personal life. 'Blue Sky' is a depressing film. The journey its characters go through, the entire story, is very depressing. But, that's exactly how this story is supposed to be: Difficult & Unsettling. It's certainly not meant for the Faint-Hearted, as the drama in here is No-Holds-Barred. Rama Laurie Stagner, Arlene Sarner & Jerry Leichtling's Screenplay is devastating & very effective. Tony Richardson's Direction is good. Cinematography, Editing & Art Design, are nice. Lange's Oscar-Winning Performance is the prime reason to watch 'Blue Sky'. It's an unforgettable performance, that leaves an haunting impact. Also Terrific is Tommy Lee Jones, who plays the troubled husband, with great control & understanding. On the whole, 'Blue Sky' is depressing, but Lange's Oscar-Winning Performance makes it a must see. Strongly Recommended!",
         "I have admired Jessica Lange's acting ability for years. She is able to convey a bimbo-like image with such intelligence and strength, an achievement that few actresses could pull off well. It's easy to see from BLUE SKY why Lange was chosen to play Blanche Dubois in the TV version of \"A Streetcar Named Desire.\" She plays in this Oscar-winning role an emotionally unbalanced wife and mother named Carly, the type of woman that makes small-town wives fend for the safety of their marriages. She is very sensual, sometimes obnoxious, and definitely a show-stopper. Tommy Lee Jones is a nuclear scientist employed in the military during the early sixties, fearful of another meltdown. He also has to secure his wife's sexual appetites, which could easily get out of control, especially around a libido-driven sargent played by Powers Boothe. The nuclear storyline, almost a backdrop,gets in the way of the meat of the plot, that of the sensuous Lange and the two daughters. I'm not saying the actors in this film don't have power, they most certainly do, but they seem to be caught in a run-of-the-mill soap opera coloured by nuclear testing. Jessica Lange does have an award-worthy part to play, but it belongs with more powerful material, reminiscent of something like \"Streetcar.\""
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Heathrow Productions",
         "Orion Pictures"
      ],
      "summaries": [
         "Hank Marshall is a tough, square-jawed, straitlaced Army engineer and nuclear science expert, assigned to help conduct weapons-testing in 1950's America. Hank has become a thorn in the side of the Army, though, for a couple of very different reasons. He is an outspoken opponent of atmospheric testing, though his superiors hold contrary views and want to squelch his concerns...and his reports. The other problem is his wife, Carly. She is voluptuous and volatile, wreaking havoc in his personal life and stirring up intrigue at each new Army base.",
         "Carly Marshall is the mentally unbalanced wife of Hank. He's in the military and responsible for monitoring atomic tests. Carly's antics (she's fun loving) have forced her and the family (two daughters) to move from one military base to another. At a new base in Alabama, Carly gets up to her usual tricks.",
         "Lange stars in a dramatic film about a family moving to a military base, and she quickly becomes part of a cover-up involving nuclear bomb tests."
      ],
      "budget": 0
   },
   "movielensId": 425,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1994-09-16",
      "dvdReleaseDate": "2001-02-06",
      "directors": ["Tony Richardson"],
      "runtime": 101,
      "movieId": 425,
      "title": "Blue Sky",
      "mpaa": "",
      "actors": [
         "Jessica Lange",
         "Tommy Lee Jones",
         "Powers Boothe",
         "Carrie Snodgress",
         "Amy Locane",
         "Chris O'Donnell"
      ],
      "imdbMovieId": "0109306",
      "originalTitle": "Blue Sky",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["rWsKYlPDbyk"],
      "plotSummary": "Hank Marshall is a tough, square-jawed, straitlaced Army engineer and nuclear science expert, assigned to help conduct weapons-testing in 1950's America. Hank has become a thorn in the side of the Army, though, for a couple of very different reasons. He is an outspoken opponent of atmospheric testing, though his superiors hold contrary views and want to squelch his concerns...and his reports. The other problem is his wife, Carly. She is voluptuous and volatile, wreaking havoc in his personal life and stirring up intrigue at each new Army base.",
      "tmdbMovieId": 57834,
      "avgRating": 3.46968,
      "releaseYear": "1994",
      "numRatings": 907,
      "posterPath": "/wTj6LHt0Q1ReMqLuehawOjXh0ch.jpg"
   }
}