{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "distrust",
            "id": 1448
         },
         {
            "name": "military base",
            "id": 4409
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "alien invasion",
            "id": 14909
         },
         {
            "name": "alien infection",
            "id": 15250
         },
         {
            "name": "sleeping",
            "id": 161290
         },
         {
            "name": "doppelgänger",
            "id": 161891
         },
         {
            "name": "emotionless",
            "id": 200054
         }
      ],
      "imdb_id": "tt0106452",
      "video": false,
      "title": "Body Snatchers",
      "recommendations": [
         8973,
         11850,
         25557,
         11607,
         24099,
         10128,
         12590,
         12476,
         32043,
         4961,
         13937,
         14372,
         11342,
         9057,
         9599,
         11495,
         24913,
         11954,
         9102,
         11879
      ],
      "backdrop_path": "/8rjgIzDtLKucvg2u5zzFCyDFAnb.jpg",
      "revenue": 428868,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Marti Malone",
               "gender": 1,
               "credit_id": "52fe43d6c3a36847f8073101",
               "name": "Gabrielle Anwar",
               "profile_path": "/khnEDczzSy6UcbnqZ6Sb4lWxnkE.jpg",
               "id": 5503,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Steve Malone",
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f8073105",
               "name": "Terry Kinney",
               "profile_path": "/hv6CObyItPeEg5eJzzTb4L1j6DP.jpg",
               "id": 11067,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Tim Young",
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f8073109",
               "name": "Billy Wirth",
               "profile_path": "/oyigYLUbcfdpkhC5SqAQuRyLA7p.jpg",
               "id": 39112,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Jenn Platt",
               "gender": 1,
               "credit_id": "52fe43d6c3a36847f807310d",
               "name": "Christine Elise",
               "profile_path": "/tufOtGCDO2R43YWeVx2j2uwYjVQ.jpg",
               "id": 39113,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Major Collins",
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f8073111",
               "name": "Forest Whitaker",
               "profile_path": "/4pMQkelS5lK661m9Kz3oIxLYiyS.jpg",
               "id": 2178,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Mrs. Platt",
               "gender": 1,
               "credit_id": "52fe43d6c3a36847f8073115",
               "name": "Kathleen Doyle",
               "profile_path": "/hkBi2aVb0kJo9LDkRp74QgMfSuk.jpg",
               "id": 39114,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Andy Malone",
               "gender": 0,
               "credit_id": "52fe43d6c3a36847f8073119",
               "name": "Reilly Murphy",
               "profile_path": null,
               "id": 39115,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Pete",
               "gender": 0,
               "credit_id": "52fe43d6c3a36847f807311d",
               "name": "G. Elvis Phillips",
               "profile_path": null,
               "id": 39116,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Carol Malone",
               "gender": 1,
               "credit_id": "52fe43d6c3a36847f8073121",
               "name": "Meg Tilly",
               "profile_path": "/qR47kpFZR7ROd82oXJUj1CHYyZl.jpg",
               "id": 39117,
               "order": 8
            },
            {
               "cast_id": 26,
               "character": "General Platt",
               "gender": 2,
               "credit_id": "54da7602c3a368122d0002a2",
               "name": "R. Lee Ermey",
               "profile_path": "/r8GBqFBjypLUP9VVqDqfZ7wYbSs.jpg",
               "id": 8655,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43d5c3a36847f80730bb",
               "name": "Abel Ferrara",
               "profile_path": "/spMsMgsJs8qwhLXgQO9VGNm9Rcn.jpg",
               "id": 39104,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d5c3a36847f80730c1",
               "name": "Jack Finney",
               "profile_path": "/f1wr5V2soZAientHmhrocWTOW2P.jpg",
               "id": 29716,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d5c3a36847f80730c7",
               "name": "Raymond Cistheri",
               "profile_path": null,
               "id": 39105,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d5c3a36847f80730cd",
               "name": "Robert H. Solo",
               "profile_path": null,
               "id": 39106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d5c3a36847f80730d3",
               "name": "Joe Delia",
               "profile_path": null,
               "id": 39107,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f80730d9",
               "name": "Bojan Bazelli",
               "profile_path": "/2UcvIkDpDeKLUwickH8zZuBCFY4.jpg",
               "id": 11699,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f80730df",
               "name": "Anthony Redman",
               "profile_path": null,
               "id": 39108,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43d6c3a36847f80730e5",
               "name": "Ferne Cassel",
               "profile_path": null,
               "id": 2045,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d6c3a36847f80730eb",
               "name": "Peter Jamison",
               "profile_path": null,
               "id": 15014,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d6c3a36847f80730f1",
               "name": "John Huke",
               "profile_path": null,
               "id": 39109,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "52fe43d6c3a36847f80730f7",
               "name": "Linda Spheeris",
               "profile_path": null,
               "id": 39110,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d6c3a36847f80730fd",
               "name": "Margaret Mohr",
               "profile_path": null,
               "id": 39111,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f8073127",
               "name": "Larry Cohen",
               "profile_path": "/jB85d7bfXoIWW2nKxMe7fQJQ7rC.jpg",
               "id": 19266,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f807312d",
               "name": "Stuart Gordon",
               "profile_path": "/6izi3lpxy9tQgiLtxYjOVYxOmCf.jpg",
               "id": 27991,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f8073133",
               "name": "Dennis Paoli",
               "profile_path": null,
               "id": 58046,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d6c3a36847f8073139",
               "name": "Nicholas St. John",
               "profile_path": null,
               "id": 59113,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.498762,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 4722,
      "vote_count": 122,
      "budget": 13000000,
      "overview": "When Environmental Protection Agency inspector Steve Malone travels to a remote military base in order to check for toxic materials, he brings his family along for the ride. After arriving at the base, his teenage daughter Marti befriends Jean Platt, daughter of the base's commander, General Platt. When people at the base begin acting strangely, Marti becomes convinced that they are slowly being replaced by plant-like aliens.",
      "similar": [
         49849,
         4858,
         20424,
         602,
         137113,
         228161,
         68179,
         16866,
         840,
         34851,
         19995,
         607,
         608,
         2675,
         563,
         644,
         7191,
         47933,
         601,
         348
      ],
      "original_title": "Body Snatchers",
      "runtime": 87,
      "poster_path": "/4GLnErLrLfban9JDCOsxB9Xeegq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dorset Productions",
            "id": 10098,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Robert H. Solo Productions",
            "id": 10099,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-06-09",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Imagine... you're gone and someone else is living inside your body.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Abel Ferrara"],
      "runtime": 87,
      "synopsis": "Marti Malone (Gabrielle Anwar) is a teenager alienated from her newly remarried father, an agent from the Environmental Protection Agency (Kinney) and her new stepmother (Meg Tilly), and her 10-year-old brother Andy. Marti's father has been asigned to this remote military base on an assignment to check for contaminates which may be the cause of a recent outburst of mass hysteria on the base. Before arriving, the family stops at a rural gas station where Marti encounters a wild-eyed serviceman who tells her that \"they are everywhere.\" When Marti runs to tell her father, the serviceman is gone. Upon arrival, Marti attempts to fit in with her new envirment, hanging around with the base commander's rebellious daughter, and by flirting with a handsome attack helicopter pilot, Tim Young (Wirth). While examining a soil specimen, Marti's father is approached by a man named Major Collins (Forrest Whitaker), who asks him about psychological effects particularly narcophobia (the fear of sleep), saying that many people on the base are now frightened of sleep and are paranoid and suspicious. Marti's father doesn't take the Major very seriously. He is forced to take it seriously, however after extremely high levels of toxicity and mutant plant life are discovered on the base. That night, Marti Malone's step-brother approaches his sleeping mother, but she crumbles to dust as her soulless and egotistical pod double exits from the closet. Donning a nightgown, the pod-woman engages in an attempt to convince her husband that the pod invasion is a good thing, claiming it will cause the death of confusion and anger. She also claims that there's no place at all to go, as the invasion is not an isolated incident. He is almost shocked and saddened into compliance, but Marti and her step-brother arrive and drag her father out the door. His pod-wife dashes to the door and emits a shrill and mechanical scream that alerts her comrades to the danger of a human being. For the rest of the movie, Marti and her father and Andy are chased across the base by the taken over soldiers and civilians on the base, where they encounter a few remaining humans who join them and are also are chased by the pods. Searchlights go on, and the pod clones swarm over the base. Hiding Marti and Andy in a warehouse filled with barrels of poisonous waste, Marti's father promises to find help. He sneaks up to the window of Major Collins' office and enters by smashing a window. Inside, he finds the hysterical Major attempting to call for help, but gets blocked on the other end of the line by the bureaucratic pod-people. At first, he suspects Marti's father of being a pod-man, but when he realizes he isn't, he explains while wolfing down sleep-prevention pills that it is too late for running; all they can do is fight. Their conversation is interrupted by the arrival of the fearsome pod-people, led by the base commander. Marti's father hides. Instead of shooting all of the pod-people with his gun, the Major allows them to try to convince him that the individual is never important, and that only mindlessness and heartlessness can solve problems. He shoots himself rather than live in such a world. Marti's father returns to Marti and Andy, and asks them to follow him, claiming to have found a way out. They drive aimlessly through the military base, as loudspeakers shout out instructions for spreading the invasion by carrying out pods in trucks. Frightened by all this, Marti asks her father where exactly they're going. He never gives her a straight answer, instead replying. \"I know what I'm doing. Don't worry...I know exactly what I'm doing.\" Realizing that her father was \"podded\" while he was away, she swerves the car to the side and tries to escape with her brother, but her father tries to keep her in the van. Adding to all this is the helicopter pilot, Tim Young, who still hasn't figured out what has been going on, stepping onto the scene, and Marti takes his gun and shoots her pod-father dead. The pilot is horrified to see him shrink into a mass of seething and bloody goo. Marti, Tim, and Andy hide out in a nearby hanger where Tim tells them that it's too dangerous to be spotted in the open, so he'll go alone. As soon as he goes in, he is approached by the Pod-people, and pretends to be a pod-man, and although the pod-people suspect strongly that he's a human, they can't find any evidence and let him go. While he's starting up the helicopter, several of the pod-people approach Marti and Andy. Tim sees this from the air and follows them to a building on the base where humans are being duplicated. Tim lands the helicopter and enters the building to look for Marti, and finds her, nearly taken over by her pod clone on the bed next to her. Tim manages to revive her before the transformation is complete. Marti and Tim leave the building, pretending to be emotionless so they can get to Tim's helicopter to escape. However, they are spotted and confronted by the commander's daughter, whom gets suspicious and tells Marti that she saw Andy somewhere, and when Marti reacts, the game is up. Marti and Tim are forced to run to the helicopter and are joined at the last minute by Andy who runs up to them. However after taking off, Any attacks Tim, and Marti is forced to throw her taken-over brother out of the helicopter to his death on the ground far below. At dawn, Marti and Tim return to the military base and attack with with rockets and bombs from the helicopter's armaments, and destroy the pod-making facility and most of the pods and their clones with it. The final scene has Marti and Tim flying away in their helicopter and landing at a military base near the city of Atlanta where the ending of the film is an ambiguous one, quoting Marti's infected stepmother earlier in the film, suggesting that the phenomenon has already spread far beyond the army base, and nowhere, or nobody, is really safe: \"Where are you gonna go, where are you gonna run, where are you gonna hide? Nowhere... 'cause there's no one like you left.\" The End",
      "writers": [
         "Jack Finney",
         "Raymond Cistheri"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106452/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNDIyMDYyM15BMl5BanBnXkFtZTYwNjE4MDU5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Gabrielle Anwar, Meg Tilly, Terry Kinney | See full cast and crew »"],
      "reviews": [
         "The Malone family move to a military base to help contain a toxic spill. Many of the soldiers and families are behaving strangely but is it the toxins or something more sinister? I'm not a fan of remakes, many try to just copy the success of other films while some lift the original scene for scene to poor effect. However this at least tries to do something slightly different with it by setting it in a military base and bringing the drama into the family setting. In fact this setting creates some of the best scenes \u0096 my favourite being where Carol tells her daughter Marti that `there's no one like you left'. The greater effects are good but really I preferred the paranoid tension of the 50's original rather than the horror of effects. However I still think this is a very workable horror from a good director. Of course it suffers with comparison with the original \u0096 that's because the original is a sci-fi classic. But as it's own film it is pretty good. Indeed the ending is what director Siegel intended \u0096 but he was forced into having a more hopeful epilogue ending. Naturally it has it's weaknesses \u0096 the effects overpower the story at times but really I found this to be enjoyable as a horror. The cast are one of the weak links. I love Kinney because I'm a big Oz (HBO) fan, but here he doesn't really make a mark. Tilly has all the good lines and she is actually quite good. Anwar is also very watchable. But Ermey is type cast in his usual military role and Whitaker is far too calm and reasoned to do the job \u0096 he needed to be more like McCarthy in the original. Overall, this should be watched and not compared. In it's own right it is a good horror with only a few weaknesses that spoil it slightly. And if you do want to compare it to the 50's version then please remember than this is the type of ending that Siegel wanted and to me is one of the strengths of this film.",
         "Okay, the 1956 original paved the way and has to get the credit for that, but from an objective point-of-view, both the 1978 and this 1993 remake are better, scarier, more developed. In comparison to the second version, this one has a nowhere nearly as brilliant, rather disappointing ending, but the pacing is must faster. Abel Ferrara keeps the movie running for only a tight 85 minutes, and pushes all the right buttons along the way; the horror ranges from the gory (the melting heads) to the supremely subtle (the scene in the classroom, where all the kids draw the exact same picture, except for one, who naturally realizes that something is wrong - the teacher seems to want to punish him for being different). This is a spine-chilling, absolutely terrific little picture - but even if it wasn't, it would still be worth seeing just for Meg Tilly's exceptional performance - her \"where are you gonna go?\" monologue is as scary as anything in say, \"Psycho\" or \"Rosemary's Baby\". (***1/2)",
         "Normally, I try never to watch any remakes before I had the chance to see the originals...So, watching this movie really was an exception for me since I never saw Don Siegel's version from 1956 and neither did I had the chance so far to catch the Philip Kaufman remake from 1978 starring Donald Sutherland. But this movie came on TV the other night and I watched it anyway. Besides, there were a few very interesting and respected people involved in this production. First of all, there's director Abel Ferrara of course. He already delivered a few true masterpieces before and some of them are personal favorites of mine ( like Driller Killer, Bad Lieutenant and The Addiction ). But I wasn't completely convinced about watching this movie before I noticed that both Larry Cohen and Stuart Gordon took part in writing the screenplay. All three are very talented and influential men in the field of horror and I figured a collaboration between the three of them could only lead to something good. Well, it certainly is a decent movie and it provides the viewers with several scares. But - in general - I have to admit that I expected a bit more of it. The whole movie looks \"unfinished\" from time to time and the basic plot-idea isn't explained well enough, I think. I also had the feeling that everything moved too quick...Body Snatchers only lasts 87 minutes and that's a bit short for a rather complicated story like this. I would have preferred it to be a little longer and more detailed. Because of the fast storytelling, the ending also looks really fake and too abrupt. That was my biggest disappointment about it, I guess. Nevertheless, Body Snatchers contains multiple memorable scenes and it actually has the ability to raise the hair on your arms...That's quite an achievement too, I may say. Especially the sequence where both the daughter ( an adorable Gabrielle Anwar ) and the father ( a terribly boring Terry Kinney ) are being \"body-snatched\" is really frightening and a beautiful example of suspense-cinema and building up a tight atmosphere. This terrific scene ends with a powerful monologue by Meg Tilly's character. The entire movie is in fact recommended if it were only for this scene !! The further cast of Body Snatchers also contains a washed up Beverly Hills star ( whose name I don't remember ) and very enjoyable little roles by first class actors like Forest Whitaker and R. Lee Ermey. I guess this last one is doomed to play the authority figure ever since his outstanding performance in Full Metal Jacket but what the heck. He's brilliant every single time. In conclusion, Body Snatchers contains a few very bloody and explicit sequences so horror fans won't be disappointed completely. It could have been a lot better, that's a fact. But on the other hand..it could have been a lot worse as well.",
         "Everyone knows the plot of THE INVASION OF THE BODY SNATCHERS because they`d already been two adaptations before the 1993 remake . The same basic plot had also been done in the 1955 television serial QUATERMASS 2 which was also remade by Hammer films in the late 1950s and we`ve seen DOCTOR WHO stories like Spearhead From Space that uses a very similar premise . In short the idea had been done to death by the 1990s On its own BODY SNATCHERS isn`t a terrible film , it is moody and dark as it should be , but it does have a rather mechanical script with a scene featuring some teen angst followed by a mysterious scene followed by a scene featuring teen angst followed by a mysterious scene followed by a scene featuring teen angst . Everyone knows that the plot revolves around alien infiltration so do the audience get to find out why the aliens come to Earth ? Not really , unlike the 50s original there`s no real ambiguity as to the aliens motive or subtext either . I should also point out that aliens taking over military bases makes perfect logical sense if they want to nullify humanity but unfortunately setting the story on a military base where through necessity human individuality is disallowed and where the newly introduced protagonists don`t know the other characters means we have a story that lacks compelling and terrifying drama . We find it somewhat difficult to care about the people involved because they lack individuality to begin with . As I said it`s by no means terrible but BODY SNATCHERS fails alongside the 1978 version which I rate as the greatest paranoid thriller ever made",
         "The teenager Marti Malone (Gabrielle Anwar) is traveling along her summer vacations with her father, the EPA inspector Steve Malone (Terry Kinney), her stepmother Carol Malone (Meg Tilly) and her young stepbrother Andy (Reilly Murphy) to a military base where her father will inspect some toxic products. In a gas station bathroom on the road, she is scared by a soldier that advises her to not sleep, because they get you when you sleep. Once in the base, she becomes friend of Jean Platt (Christine Elise), the daughter of the general in charge of the base, and the helicopter pilot Tim Young (Billy Wirth). Marti and her father see that people are acting strange, and sooner they find that aliens are cloning the human beings in the base and invading Earth. Abel Ferrara's remake of Don Siegel's 1956 \"Invasion of the Body Snatchers\" is more violent than the original movie, but is also very good. There are three particular moments that I like very much: the first one is certainly when Marti throws Andy from the helicopter. I believe very few directors would have the courage to make such scene. The second one is the scary screams of Carol and Jean later. Last but not the least is the scene in the hospital when Gabrielle Anwar is naked and partially shows her breast. Although the end of this version is happier than the original one, it is open with the helicopter landing and Carol's voice saying \"Where you gonna go? Where you gonna run? Where you gonna hide? Nowhere, cause there's no one like you left.\" And then, \"THE END\" is highlighted with uppercases, probably meaning that Marti and Tim would be the last human beings on Earth. My vote is seven. Title (Brazil): \"Invasores de Corpos \u0096 A Invasão Continua\" (\"Bodies' Invaders \u0096 The Invasion Continues\")",
         "Acceptable Sci-Fi picture which achieved a moderated success on its appearance and dealing with a teenage girl and her father discover alien clones are replacing humans on a remote U.S. military base in Alabama . This is a passable rendition starred by a good cast such as Forest Whitaker , Meg Tilly, Terry Kinney and Gabriella Anwar . It is an average budget version , though sometimes slow-paced and including some jolts of horror . Science Fiction , military and fantasy is presented in its most horrifying form . A genuinely frightening , chilling exercise in nightmare dislocation in which hideous creatures from outer space arrive on Earth with plans of conquest by means of pods and being freely based upon a novel by Jack Finney . There are not monsters only the residents of a military headquarter , as their wills , minds and bodies taken over by a weird form of life from outer space . This is the third adaptation , still very scary and creepy about a vintage novel deals with some military residents who are being replaced by duplicates hatched from weird pods . It creates an altering the human behaviour in the new invaders . As a doctor (Terry Kinney) must protect his daughter (significant role for gorgeous Gabriella Anwar) and her new stepmother (Meg Tilly), and soon aware that pods from outer space are duplicating and menacing everyone there . Meantime , the teenager daughter befriends a handsome attack helicopter pilot, Tim Young (Billy Wirth) and a young girl named Jenn Platt (Christine Elise) , daughter of headquarter commander (Lee Ermey). The doctor may hold the means to avoid the extraterrestrial invasion as he discovers their friends are being taking over by cold human-duplicates , as one by one are turned into aliens . While examining specimen, Doctor Malone is approached by angst-ridden Major Collins (Forrest Whitaker), who asks him about psychological effects particularly narcophobia . The mysterious epidemic from outer space is spread along military camp , everybody are being taken over by emotionless , cold behaving beings . The strange seeds from outer space are growing and destroying a little base at an alarming attack. This scary Sci-Fi displays a tense screenplay freely based on Jack Finney novel titled ¨Body snatchers¨ that can be considered truly disturbing . Packs eerie suspense , chills , thrills , spectacular scenes , chilly events and pretty turns and twists . A ceaselessly inventive , ghastly rendition of the alien take-over paradigm , including a a nice built-in paranoia about a small military base is infiltrated by pods from outer space that replace and replicate human beings . It profits from an intense acting by Terry Kenney , Forrest Whitaker , R. Lee Ermey along with an enjoyable Gabrielle Anwar ; furthermore , a right direction by Abel Ferrra who proved himself master of the eerie clutch at the base of one's spine . Appropriately exciting and frightening musical score by Joe Delia , though composed by means of synthesizer. Atmospheric cinematography and evocatively eerie ambient by cameraman Bazzeli , this was the first film shot with Arriscope anamorphic lenses, which were created for Arri by the German manufacturer Isco-Optic. Adequate production design and considerable visual and special effects . The motion picture was professionally directed by Abel Ferrara . Director Ferrara brought an entirely new approach to the Sci-Fi field to a well known story that has been shot various times . He filmed an attractive tale and it has emerged as an acceptable Sci-Fi thriller that brings astonishing nightmares . Lovers of the thriller/chiller should no miss this considerable Sci-Fi , everybody will have fun being scared by this expertly crafted film . Other versions about this known story are the following : a post-McCarthy paranoid fantasy epic titled ¨Invasion of the body snatchers¨ (1958), stunning and frightening adaptation which emerged as a cinema classic which achieved tremendous and unexpected success on its appearance , so well tuned for the times that some saw it a parable Communist Witch Hunts ; being compellingly directed by Donald Siegel with Kevin MacCarthy , Dana Wynter , Larry Gates , Carolyn Jones , and Sam Peckinpah ; 1978 new version also titled ¨Invasion of the Body Snatchers¨ , one of few instances where a remake is an improvement on the original , directed by Philip Kauffman with Donald Sutherland , Brooke Adams and features cameos by Don Siegel and Kevin McCarthy from the original , realized with great originality in spite of being a remake concerning again about mysterious seeds duplicating people . Lately recent version that results to be the least satisfactory and yet another inferior titled ¨Invasion¨ with Daniel Craig, Nicole Kidman , Jeffrey Wright and directed by Oliver Hirschbiegel , this so-so take on , it takes advantage of the advances in FX , sound technology and some interesting visual effects .",
         "In this remake of a classic, they used Bad Lieutenant and King of New York director Abel Ferrara, and cast the young beauty Gabrielle Anwar (The Librarian: Return to King Solomon's Mines) and \"thirthsomething\" Terry Kinney in the leads. Kinney went on to do The Laramie Project later and was fantastic. If you want conformity, then setting your movie on a military installation ensures that you have an easier time of it. Younger people will love this version, but just updating to modern techniques and special effects doesn't always make for a better picture. Skintastic Moment: Great view of Gabrielle Anwar's ta-tas waking up on a stretcher.",
         "\"Body Snatchers\" is the fourth in the quasi-franchise based on Jack Finney's 1955 novel \"The Body Snatchers\" about an alien invasion where people die and their bodies become pod-versions of their former selves. The entries in the series are as follows: - \"Invasion of the Body Snatchers\" (1956) - \"Invasion of the Body Snatchers\" (1978) - \"Body Snatchers\" (1993) - \"The Invasion\" (2007) The first one is in Black & White and is probably too dated and tame for most modern viewers, but it's still worthwhile; it takes place in small town, California. The 1978 sequel switches the setting to the big city of San Francisco. This 1993 sequel switches to an army base in the deep south. And the 2007 version switches back to the big city of Washington DC. I suppose they could all be viewed as progressive steps in the invasion, particularly the first three; I say this because the 2007 entry changes some aspects and might be better viewed as a variation on the story rather than a sequel. I think this 1993 entry is the best, followed by the original, and then the 1978 and 2007 installments. What I like about \"Body Snatchers\" is the cast and the setting. The Army base naturally makes it easier for the alien imitations to go undetected as they spread through the community. Although she was 22 during filming, Gabrielle Anwar plays the 17 year-old protagonist, the daughter of an EPA inspector (Terry Kinney) who's assigned to inspect an Army base in the deep south (shot in Selma, Alabama). Meg Tilly plays his young wife while Christine Elise plays Anwar's friend on the base, the daughter of the commanding general, and Billy Wirth co-stars as Anwar's chopper-pilot beau (Wirth, by the way, looks like an early 90s version of Robert Pattinson from the Twilight films). Forest Whitaker is also on hand as a military psychologist at the base. Although \"Body Snatchers\" is a horror film it's a creepy/mysterious type of horror film and not a slasher/gore film. The gore you see is pretty much limited to the pod-people and is therefore more like vegetable-gore, lol. Anyway, the film has a nice haunting ambiance and everything works together for a standout film of this genre. The acting is superb and the swamplands of the deep south are utilized. Gabrielle has a beautiful face, but she's too skinny for my tastes, Elise too. As such, the female eye candy is limited to curvy Meg Tilly and her body-double Jennifer Tilly. Don't expect much on this front. Despite my fairly high opinion of \"Body Snatchers,\" it bombed at the box office and so did the 2007 entry. It goes without saying, we probably won't see another stab at this story for some time. The film runs a short but sweet 87 minutes. GRADE: A-",
         "Abel Ferrara is a talented and interesting director. He's made some great films (\"bad lieutenant\", \"china girl\") and he always seems to bring out the best in his actors. With \"Body Snatchers\", Ferrara tackles the task of directing a big budget, studio sci-fi film. And for the most part, he succeeds. Ferrara injects the film with tight closeups and experiments with tilted and off balanced framing. Making the viewer feel like something in the film is off and eschewed. But the film just isn't that exciting. It's more of a slow burner. It never really lives up to it's own potential sadly. But the effects are solid and some of the semi-transformation scenes are disturbing. The acting for the most part is solid with Meg Tilly giving the best monologue in the film. Gabrielle Anwar is gorgeous to stare at and Billy Wirth (Lost Boys) plays the chopper pilot hero. It could have been a better film, but \"Body Snatchers\" is entertaining, well-acted, and often creepy. I'm always surprised that an independent director like Ferrara was the guy chosen to helm such a big budget studio film...",
         "Body Snatchers is a scary movie about aliens replacing human beings with emotionless duplicates. The creepy thing is, people don't even notice because it's all happening on an army base. The star of Body Snatchers is Gabrielle Anwar, who plays a teenage girl named Marti. Marti resents her family. Her dad drags them all off to this army base because he works for the EPA and needs to inspect their hazardous materials. As events unfold Marti becomes concerned about her step brother, who witnesses something really disturbing and is obviously very afraid. But Marti's father is nagging her more and more. When she stays out late with a handsome chopper pilot they have a big argument and she is distracted from the problems of her little brother. When she does have the chance, she tries to reassure her brother that all is well...but she soon discovers it isn't. The base is being run by the Body Snatchers. And they want to finish the job of replacing all the humans with themselves. So she and her family have to run for it. The movie is very creepy and suspenseful and has a couple of shocking surprises. When it comes to horror films, I can be a bit of a wimp. I prefer more of the heroes to escape than sometimes make it. But Body Snatchers is up there with the best sci-fi thrillers in it's realistic treatment of bizarre events. It may not be completely logical, but it is smart. If anything, it's main weakness might be that it's so short. I suppose it had to be because if aliens are running an army base what can anyone do about it but get the heck out of there and hope they can save their family and friends in the process? Ultimately, I'm sort of grateful for this movie because it isn't a slasher film. It isn't an overblown alien invasion film with silly action scenes. It takes the subtle approach. It's almost like a really good X-files episode in that way (and I mean that as a compliment). The most dangerous aliens are the sneaky kind that infiltrate our society, not the ones who blow up recognizable landmarks with laser canons."
      ],
      "genres": [
         "Sci-Fi",
         "Horror",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": [
         "Dorset Productions",
         "Robert H. Solo Productions",
         "Warner Bros."
      ],
      "summaries": [
         "Family moves to military base for the summer, but the soldiers are behaving even more strangely than usual. Is it a toxic spill as suggested or is it something more sinister?",
         "The teenager Marti Malone is traveling along her summer vacations with her father, the EPA inspector Steve Malone, her stepmother Carol Malone and her young stepbrother Andy to a military base where her father will inspect some toxic products. In a gas station bathroom on the road, she is scared by a soldier that advises her to not sleep, because they get you when you sleep. Once in the base, she becomes friend of Jean Platt, the daughter of the general in charge of the base, and the helicopter pilot Tim Young. Marti and her father see that people are acting strange, and sooner they find that aliens are cloning the human beings in the base and invading Earth.",
         "A teenage girl and her father discover alien clones are replacing humans on a remote U.S. military base in Alabama."
      ],
      "budget": 13000000
   },
   "movielensId": 426,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-06-09",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Abel Ferrara"],
      "runtime": 87,
      "movieId": 426,
      "title": "Body Snatchers",
      "mpaa": "R",
      "actors": [
         "Gabrielle Anwar",
         "Terry Kinney",
         "Billy Wirth",
         "Christine Elise",
         "Forest Whitaker",
         "Kathleen Doyle",
         "Reilly Murphy",
         "G. Elvis Phillips",
         "Meg Tilly",
         "R. Lee Ermey"
      ],
      "imdbMovieId": "0106452",
      "originalTitle": "Body Snatchers",
      "genres": [
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["okW2UfLNaJc"],
      "plotSummary": "When Environmental Protection Agency inspector Steve Malone travels to a remote military base in order to check for toxic materials, he brings his family along for the ride. After arriving at the base, his teenage daughter Marti befriends Jean Platt, daughter of the base's commander, General Platt. When people at the base begin acting strangely, Marti becomes convinced that they are slowly being replaced by plant-like aliens.",
      "tmdbMovieId": 4722,
      "avgRating": 3.11366,
      "releaseYear": "1993",
      "numRatings": 3440,
      "posterPath": "/4GLnErLrLfban9JDCOsxB9Xeegq.jpg"
   }
}