{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109361",
      "video": false,
      "title": "Cabin Boy",
      "recommendations": [
         40752,
         29315,
         41480,
         25099,
         43812,
         24032,
         117553,
         387396,
         77621,
         84719,
         99545,
         27265,
         10608,
         98209,
         17207,
         26261,
         23626,
         70351,
         23825,
         31094
      ],
      "backdrop_path": "/3LAS1wWA8Km1wVEVMZRUFYQ7o5e.jpg",
      "revenue": 3662459,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nathanial Mayweather",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042ea5",
               "name": "Chris Elliott",
               "profile_path": "/rDbqt5F2x7MDeRdCV6prRdmShnI.jpg",
               "id": 1534,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Captain Graybar",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042ea9",
               "name": "Ritch Brinkley",
               "profile_path": null,
               "id": 22134,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Paps",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042ead",
               "name": "James Gammon",
               "profile_path": "/4oTidbjDQ8XU3LHot249SMlVLn4.jpg",
               "id": 16433,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Skunk",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042eb1",
               "name": "Brian Doyle-Murray",
               "profile_path": "/fRLFXdb8UQvJs4euZ2sE6CpjbXn.jpg",
               "id": 1535,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Big Teddy",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042eb5",
               "name": "Brion James",
               "profile_path": "/4Vm3Zq6arXq3jyFfq3yJgH9Jj2l.jpg",
               "id": 591,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Trina",
               "gender": 1,
               "credit_id": "52fe4500c3a368484e042eb9",
               "name": "Melora Walters",
               "profile_path": "/jOK1KzMo93l1qpHHdgYrj81Elco.jpg",
               "id": 4766,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Kenny",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042ebd",
               "name": "Andy Richter",
               "profile_path": "/8K63ilOwTUO1yh32oLl2zfwjbKs.jpg",
               "id": 28637,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Calli",
               "gender": 1,
               "credit_id": "52fe4500c3a368484e042ec1",
               "name": "Ann Magnuson",
               "profile_path": "/ry9H1u1GFbwXiWWolYA63pjBctp.jpg",
               "id": 37042,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mulligan",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042ec5",
               "name": "Mike Starr",
               "profile_path": "/9JrAo8iPqaLk4SrxMNq1sKHeKaK.jpg",
               "id": 5170,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Figurehead",
               "gender": 1,
               "credit_id": "52fe4500c3a368484e042ec9",
               "name": "Ricki Lake",
               "profile_path": "/y0nbFpKzWKLkziM9rZYYRUqciyn.jpg",
               "id": 70233,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Old Salt",
               "gender": 2,
               "credit_id": "555cd698c3a3682d7b001bab",
               "name": "David Letterman",
               "profile_path": "/nk1rMabb84e52G2oax6yO9FBiAd.jpg",
               "id": 136487,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "School Professor",
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042edd",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Chocki",
               "gender": 2,
               "credit_id": "562c6c6e9251412853007205",
               "name": "Russ Tamblyn",
               "profile_path": "/eSVSJvOR18dTgLRkeOqRYd6ew31.jpg",
               "id": 6725,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042ed3",
               "name": "Adam Resnick",
               "profile_path": null,
               "id": 57107,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4500c3a368484e042ed9",
               "name": "Adam Resnick",
               "profile_path": null,
               "id": 57107,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4500c3a368484e042ee3",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5527383ec3a368798d000142",
               "name": "Tim Burton",
               "profile_path": "/yHEHAHQpN9PfSEQx1UxZPczhcAi.jpg",
               "id": 510,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.379386,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26391,
      "vote_count": 33,
      "budget": 0,
      "overview": "A foul-mouthed finishing school graduate mistakenly winds up on an ill-fated fishing boat, and faces the wrath of a crew that considers him bad luck.",
      "similar": [],
      "original_title": "Cabin Boy",
      "runtime": 80,
      "poster_path": "/yO66Qjbj1Qlm3war4Z18hjXrYkV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1994-01-07",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "He's Setting Sail On The High Seas... Without A Rudder, A Compass, Or A Clue!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Adam Resnick"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Chris Elliott",
         "Adam Resnick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109361/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMjk3OTczNF5BMl5BanBnXkFtZTYwNjM4Mjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Chris Elliott, Ritch Brinkley, James Gammon | See full cast and crew »"],
      "reviews": [
         "what can be said of cabin boy's idiotic genius? Chris Elliot proves he is the master of absurd comedy in this one of a kind, off the wall masterpiece! I'm almost ashamed to love it so dearly. The movie propels itself through a bizarre mythological backdrop using Elliots uncanny knack for brilliant, stupid, amazingly funny dialog and antics. Cabin boy stays true to all that is Elliot from beginning to end. It doesn't change its mind halfway through, and is too unassuming to attempt to deliver any heartwarming morally relevant conclusion. Chris Elliot's antihero is so lovably hate able that you feel the desire to both punch him in the face, and gently rock him to sleep in a comfy blanket. This comedy is probably not for everyone, but the payoff for those who understand its naive, cynical hilarity is worth the rental fee. Hell, you can buy it for under six bucks almost any where. It is truly a misunderstood work of pure cinematic bliss.",
         "The fish stick kitten scene made me laugh so hard I missed most of the rest of the movie, but I'm sure it was also great. I don't think this movie will ever get the recognition it deserves. Mostly because Chris Elliot is kind of unpleasant. Not to me. Well, okay yes to me. He is unpleasant to me, but in a good way. People should just lighten up and realize that this movie is brilliant. Come on. True I do like this movie a lot because of scenes that are actually in Get A Life, Chris Elliot's TV show. And that's not really fair. But that episode where Martin Mull comes over and they go to that brothel while they play \"Afternoon Delight?\" That was so funny that it kind of bleeds over into Cabin Boy and makes that funny too.",
         "I have been a loyal fan of Chris Elliott since his early appearances on Letterman. This movie is typical of what happens when Elliott is given creative control -- wry, warped humour delivered in such a deadpan manner that you don't know whether he is laughing at himself or if he really is a simp. This movie has given me countless hours of debate with fans and non-fans, as I have only encountered one other person who enjoyed Cabin Boy. We often lament Chris Elliott's underrated genius and dream of the day when Cabin Boy takes its rightful place in film history as a classic. Hard to believe its already been ten years since its release and I still crack up every time I watch it. Only thing that could top it would be a sequel -- Passion of the Cabin Boy, perhaps?",
         "Critics hate this film because they see so much of themselves in the protagonist: A character who spends his whole overeducated, over-pampered life sneering at every one and every thing else, the self-appointed know it all who mocks everything but produces nothing. The protagonist is a critic, and the story makes fun of the protagonist. It was interesting and satisfying to see the protagonist's fate... and I laughed the whole way through. Summary: Unfortunately, people can't make a movie that trashes your run of the mill critic, and still hope for a good review. If you are a critic know it all, you'll hate \"Cabin Boy\". If you have an actual sense of humor you'll love it. Happiness guaranteed: That's what cabin boy is to me.",
         "Chris Elliott's sense of humor is of the bizarre kind, and requires for the deepest understanding thereof on all levels an extremely cultivated intellect and simultaneous rejection of that traditionally conceived as the predominating cultivated aesthetic. That being said, you will not, I'm sure, misunderstand my assertion that this film is not for everyone. Perhaps it is not even for you. As you see, it has received paltry scores from the greatest part of the spectating crowds who vote on IMDb.com; but should one follow them? They have also selected such trash as Donnie Darko for placement among their trophy shelf of film. I reaffirm therefore the peculiar genial and aesthetic disposition requisite fully to enjoy Cabin Boy. It is as though one must become dumb and wise at the same time, one must see with the eyes of a fool and the heart of a sage. The film student, who possesses in varied solution this talent, will also notice how exquisite, how carefully adorned the sets are, how precise the sceneries, how composed the artful tableaux, how peerless and true the cast, how poetic each word spoken.",
         "Face it, we all have different senses of humor, so a movie like \"Cabin Boy\" will appeal strongly to some, while others will despise it. Personally this movie fits my style of comedy perfectly. I love non-sequiturs, absurdity, and characters who are insanely quirky. Chris Elliot, as another reviewer pointed out, seems to have been ahead of his time. The style of comedy he honed on the Letterman show and the \"Get a Life\" sitcom was pure absurdist brilliance, and it shines through in this movie. A few of my favorite quotes from the movie (and I'm going mostly from memory here): `Half man plus half shark equals one complete gentleman.' (Nathaniel) `I'm sorry, I was just thinking how much fun it is to roast pumpkin seeds.' (Nathaniel) `Gum.' (Kenny) `Would you like to buy a monkey?' (Dave) `Well. thanks for that. whatever that was.' (Nathaniel) `I'm drawn to you, even though you have the breeding of a carnival barker.' (Nathaniel) `I just don't get it! She seems totally uninterested in me, despite my smothering obsessiveness!' (Nathaniel) `Oddly enough, it kind of tastes like marzipan!' (Nathaniel) Nathaniel: `I love sitting up here, looking at those bright, twinkly things in the sky, I forget their technical name.' Trina: `Stars.' Nathaniel: `Whatever.' How can anyone not love these lines? Ah, diff'rent strokes, I guess. Another favorite scene of mine is when \"Cappy\" goes to sleep nestled up to Chris and they wake up in each other's arms the following morning. Just the expression on Chris' face while sleeping is so glorious. All the complaints I've seen about Elliot's demeanor indicate to me that people have completely missed the point. They talk about how annoying and whiny he is, but that's the whole point of his character in this film: a rich snotty kid who is forced to endure the antics of those from the less privileged caste (but who are no less intellectually challenged, natch). I typically don't like comedy movies, because they're just way too formulaic and rigid--I tend to prefer sketch comedy or stand-up/improvisation. But with this movie, I can't stop laughing. I'm always eager to see where Chris Elliot will pop up next, and sadly it's been too long. But As Nathaniel one said to Chocky, \"I shan't forget you!\"",
         "Fuse literary themes like Candide and the Odyssey with Chris Elliott's relentless style of moronic comedy and you have a movie people will either love or hate. A wicked cast and classic special effects make up for a somewhat lethargic pace in action, but the booty of comedy in this movie make up for the long nights at sea. Watch it, own it, love it. I do.",
         "I would have a hard time saying that this is a hilarious movie, but it's got some really good stuff to it. The film is just plain odd from beginning to end. Whoever thought this stuff up (I guess that would be Adam Resnick and Chris Elliot) has quite an imagination. As far as the comedy goes, it's actually pretty funny most of the time. I don't think I ever found myself really busting up, but I did laugh quite a few times. If you liked Chris Elliott's comedy from Saturday Night Live, than I would hope that you find this film funny. The cast was pretty good, nothing much to complain about there. Chris Elliott did a good job with his role, pretty darn good for a first starring role. All of the shipmate characters were very well done and fun to watch. Melora Walters was personal fav of mine. I don't think I've ever seen her in anything else, but she looks absolutely fantastic in this film. Ricki Lake was an odd character/actor in the film. Her character was beyond strange, and the fact that the character was played by Ricki Lake just makes it even stranger. I also liked the fairly small role played by Mike Starr. Another high point for me was seeing Andy Richter from \"Late Night with Conan O'Brien\" in the film. Andy seems like such a likeable guy. There is also a nice cameo of David Letterman in the film, personally, I'm not a fan of Letterman's television show, but nonetheless he was actually pretty funny in his role/cameo. I would say that if you like Chris Elliott's comedy from Saturday Night Live, then you should go ahead an give this film a chance. It's not the greatest film you'll ever see, but it's fun and entertaining. Also, it's only 80 minutes of your life...I'm sure you can spare 80 minutes. Enjoy the film, and thanks for reading. -Chris",
         "I've been a Chris Elliot fan since watching him on his old television series \"Get a Life.\" I think he is the precursor to comedians such as Tom Green, and the modern gross-out comedy. The image of Elliot licking the boat with soapy water comes to mind. Lots of people would label this movie as one of the worst movies of all time, but it's consciously absurd (or \"wacky\" as Christ Elliot's character might say). \"Worst\" movies are ones that think they are legit, like The Order, or Batman and Robin. That being said, Cabin Boy is not the best comedy of all time. The crazy-funny parts are laugh out loud funny, but spread too far apart. I think this movie should have been wall-to-wall laughs. But it's worth it for the good parts, and Chris Elliot deserves our attention. Watch some night alongside Freddy Got Fingered and Clifford.",
         "Yes, this is an excellent filmic achievement full of 'life truths' for the morally, mentally and socially compromised. (But please go out and buy the book this movie was not based upon: \"The Shroud of the Thwacker\" by one Sir Christopher Elliot. You will be amazed and enlightened.) When I recommend a film, I prefer to have actually seen the critter in the local cinema hall. I like to sit well back somewhere in the loges. If there are no loges, I will stand somewhere until told to take a seat. But enough of my personal peccadilloes. I did indeed attend a public screening of this delightful celluloid romp and was tickled by its wit and informed by its wisdom for many a moon thereafter. This 'flick'--if I may be so bold-- will one day be considered a classic in the genre as soon as the genre is identified. As a somewhat knowledgeable cineaste I encourage everyone to rent this stunning opus. It will heal your inner Ebert."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Steve White Productions"
      ],
      "summaries": [
         "Snobby school boy goes left, and mistakes the \"Filthy Whore\" for his millionaire dad's yacht. He joins four filthy fishermen for hijinx on the high seas.",
         "A foul-mouthed finishing school graduate mistakenly winds up on an ill-fated fishing boat, and faces the wrath of a crew that considers him bad luck."
      ],
      "budget": 0
   },
   "movielensId": 429,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-01-07",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Adam Resnick"],
      "runtime": 80,
      "movieId": 429,
      "title": "Cabin Boy",
      "mpaa": "PG-13",
      "actors": [
         "Chris Elliott",
         "Ritch Brinkley",
         "James Gammon",
         "Brian Doyle-Murray",
         "Brion James",
         "Melora Walters",
         "Andy Richter",
         "Ann Magnuson",
         "Mike Starr",
         "Ricki Lake",
         "David Letterman",
         "Alfred Molina",
         "Russ Tamblyn"
      ],
      "imdbMovieId": "0109361",
      "originalTitle": "Cabin Boy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["ybNM8WvtbTs"],
      "plotSummary": "A foul-mouthed finishing school graduate mistakenly winds up on an ill-fated fishing boat, and faces the wrath of a crew that considers him bad luck.",
      "tmdbMovieId": 26391,
      "avgRating": 2.36675,
      "releaseYear": "1994",
      "numRatings": 1576,
      "posterPath": "/yO66Qjbj1Qlm3war4Z18hjXrYkV.jpg"
   }
}