{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "medicine",
            "id": 1279
         },
         {
            "name": "fountain",
            "id": 2098
         },
         {
            "name": "court",
            "id": 6148
         },
         {
            "name": "wealth",
            "id": 10329
         },
         {
            "name": "spaniel",
            "id": 44448
         },
         {
            "name": "gloves",
            "id": 44449
         },
         {
            "name": "17th century",
            "id": 207941
         },
         {
            "name": "british monarchy",
            "id": 220649
         }
      ],
      "imdb_id": "tt0114272",
      "video": false,
      "title": "Restoration",
      "recommendations": [
         32456,
         83489,
         47018,
         118430,
         25697,
         50225,
         73247,
         73249,
         20308,
         86408,
         37718,
         9089,
         9977,
         46797,
         63020,
         110598,
         70180,
         19317,
         66599,
         48958
      ],
      "backdrop_path": "/wOcv9K3iZ3sB9XuS9goXGT3cjfR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Merivel",
               "gender": 2,
               "credit_id": "52fe45999251416c91037fc9",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Katharine",
               "gender": 1,
               "credit_id": "52fe45999251416c91037fcd",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "King Charles II",
               "gender": 2,
               "credit_id": "52fe45999251416c91037fd1",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "John Pearce",
               "gender": 2,
               "credit_id": "52fe45999251416c91037fd5",
               "name": "David Thewlis",
               "profile_path": "/lWCGcTKvr4QUi8MvFBleMw8xY8.jpg",
               "id": 11207,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Elias Finn",
               "gender": 2,
               "credit_id": "52fe45999251416c91037fd9",
               "name": "Hugh Grant",
               "profile_path": "/lzCB9YN6MjGosh8v27o6omhSmjL.jpg",
               "id": 3291,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Celia Clemence",
               "gender": 1,
               "credit_id": "57608fd59251410d1a000134",
               "name": "Polly Walker",
               "profile_path": "/nUYl7W4QcO9ud2ig6qvLQ2qs0HZ.jpg",
               "id": 6416,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Will Gates",
               "gender": 2,
               "credit_id": "57608fe2c3a3687b9300013e",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Ambrose",
               "gender": 2,
               "credit_id": "57608fefc3a3687b8500016f",
               "name": "Ian McDiarmid",
               "profile_path": "/sa6FTcK7xCHCFFR10jyOOOffd7f.jpg",
               "id": 27762,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Midwife",
               "gender": 1,
               "credit_id": "57608ffa9251410d17000143",
               "name": "Mary MacLeod",
               "profile_path": "/q1ai6EaCywRV6TaegMTqwuPfOf7.jpg",
               "id": 97170,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Man with Visible Heart",
               "gender": 2,
               "credit_id": "59355dd69251417dd4036984",
               "name": "Willie Ross",
               "profile_path": "/hhXNB7Y4LHH4XQ29XOxI9DbTteQ.jpg",
               "id": 1229022,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Merivel's Father",
               "gender": 2,
               "credit_id": "5a35f7e3c3a3680b8d1ce7d2",
               "name": "Benjamin Whitrow",
               "profile_path": "/etHniAfcrMBSlLW7s8xWxcCFtuY.jpg",
               "id": 84927,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Mr. Bung",
               "gender": 2,
               "credit_id": "5a35f7ed0e0a264cc11ca4ab",
               "name": "Roger Ashton-Griffiths",
               "profile_path": "/3lvWs4Kz0aATpcSY7PyPhkKgH6W.jpg",
               "id": 20243,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Gallant",
               "gender": 2,
               "credit_id": "5a35f7fac3a36814ab04cfe7",
               "name": "Andrew Havill",
               "profile_path": "/6aDMcyP67RfYmsjOPl0qVV0gSHC.jpg",
               "id": 176191,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Gallant",
               "gender": 2,
               "credit_id": "5a35f8030e0a264cc81de651",
               "name": "Tony Gardner",
               "profile_path": "/3FipGj7lLaMtKiVlG59l53TLjsR.jpg",
               "id": 195331,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Lord Bathurst",
               "gender": 2,
               "credit_id": "5a35f8100e0a264cca1cb4e3",
               "name": "David Ryall",
               "profile_path": "/kthcBrIdXP9QwlKXkVzzRsHwJkq.jpg",
               "id": 27822,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45999251416c91037fdf",
               "name": "Michael Hoffman",
               "profile_path": "/xrMI8tNQgHws3o3Ku5cdH3ayXZx.jpg",
               "id": 52405,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45999251416c91037fe5",
               "name": "Rose Termain",
               "profile_path": null,
               "id": 227501,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45999251416c91037feb",
               "name": "Rupert Walters",
               "profile_path": null,
               "id": 114886,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45999251416c91037ff1",
               "name": "Sarah Blackburn",
               "profile_path": null,
               "id": 150352,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45999251416c91037ff7",
               "name": "Mark Bentley",
               "profile_path": null,
               "id": 141474,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "590a42ab9251414f9e006386",
               "name": "James Acheson",
               "profile_path": null,
               "id": 11386,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.357795,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35196,
      "vote_count": 33,
      "budget": 19000000,
      "overview": "An aspiring young physician, Robert Merivel found himself in the service of King Charles II and saves the life of someone close to the King. Merivel joins the King's court and lives the high life provided to someone of his position. Merivel is ordered to marry his King's mistress in order to divert the queens suspicions. He is given one order by the king and that is not to fall in love. The situation worsens when Merivel finds himself in love with his new wife. Eventually, the King finds out and relieves Merivel of his position and wealth. His fall from grace leaves Merivel where he first started. And through his travels and reunions with an old friend, he rediscovers his love for true medicine and what it really means to be a physician.",
      "similar": [
         1903,
         1213,
         55721,
         283227,
         30331
      ],
      "original_title": "Restoration",
      "runtime": 117,
      "poster_path": "/aqQdEQ1ZVdzrREJxCoPzTlLgHVw.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1995-12-29",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Hoffman"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "Rose Tremain",
         "Rupert Walters"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114272/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5ODY5MTU5OF5BMl5BanBnXkFtZTYwNjcwNTY5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Downey Jr., Sam Neill, David Thewlis | See full cast and crew »"],
      "reviews": [
         "Fortunately, I do not judge a film merely by its technical excellence. Other reviews seemed to overemphasize the limited script, miscasting, lack of focus, etc, that this movie supposedly represents. All of it may be true, and certainly if the movie did not reach me, I too, would come up with a barrelful of sophisticated reasons why it didn't work. The problem is, it moved me. It touched my heart in just the right way, and left me once again, with a longing have known everyone who ever lived, suffered and died. Ah, the human condition! The first half of the film was slow, and seemed to be searching for itself. But from the time Robert entered into the home for the insane, it became engrossing. I thought the story of the \"Lost Valley\" was poignant and worth the whole movie. All that came before was necessary background for all that came after. So...not extraordinary, not outstanding, but quietly satisfying and definitely memorable. A little gem -selected with care- to share with those you love.",
         "Good Lord! a historical epic without a spectacular set piece till the fire of London. There was not a minute of this film I did not enjoy! Those who need chariot races to feel historically present need to know we can't all hang out with Cleopatra or Rhett. These people, in this film, came across as real through the ages! After seeing this delight,I mourn for Downey's career. Rent, NO! Buy this movie and step back into time for two hours. As historical drama, this is surpassed only by \" A LION IN WINTER\" and \"LAWRENCE OF ARABIA\". Mel Gibson should see this film before he messes with historical characters again. Please, you critics watch this with your heart; not your eye for spectacle 'NUFF SAID!",
         "Restoration is one of the great overlooked gems of the 1990's. This movie is beautifully shot and competently directed. It is based closely on the original novel, and also reminds me of some of the more juicy excerpts from Samuel Pepys Diary. The use of real historical locations in Britain is inspired, for instance, the Fire of London and Cheapside market scenes were shot at Caerphilly Castle, the 13th-century moat doubling for the 17th-century Thames! Robert Downey gives a highly respectable performance as Merivel (and has an excellent British accent), but Meg Ryan is totally mis-cast, seeming very lost in some scenes. Sam Niell, I think, is probably the best casting for a British Monarch since Alec Guiness as Charles the First in Cromwell, and Dudley Sutton as James the First in Orlando. One of the best performances, however, comes from David Thewlis in support. His moving scenes with Downey at Tretower Court steal the movie. I worked as an extra on the movie, and some scenes for Pierce Brosnan's 'Crusoe' were shot back to back on the Cheapside market set. That movie has still to be released. 'Restoration' was filmed during 1994, and was delayed for release amid rumours of re-shooting scenes with Meg Ryan, and probable cold feet after the box-office difficulties with 'The Red Letter'. This movie has not been given the credits it truly deserves, and is an excellent illustration of Court life and marriage politics during the reign of Britain's sexiest Monarch!",
         "The set design and art direction on this movie was entirely mesmerizing! I will never forget the scene in which Dr Merivile returns to court (after The Plague has ravished London) in which this huge heavy swishing pendulum like incense burner, apparently to help ward off sickness... makes such a haunting and ominous sound as it waves smoke across the vast room...you can almost smell it! This movie is robustly lush and unnervingly eerie. As has been mentioned by a few others on the database...it's full of contrast on all levels. Personally, I was gladly surprised at how inventive Robert Downey Jr was with the role of Robert Merivel. He began with a laughing stupidity which grew to eventual compassion and downright intellect by the end of his story. Sam Neil is always all around proficient at what ever he takes on, his portrayal here is no exception, although I think he granted Charles II a lot of likableness and charm that was surely improbable in reality. Got to love the fifty or so Spaniels meandering with him down the plush hallways of the nobility through out the kingdom. And the scenes with intricate scientific inventions and mechanisms of the era were sheer beauty to behold. At the same time there was such desperation and bleak contrast when dealing with the devastation and hopelessness of The Plague...only to be followed by the horrific Fire Of London. It's a wonder civilization survived at all in England at the time. The movie's art direction was of such a brilliant intensity. Parts of the script were a bit slow but the visuals tended to make up for it. The only truly unfortunate aspect of the film was the casting of Meg Ryan...just Plumb Awful(as they say)in the role of Dr Merivil's asylum inmate lover....who was by the way, miraculously cured of her insanity by his physical attentions. Whoever twisted Hollywood arms to get her on this project should be quartered and drawn. Considering all, this movie made me curious enough to download a copy of Samuel Pepys Diary 1665 to read more about the history of the Restoration. Isn't that what a good historical adaptation should do?",
         "A beautiful & thoughtful movie about chance and caprice in human lives,and about how love and folly shape us. A unity of word, appearance, and action distill the reign of Charles II into the soul of a doctor who lives through a \"new age\" of human flowering. A movie aspiring to and attaining the qualities of a literary novel, powerfully combining the naturalistic and the symbolic, and equal to best adaptations of Jane Austen. Restoration will be certain disappointment for movie-goers who expect explosions instead of drama and grunts.",
         "After watching this film, I felt my faith in humanity had been (somewhat) restored, and not for the squishy, feel-good reasons either. Instead, I felt that filmmakers can often demonstrate truly wondrous, creative talents; Try not to think of all those sumptuous 18th Century European paintings that feature either the rich or the starving, while taking in the cinematic beauty of Hoffman's 'Restoration.' So what if Meg Ryan has a role in this one, I still enjoyed it. This film is not about her anyway (the film is told from an exclusively patriarchal viewpoint, and doesn't sink into syrupy romance... at least not the way I saw it). Eugenio Zannetti (I'm not entirely sure about the spelling, but he is a production designer of infinite wisdom and talent) created endless aristocratic hallways, gorgeous rooms, and locations of richness and pestilence that exist side-by-side. Zannetti went on to 'architecturally' design the central, Rococo menace in \"The Haunting\" (1999). Downey Jr's performance (as a doctor) is Raphaelesque, a walking representation of the period in which this story takes place (the anguish and hope he must undergo and have is thespian splendor). Ian McKellan also appears (need I say more) here as a disheveled, yet benevolent supporting hero. I strongly recommend you experience this 'restorative' piece of cinematic art.",
         "\"Restoration\" is an overlooked jewel of a movie, a fascinating and atmospheric journey to another time and place. Robert Downey, Jr. is outstanding as a young physician who develops depth and compassion. The music, costumes and settings are full of rich detail. While Meg Ryan's character as an insane Irish girl was perhaps a bit overwrought, I found little to fault in the movie. I have seen it three times and enjoy it thoroughly each time. I'm sorry I missed it on the big screen. Interesting scenes portraying 17th century medical practice, the plague, the Great Fire of London. Not for the squeamish, but not overly violent either.",
         "This has to have been one of the most beautiful movies I have ever seen. I am not as up on history as some people, but I think the time - the costumes, the dress, the manners, (though not the language), was stunningly represented. The transition of Robert Downey's character was also wonderfully done - we watch him go from boyishness to maturity in a slow change throughout the film, it's not just randomly done because of one event, but of a series of events. The music was out of this world, and the last half of the movie very chilling, very sad, very emotional. Have a tissue box handy!!",
         "Europe of the 1600's has often been an overlooked era, sandwiched between the idealism and art of the Elizabethan/Shakespearean Age (late 1500s) and the Enlightenment of the 1700's. In many ways, 1600s England was a transitional time reflecting the growth of England toward a modern sensibility while still being hindered by the traditions and outlooks of the past, primarily the hold of Medieval thought which held to a strict hierarchical strata while discouraging and even destroying the pursuit of knowledge and truth. Robert Downey Jr. does a tremendous job as a character that appears to be a fore-runner of the coming Enlightenment. He is a physician on the verge of ground-breaking new scientific discoveries in the area of medicine. However, through a serendipitous and at first fortuitous run-in with King Charles II, the Restoration monarch (played brilliantly by Sam Neill), Downey loses his way and becomes a willing pawn in the king's sexual chess games. He even forsakes his precious medical texts to a colleague. In return, Downey gains a royal title, a royal tract of land, servants, and a wife. The only stipulation that is placed upon him: He cannot touch his own wife--she ultimately belongs to the King as one of his many mistresses. In this way, Charles II is still a monarch enacting a role that was first prescribed in the Middle Ages: that of the absolute ruler with absolute authority that can use his subjects for his own whims, and he can also discard those that are no longer useful. Simultaneously, there is another side to Charles II. Although he is the son of his late father Charles I, Charles II is the heir to Cromwell who devoted time and money to philanthropic projects, such as the study of science and medicine, the improvement of architecture, and the creation of schools. Charles II continues the enterprises begun by Cromwell and becomes a transitional monarch who has aspects that reflect both the Middle Ages and the Enlightenment. In many ways, Restoration is about these two worlds, and how Downey lives in both of them, from the luxurious life of a nobleman to the humble physician working with Quakers in an insane asylum. The king is also a person caught in both worlds. At first he appears the selfish ruler using his subjects as chess pieces in a large game in which he is always the bona fide winner. But then in another scene, we see him as a kind of philanthropic monarch financing and encouraging scientific and liberal research and discourse. In an interesting scene, Downey enters a kind of laboratory in which knowledge, research, and discovery are are being supported by the king who presides over the work of many scholars. Behind him is a strange swirling circus-like representation of the cosmos. We can't quite tell if the representation depicts the earth as the center of the Universe or the Sun, as if this notion is still being debated. But to his credit, the king is allowing for debate--something a Medieval king under a Medieval Church would have never allowed. Later, we learn that Downey is also an amateur astronomer, gazing at the stars in the heavens with a telescope. Through his adventures in and out of these worlds, Downey sees the light and dark of both and becomes something greater than he had before, particularly through an episode in which he falls in love with one of the patients (Meg Ryan) at the insane asylum. One aspect of the film that is quite revealing is the shades of color used to represent the different \"worlds\". The world of the king is bright and colorful. The world of the Quakers is far more gray, but toward the end of the movie, the world of the king becomes darker hued. In the end, even the King seems to understand the importance of scientific discourse and research--that these ideas could ultimately help not only his people but himself. Medieval monarchs played games with people's lives for their own selfish ends, and sometimes stifled those who could make positive contributions to their societies and even humanity at large. Restoration is about the transition from the Medieval model to a new societal design in which personal gain becomes an outcome of talent and contribution and not monarchical whim. Today, we are still challenged by the notion of privilege over substance. People in power still often give major opportunities to those they favor over those that could make important contributions who are less adept at playing the political game.",
         "When this movie came out, the movie critics all jumped on and called it a failure. They said it was a hugely disappointing role for Robert Downey, Jr. Although, this movie was not superb, it was at least decent. That's why I never listen to critics. Downey plays an idealistic young surgeon with great promise. Chance has it that King Charles The Second discovers the young surgeon. If he promises not to sleep with the king's mistress, he will marry her and maintain an estate. Downey's Sir Robert is, of course, a man who chases after women, and when he falls in love with her, a spy (played by Hugh Grant) discovers it, reports it to the king, and Sir Robert is banished. Sir Robert finds favor again by devoting himself to treating the victims of the plague of 1660. What I liked about the movie, is that it showed that 1660 was the beginning of the transition to the modern World. Superstitions were falling, and surgeons like Sir Robert were starting to be seen as an asset. The King was even getting into science and medicine. Robert Downey, Jr. also does an excellent job. So, why all the bad reviews?"
      ],
      "genres": [
         "Biography",
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Avenue Pictures Productions",
         "Miramax",
         "Segue Productions"
      ],
      "summaries": ["An aspiring young physician, Robert Merivel found himself in the service of King Charles II and saves the life of a spaniel dear to the King. Merivel joins the King's court and lives the high life provided to someone of his position. Merivel is ordered to marry one of the King's mistresses in order to divert the suspicions of another one of his mistresses. He is given one order by the king and that is not to fall in love. The situation worsens when Merivel finds himself in love with his new wife. Eventually, the King finds out and relieves Merivel of his position and wealth. His fall from grace leaves Merivel where he first started. And through his travels and reunions with an old friend, he rediscovers his love for true medicine and what it really means to be a physician."],
      "budget": 12000000
   },
   "movielensId": 43,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1995-12-29",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Michael Hoffman"],
      "runtime": 117,
      "movieId": 43,
      "title": "Restoration",
      "mpaa": "R",
      "actors": [
         "Robert Downey Jr.",
         "Meg Ryan",
         "Sam Neill",
         "David Thewlis",
         "Hugh Grant",
         "Polly Walker",
         "Ian McKellen",
         "Ian McDiarmid",
         "Mary MacLeod",
         "Willie Ross",
         "Benjamin Whitrow",
         "Roger Ashton-Griffiths",
         "Andrew Havill",
         "Tony Gardner",
         "David Ryall"
      ],
      "imdbMovieId": "0114272",
      "originalTitle": "Restoration",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["CvsAuHYBgEQ"],
      "plotSummary": "An aspiring young physician, Robert Merivel found himself in the service of King Charles II and saves the life of someone close to the King. Merivel joins the King's court and lives the high life provided to someone of his position. Merivel is ordered to marry his King's mistress in order to divert the queens suspicions. He is given one order by the king and that is not to fall in love. The situation worsens when Merivel finds himself in love with his new wife. Eventually, the King finds out and relieves Merivel of his position and wealth. His fall from grace leaves Merivel where he first started. And through his travels and reunions with an old friend, he rediscovers his love for true medicine and what it really means to be a physician.",
      "tmdbMovieId": 35196,
      "avgRating": 3.46622,
      "releaseYear": "1995",
      "numRatings": 2664,
      "posterPath": "/aqQdEQ1ZVdzrREJxCoPzTlLgHVw.jpg"
   }
}