{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nevada",
            "id": 1197
         },
         {
            "name": "gold",
            "id": 1321
         },
         {
            "name": "birthday",
            "id": 1421
         },
         {
            "name": "treasure hunt",
            "id": 6956
         },
         {
            "name": "gold bar",
            "id": 7184
         },
         {
            "name": "friendship bracelet",
            "id": 7508
         },
         {
            "name": "cowboy",
            "id": 155291
         }
      ],
      "imdb_id": "tt0109439",
      "video": false,
      "title": "City Slickers II: The Legend of Curly's Gold",
      "recommendations": [
         1406,
         10859,
         11896,
         9080,
         14170,
         11718,
         11419,
         8986,
         11967,
         2617,
         14361,
         14671,
         8388,
         12772,
         26261,
         10169,
         13997,
         12518,
         14628,
         26603
      ],
      "backdrop_path": "/fasgMMAJG1Bet1oBk2yzVaYE3xV.jpg",
      "revenue": 43,
      "reviews": [{
         "author": "talisencrw",
         "id": "570f2392c3a368538b001e90",
         "content": "Let me start right off in saying that three reasons I enjoyed this film have absolutely nothing to do with cinema, and all three comprise the fine TV work I saw, while growing up in Canada in the 70's and 80's, that the stars Billy Crystal, Jack Palance and Jon Lovitz had made, in 'Soap', 'Ripley's Believe It or Not' and 'Saturday Night Live', respectively. I haven't even bothered seeing the original yet (the more highly-regarded work that surprisingly won a Best Supporting Actor Oscar for Palance).\r\n\r\nI cared not a single whit about the plot--it was just fun watching the stars interact and riff off of each other. I did feel that the direction lagged in places, and perhaps a more objective editor could have sliced 10-15 minutes off and no one would have been the wiser. Not bad considering it was a sequel--it's worth a couple of watches, though I'm not surprised, and I'm a tad relieved, that no more of them were made.",
         "url": "https://www.themoviedb.org/review/570f2392c3a368538b001e90"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mitch Robbins",
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1d3",
               "name": "Billy Crystal",
               "profile_path": "/22PBSROMN6GmD7uxHpTNb0Unftt.jpg",
               "id": 7904,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Phil Berquist",
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1d7",
               "name": "Daniel Stern",
               "profile_path": "/4dQb2rg4gajVuMOUTkmQx31GOyH.jpg",
               "id": 11511,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Glen Robbins",
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1db",
               "name": "Jon Lovitz",
               "profile_path": "/3Sw3X69m19FHSiSpv9cs4doBBfI.jpg",
               "id": 16165,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Duke Page",
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1df",
               "name": "Jack Palance",
               "profile_path": "/vVQxDsA4FVDRZm6Pm3ohjmuJFxh.jpg",
               "id": 3785,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Barbara Robbins",
               "gender": 1,
               "credit_id": "54dd22d692514119530002fe",
               "name": "Patricia Wettig",
               "profile_path": "/biCfIyLIL4HIV3rN2jlcTN3BWGF.jpg",
               "id": 33487,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bud",
               "gender": 2,
               "credit_id": "54dd22e6925141195a0002cc",
               "name": "Pruitt Taylor Vince",
               "profile_path": "/p3xmcGJ7IKCxw42lwQbg4WmwPTA.jpg",
               "id": 3201,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Matt",
               "gender": 2,
               "credit_id": "54dd2362c3a3684546000357",
               "name": "Bill McKinney",
               "profile_path": "/bXGJNizj5SbEFPjeBupnRxgwPq0.jpg",
               "id": 16555,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Holly Robbins",
               "gender": 0,
               "credit_id": "54dd237ac3a36845550002d5",
               "name": "Lindsay Crystal",
               "profile_path": null,
               "id": 33495,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Lois",
               "gender": 1,
               "credit_id": "54dd23bb9251411956000320",
               "name": "Beth Grant",
               "profile_path": "/zAT9GvzJE0ytL3C36L461cgKI9p.jpg",
               "id": 5151,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Dr. Jeffrey Sanborn",
               "gender": 2,
               "credit_id": "54dd244bc3a368455100033d",
               "name": "Bob Balaban",
               "profile_path": "/3g7IKz8ycv0opDxmpoBxsQkUslU.jpg",
               "id": 12438,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Clay Stone",
               "gender": 2,
               "credit_id": "54dd2abec3a368454b00032d",
               "name": "Noble Willingham",
               "profile_path": "/wJcquiMa4IVlJZBr7gvJXrbPsI0.jpg",
               "id": 31005,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Ira Shalowitz",
               "gender": 2,
               "credit_id": "54dd2addc3a3684541000402",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Barry Shalowitz",
               "gender": 2,
               "credit_id": "54dd2af3925141194d000364",
               "name": "Josh Mostel",
               "profile_path": "/jVG0WNJrTDEwETCDfoz0KxZ4vTd.jpg",
               "id": 33489,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Mitch's Father",
               "gender": 2,
               "credit_id": "56c7754892514152ee000040",
               "name": "Alan Charof",
               "profile_path": "/iZ5SIW9rlV2rkzdQu0EVvuduhwe.jpg",
               "id": 179562,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1e5",
               "name": "Paul Weiland",
               "profile_path": "/eTTmELMGFXFybc3Gl65jk6G71gn.jpg",
               "id": 66548,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1eb",
               "name": "Billy Crystal",
               "profile_path": "/22PBSROMN6GmD7uxHpTNb0Unftt.jpg",
               "id": 7904,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1f1",
               "name": "Billy Crystal",
               "profile_path": "/22PBSROMN6GmD7uxHpTNb0Unftt.jpg",
               "id": 7904,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1f7",
               "name": "Adrian Biddle",
               "profile_path": null,
               "id": 7783,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44239251416c7502a1fd",
               "name": "Marc Shaiman",
               "profile_path": "/aesoPh8jPR5qDKjjt7o5uj9kS3W.jpg",
               "id": 9251,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 8.391207,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11310,
      "vote_count": 124,
      "budget": 35,
      "overview": "On Mitch Robbins 40th birthday begins quite well until he returns home and finds his brother Glen, the black sheep of the family, in his sofa. Nevertheless he is about to have a wonderful birthday-night with his wife when he discovers a treasure map of Curly by chance. Together with Phil and unfortunately with Glen he tries to find the hidden gold of Curly's father in the desert of Arizona.",
      "similar": [
         9710,
         6637,
         9326,
         9838,
         10303,
         85,
         87,
         89,
         1996,
         217,
         2059,
         1995,
         17578,
         1572,
         10975,
         12227,
         11589,
         983,
         12715,
         27277
      ],
      "original_title": "City Slickers II: The Legend of Curly's Gold",
      "runtime": 116,
      "poster_path": "/gh0lsyJARglhpbKmnY8i8M7V5bI.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-06-10",
      "vote_average": 4.9,
      "belongs_to_collection": {
         "backdrop_path": "/qv2Bcy963o42k65v0km97G1ceZ4.jpg",
         "name": "City Slickers Collection",
         "id": 150156,
         "poster_path": "/1xHwbqIfBQvxNCkdJwQ5vxFwI5H.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Paul Weiland"],
      "runtime": 116,
      "synopsis": "Mitch awakens from a dream in which the old trailboss Curly from the first film, rises from the grave and drags him down. However, Mitch soon forgets the dream when the familiar voice of his Mom comes through the speakerphone, giving her recitation about the events that led to his birth, as today is Mitch's 40th birthday. Unlike his 39th, Mitch's outlook on life has changed. Going into work, he meets his friend Phil, who Mitch has gotten a job at the station in the wake of Phil's recent divorce. Phil admits he feels lonely in the wake of his divorce, and Mitch invites Phil to his place for his Birthday. On the train back, Mitch swears he sees Curly on the train, and discusses this with Phil. Phil believes that Mitch is seeing things, since they checked Curly before he was buried, and confirmed he was dead. When they arrive home, Mitch is shocked to find his younger brother Glen has arrived unexpectedly. Wanting to be alone with his wife, Mitch sends Glen home with Phil, but during the evening, Mitch looks through curly's belongings that he kept, and finds a map inside the old trailboss' hat. Showing it to Phil the next day, they analyze the map and surmise that it belonged to Curly's father, Lincoln Washburn. Hoping to find the treasure that is mentioned on it, Mitch and Phil head out West, bringing Glen along as well. Using the ruse that they are in Las Vegas, they rent equipment and head out to find the treasure. Unfortunately, Phil mentioned the treasure to the men who they rented the equipment from, who come after the group for the map. However, this is spoiled when a familiar face shows up! Mitch assumes his thoughts that Curly was not dead are correct, but their savior is Duke, Curly's brother. Duke had come looking for Mitch to get the map and claim his family's treasure. Mitch and Duke are first at odds with each other, but when Mitch explains to Duke how Curly explained his philosophy about life ('One thing, just one thing'), Duke is willing to let the men in on the treasure as well, provided that Duke gets half and the three of them have to split the other half amongst themselves. Eventually, the group is caught up in a stampeded, and the map is lost. Things seem grim until Glen tells the others that due to his photographic memory, he recalls the last part of the map's information. Eventually, the men find the gold, but are then set upon by bandits, who shoot Glen! However, it soon turns out that the bandits are just actors, when a familiar face shows up: Clay Stone, who was in charge of the ranch where Curly worked and where Mitch and his friends went the year before! Clay then provides the others with copies of a map exactly like what Curly had, claiming that this latest venture had been Curly's idea as a way to attract tourist: lead them on a treasure hunt and then be shot at by fake-bandits with paint pellets. Also, the gold is not real as well. With nothing left to find, Duke parts ways with the three men. Mitch returns to Las Vegas, preparing for Barbara to meet him there (having found out that he wasn't in Vegas for a business trip, Mitch has planned a last-minute reconciliation with her). However, Mitch is surprised when Duke shows up in his hotel room. It is here that Duke reveals a secret: the map that Curly had (and that was used for the tourist trap) had a piece missing from a corner. Duke then provides the missing corner, showing that the treasure was reburied a ways off. Mitch thinks that Duke is joking with him, until Duke reveals a solid-gold bar...the real thing! \"It's got friends,\" the old man tells Mitch.",
      "writers": [
         "Lowell Ganz",
         "Babaloo Mandel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109439/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MzE1MjA3Nl5BMl5BanBnXkFtZTcwMTU4MDcxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Billy Crystal, Jack Palance, Daniel Stern | See full cast and crew »"],
      "reviews": [
         "I found this film much more fun and fulfilling than the first because of the addition of Jon Lovitz to the base cast. I realize this goes against common opinion, but I believe this installment was much better executed. The first movie, when compared to this sequel, feels like the main characters had something to prove to one another and not just to themselves where this chapter feels more self-motivated and \"real,\" primarily to the addition of Jon Lovitz One thing is for sure, without the City Slickers' version of the Criterion Brothers as ranch hands, it was definitely more enjoyable for me. The \"danger\" sequences were slim and short while maintaining a tall adventure. Instead of using the first third of the movie to develop all the characters, they catch you up on Phil and Mitch and then lovingly introduce you to Glen. It left more time for the actual movie and less time for the \"you must grow up to be a warrior\" speeches and diatribes. I loved it! Jon Lovitz is awesome! It rates an 8.7/10 from... the Fiend :.",
         "I don't have a problem with sequels because many times I find them more appealing than the original. This is another example, although not a wide margin. The first was good; this is a little better. Despite being almost two hours which is long for a comedy, this moves very fast. That's the selling point of the movie: it's entertaining. Not only do you get a comedy with a lot of laughs, you get brilliant Western scenery enhanced by the widescreen DVD. The negatives, at least for me, was the all-too-secular outlook on life and an obsession with sex espoused by lead actor Billy Crystal and his clueless buddies Daniel Stern and Jon Lovitz and the unnecessary profanity by Jack Palance. All the characters, however, are definitely fun to watch and there is a good message in the end about sacrificing for friends and relatives. The story also features a very neat twist at the end. This is a film you can laugh at with multiple viewings.",
         "I don't know why it took me so long to see this sequel. It has been so long since I saw the original that I can't make a comparison. But Billy Crystal gave as good a performance as usual, and Jon Lovitz was a worthwhile addition as Crystal's idiotic brother. Jack Palance gave another Oscar-winning performance as the sailor-turned-restaurant-pirate who hoped his late brother knew a big secret (too bad those who decide Academy Award nominations didn't agree). It took a while to get to the quest for \"Curly's Gold\", but even the early parts of the movie were entertaining. The search for gold was the best part, with these bumbling idiots, and Duke, getting into all kinds of trouble. Plenty of action, and beautiful scenery, and lots of physical comedy. I wasn't all that happy with the ending, but the reality is, can a group of ordinary guys really be happy if they find millions of dollars in gold? I won't say what went wrong in their quest, but they did get to be really, really happy at one point, and that was satisfying. The real gold here was Duke's telling of his life story, and the guys working together despite incredible odds. This was probably as good as the first movie for those reasons.",
         "Now turning 40, Mitch Roberts is at ease with himself and full of confidence. He is doing well at work his marriage is good and he is happy. His friend Phil is causing him some trouble as he has Mitch's old job but isn't working well and further stress arrives for Mitch in the shape of his deadbeat brother Glen. However the trio get excited when Mitch discovers a map to hidden gold in the lining of Curly's hat. But can the group recover the gold successfully? Is it even real? And is Mitch just imagining that Curly has come back from the grave to haunt him? I saw this years ago in the cinema and had vague memories of it as being pretty good. I saw it a few nights ago on TV and have to say that my memory has not served me well. The plot here is silly \u0096 any excuse to get three wise-crackers out on horses again in the wild west. The way they manage to rope Jack Palance back in doesn't really work and hurts the feel of the film. In the original Palance worked but here it feels like he's been shoehorned into it and that he's forced to over egg the cake. The film has a few good lines and laughs but too often it just repeats jokes from the first film to lesser effect. It's a shame because the film is freed from the sentimental soul searching that bogged down the latter stages of the original. However it does nothing with this freedom. I'm sure I remembered this as a comic adventure yarn, again I was mistaken. The same old jokes but it lacks a soul or a centre. The original may have been a little sentimental but it complimented the comedy for the most part \u0096 here that is missing, and it hurts. Crystal delivers his lines with vigour and is funny \u0096 I always find him funny! But at times he does look like he's on autopilot. Stern is also just treading the same old material over and is only so-so. Kirby decides not to return so Lovitz replaces him and actually does alright. However his brand of humour isn't as good as Crystal and the two don't gel \u0096 although he does get some good laughs. Palance tries again but the Oscar magic isn't there and I couldn't help feel he took away from his original role somewhat. Overall this is amusing at best but really pales against the original (which wasn't a classic itself). The action isn't up to much and the comedy only delivers a few laughs, preferring instead to retread as many of the original's jokes as possible.",
         "A lot of the time I avoid sequels to successful comedies, but \"City Slickers II\" received some fairly good ratings, so I decided to check it out. Unfortunately, I found this film just not funny or emotional enough, and it felt a bit unoriginal. There are some things that had potential, such as Billy Crystal thinking he sees his old friend Curly at several places, as well as his dream at the beginning of the film, which was worth a few laughs. One problem is that the jokes just do not feel original here, and this film uses the exact same gag from the previous film in which Crystal mouths the words his mother says when she calls on the phone. Neither Crystal or Daniel Stern is very funny here. Jack Palance is pretty good, but not flawless as with the previous movie that won him an Oscar. One downfall to this film is the addition of Jon Lovitz, who cannot act and behave like a child most of the time. There were good scenes, such as Palance discussing his relationship with his brother and such, but ultimately the film becomes cheesy and anticlimactic. There are some fairly off-color scenes as well, one thing that earned this film a PG-13 rating. If you want my advice, stick with the original, a funny film that had good jokes, emotion, and even some lessons, and somehow felt like an original, good comedy. **1/2 out of ****",
         "\"City Slickers II: The Legend of Curly's Gold\" brings back Billy Crystal as Mitch Robbins, and Daniel Stern as Phil Berquist, plus a new cast member: Jon Lovitz, playing Crystal's brother Glen. Okay, so \"Slickers II\" isn't as funny as the first. I agree. However, I think it does have some laughs, and generates enough to recommend, especially if you are a fan of the original. The basic plot of this film is that Crystal and pals find Duke (Jack Palance. Yes, I wrote Jack Palance. Read on for explanations) -- Curly's twin brother (See? Now it makes sense, right?) -- or rather, he finds them. After letting them in on a secret that there's buried treasure in a cave somewhere out in the yonder, and that Duke wants Crystal to help him find it, we're all geared up and ready for more City Slickers. Really, the \"plot\" is just a worthless excuse to see familiar faces in a big Arizona desert. But, a lot of sequels have throwaway plots, and I think there's a bit of magic to this one. Of course it's contrived and silly, but it's like a bunch of little kids following a sketched treasure map. It's fun to watch, and brings back fond memories. I recommend City Slickers II: The Legend of Curly's Gold. It's not great, but it's fun, and worth a few bucks on a Friday night. 3/5 stars- John Ulmer",
         "I'm willing to forgive the fact that Billy Crystal declared this movie better than the first one and overlook the very contrived inclusion of former cattle drive participants as well as an evil twin. All that notwithstanding, this sad sequel forgets the honest and genuine drama that was at the heart of the original film and replaces it with dopey, juvenile humor and an egregious attempt at sentimentality. We get to hear the same boring, recycled jokes from the first movie beginning with the birthday morning phone call, to the dialogue about setting VCRs, to the same dumb joke, \"He's behind me isn't he?\" I know Crystal's irritating screaming is always good for a chuckle, isn't it? It just goes to show if a joke doesn't work the first time, use it again, only louder. If you're a Jon Lovitz fan and want to see him do a halfway decent attempt at drama rather than his schmaltzy performance in this movie, I recommend Mr. Destiny. If you want to see Billy Crystal do drama, don't. I'll admit that I did like this movie when it first came out, but I've since graduated from Junior High. This movie was an overall eye-rolling train wreck which was only made to capitalize on the laurels of the first one.",
         "SPOILERS Sequels can often be a mistake. Rarely as good as the first, they can even sometimes cause detrimental effects to the predecessor. In 1994 then so many must have questioned the logic in creating a sequel to the hit film \"City Slickers\" from three years before. As far as sequels go though, \"City Slickers II: The Legend of Curly's Gold\" isn't that bad. Yes it's not as good as the first film and there are times you groan with disapproval, but for the most part it is an entertaining follow on to the previous film. Mitch Robbins (Billy Crystal) has turned 40. Preparing for a celebratory night of passion with his wife (Patricia Wettig), Mitch accidentally stumbles across a map in an old friends hat. Believing it to lead to gold, Mitch, best friend Phil (Daniel Stern) and \"Godfather\" quoting brother Glen (Jon Lovitz) head once more back into the desert. Clearly believing it's viewers have seen the original, this story, written by the same pairing of Lowell Ganz and Babaloo Mandel, is not afraid to put in constant references to the earlier work. Copying events which happened a year previously, lines are tributes of \"City Slickers\" and jokes are even part reconstructions. In effect, part II is almost exactly more of the same. If you decide to repeat the original, then that isn't necessarily a problem. Bringing back Crystal, Stern, one or two other cameos and even Jack Palance (Oscar nominated for the first film), the matrix is the same and the jokes do flow. Taking ideas like the Shalowitz brothers ice-cream knowledge and changing it into Glen's letter counting skills, the film picks up old notions and jumbles them around to come up with something new. The unfortunate truth of the matter though is that if you DO decide to just rehash a lot of the jokes and use the same cast and layout, then your going to loose something of the original. Amazingly, even though it was released only three years after the first film, this new part does feel a considerably more modern equivalent. With harsher colours and a more exaggerated opening animation, it feels almost like a remake. It also lacks the unique feel that the first film possessed. Introducing the characters for the first time, playing that music for the first time, stuff like that. It's like an old reunion where you meet up with the people you used to be friends with and go through the motions as if your young again. You can have a lot of fun, but you can never go back. \"City Slickers II\" is fun. It's unashamed lighthearted fun which feels like more of a remake and tribute than a sequel to it's predecessor. Bringing back most of the old cast, it feels just like the continuation of the story. For the most part this is a good thing. Once more you watch Mitch and Phil as they roam the desert. You laugh with them, you reminisce with them, you bond with them. Ultimately though, something is missing. The originality of the first film isn't there and whilst the film is still great to watch, it's not as good as it's predecessor. Fun though.",
         "Its an all star cast with Billy Crystal, Daniel Stern, Jon Lovitz, and Jack Palance. I thought it wouldn't be very good, since it was a sequel,but, I was wrong. Jon Lovitz is the new character after Bruno Kirby left, and plays Billy Crystal's brother, and plays him well. Lovitz role in this film is one of his career best with the exception of \"A League of Their Own\". In this sequel to City Slickers (1991), the boys are on a treasure hunt for Curly's lost gold. They get into a lot of trouble, and mix-ups along the way. The part where Phil thinks a snake may have bit him is really funny too. It is a roller-coaster ride of fun. I give it a 8 out of 10.",
         "'City Slickers II' is perfectly watchable without giving us a single reason why it needed to exist. It's sort of fun, and there are some genuinely funny lines scattered about (the whole 'Pass the Phil' scene) but the first film was one of the finest comedies ever made, and this isn't. Signs of desperation trickle through the movie like a cinematic flop sweat. As the plot mechanics groan in order to get Billy Crystal and Daniel Stern back in the saddle, we're first introduced to Curly's identical twin brother - a contrived way to get Jack Palance back - and then Crystal's brother (Jon Lovitz) fills the gap left by Bruno Kirby, a character you would think might have come up in all those conversations about family in the original movie. The happy ending for Stern's character is unfortunately reversed, which just seems a bit mean-spirited. While it's likable, this has nothing like the depth or poignancy or sheer avalanche of hilarious, character-based dialogue that the first movie had. This is far more of a bland and straightforward adventure with a few funny bits, and there's no getting past the fact that 'City Slickers' didn't need a sequel and the one we have really isn't good enough."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Western"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Columbia Pictures Corporation",
         "Face Productions"
      ],
      "summaries": [
         "The second part of City Slickers begins after the death of Curly. It is the 40th birthday of Mitch Robbins and the day begins quite good until he returns home (after a hard day at the radio station) and finds his brother Glen, the black sheep of the family, in his sofa. Nevertheless he is about to have a wonderful birthday-night with his wife when he discovers a treasure map of Curly by chance. Together with Phil (from the first part) and unfortunately with Glen he tries to find the hidden gold of Curly's father in the desert of Arizona instead of attending a meeting in Las Vegas. The adventurous journey reveals many surprises until everything seems to be over when the map gets lost...",
         "Shortly after their first western adventure, Mitch Robbins and his friends discover a treasure map that belonged to their late trail guide Curly and set out to discover its secrets."
      ],
      "budget": 40000000
   },
   "movielensId": 432,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Pусский"
      ],
      "releaseDate": "1994-06-10",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Paul Weiland"],
      "runtime": 116,
      "movieId": 432,
      "title": "City Slickers II: The Legend of Curly's Gold",
      "mpaa": "PG-13",
      "actors": [
         "Billy Crystal",
         "Daniel Stern",
         "Jon Lovitz",
         "Jack Palance",
         "Patricia Wettig",
         "Pruitt Taylor Vince",
         "Bill McKinney",
         "Lindsay Crystal",
         "Beth Grant",
         "Bob Balaban",
         "Noble Willingham",
         "David Paymer",
         "Josh Mostel",
         "Alan Charof"
      ],
      "imdbMovieId": "0109439",
      "originalTitle": "City Slickers II: The Legend of Curly's Gold",
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": ["LSfvuACPzHg"],
      "plotSummary": "On Mitch Robbins 40th birthday begins quite well until he returns home and finds his brother Glen, the black sheep of the family, in his sofa. Nevertheless he is about to have a wonderful birthday-night with his wife when he discovers a treasure map of Curly by chance. Together with Phil and unfortunately with Glen he tries to find the hidden gold of Curly's father in the desert of Arizona.",
      "tmdbMovieId": 11310,
      "avgRating": 2.72024,
      "releaseYear": "1994",
      "numRatings": 13921,
      "posterPath": "/gh0lsyJARglhpbKmnY8i8M7V5bI.jpg"
   }
}