{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109443",
      "video": false,
      "title": "Clean Slate",
      "recommendations": [
         24073,
         26261,
         77530,
         30467,
         20759,
         44664,
         40624,
         38966,
         26352,
         41805,
         88863,
         32330,
         14603,
         96314,
         44895,
         26156,
         27993,
         19326,
         16784,
         19760
      ],
      "backdrop_path": "/qt3upsZUFpDGLZRyDTXR4xkLNbs.jpg",
      "revenue": 7355425,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Maurice L. Pogue",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcb5",
               "name": "Dana Carvey",
               "profile_path": "/1SyPT9N3J3NAycz89JmSmPd2xZ7.jpg",
               "id": 56159,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah Novak / Beth Holly",
               "gender": 1,
               "credit_id": "52fe478f9251416c7509dcb9",
               "name": "Valeria Golino",
               "profile_path": "/6UmnZGoZkmqMrkTY1roIkCzB4rn.jpg",
               "id": 3124,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "John Dolby",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcbd",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rosenheim",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcc1",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Cornell",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcc5",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dr. Doover",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcc9",
               "name": "Michael Murphy",
               "profile_path": "/ebbKhFgIHugUywSL5udMFNfRxvQ.jpg",
               "id": 4776,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Paula",
               "gender": 1,
               "credit_id": "52fe478f9251416c7509dccd",
               "name": "Jayne Brook",
               "profile_path": "/adrS4ZwaRgXpnJpV2U7uiFU9Cmd.jpg",
               "id": 11627,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Hendrix",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcd1",
               "name": "Vyto Ruginis",
               "profile_path": "/dDZyaISuF9FVK18nTmsuDgOpyKl.jpg",
               "id": 61216,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Judy",
               "gender": 1,
               "credit_id": "52fe478f9251416c7509dcd5",
               "name": "Olivia d'Abo",
               "profile_path": "/l7m7nw7wQFvc2ROXOTa4Flblh4M.jpg",
               "id": 46423,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Shirley Pogue",
               "gender": 1,
               "credit_id": "52fe478f9251416c7509dcd9",
               "name": "Angela Paton",
               "profile_path": "/eJZpJyEuMT4mQ8d8tbU0addZ1kD.jpg",
               "id": 1537,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Bodyguard #1",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcdd",
               "name": "Mark Bringelson",
               "profile_path": "/kbQDiLpWbXWMDWlrm8FNXNT4WWY.jpg",
               "id": 15443,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Bodyguard #2",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dce1",
               "name": "Christopher Meloni",
               "profile_path": "/qUxRtuQxWcuaUitnKoTyKgeIitu.jpg",
               "id": 22227,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Stanley",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dce5",
               "name": "Timothy Scott",
               "profile_path": "/1KXqxseXqcbkQTHvybJArdLtdbs.jpg",
               "id": 83411,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Judge Block",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dce9",
               "name": "Gailard Sartain",
               "profile_path": "/QFQlZdsM0QEUDWll19fgnxALYq.jpg",
               "id": 2886,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Mort",
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dced",
               "name": "Robert Wisdom",
               "profile_path": "/zAoS4BCgTOJHA88wD7lmjlXOfnP.jpg",
               "id": 21505,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Leader",
               "gender": 2,
               "credit_id": "5907edc79251416492004fb2",
               "name": "Ian Abercrombie",
               "profile_path": "/uywWX3MCmr9N2WFBcsInPzGFV4X.jpg",
               "id": 11764,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe478f9251416c7509dcf3",
               "name": "Gary Daigler",
               "profile_path": null,
               "id": 83412,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe478f9251416c7509dcf9",
               "name": "Lili Fini Zanuck",
               "profile_path": "/qowwpTsd4cJAlmdi7Bb4tARL3IP.jpg",
               "id": 5707,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dcff",
               "name": "Richard D. Zanuck",
               "profile_path": "/uoPXQ29L8vlphMuojaBlmuwi1Mu.jpg",
               "id": 1297,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dd05",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe478f9251416c7509dd11",
               "name": "Mick Jackson",
               "profile_path": "/eZKzRhgiX0fTNz6twzIOeaLMOJB.jpg",
               "id": 8843,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "550fc3a59251410701004896",
               "name": "Robert King",
               "profile_path": "/fCeDPxdYWQDkbFKvDFQr8Csyi8T.jpg",
               "id": 1224549,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5531077cc3a3680f42001752",
               "name": "Andrew Dunn",
               "profile_path": "/vguhffdvBgtxb5Hl08PKZl160en.jpg",
               "id": 8846,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 2.351457,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18658,
      "vote_count": 26,
      "budget": 0,
      "overview": "Pogue is a private eye with a problem: every morning when he wakes up, he has total amnesia, waking up with a 'blank slate'. Since he is in the middle of a hot investigation and has a developing romance, this is less than convenient.",
      "similar": [],
      "original_title": "Clean Slate",
      "runtime": 107,
      "poster_path": "/kAYsvQvBVshLHGTIDGHcj9jTJq0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1994-05-06",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mick Jackson"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Robert King"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109443/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU0NTkwMTQ0OF5BMl5BanBnXkFtZTcwNTYwMTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dana Carvey, Valeria Golino, James Earl Jones | See full cast and crew »"],
      "reviews": [
         "Interesting premise with many surprisingly funny moments. It's not Oscar Wild - but not low-brow either. The humour is unusually under-played at times - which makes a refreshing change. There are jokes here that you don't necessarily get the first time around - particularly liked the later explanation for the mural painters many attempts at Mona Lisa - + a nice tie in to the film title. It could have been a little 'sick' - but the medical condition is used to tasteful effect (I thought) - without milking it dry. So clearly the inspiration for Mememto that I'm surprised there wasn't more comment at the time. The 'system' for remembering things, and the abuse made of the illness by those in the know.....all directly lifted by the later Mememto - albeit in a more serious genre. Not sure how I missed this at the time - and much better than the current score of 5.5 suggests.",
         "Okay, But Not Memorable (Pun Intended) I didn't find this as humorous as I had hoped to find after Carvey's hit \"Wayne World\" farces. The high, in a dark humor-ish vein, was the dog in the film. The mutt who had a depth perception problem and kept running into things, was easily the best character in the movie. The premise was fine: a private detective (Dana Carvey playing \"Maurice Pogue\") with short term memory loss, meaning the following day he keeps forgetting what happened the previous 24 hours. Add a femme fatale and some wild gangsters, and this film should have been hilarious....but it wasn't. The running gags with Pogue faking things all the time because of the memory problems is what became annoying. Part of the problem might have been casting. Carvey looks like anything but a hard-boiled detective. Also, although I did laugh at some things, we have a modern-day comedy more needless sexual innuendos, sado-masochism offered and the like. Why? If you have a good comedian and a good story, you don't need that garbage. I think most Carvey fans were disappointed with this film.",
         "\"Clean Slate\" is a funny movie. I was one of the few people who saw this in theaters and its been a favorite ever since. A guy who loses his memory every night allows for some great comedic possibilities and the movie delivers. Dana Carvey is such a funny actor. I'd love to see him get more starring opportunities. Also great in this movie is the dog. This is a fantastic comedy. Anyone should enjoy it and laugh a lot.",
         "Pogue (Dana Carvey) wakes up one morning in Venice, California and doesn't remember a darn thing about his life. Suffering from daily short term memory loss, way before Drew Barrymore did, Pogue listens to a tape he made the day before. It states he is a private detective and that he has been called upon to testify against a gangster (Michael Gambon) who blew up an automobile containing Pogue's lovely girlfriend, Sara (Valeria Golino). Yet, Sara appears on his doorstep and asks for his help. How can this be? She directs him to follow her to a fashion show, where she will tell him more. In the meantime, Pogue is \"arrested\" by police officers, who take him to a surprise birthday party, where he is the guest of honor. It seems Pogue used to be a policeman and had contact with a D.A. (James Earl Jones), an assistant D.A. (Kevin Pollack) and others. But, Pogue fails to recognize anything that will jog his memory, not even with a doctor's help (Michael Murphy). Will Pogue and his darling canine, Baby, be able to dodge the bullets of those out to prevent him from testifying, without knowing exactly what is going down? This is a nice little film with a very fine cast. Jones is always welcome and Pollack is acidly funny most of the time, too. Golino is very lovely and Gambon is quite amusing as the designated gangster. As for Carvey, he has such great comic skills that it is a shame that he never gets to attain his usual \"go for broke\" humor, but he is still funny and a very attractive performer in his own right. Kudos to the little dog in the movie, too, as he is highly entertaining. As for the costumes, sets, and production values, they are quite adequate, and the script and direction show decided originality and zest. In short, if you love Carvey, you will like this film, even though his humor has been toned down. But, truly, anyone who loves off-the-beaten-path comedy films will embrace this one with zeal.",
         "This is a hight quality movie, in that it's not like Austin Powers where it's just kind of silly, weird humor (and don't get me wrong on that, I LOVED Austin Powers). If you're looking for a movie with a good story line (and by the way there are some serious parts along the way that spices it up) and good quality humor, believe me, this is the one. It's hilarious and you will be laughing from your belly. It made ME crack up. There's only a select few movies that Dana's been in, but this one was one of his best. He really showed off his how funny he really is in this one, and, like I said, what's even more worthwhile about this movie is that it actually has a plot and it's a good one.",
         "This movie is one of my favorite comedies. I saw it before I knew that Dana Carvey was Garth from Wayne's World (this was before my great interest in Cinema and now know everything about films in the '90s and '00s). I found it to be very entertaining and have seen it many times since. I love it when an ex-SNL actor is able to star in a movie that is not based on a Character they did on SNL (Mike Myers in So I Married and Axe Murderer, Adam Sandler in Billy Madison, and Chris Farley, David Spade in Tommy Boy). Carvey has this charm about him as seeming like a regular guy. He does not seem like the Hollywood type. I think he is highly underrated and I hope he can find his niche again. Clean Slate is the comedy version of Memento, or Memento is the serious version of Clean Slate. I heard that Adam Sandler was producing a script Dan Carvey wrote, so I hope something comes of that.",
         "I loved Clean Slate, very funny movie. I know the critics weren't too crazy about it, but I love it! This film and it's lead actor Dana Carvey, deserve more respect. Though his movies may not be great(with the exception of Wayne's World 1 and 2)he is a very talented comedian. I give this film 4 stars****",
         "Dana Carvey is an excellent comedian, and this movie makes good use of his many talents. \"Clean Slate\" is a situation comedy with a decent setup, but what makes the movie is Dana's interpretation of the confused guy who has to untangle a mess he doesn't know anything about. His facial expressions are hilarious, and his delivery perfect. This is one of my favorite movies. The movie it best compares to is \"So I married an axe murderer\" in the sense that it follows a funny guy and a fox as they try to untangle themselves from a series of embarrassing situations, all the while trying to solve the underlying mystery.",
         "Dana Carvey, one of the most talented SNL alumni ever, shows that not all of his movies suck in this hilarious movie. Dana Carvey is outstandingly funny, and the whole situation is so bizarre that it's quite amusing. Why do the critics hate this movie so much? This movie is definitely worth watching.",
         "Dana Carvey's performance as a private eye who forgets everything he learns by morning is truly exceptional. Clean Slate is an underrated movie that deserved a lot better recognition than it got! This movie was funnier than all the performances Dana did on Saturday Night Live combined. In this one, Dana Carvey plays Maurice Pogue, a private eye who must remember every little thing about a crime he is investigating. He teams up with a woman who helps him along the way. Clean Slate is a roller coaster ride of a comedy. Every situation our hero gets into will keep you wanting for more. Another good thing about this movie is that it never seemed to run out of any sight gags like in some comedies of nowadays. It had an array of colorful characters, a well-written plot, surreal sight gags, and it's just plain fun for anyone who is a fan of Dana Carvey. Wayne and Garth? Who are they, anyway? Want to have some good clean fun? Then Clean Slate is the one! It's Dana Carvey at his best! I give it 5 stars!"
      ],
      "genres": [
         "Comedy",
         "Mystery"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Zanuck Company, The"
      ],
      "summaries": [
         "Pogue is a private eye with a problem: every morning when he wakes up, he has total amnesia, waking up with a 'blank slate'. Since he is in the middle of a hot investigation and has a developing romance, this is less than convenient.",
         "A private eye who has amnesia must go to court about a kingpin's murder."
      ],
      "budget": 0
   },
   "movielensId": 433,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-05-06",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["Mick Jackson"],
      "runtime": 107,
      "movieId": 433,
      "title": "Clean Slate",
      "mpaa": "PG-13",
      "actors": [
         "Dana Carvey",
         "Valeria Golino",
         "James Earl Jones",
         "Kevin Pollak",
         "Michael Gambon",
         "Michael Murphy",
         "Jayne Brook",
         "Vyto Ruginis",
         "Olivia d'Abo",
         "Angela Paton",
         "Mark Bringelson",
         "Christopher Meloni",
         "Timothy Scott",
         "Gailard Sartain",
         "Robert Wisdom",
         "Ian Abercrombie"
      ],
      "imdbMovieId": "0109443",
      "originalTitle": "Clean Slate",
      "genres": [
         "Comedy",
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": ["b_XwjGA59lQ"],
      "plotSummary": "Pogue is a private eye with a problem: every morning when he wakes up, he has total amnesia, waking up with a 'blank slate'. Since he is in the middle of a hot investigation and has a developing romance, this is less than convenient.",
      "tmdbMovieId": 18658,
      "avgRating": 2.91719,
      "releaseYear": "1994",
      "numRatings": 1280,
      "posterPath": "/kAYsvQvBVshLHGTIDGHcj9jTJq0.jpg"
   }
}