{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "winging into a wall",
            "id": 177637
         },
         {
            "name": "infra red",
            "id": 177648
         },
         {
            "name": "photo album epilogue",
            "id": 177652
         },
         {
            "name": "jumper cable",
            "id": 177656
         },
         {
            "name": "rude waiter",
            "id": 177658
         },
         {
            "name": "sitcom",
            "id": 193171
         }
      ],
      "imdb_id": "tt0109480",
      "video": false,
      "title": "Cops & Robbersons",
      "recommendations": [
         16384,
         14170,
         11933,
         27224,
         24070,
         18658,
         9409,
         6470,
         71142,
         23752,
         28117,
         9401,
         29621,
         2107,
         23303,
         2620,
         10859,
         10467,
         45225,
         18316
      ],
      "backdrop_path": "/kwiNOcYygMdJwwx4wyXxs81Xy39.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Norman Robberson",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e2b",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jake Stone",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e2f",
               "name": "Jack Palance",
               "profile_path": "/vVQxDsA4FVDRZm6Pm3ohjmuJFxh.jpg",
               "id": 3785,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Helen Robberson",
               "gender": 1,
               "credit_id": "52fe44f6c3a368484e040e33",
               "name": "Dianne Wiest",
               "profile_path": "/sWm7Oar69rHGJzKgcP4iutwUmLb.jpg",
               "id": 1902,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Osborn",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e37",
               "name": "Robert Davi",
               "profile_path": "/eJoUfpgI5TDUqc4vgq3dPaqlMku.jpg",
               "id": 2055,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tony Moore",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e3b",
               "name": "David Barry Gray",
               "profile_path": null,
               "id": 94974,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Kevin Robberson",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e3f",
               "name": "Jason James Richter",
               "profile_path": "/sdFFQNefNEfiFiyIL8Sz6IweUkM.jpg",
               "id": 18259,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Cindy Robberson",
               "gender": 1,
               "credit_id": "52fe44f6c3a368484e040e43",
               "name": "Fay Masterson",
               "profile_path": "/rjNb7ZDq00KqhFHwuinSge5Iv8i.jpg",
               "id": 65409,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Billy Robberson",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e47",
               "name": "Miko Hughes",
               "profile_path": "/hpteoojNUAomlQVbiL4eSjUeJ4K.jpg",
               "id": 8186,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e21",
               "name": "Michael Ritchie",
               "profile_path": "/62566NoTLMRVLdoE07RG1B55zxy.jpg",
               "id": 12964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040e27",
               "name": "Bernie Somers",
               "profile_path": null,
               "id": 94973,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.680892,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26261,
      "vote_count": 44,
      "budget": 0,
      "overview": "Hard-as-nails cop Jake Stone moves in with the Robbersons so he can watch a hitman who has moved in next door. The Hitman is one thing, but can you survive the Robberson family.",
      "similar": [
         264085,
         30002,
         173385,
         103392,
         428627,
         260487,
         103807,
         461418,
         181000,
         381397,
         111618,
         497846,
         232366,
         458934,
         471581,
         393904,
         460426,
         324788,
         294527,
         306814
      ],
      "original_title": "Cops & Robbersons",
      "runtime": 93,
      "poster_path": "/wnkWgFU5UcLwbExCp1YtCg5Ox4E.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1994-04-15",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Ritchie"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Bernie Somers"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109480/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5Njg0MjE5OF5BMl5BanBnXkFtZTcwOTE1MjUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Chevy Chase, Jack Palance, Dianne Wiest | See full cast and crew »"],
      "reviews": [
         "This is a truly funny film that the whole family can watch, and enjoy. Amazing! Mom cooks enough food for a White House reception, the kids are mostly normal except the youngest, who is channeling Bela Lugosi as Dracula, and Dad can't get a bagel without cream cheese on it. The cops are standard film cops except that Jack Palance is even more overpowering than usual. His best line (you have to be there) is \"Never throw a cat at me again.\" He never yells, although he has plentiful provocation. This is refreshing; we laughed through the whole movie.",
         "I was actually quite shocked to see the only comment say this movie was very bad. My husband and I had a pretty good laugh with this one and were quite entertained. It's not going to be everyone's taste but if you like slapstick mingled with a bit of stupidity it's right up your alley. I will agree that it is no National Lampoon (Animal House) but it does follow in the same vein as the \"Vacation\" movies though. Chevy and Dianne made a great couple and have a great sense of timing that is so important to a good comedy. Chevy's character similar to \"Vacation\" develops from an disrespected head of the house to a respected Father. Don't pass this one by.",
         "For those of you who shop at Wal-Mart, look in the $5.50 DVD bin for this one, one of the most underrated movies of all time. Notice how in other people's comments that not a single one tells you why this film doesn't work. I can only guess that people who didn't like this just have a tight-assed sense of humor. Chevy Chase is every bit as funny in this movie as he always has been. There's even some emotional depth to the film when Jack Palance's character tries to fend off the Robberson's affection for him. To the dim lightbulbs who posted how much you loved The Truth About Cats & Dogs, and While You Were Sleeping to name a few mothballed, forgettable movies and to pass on this movie along with such classics as Liar, Liar, The Golden Child and Memoirs of an Invisible Man, I hope I never meet you at Blockbuster when I ask for a good comedy.",
         "I accidentally fell upon a showing of this comedy on a night show on TV, and was immediately drawn into the films parody music. I got a good feeling for what's worth to watch. But I had never heard about the movie before. And boy, was I right. I looked this up on IMDb, after watching what I thought was a charming and hilarious movie, and was baffled about a score of 4,7. I understand this film didn't hit the right spots back in 1994, but I'll tell you: That was wrong then, and it's wrong now. If it felt was right to bash this back in 1994, this is still what should be considered as a gem now. The film is a typical Chevy Case movie from the 80'ies and 90'ies. It's almost like the Fletch movies or the National Lampoon's best vacation movies. But then, it's also Fletch- director Michael Ritchie. What's worse; this is rated at Ritchie's worst movie. Well, it's so wrong! I laughed way more then I have in many recent movies. Here Chase is doing a great job of a cops and robbers story, where Chase's strange family, called the Robbersons, is encountered by and awful lot of challenges, as he is when on his best. Jack Palance is great as the old \"Dr. Jeckyll and Mister Hyde\"-detective, and so is Robert Davi as the scaring and dangerous Osborn, which is staked out from Robbersons house, as their new neighbor. Diane Weist is lovely naive is the wife, and the kids are also great, with extra kudos to Miko Hughes as the youngest son with a Dracula-mania. He is so funny! This film is stupidly funny. It's silly, and it gets sillier the longer into the film you get, In the good way. It's charming, with hitchcockian mystery music, it's well played, an it's funny without full of foul language, being harassing or embarrassing the wrong way, like many comedies do now.This is plain funny, with stupid persons, which is all quite lovable. In style of \"Dumb and dumber\" I recommend this for the whole family.",
         "Chevy Chase's family comedy \"Cops and Robbersons\" might have been made during the period where his box-office success was in a rapid decline (as this was somewhat a flop and the previous two before it), but I've always have a soft spot for this professional looking, but farcical comedy outing and that was mainly for the amusingly dry performance of Jack Palance as a weathered detective. Norman Robberson is a mild-mannered accountant who spends his free time watching TV cop shows. Soon enough he's living that life, when detective Jack Stone and his partner use his house as a stakeout to watch his neighbour that's a dangerous counterfeiter. Stone then finds himself caught up with the family and Norman's cop show obsession could just endanger the whole operation. As much as I enjoy watching a Chevy Chase film, it does pale in comparison to his early work but watching it again it surprised me how well it actually stood up. While not overly funny, it kept me watching. Teaming up again with Michael Ritchie the director of his smash 1985 hit \"Fletch\", Ritchie and Chase might not have the luxury of that smart script, but \"Cops and Robbersons\" is still sprightly written with the odd witty remark and amusing depictions of middle class suburbia. It's a typical formula, but it raises some inspired shenanigans if growing a little repetitive with its choices. Thinking about it, there was probably just not enough humour there or effectively brought across. It's madcap, accidental gags relying more so on the psychical and visuals with comical interactions between the dysfunctional characters. Ritchie's direction is straight-up, competently tidy with a slick streamline to it and having confidence in his timing. The cast balances out quite nicely. Chase gives his usual quick-on-the-feet performance, while alongside him Palance superbly grits his teeth. Dianne West is equally good with a level-head turn and Robert Davi suitably goes with a mock serious approach in a pigeon hold villain role. There's decent support by David Barry Gray, Jason James Richter, Fay Masterson, Miko Hughes and Richard Romanus.",
         "Chevy Chase and Jack Palance are both great actors and with Diane Wiest playing as a wanna-be good mother this movie is great. The way that Palance acts around Chase is great. This is on my must see list",
         "30 minutes into 'Cops and Robbersons' I found myself clawing at the sides of my seat cushion. An hour into it I found myself with my head down tugging at my hair and groaning loudly. This sounds a bit childish so I will elaborate. 'Cops and Robbersons' is a terribly unfunny movie made by talented people who have made excellent films and stars actors who have made me laugh in the past so it is frustrating when I see them entrenched in a laughless screenplay. When a good actor takes a bad screenplay you can always sense their talent trying to get out. The screenwriters have assembled a comic formula out of the nuts and bolts of other movies and tried to fasten them together to make a funny movie. This never works because 'Cops and Robbersons' is a movie pitch, not a movie itself. It's the beginning of an idea that doesn't need fine tuning so much as it needs a complete overhaul. The movie takes The Robbersons, an ordinary Ozzie and Harriet family and puts as its head Norman Robberson (Chevy Chase) a man who is obsessed with cop shows. The dilemma is that a mobster (Robert Davi) has moved in next door and the authorities want to use the Robbersons' home to stake them out. Leading the stakeout is a rough-hewn cop (Jack Palance) who rolls his own cigarettes and always seems to have one planted in his leathery mug. Saddle that with a nagging wife, a daughter who develops an unconvincing romance with the mobster's son and a 5-year old who plays vampire and bites Palance on the neck. These are nuts and bolts not inspiration. They are the stuff of bad sitcom writing \u0096 the kind of writing that gets a show cancelled. When I see a movie like this that is directed at a sitcom loving audience I always marvel at how much less funny it sounds without a laugh track. Now onto the cast starting with Chevy Chase. My favorite Chase comedies are the ones that allow him to be a smart-ass mostly because he can do it without sounding like a bore. I've seen it in 'Spies Like Us' and 'Funny Farm' and the 'Fletch' pictures and a little in the first 'Vacation' movie. But here he's an annoying dope who is always in the way and just bumbles around reminding me that his Gerald Ford routine was funnier when he did it in a five minute sketch on 'Saturday Night Live'. Jack Palance surprised me in 'City Slickers' by taking his usual tough ol' buzzard persona and injecting it with humanity, warmth and truth. Here he's the same crusty old guy but the warmth and truth are gone because the movie doesn't have time between painful slapstick. Diane Weist has done her best work for Woody Allen. So, I try to measure Diane Weist's characters thusly: Would the character she's playing be convincing if she were playing it in a Woody Allen movie, in most cases yes. So, she's playing a good (albiet underwritten) character here in the wrong movie. There is one rather serious moment when she talks to Palance about his smoking that I thought was the movie's only ray of sunshine. I don't know what dragged director Michael Ritchie into this film after directing Chase in 'Fletch' and directing the marvelous (and somewhat similar) 'The Positively True Adventures of the Alleged Texas Cheerleader Murdering Mom'. By the way, you will note that I have avoided describing any of the specific scenes. That's because I just feel that this talented cast has had enough.",
         "I love comedy movies. I went online to order some i couldn't find anywhere at the store. One of them were Cops and Robbersons. I ordered it having really high hopes for this movie. (I could not find it on Xfinity) I got it last night and watched it 1st thing in the morning. I thought it was going to be very funny. I laughed a few times and it was not as funny as I thought, but for some reason, I was hooked to the movie because it to me was a mystery. Cops and Robbersons is a MUST SEE FILM! Adventure/Mystery/Comedy Chevy Chase-Norman Robberson Jack Palance- Jake Stone Dianne Wiest-Helen Robberson Robert Davi-Osborn David Barry Gray-Tony Moore",
         "Chevy Chase, Jack Palance, Dianne Wiest, David Barry Gray, Fay Masterson, Jason James Richter, Miko Hughes and Robert Davi star in this 1994 comedy. This focuses on businessman, Norman Robberson (Chase) who lives in the suburbs with his wife, Helen (Wiest) and 3 children, Cindy (Masterson), Kevin (Richter) and Billy (Hughes). He longs for a cop adventure like on one of his favorite TV shows and gets his wish when his home becomes a stakeout for a dangerous criminal, Osborn (Davi) living next door to him. Palance plays veteran cop, Jake Stone and Gray plays his new partner, Tony Moore who move into the Robbersons home getting into mishaps with Norman and become part of his family. I've always liked this film and Chase & the cast are great in it. I recommend this entertaining comedy.",
         "I tell you what, man. When I saw that this film was given a 4.7, I had to speak up. I had to set the record straight- this movie is great. All joking aside. Yeah, the plot makes about as much sense as Face/Off. But over the years I have not met one person that watched this movie and wasn't repeating lines the next day. But enough about that. This movie has chemistry between the actors. There is just enough peril to keep the movie serious. It moves a long at a good pace. The dialog is about as funny as one could hope. Each character has some issue that is developed and ultimately resolved, which is not an easy feat with an ensemble cast like this. Also, this movie is to Jack Palance what True Grit was for John Wayne. Jack Palance's Detective Jake Stone is a caricature of his previous roles as a no-nonsense, cynical, chain-smoking bad-ass. Then you have Chevy Chase who is as funny as ever. For that matter, I really don't see how somebody that likes the Vacation movies could dislike this film. It's pretty much the same family, only they don't go on vacation. They have some cops come live with them and comedy ensues. Anybody who gives this movie less than a 6/10 needs to pull the stick out of their rectum."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "TriStar Pictures",
         "Channel Productions"
      ],
      "summaries": ["When police discover that a mob hitman has moved in next door to the Robbersons, they want to find out what he is up to. So they set up a stakeout in the Robbersons' home. Hard-nosed, tough-as-nails Jake Stone is assigned to the stakeout. But now it's a question of whether Jake can last long enough to capture the bad guys. The Robbersons want to help so they are driving him crazy."],
      "budget": 0
   },
   "movielensId": 437,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1994-04-15",
      "dvdReleaseDate": "2001-06-12",
      "directors": ["Michael Ritchie"],
      "runtime": 93,
      "movieId": 437,
      "title": "Cops & Robbersons",
      "mpaa": "PG",
      "actors": [
         "Chevy Chase",
         "Jack Palance",
         "Dianne Wiest",
         "Robert Davi",
         "David Barry Gray",
         "Jason James Richter",
         "Fay Masterson",
         "Miko Hughes"
      ],
      "imdbMovieId": "0109480",
      "originalTitle": "Cops & Robbersons",
      "genres": [
         "Action",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["WtEYTu8vxoA"],
      "plotSummary": "Hard-as-nails cop Jake Stone moves in with the Robbersons so he can watch a hitman who has moved in next door. The Hitman is one thing, but can you survive the Robberson family.",
      "tmdbMovieId": 26261,
      "avgRating": 2.60368,
      "releaseYear": "1994",
      "numRatings": 1900,
      "posterPath": "/wnkWgFU5UcLwbExCp1YtCg5Ox4E.jpg"
   }
}