{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "society",
            "id": 3679
         },
         {
            "name": "woman between two men",
            "id": 7439
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "beijing",
            "id": 33683
         }
      ],
      "imdb_id": "tt0106332",
      "video": false,
      "title": "Farewell My Concubine",
      "recommendations": [
         10404,
         31439,
         38143,
         49982,
         37291,
         42006,
         14320,
         10387,
         5801,
         31527,
         43364,
         11698,
         11911,
         25504,
         12493,
         32499,
         42987,
         18148,
         3121,
         121795
      ],
      "backdrop_path": "/sRCjobXivhWdPynxdlbLZHwQ11J.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Ching Dau Ji (Cheng Dieyi)",
               "gender": 2,
               "credit_id": "52fe43df9251416c7502163d",
               "name": "Leslie Cheung",
               "profile_path": "/jY0eInsklo9aYc1Som6vEdVd4OL.jpg",
               "id": 69637,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Guk Sin (Juxian)",
               "gender": 1,
               "credit_id": "52fe43df9251416c7502161d",
               "name": "Gong Li",
               "profile_path": "/dgGWKMAP5vbgACkXTazZXt3JQoT.jpg",
               "id": 643,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Duen Siu Lau (Duan Xiaolou)",
               "gender": 2,
               "credit_id": "52fe43df9251416c75021619",
               "name": "Zhang Fengyi",
               "profile_path": "/4CQmKbA8fdjngOrKBbjhHhm3dTQ.jpg",
               "id": 65277,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Yan Hong/Siu Dau Ji's mother",
               "gender": 0,
               "credit_id": "5402f3ff0e0a2658de0072fd",
               "name": "Jiang Wenli",
               "profile_path": "/dWBCkrto4WUwkl5nf88wfdF9EIU.jpg",
               "id": 137917,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Master Yuan Si Qing",
               "gender": 2,
               "credit_id": "5402f42e0e0a2658ee007041",
               "name": "Ge You",
               "profile_path": "/ehtM3p1M3AexKdzxh5llWVCZmqm.jpg",
               "id": 76913,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Master Guan",
               "gender": 0,
               "credit_id": "52fe43df9251416c75021621",
               "name": "Lu Qi",
               "profile_path": null,
               "id": 67765,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Manager",
               "gender": 2,
               "credit_id": "53639896c3a368159f002304",
               "name": "Ying Da",
               "profile_path": "/h60qwzeuFgoN2m064GC6EMBPSjY.jpg",
               "id": 109436,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Eunuch Zhang",
               "gender": 0,
               "credit_id": "5402f4980e0a2658f1006ed4",
               "name": "Yi Di",
               "profile_path": null,
               "id": 1358828,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Aoki Saburo",
               "gender": 0,
               "credit_id": "5402f4a40e0a2658d8007010",
               "name": "Zhi Yitong",
               "profile_path": null,
               "id": 1299590,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Xiao Xi (teenager)",
               "gender": 0,
               "credit_id": "5402f4c80e0a2658ee00705b",
               "name": "Li Chun",
               "profile_path": null,
               "id": 1358829,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Xiao Xi (adult)",
               "gender": 0,
               "credit_id": "5402f4d50e0a2658de007323",
               "name": "Lei Han",
               "profile_path": null,
               "id": 1346210,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Shitou (child)",
               "gender": 0,
               "credit_id": "5402f4f50e0a2658e90070d1",
               "name": "Fei Yang",
               "profile_path": null,
               "id": 1358830,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Dau Ji (child)",
               "gender": 0,
               "credit_id": "5402f5040e0a2658e90070d9",
               "name": "Ma Ming-Wei",
               "profile_path": null,
               "id": 1358831,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Shitou (teenager)",
               "gender": 0,
               "credit_id": "5402f5100e0a2658f1006ee8",
               "name": "Zhao Hai-Long",
               "profile_path": null,
               "id": 1358832,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Dau Ji (teenager)",
               "gender": 0,
               "credit_id": "5402f51c0e0a2658e20072fd",
               "name": "Yin Zhi",
               "profile_path": null,
               "id": 1358833,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Laizi (teenager)",
               "gender": 0,
               "credit_id": "5402f52e0e0a2658e90070e8",
               "name": "Li Dan",
               "profile_path": null,
               "id": 1358835,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Laizi (child)",
               "gender": 0,
               "credit_id": "5402f5410e0a2658e90070f0",
               "name": "Yang Yong-Chao",
               "profile_path": null,
               "id": 1358836,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe43df9251416c75021627",
               "name": "Lilian Lee",
               "profile_path": null,
               "id": 67766,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43df9251416c7502162d",
               "name": "Chen Kaige",
               "profile_path": "/ApkE9y5x9hCYz1XfDZ1Tqz37LH5.jpg",
               "id": 20640,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43df9251416c75021633",
               "name": "Gu Chang-Wei",
               "profile_path": "/eezHOkQN2FowBSiviMle0nziixt.jpg",
               "id": 66169,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43df9251416c75021639",
               "name": "Xiaonan Pei",
               "profile_path": null,
               "id": 67769,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43df9251416c75021643",
               "name": "Jiping Zhao",
               "profile_path": null,
               "id": 65285,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5402f5570e0a2658e2007313",
               "name": "Lu Wei",
               "profile_path": null,
               "id": 27074,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.351177,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         }
      ],
      "id": 10997,
      "vote_count": 132,
      "budget": 0,
      "overview": "Abandoned by his prostitute mother in 1920, Douzi was raised by a theater troupe. There he meets Shitou and over the following years the two develop an act entitled, \"Farewell My Concubine,\" that brings them fame and fortune. When Shitou marries Juxian, Doutzi becomes jealous, the beginnings of the acting duo's explosive breakup and tragic fall take root.",
      "similar": [
         449176,
         184352,
         26280,
         338189,
         26371,
         376867,
         428493,
         413666,
         380874,
         10938,
         47643,
         1966,
         1213,
         398818,
         322127,
         261776,
         11386,
         258480,
         11421,
         26933
      ],
      "original_title": "霸王别姬",
      "runtime": 171,
      "poster_path": "/4ZvFaUuyquam4v0LG1mDNuZngY8.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Maverick Picture Company",
            "id": 36863,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Beijing Film Studio",
            "id": 708,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "China Film Co-Production Corporation",
            "id": 2269,
            "origin_country": ""
         }
      ],
      "release_date": "1993-09-16",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Kaige Chen"],
      "runtime": 171,
      "synopsis": null,
      "writers": [
         "Pik Wah Lee",
         "Pik Wah Lee"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0106332/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTYyMDE5MDY5OF5BMl5BanBnXkFtZTcwOTI4MzUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Leslie Cheung, Fengyi Zhang, Li Gong | See full cast and crew »"],
      "reviews": [
         "One of the best Chinese films...ever! The story was touching and brilliant, packed with unforgettable scenes: The Dickens-like portrayal of the young Peking opera performers undergoing training was heart-breaking. The presence of Japanese, Nationalist and Communnist troops were powerful reminders of Modern China's torrential times. The class struggle scene was a painfully poignant reference to the inhumanity of Maoist China (especially for those Chinese old-timers who vividly remember the days of the Cultural Revolution). And off course, the last scene was nothing short of stunning. It begs the viewer to open another box of tissues. One scene that particularly had me in tears was when Douzi was going through his opium withdrawal and he starts shivering, \"It's so cold. Mother, the water's frozen.\" It was clearly a heart-breaking reference to the earlier days of his arduous youth. The acting was also superb. Leslie Cheung's portrayal of the effeminate Douzi was hynoptically convincing. (Especially compared to his usual roles in HK action flicks). Gong Li constantly demands our attention with her stunning beauty and charm. Last but not least, Zhang Fengyi's portrayal of the masculine Shitou was excellent. I can't imagine anyone else taking his role. It's refreshing to see such an intelligent and historic Chinese epic (especially after watching all those deadbrain gun-toting HK action flicks) Director Chen Kaige did a wonderful job portraying the complex and often uneasy love affair between the two stage brothers. He also managed to skillfully express profound themes that resonated throughout the film. Fate, loyalty, class struggle, the parallels between Opera and Life, and other ideas leave the viewer dazed in deep thoughts for hours after the film. Because of the heavy references to modern Chinese events, some viewers may be confused by this film. While modern Chinese history is not a pre-requisite, I believe knowing the basics would definitely enhance the experience of this film. But nonetheless, this is quite possibly one of the best Chinese films... ever. Take it from me: Rent this one NOW! Trivia Note: The \"struggle scene\" (where the Red Guards dragged out Douzi and Shitou in front of the mob for confession) was based upon the real-life experience of Director Chen Kaige. Chen suffered the same fate when he was purged during the Cultural Revolution. In fact, he denounced his own father, an act which he later regretted.",
         "I finally got a chance to see \"Farewell my Concubine.\" I'd been anxious to see it since its initial release in 1993. It surprised me in its depth and technical skill. Three points make this film outstanding. The first is the technical skill of the director and the luscious taste of the director of photography. The entire film is a feast for the eyes, taking full advantage of elaborate costumes and exotic locations. The second strength is in the actual storytelling. The plot is a fascinating tragedy, it feels almost Shakespearean. The acting is nothing short of incredible. Some of China's finest actors demonstrate their ability to carry a story that covers 52 years. Normally, these two strengths alone would be reason enough to see a film, but \"Farewell my Concubine\" succeeds in satisfying one more category (the bain of any epic): historical accuracy. \"Farewell my Concubine\" is exceptionally accurate in portraying the monumental changes that were sweeping China at the time. The film doesn't just treat these events as background events, but drags them right into the plot and pins the characters into their surroundings. This is interesting when you consider that the story takes place in the Peking Opera, not the most likely place for these events to have effect. Instead, as we see the new China emerge, we watch these vestiges of old society fall, and the work of all involved make this transition an achievement to behold. The power of this film was not missed by Chinese censors who banned, removed, and then banned the film again several times over -debating whether or not its artistic brilliance was worth subversive portrayals of suicide and homosexuality. Unlike \"The Last Emperor,\" this film was made by Chinese film makers and is in tune with its subject. I recommend this film highly! As one last note, the version I saw was a DVD containing the original 170 minute version of the film, in its wide-screen splendor. From what I understand, the shorter versions released internationally deleted and shortened some opera scenes for fear that they would be lost on Western audiences. Having no prior experience with any Peking Opera, I found the scenes fascinating and integral to appreciating the entire story. Spend the extra time if you can.",
         "As an WASP American married a lady from Mainland China, I have a great interest in and curiosity about China. My wife's mother and father actually saw these men perform. I have discussed this movie with many Chinese friends, most of whom saw it before coming to this country. Some of them knew the story from real life as well as the movie. They are quick to point out the accuracy of the story in its detailing of Chinese history from the end of the last dynasty until its end during the Cultural Revolution. They also claim that the major happenings in the movie are real events, not the norm for most of Hollywood's \"real life\" stories. One point of conjecture in the movie is the sexually of Dieyi. It is presumed he is/becomes a homosexual. However, from what I have learned about the Peking/BeiJing Opera through reading and discussions, it is more likely that Dieyi was virtually unaware of his own sexuality. As opposed to being a hetero or homosexual, he was asexual in a way like it had be surgically removed from his being. It had been taken from him through the rigors of his training and years of performance. His love for Xiaolou is powerful, maybe even surpassing ordinary man/woman love, but platonic in as much as his mind is devoid of its sexuality. He suffers the same jealous anger and sense of betrayal as might be found when a wife discovers the cheatings of her husband, and reacts, unfortunately, accordingly (Heroin). His real, enduring love is performing. It is the one constant that has seen him through. He throws himself into it, being willing to perform for anyone, even as it drives the story to the end. The end of the movie is not satisfying to everyone. It was not a Hollywood ending. However, it was reality.",
         "I've always boasted that I could make a better film about China, about the Cultural Revolution in particular, until I saw this film. It triggered an out-burst of many of my emotions I hadn't had since I left China. In the movie, as the events developed, the tragedy, caused by the human feelings : love, hate, jealousy, and guilt under the social unrests, came so naturally to me. It is a movie which should not be missed.",
         "The film paints the story of two actors, from their first encounter at school in the Twenties through their success as stars of the Peking Opera, difficulties during the Japanese occupation, the Communist takeover in 1949 and the traumas of the Cultural Revolution in the Sixties\u0085 For the so-called Fifth Generation of Chinese filmmakers, the film touches new ground on two fronts\u0085 In the first place, though it does not avoid from acknowledging the sufferings under the old regime, it takes an embittered view of Communist society and of the Cultural Revolution specifically\u0085 The two friends, Xiaolou and Dieyi, adopt a young man, Xiao Si, who becomes one of the Red Guards and quickly informs the political sins of his benefactors\u0085 Second the film is a love story of a rare kind\u0085 Dieyi is a homosexual and suffers rejection when Xiaolou begins an affair with Juxian (Gong Li), a gorgeous prostitute\u0085 The personal conflict of each character is the heart of this exceptional movie\u0085",
         "I've seen this movie more times than I can count and I cry every time. I first saw it in the theater in 1993 and I was rooting for it to win Best Foreign Film Oscar, but it lost to the far inferior Belle Epoque (Spain). As to the person who wrote that this film made Cheng Dieyi seem like he was made to be gay because of abuse, I think you need to take another look. To my mind, Dieyi seemed to be infatuated with Shitzou as soon as he got there. However you look at it, this is a film that has great performances all around. I especially loved Leslie Cheung as the adult Cheng Dieyi (requiem eternem Leslie, 1956-2003), not to mention Gong Li. An excellent film, but be forewarned: it's almost three hours long. 10/10",
         "A masterpiece in every sense of the word, Chen Kaige's breath-stealing parable of China's multi-layered political revolution, is centred on two men. Chen presents us with an absorbing story of a 52 year-old relationship between two opera actors mounted upon an impossibly large canvas. But without sacrificing any intricate plot development or smudging over any delicate complexity in the relationship. Considered by many to be one of the greatest epics of all time, this film rightly established Chen's reputation as one of the most brilliant narrative and artistic directors of our time, along with other such contemporary auteurs as Kieslowski, Bertolucci and Kurosawa. You can not call yourself a film-buff if you haven't seen this movie. And film-students: you can witness the true art of filmmaking and story telling through the skilled hands of Chen Kaige's Farewell My Concubine.",
         "This is one of my favorite all time films, and I associate it with another of my faves, Remains of the Day. Both films deal with unrealized love over a backdrop of important historical events that directly or indirectly affect the main characters. Both films are extremely well made with lavish color and attention to details. Both offer a sort of built in history lesson for the viewer, and both are adaptations of novels that are in themselves worth reading. Farewell My Concubine has more of an epic sense about it, and has been made even more so with the 170 minute DVD version. Being of Asian descent, I thoroughly enjoyed the additional opera scenes. But, as others have indicated, the singing will probably have an adverse effect to western audiences as the movie progresses. As with any novel adaptation, there are many differences between Lillian Lee's book and the film. I personally would have liked some things in the film to have stayed closer to the book, but overall, the film definitely is able to stand on its own and, I feel, does the book justice. Banned twice in China, once due to the veiled homosexual themes and later for Dieyi's suicide at the end (authorities insisted suicides never happened in China), this film nevertheless is the result of an unusual amount of artistic freedom given to director Chen Kaige, and he exploits it to the full. This is especially true during the Cultural Revolution scenes, which casts a negative light on the Communist government. Kaige's experience as a former Red Guard provides a frighteningly accurate portrayal of the terror during this period. I initially viewed this movie because I am constantly mesmerized by the skill and beauty of Gong Li (who isn't?). But I quickly became fascinated with the outstanding performances of Leslie Cheung and Zhang Fengyi, not to mention the children of the opera school in the first part of the movie. I will agree with the reviewer who stated that the constant beatings of the children is a little harrowing. But it does make one realize that sometimes other cultures in other times put different values on human life than we do. One of the main points of the film is how the stage role of Concubine Yu Ji paralleled the life of Dieyi in his offstage life. I found this to be eerie as I discovered that Leslie Cheung's real life in many ways mirrored Dieyi's character. Cheung was a huge pop superstar in Asia during the 80's, and widely known for his gender bending styles of dress onstage. Cheung himself said that the role of Dieyi was, in fact, him, and I would not debate this. Speculation that depression and a failed relationship with his male lover led to Cheung's suicide a couple of weeks ago, somewhat similar to the plot in the movie. Perhaps life imitating art?? A great film made even greater with the additional footage on the DVD. Not recommended for small children, homophobes, anyone expecting martial arts action, or those unable to sit through more than 2 hours of movie watching.",
         "quote by tedg: \"Opening scenes are seductions, promises. They transport one to the world of the story and establish who you as viewer can expect to be. Done right, they are an art to themselves. This film's opening is among the best I've seen, establishing the world of performance: politics as theater and love as both. It lets you know the perspective is centered on a stylized stage and concerns loss, sexually ambiguous brotherhood and betrayal. All in a couple minutes.\" Well put. Also noteworthy is that at the end of the movie the opening scene is being mirrored (the two actors on stage being lit by a spot light), the film thus coming full circle. Quite ingenious. What is good about the movie is that we (Westerners that is) learn a lot about recent Chinese history, which cannot be a bad thing considering the direction in which China is heading. Oh, and Leslie Cheung's - may he rest in peace - performance is simply outstanding. But then, the acting is first rate all round. This is one hell of a movie. And, off topic, I have once again realised that the problem with sub-titled films is that one misses so much/too much of the actual acting, making it really necessary to view movies twice. Still, (a lot) better than viewing dubbed films though.",
         "'Farewell My Concubine' is, in a word, excellent. Though often portrayed as haunting and disturbing, it's also quite touching at times... attributed largely to the outstanding emotional performances by the film's lead cast. Hands down, Chen Kaige has directed one of the most beautiful films involving the fall of the great Imperial China... and subsequently... the friendship of two of China's greatest leading opera performers. Leslie Cheung's role as Cheng Dieyi, the tormented 'concubine' of the story, is absolutely astounding, and is probably one of his greatest performances to date. Fengyi Zhang plays well opposite Cheung, and Gong Li is fantastic as always. The production sets are superb, as are the costumes and cinematography. Definitely a must see for all fans of foreign cinema, and certainly worthwhile for all newcomers. 10 out of 10"
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Beijing Film Studio",
         "China Film Co-Production Corporation",
         "Maverick Picture Company"
      ],
      "summaries": [
         "\"Farewell, My Concubine\" is a movie with two parallel, intertwined stories. It is the story of two performers in the Beijing Opera, stage brothers, and the woman who comes between them. At the same time, it attempts to do no less than squeeze the entire political history of China in the twentieth century into a three-hour time-frame.",
         "China, 1924. Prostitute Yanhong sees no other alternative than leaving her shy son Douzi behind at a training school for Chinese opera. Shitou, an older boy, takes pity on Douzi and he needs it because master Guan rules his school with an iron fist. The boys are beaten, tortured for forgetting their lines, so put to the test mentally that suicide sometimes is the only option left. Douzi and Shitou become friends and are talented, destined to be great actors, they impress audiences by performing together. Douzi however wants more from the friendship, but Shitou doesn't answer his advances. The situation becomes worse when the courtesan Juxian manipulates Shitou in rescuing her from the brothel House of Blossoms and marrying her. Through the years, with the political situation in China ever changing and not always for the good, Shitou and Douzi remain close, but will it ever be like old times?",
         "The story of two men, who met as apprentices in the Peking Opera, and stayed friends for over 50 years."
      ],
      "budget": 0
   },
   "movielensId": 446,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1993-09-16",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Chen Kaige"],
      "runtime": 171,
      "movieId": 446,
      "title": "Farewell My Concubine",
      "mpaa": "",
      "actors": [
         "Leslie Cheung",
         "Gong Li",
         "Zhang Fengyi",
         "Jiang Wenli",
         "Ge You",
         "Lu Qi",
         "Ying Da",
         "Yi Di",
         "Zhi Yitong",
         "Li Chun",
         "Lei Han",
         "Fei Yang",
         "Ma Ming-Wei",
         "Zhao Hai-Long",
         "Yin Zhi",
         "Li Dan",
         "Yang Yong-Chao"
      ],
      "imdbMovieId": "0106332",
      "originalTitle": "霸王别姬",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["cC-_SLiRnJE"],
      "plotSummary": "Abandoned by his prostitute mother in 1920, Douzi was raised by a theater troupe. There he meets Shitou and over the following years the two develop an act entitled, \"Farewell My Concubine,\" that brings them fame and fortune. When Shitou marries Juxian, Doutzi becomes jealous, the beginnings of the acting duo's explosive breakup and tragic fall take root.",
      "tmdbMovieId": 10997,
      "avgRating": 3.89303,
      "releaseYear": "1993",
      "numRatings": 3987,
      "posterPath": "/4ZvFaUuyquam4v0LG1mDNuZngY8.jpg"
   }
}