{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109783",
      "video": false,
      "title": "The Favor",
      "recommendations": [
         55699,
         16814
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kathy Whiting",
               "gender": 1,
               "credit_id": "52fe47c8c3a36847f8147ff9",
               "name": "Harley Jane Kozak",
               "profile_path": "/VXtpLchVBUib398pwahLPbgSeT.jpg",
               "id": 27106,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Emily",
               "gender": 1,
               "credit_id": "52fe47c8c3a36847f8148001",
               "name": "Elizabeth McGovern",
               "profile_path": "/egt1d836NcYDTeiokz5Im8gHU4r.jpg",
               "id": 4513,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe47c8c3a36847f8147ffd",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 2
            },
            {
               "cast_id": 1,
               "character": "Elliott Fowler",
               "gender": 2,
               "credit_id": "52fe47c8c3a36847f8147ff5",
               "name": "Brad Pitt",
               "profile_path": "/kU3B75TyRiCgE270EyZnHjfivoq.jpg",
               "id": 287,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Tom Andrews",
               "gender": 2,
               "credit_id": "5462c5160e0a26780d000e26",
               "name": "Ken Wahl",
               "profile_path": "/yhA6B938O6et3nA4GPqxExptAal.jpg",
               "id": 3002,
               "order": 4
            },
            {
               "cast_id": 23,
               "character": "Joe Dubin",
               "gender": 2,
               "credit_id": "593c182692514105cf01027f",
               "name": "Larry Miller",
               "profile_path": "/xA8zCxNrwtamLaLWNBkLyX5tGtU.jpg",
               "id": 1211,
               "order": 5
            },
            {
               "cast_id": 24,
               "character": "Maggie Sand",
               "gender": 1,
               "credit_id": "593c1f9592514105cf010845",
               "name": "Holland Taylor",
               "profile_path": "/oPcA8Ju1rBGlDCRqbyVD7S5vakY.jpg",
               "id": 11318,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47c8c3a36847f8148007",
               "name": "Donald Petrie",
               "profile_path": "/skokYnTDYIKogfeH7DU49dfhRsj.jpg",
               "id": 18281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47c8c3a36847f814800d",
               "name": "Sara Parriott",
               "profile_path": null,
               "id": 41697,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe47c8c3a36847f8148013",
               "name": "Josann McGibbon",
               "profile_path": null,
               "id": 41698,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "564604159251410a3f009259",
               "name": "Lauren Shuler Donner",
               "profile_path": "/uwuWpT2xyhwlrfSCk6xTTvrRvEE.jpg",
               "id": 7200,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5646052fc3a36870db009a94",
               "name": "Thomas Newman",
               "profile_path": "/nZSsNIrjbkqqxFYwsD3zcHskxdP.jpg",
               "id": 153,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "56460542c3a36870e3009f63",
               "name": "Tim Suhrstedt",
               "profile_path": null,
               "id": 17146,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "564605539251410a49009155",
               "name": "Harry Keramidas",
               "profile_path": null,
               "id": 1061,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "564605679251410a4900915a",
               "name": "Patti Carns Kalles",
               "profile_path": null,
               "id": 1274289,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "56460578c3a36870db009a9b",
               "name": "Bonnie Timmermann",
               "profile_path": "/jM8QANtq0v7Eqy8ZYtKot27nsfK.jpg",
               "id": 897,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "564605939251410a4c009409",
               "name": "David Chapman",
               "profile_path": null,
               "id": 3286,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "564605a8c3a36870e80094ba",
               "name": "Mark Haack",
               "profile_path": null,
               "id": 4196,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "564605c492514133ab008d0d",
               "name": "Clay A. Griffith",
               "profile_path": null,
               "id": 4197,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "564605d6c3a36870d600988a",
               "name": "Carol Oditz",
               "profile_path": null,
               "id": 36582,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5646061692514133ab008d1c",
               "name": "Jack E. Pelissier Jr.",
               "profile_path": null,
               "id": 1535447,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "5646066ac3a36870ef009582",
               "name": "Michael Moran",
               "profile_path": null,
               "id": 1535448,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "5646068dc3a36870e80094d7",
               "name": "Cynthia L. Hamilton",
               "profile_path": null,
               "id": 1535449,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "564606a9c3a36870e3009f90",
               "name": "Susan Bierbaum",
               "profile_path": null,
               "id": 1342629,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.464814,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50463,
      "vote_count": 8,
      "budget": 0,
      "overview": "Kathy is married to Peter. Now she can't help but wonder how things could have been if she got together with her old boyfriend, Tom. Being married prevents from doing that so she asks her friend, Emily to go to him and see if she can sleep with him then tell Kathy how it was. When Emily tells Kathy that things were awesome, their friendship suffers, at the same so does Kathy's marriage. Things get even more complicated when Emily learns she's pregnant, and she's not certain if it's Tom's or her boyfriend, Elliot.",
      "similar": [],
      "original_title": "The Favor",
      "runtime": 97,
      "poster_path": "/ofBcSUYZ4Qa5eqE2FRnOcNQqTIC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
            "name": "Orion Pictures",
            "id": 41,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nelson Entertainment",
            "id": 365,
            "origin_country": ""
         }
      ],
      "release_date": "1994-04-29",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "Two Women. Three Men. One Secret.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Donald Petrie"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Sara Parriott",
         "Josann McGibbon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109783/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzY3MzMyMjA1MF5BMl5BanBnXkFtZTYwNzg4MjA5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Harley Jane Kozak, Elizabeth McGovern, Bill Pullman | See full cast and crew »"],
      "reviews": [
         "...but it wasn't great, either. An okay, light-hearted, feel-good comedy. Had a little too much TV-sitcomishness about it, and the main character lady was a little too neurotic, and her husband was a little too suspicious in a TV sitcom sort of way. But all of that was just \"a little\" and overall it was fun to watch. Mind you -- we caught it on cable -- I wouldn't have wanted to rent it! I give it a B-",
         "I remember when I was around the age of 14, this movie used to be on once in a while... on basic cable! Every time it was on, I always watched and enjoyed every single minute. To this day, I still do. This movie was the reason I wanted to learn how to play the harmonica... not to mention why I got into wearing flannel. Let's face it: I'm a born romantic and I was hooked from the first watch. I have it on VHS (which by the way, was a very difficult find) and I refuse to lose it. I give this underrated great a 9 out of 10.",
         "When a woman suddenly begins to believe her life hasn't been everything she thinks it should have been she wants to go back and rekindle an old flame. This starts a chain of events involving a mystery pregnancy, a jealous boyfriend and hubby, sexy fantasies, hurt feelings, oddball characters, and loads of laughs. Different, offbeat romantic comedy....loved it.",
         "So how can I? The movie is rather shallow and all the scenes involving the kids are annoying, but you don't have to care about it. I remember having watched it several times always laughing and loving it. The main character is played by Harley Jane Kozak, who is really hilarious. Her character is almost neurotic but really very funny. Elizabeth McGovern is not really good, but you can still enjoy the pair. Bill Pullman is wonderful at his own very special terms, as he always is (or at least was before he starred in ID4) and Brad Pitt is also wonderful in this comedy. It was shot before he became this world-wide sex symbol or whatever and his role is the one of a pitiable, sensitive and slightly intellectual boy who has to bear quite a lot - of the gags. He's really likeable and laughable. I don't say that I didn't like him in other movies, but - check this out, OK?! Though there is much cliche in the movie, the tone of most jokes is really different from common jokes. They all seem new and unique, so again: very good laughs. And as I already mentioned, most of them are due to Kozak. Her crazy character offers so many opportunities for nice gags and the movie allows itself to exploit these opportunities. For example in dream sequences, both weird and lovable... in a way they're a class of their own. Maybe it's a question of one's personal inclinations, but I can't see why one should not at least altogether enjoy \"The Favor\". 9 out of 10.",
         "An amusing bit of fluff for a \"chick flick.\" Guys, this is a good date movie! Enough Brad Pitt and silly love crap for them, but amusing enough for us. No gratuitous nudity but HEY, you can't have everything. An unknown actress named Harley Jane Kozak is the star of this film, portraying every man's dream wife - sexy, intelligent, feisty and funny (all in a charmingly unpredictable package) - while at the same time being a great mother. It is sad that Kozak soon gave up acting for good to raise her own family. Watching this film makes me believe she deserved better than obscurity. As usual, Brad Pitt displays the talent that would soon make him a superstar, and Bill Pullman also gives a decent performance. The least talented of the four major players is Elizabeth McGovern. She doesn't necessarily give a bad performance, but rather fails to make the role her own. She could have easily been replaced by any other competent actress without altering the chemistry between the characters. Perhaps another actress would have turned in a more memorable performance. McGovern is one of those actresses of whom most people have heard, and yet few can name anything she has ever been in. As usual with movies aimed toward a female audience, the plot is silly and at times nonsensical. As always, at least one man has to be portrayed as a manipulative scumbag with one thing on his mind while all the female characters are decent and loving and emotionally complex. Thankfully though, this film doesn't take itself too seriously. All in all, despite being a \"chick flick,\" this movie is worth watching - perhaps even twice.",
         "CAUTION - ALL SPOILERS FOLLOW -- (Note: Milt Oberman, Sabmaggot, has a small part, almost says one word during scene on childbirth preparation.) Her friend asks McGovern's character to look up an old boyfriend in Denver during a routine business trip. She does, has a one-night stand, and this messes up her friend's (Harley Jane Kozak)mind. Meanwhile McGovern is dating Brad Pitt, an artist, and they are having trouble commiting. Bill Pullman is the harmonica-playing nerd of a college professor married to Kozak, and begins to follow his wife around, thinking she is having an affair. Everyting comes to a head in Denver, the old boyfreind is just a playboy, Pitt and McGovern decide to stay together with their child on the way. Pullman and Kozak re-affirm their love. It is a very pleasant film, and actually has a good message - those in our past are seldom what we fantasize, and don't take your mate for granted.",
         "An adorable romantic comedy directed by Donald Petrie (Mystic Pizza, Grumpy Old Men). Great Music with a lot of blues and Ray Charles! Bill Pullman (While you Were Sleeping, Zero Effect) is Peter who is happily married to gorgeous Kathy Whiting, Harley Jane Kozak (When Harry Met Sally) has a Cinderella Complex. Although she is happily married, she has fantasies about an old boy friend whom she had a relationship with. There was no final closure, and hopes that one day he will show up in his plaid shirt, and they will gallivant off on his white horse into the horizon. She is always day dreaming about this guy. Emily, Elizabeth McGovern (Ordinary People, The Misadventures of Margaret) is Kathy best friend. Kathy asks Emily to look up her old boyfriend. Emily is an alter ego of Kathy, who is living through her. Painter Elliott Brad Pitt (A River Runs Through It, Legends of the Fall) is Emily \u0091s boy-friend, who is ten years younger than her. This is a situation comedy where the one is thinking one thing and expecting something to happen but something completely different happens. That is what makes this movie funny! It is a comedy of errors! Favorite Quotes:\"I was kind of happy, in a miserable kind of way. Is that worse than being miserable in a happy kind of way? \"; \"I like sleeping, it makes the years go by faster.\"; \"You are like a disease you invade someone's life and attack yourself.\" Favorite scenes: Peter playing the harmonica, Kathy in her red dress and high heels getting stuck in the cracks, Elliot getting punched twice in the face for no reason at all. This is just a fun, hilarious unpretentious comedy! I have the tape and enjoy watching it! Just plain fun.",
         "This is a combination of sex farce and romantic comedy in which a married woman with children starts dreaming about her ex from high school and just can't stop thinking about \"what if\". To end this she asks her friend to look him up, sleep with him and tell her how it was. This is a pretty original idea which gives this movie some fresh air. It was pretty fun to watch and while it all ends in the best way possible one can't predict every step of it. The characters are not too deep but pretty entertaining. The acting is on the right level. It was pretty fun to see Brad Pitt in one of his earlier movie roles and oh my is he hot in it! Since not all main characters are well known I looked up Harley Jane Kozak and it was pretty interesting to see that she was one of the main characters in Santa Barbara and is a pretty successful mystery writer now. The character Emily is pretty cool considering that she is a very independent woman with a pretty fun life. And Bill Pullman shows a different level to his sweet husband character. I guess there is not enough sex for a sex farce which makes the dream sequences seem like a bit too many. If I am not mistaken it is an R rated movie which is a bit surprising as it is pretty mild. The ending is pretty simple and in a happy ending way but it brings a lot of laughs before that.",
         "sorry I have to give a bad score for this movie. although this movie was starring with world class actors/actress, but the acting looks not so good in this movie. first is a man married a woman who became pregnant because she slept with another guy?and he still loves her very much? come on. What moral message to be conveyed? as if to give justification for such action. secondly wife meet her former lover and kissing and the husband can take it for granted just like that? sorry I have to give the value of awful.",
         "Kathy is a bookkeeper in Portland, Oregon who has two children, Gina and Hannah, with her science professor husband Peter. Her 15-year high school reunion is coming up, and she can't help but wonder what life would be like with her old boyfriend Tom. Kathy's best friend Emily agrees to go to Denver, where Tom lives, and investigate what he is like. Emily comes home from Denver claiming to have had wild sex with Tom. Meanwhile, Emily's younger artist boyfriend Elliot is nice but he and Emily break up over his lack of interest in boring stuff. Miscommunication results in a lot of laughs later. And it just happens that Elliot is going to Denver for his job. This sets up some wild situations. This is pretty good most of the time. Some of the jokes didn't work for me. In particular, I didn't care for the women's obsession with Brad Pitt's body. I get that if it were the other way around, I would understand. But this just wasn't part of the appeal for me. I've always like Harley Jane Kozak, from the time she was a college professor on \"The Guiding Light\". She always has such a pleasant personality and she's attractive, though not beautiful. She does well here. Pitt does a good job too and is mostly pleasant. Some of the best comedy comes during Kathy's fantasies or nightmares. Though in one case, Kathy is having neither a nightmare nor a fantasy. She is actually wearing a smoking hot dress that a hooker might wear, with a wild hairstyle. I don't really think of Kozak as sexy, and while I got the joke when her husband didn't notice when she put on a sexy nightie and behaved in an alluring way, this is just a standard joke with married couples and I was able to appreciate it without being turned on by Kozak. There is one particularly funny scene where Kathy takes a drug not intended for her. Even though there are kids, and a kids' birthday party, kids that age shouldn't watch this. Some of the sexual humor is quite potent. I had a good time, mostly."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Nelson Entertainment"],
      "summaries": ["Kathy is married to Peter. Now she can't help but wonder how things could have been if she got together with her old boyfriend, Tom. Being married prevents from doing that so she asks her friend, Emily to go to him and see if she can sleep with him then tell Kathy how it was. When Emily tells Kathy that things were awesome, their friendship suffers, at the same so does Kathy's marriage. Things get even more complicated when Emily learns she's pregnant, and she's not certain if it's Tom's or her boyfriend, Elliot."],
      "budget": 0
   },
   "movielensId": 447,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-04-29",
      "dvdReleaseDate": "2001-12-26",
      "directors": ["Donald Petrie"],
      "runtime": 97,
      "movieId": 447,
      "title": "The Favor",
      "mpaa": "R",
      "actors": [
         "Harley Jane Kozak",
         "Elizabeth McGovern",
         "Bill Pullman",
         "Brad Pitt",
         "Ken Wahl",
         "Larry Miller",
         "Holland Taylor"
      ],
      "imdbMovieId": "0109783",
      "originalTitle": "The Favor",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["e07PBDBpT5A"],
      "plotSummary": "Kathy is married to Peter. Now she can't help but wonder how things could have been if she got together with her old boyfriend, Tom. Being married prevents from doing that so she asks her friend, Emily to go to him and see if she can sleep with him then tell Kathy how it was. When Emily tells Kathy that things were awesome, their friendship suffers, at the same so does Kathy's marriage. Things get even more complicated when Emily learns she's pregnant, and she's not certain if it's Tom's or her boyfriend, Elliot.",
      "tmdbMovieId": 50463,
      "avgRating": 2.51542,
      "releaseYear": "1994",
      "numRatings": 227,
      "posterPath": "/eKpxCQllaktjfqR11ITbYstcHmD.jpg"
   }
}