{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hip-hop",
            "id": 898
         },
         {
            "name": "musician",
            "id": 4048
         },
         {
            "name": "mockumentary",
            "id": 11800
         },
         {
            "name": "spoof",
            "id": 11931
         }
      ],
      "imdb_id": "tt0106880",
      "video": false,
      "title": "Fear of a Black Hat",
      "recommendations": [
         13587,
         81844,
         67774,
         13070,
         26743,
         29491,
         89747,
         25629,
         40150,
         27070,
         13588,
         40378,
         85195,
         32447,
         18414,
         16448,
         27265,
         68370,
         13591,
         21578
      ],
      "backdrop_path": "/hLZFX0MiMOzeVfa1w6VnVUxEco3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tasty Taste",
               "gender": 2,
               "credit_id": "52fe43dec3a368484e002ce5",
               "name": "Larry B. Scott",
               "profile_path": "/xo7x99XCl409dMbUtnj1tNByVE0.jpg",
               "id": 67893,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tone Def",
               "gender": 2,
               "credit_id": "52fe43dec3a368484e002ce9",
               "name": "Mark Christopher Lawrence",
               "profile_path": "/8NFSpV9nIQYqWTCVhZeguAF4JsP.jpg",
               "id": 33501,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ice Cold",
               "gender": 2,
               "credit_id": "52fe43dec3a368484e002ced",
               "name": "Rusty Cundieff",
               "profile_path": "/qRxHN1pX9Qq05nhpJnxeXa8dJVP.jpg",
               "id": 141825,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nina Blackburn",
               "gender": 1,
               "credit_id": "52fe43dec3a368484e002cf1",
               "name": "Kasi Lemmons",
               "profile_path": "/dO8h85dpcoVFkKwa8MMOacRro4F.jpg",
               "id": 51864,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Backstage Manager 1",
               "gender": 0,
               "credit_id": "52fe43dec3a368484e002cf5",
               "name": "G. Smokey Campbell",
               "profile_path": "/7roJxGaomfLdi9NGigyZrXisNZZ.jpg",
               "id": 32649,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jam Boy 1",
               "gender": 2,
               "credit_id": "578a9cc89251417c07000a1c",
               "name": "Faizon Love",
               "profile_path": "/tKz3IMO2jT8NdoDXOlKmcw4wLXf.jpg",
               "id": 62066,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Jam Boy 2",
               "gender": 2,
               "credit_id": "578a9cf59251417b2c000a6d",
               "name": "Deezer D",
               "profile_path": "/ksTbwWBTY9EzrfeixhDGkRm12vf.jpg",
               "id": 541733,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Vanilla Sherbet",
               "gender": 0,
               "credit_id": "578a9d4fc3a368331c000bd8",
               "name": "Devin Kamin",
               "profile_path": null,
               "id": 174966,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43dec3a368484e002cfb",
               "name": "Rusty Cundieff",
               "profile_path": "/qRxHN1pX9Qq05nhpJnxeXa8dJVP.jpg",
               "id": 141825,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "578a96b6c3a36832980008d7",
               "name": "Rusty Cundieff",
               "profile_path": "/qRxHN1pX9Qq05nhpJnxeXa8dJVP.jpg",
               "id": 141825,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.223641,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 20239,
      "vote_count": 15,
      "budget": 0,
      "overview": "Chronicling the controversial career of bad boys N.W.H. (Niggaz With Hats), this uproarious 'mockumentary' lampoons all of hardcore rap's hot-button issues. This underground laugh riot recounts the rise, fall and resurrection of a clueless bunch of would-be rappers, Ice Cold, Tone-Def &amp; Tasty Taste performing as N.W.H.",
      "similar": [
         277216,
         4258,
         65,
         8328,
         4638,
         9255,
         496,
         808,
         813,
         19908,
         239,
         64688,
         354912,
         650,
         279,
         281,
         17654,
         298312,
         8005,
         10634
      ],
      "original_title": "Fear of a Black Hat",
      "runtime": 88,
      "poster_path": "/jrpkn4GuBDS1Kh0lyR1UcXgeMi9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1994-10-28",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "The First Drive-By Comedy",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Rusty Cundieff"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Rusty Cundieff"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106880/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxOTE5Mzk1M15BMl5BanBnXkFtZTcwNTAzMTAwMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Larry B. Scott, Mark Christopher Lawrence, Rusty Cundieff | See full cast and crew »"],
      "reviews": [
         "\"Fear Of A Black Hat\" is everything the (much weaker) \"CB-4\" SHOULD have been. Rusty Cundieff's satirical eye is ruthless, as he folds, spindles, and mutilates every aspect of hip-hop trends and culture. Does \"FoaBH\" resemble Spinal Tap? Yes, a bit. Is it derivative of Spinal Tap? No, not really. The aim is more focused, the satire is better focused, and to be honest, it's funnier.",
         "Rated R for Strong Language,Violent Content and Some Nudity. Quebec Rating:13+ Canadian Home Video Rating:14A Fear Of A Black Hat is one of the funniest, most original comedies I have ever seen.Its basically a gangsta rap version of the film This Is Spinal Tap.Its a shame not many people have heard of this gem of a film.If you manage to find this film anywhere don't hesitate to buy it even if you don't like rap music.There are not too many comedy films that I give a perfect 10/10 to.The only ones I can think of at the moment are this film,Clerks,The World According To Garp,The 40 Year Old Virgin and Chasing Amy.This film is a hilarious stereotype of the gangsta rap culture.The movie is about a woman named Nina Blackburn who is making a documentary about the fictional rap group N.W.H(N****z with hats).They are basically the stereotype of a rap group making many controversial rap songs about killing and being a gangsta.Fear Of A Black Hat is an excellent comedic film and I recommend it even if you are not a fan of the gangsta rap scene.Its a shame this film is not in the Top 250. Runtime:88min 10/10",
         "After a big tip of the hat to Spinal Tap, this movie is hilarious. Anyone who grew up watching MTV will love it and if you didn't, rent it anyway,the \"My Peanuts\" and \"A Gangster's life\" videos are worth the three bucks alone.",
         "C'mon...how can you be against a rap-mockumentary that features the line: \"I want to make you mine, slap yo fat behind, tie you down and make you whine. I want you to scratch my itch and be my b***h....cause I luv you girl.\" One of the most consistently funny movies I've ever seen.",
         "Although it rips off SPINAL TAP scene-by-scene in some instances, FEAR OF A BLACK HAT offers up enough belly laughs -- some of them very large -- to make it worth a look. Rusty Cundieff, who did some hysterically funny segments for Michael Moore's TV Nation program, proves himself to be a solid director with an eye for biting satire. Unfortunately, some of the jokes are a little weak. That said, there are moments when this movie nails some of the hypocrisies of pop music (not just hip-hop). Pretty good performances all around, too.",
         "This is a really funny film, especially the second, third and fourth time you watch it. It's a pretty short film, and i definitely recommend watching it more than once, you will 'get it' more the second time. It's like spinal tap but the rap version. It has a lot of attitude in it which can be a negative thing in rap influenced films, but it's just a total p**s take and isn't a problem because of the irony it creates. Plenty of stand-out bits, one of those types of films which you will find yourself quoting lines with your mates, and it WILL raise laughter. My personal favourite part is the 'guerrillas in the midst' section. Great video, superb!",
         "i've just read the most recent remarks about this movie and i would like to respond. you're probably not familiar with the original story of rap group N.W.A. which dates back to the beginning in 1988, in 1989 ice cube left the band to go solo and ultimately in 1991, the band breaking up when Dr.dre left. which led to a lot of beef starting with the departure of ice cube and dr.dre in 1991. this story was somewhat based on that. further more this movie was a 90 minute laughing spree, the way they explained the bootie juice song to be a political statement was hilarious. not to mention the \"love song\" tasty was hooking up. and when vanilla sherbert got his ass kicked, just like the record company executive is also hilarious and having they're managers getting shot every time too. people who didn't enjoy this movie probably didn't get it or were complete idiots, my opinion",
         "Okay, my title is kinda lame, and almost sells this flick short. I remember watching Siskel & Ebert in '94 talking about this movie, and then playing a clip or two. Not being a rap-conscious guy (although I could identify Snoop Dogg, Vanilla Ice, and MC Hammer music), I wasn't much interested when they started talking about the film. But then, S&E showed the scene where the band explains how they picked their name (using some \"shady\" logic and a bunch of \"made up\" facts), and then another scene where the band, and their rival band, both visit a school to promote getting involved (and, of course, NWH comes up with some \"info\" about how the rival band leader is a loser because he got good grades in school and was on the yearbook committee). So I filed it away that I should see this movie. A couple of years later, this thing shows up on HBO and I recorded it, only to laugh my butt off for hours. Yes, it has a \"Spinal Tap\" kind of rhythm to it...even the documentarist takes essentially the same \"tone\" in setting up the clips, and the band follows a similar path (what I now call the \"Behind the Music\" phenomenon - smalltime band has good chemistry, gets famous, too much money too fast, squabbling, drugs, some type of death, band breaks up, then reconciles, finishing with a hope for more albums in the future, and fade to black). The one thing that is true is that in Spinal Tap, you catch the band perhaps with a little more success in their past. But Tap drags at some points, and in my mind is reduced to laughs that are set up by specific scenes. Oh, this is his rant about the backstage food, this is spot where he wants the amp to go to \"ELEVEN\", this is the spot where the guy makes the pint-sized stonehenge, etc... Contrasting to FoaBH, which seems to have more \"unexpected\" humor. You can see some of it coming, but there isn't a big setup for every joke. Sometimes, the jokes just kinda flow. Cundieff and the other actors in the band had a real chemistry that worked. Also, the direct references to Vanilla Ice, Hammer, and a bunch of other caricature-type rappers really worked well. This strikes me as a film you watch once to get the main story and laughs, and then go back and watch to catch the subtle jokes. And the songs. Is \"My Peanuts\" better than \"Big Bottom\" (from Spinal Tap)? I don't know - but they're both damn funny. Tone Def's awful video during his \"awakening\" phase is so bizarre, yet so funny. I could go on awhile, but save your time and don't waste it on CB4. I watched the first half hour, and got bored. You don't get bored on FoaBH. There are slightly less funny moments, but you can never tell when something good is about to happen. Perhaps my favorite scene is when Ice Cold and Tastey Taste (name ripoffs if I've ever heard any) discover they've been sharing the same girl....at one point, you've got those two pointing guns at each other, and the next thing you know, the manager, the photographer, the girl, and I think even Tone Def are in the room pointing guns at each other, switching targets back and forth. And, of course, someone does get shot. I did find it odd that NWH's managers suffered similar fates to Spinal Tap's drummers (although none spontaneously combusted, I don't think). There were enough similarities that I cannot ignore the likelihood that Cundieff saw \"Spinal Tap\" prior to writing this film, although this is clearly much more the Spinal Tap of hip-hop. While some similarities exist, the humor is different, and the movie seems more like a real documentary (maybe because we don't recognize a single actor in this thing, even the guy who played \"Lamar\" from \"Revenge of the Nerds\"). All in all, this movie has, in my opinion, \"street cred\". Kinda like NWH.",
         "This movie is hilarious and while the satire leans against material dated from the 80's and early 90's, if you know enough hip hop and pop culture then you'd find it funny, even today. The writing is excellent, the jokes are funny and well delivered and the songs are hilarious. Two 'videos' in the movie, one titled 'Booty Juice' and the other \"A Gangstas life ain't fun\" hit home today just as well as they did when this movie came out. It appears that much of the hip hop life style and creed hasn't changed much over the years. The movie is consistently funny from beginning to end, with many of the jokes dead panned and often subtly delivered. It's easy to miss a lot of the jokes during the film if you aren't familiar with the subjects that they are poking fun at. But again, much of what the director delivers is still funny and relevant even today. A must see satire!",
         "I saw it in a posh movie theater where the audience is usually white, educated, and urban. The showing I attended had a sprinkling of African-Americans, and it made the difference in audience-reaction between the two groups a wonderful social commentary on the state of race relations in this country. Basically, the white folks were AFRAID to laugh or laughed nervously at the funny bits --and there are many! -- because they'd be \"laughting at Blacks\", while the Blacks also stayed pretty silent because many couldn't laugh at themselves in front of the whites. I, on the other hand, being Asian (and thus belonging to neither group), had a great time viewing this satire of rap culture and its egos/trappings/values/pseudo-philosophies. The cast is talented and does at great job becoming the characters portrayed. The songs are too funny to be believed. This film is one of the best pseudo-documentaries to come along, including \"A Mighty Wind\""
      ],
      "genres": [
         "Comedy",
         "Music"
      ],
      "productionCompanies": [
         "Incorporated Television Company (ITC)",
         "Oakwood Productions"
      ],
      "summaries": ["A mockumentary chronicling the rise and fall of a not particularly talented--or particularly bright but always controversial--1990s hip-hop group, NWH (Niggaz with Hats)."],
      "budget": 999999
   },
   "movielensId": 449,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-28",
      "dvdReleaseDate": "2003-07-08",
      "directors": ["Rusty Cundieff"],
      "runtime": 88,
      "movieId": 449,
      "title": "Fear of a Black Hat",
      "mpaa": null,
      "actors": [
         "Larry B. Scott",
         "Mark Christopher Lawrence",
         "Rusty Cundieff",
         "Kasi Lemmons",
         "G. Smokey Campbell",
         "Faizon Love",
         "Deezer D",
         "Devin Kamin"
      ],
      "imdbMovieId": "0106880",
      "originalTitle": "Fear of a Black Hat",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Chronicling the controversial career of bad boys N.W.H. (Niggaz With Hats), this uproarious 'mockumentary' lampoons all of hardcore rap's hot-button issues. This underground laugh riot recounts the rise, fall and resurrection of a clueless bunch of would-be rappers, Ice Cold, Tone-Def &amp; Tasty Taste performing as N.W.H.",
      "tmdbMovieId": 20239,
      "avgRating": 3.46348,
      "releaseYear": "1994",
      "numRatings": 712,
      "posterPath": "/jrpkn4GuBDS1Kh0lyR1UcXgeMi9.jpg"
   }
}