{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "nudity",
            "id": 2483
         },
         {
            "name": "roadhouse",
            "id": 2781
         },
         {
            "name": "liquor",
            "id": 3423
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "confrontation",
            "id": 15295
         },
         {
            "name": "grifter",
            "id": 159607
         },
         {
            "name": "film noir",
            "id": 195402
         },
         {
            "name": "solitary",
            "id": 197573
         }
      ],
      "imdb_id": "tt0106926",
      "video": false,
      "title": "Flesh and Bone",
      "recommendations": [
         67307,
         110093,
         42176,
         210599,
         50116,
         219575,
         32221,
         40480,
         26337,
         32035,
         31922,
         24585,
         118430,
         88818,
         75889,
         9409,
         15771,
         56385,
         39473,
         31652
      ],
      "backdrop_path": "/w43C4QDCOBcB0euSl1CQn8Nu83n.jpg",
      "revenue": 9488998,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Kay Davies",
               "gender": 1,
               "credit_id": "52fe47859251416c7509c763",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Arlis Sweeney",
               "gender": 2,
               "credit_id": "52fe47859251416c7509c757",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roy Sweeney",
               "gender": 2,
               "credit_id": "52fe47859251416c7509c75b",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ginnie",
               "gender": 1,
               "credit_id": "52fe47859251416c7509c75f",
               "name": "Gwyneth Paltrow",
               "profile_path": "/8x3jpWD7DEvyMXO1FOjwNdd1UZT.jpg",
               "id": 12052,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sarah Willets",
               "gender": 1,
               "credit_id": "52fe47859251416c7509c76d",
               "name": "Julia McNeal",
               "profile_path": null,
               "id": 120672,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Clem Willets",
               "gender": 0,
               "credit_id": "52fe47859251416c7509c771",
               "name": "Ron Kuhlman",
               "profile_path": null,
               "id": 157994,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Young Arlis",
               "gender": 2,
               "credit_id": "52fe47859251416c7509c775",
               "name": "Jerry Swindall",
               "profile_path": null,
               "id": 19870,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Scotty Willets",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c779",
               "name": "Ryan Bohls",
               "profile_path": null,
               "id": 948411,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Boy in Suit",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c77d",
               "name": "Ez Perez",
               "profile_path": null,
               "id": 1286734,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Tiny Ted",
               "gender": 2,
               "credit_id": "52fe47869251416c7509c781",
               "name": "Craig Erickson",
               "profile_path": "/5NOIVaJSY8nNxmxHR35pKj5WDXG.jpg",
               "id": 2848,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Cindy",
               "gender": 1,
               "credit_id": "52fe47869251416c7509c785",
               "name": "Barbara Alyn Woods",
               "profile_path": "/5vj7zNu93sgshvy8iLK0V1SR32r.jpg",
               "id": 44033,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Plump Man",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c789",
               "name": "Joe Berryman",
               "profile_path": "/cbaZzxbzOeFLyE72cxbbnmJTTgm.jpg",
               "id": 1179344,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Elliot",
               "gender": 2,
               "credit_id": "52fe47869251416c7509c78d",
               "name": "Scott Wilson",
               "profile_path": "/uAPQD3zXThKHXaYELx3ePSzeWwM.jpg",
               "id": 6914,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Woody",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c791",
               "name": "James N. Harrell",
               "profile_path": null,
               "id": 236486,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Juan",
               "gender": 0,
               "credit_id": "52fe47869251416c7509c795",
               "name": "James N. Harrell",
               "profile_path": null,
               "id": 236486,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47859251416c7509c769",
               "name": "Steve Kloves",
               "profile_path": "/nhHzMwSiVse15WF1Qi7xfVBoo7A.jpg",
               "id": 10967,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53a8add40e0a261445006629",
               "name": "Steve Kloves",
               "profile_path": "/nhHzMwSiVse15WF1Qi7xfVBoo7A.jpg",
               "id": 10967,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.109536,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18551,
      "vote_count": 30,
      "budget": 0,
      "overview": "Some thirty years after Arlis witnesses his father murdering a family, he runs into Kay, who happens to be the family's baby who was spared. Kay and Arlis suspect nothing about each other, but when his father returns, old wounds are reopened.",
      "similar": [
         11826,
         4771,
         9946,
         8067,
         226,
         9093,
         2149,
         1433,
         979,
         11615,
         431,
         59,
         88,
         205,
         949,
         769,
         273481,
         80752,
         281,
         339692
      ],
      "original_title": "Flesh and Bone",
      "runtime": 126,
      "poster_path": "/3bSequ38Oi1tWElVTdOKiR24MPP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Spring Creek Productions",
            "id": 705,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mirage",
            "id": 19534,
            "origin_country": ""
         }
      ],
      "release_date": "1993-11-05",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Evil is patient",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Kloves"],
      "runtime": 126,
      "synopsis": "While helping his grifter father burgle a house in rural Texas, young Arlis Sweeney watches him murder the entire family, leaving only a crying baby. Fast forward 30 years. Arlis has settled into a bleak routine restocking vending machines on a route that includes \"a place to eat, a place to sleep, and a woman\" in every dusty roadside town. Into this routine falls Kay Davies, another damaged soul down on her luck and stranded away from home and her abusive ne'er-do-well of a husband. Arlis is going that way and agrees to give her a ride. While the two are at her house, movers arrive to take the furniture, which her husband sold to pay gambling debts. Seeing nothing to remain for after a confrontation with her husband, Kay leaves with Arlis. Arlis and Kay begin to fall for each other. In the middle of a rainy night, a knock on their motel door introduces Ginnie, a young woman who makes her living stealing jewelry off corpses in funeral homes. Pleading car trouble, she leads Arlis to her car where his estranged father Roy, who exudes sleaze and criminality, is waiting with a back full of buckshot. Arlis patches up his father and lets the pair spend the night in his room. The next day, they go their separate ways. As Ginnie and Roy pass an abandoned house, Ginnie remarks that it's the same house that's in a photograph that Kay is carrying with her. Roy realizes that Kay must be the crying baby he spared 30 years ago. Roy hates loose ends. Arlis comes to the same realization, and tries to break it off with Kay, leaving her in the motel room with some goodbye cash while he goes on a business errand from which he doesn't plan to return. Possibly changing his mind, he calls Kay's motel and learns that she left with Ginnie. Judging by the directions that the motel clerk said Ginnie asked for, Arlis guesses that they're headed for the old house. In fact, Roy was setting a trap for him. Ginnie tells Kay that there's a surprise in store for them at the old house. Arlis soon arrives, and after Roy sends the girls out for a walk, he and Arlis have a confrontation. Roy says he can't trust Arlis not to tell Kay that he murdered her family, so one of them will have to kill Kay. Instead, Arlis shoots his father. Arlis finds it too painful to be with Kay, and too painful to try to explain her past to her (she was told by her foster parents that her family died in a car crash). He tells her \"Some things, it just don't do no good to talk about.\" Kay doesn't understand, but realizes that she and Arlis aren't going to make it. As he told her, he's a creature of habit, and she doesn't fit in. Regretfully, they part.",
      "writers": ["Steve Kloves"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106926/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMTMxNDgwNl5BMl5BanBnXkFtZTcwODU5MTQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Dennis Quaid, Meg Ryan, James Caan | See full cast and crew »"],
      "reviews": [
         "I've been thankful for many things during the strange journey that has been my life. Among them was that I had never seen nor heard of Gwyneth Paltrow before seeing Steven Kloves' unsung, too-often trashed work, Flesh and Bone. Although this film has been deemed unwatchable by some; primarily, I suspect, by those who simply cannot deal with Meg Ryan in any form, Flesh and Bone is entirely watchable and often engrossing. I stumbled onto it by accident one afternoon, when the film I had paid to see suffered a projector crash, leaving me to wander the nearly empty multiplex at my leisure. Flesh and Bone, said the sign over the door. Hmm. supernatural thriller with voodoo elements? Well, not really, although the scene that greeted me as I entered: a very scary-looking James Caan, with shotgun, skulking through a shadowy interior, made me think my initial assessment had been close (I had entered its theater a few minutes after the film had started.) Just a few more minutes passed before I realized that I was in the presence of something, at the least, unusual. First, considerable time elapsed without Dennis Quaid flashing his '55 DeSoto grille grin even once. In fact, he was scowling like all getout. Meg Ryan barely smiled either and it was well into the film before she first flipped her hair (while talking about pickles). Very strange. Being something of a sucker for films that cast against type, I was getting pulled in. But WHO was the spooky chick who kept walking in and out of various scenes, shoplifting something in almost each case? That was Gwyneth, of course. If she had played the role of the deeply alienated Ginnie later in her career, she certainly could have pulled it off, but the mystery of her character, the thing that made you try to imagine the circumstances that had created such a creature, would never have manifested. It just would have been Gwynnie playing Ginnie. I'll be honest, I've remained immune to the whole Gwyneth thing. To me, she's something like Gouda cheese; certainly edible, but best if you're in the mood for a snack with somewhat more aroma than flavor. I admit that I've always dug her Mom, Blythe Danner, among the most delicately fair of all cinematic flowers. But I loved Gwyneth Paltrow in this film, still do, and always will. I don't think she stole the show, as some seem to, but her perfectly-played Ginnie was absolutely essential to it. The rather default brutality that lurks in Flesh and Bone could seem artificial, but against the historical backdrop of Texas, where it is set, the film's slant makes sense. Texas history has been drenched in blood and tragedy from the start; Cabeza De Vaca, the lonely, ignominous demise of the LaSalle expedition, which foundered and was swallowed up on its Gulf Coast in an attempt to navigate the Mississippi northward, conflict with Spain and Mexico, the Comanche terror, the slaughter of its vast buffalo herds, its rape by oil and cattle culture, Texas politicians (just hitting a few high spots). Merely passing through the state can give one the sense that a loose black hole is about, not a massive one, but big enough. Flesh and Bone is a promenade of the gravitationally doomed. Everyone in the film seems to be drifting toward the event horizon of an unseen singularity, just beginning to be stretched out of shape. Closest to oblivion is James Caan's chilling Roy Sweeney, a character in the mold of Christopher Walken's very bad dad in At Close Range but chicken-fried to the brink of carbonization; a man for whom conscience is no longer even a concept. Plunging close behind is his son Arliss (Quaid), someone who, after matriculating under his father's brutal tutelage, has become an exile to his own life. His flickering soul is not quite dead yet, but give it time. Meg Ryan's Kay Davies, the unknowing survivor, as an infant, of the film's opening horror, is a type of gently tragic heroine one can see anywhere, but most often in the South, the most culturally monolithic and unforgiving region of an unforgiving America. (Texas is the West but also, most certainly, the South.) Free-form and fundamentally cheerful personalities like Kay's may not always fare well there, unless legitimized by kids and a ring; something her character is beginning to understand as she pops, drunk, out of a paper cake at a roadhouse hoo-rah. Paltrow's Ginnie is possibly the most recent gravitational captive, but she has entered the plunge with cryogenic conviction, forming a binary dark star with Caan's character. I liked this little film enough to collect it and have never regretted it. There is real psychological texture, a noiresque sense of doom, convincing intimacy set against a vast West Texas backdrop, a house haunted by ghosts living and dead, a brief, poignant performance by the never-failing Scott Wilson, a great score by the brilliant Thomas Newman (I started watching the TV series Boston Public just to hear its opening theme music, which he composed) and a closing scene as mythic as that of any cowboy classic. The film's conclusion flirts a bit with improbability but still works because, dear friends, karma does exist. It's not just a hippie word. Leave the Anti-Megs to their own gravitational plunge and enjoy.",
         "\"Flesh and Bone\" remains to be one of the great films of the nineties, sitting alongside \"Bright Angel\" as one of the decade's most tragically neglected classics. Perhaps the fact it contains such a high degree of subtlety was why it wasn't appreciated when it was first released, the most frequently stated criticism being that its climax is dramatically unsatisfying, yet its somber ending works perfectly. Outside of \"Hurlyburly\" it is unquestionably Meg Ryan's finest performance, the same going for Quaid who gives his character a quiet desperation that becomes quite devastating by the end. Caan is great as always, but it is Paltrow who really impresses, playing a role bereft of the sugary sweetness that plagued the majority of her roles that followed. Scott Wilson also shines in a small but memorable role. \"Flesh and Bone\" may never receive the attention it deserves, which is a shame because it is unquestionably a lyrical masterpiece, beautifully shot and acted, recalling those low-key gems of the seventies like \"The Rain People\". Highly recommended.",
         "Arlis (Dennis Quaid) is a vending machine owner who roams from town to town in West Texas. Greatly disturbed by horrific memories from his childhood, Arlis fails to connect with the women he meets. He prefers trysts with married women where no strings are attached. All of this changes the day Arlis meets Kay (Meg Ryan). Running away from an abusive and spendthrift husband, Kay encounters Arlis in a bar under amusing circumstances. Soon after, she is traveling with him on his circuit and they are falling in love. Bliss, however, is short. Arlis' evil father (James Caan) re-enters the life of his son and Arlis must once again suffer the consequences of the ties that bind them. Will it be possible for Arlis to break free from his past and begin a new life with Kay? This is, truly, one of the most haunting films ever made. The story is a multi-faceted study of the nature of good and evil. Quaid and Ryan give such depth to their doomed and complex characters that the viewer stays mesmerized as the story unfolds. Caan, too, is a wonder as the bad-to-the-bone father. As for the sweeping and lovely cinematography, it perfectly realizes the beauty and desolation that is west Texas. The final scenes are guaranteed to put a lump in anyone's throat, tears included. Recommended highly for discriminating movie fans everywhere.",
         "Once in a while you come across someone who is a little odd, or haunted, or unsociable, or all of the above, and you wonder to yourself how they might have gotten that way. What made them that way? Why are they so terminally sad? Steve Koves has brought us the back story to those questions. His script and handling of the story are stellar. This is not a happy film. But it is a fascinating one. Everyone in this cast is at their best. But it is Dennis Quaid, who gives the best performance of his ample career, that breaths this story to life, or, death, as it were. He plays Arliss. Arliss has a nickel and dime vending machine business that takes him through the most desolate parts of Texas. His work is so lowly that he doesn't even handle paper money. Coins and dyed chickens are his stock and trade. He pours himself into his boring work as if he is trying to take his mind off of something. Something unpleasant. We know what that something is from the opening of the movie. What unfolds now is the picture of what a destroyed life looks like as it tries to outrun it's past. Quaid is brilliant at creating a haunted and wounded Arliss without making him pathetic. He is the obscure guy you might run across unexpectedly that makes you go, hmmm, what happened to him. There is nothing about this film that isn't first rate. I am mystified by it's \"average\" rating here on this site. I suppose if you hate good scripts, skillful directing, brilliant performances, and haunting sound and cinematography, I guess I could see giving this movie a 5. It is certainly possible not to like this type of film. But it is negligent, as a viewer, not to acknowledge it's quality. It is an excellent piece of film making and Dennis Quaid shows just what a brilliant and understated actor he is. James Caan, Meg Ryan, and Gwyneth Paltrow are also up to Quaids level here. I highly recommend this movie. It's different. It's interesting. It's engrossing. And it's brilliantly done.",
         "\"Flesh and Bone,\" with it's superb actors and their portrayals of an artistically told story in the Texas Outback, gives us a cultural peek at ways of life we would probably not encounter otherwise while solving a crime mystery and telling a cowboy's love story. Haunted by his childhood, Arlis, so realistically portrayed by Dennis Quaid, reveals to us what being a cowboy is about. Running his business across West Texas with his memories, his devil on his heels, Arlis triumphs and beats his flesh and bone genetics. His double star-crossed love for the same child and woman unfolds as the story is told and he becomes a lonesome hero worthy of his lone star. Gwyneth Paltrow's acting talents can be seen as she makes you believe she is Ginnie, a waiflike con seemingly devoid of any feelings other than borderline necrophilia and spiteful nastiness. James Caan, as Roy, is Arlis' cruel father and Ginnie's old-enough-to-be-her-grandfather lover. Caan plays the the villain of both the past and the present with a calculated coldness that literally makes his eyes sparkle. (Watch for it!) Roy will make you ever thankful for the your own father who raised you, and your respect for and understanding of his son Arlis grows with the movie. Meg Ryan makes us want to embrace Kay, the drunken but lovely cake dancer caught in an abusive marriage but who falls in love with cowboy Arlis. Ryan works her magic portraying Kay as a gentle, sometimes-intelligent, sometimes-naive soul who has been down on her luck since a fateful night before her first birthday but who still manages to smile at the world and believe in hope. Caan's and Paltrow's characters, people who we pray we never meet, come off with a game playing realness that makes us remember why we lock our doors in our motel rooms and our homes. This uneasiness is balanced by the empathy we have for Ryan's and Quaid's good to the bone characters. Never has a cowboy's love been better explained than in Dennis Quaid's face in the final moments of the film. Four four-star performances by four top actor, this overlooked movie will become a classic someday in the near future.",
         "Perhaps some people only want to see Meg Ryan in romantic comedies, or perhaps IMDb voters give this a low average rating because 'nothing happens', but look beneath the surface and you will find a dark and haunting drama of the first order, with the best work from all involved for many years before or since. Steve Kloves, completely 'miscast' as the adaptive screenwriter for the Harry Potter films (he writes in American, for heaven's sake) here produces a great original work as a writer/director, utilizing some amazing visuals from Phillipe Rousselot (d.o.p.) and music from Thomas Newman (a score suitably subtle, haunting and moving). Caan, Ryan and a pre-fame Gwyneth Paltrow are all on top form but the real star here is Dennis Quaid, whose face, a canvas of tortured memories and struggling decency, says more than Kloves could ever hope to write. As director he chooses wisely; he gives Quaid a single line, then keeps the camera rolling.",
         "You will never see Meg Ryan in a role like this. She was phenomenal and it is unfortunate she did not get more roles like this. Dennis Quaid and Gwyneth Paltrow were also excellent and these three make the film worth watching. James Caan is fine, but his role is so one- dimensional that no actor can do much with it, and indeed he didn't. This film is a must see because of the characters. The plot is compelling and very dark, but the characters shine through and illuminate each other in a way that is unique because each character has dimensions that are not explained. Paltrow's character seems like a throwaway, but may be the most important of all. If I were teaching a course on film, I would select this one and ask the students to explain why it works. I usually think I know why a film is excellent, and yet after this film ended, I knew I could not put it into words. The purpose of this review is to suggest you watch this one if you get a chance because you may love it. Most who watched this movie were pleased but unenthusiastic. This film is much, much better than the 6.2 rating it had when I checked.",
         "\"Flesh and Bone,\" with it's superb actors and superb portrayals of an artistically told story in the Texas Outback, gives us a cultural peek at ways of life we would probably not encounter otherwise while solving a crime mystery and telling a cowboy's love story. Haunted by his childhood, Arlis, so realistically portrayed by Dennis Quaid, reveals to us what being a cowboy is about. Running his business across West Texas with his memories, his devil on his heels, Arlis' triumphs and beats genetics. His double star-crossed love for the same child and woman unfolds as the story is told and he becomes a lonesome hero worthy of his lone star. Gwyneth Paltrow's acting talents can be seen as she makes you believe she is Ginnie, a waifish con seemingly devoid of any feelings other than perhaps borderline necrophilia and spiteful nastiness. James Caan, as Roy, is Arlis' cruel father and Ginnie's old-enough-to-be-her-grandfather lover. Caan plays the the villain of both the past and the present with a calculated coldness that literally makes his eyes sparkle. (Watch for it!) Roy will make you ever thankful for the your own father who raised you, and your respect for and understanding of his son Roy grows with the movie. Meg Ryan makes us want to embrace Kay, the drunken but lovely cake dancer caught in an abusive marriage but who falls in love with cowboy Arlis. Ryan works her magic portraying Kay as a gentle, sometimes-intelligent, sometimes-naive soul who has been down on her luck since a fateful night before her first birthday but who still manages to smile at the world and believe in hope. Caan's and Paltrow's characters, people who we pray we never meet, come off with a game playing realness that makes us remember why we lock our doors in our motel rooms and our homes. This uneasiness is balanced by the empathy we have for Ryan's and Quaid's good to the bone characters. Never has a cowboy's love been better explained than in Dennis Quaid's face in the final moments of the film. Four four-star performances by four top actor, this overlooked movie will become a classic someday in the near future.",
         "A friend gave me this tape a few weeks ago, it did not have a cover and I had never heard of it. I was surprised to see who starred in it. Meg Ryan is one of my favorite actresses. She did a real good job of making this part come alive. But I still think the biggest surprise was seeing James Caan play a role without any feeling. He really was evil in this role and was believable as this person. The movie itself really makes you think that whatever you do will eventually come back to haunt you no matter what you do. I also liked Gwyneth Paltrow in the role of a thief, but I wished that I knew why she did the things that she did. And why she would stay with a man that was pure evil. I guess that is what makes the movie so thought provoking. I'm glad that a friend gave this to me to watch, because if I had seen the title I would have thought it was a horror movie. I have since talked other friends into watching it and all have liked it. I would recommend this movie to anyone.",
         "This is not a film where everything appears obvious. It is dark and complicated. It is about how the past haunts you and affects your life in the present. It is the stuff that Freud would have fun dealing with. The stars in this film give performances that are among the best in their careers. Dennis Quaid (Frequency, Far From Heaven) is clearly the lead in this picture as the son of a soulless murderer and thief (James Caan). He carries the devil with him through his life and it affects his relationships with women. He runs into an abused housewife (Meg Ryan, in a non-romantic role), and they travel the back-roads of Texas together. Gwyneth Paltrow (Shakesphere in Love) is a thief that plays Caan's companion, even if he is old enough to be her grandfather. This is written and directed by the Oscar nominated (Wonder Boys) writer of all of the Harry Potter movies, Steve Kloves. He does a fabulous job. Definitely a movie to watch when you get a chance."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Mirage Enterprises",
         "Spring Creek Productions"
      ],
      "summaries": ["Some thirty years after Arlis witnesses his father murdering a family, he runs into Kay, who happens to be the family's baby who was spared. Kay and Arlis suspect nothing about each other, but when his father returns, old wounds are reopened."],
      "budget": 0
   },
   "movielensId": 451,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-11-05",
      "dvdReleaseDate": "2002-04-16",
      "directors": ["Steve Kloves"],
      "runtime": 126,
      "movieId": 451,
      "title": "Flesh and Bone",
      "mpaa": "R",
      "actors": [
         "Meg Ryan",
         "Dennis Quaid",
         "James Caan",
         "Gwyneth Paltrow",
         "Julia McNeal",
         "Ron Kuhlman",
         "Jerry Swindall",
         "Ryan Bohls",
         "Ez Perez",
         "Craig Erickson",
         "Barbara Alyn Woods",
         "Joe Berryman",
         "Scott Wilson",
         "James N. Harrell",
         "James N. Harrell"
      ],
      "imdbMovieId": "0106926",
      "originalTitle": "Flesh and Bone",
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": ["1SbacB2W1l8"],
      "plotSummary": "Some thirty years after Arlis witnesses his father murdering a family, he runs into Kay, who happens to be the family's baby who was spared. Kay and Arlis suspect nothing about each other, but when his father returns, old wounds are reopened.",
      "tmdbMovieId": 18551,
      "avgRating": 3.05235,
      "releaseYear": "1993",
      "numRatings": 659,
      "posterPath": "/3bSequ38Oi1tWElVTdOKiR24MPP.jpg"
   }
}