{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0111712",
      "video": false,
      "title": "Widows' Peak",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Katherine O'Hare / Clancy",
               "gender": 0,
               "credit_id": "52fe44c8c3a368484e0368cd",
               "name": "Mia Farrow",
               "profile_path": "/kuLfS2jQOnfIOwCO7RHlwjDIERQ.jpg",
               "id": 12021,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Con Clancy",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0368d1",
               "name": "Jim Broadbent",
               "profile_path": "/50TV6UKJKjmqdn1GQNuuCIYHLzP.jpg",
               "id": 388,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Edwina Broome",
               "gender": 1,
               "credit_id": "52fe44c8c3a368484e0368d5",
               "name": "Natasha Richardson",
               "profile_path": "/d3V17LUillMkNYIM7JHRqtz7jZK.jpg",
               "id": 20162,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Godfrey Doyle-Counihan",
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0368d9",
               "name": "Adrian Dunbar",
               "profile_path": "/2dbNGBaqpnn55pOivsPh4B3dVQJ.jpg",
               "id": 42566,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mrs. Doyle-Counihan",
               "gender": 1,
               "credit_id": "52fe44c8c3a368484e0368dd",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c8c3a368484e0368c3",
               "name": "John Irvin",
               "profile_path": "/A75sBHfUrcdG9BGQdwKh4akqWWn.jpg",
               "id": 17784,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c8c3a368484e0368c9",
               "name": "Hugh Leonard",
               "profile_path": null,
               "id": 93797,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.972716,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 25440,
      "vote_count": 4,
      "budget": 0,
      "overview": "Scandal and mystery reign following the arrival of Edwina in a small Irish town populated entirely by widows. Edwina quickly falls out with the locals while also falling in with the son of the community's leader",
      "similar": [],
      "original_title": "Widows' Peak",
      "runtime": 101,
      "poster_path": "/xXyVUwvJesJJChzpvn7xj5cAOfm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
         "name": "Fine Line Features",
         "id": 8,
         "origin_country": ""
      }],
      "release_date": "1994-05-13",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Irvin"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Hugh Leonard",
         "Hugh Leonard"
      ],
      "originalLanguage": "Irish",
      "imdbLink": "http://www.imdb.com/title/tt0111712/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwOTA3Nzg4NF5BMl5BanBnXkFtZTcwOTUwMjgyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Joan Plowright, Mia Farrow, Natasha Richardson | See full cast and crew »"],
      "reviews": [
         "The 1990s saw an interesting resurgence of very British comedies set in or around the turn of the century, possibly with the success of Merchant-Ivory outings or the universally acclaimed ENCHANTED APRIL. All in all, this one came and went and barely received little more than a nod here and there but proves that good -- even great -- films don't need to be Oscar-touted and have a grandiose feel. As a matter of fact, like the Irish town of Kilshannon where the story is set, WIDOW'S PEAK is intimate and small scale. It tells the tale of a clique of widows who are all manners, social rules and regulations, led by Mrs. Doyle Couninhan (Joan Plowright in full matriarch mode), presiding over the town like a sinister spider. Miss O'Hare (Mia Farrow) is not a widow but has a past, and this past comes to taunt her once Edwina Broome (Natasha Richardson) comes into town: immediately they rub each other the wrong way and every encounter escalates in intensity, with each of the women put in a position where we sympathize with them at times, and then we don't (since both behave in less than noble ways), which leaves us unsure of where this is all going -- but enjoying the suspenseful ride nevertheless. While reviewing this film could reveal major secrets, it's enough to say that when the pay-off comes around, it's completely satisfying. All three female leads perform their roles without out-shining the other, but for once, Farrow doesn't act like she's an automated mold straight out of the Woody Allen factory of actors. A delicious comedy, one of those small-yet-hidden gems of films that are worth a try, and worth seeing as a companion piece to A MONTH BY THE LAKE.",
         "A truly lovely look at Irish humor and it's not so subtle jabs at the Brits. But there's more. How these characters weave a tale is fascinating and the plot thickens, as they say, with a marvelous twist that caught me totally off guard. Wonderful performances by all especially Joan Plowright who kept me laughing whenever she was on screen. It was nice to see Mia Farrow successfully widening her range, and Natasha Richardson wafted through the film with an aire of mystery about her -as did Farrow- commanding out attention throughout.",
         "I was forced to watch this and ended up loving it. I just can not believe how terrific this film is. I thought I knew where this thing was going, and then it went the other way, and then yet again!! This is my first film experence of Natasha Richardson. How delightful she is in this. Joan Plowright is a gem of course, and what a surprise it was to see that Mia Farrow could actually act!! I have never seen such abilities before, at least not since \"Hannah and Her Sisters\"(not much then either). Natasha is a newcomer to Widow's Peak and not all are glad to see her. She seems to change the quiet little village into a media circus. I won't spoil it by telling you any more. You will have to watch and enjoy it for yourself. This is a must see!",
         "A great movie that I thoroughly enjoyed. Tremendous performances all around, but specifically from Natasha Richardson and Mia Farrow. Others have described this as a \"more a woman's movie\" but I beg to differ. This is a great movie for anyone and as a man I must say that Ms Richardson looked absolutely ravishing in the beautiful vintage costumes and makeup. A must see for any man or woman.",
         "A delightful stroll in a Irish village ruled by the iron hand in the steel glove of local widow, Joan Plowright, who gives her usual impeccable and entertaining performance. The pace, the humour, and the plot are all perfectly executed, culminating in a climax that your best guess would not anticipate. Probably more a woman's movie, but then most of the best ones are. I have watched it numerous times and my enjoyment has not abated. Definitely worth the time.",
         "Yes, this movie has the elements of a chick flick: it's about relationships, most of the main characters are women, it's set in the 1920s and has lovely costuming and beautiful English countryside settings, and there is a love story-- but it's also more than that. It's a complex story about a single woman (Mia Farrow) in an English village, and how she interacts with her widowed and single neighbors. It combines comedy and drama in a good mix. There is action, and good pacing, with a surprise twist at the end. There are excellent actors in this film and great chemistry between them. You care about the characters; even the annoying ones. One can tell that the actors enjoyed making this movie. I would recommend this film to just about anyone. If you are of the persuasion that normally avoids chick flicks or period pieces, give this one a try. You might be surprised at what you've been missing.",
         "Nowadays,nine movies out of ten feature two male actors as the leads.For a change,\"Widows Peak' boasts three actresses at the top of the bill.And what a threesome:Mia Farrow,a spinster,the Cinderella of a bunch of posh and distinguished ladies whose queen is none other than Joan Plowright.This wealthy widow ,with her hoity-toity ways, annoys anyone and all,including her son,a would be handy man,actually a big ninny,always tied to his mother's apron strings,although he firmly denies it.Enter Richardson,who plays a beautiful English widow,and Plowright would like her offspring to marry this rich heiress.A mortal feud begins between Farrow and Richardson.But things are not what they seem and prepare yourself for a lot of unexpected twists,till the very end.And you'll dig such witty lines as (the ironical lawyer to Plowright)\"your real treasure is the love of your son\". More than the shrewd plot,the everyday life of the little community is exquisitely depicted:the film (excerpts of De Mille's \"ten commandments\"(1923,of course!)during which Plowright is enjoying sweets,the mass on Sunday morning,the local dance during which Farrow and Richardson fight for... two tickets for King Vidor' s \"the big parade\",the regatta,the only time Plowright's son feels manly. An user regrets James Ivory did not direct it.One would probably have a better movie,for sure.The characters -particularly the lady and her son- verge on caricature. But anyway,watch it,if you like great actresses.",
         "This is an absolute masterpiece. I have watched the film innumerable times and still enjoy, with the best and most unpredictable climaxes I have ever seen. This film starts off as a great film and just gets better and better.",
         "I'm feeling a bit silly here, but I thought Natasha Richardson was British. In this film, she has an American accent that sounds very cultivated, although I couldn't tell whether it was fake or simply voice training. I do like this movie, though, in fact I like it very much! Natasha was wonderful despite my confusion about her accent, and Mia Farrow was quite good, although it was hard to really see her as plain as she was in this film. It was fun to watch, though, and has you thinking at the end. Joan Plowright was superb, as usual. 9/10.",
         "Overlooking a tiny Irish village is \"Widows' Peak,\" an area inhabited by a tight-knit group of well-off widows. The doyen of the group is the venerable Mrs. Doyle-Counihan (Joan Plowright), who keeps the ladies in her circle on a short leash. An odd member of their society is Miss O'Hare (Mia Farrow), the only unmarried lady to be accepted as an intimate. When a flamboyant, young American woman (Natasha Richardson) moves in, she shakes up the town by quickly stealing the heart of Mrs. Doyle-Counihan's son and for no apparent reason, making a enemy of Miss O'Hare. Billed as a comedy/mystery/thriller, this very odd movie falls short on all counts. While it does paint a charming picture of Irish village life in the 1920s, both the plot and the local dialect are nearly incomprehensible and the ending is too much of a twist. Plowright (widow of Laurence Olivier) is wonderful as the foolish grande dame who thinks she knows everything. Farrow, however, is woefully miscast. Her Irish accent comes and goes and she looks like a spaced-out twenty-something, which hurts the ending. Richardson is simply annoying as the pushy and mysterious American. None of the characters, in fact, are likable in the least and I didn't care about any of them - with the exception of the local dentist, played to comic perfection by Jim Broadbent. This is a confusing, tedious, and disappointing movie that should have been so much better, considering the cast."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "British Screen Productions",
         "Jo Manuel Productions",
         "Rank Organisation, The"
      ],
      "summaries": ["Edwina has just moved into the neighborhood known as \"Widows' Peak,\" so called due to the prevalent marital status of the residents, who tend to be a rather exclusive bunch. The residents are all curious about their new neighbor, but no one can seem to get much information about her, including queen bee Mrs. DC, whose son is busy wooing Edwina. Miss O'Hare and Edwina have an immediate dislike for each other, however, and soon some accidental encounters begin to look like Edwina is trying to ruin her new rival. The problems escalate and the town is in an uproar, but they get no closer to solving the mystery of the newcomer."],
      "budget": 0
   },
   "movielensId": 452,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-05-13",
      "dvdReleaseDate": "2005-04-19",
      "directors": ["John Irvin"],
      "runtime": 101,
      "movieId": 452,
      "title": "Widows' Peak",
      "mpaa": "",
      "actors": [
         "Mia Farrow",
         "Jim Broadbent",
         "Natasha Richardson",
         "Adrian Dunbar",
         "Joan Plowright"
      ],
      "imdbMovieId": "0111712",
      "originalTitle": "Widows' Peak",
      "genres": [
         "Comedy",
         "Thriller",
         "Mystery",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": ["BAsNqcro3EE"],
      "plotSummary": "Scandal and mystery reign following the arrival of Edwina in a small Irish town populated entirely by widows. Edwina quickly falls out with the locals while also falling in with the son of the community's leader",
      "tmdbMovieId": 25440,
      "avgRating": 3.55868,
      "releaseYear": "1994",
      "numRatings": 1227,
      "posterPath": "/xXyVUwvJesJJChzpvn7xj5cAOfm.jpg"
   }
}