{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide by hanging",
            "id": 159588
         },
         {
            "name": "sexual torture",
            "id": 159595
         },
         {
            "name": "exploding truck",
            "id": 159600
         },
         {
            "name": "cuckold",
            "id": 159601
         },
         {
            "name": "garbage dump",
            "id": 159602
         }
      ],
      "imdb_id": "tt0109890",
      "video": false,
      "title": "The Getaway",
      "recommendations": [
         2047,
         867,
         9057,
         11859,
         11384,
         9624,
         11074,
         10447,
         31640,
         178,
         34314,
         10396,
         10861,
         11082,
         10608,
         9569,
         6723,
         9644,
         4954,
         2163
      ],
      "backdrop_path": "/awFkNil5h2nJb7SQxbDThhBuNxj.jpg",
      "revenue": 30,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Carter Doc McCoy",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f804226d",
               "name": "Alec Baldwin",
               "profile_path": "/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg",
               "id": 7447,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Carol McCoy",
               "gender": 1,
               "credit_id": "52fe4334c3a36847f8042271",
               "name": "Kim Basinger",
               "profile_path": "/xpv6NgpY0mDr5QSWjZLXy5KlFn9.jpg",
               "id": 326,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Budy Travis",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042275",
               "name": "Michael Madsen",
               "profile_path": "/azCognW0p1hl2bJFH31ZNtcTJ3R.jpg",
               "id": 147,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Jack Benyon",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042279",
               "name": "James Woods",
               "profile_path": "/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg",
               "id": 4512,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Jim Deer Jackson",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f804227d",
               "name": "David Morse",
               "profile_path": "/5PuSGfBw3Hsdo5jkhZ59NDFCZUm.jpg",
               "id": 52,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Fran Carvey",
               "gender": 1,
               "credit_id": "52fe4334c3a36847f8042281",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Harold Carvey",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042285",
               "name": "James Stephens",
               "profile_path": "/sF63niH94tbYASqzdDfFoM70ZaM.jpg",
               "id": 21376,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Frank Hansen",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042295",
               "name": "Philip Seymour Hoffman",
               "profile_path": "/8DjE4XIngdn0dK3RnIKTHB8U8jZ.jpg",
               "id": 1233,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042299",
               "name": "Richard Farnsworth",
               "profile_path": "/dS8N3GEDzrr0rrCQo6Q3ZyNdX8b.jpg",
               "id": 5605,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Gollie",
               "gender": 2,
               "credit_id": "55adcca7c3a368726500382c",
               "name": "Burton Gilliam",
               "profile_path": "/vy97LXXW4hRjwJa4h9IbTBwuGN5.jpg",
               "id": 133952,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Driver",
               "gender": 0,
               "credit_id": "55adccb29251411e180098f6",
               "name": "Elske McCain",
               "profile_path": null,
               "id": 98991,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f804222d",
               "name": "Roger Donaldson",
               "profile_path": "/AeqGthH9k1e7FJ8XJHycFNPQVvT.jpg",
               "id": 21370,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042233",
               "name": "Jim Thompson",
               "profile_path": "/qPx9lEJkSrnP6n0Zvk8FWkqLMS5.jpg",
               "id": 3335,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042239",
               "name": "Walter Hill",
               "profile_path": "/gCU3dgnNaZuvmArtBJgjCUMmimd.jpg",
               "id": 1723,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4334c3a36847f804223f",
               "name": "Amy Holden Jones",
               "profile_path": "/qnevPdc8w1ryklGNn4b4bGelOjL.jpg",
               "id": 21371,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042245",
               "name": "John Alan Simon",
               "profile_path": null,
               "id": 21373,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f804224b",
               "name": "Lawrence Turman",
               "profile_path": null,
               "id": 10770,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042251",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042257",
               "name": "Peter Menzies Jr.",
               "profile_path": null,
               "id": 17629,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f804225d",
               "name": "Conrad Buff IV",
               "profile_path": null,
               "id": 3987,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4334c3a36847f8042263",
               "name": "Allison Cowitt",
               "profile_path": null,
               "id": 21374,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042269",
               "name": "Mike Fenton",
               "profile_path": null,
               "id": 598,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f804228b",
               "name": "David Foster",
               "profile_path": "/5XcWMR9BEEqWgIhBopMvnHJWbsk.jpg",
               "id": 11813,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f8042291",
               "name": "Joseph C. Nemec III",
               "profile_path": null,
               "id": 9990,
               "department": "Art",
               "job": "Set Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.225448,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 2087,
      "vote_count": 106,
      "budget": 0,
      "overview": "Doc McCoy is put in prison because his partners chickened out and flew off without him after exchanging a prisoner with a lot of money. Doc knows Jack Benyon, a rich \"business\"-man, is up to something big, so he tells his wife (Carol McCoy) to tell him that he's for sale if Benyon can get him out of prison. Benyon pulls some strings and Doc McCoy is released again. Unfortunately he has to cooperate with the same person that got him to prison.",
      "similar": [],
      "original_title": "The Getaway",
      "runtime": 115,
      "poster_path": "/aqASLZpqGK62bmUI1KLvvEIpKNk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Largo Entertainment",
            "id": 1644,
            "origin_country": ""
         }
      ],
      "release_date": "1994-02-11",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roger Donaldson"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Jim Thompson",
         "Walter Hill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109890/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0NDE2NzgzOV5BMl5BanBnXkFtZTcwMDg0NjEyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Alec Baldwin, Kim Basinger, Michael Madsen | See full cast and crew »"],
      "reviews": [
         "This was a very entertaining, if morally way below par, action movie which consistently keeps your attention with intense scenes. Kim Bassinger probably looked as good as she ever looked which is saying a lot. She has one of the steamiest scenes I've ever seen on a mainline film (my tape was the \"unrated\" version) but at least it was with her real-life husband (at the time) Alec Baldwin. This re-make of the 1972 film also has Michael Madsen, James Woods, Mike Morse and Jennifer Tilley - all playing sleazy characters. They are so bad they make Baldwin & Bassinger look like monks. This movie is not exactly Mary Poppins. There's almost too much of a mean edge to it....almost. Perhaps I enjoy ogling Bassinger too much to can this movie for its baseness. Whatever, this entertains to the degree that it makes it a very quick two hours. There is no way you could get bored watching this film.",
         "The action scenes are top notch. Maybe I'm just a sucker for colorful characters and the bank heist angle is well done. Best of all is Alec Baldwin's character, Doc. Baldwin and the rest of the cast really deliver their lines with panache. Bank jobs, car chase, cat-and-mouse in a four story hotel, steamy sex, crazy characters.... what else do you want?",
         "I tend to like the original more yet the 1994 remake THE GETAWAY, was a very good film. The strength of this version is the modren pacing and action also the revamped dialouge and several additional characters. I bumped into david morse once...of note is his role in this film. THE GETAWAY works because the chemistry of sex and violence between the characters played by BALDWIN and BASINGER works. It's not cheesy or contrived. This film is a tale of moral love betrayal and the classic analogy of there being no honor among thieves. The remake follows pretty much the same plot as the STEVE MCQUEEN classic yet takes a few different turns. Fans of the original will like this version as well, one nice aspect is that it maintains a similar look to the original. During the early 1970's several films like this and GONE IN 60 SECONDS had the same visual flair. This film matches the tone of the original and succeeds as a modren film for contemporary audiences.",
         "I recently had the opportunity to watch this movie and the 1972 version back to back (the modern version first). I was amazed at how exactly some of the minute details in the original movie were repeated in the remake. The garbage bin, the locker gimmick, the character of the innkeeper and paint truck owner. It was interesting at how many of the touches were not unnecessarily \"modernized\". (I like that). I was able to enjoy both versions. Some people made comments disdaining the remake, but I thought it was a worthy movie, if just because it was a more sexy polished version. --I admit I'm biased, because I thought Kim Basinger was one of the hottest women I've seen in movies (I can't believe she was over 40 when she made the film). Her action/shooting scenes near the end were also very well done. The chemistry between her and Alex Baldwin was also superb, I guess due in some part to the fact that they were (or were going to be) a husband-wife couple in real life too. I also liked the movie to enjoy the differences between the actors (and interpretation) within the almost exact same construct. Steve McQueen's more hardboiled tightly wound character to Alec Baldwin's character who seemed to have a more innate gentleness (sort of like being a victim of circumstance). But of course both being pleasingly hard resourceful men. The old paint truck drivers at the end were also great character actors. Nice ending. Another interesting aspect of the film was how fit Alex Baldwin and David Morse looked. 11 years has passed since the film was made, but they both (esp. Morse) look a lot younger. The beauty of youth! James Wood and Mike Madsen in distinctive \"enemy\" roles also did what they both do best.",
         "I usually hate it, when they go back and look for movies to redo just to earn some cheap cash. In this case I feel differently though. It begins with the cast. A lot of (then) hot actors like Alec Baldwin, Kim Basinger, Michael Madsen, James Woods... Need I go on? Also they kept most of the basic plot and elevated it to a new level. The new version is bolder and should appeal to a new audience. It's a classic tale of deception, love, and betrayal. First our Hero, Doc (Baldwin) get's thrown in Jail. After a year his wife (his back then actual wife Kim Basinger) makes a deal with the crook turned respected businessman Jack Benyon. He's to rob a racetrack. For this Benyon already assembled a team. That includes the guy that was kind of responsible for Doc getting sent to jail for a year. The heist goes off almost without a hitch but from that moment on everything goes south. first Rudy (Madsen) kills the 4th guy involved in the thing and then tries to off Doc and his wife. Doc's of course faster with the gun and hurts Rudy badly. He survives though, because he wore a bulletproof vest, which he usually doesn't. Then doc and his wife head up to Benyons place to split up the money. Benyon (Woods) of course has other plans. Plans that involve Docs Wife (a really hot looking Basinger). But she opts to go with her husband and kills Benyon. So no they not only have Benyons Guys on their tail but also the very pi**ed off Rudy. If I were to continue telling you the plot there would be no need for you to watch the movie. Just let me tell you that it's a great remake that tops the original in several aspects. The acting is top notch by almost all the major characters. The action is fast paced and very violent. (I base this on the unrated HD-DVD). So if you have a few bucks lying around. Get this movie, I am pretty sure you can get it for under $10 in about every big store..",
         "With this movie it's obvious that not all the remakes are a mess. The Getaway's 1994 version is much better than the Steve McQueen-original witch is not a bad movie at all. But the Getaway 94 is a blood-pumping intelligent hot action film with deep human characters, amazing sex scenes (rare in American movies), real action and a very good plot. Roger Donaldson's directing is the highest grade of action film making. The script is perfect the stars are phenomenal (Alec and Kim in their best form), even the supporting actors are very good: James Woods, Michael Madsen, Jennifer Tilly and Richard Farnsworth. Alec and Kim are the Bonnie & Clyde of the nineties portraying very human criminals, their conflicts are so real in the story... after all it's one of the best films in the genre of the 90s! A must see for every action-thriller fan!",
         "Alec Baldwin and Kim Basinger were a married couple when they portrayed the married McCoys in this 1994 remake of the 1972. Their on-screen chemistry is incredible. Any time you get this kind of casting occurrence in a film, it is at least worth checking out. Here it really works. The thing that distinguishes this Jim Thompson story is the catch-22 Carol McCoy is faced with- and the percussive effect her necessary action has on the McCoy couple- while the tension is ratcheted up to 11- in their non-stop hour-and-a-half getaway throughout the Southwest. It is a juicy role for a married couple, and Baldwin & Basinger make the most of it. They both are in prime form here and very compelling to watch together. Besides the McCoys (and Richard Farnsworth), it is a B film. Michael Madson's hair is a real challenge to deal with. At least you can cut out of the Richard Marx end credit song. You have to live with Michael Madson's hair for the whole ride. IMDb rating should be around 7.",
         "The Getaway is a remake of the action classic that stared Steve McQueen and Ali MacGraw. Now I haven't seen the original so I can't compare the two but by it self this is an OK action thriller. It goes old school with its desert/western setting, bad criminals and finale stand off. When I watched this movie I had no idea what kind of movie it is. The story is simple Doc McCoy (Alec Baldwin), his wife (Kim Basinger) and his partner (Michael Madsen) are hired to get a man out of prison. When the job goes sour, McCoy is locked up for a year in a Mexican prison. With the help of his wife and a Phoenix crime boss Jack Benyon (James Woods), he released and hired to do one more job. This job goes semi good but after it has been done many people end up dead and the McCoys are on the run from many different people all with their eyes on the large amount of cash they have. The performances are OK. Basinger is tough yet still has that soft side and she very good with guns. Madsen is a good mix with Baldwin and Basinger, he add the funny but villainous third part of the gang. The cast is bigger than normal for an action film but since this was made in the early \u009190's some of the actors hadn't hit it big yet. Jennifer Tilly, Phillip Seymore Hoffman and David Morse round out the cast. They all have small parts but they do the best with what they have. The action is not really original and there are a few Woo slow-motion shots thrown in for good measure. There's only one explosion but a lot of guns. The protagonists aren't very likeable, though. In fact, no one in this film is, with the possible exception of Richard Farnsworth's character at the end. Jennifer Tilly threw herself into her role, and both Michael Madsen and James Woods, do their usual creepily evil personas with aplomb. THE GETAWAY works because the chemistry of sex and violence between the characters played by BALDWIN and BASINGER works. It's not cheesy or contrived. This film is a tale of moral love betrayal and the classic analogy of there being no honor among thieves. The remake follows pretty much the same plot as the STEVE MCQUEEN classic yet takes a few different turns. Fans of the original will like this version as well, one nice aspect is that it maintains a similar look to the original. This film matches the tone of the original and succeeds as a modren film for contemporary audiences. A major problem with The Getaway is the way the McCoys are seemingly able to sense danger when there is not even the slightest indication of it. Carter, for example, has the incredible ability enabling him to know a gunman is just outside his door as soon as he finishes another bedroom scene with his wife! This serves as an example of how unimaginative things get. the infamous sex scenes are really undeserving of the attention. They are gratuitous in the extreme as they don't serve the story whatsoever. You can't believe the characters like each other that much, having spent most of their time in bitter argument. Believe me, you won't like these characters either.",
         "It's a pretty decent movie as these things go. Baldwin is Doc McCoy, newly released from prison in order to commit a high-end robbery. Faced with cheating partners, he and his wife, Basinger, make off with a gym bag full of large notes and are pursued throughout the Southwest to the Mexican border, where they finally take off on their own. There is some conflict internal to the family because Basinger had to allow the head of the parole board, also the manager of the robbery, access to her succulent body, and Baldwin resents this, sometimes violently, for the first two thirds of the movie. Lots of action, more explicit sex and brutality, and competent performances, yet something is missing. The chief subtrahend is originality. It's a remake of Sam Pekinpah's film of the same name, with Steve McQueen and Ali McGraw, from the 1960s. Pekinpah's production was edgier, with unexpected incidents, and used some magnificent locations in west Texas. And the production design and set dressing were superior. Even so quotidian a setting as a garbage dump outside of El Paso reeks with atmosphere in Pekinpah's film. Here, it's just a garbage dump. The same can be said of the interior -- and the exterior, for that matter -- of the seedy hotel in which the final shoot out takes place. But it isn't so much these details that detract from one's enjoyment of the film, it's the realization that it was done -- and done better -- almost thirty years earlier by a director in whose veins the balance between booze and talent was proportionate. How much in the way of credit should accrue to writers, directors, and producers who simply imitate a successful earlier movie in an attempt to cash in on its popularity and on the loosening of moral strictures in Hollywood? The remake is not quite shot-for-shot but almost, and much of the dialog is identical. Generally speaking, the performances here aren't bad, even though Baldwin is groomed on his release from the slams like a Hollywood star and lacks McQueen's jailhouse haircut. Kim Basinger does a bit better in the role of prisoner's wife than Ali McGraw did, for that matter. McGraw, unfortunately for her, cute as she was in her darkly furry way, always sounded as if she'd just graduated from Wellesley, which at one time she had. And the direction is competent without adding much to the goings on. Slow motion is used where Pekinpah had used it. And, if you want an instructive scene, watch the trio of bad guy Michael Madsen, Jennifer Tilly, and the DVM James Stevens when Madsen and Tilly become playful and start throwing take-out food at one another -- fried chicken and french fries. Madsen, without provocation, becomes angry and orders Tilly back into the front seat. In Pekinpah's movie the take out is barbecued ribs with sticky tomato sauce and they're tossed back and forth with abandon. The bad guy remains in the back seat and, pelted about the face with a couple of hefty ribs, grows visibly more irritated until he ends the game in an outburst of pique. Both the players and the car's interior are coated with Texas barbecue sauce. There's hardly any comparison in the effectiveness of the two, almost identical, incidents. Pekinpah's is superior. None of this should stand as a condemnation of the remake itself. If it stands alone, it's suspenseful and diverting. The world is largely divided into good guys and bad. That usually makes for easily digested entertainment and this movie delivers the goods.",
         "Let me start by saying that I have not seen the original, 1972 version of \"The Getaway\". As a result, this critique for the 1994 version will concentrate solely on the impressions it left me after having viewed it, without any references and comparisons with the original one. \"The Getaway\" is a typical action film, in which the two main heroes, Doc McCoy (Baldwin), and his sexy wife, Carol (Basinger), are being double-crossed by their gang mates; although it involves several smaller sub-plots, the movie is mainly showing us the couple being on the run, as they are trying to flee from successive unpleasant situations. The idea of the storyline does not sound very novel, and indeed it is not. And yet, although the movie has a \"have-seen-it-several-times-before\" taste, it does work and it is quite enjoyable. Donaldson's direction keeps the story rolling fast, and yet successfully avoiding to overdo the action scenes. As far as the acting is concerned, the duo does a fair job, with Bassinger proving us that she has also some substance apart from her splendid looks; I liked also Madsen in his role as the archetypal bad guy, while Woods has a small but well-acted appearance as the rich mobster. To sum this up, \"The Getaway\" may not be a masterpiece, yet it offers two entertaining hours. 6/10."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Largo Entertainment",
         "JVC Entertainment Networks"
      ],
      "summaries": ["Doc McCoy is put in prison because his partners chickened out and flew off without him after exchanging a prisoner with a lot of money. Doc knows Jack Benyon, a rich \"business\"-man, is up to something big, so he tells his wife (Carol McCoy) to tell him that he's for sale if Benyon can get him out of prison. Benyon pulls some strings and Doc McCoy is released again. Unfortunately he has to cooperate with the same person that got him to prison."],
      "budget": 0
   },
   "movielensId": 459,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-02-11",
      "dvdReleaseDate": "1998-05-27",
      "directors": ["Roger Donaldson"],
      "runtime": 115,
      "movieId": 459,
      "title": "The Getaway",
      "mpaa": "R",
      "actors": [
         "Alec Baldwin",
         "Kim Basinger",
         "Michael Madsen",
         "James Woods",
         "David Morse",
         "Jennifer Tilly",
         "James Stephens",
         "Philip Seymour Hoffman",
         "Richard Farnsworth",
         "Burton Gilliam",
         "Elske McCain"
      ],
      "imdbMovieId": "0109890",
      "originalTitle": "The Getaway",
      "genres": [
         "Drama",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["3y3AdZBvURw"],
      "plotSummary": "Doc McCoy is put in prison because his partners chickened out and flew off without him after exchanging a prisoner with a lot of money. Doc knows Jack Benyon, a rich \"business\"-man, is up to something big, so he tells his wife (Carol McCoy) to tell him that he's for sale if Benyon can get him out of prison. Benyon pulls some strings and Doc McCoy is released again. Unfortunately he has to cooperate with the same person that got him to prison.",
      "tmdbMovieId": 2087,
      "avgRating": 2.77885,
      "releaseYear": "1994",
      "numRatings": 1196,
      "posterPath": "/aqASLZpqGK62bmUI1KLvvEIpKNk.jpg"
   }
}