{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109891",
      "video": false,
      "title": "Getting Even with Dad",
      "recommendations": [
         21352,
         35645,
         41582,
         17745,
         9458,
         8986,
         18862,
         10879,
         14557,
         12574,
         18856,
         9308,
         31633,
         17770,
         38225,
         19371,
         34314,
         34170,
         17949,
         47881
      ],
      "backdrop_path": "/zubtwxr6iC1348n1hcNzx8IebMO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Timmy Gleason",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcad7",
               "name": "Macaulay Culkin",
               "profile_path": "/eMApQSnjNI9wSzGv1MYbj0D011j.jpg",
               "id": 11510,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Raymond 'Ray' Gleason",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcadb",
               "name": "Ted Danson",
               "profile_path": "/wWm9eDLuPDw29R76KAjg6gIE9dS.jpg",
               "id": 12836,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Detective Theresa Walsh",
               "gender": 1,
               "credit_id": "52fe45d3c3a36847f80dcadf",
               "name": "Glenne Headly",
               "profile_path": "/a90ZslKOvecuy7doMWXsFc1Aoc4.jpg",
               "id": 21104,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Robert 'Bobby' Drace",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcae3",
               "name": "Saul Rubinek",
               "profile_path": "/1gsXmCmJIegqK0U8dwLz005UM0.jpg",
               "id": 3712,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Boy In Bathroom",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcae7",
               "name": "Seth Smith",
               "profile_path": "/uHGa5v9V597j1UIDWAz29771U8P.jpg",
               "id": 134712,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Boy On Subway",
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcaeb",
               "name": "Sam Horrigan",
               "profile_path": "/5zTszoq60qMkRmbNCqCM3X1wqEi.jpg",
               "id": 77796,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcaf1",
               "name": "Howard Deutch",
               "profile_path": "/68Vae1HkU1NxQZ6KEmuxIpno7c9.jpg",
               "id": 26502,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcaf7",
               "name": "Tom S. Parker",
               "profile_path": null,
               "id": 13582,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d3c3a36847f80dcafd",
               "name": "Jim Jennewein",
               "profile_path": null,
               "id": 13583,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 3.790311,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41579,
      "vote_count": 57,
      "budget": 30000000,
      "overview": "Ray, an ex-con and widower, is planning a coin heist with two accomplices to help him to buy his own bakery. However, he doesn't expect his son Timmy, who was living with Ray's sister, to show up at the house right in the middle of planning. Timmy is ignored and Ray and his buddies pull off the heist. Timmy gets his father's attention by stealing the coins and hiding them. To get them back, his father must take him to a number of different places and treat him like he enjoys his presence. They grow fond of each other but Timmy won't stay with his dad unless he gives up the coins.",
      "similar": [],
      "original_title": "Getting Even with Dad",
      "runtime": 109,
      "poster_path": "/n8n8wp812DKzLOi9Eow5Ajomm67.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1994-06-17",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "..He's not getting mad, he's Getting Even With Dad.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Howard Deutch"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Tom S. Parker",
         "Jim Jennewein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109891/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyNzYyOTMxOV5BMl5BanBnXkFtZTcwODA1ODQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Macaulay Culkin, Ted Danson, Glenne Headly | See full cast and crew »"],
      "reviews": [
         "I loved this movie,I thought ted danson was excellent playing that self centered father,and culkin once again does a great job with playing a smarty.I also loved the fact that it was filmed on location in san francisco at places such as embarcadero bart station,chinatown,the aquarium,and golden gate park.",
         "Ray Gleason, and his pals Bobby and Carl, are planning the heist of the century. Apparently some old bird kicked the bucket and the cops find a truck load of rare coins in a trunk in her attic, so the state confiscates them. These coins are worth millions. Maybe even billions, and Ray, Bobby and Carl want it! So they got the robbery all planned out. What's the worst that could happen? [MIGHT CONTAIN A SPOILER OR TWO] Ray's sister Kitty, who just got married to a dolt, drops off Ray's son, Tim. (Macaulay Culkin in his last movie, before flushing his life and his career down the toilet). Tim wants to spend time with Dad, but Dad's busy. Next day, they pull the heist and feel they have the money in the palms of their greedy hands. But the person who cashes the coins for dollars can't do it until next week, so Tim hides the coins and says if Dad spends time with him and takes him places, he'll tell him where the coins are. So Ray and Tim go to the museum, the amusement park, the water slide, baseball game, and a miniature golf corse. Bobby and Carl tag along. Bobby and Carl find a treasure map that might lead them to the coins. Bobby demands to be the leader and keeps leading them in the wrong directions because he thinks he's smarter than the kid. But he sure isn't. Ray and Tim play a game of basketball and Ray teaches Tim how to pick up girls. A police woman detective, Theresa, was watching and saved Tim from being hit by a car. Ray and Theresa get to like one another. And after the whole adventure is over, Tim is going to move in with Ray, and since he's lost millions of dollars and gained a permanent houseguest, he should go drown himself. In his own words. This is a good movie. I watch it alot. It was a good idea and all the characters each learn what happens when you try to outsmart an 11-year-old kid.",
         "The movie starts in pretty interesting fashion when Macauley Culkin is deposited on the doorstep of his father, Ted Danson, just as he and his mates are preparing for a heist. However, the movie soon degenerates into \"Home Alone\" style antics as the young son brilliantly outsmarts his father time and time again. This all seems very familiar. Eventually the movie ends after nearly 2 1/2 hours of capers and disbelief. I wish they had of keeped the son out of it- police trying to 'get even' with the crooks sounds like a much better movie.",
         "I like Macaulay Culkin and his films like the first two Home Alones, Uncle Buck, My Girl and The Pagemaster, and after seeing some tepid reviews and a very low IMDb rating I was expecting not to like Getting Even with Dad. But I actually did. It isn't perfect, it is overlong with an obvious and predictable story and the pace slackens at times, but this is a much better film than I was led to believe. It does look very nice, with good photography and scenery, and the soundtrack was mellow and engaging enough too. Getting Even with Dad does have some funny parts at the expense of Danson's inept sidekicks, and some poignant moments without being too mawkish. Howard Deutch is a talented director, and he proves it I think here, and I really enjoyed the performances of Macaulay Culkin and Ted Danson both of whom carry the movie with ease. All in all, far from perfect but there are much worse out there. 7/10 Bethany Cox",
         "I've always thought Macaulay Culkin's performance in `Getting Even With Dad' is his best one together with `Home Alone'. It's a shame he's been out of scene in the last years, what forces us to go for his old films. Culkin's partner in the movie is Ted Danson, who again shows he can do his part in comedies, like he did in `Three Men and a Baby'. Danson's a thief who now has to deal with an unexpected problem: his ex-wife leaves their son (Culkin) with him once he hasn't looked after him for years. The boy wants some attention from his dad, so he hides the coins his father has stolen before he could use it. If the thief wants his coins back, he must give the boy some good time. My Rate 7/10",
         "An estranged son(Macaulay Culkin) tries to blackmail his ex-con father(Ted Danson) into spending time with him. Danson and two cronies pull of a rare coin heist and then Culkin arrives wanting to share father and son time. The coins are used to blackmail the ponytailed Danson into pleasing the obnoxious Culkin. HOME ALONE(1990) and MY GIRL(1991)were at least worth watching. This is neither funny or interesting. Danson fares well in his arrogant way. Gleene Headly is not believable as a detective. Also in the cast are:Gailard Sartain, Saul Rubinek and Hector Elizondo. Geared for the grammar school set.",
         "This film was brilliant it had me laughing the whole way through from beginning to end it was hilarious! Macaulay Culkin was fantastic as Timmy I really liked his character! Ted Danson played a great character too there both really brilliant actors! I gave this film a 10/10 because of how funny and entertaining it was it had me laughing for aged even after the film had ended I was still laughing at certain bits. This film is a great family comedy I totally recommend it to anyone who loves comedy films. I'm not sure what else to say so if you have not seen this film yet it's definitely a film you have to see it will have you in stitches.",
         "When he was young, Macaulay Culkin consistently played incredibly street-smart kids with a knack for setting traps, catching bad guys, and outsmarting adults in a cute and memorable way. One wonders how his characters like Kevin McAlister or, in this case, Timmy Gleason fared in school, with classes like calculus, physics, and trigonometry requiring more book-smart level thinking. It's one thing to build an amateur trap; it's another being able to explain why the trap works and how it is triggered. Getting Even With Dad marked Macaulay Culkin's last project for six years before appearing in a film adaptation of the stage play Madame Melville. His downfall could be attributed to many things, but Culkin was fourteen during the time of this film, already growing out of his cute-kid appearance and becoming more of an adult, as well as Getting Even With Dad's extremely poor box office performance after the kid was proved to be a solid cash-grab with two Home Alone projects. Even with this film, Culkin shows a certain tiredness to doing the same old schtick with little reward. The film revolves around his character Timmy, whose mother died some years ago and who has been living with his aunt and her fiancée since the event. Planning to marry and get Timmy out of her hair, the aunt decides to drop Timmy off at his biological father's house, where both can meet each other and Timmy can have a place to stay. Timmy's dad turns out to be a petty-con by the name of Ray Gleason (Ted Danson), who is plotting with two amateur cronies Bobby and Carl (Saul Rubinek and Gailard Sartain) to steal a collection of rare coins. It is only obligatory that Timmy is smarter than all three of these cons put together, so when the gang actually do find the coins, he'll hide them in order to squeeze more quality time out of his father than he's willing to give (and also maybe have his hand at nudging a little romance in his direction on the side). Getting Even With Dad is the classic case of a film biting off more than it can chew. The film tries to mesh themes of crime, romance, father-and-son bonding, slapstick comedy, and sentimentalist drama all into and it barely succeeds as a film detailing father-and-son bonding. It makes not knowing your father and then coming across him when you discover he's a petty crime out to be another instance to practically laugh off rather than one to be deeply upset about. Writers Tom S. Parker and Jim Jennewein (who also wrote the other Macaulay Culkin showcase of the same year Ri¢hie Ri¢h as well Major League II) had a golden opportunity to explore the sadness and the neglect of a father not being there for his son during crucial developmental years and then not even making a good too-little-too-late effort that, I believe, kids would've responded to much more than the mashup of cheesy themes we got with the end product of Getting Even With Dad. The film was directed by Howard Deutch, who was responsible for directing both of John Hughes' screenplays Pretty in Pink and Some Kind of Wonderful as well as other products such as the charming Great Outdoors and The Odd Couple II. Deutch's directing style has never been one to praise for its uniqueness, but even in projects such as The Odd Couple II, he always seemed to manage to squeeze something out of his performers and his crew. Here, however, there's little he can do to liven a slumping screenplay with too many different themes to tackle adequately. Starring: Macaulay Culkin, Ted Danson, and Glenne Headly. Directed by: Howard Deutch.",
         "The title was very familiar to me, and it sounded like the kind of film that the young star of Macaulay Culkin would be in, so I was interested to see whether the concept would be, from director Howard Deutch (The Whole Ten Years). Basically Raymond 'Ray' Gleason (Three Men and a Baby's Ted Danson) is planning a coin heist with his two accomplices Robert 'Bobby' Drace (Saul Rubinek) and Carl (Gailard Sartain) so he can buy a bakery, but he has a surprise visitor. His son Timmy (Razzie nominated Macaulay Culkin) has been living with Ray's sister, including while he was in prison, and he wants to a get to know his father better, but obviously this is inconvenient. The thieves manage to pull off the heist and get the valuable coins, and Timmy finds out about it, and he uses it to his advantage by taking and hiding the coins in order to con his father. Ray has to spend time with his son in order to get the coins back, this includes trips to a swimming park, a mini golf course and meals out, and for a while this is getting on his nerves, but actually over time the father is getting closer to and finding admiration for his son. Meanwhile the police are also trying to find the coins and catch the gang out, with Detective Theresa Walsh (Glenne Headly) going undercover to get close to the main man, and unintentionally falling for him. Eventually Timmy finds that he cannot change his father's ways, and he offers him the choice of the coins back, or staying with his son, and thankfully he chooses his son, but the locker the coins are in are opened and he ends up arrested. In the end though the bag is full of loose change, the real coins are returned to the authorities, and Timmy and Ray go on to have a close father-son relationship. Also starring Hector Elizondo as Lt. Romayko, Sam McMurray as Alex, Sydney Walker as Mr. Wankmueller and Kathleen Wilhoite as Kitty. Culkin does his usual mischievous and more clever than the adults character, as well as being a little spoilt, and he has a silly hairdo, Danson also has a slightly daft pony tail, he gives a good annoyed performance, I will agree that the father's thieving partners are the ones that get a little more punishment, I hoped for more slapstick stuff, it was an easy to swallow but hardly worth the effort family comedy. Okay!",
         "Ray, an ex-con and widower, is planning a coin heist with two accomplices to help him to buy his own bakery. However, he doesn't expect his son Timmy, who was living with Ray's sister, to show up at the house right in the middle of planning. Timmy is ignored and Ray and his buddies pull off the heist. Timmy gets his father's attention by stealing the coins and hiding them. To get them back, his father must take him to a number of different places and treat him like he enjoys his presence. They grow fond of each other but Timmy won't stay with his dad unless he gives up the coins.... Culkin was getting older, so the cute thing he did in his earlier stuff was now becoming annoying, hence the reason why this bombed big time. And the fact that the film was overlong and just not very funny.. But thats not to say that it isn't watchable. Danson is great as Ray, even though you'd expect him to be in a Stallone comedy with that accent. And he does have great chemistry with the cast and especially Culkin toward the end. But it's all predictable stuff, as there are hi-jinks and pratfalls from the two bumbling sidekicks who are just interested in the coins, and these become tiresome straight away. It's one of those movies you can have on in the background and not really watch, but you can still follow the story pretty easy. Too long for kids, way too long for adults."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Family"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Ray, an ex-con and widower, is planning a coin heist with two accomplices to help him to buy his own bakery. However, he doesn't expect his son Timmy, who was living with Ray's sister, to show up at the house right in the middle of planning. Timmy is ignored and Ray and his buddies pull off the heist. Timmy gets his father's attention by stealing the coins and hiding them. To get them back, his father must take him to a number of different places and treat him like he enjoys his presence. They grow fond of each other but Timmy won't stay with his dad unless he gives up the coins."],
      "budget": 30000000
   },
   "movielensId": 460,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-06-17",
      "dvdReleaseDate": "2001-03-06",
      "directors": ["Howard Deutch"],
      "runtime": 109,
      "movieId": 460,
      "title": "Getting Even with Dad",
      "mpaa": "PG",
      "actors": [
         "Macaulay Culkin",
         "Ted Danson",
         "Glenne Headly",
         "Saul Rubinek",
         "Seth Smith",
         "Sam Horrigan"
      ],
      "imdbMovieId": "0109891",
      "originalTitle": "Getting Even with Dad",
      "genres": [
         "Family",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["gvlEQ7vLMro"],
      "plotSummary": "Ray, an ex-con and widower, is planning a coin heist with two accomplices to help him to buy his own bakery. However, he doesn't expect his son Timmy, who was living with Ray's sister, to show up at the house right in the middle of planning. Timmy is ignored and Ray and his buddies pull off the heist. Timmy gets his father's attention by stealing the coins and hiding them. To get them back, his father must take him to a number of different places and treat him like he enjoys his presence. They grow fond of each other but Timmy won't stay with his dad unless he gives up the coins.",
      "tmdbMovieId": 41579,
      "avgRating": 2.43501,
      "releaseYear": "1994",
      "numRatings": 954,
      "posterPath": "/n8n8wp812DKzLOi9Eow5Ajomm67.jpg"
   }
}