{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0107057",
      "video": false,
      "title": "Guilty as Sin",
      "recommendations": [
         20858,
         31633,
         83714,
         41590,
         19345,
         4639,
         12623,
         15771,
         10551,
         114442,
         294261,
         11060,
         10120,
         31924,
         29185,
         10333,
         26789,
         75889,
         37753,
         31597
      ],
      "backdrop_path": "/u9al7LnW8PN5qSPbRMjoWnvou0A.jpg",
      "revenue": 22886222,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jennifer Haines",
               "gender": 1,
               "credit_id": "52fe43e2c3a36847f80761c1",
               "name": "Rebecca De Mornay",
               "profile_path": "/riQQkeijtaPIAVhPdCcJFPB4FOA.jpg",
               "id": 28412,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "David Edgar Greenhill",
               "gender": 0,
               "credit_id": "52fe43e2c3a36847f80761c5",
               "name": "Don Johnson",
               "profile_path": "/yQHW10SE2HyuaZmHvUrSxKhqqWg.jpg",
               "id": 25129,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Judge Tompkins",
               "gender": 1,
               "credit_id": "52fe43e2c3a36847f80761c9",
               "name": "Dana Ivey",
               "profile_path": "/12mxrB5iT1TAwCzIZvmcFGLBQ52.jpg",
               "id": 13314,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Phil Garson",
               "gender": 2,
               "credit_id": "52fe43e2c3a36847f80761cd",
               "name": "Stephen Lang",
               "profile_path": "/tqF6ibURpLvRPlgvLRvjCQqWaa2.jpg",
               "id": 32747,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Moe",
               "gender": 2,
               "credit_id": "52fe43e2c3a36847f80761d1",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Prosecutor DiAngelo",
               "gender": 2,
               "credit_id": "553425289251416f88001076",
               "name": "Ron White",
               "profile_path": "/wwct4MqN4iEMJQk27qeMj4qMoUR.jpg",
               "id": 1242148,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Emily, Jennifer's Assistant",
               "gender": 1,
               "credit_id": "55342538c3a36852de0022f3",
               "name": "Norma Dell'Agnese",
               "profile_path": null,
               "id": 271933,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Nolan, Greenhill's Doorman",
               "gender": 2,
               "credit_id": "55342546c3a3682226006266",
               "name": "Sean McCann",
               "profile_path": "/sp4Ci5WLATw889RNLS1RJZuN3es.jpg",
               "id": 17646,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Lt. Martinez",
               "gender": 2,
               "credit_id": "553425529251415291005f45",
               "name": "Luis Guzmán",
               "profile_path": "/e6mIeGBDkNFZwFDoskcetgkU5oH.jpg",
               "id": 40481,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e2c3a36847f80761b1",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e2c3a36847f80761b7",
               "name": "Larry Cohen",
               "profile_path": "/jB85d7bfXoIWW2nKxMe7fQJQ7rC.jpg",
               "id": 19266,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e2c3a36847f80761bd",
               "name": "Andrzej Bartkowiak",
               "profile_path": "/K2pgHC907AUCim8WOkHOJpqERC.jpg",
               "id": 10765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55342574925141529b005d3a",
               "name": "Howard Shore",
               "profile_path": "/4HbFF5o13GkO0rHi4OVXXMb7U5L.jpg",
               "id": 117,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "55342584c3a3682226006270",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5534258f925141529b005d3f",
               "name": "Evan A. Lottman",
               "profile_path": null,
               "id": 57925,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.377087,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 4916,
      "vote_count": 31,
      "budget": 0,
      "overview": "Before a criminal lawyer knows what has happened, she is forced to defend a wife killer she knows is guilty.",
      "similar": [],
      "original_title": "Guilty as Sin",
      "runtime": 107,
      "poster_path": "/hQwk4PZdDVJI6SYEEqxx4zqco0j.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
         "name": "Hollywood Pictures",
         "id": 915,
         "origin_country": ""
      }],
      "release_date": "1993-06-04",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "She's finally met her match. He's handsome, wealthy, seductive. A Real Lady Killer!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney Lumet"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Larry Cohen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107057/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwMzU4MjY0N15BMl5BanBnXkFtZTcwODk3MTAwMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Rebecca De Mornay, Don Johnson, Stephen Lang | See full cast and crew »"],
      "reviews": [
         "There's a big laugh in the middle of this contrived psychological thriller. I won't give it away, because it's easily the best moment in the film. It's the scene in a bar with Don Johnson, and it sketches in his character more brilliantly than anything before or after. You'll know it when you see it. Well, if you see it. If the script had displayed that kind of wit throughout, this movie would be a must-see. As it is, there is too little that makes it memorable and too much that makes it hard to suspend disbelief. Rebecca De Mornay plays a flashy criminal defense attorney who does her job with spectacular cunning \u0096 even for the most unsavory defendants. But her newest client (Don Johnson) is not just unsavory. He could be dangerous enough to kill her. The first thing you'll notice is Howard Shore's excellent score during the title sequence. It's silky and sinister and immediately draws you in (despite the tacky-looking computer graphic that accompanies it). Next, the film looks really good. Sidney Lumet \u0096 who also gave us \"Twelve Angry Men,\" \"The Verdict\" and many other terrific movies \u0096 knows how to direct a good courtroom thriller. And what a courtroom. The photographer, Andrzej Bartkowiak, makes the most of this spacious green-marble set. An early scene is promising. Don Johnson glides into De Mornay's office and asks her to take his case, brazenly confessing that he's a womanizer and a gigolo \u0096 yet innocent of throwing his wife out of a skyscraper window. She refuses at first, but Johnson's boyish egotism is too hypnotically fascinating. But later, both actors falter. De Mornay makes several bad choices in her performance, playing too many scenes like a frightened rabbit. Johnson has a scene in his apartment, where he makes a sandwich with a long kitchen knife that he winds up waving in De Mornay's face. His character loses control, but so does the actor. Johnson looks and sounds ridiculous. But the main problem is the script from schlock-horror director Larry Cohen. First, there's Jack Warden's character, a father figure to De Mornay, who comes off as purely functional. He's there to do things De Mornay's character cannot, and we don't give a damn about him, not even when he winds up in danger. Second, De Mornay ends up framing her own client, an enormously risky endeavor that could easily destroy her career and even send her to prison. Why? Presumably to protect herself and other women from Johnson. But the movie fails to convince us she has no saner options. Third, there's the woman who becomes a last-minute witness for the defense. I won't give away too much, but her motivation for doing what she does is totally inscrutable. Lastly, there's the gruesome climax. It plays ludicrously, though De Mornay is allowed one last, good moment. Her hysteria at the peak of her ordeal is touchingly real. Otherwise, the whole thing feels forced and phony. So does the movie.",
         "Not sure where the title comes from, but the film wasn't too bad. The plot had more holes than Augusta National, and the logic leaves a little to be desired, but it was watchable, I'm not a Johnson fan, but apart from Gere I can't imagine anyone else who would have fitted the role better, and he did a great job. Films need great characters, and I thought David Greenhill was a believable character. The Jennifer Haines character has to put up with knowing that her client, in her opinion, is evil and guilty, but she is expected to get him off. The film goes off in a totally different direction to what I expected, so this had to be a plus, (for me anyhow). Jack Warden has always been a great character actor, and didn't let me down. Don't expect a great thriller, and you'll probably enjoy it. De Morney looked a bit like Hillary Clinton.",
         "Stalking and talking seems to be what \"Guilty as Sin\" is all about. Don Johnson does the stalking of his lawyer, Rebecca De Mornay, and everyone in the film talks and talks. Unfortunately, the womanizing Johnson, comes across as an almost unreal villain. He assaults Stephen Lang, yet no police are ever involved. He produces a surprise witness, who's motivation for giving him an alibi for his wife's murder borders on ridiculous. The only redeeming factor about Don Johnson is that his character is so despicable, you have to hang around for the ending, simply to see him get what's due. Don't blink however because the end when it finally does come is both swift and a real stretch of reality. Watchable, but not much more. - MERK",
         "SPOILERS Through!! I love thrillers so I was able to watch Guilty as Sin and moderately enjoy it while at the same time understanding that it just wasn't a very good movie. The film lacked a certain something, it's hard to say what that is but I guess it's just not as suspenseful as it should be. Many thrillers or movies that get lumped in as thrillers are preposterous when you really think about them(think \"Double Jepardy, 'The Net\" and \"Final Analysis\" to name just a few). I enjoyed throughly the above mentioned movies and would see any of them again-with Guilty as sin there was just an edge missing. The whole thing was supposed to be a cat and mouse game, a battle of wills between don Johnson and Rebecca De Mornay's character's but it wasn't that fascinating-maybe because neither character was to exciting so how could their relationship really matter to us? The thing that surprised me was De Mornay's character-I loved her in The hand that rocks the cradle, I thought she was chilling!- but here it just doesn't work-and Don Johnson was so evil at the end with that smirk-but the whole thing goes from psychological thriller to slasher movie-not that it was great to begin with but the central theme though the movie-actually themes-as 1 other IMDb reviewer noted were involving-murder and sex-did Johnson do it and would De Mornay have an affair with him-these are nice cheesy thriller themes but the movie just doesn't pull it off-it's at the most only moderately engaging and at the worst slightly dull.",
         "Every few years you see a performance by an actor in something that really impresses you, where you want to watch the whole thing again just to watch him/her, where the person is so fascinating as a character, so extraordinarily in that role, that the performance just BECOMES the experience. That was true in this movie with Don Johnson - on one level alone, he was more believable as a fabulously wealthy man who'd been wildly successful on all levels throughout his life - than anyone I've ever seen. Think of say, the great performances of say, Steve McQueen in Thomas Crown Affair, any actor who's played James Bond, any of the wonderful character actors playing wealthy men in movies like My Man Godfrey, The Philadelphia Story, Holiday, The Awful Truth, Meet John Doe, Fifth Avenue Girl, Bachelor Mother, You Can't Take it With You -- and Don Johnson is yet more believable. Nothing's ever gone wrong for this man - and he relies on it, and he's very very smart, and very very charming, and he knows all of that - and yet somehow he IS charming nonetheless -- And you suspect from the first moment, there is something bad there. I remember thinking when I saw Lisa Eichhorn in 1979 in Yanks, that I had seen someone who really and truly seemed that character - Don Johnson seems this character and it's a great and effortless performance and you should see it. (And if you weren't a fan of his television series, don't worry - neither was I - I never really paid attention to him - and wham, I'm now a fan!). This guy has gotten to be a superb actor.",
         "Johnson plays a womaniser accused of murdering his rich wife. DeMornay is the hot shot lawyer defending him. After a while DeMornay regrets having taken him on, gets convinced of his guilt and is afraid he may have some designs for her. Slow but interesting thriller from Lumet. Film creates a kind of cat and mouse game between the two leads that's well written and fairly suspenseful. Rebecca DeMornay is tolerable in the lead, never quite convincing as the tough no nonsense lawyer. Much more effective when she's all broken down and vulnerable. Don Johnson however excels in his part, playing a slimy bad guy (who's, by the way, totally obsessed with himself) to a tee. Pity Johnson didn't establish himself as a major player in Hollywood. Guilty as Sin is a bit slow but it's got a good story and some genuine suspense. You could do a lot worse.",
         "Rebecca de Mornay and Don Johnson made a great double act for this gripping thriller. As usual Rebecca de Mornay put everything she had into her role as Jennifer Haines and she did a grand job avoiding the stereotypical lawyer role. Don Johnson also performed well in one of his best roles. I enjoyed Johnson in Miami Vice and Nash Bridges and I was pleasantly surprised when he convincingly portrayed a cool and calculated psycho. The story itself is gripping throughout and Johnson really is scary in his role as David Greenhill. One moment he is all sane and has the audience feeling sorry for him;the next moment he is a total psycho. I strongly recommend this underrated little gem.",
         "!!!! POSSIBLE MILD SPOILER !!!!! As I watched the first half of GUILTY AS SIN I couldn`t believe it was made in 1993 because it played like a JAGGED EDGE / Joe Eszterhas clone from the mid 80s . It starts with a murder and it`s left for the audience to muse \" Is he guilty or innocent and will he go to bed with his attorney ? \" , but halfway through the film shows its early 90s credentials by turning into a \" Lawyer gets manipulated and stalked by her client \" type film which ends in a ridiculous manner , and GUILTY AS SIN has an even more ridiculous ending in this respect . This is a very poor thriller but the most unforgivable thing about it is that it was directed by Sidney Lumet the same man who brought us the all time classic court room drama 12 ANGRY MEN",
         "I saw this film last night, and was surprised by it. I was very well written, directed and acted, yet no had put any comments about it on here, and it only scored a 5.6 user rating. Well, I'd just like to say that I thoroughly enjoyed it. It was a clever tense thriller, that wasn't a million miles away from Fatal Attraction with the roles reversed. The two leading roles were brilliant (Don Jonson genuinely scary). In short, it was certainly a tense thriller that I'd recommend people to see, if only once. It isn't the best film ever (it came from the writer of Maniac Cop 2 & 3) but it was neatly handled (it WAS directed by Sidney Lumet!). Check it out.",
         "Usually, before the woman in jeopardy discovers that her client or her handyman or gardener is guilty of murder, she has to fall in love and have an affair with him. The examples are too numerous to list but \"Jagged Edge\" can serve. In this case, Rebecca De Mornay is a lawyer at a high-end Chicago firm. She's hired by the narcissistic Don Johnson to defend him when he's accused of tossing his wealthy wife out a fourteen-story window. The odd thing -- almost the ONLY unpredictable feature of the movie -- is that she is wary of him from the beginning. She accepts the retainer, gets him out on bail, and defends him in court, with the assistance of the usual flawed investigator. Sometimes the assistant is a drunk -- Robert Loggia or Morgan Freeman -- and sometimes just well meaning but old and a little out of it. Here, it's Jack Warden, who played a similar role in \"Verdict,\" a much better film. This is one hoary suspense device after another. A hand may reach in from off screen at a particularly spooky moment and shock the heroine. It soon becomes clear that Don Johnson is a homicidal maniac and we get scene after scene of people alone at night in deserted urban spaces like empty offices, dark hotel corridors, and those horrible multi-level parking lots with lots of shadows and distant blue neon. I don't know how Sidney Lumet -- a fine director -- could wrap his mind around a story like this. I don't know how he could have coped with it except by dozing off in his director's chair. The plot seems to have been ground out by a computer. Any questions about it could have been answered by a Magic Eight Ball. The art director certainly knew what he wanted. The settings are all sterile and the walls festooned with tasteful paintings. There's never any doubt that we're in greenback territory, although most of the supporting players speak with Canadian accents. There is nothing shabby about the settings, nor should there be. Jack Warden is his reliable self. And Rebecca De Mornay, thoroughly glamorized, has rarely looked so attractive. I thought she was more appealing as the raggedy, freckled, rosy-cheeked stowaway in \"Runaway Train,\" but that's my perversion. She turns in a decent, textured performance too. The same can't be said for Don Johnson. Part of it must be the role as written, slimy and repulsive. But part is also Don Johnson, who has never convinced me that he's a good actor, though he's often cast as some masculine type who carries a cloud of pheromones around with him wherever he goes. This is strictly routine suspense, but if that's what you're looking for, the film delivers it."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Hollywood Pictures"],
      "summaries": [
         "A man accused of murdering his wife approaches a hotshot female criminal attorney to take his case. The man is a self-professed womaniser, and his alleged motive would be the large sum of money his wife left him. The attorney begins to have second thoughts about representing him when he starts making it look like they're having an affair and tells her things she can't reveal because of lawyer/client privilege, so she starts her own investigation of him, which threatens her career and the safety of her friends and herself.",
         "A female lawyer takes an accused wife-murderer as a client, but finds herself morally compelled to betray him one way or another."
      ],
      "budget": 0
   },
   "movielensId": 463,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-06-04",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Sidney Lumet"],
      "runtime": 107,
      "movieId": 463,
      "title": "Guilty as Sin",
      "mpaa": "R",
      "actors": [
         "Rebecca De Mornay",
         "Don Johnson",
         "Dana Ivey",
         "Stephen Lang",
         "Jack Warden",
         "Ron White",
         "Norma Dell'Agnese",
         "Sean McCann",
         "Luis Guzmán"
      ],
      "imdbMovieId": "0107057",
      "originalTitle": "Guilty as Sin",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["ookd-Dgs8PU"],
      "plotSummary": "Before a criminal lawyer knows what has happened, she is forced to defend a wife killer she knows is guilty.",
      "tmdbMovieId": 4916,
      "avgRating": 2.81279,
      "releaseYear": "1993",
      "numRatings": 430,
      "posterPath": "/hQwk4PZdDVJI6SYEEqxx4zqco0j.jpg"
   }
}