{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "actor",
            "id": 207716
         },
         {
            "name": "unsuccessful",
            "id": 208186
         }
      ],
      "imdb_id": "tt0110097",
      "video": false,
      "title": "I'll Do Anything",
      "recommendations": [
         27224,
         83714,
         83489,
         30709,
         157036,
         25697,
         73249,
         41779,
         38554,
         41589,
         33657,
         161495,
         134413,
         82269,
         32911,
         48287,
         40480,
         18495,
         17761,
         34574
      ],
      "backdrop_path": "/qVLTiWYvNQVBU0RAHPoDR8EvmiW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Matt Hobbs",
               "gender": 2,
               "credit_id": "52fe4a61c3a36847f81ca929",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 0
            },
            {
               "cast_id": 29,
               "character": "Ground Zero Hero",
               "gender": 2,
               "credit_id": "59499c93c3a3687ede006715",
               "name": "Woody Harrelson",
               "profile_path": "/tFAngknlbFZebWVMaFFLFIsFvLE.jpg",
               "id": 57755,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Burke Adler",
               "gender": 2,
               "credit_id": "52fe4a61c3a36847f81ca931",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Claire",
               "gender": 1,
               "credit_id": "54537d26c3a368148000128f",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nan Mulhanney",
               "gender": 1,
               "credit_id": "52fe4a61c3a36847f81ca935",
               "name": "Julie Kavner",
               "profile_path": "/tVOau491aJlI8vNaksykiURPbDN.jpg",
               "id": 199,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Cathy Breslow",
               "gender": 1,
               "credit_id": "52fe4a61c3a36847f81ca93d",
               "name": "Joely Richardson",
               "profile_path": "/fgjpKio6sMD5AxOWQwAdgJQErhm.jpg",
               "id": 20810,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Millie",
               "gender": 1,
               "credit_id": "54537d180e0a2648d6001203",
               "name": "Vicki Lewis",
               "profile_path": "/vXKKbsYikbLZ3DS1GbCWwMoqDN7.jpg",
               "id": 14723,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "John Earl McAlpine",
               "gender": 2,
               "credit_id": "54537d330e0a2648cb0012ce",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Beth Hobbs",
               "gender": 0,
               "credit_id": "554a8d7f9251414694000022",
               "name": "Tracey Ullman",
               "profile_path": "/mwaLg97HsIyoxOgdqEnyQVR0bBv.jpg",
               "id": 30364,
               "order": 8
            },
            {
               "cast_id": 4,
               "character": "Jeannie Hobbs",
               "gender": 1,
               "credit_id": "52fe4a61c3a36847f81ca92d",
               "name": "Whittni Wright",
               "profile_path": null,
               "id": 79088,
               "order": 9
            },
            {
               "cast_id": 27,
               "character": "Ken",
               "gender": 0,
               "credit_id": "58cff1b69251415a7d038ca5",
               "name": "Ken Page",
               "profile_path": null,
               "id": 95758,
               "order": 10
            },
            {
               "cast_id": 28,
               "character": "Hair person",
               "gender": 1,
               "credit_id": "58cff1cbc3a368508c036b05",
               "name": "Rosie O'Donnell",
               "profile_path": "/76ZWoNK1Fr6gmJUH1zhEBMsT9DT.jpg",
               "id": 12929,
               "order": 11
            },
            {
               "cast_id": 30,
               "character": "Airplane Passenger",
               "gender": 0,
               "credit_id": "5a5f9abcc3a368786b0061df",
               "name": "Joan Giammarco",
               "profile_path": "/t48mQBRT0LydbZE4dmSlAwQvovZ.jpg",
               "id": 1961863,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a61c3a36847f81ca91f",
               "name": "James L. Brooks",
               "profile_path": "/9Hx9JbnQBChJhlfJTvmnYF8o8DK.jpg",
               "id": 3388,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a61c3a36847f81ca925",
               "name": "James L. Brooks",
               "profile_path": "/9Hx9JbnQBChJhlfJTvmnYF8o8DK.jpg",
               "id": 3388,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "545fbe2dc3a3680b5d000d07",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58967ea8c3a36822e000cdd1",
               "name": "James L. Brooks",
               "profile_path": "/9Hx9JbnQBChJhlfJTvmnYF8o8DK.jpg",
               "id": 3388,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58967eb19251415a5b00ca2e",
               "name": "Ian Deitchman",
               "profile_path": null,
               "id": 120353,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 1,
               "credit_id": "58967eb9c3a368622200ca77",
               "name": "Penney Finkelman Cox",
               "profile_path": null,
               "id": 12065,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58967ec19251412e19011045",
               "name": "Richard Marks",
               "profile_path": null,
               "id": 3175,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 1,
               "credit_id": "58967ee29251412e0d0116e1",
               "name": "Polly Platt",
               "profile_path": null,
               "id": 21067,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58967eeac3a368627c00cf27",
               "name": "Michael Ballhaus",
               "profile_path": "/pMto0iHZb67YaSP9cTgKbAPcaYU.jpg",
               "id": 3769,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58967ef1c3a368622200ca93",
               "name": "Richard Marks",
               "profile_path": null,
               "id": 3175,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58967ef8c3a368627c00cf34",
               "name": "Paula Herold",
               "profile_path": null,
               "id": 1342833,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "58967f01c3a368622200ca9c",
               "name": "Stephen J. Lineweaver",
               "profile_path": null,
               "id": 53811,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58967f0ec3a36808980117fc",
               "name": "Bill Brzeski",
               "profile_path": "/mMYfNs66GLsnU0mD1LVr5t8r4jU.jpg",
               "id": 52600,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "58967f819251412e14010a2a",
               "name": "Marlene Stewart",
               "profile_path": null,
               "id": 3989,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "58967f8ac3a368627c00cf7b",
               "name": "Gail Rowell-Ryan",
               "profile_path": null,
               "id": 1341848,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.184432,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 106143,
      "vote_count": 20,
      "budget": 40000000,
      "overview": "Matt Hobbs is a talented but unsuccessful actor. When estranged (and strange) ex-wife Beth dumps their daughter Jeannie on Matt, father and daughter have a lot of adjusting to do. His budding relationship with attractive production assistant Cathy Breslow is made complicated, while the precocious child is overly accustomed to getting her own way. Matt eventually faces the choice of family vs career in a particularly difficult way.",
      "similar": [
         11631,
         334,
         2539,
         10054,
         8272,
         8967,
         2288,
         4347,
         88,
         1164,
         2024,
         425,
         773,
         858,
         13,
         111,
         142,
         49519,
         112160,
         39254
      ],
      "original_title": "I'll Do Anything",
      "runtime": 115,
      "poster_path": "/nTDUwFB9FlNxb6yMI6qJRPNrZcd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/kxG3lFjyqW5VDivYtdJ1DHJbsL3.png",
            "name": "Gracie Films",
            "id": 18,
            "origin_country": "US"
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-02-04",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James L. Brooks"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["James L. Brooks"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110097/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1Njk4NDYxMl5BMl5BanBnXkFtZTcwNTk4NTMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Nick Nolte, Albert Brooks, Whittni Wright | See full cast and crew »"],
      "reviews": [
         "This movie has really got the \"Brooks Touch\" and that's a very good thing. I can't understand why this has got such a low ratings on the IMDB, or why it is so little known. Like AS GOOD AS IT GETS and the even better, but overall largely underrated TERMS OF ENDEARMENT, this again is a wonderful story about real people. And when Brooks is in the director's seat, you know this film isn't going to take the easy way. I can only recommend this movie, especially because of the many lovely moments and the excellent dialogue. My only complaint is that some of the dialogue is a bit too smart for its own good and that it doesn't always ring true. The actors are very good too, especially Nick Nolte, Joely Richardson and the young Whittni Wright(who is wonderful). They're not the really big names, like in the two aforementioned movies, but they did a very good job. Also look out for the character played by Albert Brooks, which is very familiar with Jack Nicholson's character in AS GOOD AS IT GETS. It almost seems a trademark of James L. Brooks, who keeps delivering the goods with his original and always fresh romantic comedies. Don't miss this one! 8/10",
         "This is a movie about making movies and standing up for your beliefs and not having to bow down under the pressures of audience expectations and studio involvements, and it had musical numbers which were cut and writers come in to dumb it down because of audience expectations and studio involvements. But I found all that out after I first saw the movie and thought it was great entertainment. I love Nick Nolte, he's so grave and gruff and depressed that I hope he doesn't kill himself cause I really like everything he's done, even The Hulk, and especially Affliction and that Martin Short with a kid movie. Joely Richardson is gorgeous! Julie Kavner and James Brooks are great. I highly recommend this film, and hope to see it again soon on DVD with all of the deleted scenes.",
         "Spoilers herein. There's a remarkably intelligent film hidden in here. I love watching old Welles films and trying to imagine the parts that the studios hacked out. And so here. The original idea was to have a deeply self-aware film, moreso than `The Player.' It was to have leveraged the shift inherent in a film musical : at some times, the audience is invited to see the story as representative of life, and at other times as representative of a show. Brooks puts tons of this stuff in `The Simpsons' and one can see the notion in his other TeeVee projects as well. But as I gather, this was actually supposed to be intelligent. Prince at this point was into self-referential songs and apparently increased the folding of an already baroque structure of who's looking at who. But (as with Welles), the studio financiers thought the paying audience was too dumb for all that, so brought in script doctor Elaine May (She of `Ishtar,' but nonetheless famously valuable as an invisible fixer). She straightened this film out so that a moron could understand it. Now it is not about the film business, but an ordinary sop about a dad discovering his precocious daughter. But you can see the joints where clever stuff might have been and the notion that parenting is a performance. They have kept one memorable Nolte moment. He is preparing to transform to a role. Watch how he changes, and also plays the meta-actor managing that change, and at the same time plays Nolte creating all three. It is his finest moment on film. I wonder if we will ever see the original version? Ted's Rating -- 2 of 4: Has some interesting elements.",
         "This is one of those 'greater than the sum of its parts' movie, where you can't quite put your finger on why it's so great, but it just is. The set of this movie must've motivated these actors to beyond their usual performances..........maybe because the script is so great(they all get their shots at character development..... I can think of 5.) There's Nick Nolte, I've never DISliked him, but his physique combined with his sweet fatherly attitude makes for the perfect combination; it makes him very attractive. Joely Richardson I've only seen in one other movie, but she keeps you interested in her character all the way through, however quirky, weird, or whimsical. Nolte's daughter (Wright) is SO believable as the spoiled little rich girl, brought up by man-hater Tracy Ullman (!)'s character as mom. The two other characters are supporting; one is that lady who does Marge Simpson's voice, and her love interest. All these characters develop and learn. This film also ironically gives insight into the film industry, and how truly unglamorous Hollywood can be. Nick Nolte must cry in a room full of people withOUT the director even being there, a group of ladies who work in casting are asked, when deciding yay-or nay on this actor, if they would sleep with him. But in the end, it stays true to its source, meaning it doesn't look completely down at Hollywood or anything else. It's just a really adorable feel-good movie. Did I mention adorable? -Sep",
         "Although I found the movie a bit frenetic, it seemed to have a ring of truth about how things work in Hollywood (especially the \"Would you sleep with him?\" scene). Nick Nolte keeps everything going, as usual, with his marvelous acting. Is there any other \"big guy\" actor who can cry believably (well, maybe Harrison Ford)? He was just terrific, so believable as the father who didn't know what to do with his spoiled brat daughter. And wasn't Whittni Wright amazing? I can only hope that was acting, as I've seen plenty of kids just like her. The supporting cast was terrific. It was hard to pinpoint what there was about this movie that made it not quite so good as it could have been. Perhaps it was that it really was an \"in-house\" film, one that anyone who has been through what the various characters have could identify with, but perhaps not us out in the hinterlands (coming from Wyoming to Australia, I'm definitely hinterland!). Kudos to actors and director for keeping this film together. With lesser talent, it could have fallen flat on its face.",
         "Writer & Director James L Brooks has a very sure touch when it comes to movies. I'll do anything was conceived as an old fashioned musical and parody of actor's lifestyles and film clichés. Test audiences were not impressed with the film and at the time musical films were out of fashion. I presume the songs were actually rubbish which tends to be the case with a lot of musical films. Re-cut and re-edited, this is now a straight story with Nick Nolte, playing Matt Hobbs, a once promising actor who has not managed to get a regular acting gig in some time, ends up driving around an arrogant film producer (Albert Brooks). Things take a turn when his ex-wife dumps their daughter Jeannie on Matt for what he thinks is for a few weeks but turns out to be longer as she is off to jail. His daughter is used to getting her own way and he is not used to fatherhood. His career may have some brightness as he gets friendly with with attractive production assistant (Joely Richardson) who has a script idea and thinks Matt could be the lead actor. The film was hampered from the start with its production troubles. Nick Nolte does well as a down on his luck actor with a brat of daughter and trying to bond with her whilst dealing with machinations of the film industry. Where Brooks succeeded so well when he turned his eye on TV news with Broadcast News, the story here is not strong enough and although the actors try hard the film comes off as hollow.",
         "This is one of those movies that I have grown to love almost inspite of itself. Yes, it's haphazard and kind of all over the place, and yet I am compelled to watch it through to the end whenever it plays on the telly. I can't quite figure out how well the characters are actually written, but they are played so beautifully that it really doesn't matter. I've always liked Nick Nolte but he's never been one of my 'favourites'. When I saw this film though, he completely won me over: he's selfish yet tender, brusque yet warm - just a wonderful, brave performance. Whitni Wright as Jeannie is remarkable - for any age. She is so utterly natural and believable, capturing the exasperating but ultimately disarming precociousness of childhood perfectly. It's a pity she has stopped acting, I think she would be amazing. It's also great to see Julie 'Marge Simpson' Kavner on the screen, she's severely underused by Hollywood - a great talent (remember 'Radio Days'?) And by the way, the film is about much more than an errant father mending his ways and changing his attitude toward his neglected kid, it's about a man unsure of his own worth finally changing his attitude toward HIMSELF. All in all, a gem despite its shortcomings.",
         "I've been a Nick Nolte fan ever since his \"Rich Man Poor Man\" days. \"I'll Do Anything\" is a big studio film with a sensitvity and quality OF performance I usually expect only in \"art house\" films. It's a character study of a struggling actor (Nolte) forced to come to grips with his life, career, and destiny after many factors like children/responsibility, age (mid-life crisis), relationships and values come to an intersection, and Nolte's character is forced to re-evaluate the way he lives in order to keep his sanity. The story is fueled by the insane film industry against which it is set. It's a crazy story presented with great warmth. People who would love it: couples or groups of women especially, but anyone looking for a heart breaking comedy. Lots to discuss after the film such as plot, performances, values that affect the characters' livessuch as kids vs career, career vs romance, art vs material success, responsibility vs dreams, and on and on. Have a party. Pop some corn, Have a great time. Laugh. Cry.",
         "I saw this movie recently on cable TV and liked it a lot . I was looking for something other than the usual action/shootout/special effect types and ended up selecting this one. I'm glad I did. The supporting actors were excellent and Nick Nolte & Whittni Wright were outstanding in their roles. It was refreshing to see Nolti do this type of thing, although I'm not surprised that he did it well. He's an actor who has, over time, honed his skills to an art form. I'm not sure that he is appreciated as much as he should be. Anyway, in my opinion, \"I'll do Anything\" is underrated here. I give this flick a high mark and hope that my participation in the \"vote\" will raise the average score of this fine movie. For those who have had their fill of movies that focus on violence, try this delightful James L Brooks production for a change of pace. Or if you simply want to watch a movie that entertains... go for this one.",
         "This film could have been shot in a month, since everything in it had a freshness and spontaneity that can only come when nothing is labored. I don't know the film world, but this seemed genuine, with the characters each with their own struggles. Nick Nolte's relation with his \"difficult\" daughter was something to enjoy. When his hopes were raised to get the big role, only to find out it wasn't going to happen, devastation, closing the door and crying in the bathroom, was what could be expected. We only get so many chances in life, and when we miss one that very well could be our last, our life is altered irretrievable. Nothing could be more real, whether it is getting a movie part or a promotion to manager at Walmart. And the six year old who played his daughter, recruited from a clogging class in Georgia from a working class family. She was just a normal little girl, not a child actress, but someone who fit perfectly. And she went back to Georgia and then on to a local College to study Business Administration. Somehow, this film received a low rating here and apparently was a box office failure, yet every written comment was of the vein of this one, laudatory. Perhaps that was the subplot of the film exemplified by its lack of success. Brooks producer character made his films with loud explosions and tested it as a product to satisfy an audience. Artistry had nothing to do with what he was manufacturing. This film was a rare treat, but would never been made by Brooks, or anyone else apparently. But this one got through, and is a pleasure for those who can appreciate it."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Gracie Films"
      ],
      "summaries": [
         "Matt Hobbs is a talented but unsuccessful actor. When estranged (and strange) ex-wife Beth dumps their daughter Jeannie on Matt, father and daughter have a lot of adjusting to do. His budding relationship with attractive production assistant Cathy Breslow is made complicated, while the precocious child is overly accustomed to getting her own way. Matt eventually faces the choice of family vs career in a particularly difficult way.",
         "This movie is about an actor that has had trouble getting a job in the past two years. His wife is forcing him to take his daughter home with him, despite the fact that he has no money. Little does he know, she won't be staying for the \"3 weeks\" his ex requested, she will be staying for a few years!"
      ],
      "budget": 44000000
   },
   "movielensId": 472,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-02-04",
      "dvdReleaseDate": "2003-02-18",
      "directors": ["James L. Brooks"],
      "runtime": 115,
      "movieId": 472,
      "title": "I'll Do Anything",
      "mpaa": "",
      "actors": [
         "Nick Nolte",
         "Woody Harrelson",
         "Albert Brooks",
         "Anne Heche",
         "Julie Kavner",
         "Joely Richardson",
         "Vicki Lewis",
         "Ian McKellen",
         "Tracey Ullman",
         "Whittni Wright",
         "Ken Page",
         "Rosie O'Donnell",
         "Joan Giammarco"
      ],
      "imdbMovieId": "0110097",
      "originalTitle": "I'll Do Anything",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["j4UUAeof5Go"],
      "plotSummary": "Matt Hobbs is a talented but unsuccessful actor. When estranged (and strange) ex-wife Beth dumps their daughter Jeannie on Matt, father and daughter have a lot of adjusting to do. His budding relationship with attractive production assistant Cathy Breslow is made complicated, while the precocious child is overly accustomed to getting her own way. Matt eventually faces the choice of family vs career in a particularly difficult way.",
      "tmdbMovieId": 106143,
      "avgRating": 2.87584,
      "releaseYear": "1994",
      "numRatings": 745,
      "posterPath": "/nTDUwFB9FlNxb6yMI6qJRPNrZcd.jpg"
   }
}