{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0110137",
      "video": false,
      "title": "The Inkwell",
      "recommendations": [
         265876,
         134158,
         44465,
         39310,
         18713,
         20595,
         34615,
         38749,
         26408,
         56448,
         50875
      ],
      "backdrop_path": "/c4trs4LUBLV51JKx8q1IAJeMGFz.jpg",
      "revenue": 8880705,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Drew Tate",
               "gender": 2,
               "credit_id": "52fe49a2c3a36847f81a480f",
               "name": "Larenz Tate",
               "profile_path": "/ApN0l0NF1fUp61PwffW09ZqEUMW.jpg",
               "id": 18291,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Kenny Tate",
               "gender": 2,
               "credit_id": "52fe49a2c3a36847f81a4813",
               "name": "Joe Morton",
               "profile_path": "/5adJxjbFX2GeuTTCNqc9dg4Twgx.jpg",
               "id": 3977,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Brenda Tate",
               "gender": 1,
               "credit_id": "52fe49a2c3a36847f81a4817",
               "name": "Suzzanne Douglas",
               "profile_path": "/ldfCErLjjST3HBZSK8G4KBMDZhR.jpg",
               "id": 80622,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Spencer Phillips",
               "gender": 2,
               "credit_id": "52fe49a2c3a36847f81a481b",
               "name": "Glynn Turman",
               "profile_path": "/yEW4JrFPyTTsoSeDQYwHxBihMuM.jpg",
               "id": 114674,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Francis Phillips",
               "gender": 1,
               "credit_id": "52fe49a2c3a36847f81a481f",
               "name": "Vanessa Bell Calloway",
               "profile_path": "/4jpzrbbBQOUrniKmm4HAvsuu7SS.jpg",
               "id": 100653,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "Heather Lee",
               "gender": 1,
               "credit_id": "52fe49a2c3a36847f81a4823",
               "name": "A.J. Johnson",
               "profile_path": "/ltieu9aznaBoj3hVuzDdUpXyvtX.jpg",
               "id": 88186,
               "order": 5
            },
            {
               "cast_id": 1007,
               "character": "Harold Lee",
               "gender": 2,
               "credit_id": "52fe49a2c3a36847f81a4827",
               "name": "Morris Chestnut",
               "profile_path": "/8uXIo48u1hyuUUVnCpXXniBfw6c.jpg",
               "id": 9779,
               "order": 6
            },
            {
               "cast_id": 1008,
               "character": "Lauren Kelly",
               "gender": 1,
               "credit_id": "52fe49a2c3a36847f81a482b",
               "name": "Jada Pinkett Smith",
               "profile_path": "/Pb8KeGa4kTgJqS2ASoYvbNHbLr.jpg",
               "id": 9575,
               "order": 7
            },
            {
               "cast_id": 1009,
               "character": "Jr. Phillips",
               "gender": 2,
               "credit_id": "52fe49a2c3a36847f81a482f",
               "name": "Duane Martin",
               "profile_path": "/k39pQoTLnRj9q4pPMZhgC5pKFTC.jpg",
               "id": 84077,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49a2c3a36847f81a480b",
               "name": "Matty Rich",
               "profile_path": "/4pdBQ2b5E7q59q4IlxtHfjO5gGN.jpg",
               "id": 230059,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5ab2b3610e0a26789d010205",
               "name": "Trey Ellis",
               "profile_path": null,
               "id": 1247075,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.005462,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 59930,
      "vote_count": 5,
      "budget": 0,
      "overview": "The Inkwell is about a 16-year-old boy coming of age on Martha's Vineyard in the summer of 1976.",
      "similar": [],
      "original_title": "The Inkwell",
      "runtime": 110,
      "poster_path": "/uINVYNlnCbSLCkqveGwj7j4oFTf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1994-04-22",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "Summer's Never Been So Much Fun!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matty Rich"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Trey Ellis",
         "Paris Qualles"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110137/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNjkyMzYwNV5BMl5BanBnXkFtZTcwMzEwNTYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Larenz Tate, Joe Morton, Suzzanne Douglas | See full cast and crew »"],
      "reviews": [
         "Often we see so many stereotypical movies about minorities in film. This time a black child, that could just as easily have been a white kid with a script rewrite, begins to experience adolescence as a young man. He has some issues he is dealing with and is counseled by several adults throughout the movie. What I liked most about this movie was the beautiful portrayal of blacks in love. The kids, and the parents. It was like watching an old home movie of my own family. Too bad Matty Rich disappeared after this film. I was kinda hoping it would turn into a trend. Blacks in positive roles in films.",
         "I really liked the film, well acted, well directed. As a director myself I felt a sense of sadness that the black audience didn't support the film. We keep crying for better images on film but when they come we don't support it. If you are an African-American you owe it to yourself and Matty Rich to see this film and hopefully some other ethnic groups will see it and understand that we're not all drug dealers and pimps.",
         "This is one of the great coming of age films that I have ever seen. The character of Drew is so well drawn out and complex you forget that he is just a teenager. You also view the complex relationship between not only cultures but within the family as well. You are pretty much leaving this film wanting more. If one film really cries out for a sequel it's this one. MATTY, I'M BEGGING YOU, MAKE INKWELL 2 AND SHOW US WHAT HAPPENED TO ALL THE CHARACTERS YEARS LATER!!!",
         "The story: Drew has problems coping with his life after he accidentally burns down his house. His mom(played by Suzzanne Douglas and Dad(Joe Morton)move with her sister and from then Drew's life changes. Larenz Tate is pretty good as the naive but likable Drew. Suzzanne Douglas is great as Drew's mother and Joe Morton is perfect as Drew's father Kenny. Glynn Turman is good also as the ignorant and arrogant Spencer Phillips. Duane Martin is just hilarious as Jr Phillips. And for me the silliness only made this movie more appealing. Its a shame that Matty Rich(the director) never had another movie after this one. But I understand all too well that any gifted black director that gives us positive images will not last in Follywood. There is no high demand for them and a lot us will only promote the black films that these childish schizophrenics promote. If you are over the age of thirty and you still allow these freaks to dictate to you what quality entertainment is then you should be ashamed of yourselves. The negative reviews for this movie are the reason why positive black movies will never get the love they need. You cant pine about positive images for Black people and you would not support a movie like this. We owe it to Matty Rich as well as all other talented black filmmakers to support movies of this ilk. Two thumbs up for this touching coming of age movie.",
         "I enjoyed The Inkwell very much. It was well directed and the screenplay was solid. Good movie.",
         "A black teen (L. Tate) causes a house fire and retreats into himself -- that is, until his parents take him to visit relatives on an island where a section of the beach has been taken over by blacks. Set in the 1970s, the viewer has to get used to the silly hairdos and outfits of the time, and which the writer and director have some fun with, especially during a dance scene. Brothers-in-law Joe Morton and Glynn Turman do not get along at all; the former is an urban working man type and the latter is a pretentious windbag. Eventually, they come to blows in a comic way. Suffice it to say, the introverted kid eventually meets a girl who helps draw him out of his shell. The title refers to the part of the beach that is occupied by blacks, and it is a revelation to the shy kid who has never seen anything like it. Turman as the pompous, upwardly mobile brother-in-law steals the show, which constantly veers from drama to comedy. Worth a watch, although it is uneven.",
         "The Inkwell reminds me of two other films about the problems facing African American youths coming of age. They are Cooley High(1976) and Boyz 'N the Hood. While not as violent ridden as Boyz nor as touching as Cooley High, this film none the less drives home the same point: growing up a teenager is hard enough, being a black teenager can be even more difficult. I would like to see a film about the challenges facing African American youths growing up in the new century with the same focus and intensity of these three excellent films.",
         "I enjoy watching movies that reflect back to the 70s,but as for Larenz Tate character in the movie to me seems kinda wierd. In comparison to the year before with \"Menace to Society\" were he play a ruthless gangster. In this movie he portrays a shy young man who travels to Martha's Vineyard with his parents in the summer of 1976. He carries a doll with him through have of the movie,get shoved to the floor by a guy who's dancing with a girl he's interested in,and gets stood up by Jada Pinkett who went back to her ex-boyfriend. Talk about a 360 in character. Still a good movie but I think it's more of a home situated movie then going to the theaters. As for Larenz Tate the best part of the movie for him is he learn how a man feels when making love to a woman.",
         "Matty Rich is proabbly one of the most talented directors you've never heard of. This film about a black teen's summer in Martha's vineyard. Larnez Tate who plays Drew plays this role perfectly as a teen who experiences love,heartbreak and emotion all in one summer. Rich once again proves his talent with this heartfelt film.",
         "So many parts of this movie were truly moving and then you were blasted with utterly stupid scenes...the insane giggling of the adolescent boys, the interactions between the brothers-in-law. What could have been a really tremendous movie was absolutely sidelined by the unsuccessful attempts at over-the-top humor that had none of us laughing. In fact, when seeing the critics \"hilarious\" and such comments on the DVD box, it simply reinforced my belief that most, if not all, male critics in our society today are simply 14-year-old adolescent boys in adult bodies. This was simply not funny and should instead have gone with mild humor and the wonderful story basis. Such a shame!"
      ],
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Touchstone Pictures"],
      "summaries": ["In 1976, Drew Tate is a young teenager who has trouble dealing with life after he accidentally sets his house on fire. His parents Kenny and Brenda decide to go to Martha's Vineyard to spend Fourth of July weekend with Brenda's sister Francis, Francis' black Republican husband Spencer and their son Junior. While there Drew falls for a self centered girl named Lauren and befriends a married lady named Heather. While on their vacation, Drew deals with his parents attempts to save their marriage as well as with his own troubles. Eventually all of this leads to a life changing event for Drew as well as his parents."],
      "budget": 0
   },
   "movielensId": 476,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-04-22",
      "dvdReleaseDate": "2003-04-08",
      "directors": ["Matty Rich"],
      "runtime": 110,
      "movieId": 476,
      "title": "The Inkwell",
      "mpaa": "R",
      "actors": [
         "Larenz Tate",
         "Joe Morton",
         "Suzzanne Douglas",
         "Glynn Turman",
         "Vanessa Bell Calloway",
         "A.J. Johnson",
         "Morris Chestnut",
         "Jada Pinkett Smith",
         "Duane Martin"
      ],
      "imdbMovieId": "0110137",
      "originalTitle": "The Inkwell",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The Inkwell is about a 16-year-old boy coming of age on Martha's Vineyard in the summer of 1976.",
      "tmdbMovieId": 59930,
      "avgRating": 3.01037,
      "releaseYear": "1994",
      "numRatings": 241,
      "posterPath": "/uINVYNlnCbSLCkqveGwj7j4oFTf.jpg"
   }
}