{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0110197",
      "video": false,
      "title": "Jimmy Hollywood",
      "recommendations": [
         25297,
         107934,
         28368,
         14759,
         15669,
         399786,
         48448,
         57873,
         56448,
         31692,
         44488,
         56179,
         2302,
         2042,
         12647,
         41852,
         33545,
         50536,
         208377,
         9774
      ],
      "backdrop_path": "/owMWpPXkZku86GlM6lmyzthzYrn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jimmy Alto",
               "gender": 2,
               "credit_id": "52fe44929251416c910155a9",
               "name": "Joe Pesci",
               "profile_path": "/2CaYAhUZgkAeqtpIzuqGcqArsOy.jpg",
               "id": 4517,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "William",
               "gender": 2,
               "credit_id": "52fe44929251416c910155ad",
               "name": "Christian Slater",
               "profile_path": "/3ElLWjnvchMS6Q4cIQOK8QNAoMG.jpg",
               "id": 2224,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lorraine de la Pena",
               "gender": 1,
               "credit_id": "52fe44929251416c910155b7",
               "name": "Victoria Abril",
               "profile_path": "/qVszystVNlXomQQrhM9u3joaw9P.jpg",
               "id": 25256,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Harrison Ford",
               "gender": 2,
               "credit_id": "59de0a37925141251f08ccc5",
               "name": "Harrison Ford",
               "profile_path": "/7LOTdRfHU1H1qHBxpUv3jT04eWB.jpg",
               "id": 3,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Director of 'Life Story'",
               "gender": 2,
               "credit_id": "59de0a49c3a36861ec08a471",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44929251416c910155b3",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54f76b85c3a368352000218e",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54f76b93c3a36834a200232b",
               "name": "Mark Johnson",
               "profile_path": "/yKGF6cbzyP03Gl1QhVLCu1gWSW6.jpg",
               "id": 5162,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54f76b9c9251416f370023d6",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.455132,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31643,
      "vote_count": 21,
      "budget": 30000000,
      "overview": "Jimmy Alto is an actor wannabe who stumbles into the role of a lifetime. He becomes a vigilante crime-fighter, aided by his sidekick William, who has suffered a head wound and has problems with short-term memory. Jimmy's vigilante alter ego soon becomes a media wonder--but Jimmy remains a total unknown and his long-suffering girl friend Lorraine is getting fed up with the whole situation.",
      "similar": [],
      "original_title": "Jimmy Hollywood",
      "runtime": 112,
      "poster_path": "/pMFMuAdQORx4GoGs6HuZyUepIkN.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Baltimore Pictures",
            "id": 11407,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-03-30",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barry Levinson"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Barry Levinson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110197/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzgxMjk2MzEzNV5BMl5BanBnXkFtZTcwMTU3ODYyMQ@@._V1_SY317_CR24,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Pesci, Christian Slater, Victoria Abril | See full cast and crew »"],
      "reviews": [
         "\"Jimmy Hollywood\" is an underrated classic, with Joe Pesci as Jimmy Alto, wanna-be movie star and starry-eyed idealist. Its final scenes and Cinderella ending will leave you with the warm fuzzies, and I could recommend it just for that. But it's a unique tale of failure-turned-victory and any student of film will be able to identify with the likable Jimmy and his associates on the mean streets of the film capital. The supporting cast is well-chosen, and the plotline progresses evenly to its satisfying final wrap. If you liked \"Ed Wood\", \"Jimmy Hollywood\" could also be your ticket back to the movies as they were seldom seen by the rest of us.",
         "There is so much content on this, it is just a shame such few people have seen it. It is brilliant, funny, sometimes sad and deep, but overall a story full of quotations. Joe Pesci is even greater than the usual, never mind the long blond hair. There is an astonishingly funny performance given by Christian Slater, to me his most impressive ever. Search for it everywhere you can and see for yourself.",
         "I admire Barry Levinson's work very much, he's done some great movies and when \"Jimmy Hollywood\" was airing in my TV, I thought, remembering a complete turkey which was \"Bandits\" (with Willis and Thornton, directed by Levinson) that this buddy-movie won't be better and I was totally, positively disappointed. Most simple is to say, that it's a one man-show by Joe Pesci, who simply IS Jimmy Alto, a \"wanna-be\" actor, who continuously looking for his chance in the film capitol of the World-Hollywood. The movie is funny, well-written, good-feeling, has great acting and... cameo of one of the biggest stars of today's cinema at the end. I was very surprised by Christian Slater's role, who always plays dynamic characters, and here it's a complete opposite performance. Also Victoria Abril, known from Almodovar movies, gives here very good acting as Pesci's fiancee. If you saw the poster to this movie, I can only tell that the movie is as COOL as Pesci and Slater cool-looking while sunbathing at the pool. I just can't imagine, how such great movie could earn only $3,6 mlns!!! That's a shame for american audience. I recommend it for everyone who searches for some intelligent entertainment and for all Joe Pesci fans.",
         "I have watched this movie about 5 times, and each time I become involved in the characters and their lives. It is a gripping plot, and the movie is well acted, Joe Pesci give another great performance. This is a movie which nobody has really seen or heard of, and that is sad to me. A movie with a good point (crime is bad and hope is good) and good acting should have made more money than any of the current Freddie Prinze Jr. or Sarah Michelle Gellar movies, but the movie world is not ruled by values and quality. I give this movie a 9.5/10 I'd even think about making this movie a perfect ten.",
         "Anyone not living in the immediate vicinity of our Mecca that is Hollywood, or knowing someone who does, may not recognize the appeal and ring of truth in \"Jimmy Hollywood.\" How many actor friends living on borrowed ego (and credit cards) I see in this film; like Joe Pesce's character, we've shared those Hollywood streets of today and think how wonderful it would've been to walk among the early stars and the city THEY knew. It's enough to make anyone want to Save Our Streets...",
         "I have never been to Hollywood California. But I have heard much of its demise. Jimmy Hollywood brilliantly shows not just the degeneration of a former golden town, but also provides a truly compelling performance as a mediocre, yet driven actor. The sad part about this movie, is that people nowadays are not patient. They want everything in one big dose. Jimmy is slow to deliver in that sense, the movie takes its time. Those willing to wait, are very lucky. And those who are unwilling, miss a truly enjoyable experience. See it. If you are perceptive and patient when it comes to movies. Otherwise, go see Titanic again.",
         "I just watched this movie and was delighted with all the characters. Pesci was not his usual hyper-character(which he does well)but somewhat subdued. At the same time being pushed by his hope of getting \"the role\" that has always eluded him. Finally, he finds it in reality.The ending was great! I never even heard of this movie before. I am glad I caught it and would recommend it.It made me laugh and made me feel sad also. At the end it did remind me of \"The King of Comedy.\" Maybe not as well written but it kept me watching and grinning as well as feeling a bit nostalgic for the old Hollywood. Especially when 'Jimmy' and \"Lorraine\" were at Errol Flynns old house as they danced to the sounds of urban chaos.",
         "Jimmy (Joe Pesci) is an actor in Hollywood, scraping a living from his girlfriend and some casual jobs waiting for his big break. Most of his time is spent with drifter amnesiac William (Slater). When they catches a thief they video him and drop him off at a police station with a note from the SOS. When the SOS is given media coverage as a vigilante group, Jimmy finds himself drawn into the role of the leader of the fictitious gang leader and finds the media recognition he's always craved. However he must continue his role in order to maintain the coverage. However as the police gradually put more resources onto finding the leader of this gang, Jimmy finds himself crossing the line of acting the role and being the role. Levinson wrote and directed this and it is obvious he's trying to say something. It's a satire of something - I'm just not sure what. Is he trying to say that the once-great LA has been ruined by crime and bad acting? Is it a satire on celebrity - where Jimmy becomes successful for bad reasons? Is it at poke a actors who work as waiters and kid themselves that they're getting somewhere? I'm not sure but I think it's a broad satire on celebrity and the nature of LA, and as such it's not great. The main story of Pesci is not clever enough to make as many good points as it could. At times it seem that it only really has a few points to make and paints them on thick. Pesci is good as Jimmy - but it's really the same sort of hyper character he always plays. Slater is good as William and plays the dopey forgetful type well. The problem here is not with the actors or the direction (which is good) but with the script. The film is just not a great satire - it tries to cover similar ground as \"The King of Comedy\" but is too baggy and unfocused to make it's point well. Joe Pesci is no De Niro, Jimmy is no Pupkin and this is no \"King of Comedy\". As a film it's entertaining enough but it is a bit laborious towards the end and is not as clever as it thinks it is. Overall an entertaining film that doesn't totally deliver when it comes to putting it's points across.",
         "This movie was, to me, a teen generally interested and amused by movies like \"Bill & Ted\" and \"Waynes World\", trying too hard. It's not the fault of the actors and actresses (Victoria Abril was adorable, I got attatched to her character), but more the writers. This was supposed to be a comedy/drama and it turned out to be more of a strained drama with Joe Pesci. His character was loud mouthed, and rude, but sometimes a good, loyal friend would poke through. Like when he interacted with William (Christian Slater), his spaced out friend suffering from head trauma and anxiety due to an accident we never really learn much about. Christian Slater's performance kept me watching the movie - he was very passive in this, and was very unlike his usual roles. I really like his William. He played it very well - I almost forgot I was watching Christian Slater, which is a sign of good acting. I would see this movie if you were a die-hard Christian Slater fan, but otherwise, don't bother.",
         "The film is now 16 years old; perhaps writing a review isn't important. Yet, because of the sincerity of Pesci's character, and the development of a purpose for his life, and his willingness to abide Christian Slater's \"slow\" character, we gain appreciation for Mr. Pesci personally. He does not falter in his faithfulness to his lady-friend, even though a younger Hawaiian lady comes his way and they get \"liquored up\" together. Anyone who has had items stolen and yet received no favorable police-work outcome will agree with the character's frustration over theft of the car stereo and decision to make public the facts of local crime. All the sideshow techniques by \"Jerico\" as they escalate demonstrates the insatiable progressive desire of the public for increase in excitement over just about anything. Pesci understood Hollywood, its deterioration, its aberration and yet he loves it still. He lost his Hollywood star count on Richard Widmark who, in some ways, is as serious a role portrayer as Mr. Pesci is here. The scene where the advertisement on the bus bench has been graffiti-ed is poignant, as is the concluding scene where the portable TV battery is running low, just as the prospects of the SOS is also about deflated. I don't advocate vigilantism, but the process of getting new police chiefs takes years, doesn't it?"
      ],
      "genres": [
         "Crime",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Baltimore Pictures"],
      "summaries": ["Jimmy Alto is an actor wannabe who stumbles into the role of a lifetime. He becomes a vigilante crime-fighter, aided by his sidekick William, who has suffered a head wound and has problems with short-term memory. Jimmy's vigilante alter ego soon becomes a media wonder--but Jimmy remains a total unknown and his long-suffering girl friend Lorraine is getting fed up with the whole situation."],
      "budget": 30000000
   },
   "movielensId": 478,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1994-03-30",
      "dvdReleaseDate": "2004-10-26",
      "directors": ["Barry Levinson"],
      "runtime": 112,
      "movieId": 478,
      "title": "Jimmy Hollywood",
      "mpaa": "",
      "actors": [
         "Joe Pesci",
         "Christian Slater",
         "Victoria Abril",
         "Harrison Ford",
         "Barry Levinson"
      ],
      "imdbMovieId": "0110197",
      "originalTitle": "Jimmy Hollywood",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["zLckjRbfUlE"],
      "plotSummary": "Jimmy Alto is an actor wannabe who stumbles into the role of a lifetime. He becomes a vigilante crime-fighter, aided by his sidekick William, who has suffered a head wound and has problems with short-term memory. Jimmy's vigilante alter ego soon becomes a media wonder--but Jimmy remains a total unknown and his long-suffering girl friend Lorraine is getting fed up with the whole situation.",
      "tmdbMovieId": 31643,
      "avgRating": 2.42734,
      "releaseYear": "1994",
      "numRatings": 289,
      "posterPath": "/pMFMuAdQORx4GoGs6HuZyUepIkN.jpg"
   }
}