{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "drug abuse",
            "id": 726
         },
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "bank",
            "id": 974
         },
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "night life",
            "id": 1759
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "vault",
            "id": 1953
         },
         {
            "name": "junkie",
            "id": 2375
         },
         {
            "name": "bank robber",
            "id": 2492
         },
         {
            "name": "heroin",
            "id": 2671
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "pistol",
            "id": 13132
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "bank robbery",
            "id": 15363
         },
         {
            "name": "illegal prostitution",
            "id": 33625
         },
         {
            "name": "hoodlum",
            "id": 160488
         }
      ],
      "imdb_id": "tt0110265",
      "video": false,
      "title": "Killing Zoe",
      "recommendations": [
         10692,
         6071,
         4997,
         327,
         2144,
         9430,
         10668,
         9558,
         2742,
         20481,
         13973,
         5072,
         9057,
         10909,
         11959,
         451,
         10029,
         10894,
         11229,
         21627
      ],
      "backdrop_path": "/714WM8GntrZIiJsXUUfeYFCWWhe.jpg",
      "revenue": 418961,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Zed",
               "gender": 2,
               "credit_id": "52fe424bc3a36847f801327d",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "52fe424bc3a36847f8013281",
               "name": "Julie Delpy",
               "profile_path": "/rd40f4QpAUUne3hMaUhHrZtcK2c.jpg",
               "id": 1146,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Eric",
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013285",
               "name": "Jean-Hugues Anglade",
               "profile_path": "/iy8Tfcb3Zq1INu1kGm069wccRev.jpg",
               "id": 7037,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "François",
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013289",
               "name": "Tai Thai",
               "profile_path": "/9IXQSrW9VozlKdzSQ2vzaOQiwr3.jpg",
               "id": 7038,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Ricardo",
               "gender": 2,
               "credit_id": "52fe424bc3a36847f801328d",
               "name": "Bruce Ramsay",
               "profile_path": "/o1x3V0eLGQW5B78etUuTIxvcvrH.jpg",
               "id": 7039,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Jean",
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013291",
               "name": "Kario Salem",
               "profile_path": "/mAKOgOVfX0Bih7TADUrIe0jqivc.jpg",
               "id": 7040,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Claude",
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013295",
               "name": "Salvator Xuereb",
               "profile_path": "/9Wz3nzH7xWmZyIV5SGbpodJx5sX.jpg",
               "id": 7041,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Oliver",
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013299",
               "name": "Gary Kemp",
               "profile_path": "/9KwkTWuJ1SD2mP5aK39Dry1IAki.jpg",
               "id": 7042,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Cab Driver",
               "gender": 0,
               "credit_id": "52fe424bc3a36847f801329d",
               "name": "Martin Raymond",
               "profile_path": null,
               "id": 7043,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Bellboy",
               "gender": 0,
               "credit_id": "52fe424bc3a36847f80132a1",
               "name": "Eric Pascal Chaltiel",
               "profile_path": null,
               "id": 7044,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Martina",
               "gender": 1,
               "credit_id": "52fe424bc3a36847f80132a5",
               "name": "Cecilia Peck",
               "profile_path": "/a7VMnO7VADs9TjLghllXdQxJBbZ.jpg",
               "id": 7046,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013255",
               "name": "Roger Avary",
               "profile_path": "/x9E17YQVlzKoRU8E4SEoEOwRKay.jpg",
               "id": 8297,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe424bc3a36847f801325b",
               "name": "Roger Avary",
               "profile_path": "/x9E17YQVlzKoRU8E4SEoEOwRKay.jpg",
               "id": 8297,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013261",
               "name": "Samuel Hadida",
               "profile_path": "/kUmEKIsY5xeyxApLmHozX6rVNUC.jpg",
               "id": 4697,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013267",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424bc3a36847f801326d",
               "name": "Tom Richmond",
               "profile_path": null,
               "id": 7034,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe424bc3a36847f8013273",
               "name": "Kathryn Himoff",
               "profile_path": null,
               "id": 7035,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe424bc3a36847f8013279",
               "name": "David Wasco",
               "profile_path": null,
               "id": 5779,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.452561,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 507,
      "vote_count": 131,
      "budget": 1500000,
      "overview": "Zed (Eric Stoltz) is an American vault-cracker who travels to Paris to meet up with his old friend Eric (Jean-Hugues Anglade). Eric and his gang have planned to raid the only bank in the city which is open on Bastille day. After offering his services, Zed soon finds himself trapped in a situation beyond his control when heroin abuse, poor planning and a call-girl named Zoe all conspire to turn the robbery into a very bloody siege.",
      "similar": [
         4771,
         979,
         562,
         339692,
         281,
         1427,
         8067,
         4997,
         39927,
         398175,
         2142,
         400,
         8292,
         3134,
         8012,
         298312,
         261023,
         193893,
         11033,
         16869
      ],
      "original_title": "Killing Zoe",
      "runtime": 96,
      "poster_path": "/jAnpPlUUhBqztIfCfg3OKsTYMhu.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Live Entertainment",
         "id": 285,
         "origin_country": ""
      }],
      "release_date": "1993-10-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Roger Avary"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Roger Avary"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110265/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4NTU3NzU2N15BMl5BanBnXkFtZTcwNzQwMTE0MQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Eric Stoltz, Julie Delpy, Martin Raymond | See full cast and crew »"],
      "reviews": [
         "Killing Zoe played in Seattle theaters for exactly one week in August of 1994 and I managed to see it twice.Everything about this movie worked for me: the writing, the cinematography,the acting, the editing and the music. From the first images rushing through the streets of Paris until the blood-soaked climax, I was mesmerized. I consider myself lucky to have seen it in theaters with a good sound system becauseI have queried friends who have seen it on video and they had a completely different opinion of the film because they had missed key lines of dialog that really go a long way towards investing Killing Zoe with a certain quintessentially 90s vibe of doomed heroin-soaked romanticism, giving it deeper levels than most people are willing to admit.",
         "I love this movie. I just rented it again, and was not disappointed. Sure, it's bloody (Tarantino produced it) and nihilistic and all that, but it's also got a wonderful sense of anarchy that most films are afraid to commit too. As Emanuel Levy says in his book about independent cinema (\"Cinema of Outsiders), \"it promises to take off in unexpected directions but it's major distinction is it's gift for hysteria and pompous existentialism.\" It's all flash and blood and Julie Delphys breasts and guns and just a helluva lot of fun. Great out there performance by Jean-Hugues Anglade as the insane French bank robber and Eric Stoltz as the moral center (!?) of the madness. This film is even more fun when you've had a pint or two beforehand.",
         "'Killing Zoe' is a movie that has grown on me over the years. When I first watched it I didn't think all that much of it, but each time I've seen it since I've liked it a little more, and I'm at the point now where I like it a lot. I don't think it's a GREAT movie, but it's a very good one, and extremely underrated. Roger Avary's connection with Quentin Tarantino has turned out to be more of a hindrance than a help to him. 'Killing Zoe' was frequently dismissed as just another Tarantino clone, which to me is unfair, because a) Avery actually wrote some of 'Reservoir Dogs', 'Pulp Fiction' and 'True Romance' (usually uncredited), and b) though the subject matter of 'Killing Zoe' is similar to say 'Reservoir Dogs', the approach is very different. And let's face it the heist-gone-wrong flick has a long history (the influence of 1950s crime classics 'Rififi', 'Bob Le Flambeur' and/or 'The Killing' on all subsequent variations of it cannot be underestimated), and Tarantino was building on an already established tradition. As well as that the hostage aspect of 'Killing Zoe' brings to mind 'Dog Day Afternoon' more than anything by QT. Anyway, I think this is an interesting movie. The violence is pretty blatant, but apart from that it is a subtle, character driven movie. Eric Stoltz ('Pulp Fiction') and Julie Delpy ('Before Sunrise') are both very good, especially in their first scene together, but the real stand out performance is by Jean-Hughes Anglade ('Betty Blue') who is outstanding. Anglade really makes the movie for me. 'Killing Zoe's reputation seems to be growing as the years go by, and now that the mid-90s Tarantino hype has died down it's about time it was judged on its own merits.",
         "Much hated by Tarantino-lovin' geeks who often haven't even bothered to see it, KILLING ZOE is a nasty and hilarious gem, lacking much of Quentin's trademark video clerk snottines n' know-it-all nerdy attitude. Combining elements of old French noir flicks with a true nihilistic slant, Avary's flick is a true avant-pop classic.",
         "A rough and sometimes sordid movie is a short way to summarize this film. It's about a no-nonsense gang of drugged-out French thieves whose bank robbery attempt backfires into a bloody mess. For those who object, be warned there are a fair amount of subtitles in here and a lot of f-words. This was a tough gang, and the lead characters are pretty grubby, they aren't really very likable people. I like Jean-Hughes Anglade's accent and I always like ogling Julie Delpy, although I've seen her look better. The city of Paris looked good with some nice shots in the beginning and at the end of the movie. Anglade, as the leader of the gang, was brutal but fascinating. My only complaint was the film was too sordid in spots (drugs, language and attitude). but overall, an entertaining crime film. It gets your attention and keeps it.",
         "i thought this film was absolutely brilliant, and only for one reason only, because of jean Hugues anglade. he is easily the best actor in the world and i would rank him in the same category as Robert De niro and Al pacino, in fact i think hes better!!! killing Zoe was a rather empty film i thought at times the relationship between Zoe and zed was weird, how could they really be in love when they hardly knew each other and he didn't even intervene when Eric threw her out of his apartment!!! thought that was strange, they should really have called Zoe by a different name as when you buy the movie you think that Julie delpy's character ''Zoe'' has a lot to do with the film but in fact she hardly features, because ''Zoe'' means ''life'' in Greek, so the title of the film just means ''killing life''! other than that i enjoyed killing Zoe souly because of anglade he truly steals the show, and is one of the most profound actors I've ever came across, the film should be seen to see him!!!! fabulous actor.",
         "This film is pretty much a masterpiece and not just another crime thriller made after Tarantino's success. Killing Zoe is Roger \"a friend of Quentin\" Avary's directing debut and it deals with a bank robbery which goes straight to hell after night of heavy drug and alcohol use. Two old friends (Eric Stoltz and Jean-Hugues Anglade) are the main characters of the film and their friendship seems to suffer pretty much during the robbery day.. I first saw this film about a year ago and then I thought that it was just an OK action pick with violence and great dialogue. I didn't see inside the film back then and now I'm very happy to have viewed it again. The main themes in Killing Zoe are friendship and things which can destroy it. There is also strong scene(s) concerning drug and alcohol addiction. *Some kind of spoilers coming* Zed thinks that his old friend Eric is his real friend and they are important to each other and can trust each other. Zed soon learns the horrific truth behind Eric and that he is real monster who perhaps has AIDS and is seriously hooked on heroin and other drugs. The end scene where Eric tells Zed that their friendship means nothing to him, is extremely shocking and surprising because throughout the film Zed seems to be important to Eric. In the end of Ringo Lam's magnificent City on Fire (Hong Kong) the main characters have developed a real friendship even though they are on the other side of the law, and the bad guy, Danny Lee, is really worried about his wounded partner, Chow Yun Fat. But in Killing Zoe, the friendship between the two lead men collapses and dies for ever. The director wants to make people to think about the importance of real friends and love between human beings. The drug taking sequence at night before the robbery is very intense and realistic with all the hallucinations and nausea. The dangers of drugs and other addictive substances come very clear during the infernal film. Even the right minded main character (Stoltz) is about to collapse to the dark side and the hallucinations are pretty disturbing and harrowing and won't leave you after the film has ended. *spoilers end* So, after second viewing, I found this film a very great and unforgettable experience which is definitely not just another \"art house violence\" flick. In fact, I prefer this as much as Reservoir Dogs, which has same kind of themes as Killing Zoe, but omits the drug content. But it is pretty sad to see that the final R-rated version doesn't look as Roger Avary wanted it to look. There are numerous scenes in which it is easy to see that those scenes were intended to be longer or more effective. I'm not talking only about violent scenes but also those hallucinations may have been stronger without the R restrictions. So I am waiting for the unrated DVD release to come from some label sometimes in distant future.. Highly recommended for fans of Quentin Tarantino, Peter Medak (Species 2 excluded!) and other interesting filmmakers of the 90's in this genre. 9/10",
         "Compared to the endless tiresome shoot-em-ups like the Schwarzeneggar--Stallone--Seagal type flicks, this movie shows style, class, and sensuality. A tense, edge-of-your-seat movie where for a change you DON'T know how it's going to end. The only flaw in the film is that it has a very low-budget quality with no real scenes outside in France, except at the very beginning at the airport. Everything else looks done in some studio with a few scenic shots tossed in, like a tv show that can't really go abroad and look authentic. But this movie is well worth renting--and beats 90% of the manufactured, formula plastic films next to it on the video shelf. An 8.5 out of 10.",
         "Killing Zoe is definitely an underrated film, which has never received recognition it deserves. Tarantino executive produced the film, but seeing as he has worked closely with writer/director Roger Avary before, most notably Pulp Fiction, we could assume he had a little more in put. Not wanting to take anything away from Avary of course, he is a fully accomplished film maker and this shows throughout Killing Zoe. The script is well crafted, the acting convincing and the framing all very amicable. However, whilst there is nothing bad to say about it, there is nothing to rave about either. The film ticks along nicely, and before you know it you're at the end. The dialogue doesn't snap quite as you would like it too and all the characters seem to be lacking any real urgency that you might expect considering a bank robbery being planned. All the same, this is a good crime thriller, and very much a part of the early nineties violence invasion. Worth checking out if you're a Tarantino fanatic, or if you really have nothing else to do.",
         "Killing Zoe, I would say, is a classic. I saw it in the English version and usually I really don't like subtitles. This movie made me reconsider this. From Prostitution, to drugs, to money, to betrayal, this movie has it all. With all of the Pulp Fictions and Jackie Browns out there, it is good to see a change of pace. Roger Avery has definitely stepped out of Tarantino's shadow and stepped up to the plate as a writer and Director. A lot of movies like this would have one or two big names, but this movie took on new-comers Eric Stoltz, Julie Delpy, and Jean-Hughes Anglade. By far, a movie that will be remembered. The only negative about this movie is that it didn't hit theaters in the US."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Davis-Films",
         "Live Entertainment",
         "PFG Entertainment"
      ],
      "summaries": [
         "Zed has only just arrived in the beautiful Paris and already he's up to no good. Having just slept with a call girl, he spends a night on the town with his dangerous friends. They all decide to rob a bank the following day. There's only one problem: Zed's call-girl, Zoe, just happens to work at the bank which is to be robbed!",
         "Eric Stoltz stars as Zed, an American safe-cracker, who arrives in Paris to help a childhood friend, Eric (Jean-Hugues Anglade), with a Bastille Day bank heist. Women, drugs, and madness collide as Zed slowly realizes Eric is a ticking time bomb whose instability threatens the job and the lives of all involved.",
         "An American vault-cracker ( Zed ) meets up with an old friend ( Eric ) in Paris. Eric and his gang have planned to raid the only bank in the city which is open on Bastille day. Zed is trapped in a situation beyond his control when heroin abuse, poor planning and a call-girl named Zoe all conspire to turn the robbery into a very bloody seige."
      ],
      "budget": 1500000
   },
   "movielensId": 482,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1993-10-01",
      "dvdReleaseDate": "2000-08-15",
      "directors": ["Roger Avary"],
      "runtime": 96,
      "movieId": 482,
      "title": "Killing Zoe",
      "mpaa": "NC-17",
      "actors": [
         "Eric Stoltz",
         "Julie Delpy",
         "Jean-Hugues Anglade",
         "Tai Thai",
         "Bruce Ramsay",
         "Kario Salem",
         "Salvator Xuereb",
         "Gary Kemp",
         "Martin Raymond",
         "Eric Pascal Chaltiel",
         "Cecilia Peck"
      ],
      "imdbMovieId": "0110265",
      "originalTitle": "Killing Zoe",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["fqGj6bWX_6o"],
      "plotSummary": "Zed (Eric Stoltz) is an American vault-cracker who travels to Paris to meet up with his old friend Eric (Jean-Hugues Anglade). Eric and his gang have planned to raid the only bank in the city which is open on Bastille day. After offering his services, Zed soon finds himself trapped in a situation beyond his control when heroin abuse, poor planning and a call-girl named Zoe all conspire to turn the robbery into a very bloody siege.",
      "tmdbMovieId": 507,
      "avgRating": 3.42535,
      "releaseYear": "1993",
      "numRatings": 2840,
      "posterPath": "/jAnpPlUUhBqztIfCfg3OKsTYMhu.jpg"
   }
}