{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "great depression",
            "id": 5571
         },
         {
            "name": "canary",
            "id": 7453
         },
         {
            "name": "based on memoir or autobiography",
            "id": 14641
         },
         {
            "name": "tuberculosis",
            "id": 159845
         },
         {
            "name": "marbles",
            "id": 171026
         },
         {
            "name": "elevator operator",
            "id": 171028
         },
         {
            "name": "bellboy",
            "id": 171036
         },
         {
            "name": "lock child",
            "id": 171039
         },
         {
            "name": "living alone",
            "id": 171040
         },
         {
            "name": "st. louis",
            "id": 171043
         },
         {
            "name": "against the odds",
            "id": 171051
         },
         {
            "name": " epileptic seizure",
            "id": 171052
         },
         {
            "name": "understanding",
            "id": 171054
         }
      ],
      "imdb_id": "tt0107322",
      "video": false,
      "title": "King of the Hill",
      "recommendations": [
         52856,
         27817,
         103413,
         39327,
         114994,
         16550,
         27141,
         49803,
         47866,
         110083,
         253496,
         123067,
         53104,
         18408,
         15366,
         34615,
         36709,
         38509,
         18197,
         12677
      ],
      "backdrop_path": "/6OaPWEbq9Luw5sB51n8ZfzJKET5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Aaron Kurlander",
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d887",
               "name": "Jesse Bradford",
               "profile_path": "/irD0iVNTmR0kEkVTZmKTuZejbGH.jpg",
               "id": 17772,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mr. Kurlander",
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d88b",
               "name": "Jeroen Krabbé",
               "profile_path": "/A5Mks6zi6Xzt9A8fxBWc3wdlvhx.jpg",
               "id": 1924,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mrs. Kurlander",
               "gender": 1,
               "credit_id": "52fe454c9251416c9102d88f",
               "name": "Lisa Eichhorn",
               "profile_path": "/1yvBmX8G8AX6pVIJvvzhfnqtwcm.jpg",
               "id": 28950,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Miss Mathey",
               "gender": 1,
               "credit_id": "52fe454c9251416c9102d893",
               "name": "Karen Allen",
               "profile_path": "/6TzVbX52cAOqe9LH6GZ5xutbW5G.jpg",
               "id": 650,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Mungo",
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d897",
               "name": "Spalding Gray",
               "profile_path": "/xXUGK1bQRi6vBT8Xu0NsShIEKRe.jpg",
               "id": 8978,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "52fe454c9251416c9102d89b",
               "name": "Elizabeth McGovern",
               "profile_path": "/egt1d836NcYDTeiokz5Im8gHU4r.jpg",
               "id": 4513,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Lester",
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d89f",
               "name": "Adrien Brody",
               "profile_path": "/zvMslH1C8xmEBpGgDsdzL797Rv.jpg",
               "id": 3490,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Christina Sebastian",
               "gender": 1,
               "credit_id": "52fe454c9251416c9102d8a3",
               "name": "Katherine Heigl",
               "profile_path": "/jK74TisptrF6dg6E1V9DOEZacRz.jpg",
               "id": 25541,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Ella",
               "gender": 1,
               "credit_id": "52fe454c9251416c9102d8bf",
               "name": "Amber Benson",
               "profile_path": "/hcatQaJNb2lAcBukfn6IOaxtl5F.jpg",
               "id": 35468,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Elevator Operator",
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d8c3",
               "name": "Lauryn Hill",
               "profile_path": "/2HinYxGXU0bj7DJrOaB0iVwYgpS.jpg",
               "id": 4244,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Front Desk Clerk",
               "gender": 2,
               "credit_id": "56d1f58ac3a3681e4400b08d",
               "name": "David Jensen",
               "profile_path": "/2ZcpeU1Iu1wpQfxltdsjO5da8cB.jpg",
               "id": 60875,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Woodbine Waiter",
               "gender": 2,
               "credit_id": "56d1f711c3a3681e3e00b133",
               "name": "Joseph Moynihan",
               "profile_path": "/il51E2WwTqyLosazzZICOoxIDOH.jpg",
               "id": 1583720,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d883",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d8a9",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d8af",
               "name": "Elliot Davis",
               "profile_path": null,
               "id": 5506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d8b5",
               "name": "A.E. Hotchner",
               "profile_path": null,
               "id": 191678,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d8bb",
               "name": "Steven Soderbergh",
               "profile_path": "/dxdMRsAosaGlMRd7EMmm9lrXXsW.jpg",
               "id": 1884,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.440622,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34024,
      "vote_count": 43,
      "budget": 0,
      "overview": "Based on the Depression-era bildungsroman memoir of writer A. E. Hotchner, the film follows the story of a boy struggling to survive on his own in a hotel in St. Louis after his mother is committed to a sanatorium with tuberculosis. His father, a German immigrant and traveling salesman working for the Hamilton Watch Company, is off on long trips from which the boy cannot be certain he will return.",
      "similar": [
         120467,
         149870,
         15788,
         52229,
         42659,
         188781,
         41296,
         95362,
         152039,
         193712,
         259940
      ],
      "original_title": "King of the Hill",
      "runtime": 103,
      "poster_path": "/HzTiZWfb0bdyJoM7Et6XCgfi9X.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nlG4JEjJ7SAFDehgIVvHFBPW23y.png",
         "name": "Gramercy Pictures",
         "id": 37,
         "origin_country": "US"
      }],
      "release_date": "1993-08-20",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "When the world turns upside down, the trick is coming out on top.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steven Soderbergh"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "A.E. Hotchner",
         "Steven Soderbergh"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107322/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0MzM0NjM3N15BMl5BanBnXkFtZTcwODgzMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jesse Bradford, Jeroen Krabbé, Lisa Eichhorn | See full cast and crew »"],
      "reviews": [
         "Over the years this little gem of a film has become a personal favourite. I revisit it continuously, I enjoy showing it to someone who never heard of it and it never fails. The emotions are renewed and reinvigorated with each viewing. Jesse Bradford is simply phenomenal and so is Adrian Brody, yes him, \"the kissing pianist\" in a remarkable early performance. The face of Karen Allen, as the teacher, listening to Jesse Bradford read his tall tale, profoundly aware that she has someone truly special in her class, is so beautiful that goes in an out of my memory bank more often than the names of some of my closest relatives. Spalding Gray and Elizabeth McGovern's characters deserve a full movie of their own. Lisa Eichhorn's tender fear of having to leave her children behind is just another of the ravishing notes of this stunning film. If you haven't seen it. Give yourself the pleasure. You are going to love every little bit of it.",
         "Without a doubt, I would argue King of the Hill to be the best American film of the 1990's above any other American film you can think of. The subtlety of the performances and the evocative production design pull you into the carefully constructed world of Aaron Kurlander, building the right level oh humour and drama, and never allowing it's self to become bogged down with tacky sentimentality. Steven Soderbergh really out-did himself with this one, and it's by far the best thing he's done, you can forget the overrated, over-hyped Oscar nabbing rubbish of Traffic, this showed a young director willing to experiment with tried and tested film-making techniques and find the right visual language for the film. King of the Hill is a film that is so deliberately paced, and so elegantly put together, that at times it's as though your not watching an American film at all, there is such a European atmosphere that it seems out of place with some of the other U.S. film released in the same year (Jurassic Park, Mrs Doubtfire and Cliffhanger being just three of the top grossing movies of \u009193). So is it any wonder that King of the Hill failed to set the box office alight with popcorn based seat fillers like that, I mean, who wants to see the story of a young boy coming of age under the harshest conditions when you can see Robin Williams vacuuming in drag to the sounds of Aerosmith. Yeah, sounds like a safe bet for all the family. But King of the Hill is such a good movie, that the hard-to-describe plot should be overlooked, and people should just give it a chance, they will be so moved by Aaron's plight, and so drawn in by Soderbergh's direction (coupled with Elliot Davis' composition heavy cinematography) and detailed production design that they will not be able to pull themselves away. Added to that the great acting from the entirety of the eclectic cast, that includes Jeroen Krabbe, Spalding Grey, Elizabeth McGovern, Karen Allen, new comers Jesse Bradford and Cameron Boyd, and (then) unknowns Adrien Brody (who was great as Ritchie in Spike Lee's Summer of Sam) and Roswell star Katherine Heigl. Soderbergh's handling of his young actors is nothing short of genius, their characters and characterization is multi-layered to the extent that we never doubt that their characters are real. King of the Hill is an unbelievable film that, as I have already said, is (in my opinion) the greatest American film of the nineties and should be seen by everyone who is a fan of not just intelligent cinema, but film lover's in general. And it's about time the film got some kind of proper video and/or DVD release, as it's unavailability is scandalous. 10/10",
         "I first rented King Of The Hill (1993) back in 1994 and was delightfully surprised at the great quality of the film. First off I am not a fan of Steven Soderbergh and only slightly liked Sex Lies and Videotope. I always seem to rent and see his movies though, hoping that he could return to the form of moviemaking that made this movie. But apparently that is not the case. I don't know how he did it but this is a great film and should be seen by a large audiance. The acting, Writing, direction, and cinemetography are all top notch in this story about a boy making his way through the depression era 1930's. Jessie Bradford turns in an excellent performance as Aaron Kurlander the kid who has to keep his wits at all times. The casting of this film was excellent and even includes a great early performance by Adrien Brody who plays young Aaron's suregate big brother that lives down the hall. A true can't miss for anyone that likes fine cinema.",
         "Not to be confused with that T.V. show thing. King of the Hill is one of the most vivid film experiences I remember as a child. No, I wasn't lucky enough to catch it on the big screen. Instead I rented it and watched it one night and was totally absorbed into it. Jesse Bradford, despite his current film career, did a damn fine job as Aaron Kurlander, a young boy struggling to survive during the Great Depression. He uses his wits and imagination to make the best out of the worst of times. Bradford was 12 or 13 years old at the time he filmed the movie and as an actor it must've been a heavy burden. The main focus is on him as its his story and shown from his point of view. Bradford doesn't let the ball drop once and more than carries his weight. It's another one of those rare great child performances. Jeroen Krabbé plays Aaron's (Bradford) father who is a struggling traveling salesman. Lisa Eichhorn plays his mentally unstable mother who goes in and out of various institutions. Rounding out the cast of the interesting people that fill Aaron's life are Karen Allen as the warm and understanding school teacher, Cameron Boyd his younger brother, Adrien Brody as the \"cool\" big brother figure, John McConnell as the fat and troublesome patrol cop, Elizabeth McGovern as a prostitute working in the same hotel Aaron lives at, and Spalding Gray as her creepy, manipulative, and suicidal pimp. So yes the film is filled to the brim with worth while supporting players adding so much depth and dimension to Aaron's world. Soderbergh had double duty as writer and director. He scripted the novel by A.E. Hotchner and I think it's his best film. As I mentioned it takes place during the Great Depression in St. Louis Missouri. Watching Aaron fight for survival is one of the best charms of the film. It's done realistically. The audience is able to believe his methods. There's a nice mix of drama, dark somber humor and dire situations, but there's also enough humanity and hope in the movie to send an uplifting message. For those who enjoy Andy Dufresne's message of hope and persaverence in the more widely known The Shawshank Redemption, seek out this film. I would argue it's even superior to Frank Darabont's movie. It's one of the great and underrated modern films and ranks with the best using the Great Depression setting. Sadly King of the Hill isn't released yet on DVD and it's not very likely that you'll be able to find it at your local video store. Especially if all you have is the local communist Blockbuster near you. Anyway, King of the Hill should be regarded and known far more highly than what it is. It's a sin for a movie this great to not get its due. Grade: A+",
         "I can recall first seeing \"King of the Hill\" shorty after its initial release when I wasn't much older than the main character, Aaron (Jesse Bradford, who displays the natural swagger of a young George Clooney here). I was totally enthralled by the story, and this was one of the pieces that ushered in my complete love for and eerie obsession with Depression Era America. Steven Soderbergh as a director over the years has been wildly all over the map traversing genres and styles from top-notch cracker-jack indie flicks (the superb \"Limey\") to vapid star-studded populist entertainment (the \"Oceans\" series) to entertaining star vehicles (the excellent \"Erin Brockovich\") to overblown misguided message movies (\"Traffic\") to Kubrickian quandaries (the unfairly maligned \"Solaris\"). In 1993, still in his formative early years, he hit all the right notes with his vividly detailed and heartbreaking tale of a young boy (Bradford) abandoned in a sleazy hotel room on the edge of a Hooverville in 1933 St. Louise by his flaky salesman father, consumption riddled mother, and little brother who got shipped off to live with relatives so he wouldn't starve to death. The boy lies, steals, woos girls and wins academic awards at school propelled only by his keen wit and innate will to survive. Soderbergh brilliantly abandons almost all sentimentality (the exchanges between the brothers are heartfelt but raw, between mother and son tragically subdued, and between father and son frightfully cold yet honest) and views not the actions of the characters through the lens of our modern moral codes, but through the lens of the era in which the characters survived. Special note has to be given to the cinematography, which in lesser period pieces can so easily succumb to stylish excess. The film looks real and puts you right there in the middle of this American quagmire. There's also one amazingly rendered shot of a traffic cop holding up a squealing street urchin by the ear after capturing the boy stealing an apple that is so painstakingly lighted and framed that it serves as the complete flip-side of your classic Norman Rockwell painting from the same era. Viewing this film recently on cable, I was even more transfixed than the first time over thirteen years ago. There's also delight to be found in seeing Oscar winner Adrien Brody in his first major role as Aaron's \"big brother\" role model, and Grammy winner Lauryn Hill in a nice bit part as a sympathetic gum-chewing elevator operator. Although historically little seen, this film has been universally lauded, and as the early masterwork of an Oscar winning director, it's a crime that there has been no DVD release.",
         "Everything works with this one. Really interesting and heart-rending story, great characters, fine sets, lighting, costumes, music, excellent acting. Someone compared this to The Pianist and I see what he means. It reminds me of a movie like Paper Moon, but whereas I disliked the Tatum O'Neal character (stealing from those who could not afford to lose the money), I really like this boy. I also think the pangs of missing family, what it's like to be a child, are more realistically done in this movie than in Paper Moon. I really can't imagine anyone who wouldn't like this - it's very mainstream, very good - and in contrast to those who say this reminds them of some European movie, I would say it's as American as apple pie. I highly recommend it. (It also helps that Lisa Eichorn is my favorite living actress - and Karen Allen would be in the top ten).",
         "Beautifully shot and played, this tale of a young boy coping with the depression better than his father (who has left him alone in seek of work) trips along nicely, detailing the superkid's adventures in thirties America in rich colours and lavish period detail. Although it could be accused of overdoing the rose-tinted spectacles, it's a warm and mellow look at a dark and grimy time, and includes enough unpleasantness to keep that fact in the viewer's mind. Although the hotel-dwelling salesman living on the edge of subsistence is not a new theme, any more than that of the capable child flourishing in adversity, Soderberg brings a timeless quality and a steady, gentle mood to this piece, making it more about the hearts of the people than the tragic times which are displayed. Jesse Bradford, as the central child, and Adrien Brody as his older friend, really shine. Nice.",
         "As Soderbergh has risen to the stratosphere of Hollywood enablers, he seems to have replaced character with something else -- odd collections of in-jokes, hand ringing and Oscar-worthy speeches. If he's connected with the pulse of America, he has done so by losing the pulse of his stories. Even his small anti-commercial films seem to have lost their human touch. Oh, they're fun, and technically masterful all -- but looking back only this one suggests the small Satyajit Ray style humanist Soderburgh might have become if he didn't have the mega-hit touch. A part of me mourns the loss, though another part of me imagines how horribly treakly Erin Brockovich would have been with any other helmer. I've spent a lot of good hours watching his works, but only a couple great hours, and this 1 hour and 43 minutes of greatness",
         "This is a beautiful movie about an enterprising young man who survives various hardships during the depression. It has a bitter edge but isn't excessive and brings back tales of my grandmother's of how her family coped during the depression. My grandmother's parents were far more functional than the frail ill mother and the traveling salesman father who basically abandons his child to work out of state. I agree with other comments it hardly seems American because it is so deep without smashing the hammer down on our heads. Even though it is harsh I think it is suitable for older children if nothing more than an abject lesson about how real and difficult life really was. The irony is that America still exists to a lesser degree we just don't see it in the movies or on TV.",
         "Based on A.E. Hotchner's memoirs, writer/director Steven Soderbergh's 1993 adaptation of KING OF THE HILL (KofH) is the poignant, often dark, but ultimately uplifting story of 12-year-old Aaron Kurlander (Jesse Bradford, who comes across as sensitive and resilient at the same time), whose family struggles to get by in St. Louis, Missouri during The Great Depression. Like many of their neighbors, the Kurlanders can barely hold onto their cheap, shabby hotel room, though they do their best to find work and keep up a facade of doing well. Aaron contributes to the charade by telling his classmates wild yet convincingly-told stories of the glamor of his parents' lives as spies and archaeologists hobnobbing with the likes of Charles Lindbergh. Despite the Kurlanders' best efforts, they're slowly pulled apart when Aaron's traveling salesman dad (Jeroen Krabbe) can't make enough money to feed everyone. Soon Aaron's little brother Sullivan (the appealing Cameron Boyd, who looks strikingly like a little-boy version of the Olsen twins back in their FULL HOUSE days) is sent to live with relatives for the time being; Mom (Lisa Eichhorn) has TB, eventually going to a sanitarium; and finally Dad finds a job as a traveling watch salesman in Oklahoma, leaving Aaron to fend for himself and dodge the mean hotel porter to keep from being locked out of the family's apartment. Aaron tries all kinds of money-making schemes so he can bring his family back home, but it seems like God or Fate or whoever is in charge of KotH's universe insists on bitch-slapping the kid every step of the way. A rich, sympathetic classmate (who doesn't know Aaron's broke because our hero is too proud to admit it) gives Aaron canaries to breed in order to sell them to the pet shop, but when the canaries are born, they're all female, and female canaries don't sing, so all Aaron can get is 50¢ for the lot of them. A pre-PIANIST Adrien Brody, about 19 or 20 during filming, is a raffish presence as Lester, the juvenile delinquent down the hall with a heart of gold and a brotherly attitude towards Aaron. Lester tries to include the kid in jobs such as caddying for rich golfers, but Aaron tees them off by losing the ball in the ball-washing doohickey. Aaron tries to be kind to their neighbor Ella (Amber Benson), a sickly but sweet young girl, but that backfires when she gets so nervous dancing with him that she has an epileptic fit. When Aaron gets a medal during his graduation ceremony (nice bit with Lester there to cheer as Aaron's name is called, what with the Kurlanders being scattered all over the country), even that bit of joy is snatched from him as he overhears jealous classmates whispering that he only got the medal because the school authorities know he's poor and feel sorry for him (yeah, it couldn't possibly be because Aaron gets the best grades and writes imaginative stories and essays that blow those over-privileged brats out of the water). Over the course of KotH, just about everyone Aaron cares about is either sent away, moves away, dies, or gets arrested. Jeez, if it wasn't one thing, it was another! Interestingly, it seems like every time Aaron has an emotional upheaval, the film becomes more beautiful to look at, thanks to Elliot Davis' golden-hued photography, and yet the film's beauty doesn't cheapen or sentimentalize the painful events our young hero must live through. Aaron and the film's other good guys are kind-hearted, unself-pitying, and earnest enough that I was rooting for them even as I groaned to myself, \"Good grief, isn't this poor kid ever gonna catch a break?\" Much like the final reel of THE PIANIST, when the resourceful Aaron's plans to reunite his family finally succeed and life becomes good again, it's as much of a relief to us viewers as it is to the Kurlanders. Soderbergh's adaptation of Hotchner's life story often slathers the misery on so thick, I was still afraid something else might go horribly wrong for our beleaguered hero at the last minute. (For instance, as little brother Sullivan jumps up and down on his new bed, I half-expected him to accidentally bounce off the bed and break his neck. Don't worry, he doesn't. :-)). I came away with the feeling that Aaron would never again take the good things in his life for granted. The delicate balance of drama and humor in Soderbergh's fine writing and direction, as well as superb acting from an ensemble that also includes Spalding Gray, Elizabeth McGovern, Karen Allen, and Lauryn Hill -- yup, that Lauryn Hill (who later appeared with Brody in the 1998 indie drama RESTAURANT) -- makes KotH a little gem well worth seeking out on TV, especially since it's still not on DVD but has been on the HBO and Cinemax lineups lately as of this writing. If you like fact-based stories about young people overcoming obstacles, or if you want to catch folks like Brody, Bradford, or a very young Katherine Heigl in memorable early roles, check out KotH."
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Wildwood Enterprises",
         "Bona Fide Productions"
      ],
      "summaries": [
         "A boy whose mother is forced into a sanitarium and father gets a job as a traveling salesman. The boy fends for himself in a seedy SRO hotel.",
         "A young boy struggles on his own in a run-down motel after his parents and younger brother are separated from him in 1930s Depression-era Midwest."
      ],
      "budget": 8000000
   },
   "movielensId": 483,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-08-20",
      "dvdReleaseDate": null,
      "directors": ["Steven Soderbergh"],
      "runtime": 103,
      "movieId": 483,
      "title": "King of the Hill",
      "mpaa": "",
      "actors": [
         "Jesse Bradford",
         "Jeroen Krabbé",
         "Lisa Eichhorn",
         "Karen Allen",
         "Spalding Gray",
         "Elizabeth McGovern",
         "Adrien Brody",
         "Katherine Heigl",
         "Amber Benson",
         "Lauryn Hill",
         "David Jensen",
         "Joseph Moynihan"
      ],
      "imdbMovieId": "0107322",
      "originalTitle": "King of the Hill",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["f3h-vn29UJM"],
      "plotSummary": "Based on the Depression-era bildungsroman memoir of writer A. E. Hotchner, the film follows the story of a boy struggling to survive on his own in a hotel in St. Louis after his mother is committed to a sanatorium with tuberculosis. His father, a German immigrant and traveling salesman working for the Hamilton Watch Company, is off on long trips from which the boy cannot be certain he will return.",
      "tmdbMovieId": 34024,
      "avgRating": 3.76892,
      "releaseYear": "1993",
      "numRatings": 621,
      "posterPath": "/HzTiZWfb0bdyJoM7Et6XCgfi9X.jpg"
   }
}