{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0107413",
      "video": false,
      "title": "Life With Mikey",
      "recommendations": [
         117553,
         36929,
         33695,
         40688,
         249391,
         20551,
         13203,
         48287,
         35645,
         12475,
         39128,
         33657,
         20473,
         41589,
         8986,
         22590,
         32013,
         19809,
         15170,
         54768
      ],
      "backdrop_path": "/eJR91XfNz1Bx0SMILVQ02c25iEI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael Chapman",
               "gender": 2,
               "credit_id": "52fe460bc3a36847f80e9035",
               "name": "Michael J. Fox",
               "profile_path": "/2CwTJuL6UHqPJ82oh8WpWUw8Q0V.jpg",
               "id": 521,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Angie Vega",
               "gender": 1,
               "credit_id": "52fe460bc3a36847f80e903f",
               "name": "Christina Vidal",
               "profile_path": "/7Th8N0AymiBn5ROxBjPekM8SKMd.jpg",
               "id": 61904,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ed Chapman",
               "gender": 2,
               "credit_id": "5303fa5592514104c7011575",
               "name": "Nathan Lane",
               "profile_path": "/2eB01W4VURqihttVdewfhfhhCwW.jpg",
               "id": 78729,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Brian Spiro",
               "gender": 2,
               "credit_id": "5303fa7c92514104b800cc9a",
               "name": "Victor Garber",
               "profile_path": "/xFgPEfVEqz7Li2xoyjRPEKCjCrH.jpg",
               "id": 8536,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Barry Corman",
               "gender": 2,
               "credit_id": "5825d9e4c3a368361400a296",
               "name": "David Krumholtz",
               "profile_path": "/5171elOp1qFxf9c8DkpeyhHBB6d.jpg",
               "id": 38582,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Geena Briganti",
               "gender": 1,
               "credit_id": "5303fa6192514104b500c8b7",
               "name": "Cyndi Lauper",
               "profile_path": "/4fMFl40wCdIEjlajmdpqqPJkhMQ.jpg",
               "id": 87255,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Herr Corcoran",
               "gender": 2,
               "credit_id": "5825d9f29251417b2c00a6fd",
               "name": "David Huddleston",
               "profile_path": "/6cXqGzHB0zJautJVPCtbEsCtsCQ.jpg",
               "id": 1232,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe460bc3a36847f80e903b",
               "name": "James Lapine",
               "profile_path": "/vVA3lD2O6kDxAxGaeW1AQHLA83o.jpg",
               "id": 90037,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56b28bde925141034b000ef2",
               "name": "William Ivey Long",
               "profile_path": null,
               "id": 60134,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5967c50ac3a36879cb00662d",
               "name": "Marc Lawrence",
               "profile_path": "/ayItx1leDQbNklqX9wJbPGCD7Yk.jpg",
               "id": 18323,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.910748,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42580,
      "vote_count": 29,
      "budget": 0,
      "overview": "Michael Chapman was once a child TV star. But when he grew up, he couldn't get work. So he and his brother, Ed start their own talent agency that specializes in child acts. They can't seem to find the next big thing and they have to deal with another agency who's not above bribery to get the kids to sign with them. One day Michael meets a girl named Angie and she's a real spitfire. Michael thinks she could be what they are looking for. Problem is that she has a big chip on her shoulder.",
      "similar": [],
      "original_title": "Life With Mikey",
      "runtime": 91,
      "poster_path": "/yFyDtoGn1XYnDi9KCTouisLKWrd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1993-06-04",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "He's a talent agent. She's a thief. Looks like they've already got something in common.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Lapine"],
      "runtime": 91,
      "synopsis": "Michael Chapman was a star before, his Life with Mikey TV was famous but as his age grew, people began to lose interest on Michael Chapman and that TV. Michael decided to resign and become a kid star. He began to request kids to perform to find a kid to develop that kid. But the kids are very disappointed. Until one day, Michael went out and got his wallet stolen by a 9yr girl Angie Vega (Vidal) and Michael found Angie's talents. Michael decided to bring her to his own boss to interview, Angie successfully got the job and Michael got mad in lift...but angie also steals that makes michael getting headache... Angie was caught one day due to stealing in a dept store. How would michael improve Angie from stealing... (This movie has Nathan Lane, Michael's young sister Kelli Fox, Christina Vidal.)",
      "writers": ["Marc Lawrence"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107413/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1NTk2ODMwOV5BMl5BanBnXkFtZTcwOTY4NTUyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael J. Fox, Christina Vidal, Nathan Lane | See full cast and crew »"],
      "reviews": [
         "This is easily one the 5 best movies I've seen in my life and all the comments here are so critical. Such a warm and wonderful movie.Except for the girl everyone in the movie fits their character absolutely perfectly,and the conclusion is the best part of the movie!I guess the ones who critisized the movie would have never understood in the first place.Well if you ask me,this is a must,must,must,must,must see.",
         "This is a great movie and michael J. Fox does excellent in this role! This is the movie that marked the beginning of the career of christina vidal, although some others may not agree I thought she did great. As the little tough girl from the streets of brooklyn she does an excellent job. This movie is something I bought after seeing this on HBO and to me is a classic. This is definitley worth a look and I give it 4 1/2 to 5 out of 5 stars. One thing to know about this movie. Don't think about it. JUST WATCH!",
         "except this movie was great! It was funny and the acting was great! Michael J Fox was awesome.....and for Christina Vidal's first performance she didn't do too bad either! I would definitely recommend this movie to any Michael J Fox fans or anyone just looking for a good laugh!",
         "Some people say that it's like a category-3 film but I don't agree...in my country, it's shown in \"Children Festival\"...it's funny than anyone had expected. Please don't misjudge this film by saying it as a Category-3 film...both kinds are different as Life With Mikey is suitable for kids but a Category-3 film isn't...",
         "I've always enjoyed Michael J. Fox in \"Family Ties\" and this film is perfect entertainment for fans of that show. Along with Fox, we have the cute, talented Christina Vidal Who for some reason we don't see anymore. She is perfectly poised in her scenes with Fox. And quite wonderful as we see her transform from a street-smart toughie, into this warm-hearted little girl. All in all, great family entertainment with a great ending and a lot of good laughs. 3 out of 4 stars.",
         "I haven't watched this movie in a long time, but it still holds clear in my mind: Michael J Fox is a child actor turned talent agency rep. The gist is that they are going down the tubes and it will take a definite miracle to pull things back together. Fox is charming to the last, and also brings light to an issue that was becoming more and more prominent in the early 90's- smoking and trying to quit. Nathan Lane was very funny and sociable with Fox in this film, and Angie was a devious, but reliable kid. I didn't realize Cyndi Lauper was Geena until I wrote this summary. I've heard about her being a celeb, but I didn't realize I had a film with her in it.",
         "Michael J. Fox, Nathan Lane, Cyndi Lauper, and Christina Vidal star in this really, really funny movie. Michael J. Fox is Michael Chapman, a washed up actor that starred in his own television show as a child. Now he's a children's talent agent looking for that big break. Nathan Lane is his brother who's working together with Michael at Chapman & Chapman Talent Agency. Cyndi Lauper is funny with her Brooklyn accent as their secretary. Christina Vidal is Angie Vega, a wise-talking con artist who could be Michael's only break at any type of future. This movie is great and everybody in the family will enjoy this.",
         "Michael J. Fox plays Michael Chapman, who once upon a time was a wise-cracking child star on a situation comedy called \"Life With Mikey.\" Now in his thirties and on the skids, Michael makes personal appearances at grand openings of hamburger stands, and runs an unsuccessful talent agency that specializes in kids with his brother Ed (Nathan Lane). The agency's only successful client is Barry Corman (the great Jewish actor, David Krumholtz), a 14 year old with an attitude who is known as \"the cereal king\" for his appearances on television commercials. Ed is trying to talk Michael into closing the agency and Barry is threatening to go elsewhere when a sprightly 10 year old reprobate named Angie (Christina Vidal) tries to pick his pocket. When Angie delivers a heart rendering tale of questionable honesty about being an orphan from Queens, Michael realizes that Angie would be perfect for a Sunburst Cookie commercial. She clicks in the commercial, and both her career and the agency's soar. In the meantime, Angie movies in with Michael, and as they bond, Michael realizes how to act like an adult and Angie realizes how to act like a child. I liked Life With Mikey, I know its nothing new as a plot, but still funny with the great Fox and entertaining Lane heading the cast.",
         "This is an underrated movie with one of Fox's most subtley comical moments. The irony was not lost watching Fox portray an ex-sitcom star. Watching Fox as a smarmy, sleazy agent was so wonderfully different from anything he had done up to that point. The movie was made for watching after sleeping in over half the day on Sunday. Also, a great turns by Nathan Lane, who I didn't recognize in the role for many years, and a young David Krumholtz who is going to ascend the throne as the next John Turturro.",
         "Michael J. Fox's considerable on screen charm was used to good advantage in LIFE WITH MIKEY, in which he played the former child star of a sitcom called \"Life with Mikey\" who now is partnered with his brother (Nathan Lane) in running a children's talent agency, even though his brother does most of the work. Things look up when Mike literally bumps into 10-year old shoplifter (Kristina Vidal)who Mike sees as a possible gold mine for their agency and does manage to get her a lucrative commercial deal as cookie salesgirl. This movie is watchable thanks to a charming performance by Fox, who imbues his own experience as a former child star into this character and this performance. It's very sad whenever you watch Mike go into one of his stories about his days on the sitcom and how whoever he's sharing it with looks completely bored. Lane offers comic relief as Mike's brother and Cyndi Lauper steals every scene she is in as the agency's receptionist. There are also some laugh-out-loud hysterical sequences of children with varying levels of talent auditioning for the agency. Between these scenes and Fox's performance, this film can hold your interest."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Touchstone Pictures"],
      "summaries": [
         "Michael Chapman was once a child TV star. But when he grew up, he couldn't get work. So he and his brother, Ed start their own talent agency that specializes in child acts. They can't seem to find the next big thing and they have to deal with another agency who's not above bribery to get the kids to sign with them. One day Michael meets a girl named Angie and she's a real spitfire. Michael thinks she could what they are looking for. Problem is that she has a big chip on her shoulder.",
         "Michael J. Fox stars as a child actor who has grown up, and grown out of his popularity. He now runs a talent agency with his brother, specializing in child acts, trying to discover the next child star. He gets more than he bargained for when he recruits a child pickpocket to be his next \"star.\""
      ],
      "budget": 0
   },
   "movielensId": 486,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-06-04",
      "dvdReleaseDate": "2003-04-08",
      "directors": ["James Lapine"],
      "runtime": 91,
      "movieId": 486,
      "title": "Life With Mikey",
      "mpaa": "PG",
      "actors": [
         "Michael J. Fox",
         "Christina Vidal",
         "Nathan Lane",
         "Victor Garber",
         "David Krumholtz",
         "Cyndi Lauper",
         "David Huddleston"
      ],
      "imdbMovieId": "0107413",
      "originalTitle": "Life With Mikey",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["niJhC06sv1g"],
      "plotSummary": "Michael Chapman was once a child TV star. But when he grew up, he couldn't get work. So he and his brother, Ed start their own talent agency that specializes in child acts. They can't seem to find the next big thing and they have to deal with another agency who's not above bribery to get the kids to sign with them. One day Michael meets a girl named Angie and she's a real spitfire. Michael thinks she could be what they are looking for. Problem is that she has a big chip on her shoulder.",
      "tmdbMovieId": 42580,
      "avgRating": 2.69332,
      "releaseYear": "1993",
      "numRatings": 644,
      "posterPath": "/1SXdMpxVh8KFxZQRXxZaeZmVkEl.jpg"
   }
}