{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lightning",
            "id": 952
         },
         {
            "name": "jack",
            "id": 184671
         }
      ],
      "imdb_id": "tt0110353",
      "video": false,
      "title": "Lightning Jack",
      "recommendations": [
         27993,
         2612,
         26603,
         22976,
         11504,
         34309,
         20339,
         29973,
         2620,
         9057,
         26261,
         15128,
         69007,
         21433,
         20307,
         11858,
         18856,
         11310,
         34379,
         24073
      ],
      "backdrop_path": "/dOTAhBN9wOuZtJiWooIsRix76af.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lightning Jack Kane",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e017551",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lana Castel",
               "gender": 1,
               "credit_id": "52fe443cc3a368484e017555",
               "name": "Beverly D'Angelo",
               "profile_path": "/8fYQIA8dAaA4GOTxOFSKIvTqzi.jpg",
               "id": 821,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ben Doyle",
               "gender": 2,
               "credit_id": "52fe443cc3a368484e017559",
               "name": "Cuba Gooding Jr.",
               "profile_path": "/yu8Q3ImFu3RJne585jjgeQO2Boo.jpg",
               "id": 9777,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "U.S. Marshal Dan Kurtz",
               "gender": 2,
               "credit_id": "54e62965925141220100036e",
               "name": "Pat Hingle",
               "profile_path": "/bW8alHCKEK0UOJjoZwjwwH7T0ga.jpg",
               "id": 3798,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Marcus",
               "gender": 2,
               "credit_id": "54e6297892514121f80003b4",
               "name": "Richard Riehle",
               "profile_path": "/fFFjfOX7BUsfBQQP54K8QEkkEC2.jpg",
               "id": 18262,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mr. Doyle",
               "gender": 2,
               "credit_id": "54e6298ac3a3685fe20003ee",
               "name": "Frank McRae",
               "profile_path": null,
               "id": 1735,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "John T. Coles",
               "gender": 2,
               "credit_id": "54e62996c3a3685fe5000395",
               "name": "Roger Daltrey",
               "profile_path": "/apigc7k7idJFQiostoJ570AKRJJ.jpg",
               "id": 47096,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Sheriff",
               "gender": 2,
               "credit_id": "56083bd29251411adb0001bc",
               "name": "L.Q. Jones",
               "profile_path": "/jhPsFq7qYT2QKc4FO70fqxgfpXs.jpg",
               "id": 8262,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Schneider",
               "gender": 2,
               "credit_id": "56083bf9c3a368121100609b",
               "name": "Roy Brocksmith",
               "profile_path": "/2mLWMlroPa18WsH1QZtiSBJbhYo.jpg",
               "id": 12888,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Pilar",
               "gender": 1,
               "credit_id": "56083c40925141305e00541c",
               "name": "Kamala Lopez",
               "profile_path": "/64hT67cku1yNXtchgzKZhWSmZuu.jpg",
               "id": 84476,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe443cc3a368484e01755f",
               "name": "Simon Wincer",
               "profile_path": "/wikOUmNuvWJHcOU8EHjFHXUhafQ.jpg",
               "id": 18254,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "560839d79251416bf00003d9",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "560839ee9251416bf00003e0",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56083a8fc3a368121100606c",
               "name": "Greg Coote",
               "profile_path": null,
               "id": 71192,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56083ac09251417a45002a19",
               "name": "Bruce Rowland",
               "profile_path": null,
               "id": 76200,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "56083af49251416bf00003ed",
               "name": "David Eggby",
               "profile_path": "/6NUKQYAcB5ql7xXoXVeHG4Jk0O8.jpg",
               "id": 28240,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "56083b4b9251411adb0001a1",
               "name": "O. Nicholas Brown",
               "profile_path": null,
               "id": 16593,
               "department": "Editing",
               "job": "Dialogue Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 3.653027,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 22317,
      "vote_count": 47,
      "budget": 0,
      "overview": "Lightning Jack Kane is an Australian outlaw in the wild west. During a bungled bank robbery he picks up mute Ben Doyle as a hostage. The two become good friends, with Jack teaching Ben how to rob banks, while they plan Jack's last heist.",
      "similar": [
         105,
         165,
         11977,
         2605,
         27274,
         21972,
         10225,
         87440,
         24103,
         479475,
         229,
         24808,
         7797,
         29778,
         29286,
         47508,
         9648,
         83817,
         36414,
         161552
      ],
      "original_title": "Lightning Jack",
      "runtime": 98,
      "poster_path": "/myB6eGNcJrBnFW2EtTQMX5zmn3M.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Savoy Pictures",
         "id": 11308,
         "origin_country": ""
      }],
      "release_date": "1994-03-11",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Simon Wincer"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Paul Hogan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110353/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2NzcyNzg2Ml5BMl5BanBnXkFtZTcwNjMyNzAwMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Hogan, Cuba Gooding Jr., Beverly D'Angelo | See full cast and crew »"],
      "reviews": [
         "This movie is one of the best comedy westerns for a long time and gives its stars ample time to perform. Paul Hogan plays pretty much the same character as he did in Crocodile Dundee, only with a bit more heart, as a failed outlaw trying to make a name for himself in the Wild West with one big heist. His only partner is played by Cuba Gooding Jr., in a superb early performance as a dumb black shop assistant, with shows both comedic talent, and a depth to the character that Hogan himself probably didn't know was there when he wrote it. A series of wonderfully scenes in bars all over the West, culminate in a perfect last heist that nobody knows about, and robs Hogan of his wanted fame. Unfortunately, the box-office showed less confidence in the movie than it's investors on the Aussie stock-market did, but do not let that deter you from a very funny movie.",
         "The humor is just as fresh today as it was when I first saw it several years ago. Goodings shows a depth of talent that this viewer really appreciates. His expressions are nearly as plastic as Jim Carrey's and spontaneous enough to steal the show without any lines.",
         "This film isn't good but it isn't bad either. It's just a normal movie with some nice jokes in it. The characters are lovable, the performances are good, and it has it's share of funny scenes. Not bad for a raining Sunday. 2 1/2(**1/2)out of 4(****)stars",
         "Well, I watched this movie a little while ago , and I am only now getting around to writing a comment on it. I never use to be that big on Paul Hogan, I never liked him all that much to be honest. But not after watching this. This movie was funny say the least, And when I first pop ed in the movie I was thinking that it was going to be some old movie that was just thrown out there in hopes of having a little money. But Honsitly I was surprised , it was enjoyable, and it wasn't boring. I also liked the idea that Cuba Gooding Jr's Character, wasn't able to speak, and how Lighting Jack wasn't able to read without his glasses , but how he tried to hide it from everyone. For anyone who hasn't seen this movie, and they like a good comedy, or Paul Hogan for that matter. What are you waiting for....? Go rent it ! If Anyone has any questions or anything like that my email is pguiney_@hotmail.com",
         "Lightning Jack Kane (Hogan) is an elusive but aging Australian outlaw living in the Old West who doesn't get the respect he feels he deserves. He contemplates retirement, but before that can happen he has one final wish to make major headlines. When a bank robbery gets bungled, he takes a mute store clerk (Gooding) hostage, but they unexpectedly bond, develop a genuine friendship, then try to help each other out by forming an unlikely partnership to pull off a big score that will attract the necessary attention. The two leads make a surprisingly engaging team, and there are some enjoyable moments, but the whole thing is familiar and obvious. **½",
         "Basically a standard western story with a few gags thrown in, this is alright if you're a fan of either star but doesn't really do much, Hogan is just a slightly pathetic version of his Crocodile Dundee persona, an outlaw who never quite makes it to the big time fame he's always longed for, while Gooding does another soppy turn as a mute who communicates by gurning and simpering. But it's fairly easy on the mind if you've got a couple of hours to kill.",
         "It may have received some scathing reviews, but overall, Lightning Jack is DAMN funny movie. Paul Hogan's stiff acting is an asset here, Cuba Gooding Jr steals the show hilariously, without saying a single word. I dare anyone to not laugh when Doyle(Gooding Jr) shoots himself in the foot. Far from flawless, but overall, if you dont take it seriously, fun to watch. 6.5 out of 10",
         "Funny little time burner has Paul Hogan starring as an Australian outlaw in the U.S. old west. A robbery leads to him kidnapping a young black mute man (Cuba Gooding, Jr.). They become the strangest of friends and have the wildest adventures as they try to become known criminals in a time and place that just does not seem to care about them. High-class prostitutes Beverly D'Angelo and Kamala Lopez-Dawson are also along as the duo's love interests. The film uses its gimmick well early, but then starts to drag as it hits its latter acts. Hogan and Gooding make a surprisingly impressive team, but really they were not given enough material to run with. The rest of the cast is touch and go as once again Hogan is left to carry a production and he is only minimally successfully. 2.5 out of 5 stars.",
         "Lightning Jack is an average Western Comedy that has a few laughs. It though a lot of the well known and established formulas and is neither better nor worse, than a lot of other comedies out there. Paul Hogan stars as Jack Kane a veteran outlaw who finds himself part of a dying breed an unable to get a decent headline. Cuba Gooding Jr. stars as the mute clerk Ben Doyle who wants to join up with Kane and become an outlaw. The acting is average. Hogan seems to run on much of his routine from Crocodile Dundee. Some of the time though he seems to have trouble delivering his lines convincingly. Cuba Gooding Jr. is amusing as the mute Doyle but occasionally overacted to the point where it made me cringe. The chemistry between the two isn't bad, but it isn't great either. Much like the film itself. There's nothing noteworthy about the direction or cinematography. The story moves along alright, but the script is mediocre and gives us a few completely unnecessary scenes. There is rarely any musical score to take note of, and what little there is, is average stuff to enhance the comedic elements. The film is not a complete waste of time. Some of the jokes do hit their mark, and Hogan has charm. There are several better Western comedies out there though, such as Maverick, but if you're looking for some mild entertainment some rainy day, Lightning Jack can prove to be entertaining enough.",
         "It could have been a horrible vanity project by Paul Hogan, but it turned out to be an inoffensive comedy. Not particulary funny or clever, but it passed the time. Cuba Gooding Jr was very good considering he wasn't allow to talk at all. Even Paul Hogan was didn't ham it up too much. It isn't a great western or a great comedy but it isn't bad and, unless you pay to see it, may even leave you with a half-amused little smile."
      ],
      "genres": [
         "Comedy",
         "Western"
      ],
      "productionCompanies": [
         "Lightning Ridge",
         "Village Roadshow Pictures"
      ],
      "summaries": ["Lightning Jack Kane is an Australian outlaw in the wild west. During a bungled bank robbery he picks up mute Ben Doyle as a hostage. The two become good friends, with Jack teaching Ben how to rob banks, while they plan Jack's last heist."],
      "budget": 0
   },
   "movielensId": 487,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1994-03-11",
      "dvdReleaseDate": "2000-11-14",
      "directors": [
         "Simon Wincer",
         "Paul Hogan",
         "Greg Coote"
      ],
      "runtime": 98,
      "movieId": 487,
      "title": "Lightning Jack",
      "mpaa": "PG-13",
      "actors": [
         "Paul Hogan",
         "Beverly D'Angelo",
         "Cuba Gooding Jr.",
         "Pat Hingle",
         "Richard Riehle",
         "Frank McRae",
         "Roger Daltrey",
         "L.Q. Jones",
         "Roy Brocksmith",
         "Kamala Lopez"
      ],
      "imdbMovieId": "0110353",
      "originalTitle": "Lightning Jack",
      "genres": [
         "Action",
         "Comedy",
         "Western"
      ],
      "youtubeTrailerIds": ["23VHjFycsZk"],
      "plotSummary": "Lightning Jack Kane is an Australian outlaw in the wild west. During a bungled bank robbery he picks up mute Ben Doyle as a hostage. The two become good friends, with Jack teaching Ben how to rob banks, while they plan Jack's last heist.",
      "tmdbMovieId": 22317,
      "avgRating": 2.59939,
      "releaseYear": "1994",
      "numRatings": 654,
      "posterPath": "/myB6eGNcJrBnFW2EtTQMX5zmn3M.jpg"
   }
}