{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "opera singer",
            "id": 164920
         }
      ],
      "imdb_id": "tt0107468",
      "video": false,
      "title": "M. Butterfly",
      "recommendations": [
         27371,
         25690,
         29437,
         38280,
         9540,
         28942,
         27429,
         228606,
         2742,
         61702,
         188044,
         33078,
         9613,
         884,
         181095,
         13553,
         122677,
         177229,
         28642,
         20537
      ],
      "backdrop_path": "/1OHhe9Se2GxUscVhmUXJSGIT4LK.jpg",
      "revenue": 1499795,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "René Gallimard",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f8db",
               "name": "Jeremy Irons",
               "profile_path": "/9AWphjIgGX7JjTrwrx3tsTZlUgv.jpg",
               "id": 16940,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Song Liling",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f8df",
               "name": "John Lone",
               "profile_path": "/qlzum4vK8Snzp65jiUVpZGYPzFE.jpg",
               "id": 11389,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Jeanne Gallimard",
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f913",
               "name": "Barbara Sukowa",
               "profile_path": "/mGKhBMI9P2teTXC1v9HgS3WtL73.jpg",
               "id": 23378,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Ambassador Toulon",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f917",
               "name": "Ian Richardson",
               "profile_path": "/wUENAdxr5JFGFNbDe6HTFwrlvA9.jpg",
               "id": 385,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Frau Baden",
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f91b",
               "name": "Annabel Leventon",
               "profile_path": null,
               "id": 32595,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Agent Etancelin",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f91f",
               "name": "Vernon Dobtcheff",
               "profile_path": "/lcPki2IDdmRvqiBbv2RUBfgm3IH.jpg",
               "id": 649,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Comrade Chin",
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f923",
               "name": "Shizuko Hoshi",
               "profile_path": null,
               "id": 32596,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f8d7",
               "name": "David Cronenberg",
               "profile_path": "/nFHIlkIuile5RmtSqbyCB4w8SpH.jpg",
               "id": 224,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f8e5",
               "name": "David Henry Hwang",
               "profile_path": null,
               "id": 32594,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f8eb",
               "name": "Gabriella Martinelli",
               "profile_path": null,
               "id": 6202,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f8f1",
               "name": "Peter Suschitzky",
               "profile_path": null,
               "id": 307,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f8f7",
               "name": "Howard Shore",
               "profile_path": "/4HbFF5o13GkO0rHi4OVXXMb7U5L.jpg",
               "id": 117,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f8fd",
               "name": "Deirdre Bowen",
               "profile_path": null,
               "id": 7800,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f903",
               "name": "Ronald Sanders",
               "profile_path": null,
               "id": 310,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f909",
               "name": "Elinor Rose Galbraith",
               "profile_path": null,
               "id": 10836,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f90f",
               "name": "Denise Cronenberg",
               "profile_path": null,
               "id": 13551,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.690501,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1413,
      "vote_count": 43,
      "budget": 0,
      "overview": "In 1960s China, French diplomat Rene Gallimard falls in love with an opera singer, Song Liling - but Song is not at all who Gallimard thinks.",
      "similar": [
         746,
         10110,
         311324,
         55292,
         18,
         291805,
         140300,
         9502,
         1735,
         956,
         714,
         843,
         4588,
         1494,
         7549,
         12289,
         31439,
         14202,
         978,
         875
      ],
      "original_title": "M. Butterfly",
      "runtime": 101,
      "poster_path": "/c7oXl40SpsPifAePUiI1KcGu0SX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Geffen Pictures",
            "id": 360,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-09-09",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Cronenberg"],
      "runtime": 101,
      "synopsis": "Beijing, Red China, 1964. Mild-mannered Rene Gallimard, an accountant at the French embassy, watches captivated as Opera diva Song Liling sings a selection from 'Madame Butterfly'. Afterwards, he tells his wife Jeanne that Song Liling has opened his eyes to the beauty in the tragic tale, but Jeanne pours scorn on his romanticized western ideal of the submissive oriental woman. He tells Jeanne that the Chinese can't stand Madame Butterfly because \"the white man gets the girl.\" Three weeks later, Rene musters the courage to visit the Opera again where he meets Song Liling backstage. Although he and Song only talk, he lies to his wife about his whereabouts. Song next entertains him in her parlor, a potentially scandalous action in a country \"rooted 2,000 years in the past\". When Rene kisses Song, she looks offended and asks him to leave. At Frau Bauden's party, Rene is accosted by angry embassy employees whose expenses he has refused. Song begins to write letters to Rene which he does not answer. Ambassador Toulon notes Rene's sudden personality change by stating: \"you've become this new, aggressive, overconfident thing\". He appoints Rene as Vice Consul, in charge of setting up a new intelligence-gathering operation to spy on the current Chinese authorities during Chairman Mao's so-called Cultural Revolution. Rene rushes off to Song, and demands to know if she's his butterfly. She shyly admits she is, although to protect her modesty, she insists on remaining clothed as they make love, watched by the prying eyes of Song's maid. Rene and Song's courtship continues secretly with a trip to the Great Wall. Some time later, the ambassador asks Rene Gallimard's opinion on the current conflict in Vietnam and of China's involvement it for his report. He tells the ambassador that the Americans must show strength, as the Oriental will always bow to a superior force. Song is revealed to be a double agent as she begins to feed Rene misinformation, and relays his comments on American troop movements to local Party official Comrade Chin, who is disgusted to find American movie-star magazines in her parlor. Song counters with saying \"I'm trying my best to become somebody else.\" At another one of Frau Bauden's parties, Rene embarks on an \"extra extra-marital affair\" with Song. On his next visit to Song, he demands to see her naked. She tells him that she is pregnant and she must go to her parents village, as is the custom, from which she will bring him back a son. He is delighted. Song then goes to her handler, Chin, and requests a male Chinese baby with blond hair as part of her cover. Some months later, Rene Gallimard views a Red Guard demonstration with the burning of opera costumes. The ambassador advises caution, as they have become a powerful movement. Song visits Rene with their \"son\". He proposes marriage, but she is marched away by Red Guard militia who have declared all artists criminals under the Cultural Revolution. Rene is told by the Chinese authorities that he is being deported back to France for wrongly analyzing the Chinese and Vietnamese political situations. On a last visit, Rene finds Song's courtyard quarters full of peasants. Meanwhile, Song is seen entering a re-education camp, as a loudspeaker voice declares hard labor will transform them into real citizens of the future under the tutelage of Chairman Mao. Paris, France, 1968. Rene is watching a performance of Madame Butterfly at the local opera, where his eyes fill with tears. Outside, Rene runs into a riot where pro-Communist students are attacking the police during the so-called Student Riots. Rene returns to his apartment which the decor is austere of Chinese chic. One day, Song reappears, and Rene is overjoyed to see her again. Rene tells Song that since his dismissal from the diplomatic service, he has been working as a motorcycle courier, carrying diplomatic pouches. Rene is soon arrested by Etancelin, a government agent. Rene is brought on trial for espionage of leaking classified documents during his tenure as Vice Consul in China. During the trial, Rene is confronted by the crushing spectacle when Song Liling shows up to testify against him, and wearing a suit and necktie... unmistakably a man. Much to the court's incredulity, Song testifies how Rene gave him access to the diplomatic pouches to protect their \"son\" back in China. When the prosecutor asks Song if Rene ever knew that he was in fact a man impersonating a woman, Song speaks about his Oriental ways of love \"out of which I invented myself, just for him.\" In a police van en route to prison, Song confronts Rene and finally disrobes, bitterly reminding Rene that he still is the same person that Rene fell in love with. Rene angrily rejects his advances, destroyed by the revelation of Song's true gender and that what he loved and believed was all a lie. In prison, Rene gives a one-man performance, admitting his story about falling in love with a man whom he thought was a woman, and a spy, had given the whole from France a good laugh. As Song boards a plane back to China, having been extradited, Rene plays an audio tape of Madame Butterfly and relates the tale as if he himself were the tragic oriental woman who loved an unworthy man. In oriental clothes, heavy Chinese makeup and a wig, Rene says that he has found the perfect sacrificial woman, far from China. In front of all the inmates and the warden, he kneels forward and commits suicide by slitting his own throat.",
      "writers": [
         "David Henry Hwang",
         "David Henry Hwang"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107468/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3MTk3NDE1NV5BMl5BanBnXkFtZTcwNjk0MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeremy Irons, John Lone, Barbara Sukowa | See full cast and crew »"],
      "reviews": [
         "Jeremy Irons and John Lone (who plays the character, Song Liling) should both have gotten academy awards for their performance in this incredibly enigmatic and captivating scorcher of a movie. This is a completely new twist on on the classic opera and may even be more of a believable story because it is so creatively wicked. It has a sexual tension that holds throughout the whole movie and is entirely played out in the mind and sensuously mesmerizing at the same time. It's an emotionally tortuous journey that Jeremy Irons makes in the name of love (?), and more likely addicted passion. John Lone's performance is exceptional as one who is just as driven and hooked psychologically in his own way as what it is in him that drives him to fulfill Jeremy's ecstasy and descent into irretrievable madness. Definitely one of the best movies ever! I hope this makes it to DVD sometime soon as it surely deserves to be seen again and again.",
         "Jeremy Irons plays the lead role as French diplomat, Phillipe Bouriscot, who falls in love with an absolutely seductive Chinese woman opera singer (John Lone). As Irons pursues the diva he's attracted to, she toys with his foreign ignorance of the cultural differences between their Western & Eastern societies. In a sense, she keeps the diplomat at a distance for 18 years while their affair continues by becoming his teacher of cultural difference. The romantic & erotic chemistry between the diplomat & opera singer is a very famous true story written by David Henry Hwang--\"Madame Butterfly.\" There have been numerous stage & screen renditions of the story. I like this (1994) version best because David Cronenberg is undoubtedly the finest director to deal with the most important topic in the story: gender bending. \"M. Butterfly\" is the Canadian Cronenberg's first Hollywood funded debut. The surprise plot of the sorted true love story is one of espionage. An adults only film, it is one of intrigue, sizzling romance, twists & turns, deception & betrayal.",
         "Of all the David Cronenberg movies I have seen 'M. Butterfly' is my least favourite, but that's certainly not to say that it is entirely worthless. Despite some flaws and a few dead spots it is still quite a fascinating film. One of the oddest things about this movie is that despite its general feeling of unbelievability it is based on a true story. Cronenberg adds to this by deliberately casting the rather butch John Lone, rather than a more obviously androgynous actor (ala 'The Crying Game', a movie this is often compared to). This makes the story more confronting and less comfortable, and also one assumes, closer to the actual facts of the case. Jeremy Irons, who was robbed of an Oscar in Cronenberg's previous 'Dead Ringers', is outstanding as usual, Lone (still mainly known for 'The Last Emperor') isn't as good, but still fine, and the supporting cast includes a nice turn from Brit veteran Ian Richardson ('Dark City'). Most Cronenberg fans will probably find this a bit difficult to get into, as the material isn't exactly typical of the director, but it's much better than its bad press makes out. I expected to hate it, and I didn't.",
         "This is David Cronenburg's best, based on a true story as bizarre and compelling as his other bizarre and compelling stories. John Lone is wondrous and Jeremy Irons is his usual cold, repressed upper class self. Perfect casting for a provocative director filming a moving story of love and loss.",
         "this film is compelling and haunting...have seen it only once, but its message of passion burned itself upon my memory for all time. that is my definition of a great film. would love to own a copy on DVD. I always look for it at stores but never have found even a VHS version. I have also been searching for a copy of Damage also starring Jeremy Irons...haven't found that one either. Why are the most artistic films, the ones that really have something to say, the last to make it to the after-market release of the film?? I have noticed that Jeremy Irons tends to portray emotionally crippled characters...it certainly works for him in this film!",
         "M Butterfly is a remarkably compelling film, even though the premise has been spoiled. I think it is David Cronenberg's best film overall. Dealing with the same issues as in Farewell, My Concubine, such as the state of Chinese theater during the revolution, M Butterfly is easier to understand and more involving. Farewell, My Concubine made me want to not care about the history involved because it was just too much to think about at one time, not being previously aware of it. However, M Butterfly explains the setting in a way that has no minimum education requirement. Foremost though, the characters created by Jeremy Irons and John Lone are intricate, conveying their deep commitments to their country and to their own heart, in Song and Rene's cases respectively. However, being familiar with the opera is an advantage to understanding a few complications in the plot. Plus, the ending is daring and dramatic. In real life, however, the person who the character Rene is based on is still alive and I saw an interview with him on ABCNews and just knowing that this man actually thought that he had gotten this other man pregnant makes the movie even more intriguing. This movie does not really delve into how that could have been, physically or psychologically, but it does make subtle inferences. Just the knowledge that the premise is not merely incredulous movie fantasy is enough reason for inquiring minds to give this beautiful film a try.",
         "M. BUTTERFLY continues to rank among the more important cinematic adaptations of a brilliant play - this one by the playwright David Henry Hwang. Having the pleasure to see two productions of the play - New York and Los Angeles - and viewing the film (1993) in the theater and on DVD brings an immense amount of satisfaction of just how fine this work is and continues to satisfy. The fact that David Henry Hwang wrote the screenplay suggests how true to the original the film is and how much of an impact it makes on the viewer M. BUTTERFLY is based on a true story that stunned the world. During the Cultural Revolution in China in the mid-1960s, a French diplomat René Gallimard (a brilliant portrayal by Jeremy Irons) falls in love with a Chinese opera singer Song Liling (John Lone) - women were never allowed to sing in the Beijing Opera so the fact that Song is a man is credible. Song Liling touches him with a love as vivid, as seductive--and as elusive--as a butterfly. The love affair is so fragile and respectful that René does not suspect that Song is a man in disguise. René Is an important diplomat with the French Embassy, married to Jeanne (Barbara Sukowa), and is responsible for maintaining the high standards of diplomacy. Song Liling has been placed in the position of an undercover agent to gather secrets from the Embassy about the American plans in Vietnam. As René is promoted he demands to see his M. Butterfly without her clothes, an Song's only protection about her gender identity is to reveal that she is pregnant with René's child and must leave to be with her family until the child is born. As the Cultural Revolution heightens the French Embassy is to be diminished and it is discovered that René has been in a liaison with with a Chinese spy and is sent back to France to be imprisoned. When he is put on trial Song appears in Paris to be placed on the witness stand and since years have passed since their last meeting, Song attempts to offer herself once again to be René's Butterfly. Whether or not René's passion was a flight of fancy, it sparked the most vigorous emotions of his life. Only in real life could love become so unreal. And only in such a dramatic tour de force do we learn how a fantasy can become a man's mistress--as well as his jailer. In a desperately touching final scene we see the imprisoned René perform the final act from the opera that has accompanied this film - Puccini's MADAMA BUTTERFLY. The story is at once compelling, explosive and slyly humorous, 'a work of unrivaled brilliance, illuminating the conflict between men and women, the differences between East and West, racial stereotypes--and the shadows we cast around our most cherished illusions.' The musical score by Howard Shore integrates arias and choruses from Puccini's opera with music from Chinese opera and his own sensuously beautiful original musical score. David Cronenberg directs with the tight amount of surreal disbelief the piece needs, but it is the brilliant acting of Jeremy Irons and John Lone that illuminate this film. It is a masterwork. Grady Harp",
         "Or, conversely, love doesn't know the gender it loves. Jeremy Irons and John Lone star in \"M. Butterfly,\" based on the hit play by David Henry Hwang. In the mid-'60s, while the cultural revolution is going on in China, French Vice Consul Phillipe Bouriscot (Irons) falls in love with a singer, Song (John Lone), who performs with the Bejing opera. He believes Song to be a woman. And, like the story of \"Madame Butterfly,\" there is love, there is betrayal, and there is humiliation. As unbelievable as this story might be, it's based on a true one. The film doesn't go into how this fantasy was actually executed physically, but in point of fact, in real life, the character played by Irons believed he had gotten Song pregnant. Odd but true. David Cronenberg does an excellent job with this dark, mysterious film, and the actors are terrific, each character hooked on this fantasy in his own way. The end of the film is haunting. Well worth seeing.",
         "It's a good movie ,in my opinion as a Chinese girl,though there are some obvious ridiculous errors.I have not seen any intro about this film before my watching,neither a poster.I found it because I like the opera of Butterfly and I mistook it as the adaption of the famous opera.At the beginning of the movie,I was so confused that when Gallimard fell in love with Song-because,it's very apparent that the \"actress\" of Song was a male guy!And,from a Chinese view,John Lone was too stocky to play the role of a eastern girl.-If a Chinese girl was like that in appearance ,she will be the butt of others.However,anyway,John Lone was so great an actor.His appearance has no similarity with a girl,but his manners, expressions,and tone are very very similar to a Asian felmale.Can't believe it. About the story of the film,I have little to think.Anyway,it's a novel that a child how to make and ruin a colorful bubble.All of us have to experience some destroyings of good dreams.The story was only one of them .Many of us think we found the one of ideal,but it turns to be a joke in the end.It's life. The great value of the movie ,I think ,is that it showed what a big gap between the different group of people exists in this world.Over several centuries,western people were imagining the scence of the mysterious ancient east,including the people there.However,...it's hard for a west to penetrate the east...I think.There are too much imposed on an east person,including man ,and woman.",
         "A French diplomat named Rene Gallimard is living and working in the China at the time of the Vietnam war. He goes to see the famous Chinese opera Madam Butterfly and instantly falls in love with the woman playing the lead roll. They start an Affair but the woman Song Liling is so modest that she won't let Rene see her naked. The affair is short lived when the Butterfly as he calls her and their new born baby are taken away by the Communists, and Rene is sent back to France and his wife Divorces him. Several years later Song shows up again and tricks him into stealing government documents so as she says they can get their child back. Than some of the weirdest things ever filmed takes place, but the weirdest part is that it is all true, or mostly true some of it we will never know for sure. The performances are wonderful particularly by Jeremy Irons as Rene. He plays him perfectly. But the real best part of the film is David Cronenbergs direction which is some of the best ever. A wonderful movie,"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Geffen Pictures",
         "Miranda Productions Inc."
      ],
      "summaries": [
         "During the Cultural Revolution in China in the mid-1960s, a French diplomat falls in love with a singer in the Beijing Opera. Interwoven with allusions to the Puccini opera \"Madama Butterfly\", a story of love and betrayal unfolds.",
         "A French diplomat in China who reveals state secrets to his cunning Chinese lover earns humiliation and infamy when the truth becomes publicly known. Because the U.S. has no relations with China, its interests there, often including Vietnam War battle secrets, are handled by France's embassy in Beijing. French Vice Consul Rene Gallimard trades those secrets for a fantasy life when he's introduced to \"Madame Butterfly\" in the person of Song Liling. Gallimard makes Song his Butterfly only to tragically find years later that the opera singer is a spy, that he is the Butterfly, a foolish Butterfly, and the laughingstock of France.",
         "In 1960s China, French diplomat Rene Gallimard falls in love with an opera singer, Song Liling - but Song is not at all who Gallimard thinks."
      ],
      "budget": 0
   },
   "movielensId": 488,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-09-09",
      "dvdReleaseDate": null,
      "directors": ["David Cronenberg"],
      "runtime": 101,
      "movieId": 488,
      "title": "M. Butterfly",
      "mpaa": "",
      "actors": [
         "Jeremy Irons",
         "John Lone",
         "Barbara Sukowa",
         "Ian Richardson",
         "Annabel Leventon",
         "Vernon Dobtcheff",
         "Shizuko Hoshi"
      ],
      "imdbMovieId": "0107468",
      "originalTitle": "M. Butterfly",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1960s China, French diplomat Rene Gallimard falls in love with an opera singer, Song Liling - but Song is not at all who Gallimard thinks.",
      "tmdbMovieId": 1413,
      "avgRating": 3.40411,
      "releaseYear": "1993",
      "numRatings": 584,
      "posterPath": "/c7oXl40SpsPifAePUiI1KcGu0SX.jpg"
   }
}