{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "car dealer",
            "id": 1874
         },
         {
            "name": "anonymity",
            "id": 2142
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "sperm donor",
            "id": 159141
         }
      ],
      "imdb_id": "tt0107478",
      "video": false,
      "title": "Made in America",
      "recommendations": [
         12154,
         10945,
         11107,
         11630,
         12710,
         11856,
         11566,
         9941,
         10326,
         11821,
         26255,
         12151,
         14550,
         11066,
         11894,
         6472,
         11595,
         10464,
         10859,
         12475
      ],
      "backdrop_path": "/l73mwyhdAC0Fk9CjBJLbCrCsB3L.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Sarah Mathews",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503ecfd",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Halbert 'Hal' Jackson",
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed01",
               "name": "Ted Danson",
               "profile_path": "/wWm9eDLuPDw29R76KAjg6gIE9dS.jpg",
               "id": 12836,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Zora Mathews",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503ed05",
               "name": "Nia Long",
               "profile_path": "/q01J3WgNd96GR7CcSxx56N8qwSZ.jpg",
               "id": 9781,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Tea Cake",
               "gender": 2,
               "credit_id": "52fe44ba9251416c7503ed09",
               "name": "Will Smith",
               "profile_path": "/5V4OKHQpIEffF9rqgzGYK4TNaGg.jpg",
               "id": 2888,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Stacy",
               "gender": 1,
               "credit_id": "52fe44ba9251416c7503ed0d",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b99251416c7503ecc3",
               "name": "Richard Benjamin",
               "profile_path": "/9BQ5QcoCA7sfQzPvBpX8U4zDXqn.jpg",
               "id": 24318,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b99251416c7503ecc9",
               "name": "Marcia Brandwynne",
               "profile_path": null,
               "id": 71336,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b99251416c7503eccf",
               "name": "Nadine Schiff",
               "profile_path": null,
               "id": 71337,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44b99251416c7503ecd5",
               "name": "Holly Goldberg Sloan",
               "profile_path": null,
               "id": 71338,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b99251416c7503ecdb",
               "name": "Rick Bieber",
               "profile_path": null,
               "id": 71339,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b99251416c7503ece1",
               "name": "Michael Douglas",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b99251416c7503ece7",
               "name": "Arnon Milchan",
               "profile_path": "/5crR5twLRcIdvRR06dB1O0EQ8x0.jpg",
               "id": 376,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b99251416c7503eced",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b99251416c7503ecf3",
               "name": "Ralf D. Bode",
               "profile_path": null,
               "id": 25212,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44b99251416c7503ecf9",
               "name": "Jacqueline Cambas",
               "profile_path": null,
               "id": 33830,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44ba9251416c7503ed13",
               "name": "Marcia Brandwynne",
               "profile_path": null,
               "id": 71336,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44ba9251416c7503ed19",
               "name": "Nadine Schiff",
               "profile_path": null,
               "id": 71337,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 9.830162,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12121,
      "vote_count": 115,
      "budget": 22000000,
      "overview": "A young black woman discovers that her father was a sperm donor, and if that weren't bad enough, he's white.",
      "similar": [
         272693,
         10625,
         37725,
         449176,
         19840,
         9880,
         26123,
         10206,
         89185,
         57214,
         9655,
         9377,
         2108,
         37735,
         8363,
         8193,
         2105,
         4951,
         277217,
         315635
      ],
      "original_title": "Made in America",
      "runtime": 111,
      "poster_path": "/8swGX78Q5s7z47MRByf1E8MUNqP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-05-27",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "At the sperm-bank she asked for a tall, intelligent, black man. One out of three ain't bad.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Richard Benjamin"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Marcia Brandwynne",
         "Nadine Schiff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107478/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0MzQ0NzYwNF5BMl5BanBnXkFtZTcwMDUxOTMyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Whoopi Goldberg, Ted Danson, Will Smith | See full cast and crew »"],
      "reviews": [
         "The movie seems to work better than the premise might suggest. The three leads - Goldberg, Danson and Nia Long, have a nice chemistry between them. Nia Long being particularly lovable as 'their' daughter. There are some good gags in it, although the movie is not overstuffed with them. The decent, heartwarming plot (just the right amount of twists) handles the race aspects with an exemplary ease. Jennifer Tilly's bit-part was funnier and more successful than Will Smith's. Made in America is hardly a classic but is worth watching if you like a little maturity in your comedy.",
         "As another example of an average premise and equal execution \"Made In America\" doesn't disappoint. Whoopie Goldberg and Ted Danson star as one-time customers of a sperm donor bank that has mistakenly given them a very curious daughter. Entering her mid-teens, their daughter Zora (played affably by Nia Long) discovers she is the product of their unintentional love. While Sarah (Goldberg) wanted a strong, tall black man, she would have settled at least for the last part. Instead, she is introduced to Danson by her intuitive daughter after she uses her friend (played by Will Smith) to steal sperm donor records. The rest of the film is pretty much by-the-book. Father and Mother fight, get along, date, daughter gets weirded-out, parents save daughter from bad decision and hug....fade to credits and cliché song. In between: The movie IS worth watching. I give it crap because it's fairly by-the-book but it's not awful. When I first saw this film I was a fan of Danson from \"Cheers\" and Goldberg from her one-woman show and guest spots on Star Trek: The Next Generation. I remember being pleasantly surprised by both. Danson is an accomplished actor, best in \"Pontiac Moon\", and stretches his comedic skills here. Goldberg, on the other hand is best here in dramatic moments. She is warm and vibrant with splashes of real brilliance but it's not enough. It's not that she can't do the comedy at all, she is an incredible comedian, the script just doesn't give her enough to do besides be shrill and clumsy with a smattering of nice. Her few scenes with Danson are worth the time spent watching and make up for their tabloid headlines at the time. As for Smith's performance, this early role wasn't much different than most. Every minute on screen he is a joy, still in his \"Fresh Prince\" mode here he certainly doesn't disappoint. Nia Long is the real find here. If one person from this film should have been given a better shake than anyone it is her. She is vibrant, funny and worthy of the people she shares the screen with. That says a lot.",
         "I don't see why so many people are trashing this one. I admit that there's plenty about it that doesn't make any sense, but there's plenty of good humor in it. The best part is the filming of the commercials. Who would have thought that a shoot that goes horribly wrong would produce footage much better than what was intended? Also, Nia Long is BEAUTIFUL. Out of all the films I've seen, I think this one is a hair above average.",
         "Despite mixed reviews and obnoxious comments about this film from several aquaintences this movie proved to be funny,heartwarming and entertaining. Whoopi Goldberg plays Sarah Matthews,the mother of a seventeen year old - Zora (Nia Long). Their seemingly perfect life is changed dramatically when Zora finds that her father was not Mr Matthews - her apparently deceased father. Zora finds that she is in fact the product of an artificial insemination and that her father is unknown by her mother. Upset and curious about the whereabouts of her real father, Zora searches through the computer files for her Mother and finds that her father is in fact Hal Jackson (Ted Danson), a dumb used car dealer who is famous for his crass and stupid commercial on the local TV station. The traumas and dramas of the whole situation begin to simmer down and so do the hard feelings between Hal and Sarah. They fall in love and as you've probably already guessed, there is a very happy ending!! Awwwwww.",
         "I really like this film. It's been on British T.V. almost as many times as Mary Poppins and I'm always glad to see it. There is a chaotic comic chemistry between Goldberg and Danson, but they don't egotistically dominate the film, allowing the charming and funny performances by Nora Long, Jennifer Tilly, Will Smith, Peggy Rea and others to shine. I particularly like Tilly's character, a new age airhead, and her new boyfriend, played by Fred Mancuso, who between them, make stupidity lovable. Everyone gets a fair chance, and they all make the best of it. Formulaic as it is, Made in America is about racial identity, which is a difficult subject to address in such a frivolous form as romantic comedy, but it manages to more or less avoid cringes and concentrates on the laughs, only giving as much time to story as is necessary to keep everything moving on. Against the odds and thanks to the superb cast this is a good natured film. It harks back to the optimism of the early nineties, and seems strangely innocent, eleven years on.",
         "An intelligent, black teenage girl is shocked to discover from her strong, independent mother that she was the product of artificial insemination. Determined to track her biological father down, she looks up the records to find that not only is he a white man, but he's also an obnoxious and pompous car salesman. Naturally, complications ensue when her mother makes it clear that she requested a black donor. Cast is talented and enthusiastic, setup is very clever and has the makings of a really enjoyable comedy, but unfortunately they're wasted on a sorry script that resorts endlessly to dumb, sitcom-style humor. A real shame. **",
         "This was so funny. It was fabulous. You laugh straight through, except for the part in every movie when the going gets tough. Really, Whoopi is a crazy-in-traffic mother with an attitude. After her husbands death she went to a sperm bank. But oh, how could this happen, they mix it up. She asked for a tall, intelligent black man. Now she's clashed together with \"Hal\" ('s your pal), the actual sperm donor. But he's not black and he's a car salesman. He is tall, and we withhold judgment on the intelligence scale. The only match is their traffic skills (or lack thereof, depending on how you look at it) and their sensible daughter. Her pal, T-cake (Will Smith), is a gem. You should watch the movie just to see him swing his butt pretending to be an angry girl.",
         "\"Made in America\" is a formulaic romantic comedy with a pretty noble premise. That premise is obviously a setup for racial (not racist) gags, but it never becomes a one-joke comedy. Ted Danson and Whoopi Goldberg are great leads. They light up the screen with their (sometimes sexual) tension. Goldberg is one of my favorite actresses, and she's wonderful in this role. It's hilarious to watch her spontaneous outbursts. Nobody does 'em like Whoopi. There are no real surprises in the plot. Danson is a conceited, self-indulgent used car salesman. He's married to a floozy wife (Jennifer Tilly). Whoopi is a single parent who owns an African-American antique shop. Her daughter finds out that her real father (whose sperm was artificially inseminated) turns out to be Danson, that white used car salesman who does those crazy ads on TV. It's pretty obvious what the punchlines will be and it's pretty obvious how this sometimes schmaltzy story will end up. However, it's lightweight entertainment that isn't meant to be thoroughly analyzed. Just enjoy it for its many laughs and endearing performances. It's an innocuous, feel-good comedy. Even when it takes a dramatic turn at the third act, I didn't feel the mood was ruined. I guess it's because I felt a respect for all these likeable characters and was somewhat manipulated. Just how I felt the humor in the first and second acts, I felt the sadness in the third. My score: 7 (out of 10)",
         "I'd just finished reading the User Comments, before writing my own, and I can't understand why everyone panned it!! Okay, so it's not exactly Oscar-worthy, but it's good for a few laughs. I'm a huge Whoopi fan from way back, and while this will never match Jumpin' Jack Flash or Sister Act, it's still a pretty decent film. I think Goldberg's role was pretty funny, and my favorite scene is where she get's drunk and says: 'I know this is his office, I know that, I mean look at it! Cheesy wood, bowling trophies, Western motîf makes me ill... ooooh, it's the Titty Sisters - this is absolutely his office!' Ted Danson's performance falls short compared to his other work (ie. Cheers). Will Smith's character is pretty funny, and Nia Long does a great job in the film. Newcomer Paul Rodriguez is okay, and Jennifer Tilly is cast again as the annoying little tart (it's what she does best). Step By Step's Peggy Rea is also good in her role as Alberta - the long-suffering receptionist at Hal's car place. Okay, so it's not the greatest, but it's fine for a rainy day. On a scale of 1 to 10, it'd earn about 5.5.",
         "Made in America is directed by Richard Benjamin and collectively written by Marcia Brandwynne, Nadine Schiff and Holly Goldberg Sloan. It stars Whoopi Goldberg, Ted Danson, Nia Long, Will Smith and Jennifer Tilly. When doing a biology project at school, Zora (Long) notices that her blood group is different from her mothers, Sarah (Goldberg). Having never known her father, Zora learns that she was the product of artificial insemination. Quickly setting off to find out who her father is, it comes as a big shock when it turns out he's tall white car salesman Hal Jackson (Danson), a surprise since Zora and Sarah are black! Not the most powerful of set ups it has to be said, but in spite of the lowly rating afforded it by many critics and film lovers, it's a sweet and honest affair. Film pins its hopes on the central comedy premise of a white man somehow fathering a black daughter from a black mother. From there it follows a familiar course from the shock and horror born out by the reveal, to opposites at war and on to maybe opposites attracting? This of course only works if the viewer has a soft spot for Danson and Goldberg in the first place, but with them giving it complete gusto, and being a real off screen couple as well, their play off of each other is very easy to warm too. Sure it's contrived, and very treacle based once we land in the final quarter, but the mixing of races aspect has been well handled by the makers and there's some decent comedy moments. It may not be laugh out loud funny, unless you be the type of person who finds Danson astride a runaway elephant funny? But it has its moments and director Richard Benjamin is also enough of a pro to not let the pace sag. Good support comes from Long and Smith, while Tilly is wonderfully memorable as the fitness freak bimbo girlfriend of Danson. Slight but never less than charming, it's safely recommended to fans of the two principal stars. 6/10"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Canal+",
         "Regency Enterprises",
         "Alcor Films"
      ],
      "summaries": ["A young black woman discovers that her father was a sperm donor, and if that weren't bad enough, he's white."],
      "budget": 22000000
   },
   "movielensId": 489,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-05-27",
      "dvdReleaseDate": "1998-10-06",
      "directors": ["Richard Benjamin"],
      "runtime": 111,
      "movieId": 489,
      "title": "Made in America",
      "mpaa": "",
      "actors": [
         "Whoopi Goldberg",
         "Ted Danson",
         "Nia Long",
         "Will Smith",
         "Jennifer Tilly"
      ],
      "imdbMovieId": "0107478",
      "originalTitle": "Made in America",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["dPPN93A3RRs"],
      "plotSummary": "A young black woman discovers that her father was a sperm donor, and if that weren't bad enough, he's white.",
      "tmdbMovieId": 12121,
      "avgRating": 2.7607,
      "releaseYear": "1993",
      "numRatings": 3178,
      "posterPath": "/8swGX78Q5s7z47MRByf1E8MUNqP.jpg"
   }
}