{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "professor",
            "id": 1992
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0114916",
      "video": false,
      "title": "When Night Is Falling",
      "recommendations": [
         20405,
         12802,
         43088,
         44925,
         44991
      ],
      "backdrop_path": "/sY5CvNawlE9De3bMALQ2M3bUj8B.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Camille Baker",
               "gender": 0,
               "credit_id": "52fe44a4c3a36847f80a1e49",
               "name": "Pascale Bussières",
               "profile_path": "/vbfCShcj8n0eUOoKRCAGNh1auFY.jpg",
               "id": 54818,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Petra",
               "gender": 1,
               "credit_id": "52fe44a4c3a36847f80a1e4d",
               "name": "Rachael Crawford",
               "profile_path": "/jM6bUiUh6cEaKs53Ytp2alcwlFy.jpg",
               "id": 54819,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe44a5c3a36847f80a1e81",
               "name": "Henry Czerny",
               "profile_path": "/vlUuasZW9mIrcnvp6IIEs1B43hT.jpg",
               "id": 15319,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Timothy",
               "gender": 2,
               "credit_id": "52fe44a5c3a36847f80a1e85",
               "name": "Don McKellar",
               "profile_path": "/cV1nEafG1CqIdnrce5pVw2hcaep.jpg",
               "id": 20173,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44a4c3a36847f80a1e53",
               "name": "Patricia Rozema",
               "profile_path": "/s1lW8HDclRDEgOWrETAJ5eSGKda.jpg",
               "id": 55439,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44a4c3a36847f80a1e59",
               "name": "Patricia Rozema",
               "profile_path": "/s1lW8HDclRDEgOWrETAJ5eSGKda.jpg",
               "id": 55439,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a4c3a36847f80a1e5f",
               "name": "Barbara Tranter",
               "profile_path": null,
               "id": 55660,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1e65",
               "name": "Robert Lantos",
               "profile_path": "/5zgnr7BdExuqKSPwzHYkyUHVJzv.jpg",
               "id": 20182,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44a5c3a36847f80a1e6b",
               "name": "Lesley Barber",
               "profile_path": null,
               "id": 39827,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a5c3a36847f80a1e71",
               "name": "Douglas Koch",
               "profile_path": null,
               "id": 55661,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44a5c3a36847f80a1e77",
               "name": "Susan Shipton",
               "profile_path": null,
               "id": 35332,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44a5c3a36847f80a1e7d",
               "name": "Deirdre Bowen",
               "profile_path": null,
               "id": 7800,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.532788,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 8391,
      "vote_count": 16,
      "budget": 0,
      "overview": "A prudish woman, working on tenure as a literacy professor at a large urban university, finds herself strangely attracted to a free-spirited, liberal woman whom works at a local carnival which comes to town.",
      "similar": [
         370663,
         449176,
         258480,
         513,
         338189,
         401898,
         376867,
         300667,
         184352,
         18212,
         12793,
         152584,
         26280,
         455661,
         10938,
         65229,
         1213,
         244772,
         9603,
         11386
      ],
      "original_title": "When Night Is Falling",
      "runtime": 96,
      "poster_path": "/f9edMkT6bLXVvZICn47ARnQ1Iu5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Alliance Communications Corporation",
         "id": 2480,
         "origin_country": ""
      }],
      "release_date": "1995-05-05",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Patricia Rozema"],
      "runtime": 94,
      "synopsis": "A professor at a Christian college begins to question her sexuality after a chance encounter with a female performance artist.",
      "writers": ["Patricia Rozema"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114916/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2OTU5MDMzN15BMl5BanBnXkFtZTcwMTkxNTEzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Pascale Bussières, Rachael Crawford, Henry Czerny | See full cast and crew »"],
      "reviews": [
         "\"The world is a den of thieves and night is falling. Soon it will be the hour for robbers and murderers. Evil is breaking its chains and goes through the world like a mad dog... So it shall be. Therefore let us be happy, let us be kind, generous, affectionate and good. Therefore it is necessary, and not in the least shameful, to take pleasures in the little world, good food, gentle smiles, fruit-trees in bloom and waltzes\" --excerpted from Fanny & Alexander by Ingmar Bergman. Camille (Pascale Bussieres), a professor at a Protestant college, is engaged to Martin (Henry Czerny), a sympathetic minister and fellow professor who clearly loves Camille. As \"career Christians,\" they are urged to get married and to become co-chaplains of the New College of Faith. But Camille is vaguely unhappy with Martin and her life, and when her beloved dog dies suddenly, she begins to lose her grip. As she sits weeping to herself in a laundromat, Camille meets Petra (Rachael Crawford), a flamboyant circus performer. Anyone who has ever lost a pet knows how intangibly devastating it can be, and Camille is sincerely shattered. Petra realizes this, tries to offer solace and is so attracted to Camille that she finds a way for them to cross paths again. When they do meet again Petra flirts brazenly with Camille, who is deeply offended, confused, yet curious as well. Petra, who lives in her own paganly decorated trailer, is part of a \"modern primitive\" circus, not unlike The Jim Rose Circus Sideshow filled with freaks, artists and jolly folk of all ilks. Petra, who is looking to have Camille \"under the moonlight with her head thrown back,\" balks when Camille sheepishly asks if they could just be friends instead (\"like Thelma and Louise, but without the guns?\"), wanting to take her time. The two do become friends and Petra takes Camille hang gliding even though she has to convince her that the price of adventure is fear. For the first time in her proper and very intellectual life, Camille's desire comes rushing forward. She is shocked to find that she is infatuated with Petra. Soon she believes that she is in love. But all is not well with the circus. Hounded by creditors, the circus must leave town, threatening to tear the new lovers apart. Meanwhile, part of Camille is still deeply attached to Martin, who is away trying to get a paper of his published in a seminarian journal while Camille and Petra discover each other. When Martin returns from his business trip and begins to figure out what has been happening, his frustration comes a hair's breadth from turning into rage and tries getting through to her that \"experimentation\" is one thing, but a three year bond is something else entirely. This is a beautiful little film by Patricia Rozema, who also directed the lovely 1987 character study I Heard The Mermaids Singing. Due to a strict Calvinist upbringing Rozema had seen no films before the age of 16, and this film almost serves as a dialogue for her muse, before and after she escaped the doctrines of the church. Pascale Bussieres is wonderful as Camille, who is able to tread that fine line between confusion and curiosity very well. She has an inner beauty that draws not only Petra, but the viewer. There is a calm in her soul that is so very soothing. There is no trace of anger or impatience in her character whatsoever, instead she turns inward and mentally reviews her situation on such a continual basis, always searching for balance, that her trepidatious innocence is the allure that Petra finds so fascinating. With Bussieres' almond eyes, auburn hair and porcelain skin, hers is a very classic sense of beauty that is so dissimilar to Petra's attractiveness (black, sexy, passionate, whimsical) that they make a very complementary match. Petra's initial impetuosity soon smoothes itself out and Camille's reticence begins to ebb as they both realize how much they can learn from each other if they can let their blossoming love develop naturally. There is such a well-measured sense of balance in this film that the love scenes are in turn very highly erotic, as well as touching and moving. Perhaps the most difficult thing a person can ever do is look their partner in the eyes while making passionate love, tell them 'I love you' and have it sound like the most intimate and genuine thing they'll ever hear. Bussieres is able to do this effortlessly. The character of Camille is so very obviously treading into deeper waters than she's ever fathomed before, but she proceeds cautiously enough so that she is able to slowly and wisely understand that the love and understanding she has already been able to appreciate on an intellectual and otherworldly level through the church need not mean that it must be denied to her sensually simply because it's a body of another gender. In fact, the lovemaking she shares with Petra is so unbridled that it unleashes her enough to be able to bring her new- found passion back to her fiancé, which he duly notices and appreciates. Don't misunderstand me: She does cheat on her fiancé, and in so doing, Martin's anger is perfectly understandable, but by that time the world that Camille has tasted and chooses to be a part of is chosen simply because it is one that is not as blindly judgmental as the church. If anything I would say that the film is too short by half an hour simply because the end is more of an escape than a conclusion, but maybe that's the point. Or perhaps, in the tradition of Traffaut, Rozema plans to follow-up her story with Part Two. There aren't any \"evil\" characters in this film, each of the leading roles are characters that are drawn and performed so well that you do end up caring for all of them, so much so that when Martin realizes what has developed between his fiancée and her new girlfriend, the delight you feel for Camille is offset by the empathy you feel for Martin. No matter how painful it is for Martin to lose the love of his life, the film makes it clear that it is much more than just sex with another woman that has persuaded Camille away: It is a way of life that has more to do with living than the cloistered, regimented facades she has grown to endure her entire life. If anything you wonder why Martin doesn't join them, too. I hope this film gets a general release and finds an audience in the shopping malls because it could very gently and significantly open up conversations across middle America about the relationship between desire and gender.",
         "Bought this film a few years back. After viewing it, I came to the conclusion that it was by far one of the most beautifully and artistically directed films i have ever seen that deals with the subject matter of a girl meets girl. The lead actresses Pascale Bussieres and Rachael Crawford had great chemistry and were equally beautiful which made the love scenes all the more believable and erotic. There was no contrived or cliched dialogue and you sympathized with the characters and what they were going through especially when Camille was torn between choosing Martin and Petra. This is by far one of the best Canadian productions made.",
         "This is one of the best lesbian films I've ever watched. What I love most about this film is how the love scenes are tastefully acted and filmed. In contrast, many - if not most - lesbian films leave little left to the imagination. Another stark comparison is the fact that there are no serial killers, psychotics, or otherwise deranged characters. As we all know, it's not only common but inevitably predictable that heterosexually created films depicting G & L characterizations will include at least one of the aforementioned. Another aspect I find tremendously appealing is that the women involved in the depicted lesbian relationship are anyone's woman - meaning, not mannish or ostentatious at all. The script, direction, and acting are immensely above average in the lesbian film genre! All of the actors portray their characters convincingly. The circumstances in which they come together are easily conceivable in a real life scenario. The way it's filmed is appealing and displays moments of arty elements. I am of the opinion that this is a definite must own DVD.",
         "I first rented this film 2 years ago & I am still renting it today when I go to the store. I have never seen love portrayed in such an open,honest,wanting & unsured of their feelings kind of way. It is presented in a way most of us feel when we fall in love for the first time or when we fall in love with someone that is not the norm according to society. Even to this day I am impress with the way Patricia Rozema show the characters in such an emotional way, that leaves the audience understanding why these two people fall in love. By the way Pascale Bussieres and Rachael Crawford were GREAT in this movie! After seeing this movie a viewer truly stops categorizing this movie(in a genre such as lesbian/gay, canadian film, etc)and see that showing a love story is the true purpose of this film. Guys! Don't critize me too much!",
         "A gorgeous, sensual delight. This is one of the most beautiful movies i have ever seen. It is hard to come by honest romantic lesbian movies and catching this one on TV was certainly one of the highlights in the past years. The movie managed to provoke many emotions in me, from joy, to anger, to deep sorrow and everything in between. It got me started to look into the Canadian movie scene more, especially on this type of topic, as there are excellent examples out there, this being a prime one. Since accidentally buying this film a week ago, I've been watching it almost everyday. It is a very moving piece, incredibly romantic and beautifully shot. I have no expertise on movie direction but all credit goes to Patricia for her creativity. Apart from being incredibly gorgeous, the leading ladies gave a very moving performance, which intern moved me.",
         "I have fallen in love with this movie. Since I patiently waited til the price went down and bought the movie I have watched it almost everyday. This movie runs consistent on all levels from beginning to end. The screen images embrace me and pulls me in. The acting (need I say I love Pascale/ Camille)...the lilt in her voice, her facial expressions, subtle yet so enticing. Petra! what a wonderful counterpart. Perfect music that moves the film along. Camille's open-mindedness, and strong self-esteem exudes in this film. When her new sexuality is awakened - she doesn't suppress and feel guilty (which easily could have been due to her strong Christian background). She meets it with some trepidation and yet she is an individual with her own mind and heart...and pushes thru the fear. I just happen to find this movie in Blockbuster...this movie should be seen round the world.",
         "I saw this in the Cinema when it first came out. I didn't know what to expect, I just saw this sensual looking movie poster and decided to go. I was not disappointed, in fact I was enthralled by the lushness of this most beautiful film. Simply put;a love story. The Protagonist, Camille is a Theologian, a Teacher of Mythology. Seemingly happy with her life pretty much mapped out. A handsome boyfriend, a tidy well kept life, a formal career within a religious school. Her world is shaken up by a chance meeting in a laundromat, with of all people a circus performer, Petra. What follows is Camille re-evaluating her life and her loves, the backdrop for her journey is the eclectic, vibrant, theatrical circus. Giving the viewer giddily beautiful scenes, from juggling orbs of light, to romantic interludes, amongst rich theater drapes. This movie took my breath away, I saw it 5 times in that cinema, then followed it to another one, when the run finished. In essence this film made it easier to come to terms with my own sexuality, because of that it will always have a special place in my heart.",
         "A great romantic movie. This is not a slopped-together film for the sake of titillating the hetero male crowd with lesbian sex, nor a cheap, half-baked B-movie for the lesbian audience (I hate it when we settle for less). This is a real film by folks who know what it takes to make a movie (a romance, no less!), deliver a story, and develop its characters. Not since John Sayles' Lianna have I seen a movie of this caliber about a woman coming to terms with her sexuality. It has characters you care about, depth, and a subtle sense of humor. You'll find this movie enjoyable and refreshing, especially if you're tired of the straight movie industry's continued obsession with making gays and lesbians into murderers, psychos, weirdos and laughing stocks, and the gay subculture's portrayal of everyone as tattooed, leathered, and extreme.",
         "This movie is really tender, touching, and warm. The 2 lead actresses were very good and had good chemistry in between them. These 2 have complete opposite personalities with different passions for lives. Yet somehow, they come across with one another and fall in love with each other. Camille fought with her own inner feelings for Petra and finally, she went for who she really loved. The ending is very sweet, the true love staying with each other. Sometimes it is difficult to figure out what you really want but what is more importantly how you embrace it despite all difficulties in life. Camille had to go thru emotional battles with her feelings for her boyfriend and the Christian school job. The circus performances scenes were great and interesting. The lovemaking scene between them is very passionate and romantic. These 2 actresses were excellent. The dialogs are interesting. The director has done an outstanding job with both directing and writing. Overall, it is a great movie to watch and keep for collection. Highly recommended.",
         "Bought this film several years back. It had played at several theatres during its first release but I never did get down to actually viewing this film. When I finally bought the film and watched it, it definately went beyond my expectations. Everything about the film was near perfect. One could feel the emotions that each character was conveying on screen. The film was beautifully shot. The love scenes were incredibly erotic. A near perfect film."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Alliance Communications Corporation",
         "Crucial Pictures",
         "Ontario Film Development Corporation, The"
      ],
      "summaries": [
         "Camille and Martin are in love and teachers at a christian college; they get the opportunity to get a better job, but they would have to marry for that. But when Camille's dog dies, she recognizes that her love for Martin is not even as big as the love for her dog. After that, Camille gets to know Petra, and Petra falls in love with Camille. They meet again, but Camille is very unsure about her feelings. When Martin is away for a weekend, Camille and Petra meet in the Circus where Petra is working as an acrobat. They spend the night together, but Martin finds out about it and is shocked. He has an argument with Camille, and she goes burying her dog in the snow, and falls asleep...",
         "An uptight and conservative woman, working on tenure as a literacy professor at a large urban university, finds herself strangely attracted to a free-spirited, liberal woman who works at a local carnival that comes to town."
      ],
      "budget": 0
   },
   "movielensId": 49,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-05-05",
      "dvdReleaseDate": "2008-02-05",
      "directors": ["Patricia Rozema"],
      "runtime": 96,
      "movieId": 49,
      "title": "When Night Is Falling",
      "mpaa": "",
      "actors": [
         "Pascale Bussières",
         "Rachael Crawford",
         "Henry Czerny",
         "Don McKellar"
      ],
      "imdbMovieId": "0114916",
      "originalTitle": "When Night Is Falling",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A prudish woman, working on tenure as a literacy professor at a large urban university, finds herself strangely attracted to a free-spirited, liberal woman whom works at a local carnival which comes to town.",
      "tmdbMovieId": 8391,
      "avgRating": 3.56084,
      "releaseYear": "1995",
      "numRatings": 263,
      "posterPath": "/wnUuYc9XnWrTTAGz8YjjULA3Zmr.jpg"
   }
}