{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "brothel",
            "id": 1411
         },
         {
            "name": "passion",
            "id": 2983
         },
         {
            "name": "longing",
            "id": 4115
         },
         {
            "name": "geisha",
            "id": 4342
         },
         {
            "name": "deceived wife",
            "id": 4481
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "based on true events",
            "id": 185722
         }
      ],
      "imdb_id": "tt0074102",
      "video": false,
      "title": "In the Realm of the Senses",
      "recommendations": [
         4497,
         1559,
         776,
         20530,
         15244,
         4495,
         16672,
         17295,
         31417,
         26596,
         3763,
         48035,
         965,
         25508,
         20108,
         3,
         1818,
         25504,
         27030,
         216
      ],
      "backdrop_path": "/pdTK37YRrMGXNQniCN5Y15rYi90.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Sada",
               "gender": 0,
               "credit_id": "52fe4429c3a36847f8085cfb",
               "name": "Eiko Matsuda",
               "profile_path": "/liSGXTPIOgk4YYu9NAFQEnq9md4.jpg",
               "id": 46239,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Kichi-so",
               "gender": 2,
               "credit_id": "52fe4429c3a36847f8085cff",
               "name": "Tatsuya Fuji",
               "profile_path": "/mg36iyg1mB0bEK6OGOX1Dfg9TxA.jpg",
               "id": 21503,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Toku",
               "gender": 0,
               "credit_id": "54d90712c3a3687ab9000055",
               "name": "Aoi Nakajima",
               "profile_path": null,
               "id": 142535,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Tagawa Inn Manager",
               "gender": 0,
               "credit_id": "54d90721c3a3687aac000069",
               "name": "Yasuko Matsui",
               "profile_path": null,
               "id": 136880,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "559010779251412c43000c5b",
               "name": "Meika Seri",
               "profile_path": null,
               "id": 310173,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "55901084925141648900247a",
               "name": "Kanae Kobayashi",
               "profile_path": null,
               "id": 134619,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "55901091c3a3685d45002ac2",
               "name": "Taiji Tonoyama",
               "profile_path": "/o3YTph69XZqKeZOerzUpTTAYirW.jpg",
               "id": 33732,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 1,
               "credit_id": "559010a4925141325f000072",
               "name": "Akiko Koyama",
               "profile_path": null,
               "id": 552315,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4429c3a36847f8085cd3",
               "name": "Nagisa Ōshima",
               "profile_path": "/4ipOYgv1UB99mvob5WDmIbaxdMV.jpg",
               "id": 46230,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4429c3a36847f8085cd9",
               "name": "Nagisa Ōshima",
               "profile_path": "/4ipOYgv1UB99mvob5WDmIbaxdMV.jpg",
               "id": 46230,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4429c3a36847f8085cdf",
               "name": "Nagisa Ōshima",
               "profile_path": "/4ipOYgv1UB99mvob5WDmIbaxdMV.jpg",
               "id": 46230,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4429c3a36847f8085ce5",
               "name": "Anatole Dauman",
               "profile_path": null,
               "id": 2304,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4429c3a36847f8085ceb",
               "name": "Minoru Miki",
               "profile_path": null,
               "id": 46233,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4429c3a36847f8085cf7",
               "name": "Keiichi Uraoka",
               "profile_path": null,
               "id": 46238,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "588526479251413edb020d7f",
               "name": "Hideo Itô",
               "profile_path": null,
               "id": 1538938,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 10.530688,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 5879,
      "vote_count": 133,
      "budget": 0,
      "overview": "Based on a true story set in pre-war Japan, a man and one of his servants begin a torrid affair. Their desire becomes a sexual obsession so strong that to intensify their ardor, they forsake all, even life itself.",
      "similar": [
         1904,
         346,
         616,
         324786,
         64686,
         10867,
         246,
         58857,
         548,
         11878,
         14537,
         1249,
         649,
         11712,
         50270,
         3777,
         11948,
         11953,
         65496,
         9025
      ],
      "original_title": "愛のコリーダ",
      "runtime": 105,
      "poster_path": "/ztLv3Co2uLZMV7YERWbPrTMUi03.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Argos Films",
            "id": 6116,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Oshima Productions",
            "id": 13139,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shibata Organisation",
            "id": 14668,
            "origin_country": ""
         }
      ],
      "release_date": "1976-05-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nagisa Ôshima"],
      "runtime": 109,
      "synopsis": null,
      "writers": ["Nagisa Ôshima"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0074102/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNzU5NzgxOV5BMl5BanBnXkFtZTcwNjIyMjk1Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tatsuya Fuji, Eiko Matsuda, Aoi Nakajima | See full cast and crew »"],
      "reviews": [
         "'Empire Of The Senses' is one of the least seen and much debated movies of the Seventies. \"Least seen\" because in many countries, including the one I live in, it has been banned, or only available in censored versions for many years. This movie divides people - those that like it hail it as ART, those that don't dimiss it snobbishly as PORN. Both camps are fooling themselves! 'Empire Of The Senseless' is BOTH. Is it \"serious\"? Yes. Is it voyeuristic and prurient? Yes. Is it a masterpiece? Not quite. Is it worth watching? Very much so. In fact I'd say it was essential viewing for anyone interested in extreme or taboo-breaking movies. The Seventies were the decade where the boundaries of screen sex, violence and disturbing imagery were repeatedly stretched. Peckinpah's 'Straw Dogs' and 'Bring Me The Head Of Alfredo Garcia', Bertolucci's 'Last Tango In Paris', Scorsese's 'Taxi Driver', Kubrick's 'A Clockwork Orange',were all milestones, and the the art movies of Herzog, Warhol, Pasolini, and Jodorowsky battled it out with the horror and exploitation of Russ Meyer, Dario Argento, John Waters,and David Cronenberg. Add to that the unexpected crossover success of 'Deep Throat' and the very existence of shockers like 'Ilse, She Wolf Of The SS' and 'Cannibal Holocaust', and what do you get? The artificial and meaningless divisions of genres, \"high art\" vs \"trash\", new ways of thinking vs new ways of making money, it was all on the table. For one brief decade it looked like a brave new world. Then everything that was gained was lost - Spielberg and Simpson/Bruckheimer cleaned up (financially and aesthetically), and things have never been the same since. Watch 'Empire Of The Senseless' with that in mind. It may be flawed - you'll be alternatively fascinated and bored - but it is an important movie from an important period in movie history.",
         "It's clear that a lot of people can't get past the explicitness of this film, which is a shame. I recall a lot of embarrassed giggling last time I saw it at the cinema. The art/pornography debate seems futile to me - this is a film about an obsessive sexual relationship/love affair and it tells it like it is. But it's about as far away from the likes of \"Debbie Does Dallas 26\" as you can get. The film is clearly serious in intent and there is a lot of beauty in it. The subtle political content/context of the film is often overlooked - some of the few scenes shot outside the bedroom show groups of soldiers marching the other way from the direction our characters travel - and we all know where the rising Japanese militarism and nationalism of the 1930's led. I think the best comparison is probably with a film like \"Last Tango in Paris\" which dealt with similar themes in a similar way - and was probably also pretty boring for those with a short attention span.",
         "Sure, everyone (or most everyone) has heard about \"Sex, Lies, and Videotape\" and its remarkable statement about human sexuality. However, it is unlikely that as many people have heard about this film, which in a totally different way makes perhaps as profound a statement about that topic. In fact, if you see an uncut version of this film, you are in essence watching pornography. That is, you are watching incredibly graphic sexual content that simply would not be allowed in an American film. I won't spell it out for you, but I will say this...do you know what they can't show you in American movies? This one shows that. And quite a bit more. This is not the type of sex you would see in a film like \"Sex, Lies, and Videotape\" or \"Bliss\" or some of the other decent American films about sex (though I can't think of any others). This is more like the sex shown in \"Last Tango in Paris.\" The characters are so self-destructive and dangerous that the sex (one of the most inherent of all human practices) becomes an expression of their inhumanity. This is not easy stuff. But if you are willing to find an uncut version and experience the true power of this film, you may find yourself moved by the things you see. This film blurs the line between pornography and art, and I believe that it stays one inch to the art side, but decide for yourself. Either way, I think that it is about time for American films to truly explore that distinction.",
         "Vague spoilers Sada and Ishida share a passion for sex. She (Sada) is the aggressive one, possessive and inflammatory. He is relaxed and submissive, soaking it all up like an opium addict. Indeed, as they gradually spiral into depravity and self-destruction, the whole thing looks not unlike a drug addiction. The film exercises the mind rather than the body \u0096 so yes, it's art. Is the sex meant to cause arousal? Sada looks sultry during the sex scenes \u0096 the pouting lips and dangling hair make it look attractive. Indeed, would there be any point in depicting it graphically if was meant to be dull? Nobody likes dry sex. On the other hand, neither does it play like a porno movie. The sex is intense rather than intimate, and often has disturbing undertones. Various onlookers who witness the couple's performance remain unconcerned at the sight of it. The sex therefore arouses the viewers' senses rather than the libido. This makes it a very sophisticated film indeed. Whether it is immoral is, as usual, a subjective issue. Many will think so, many will not. A more useful debate is whether graphic sex is necessary to the story. Well, probably not. Other approaches may be just as effective. However, then it would be a different film and you probably wouldn't be here reading this now. Oshima knew that the gruesome fascination of the actual act would keep the film vital, and this amount of simulated sex would have been dreary indeed. So then, is it successful? Well, partly. Once we have grasped that the film is a focused approach to a monomania, it is not difficult to become immersed in it. On the other hand, sex is essentially a repetitive thing and the film frequently finds itself on the rocks of repetition. But Oshima does not compromise, despite that he must know that each new scene is apt to bring forth a slight groan. This is not to say that the director suffered a major lapse of judgment, but probably most people would admit that substituting some of these scenes for others that provide more depth to the characters and their lives would have helped the narrative enormously. It does largely hang together. Sada's descent into 'realm of the senses' (or the 'bullring of love' as the title may be read in Japanese) is depicted with perfect force and clarity. One does not doubt the couple are very much in love. Also, Sada's outrageous sexual appetite is genuine: in an early enigmatic scene she offers herself to a tramp, showing both her sexual 'sympathy' as well as her perverse tastes. The tramp is no match for her however, and his own member is cowed into submission. The first hint of her power. When Sada is not having sex with Ishida (which is not often) she is in bed with a client, an old intellectual. Here she learns to connect sex with pain as an extension of her mental torment in missing her lover. Later, with Ishida, pain becomes an extension and an enhancement of sex itself. Things then start to get bizarre. Sada dips food into her vagina before feeding it to Ishida while a geisha sits close by playing a shamisen. She makes him have sex with an old woman \u0096 Ishida cannot resist the challenge \u0096 and the conflicting emotions of horror and fascination that play on her face as she looks on is one of the most stunning scenes of the film. Eventually, even the geishas begin to scorn the couple's never-ending frolicking. This is a warning that all is not well, and the couple deal with it characteristically: she becomes aggressive, he laughs it off. However, we are now on a judgemental path. Things become increasingly intense and claustrophobic as the couple gradually experiment deeper and deeper in their ecstasy. Once they have reached the extremity of life, they start to flirt with death. Ishida is the more complex character, urbanely playing along with Sada's demands while sometimes showing just a hint of doubt and restraint. Passion for him has a tender side (he says the old woman reminded him of his mother) and he gradually reveals a fatalism that suggests a vague depression. Finally, he yields himself completely to the Sada's suffocating passion which leads to his (now inevitable) destruction. The role of children in the film, although slight, is perhaps unnecessary and regrettable, and the ending is marred by an abrupt stentorian voice-over which gives the impression that the film suddenly considers itself to be a documentary. Overall, however, this is an intense, beautifully made motion picture which craves indulgence and patience but is very rewarding, if only out of its sheer uniqueness. For a film which contains 90% fornication, there is plenty to think about.",
         "It has been described as the Japanese Last Tango in Paris- a fair comparison. For both films explore in a truly raw and puissant manner the sexuality and psychology of sex. Ai No Corrida is an overwhelming experience, if for nothing else than its sheer audacity. But Corrida is so much more than sex. It delves into a shrouded netherworld of experimentation and pain. The world of De Sade. Yet it is not turgid or depraved; it is not repugnant or diabolical. It is a poetic voyage into the unknown. It is about the search for pure fulfillment and pleasure. Nothing else in the world presented matters, reality is discarded. And thus the cause for the tragedy which ensues. The two protagonists separate themselves from all that is real for they know that to find true happiness they must transcend all levels of reality and consciousness to a mighty plane. But such a place is transient. Yet the few glorious moments in such a world are worth any heartache that follows. It was a film ahead of its time and I believe that it is still. The sparse few in the audience snickering and snorting confirmed this. It is one of those films whose reputation has preceded it and is so well known in Arthouse circles that disappointment may be said to be inevitable. But this film lives up to its reputation. For it is a truly explicit and daring film as it challenges the common perception that happiness is conformity. It proposes that true happiness is unobtainable in this world and to gain it you must sacrifice the flesh, to forward and improve the soul. Yet this film made twenty-four years ago has been forgotten in the industry for where is its influence, its mark? Few films have used pornography in such a way since. And sex is still relegated to the flea-pit cinemas and backstreet shops. Arthouse films which depict sex, even those which do so explicitly, present it as the result of the character's exploration or development. As a curiosity, or as symbolic of the ascension of a particular player. Corrida uses sex to forward the plot, to illustrate the personalities of its protagonists, to symbolize everything in their fragile society. Sex is the plot development, sex is the key player and sex is the message. The sex takes centre stage. Each new scene is the result of sex, not vice versa. This truly original concept has never taken hold. Why not? Surely the Arthouse circuit would realize the potential and milk it dry. And yet Corrida and a handful of others are the only films to take advantage. This is why Ai No Corrida is a masterpiece. The acting, the direction, script etc... are all brilliant. But the ideas and concepts and invention are what makes Corrida one of the most superb films ever made. A film unknown except to those in the Arena. A film which took no hold, was as distant and mysterious as the world it depicted. A fleeting landmark that should have shook the world; but, maybe rightly, will always remain a forgotten treasure.",
         "Nagisa Oshima has achieved what few other directors have managed in dealing with the very touchy subject of sex, in this instance, with sexual obsession. If you plan to watch this movie for a cheap sexual thrill, you will be most disappointed. Oshima has drawn from a real incident reported in a 1936 Japanese newspaper. The film centers around the love between two people expressed physically, graphically, into realms of the senses where few dare to tread. And with good reason. This is a very intense film as it progresses from the attraction of two people through increasing experimentation in an effort not only to express their passion but to try to find the outer most limits of passion itself. Oshima must have had something metaphorical in mind but the journey as chronicled in the film also has retained the feel of the specifics. It's quirkey and eccentric. The backdrop of the story is as interesting as the story itself. It is an amazing spectacle to observe, giving the viewer a perspective on Japanese life not usually rendered but often alluded to in some historical accounts. One wonders what this experience must have been like for the actors. Oshima has managed what I have always believed should be done in order to treat the subject of sex fully and without shrinking from its' less savory aspects. This is serious minded erotica and quite unlike anything else on screen. The only other film I can recall that compares at all is \"Taxi Zum Klo\" which was autobiographical and starred a number of actual people playing themselves.Obviously a different catagory in that regard from what is going on here, but both films draw much of their power from explicitly sexual scenes without compromising the integrity of the story being told. This is a film experience that should not be missed.",
         "This movie was quite a shocker when my friend and I rented it a few years back. It was clear from the first explicit sex scene that this movie was going to be different from the types of movies my friend and I were generally used to. After having viewed it recently again, and this time focusing more on the intrinsic value of the film rather than just on the shocking images alone like I had the first time I viewed it, I was surprised to find a dark, disturbing psychological drama about sexual obsession that really held my interest. It is interesting to note how the male and female leads, who both seem emotionally sterile to the world around them and are barely communicative towards one another in the traditional and normal sense, are inseparably bonded by a strange and sexual attraction they have for eachother. It is a fatal attraction of the darkest kind I've ever witnessed in a movie. This movie is definitely not for all tastes or who are easily offended by graphic scenes of sex. But for those adventurous souls looking for something different and interesting, I recommend this film. Nagisa Oshima's other films of interest are Merry Christmas, Mr. Lawrence and the recent Taboo.",
         "\"In the realm of Senses\" is so wonderfully plotted and expertly acted that it almost has a dream-like effect\u0085 It's an erotic fantasy turned nightmare\u0085 It is the story of a sexual relationship between a young Japanese couple\u0085 At first lustful and erotic, they can't get enough\u0085 However, their experiments in sensationalism end in tragedy\u0085 The film is flavored with strange yet genuinely humorous moments\u0085 For example, an older lady chance upon the lovers, and\u0097for the fun of it\u0097the young man initiates a ménage à trois\u0085 The incident proves to be so exhilarating that the old woman dies from exhaustion... The scene is played with such vivacity and intensity that\u0097despite the fatal outcome\u0097it does have a strange humorous overtone to it\u0085 Director Nagisa Oshima developed with great care all the minor details of this affair without ever becoming overbearing or intending to teach...",
         "There is nothing in cinema that I can think of that compares to In The Realm Of The Senses. It is in a class of its own: beautiful, tender, sensual, erotic, horrifying. I can still remember the shock of seeing it perhaps twenty years ago: not just at the explicitness of the images, in every sense, but at the extraordinary passion and honesty of the two central performances, and Oshima's direction. Despite the violent nature of the film, and the fact that it is based on a true event, I cannot think of another film that so truly captures the intensity of any emotional and sexual relationship at some point in its incarnation. If you have ever felt love and desire at their most powerful - the wish not to possess someone, but to become part of them and share with them how they experience the world - then you will recognize that feeling here. While certainly not a map for any relationship you might wish to have (I pray!), this film says more about what it means to be a man or woman than any other film I have seen.",
         "This film brought down boundaries with the U.K.censors. This film was finally passed by the British censors in the early 90's. It explores every aspect of unhealthy sexual obsession. From being \"clingy\" to someone, to being bored with someone to the extent that you try to excite the situation with dangerous actions i.e. strangulation games. Performance wise the film is first rate, especially the performance from Tatsuya Fuji, probably giving the performance of his life. Director Nagisa Oshima is a man,even to this day,who is not afraid of controversey. His latest film Gohatto(Taboo)is testament to that,focusing on gay samurai,which is a controversial subject in itself. In the Realm of the Senses is a very rarely seen film. If you ever get the chance to check it out, do so. It is an unforgettable and shocking experience."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Argos Films",
         "Oshima Productions",
         "Shibata Organisation"
      ],
      "summaries": [
         "Based on a true story set in pre-war Japan, a man and one of his servants begin a torrid affair. Their desire becomes a sexual obsession so strong that to intensify their ardor, they forsake all, even life itself.",
         "A passionate telling of the story of Sada Abe, a woman whose affair with her master led to a sexual obsession which then came to a violent end."
      ],
      "budget": 0
   },
   "movielensId": 495,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1976-05-15",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Nagisa Ōshima"],
      "runtime": 105,
      "movieId": 495,
      "title": "In the Realm of the Senses",
      "mpaa": "",
      "actors": [
         "Eiko Matsuda",
         "Tatsuya Fuji",
         "Aoi Nakajima",
         "Yasuko Matsui",
         "Meika Seri",
         "Kanae Kobayashi",
         "Taiji Tonoyama",
         "Akiko Koyama"
      ],
      "imdbMovieId": "0074102",
      "originalTitle": "愛のコリーダ",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["B0xQiV3EXtQ"],
      "plotSummary": "Based on a true story set in pre-war Japan, a man and one of his servants begin a torrid affair. Their desire becomes a sexual obsession so strong that to intensify their ardor, they forsake all, even life itself.",
      "tmdbMovieId": 5879,
      "avgRating": 3.44342,
      "releaseYear": "1976",
      "numRatings": 760,
      "posterPath": "/ztLv3Co2uLZMV7YERWbPrTMUi03.jpg"
   }
}