{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "date",
            "id": 248
         },
         {
            "name": "conversation",
            "id": 4433
         },
         {
            "name": "secretary",
            "id": 11677
         },
         {
            "name": "dinner date",
            "id": 208467
         }
      ],
      "imdb_id": "tt0111689",
      "video": false,
      "title": "What Happened Was...",
      "recommendations": [47055],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Jackie Marsh",
               "gender": 1,
               "credit_id": "52fe48b79251416c91095f8b",
               "name": "Karen Sillas",
               "profile_path": "/kjvCblLqywvFknAxmQgHAtKabPx.jpg",
               "id": 135162,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f8f",
               "name": "Tom Noonan",
               "profile_path": "/cpINV4Q8IeVgSLyKz9ldzzAGr5n.jpg",
               "id": 119232,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f51",
               "name": "Tom Noonan",
               "profile_path": "/cpINV4Q8IeVgSLyKz9ldzzAGr5n.jpg",
               "id": 119232,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f57",
               "name": "Tom Noonan",
               "profile_path": "/cpINV4Q8IeVgSLyKz9ldzzAGr5n.jpg",
               "id": 119232,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f5d",
               "name": "Tom Noonan",
               "profile_path": "/cpINV4Q8IeVgSLyKz9ldzzAGr5n.jpg",
               "id": 119232,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f63",
               "name": "Ted Hope",
               "profile_path": null,
               "id": 5952,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f69",
               "name": "Scott Macaulay",
               "profile_path": null,
               "id": 4899,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe48b79251416c91095f6f",
               "name": "Robin O'Hara",
               "profile_path": null,
               "id": 4898,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48b79251416c91095f75",
               "name": "James Schamus",
               "profile_path": "/9E0gGd0rhOZyMnBAeIqFfCAPqzn.jpg",
               "id": 1617,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f7b",
               "name": "Tom Noonan",
               "profile_path": "/cpINV4Q8IeVgSLyKz9ldzzAGr5n.jpg",
               "id": 119232,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b79251416c91095f81",
               "name": "Joe DeSalvo",
               "profile_path": null,
               "id": 786406,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe48b79251416c91095f87",
               "name": "Daniel Ouellette",
               "profile_path": null,
               "id": 929960,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.485383,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 83718,
      "vote_count": 9,
      "budget": 0,
      "overview": "Jackie and Michael are coworkers at a large law firm, who decide to meet at Jackie's for dinner one night.",
      "similar": [
         19913,
         539,
         35056,
         38055,
         147773,
         44363,
         339397,
         2313,
         166,
         10890,
         20069,
         11013,
         11610,
         10843,
         13401,
         7859,
         55580,
         4593,
         9660,
         9842
      ],
      "original_title": "What Happened Was...",
      "runtime": 91,
      "poster_path": "/1uMZU6c8Uxlp2OiGQIwGmH4D9EZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Good Machine",
            "id": 10565,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Samuel Goldwyn Company",
            "id": 8888,
            "origin_country": ""
         }
      ],
      "release_date": "1994-09-09",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tom Noonan"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Tom Noonan",
         "Tom Noonan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111689/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwMTY0NTY5OF5BMl5BanBnXkFtZTcwOTIzODEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tom Noonan, Karen Sillas | See full cast and crew »"],
      "reviews": [
         "I watched this movie the other night and I thoroughly enjoyed it. However, you must be in the proper mood to enjoy a movie such as this. This movie centers around 2 lonely characters, man and woman, on a 'first' date at the woman's apartment. This movie is not too funny nor is it fast paced. The movie simply tries to flesh out each person's character for 90 minutes. This movie also led to some candid discussion between my fiancé and I, especially about the man's 'troubles' at the end of the film. We also discussed if there would be a 'second' date between them. The movie is steeped in realism and is shot very well. Worth a look if you're in the proper mood for a slow but interesting, character development story. 6 out of 10.",
         "***SPOILERS*** \" What Happened Was\" is a story about hurt and loneliness in the big city and how it effects two people Michael & Jackie Tom Noonan & Karen Sillas, who are co-workers at a big NYC law firm. Michael is a paralegal and Jackie is an executive assistant as they both spend what at first seems to be a quite evening dinner at Jackie's apartment that leads to an emotional explosion which exposes the mask that they've been wearing at their job all these years. Jackie really likes Michael very much and finds in him the reason for her to get up every morning and go to work. Single like Michael she as well as him want to have a relationship to put a wedge between the loneliness that they both feel but living as they do in a major modern metropolis in a way forces them not to be themselves. Michael is far more deluded then Jackie, who's more down to earth and honest about herself, in him thinking that he's a big time social activist who's writing a book, that he tells Jackie took him fifteen years to write, about the law profession and how it hurts those that it deals with. Michael in fact is really a very insecure young man afraid of facing life and thus losing himself in a fantasy world that he created for himself inside his living room watching TV shows mostly on the Discovery Channel. It comes as a great shock to Michael's ego when Jackie shows him a children book that she wrote that was published unlike his imaginary work on social injustice. Throughout the entire film Jackie does what she can to loosen Michael up, with almost an entire bottle of wine, and in the end he does seem to come out of his shell and really starts to get it on with Jackie. Still his insecurity keeps him from really being responsive to her feelings about him and it's that reaction that leaves Jackie in tears as she feels she made a fool of herself trying to get Michael to fall in love with her like she's with him. Michael is finally brought down to earth when he realizes how he hurt Jackie with his overwhelming sense of self-importance. Michael's clumsy attempt to make things right after he tried to leave her just as Jackie thought he would stay over night left her with a sense of outraged. It's then that she tells Michael just what she thought of him, this after how she felt all this time about him, and how he was the only person to make her happy in the office that they both worked at. That revelation by Jackie hit Michael so hard that for once he opens up to her and is honest about himself, not at first realizing her feelings that she had for him, and tries to make amends for what he, unconsciously, put her through that evening. Heart-felt and moving film about how people have trouble connecting with each other and how two people who worked and were friends for years at the job together are like fish out of water and strangers when they meet and try to start up a serious relationship out of the workplace.",
         "Tom Noonan and Karen Sillas portray a disaffected NYC couple- co-workers who are now on a dinner date. Tom Noonan is somewhat menacing and unpredictable. Interesting presence. (You may recall him from \"Manhunter\"). Basically, the film develops as the two discuss their jobs(which they hate) but they have other projects in the works, Sillas published a children's book. Tom Noonan portrays an Ivy League graduate, working as a paralegal who is both amused and disgusted by the attorneys at the firm. He is defensive about why he works at said firm, and Sillas finds him interesting, saying he must have some grand plan to get revenge on the attorneys at the firm. The only somewhat nebulous plot point is where Sillas reads the \"children's book\" she has written, which turns out to be quite violent. I will not spoil it for those who have not yet seen this movie, but suffice it to say, it is very strange. All in all an entertaining film, about alienation and dating in NYC, which has a creative distinction- it is one film in the past ten years that does NOT try to imitate Woody Allen!. 8/10",
         "This movie is certainly NOT for everyone. And I would whole heartedly agree with people who feel mislead by the cover of the videotape because it doesn't create any idea of what the movie is. What the movie is, is a very finely crafted film much like \"My Dinner With Andre\" but much more somber. The layers of these characters peel off as they become more and more comfortable with each other and it creates for an almost voyeristic feel that lends the movie an immediate impact credibility. This movie is reflective of how many, many people interact and present themselves as something they are not and how fragile people can really be. We see and work with people every day who could be lost souls, lonely hearts, broken egos etc.....and this movie simply reminds us that not everyone is what they seem and that the world is full of lost, lonely people. Obviously not a subject that lends itself to the average movie-goer but if you like outstanding writing and want to see what can be done with TRULY indepenent movies, this is the movie for you. I HIGHLY recommend it to literate movie fans.",
         "This movie may not appeal to all people (as I see from another comment) but was a great, biting, black movie with A+ dialogue. It brings you into the lives of two people, who are not all they appear to be. Tom Noonan is a brilliant screen writer. It is a one-room setting, like a play, but reels you in regardless (like Lifeboat). If you don't appreciate dialogue and the idiosyncrasies of human nature, you will not appreciate this movie.",
         "I can't say if it is a good or bad movie, but what I believe is that it is a real life movie: I must know it, it describes what many of us have lived in real life, actually, it is a mirror image of many lives. I do not mean by that I am some dysfunctional guy, but everybody has a little of that. You should watch it; it is possible that you may find yourself re-living some personal experience. It is not a typical Hollywood movie, it is a rather practical and real life experience that as you watch you begin feeling as if some knew about you and made it a movie. I watched this movie with my wife and she kept on joking about how similar the story was with our first dates.",
         "What Happened Was is a movie of creepy intensity that is both affecting and disturbing. Talented writer/director/actor Tom Noonan allows the viewer to be a fly on the wall for a first date that starts off awkward and painful and then veers into the uncomfortably intimate. Michael and Jackie could be anyone you work with, pass every day in the hall, and never realize what's going on in their strange inner worlds. Lonely and simultaneously starved for meaningful human companionship and afraid of it, by the end of the date Michael and Jackie reveal themselves in ways that are real and fascinating while also being scary in a way that few movies are. A must see for anyone interested in the dark recesses of the human mind.",
         "An astonishing, captivating film. One of the toughest tricks to pull off is making film people talk like real people; director/writer Noonan does it o.k. This film generates a prickling, enjoyable sense of unease in the viewer, which gives way to discomfort and then alarm; and then on to awkwardness and the hope for reconciliation. The only other Noonan film I've seen, apart from his cameo in the enjoyable hokum `Heat,' is `The Wife,' which I feel is less successful. One of the small cast of that film is Wallace Shawm, star of `My Dinner with Andre,' which has been mentioned her by another reviewer. As he says, `What Happened Was' is on similar territory to `Andre,' but it's much more somber and doesn't give that `redeeming' feeling at its end. Demanding and rewarding.",
         "A daring movie with few equals: a journey into the heart of darkness of the date from hell. Two seemingly quiet, reserved folks teeming with disturbing secrets and half-truths reveal themselves to us and each other in an increasingly frightening crescendo. Deception, life, the skeletons of a nightmare closet. Gripping, a bit over-long, perhaps, but well worth the time. As of this writing I have rented and seen the film 4 times and each time I've learned something about myself, about my world and about vanity, trauma and deception.",
         "Essentially a one act play about the pathos in the meeting of two lonely, damaged people who can't communicate their feelings and intentions, this character study reminds you of the most disturbed Woody Allen personas, and Brando's character in \"Last Tango in Paris\"- narcissistic, haunted by the past and continually oscillating between isolation and the desire that someone will rescue them from deep seated shame. Unpretentious, tense and compelling, \"W.H.W\" never lapses into sentimentality, and seems more focused than comparable more recent films such as \"Heavy\". It succeeds because of its sensitive treatment of a difficult subject."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Genre Pictures",
         "Good Machine"
      ],
      "summaries": [
         "This darkly humorous film explores the personal psychic landscape of two lonely New Yorkers. Jackie and Michael are coworkers at a large law firm, who decide to meet at Jackie's for dinner one night. As this 'first date' plays out, the audience is guided through a mental minefield of disappointment, desolation, and desperation. Their conversation, with its awkward 'small talk', slowly reveals their unhappy lives....",
         "Jackie, a secretary in a legal firm, invites Michael, a paralegal in her office, over for a dinner date. The film follows the course of their evening as the two manage to surprise each other with hidden, unexpected twists of character."
      ],
      "budget": 120000
   },
   "movielensId": 496,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-09",
      "dvdReleaseDate": null,
      "directors": ["Tom Noonan"],
      "runtime": 91,
      "movieId": 496,
      "title": "What Happened Was...",
      "mpaa": "",
      "actors": [
         "Karen Sillas",
         "Tom Noonan"
      ],
      "imdbMovieId": "0111689",
      "originalTitle": "What Happened Was...",
      "genres": [
         "Thriller",
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "O97kuR4oRok",
         "SOSNE_ZjgJY"
      ],
      "plotSummary": "Jackie and Michael are coworkers at a large law firm, who decide to meet at Jackie's for dinner one night.",
      "tmdbMovieId": 83718,
      "avgRating": 3.29599,
      "releaseYear": "1994",
      "numRatings": 424,
      "posterPath": "/1uMZU6c8Uxlp2OiGQIwGmH4D9EZ.jpg"
   }
}