{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shakespeare",
            "id": 497
         },
         {
            "name": "bachelor",
            "id": 1338
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "rage and hate",
            "id": 3927
         },
         {
            "name": "lover",
            "id": 4320
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "intrigue",
            "id": 34038
         }
      ],
      "imdb_id": "tt0107616",
      "video": false,
      "title": "Much Ado About Nothing",
      "recommendations": [
         8293,
         1245,
         2107,
         10631,
         10705,
         4584,
         9087,
         8866,
         9587,
         2039,
         17589,
         1552,
         11790,
         12157,
         859,
         10480,
         9095,
         10445,
         3784,
         3525
      ],
      "backdrop_path": "/lREt2ifyEjxdxmsqkWnmoFaIcZF.jpg",
      "revenue": 22551000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Benedikt",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d12f",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Signor Leonato",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d137",
               "name": "Richard Briers",
               "profile_path": "/cdOxeResI28YXe912GbQKKvbKv8.jpg",
               "id": 29859,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Dogberry",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d143",
               "name": "Michael Keaton",
               "profile_path": "/myVdrYNGTgqunLfUSaM8DuVD7DL.jpg",
               "id": 2232,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Claudio",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d14b",
               "name": "Robert Sean Leonard",
               "profile_path": "/90xoBVpR2LzaFdo83KmcxjXR7Dg.jpg",
               "id": 2692,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Don Juan",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d13b",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Beatrice",
               "gender": 1,
               "credit_id": "52fe44ad9251416c7503d133",
               "name": "Emma Thompson",
               "profile_path": "/cWTBHN8kLf6yapxiaQD9C6N1uMw.jpg",
               "id": 7056,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Don Pedro of Aragon",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d13f",
               "name": "Denzel Washington",
               "profile_path": "/semwsON3dN3np6cyzlCw7F2YDGe.jpg",
               "id": 5292,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Hero",
               "gender": 1,
               "credit_id": "52fe44ad9251416c7503d14f",
               "name": "Kate Beckinsale",
               "profile_path": "/jlleQafwnW1j0mvxJLiqnNL2mYh.jpg",
               "id": 3967,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Friar Francis",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d147",
               "name": "Jimmy Yuill",
               "profile_path": "/zeuinVj4XOYzWSty96mM3SaD1mB.jpg",
               "id": 151797,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Antonio",
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d153",
               "name": "Brian Blessed",
               "profile_path": "/azFYGqcDS1Oo8skhbHzGPZSICTU.jpg",
               "id": 8318,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Ursula",
               "gender": 1,
               "credit_id": "52fe44ad9251416c7503d157",
               "name": "Phyllida Law",
               "profile_path": "/iL3UchWZqdk6RabqDZW9HBcJDwQ.jpg",
               "id": 17787,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Margaret",
               "gender": 1,
               "credit_id": "52fe44ad9251416c7503d15b",
               "name": "Imelda Staunton",
               "profile_path": "/mKlkh0AuYPD5HjmnlrW0uPm5QvJ.jpg",
               "id": 11356,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Balthazar",
               "gender": 2,
               "credit_id": "5a49afcf0e0a262db9008c68",
               "name": "Patrick Doyle",
               "profile_path": "/mo87kZiHO5gsoax80Us0S2CPmS.jpg",
               "id": 9152,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d101",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d107",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d10d",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d113",
               "name": "Stephen Evans",
               "profile_path": null,
               "id": 39992,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d119",
               "name": "David Parfitt",
               "profile_path": null,
               "id": 20062,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d11f",
               "name": "Patrick Doyle",
               "profile_path": "/mo87kZiHO5gsoax80Us0S2CPmS.jpg",
               "id": 9152,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d125",
               "name": "Roger Lanser",
               "profile_path": null,
               "id": 48971,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ad9251416c7503d12b",
               "name": "Andrew Marcus",
               "profile_path": null,
               "id": 4868,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "542fd0ec0e0a26464600013b",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "5823d8cb9251411a3b001976",
               "name": "Michael Trent",
               "profile_path": null,
               "id": 1327842,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ab29c7cc3a3686fd200f54a",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.78549,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11971,
      "vote_count": 249,
      "budget": 11000000,
      "overview": "In this Shakespearean farce, Hero and her groom-to-be, Claudio, team up with Claudio's commanding officer, Don Pedro, the week before their wedding to hatch a matchmaking scheme. Their targets are sharp-witted duo Benedick and Beatrice -- a tough task indeed, considering their corresponding distaste for love and each other. Meanwhile, meddling Don John plots to ruin the wedding.",
      "similar": [
         6557,
         2959,
         50124,
         24,
         712,
         10521,
         11931,
         10330,
         15590,
         7942,
         10030,
         10210,
         9716,
         6022,
         12309,
         2020,
         5544,
         6641,
         918,
         9027
      ],
      "original_title": "Much Ado About Nothing",
      "runtime": 111,
      "poster_path": "/6qlYYvDZ0Tb5h0t7sLwy4sjGIwM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Renaissance Films",
            "id": 3102,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American Playhouse Theatrical Films",
            "id": 8827,
            "origin_country": ""
         },
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         }
      ],
      "release_date": "1993-05-07",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Romance. Mischief. Seduction. Revenge. Remarkable.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kenneth Branagh"],
      "runtime": 111,
      "synopsis": "Don Pedro, prince of Medina ( Denzel Washington), his resentful brother Don John ( Keanu Reeves), and his noblemen Claudio ( Robert Sean Leonard) and Benedick (screenwriter/director Kenneth Branagh) return from war, ready for merriment and love. Claudio loves Hero ( Kate Beckinsale), the young daughter of the nobleman Leonato ( Richard Briers), but Benedick hates Beatrice ( Emma Thompson), Leonato's beautiful, witty, but sharp-tongued niece, who hates him back. Claudio and Hero are soon engaged; as they prepare for their wedding, they decide, with the help of Don Pedro, to trick Benedick and Beatrice into confessing their true love for each other. The plan works without a hitch, but trouble comes in the form of Don John, who is jealous of his brother's power and of his affection for Claudio. Don John devises a scheme where one of his lieutenants will make love to Hero's maid Margaret ( Imelda Staunton) at Hero's window the night before the wedding--and call her Hero. Don John takes Don Pedro and Claudio to Leonato's house, where they see the encounter and are convinced the woman is Hero. The next day Claudio disgraces Hero publicly at the wedding and refuses to marry her. She faints and Leonato is persuaded to pretend that she is dead until the situation is sorted out. The foolish warden Dogberry ( Michael Keaton) manages to arrest Don John's lieutenants and they confess to the plot. Claudio is crushed when he learns that he killed Hero with his false accusations. He begs Leonato to punish him and Leonato tells him his punishment is to marry his (other) niece, who closely resembles Hero. Claudio agrees but first spends a night mourning for Hero and proclaiming her innocence. Don John escapes Medina. The next morning Claudio marries the supposed niece, who removes her veil to reveal that she is Hero. They are very happy but Benedick and Beatrice almost break up when they discover they were tricked into admitting their love. In the end, Don John is arrested and brought back to face punishment, Benedick and Beatrice marry, and all dance around Leonato's garden singing \"Noddy noddy.\"",
      "writers": [
         "William Shakespeare",
         "Kenneth Branagh"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107616/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzkwODM1OTY1Nl5BMl5BanBnXkFtZTcwOTcxMDQ1NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kenneth Branagh, Emma Thompson, Keanu Reeves | See full cast and crew »"],
      "reviews": [
         "Personally I loved the movie, from the opening credits to the last brilliant tracking shot. What I do not understand is the dissing of Keanu Reeves' performance. I can just imagine Ken sitting around his kitchen table with his casting director saying \"okay we have this brilliant ensemble cast, the movie is going to be great, what can we do to completely screw it up? I know let's cast Keanu Reeves as Don John and completely snarl up the whole thing\" Personally I think Keanu made a great villain, and I trust Ken's ability in casting to choose the perfect actor for the part. I do not think that in reality that Ken would cast someone so hopelessly inept as others have posted in a part that is so essential to the plot. (and don't give me the star power excuse cause they already had Denzel Washington)..., I have always said that Shakespere done right is brilliant.. (done poorly it is pathetic) and this is Shakespere done right in the purest sense of the term. To listen to Ken and Em deliver Shakespere's lines is to listen to them as they would have been spoken and acted when they were written. It is a revelation and pure joy.",
         "Be honest: does the idea of a Shakespearean joke make your heart sink a little? Do you think of obscure, lowbrow Elizabethan humour that MAYBE someone was kind enough to explain in a footnote? Certainly the comedies are harder to stage, but when they're well done ... One of the most exhilarating things about Shakespeare is the certain knowledge that no character will ever express himself poorly. Well, characters like Dogberry do, in a sort of a way, but that's deliberately done for comic effect and doesn't count. No character is ever thwarted by a lack of expressive power. Whenever Benedick must plead his case, you know that he will summon up all the eloquence he needs; and whenever Beatrice insults anyone, you know that she will summon up all the venom and wit SHE needs. In some ways it's easier to appreciate this in a comedy when the plot is, reduced to its essence, much ado about nothing. No film director working today can approach Branagh when it comes to presenting Shakespeare cleanly and clearly, in a way that lets us participate in this verbal delight. This particular film is actually funny, as well as verbally delightful. It's also visually delightful - it has an attractive cast (Kate Beckinsale plays one of Shakespeare's ciphers but makes us understand why people fell in love with her), a sunny Tuscan landscape and a long tracking shot at the end that has to be seen to be believed. Performances are all good (other comments here have convinced me that even Keanu Reeves fits into his role). Comedy or not, this is the best Shakespeare film in years and is a candidate for being the best of all time.",
         "Brilliant! Kenneth Branagh's version of the timeless William Shakespeare classic is a great rendition of the film, making it accessible to everyone, even those who do not like Shakespeare. Let me first say that I am a great fan of Shakespeare's works. In college I was an English literature major, with a minor in theater, and so Shakespeare is found in both. Theater people state that Shakespeare was never literature at all, which in the purpose of the plays is true, however because of the prose that he wrote in is a poetic form, he is literature as well. Whatever you do, never get in between two people arguing this point, your head might blow up! Reading the comments on this page, the basic attack on this movie is that Branagh cuts lines and shaved parts. Yes, of course he did. Nothing is sacred, not even the works of Shakespeare, people. I myself was in a Shakespeare play, and over half the script was cut from it. With a Shakespeare play, the question is what to cut. If this play had been presented in it's entirety, it would have been close to five hours long. And today's movie audience just does not have that kind of patience. \"Titanic\" was stretching it a little, in terms of time. Shakespeare's original audience would have had no problem, because they made a day of it. So when Branagh did this play, he had to shave off a great deal of the script, and he had to decide what to focus on. He had to focus on the main characters, being Beatrice and Benedict and their romance, and of course the drama concerning Hero and Claudio, but also keep other characters incorporated as well. For those attacking the \"whittling down\" of the script, why didn't anyone bring up the point that Benedict is supposed to have shaved his beard while in attempt to woo Beatrice. Why? Because it really isn't a major plot point that is needed at all. So Branagh made great choices in his direction of the film, and in the end he made sure that everything tied together logically, and that there were no loose ends. The performances by the actors were great as well. There was nothing wrong with casting Denzel Washington as the prince, though people seem to have a beef with it. He pulled it off very well. And Keanu Reeves did a great job as well. It was a treat to see him as a villain. I happen to be a fan of Reeves, and I do see him as great casting, though why people also have a problem with him I'll never know. Branagh was going for acting ability, not just names. Reeves has the goods, and he can speak Shakespeare very well, it's his character that's supposed to be moody. And Keaton was a wonderful choice for the Constable, making me laugh whenever he was on the screen. And the other actors all did very well in their roles. If you're a lover of Shakespeare or not, this film is a great treat, and it appeals to all audiences who love the classic masterpiece.",
         "Kenneth Branagh has done so much for Shakespeare...I've almost become a complete zealot of his work. This screen adaptation of one of Shakespeare's lesser-known comedies is absolutely divine. The lovers Claudio and Hero are completely and wonderfully upstaged by Benedick and Beatrice, the most perfectly mismatched pair in the history of love, exactly as they were meant to be. The chemistry between Ken and Emma is so believable (after all, this was filmed before their marriage ended), the lines are so cunningly delivered, and the plot is so beautifully twisted and resolved that this movie is at the very top of my list of favorites. The setting is absolutely gorgeous--Italy in all its Summer glory. You can fairly taste the sunshine. Each part is completely delightful (Michael Keaton is perfect in one of the most bizarrely comedic roles I've ever seen, and as far as Keanu Reeves' performance, all I can say is that the part was written to be played in that manner. Don John was a bad guy of necessity--every comedy must have a foil). I found the entire production to be beautifully done and quite up to the professional standards that I've come to expect under Branagh's excellent direction. The wit sparkles and cracks between Beatrice and Benedick; a direct counter to the more traditional and borderline sappy form of Elizabethan love exhibited between Hero and Claudio. *This* is how the wise woo, and no, it is never peaceably! A smart, funny and visually stunning gem of a film to add to Branagh's already distinguished repertoire. I'm waiting for his MacBeth.",
         "The arrival of Don Pedro and his men at the home of Seigneur Leonato in Messina brings about much celebration. The spirit of love and happiness is alive in the party and Count Claudio and Leonato's daughter Hero make woo and engage to marry within a week. To pass the time Don Pedro makes a pledge to engage confirmed bachelor Benedick and the bickering Beatrice together in a tower of affection. However Claudio's brother, Don John, conspires to break up the wedding by making accusations against young Hero. Will it all be much ado about nothing? If anyone has done more to bring Shakespeare to a modern audience of multiplex dwellers, I'd like to meet them. Here Branagh yet again adapts a Shakespeare play to good effect, trimming the dialogue of some important sections with the aim of creating a lighter feel worthy of the title. I make no mention of the plot suffice to say that Branagh has done well to keep the essence and feel of the work very true but without forcing the tools that Shakespeare readily used but may not work on modern audiences easily (i.e. not being able to recognise someone easily when they wear a mask, veil or moustache!). The dialogue is very sparky as you'd expect and Branagh has done well to interpret the humour from the words on the page. I think of the dialogue around the police officer. Reading it from the page I never realised how much humour could be drawn form this characters scenes in terms of how the other characters view in. Of course the praise of lies with Shakespeare but Branagh knows the Bard well. The cast is international and all-star (probably to a greater extent than it needed or deserved). Branagh is pure wonder in the lead and really brings out the whimsy in many of his scenes. Thompson too is wonderful and the two play off each other well. The film lost a little when the two begin to woo, but it is still enjoyable. Briers is excellent and Blessed is a bit hammy and underused (forcing big background laughs). Reeves is OK in a small role \u0096 the lack of significant dialogue helped him. Washingon fits in very well, Leonard is good but straight. Of the Hollywood stars I think Keaton does the best. When he is onscreen he is a little OTT but he is simply hilarious as the fool of the piece, and Ben Elton is an interesting sidekick. Beckinsdale is good but again is not given much meat to work with outside of her perfect love for Claudio. Overall this is a very enjoyable version of the play. Those who find Shakespeare difficult could do well to start here with something light and bubbly. Those who enjoy Shakespeare will enjoy it as another version. Only those who feel that the Bard should not be put onscreen for the masses (and there are some who think this way \u0096 I have met them, they laughably call themselves purists \u0096 elitists I think) will find fault here, because this clearly has mass appeal.",
         "It's one of the most delightful adaptations of Shakespeare ever made. Personally, I am a great fan of Shakespeare, but it seems that the film must appeal even to those who normally don't like the Bard. Kenneth Branagh is at his best both as producer and performer. I admire his imagination and ingenuity, which he applies to his work. He created beautiful, picturesque, entertaining, amusing and hilarious movie with awesome actor's work and fine music. Some cuts of the original play were essential to make the movie dynamic, and the play was not considerably damaged. All members of the starring cast make Shakespearean text sound natural, alive and very funny. Emma Thompson shines as bright ginger-haired Beatrice. It goes without saying that she's an actress of unique talent, and in this film she does an amazing job, being lively, sharp and witty, sparkling with energy, humor and cheerfulness, or sometimes vehement and passionate (when her cousin is offended). Branagh as Benedick is up to her. Other notable performances are given by imposing Brian Blessed (seigneur Antonio) and Richard Briers (seigneur Leonato). Robert Sean Leonard and Kate Beckinsale as Claudio and Hero are adequate and beautiful pair. Keanu Reeves is really good in the part of grim, villainous Don John, notwithstanding opinions of many reviewers here. Michael Keaton's Constable Dogberry and other comic characters makes me laugh a lot through the film. Definitely, this is an excellent film for enjoyment. 10/10.",
         "Much Ado About Nothing From the beginning to the end, I was comfortable with this movie. The script mixed with the directing and the terrific acting created a glad feeling over this movie. The clips when sir.Benedict and Beatrice are extremely happy to the fake-news arranged by the prince, to the tunes of the main theme you smile, just because it is such a merry film. The language is highly enjoyable, of course. The love-enemies between Benedict and Beatrice are fabulous. Keanu Reeves is good, for once. Denzel Washington really is enjoying being in a Shakespeare-movie, and Branagh is very, very entertaining. I love this movie. My Rating: 8.5/10",
         "Unlike some people, I'm not letting Keanu Reeves' \"acting\" ruin this film for me. He has such a small part, and I'm sure Branagh was fully aware of what he was doing when he cast wooden Reeves to play a wooden role. Reeves is indeed the one substandard thing about this film, but even so, it somehow works (Reeves' role, I mean). This film is about rapt joy and ebullient vitality, and Reeves' flatness creates precisely the contrast that makes his character stand out as totally unfit for the world presented in the film, just as the beginning of Richard III establishes Richard as unfit for *his* times (only, he had enough cunning and opportunity to really foul things up!). There is no mistake, neither on the Bard's nor Branagh's part, in casting Reeves as Don John. Having gotten that out of the way, I'd just like to say that this is my favorite Shakespeare film ever. It is perfect in virtually every way, and I think Branagh displays a marvelous and rare understanding of the textual material. This is an immortal classic that I've seen a dozen times and that I am certain I will continue to watch on a regular basis for the rest of my life. 10 out of 10.",
         "I saw this one or two years ago, and I loved it utterly. Not only has it a great cast including shakesperian actors Kenneth Brannagh and Emma Thompson, it also has a lovely, warm feel to it; set in the sunny countryside of Italy; perfect to watch on a summer's evening. Although I am a dedicated admirer of Laurence Olivier, the legend who's reputation Brannagh is often set up against; I must admit that nobody would ever suit the role of Benedick as Brannagh does He was perfect; fun, natural and wittily amusing to watch. As for Emma Thompson; she gave a fantastically fiery performance as Beatrice of the untamed tongue; watching she and Brannagh go for each other in their satirical arguments was fantastic. Then there was Kate Beckindsale; one who I really would not have expected in a film such as this, but she did an exemplary and satisfying job as the fair Hero; although put completely in the shade by Emma Thompson. Keanu Reeves, the film star who I reckon NOBODY would have expected in a film such as this was surprisingly very good as the schemingly dark Don Jon, he suited the hiss-hiss villain's role deliciously. One who I thought could have been cast better was Robert Sean Leonard, as Claudio; who, although fine in scenes of wit and amusement; became forced in scenes of anger and sadness. Despite this, I thought he too suited the part well. I highly recommend this film to all who enjoy shakespeare, great English actors, or just good fun.",
         "Shakespeare intentionally created Don John, a villain with no cause and out of place, for the sole purpose of having a villain in advancing the story. Don John is supposed to be WOODEN , rotten to the core for no reason. Keanu Reeves actually played the role very well. I don't see how otherwise Don John could be portrayed. The movie is a fine piece, I particularly like the line \"If I were a man\" by Beatrice. I think Beatrice is one of the strongest heroines in Shakespeare's plays."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "American Playhouse Theatrical Films",
         "Renaissance Films"
      ],
      "summaries": [
         "Young lovers Hero and Claudio are to be married in one week. To pass the time, they conspire with Don Pedro to set a \"lover's trap\" for Benedick, an arrogant confirmed bachelor, and Beatrice, his favorite sparring partner. Meanwhile, the evil Don Jon conspires to break up the wedding by accusing Hero of infidelity. In the end, though, it all turns out to be \"much ado about nothing.\"",
         "Young lovers Hero and Claudio, soon to wed, conspire to get verbal sparring partners and confirmed singles Benedick and Beatrice to wed as well."
      ],
      "budget": 8000000
   },
   "movielensId": 497,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-05-07",
      "dvdReleaseDate": "2003-01-07",
      "directors": ["Kenneth Branagh"],
      "runtime": 111,
      "movieId": 497,
      "title": "Much Ado About Nothing",
      "mpaa": "PG-13",
      "actors": [
         "Kenneth Branagh",
         "Richard Briers",
         "Michael Keaton",
         "Robert Sean Leonard",
         "Keanu Reeves",
         "Emma Thompson",
         "Denzel Washington",
         "Kate Beckinsale",
         "Jimmy Yuill",
         "Brian Blessed",
         "Phyllida Law",
         "Imelda Staunton",
         "Patrick Doyle"
      ],
      "imdbMovieId": "0107616",
      "originalTitle": "Much Ado About Nothing",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "bYj-2vFLbtc",
         "jKQTBQFL5T4"
      ],
      "plotSummary": "In this Shakespearean farce, Hero and her groom-to-be, Claudio, team up with Claudio's commanding officer, Don Pedro, the week before their wedding to hatch a matchmaking scheme. Their targets are sharp-witted duo Benedick and Beatrice -- a tough task indeed, considering their corresponding distaste for love and each other. Meanwhile, meddling Don John plots to ruin the wedding.",
      "tmdbMovieId": 11971,
      "avgRating": 3.87027,
      "releaseYear": "1993",
      "numRatings": 15332,
      "posterPath": "/6qlYYvDZ0Tb5h0t7sLwy4sjGIwM.jpg"
   }
}