{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "becoming an adult",
            "id": 1412
         },
         {
            "name": "karate",
            "id": 3436
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "classmate",
            "id": 160243
         }
      ],
      "imdb_id": "tt0110657",
      "video": false,
      "title": "The Next Karate Kid",
      "recommendations": [
         10495,
         8856,
         1885,
         17414,
         16314,
         12139,
         9073,
         6280,
         11982,
         11630,
         9356,
         9622,
         11317,
         13888,
         11895,
         12154,
         1634,
         11335,
         1825,
         14367
      ],
      "backdrop_path": "/e7pmtrKg9WHVdPWjFNL7FJPoEiV.jpg",
      "revenue": 15826984,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sgt. Kesuke Miyagi",
               "gender": 2,
               "credit_id": "52fe44169251416c7502864f",
               "name": "Pat Morita",
               "profile_path": "/eMLWaQ2uQIpiyVeaU7xl0ozs2B7.jpg",
               "id": 23915,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Julie Pierce",
               "gender": 1,
               "credit_id": "52fe44169251416c75028653",
               "name": "Hilary Swank",
               "profile_path": "/zVM2gbZhuipISCoALn6iEN1bmop.jpg",
               "id": 448,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Colonel Dugan",
               "gender": 2,
               "credit_id": "52fe44169251416c75028657",
               "name": "Michael Ironside",
               "profile_path": "/i3HkCGEnQGJeD0U8WDumO4VH5fU.jpg",
               "id": 11086,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Louisa Pierce",
               "gender": 1,
               "credit_id": "52fe44169251416c7502865b",
               "name": "Constance Towers",
               "profile_path": "/lcf2byO2E8vD7hcYLPtUjH49ktf.jpg",
               "id": 20276,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Eric McGowen",
               "gender": 2,
               "credit_id": "56a72254c3a36819c600249b",
               "name": "Chris Conrad",
               "profile_path": "/3DfF4JdUL1lPdxGQD1uIzI14Ra8.jpg",
               "id": 227199,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Abbot",
               "gender": 0,
               "credit_id": "56a7226592514129f50023cb",
               "name": "Arsenio 'Sonny' Trinidad",
               "profile_path": "/b3hCkrsQPjTP90OPxWl0XbWhf8j.jpg",
               "id": 1080062,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Ned",
               "gender": 0,
               "credit_id": "56a7227e9251412a040022f5",
               "name": "Michael Cavalieri",
               "profile_path": "/oF4C3zn6dWVGyPtlw0OvSJvjew1.jpg",
               "id": 112150,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "56a7228f92514129f70025b7",
               "name": "Walton Goggins",
               "profile_path": "/gA5nf2alzIPPjs1MSjS1PmrCedJ.jpg",
               "id": 27740,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Tall Monk",
               "gender": 2,
               "credit_id": "56a7229fc3a36819c9002428",
               "name": "Jim Ishida",
               "profile_path": "/qnPAOkkDX1pWk4x1RIeYspK0H70.jpg",
               "id": 1217015,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Monk",
               "gender": 2,
               "credit_id": "56a722acc3a36819d000278a",
               "name": "Rodney Kageyama",
               "profile_path": null,
               "id": 129463,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Buddhist Monk",
               "gender": 0,
               "credit_id": "56a722bb92514129fb0023e0",
               "name": "Seth Sakai",
               "profile_path": null,
               "id": 1382045,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Mr. Harold Wilkes",
               "gender": 0,
               "credit_id": "56a722c8c3a36819cb00238f",
               "name": "Eugene Boles",
               "profile_path": null,
               "id": 1568433,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "School Clerk",
               "gender": 0,
               "credit_id": "56a722d5c3a36819de00226d",
               "name": "Keena Keel",
               "profile_path": null,
               "id": 1568434,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Gabe",
               "gender": 2,
               "credit_id": "56a722e69251416c8d0006ce",
               "name": "Tom O'Brien",
               "profile_path": null,
               "id": 29977,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Morgan",
               "gender": 2,
               "credit_id": "56a722f392514129ef002404",
               "name": "Thomas Downey",
               "profile_path": "/bibK5lsyc4WbEmw1v6QDzXHfiB0.jpg",
               "id": 30067,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028661",
               "name": "Christopher Cain",
               "profile_path": "/atUMxA5Anavwqdd5tH3B3S8ayli.jpg",
               "id": 56828,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028667",
               "name": "Robert Mark Kamen",
               "profile_path": "/zwGjOlFGizQxtBBAlgorm1Djw52.jpg",
               "id": 61,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe44169251416c7502866d",
               "name": "Mark Lee",
               "profile_path": null,
               "id": 68678,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44169251416c75028673",
               "name": "R.J. Louis",
               "profile_path": null,
               "id": 59809,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028679",
               "name": "Jerry Weintraub",
               "profile_path": "/wqmJO4ChjNmmlz3wZ8qoCIC1VG9.jpg",
               "id": 1888,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c7502867f",
               "name": "Bill Conti",
               "profile_path": "/cR6H9EFVkeGP0TnoX9RPNBB6hSN.jpg",
               "id": 10494,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028685",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c7502868b",
               "name": "Ronald Roose",
               "profile_path": null,
               "id": 2123,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 7.307447,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11231,
      "vote_count": 264,
      "budget": 12000000,
      "overview": "During a commemoration for Japanese soldiers fighting in the US Army during World War II, Mr. Miyagi meets the widow of his commanding officer. He gets to know her granddaughter Julie, an angry teenager who is still feeling the pain of losing both her parents in an accident and is having problems with her grandmother and her fellow pupils. Mr. Miyagi decides to teach her karate to get her through her pain and issues and back on the right path.",
      "similar": [
         281957,
         9053,
         6312,
         3134,
         979,
         8456,
         24,
         55292,
         238636,
         281,
         395834,
         357096,
         9093,
         146,
         605,
         604,
         681,
         682,
         956,
         14869
      ],
      "original_title": "The Next Karate Kid",
      "runtime": 107,
      "poster_path": "/gu5SOBWsoxDy6mWKAkOt20zTXOb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1994-07-18",
      "vote_average": 4.9,
      "belongs_to_collection": {
         "backdrop_path": "/1ok5JGCsDt4Sh3CkFeXh2F2KB7F.jpg",
         "name": "The Karate Kid Collection",
         "id": 8580,
         "poster_path": "/o6h2F0C5eZOy50Q76fNYzc9mvvw.jpg"
      },
      "tagline": "Who says the good guy has to be a guy?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Cain"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Robert Mark Kamen",
         "Mark Lee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110657/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwODUyNTA4Nl5BMl5BanBnXkFtZTYwOTgyMjU5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Pat Morita, Hilary Swank, Michael Ironside | See full cast and crew »"],
      "reviews": [
         "This is one of those harmless sequels that seems to draw unnecessary ire. This is a \"rip-off\" sequel, but the cast plays it well, and it's true to its formula. Michael Ironside is a fine villain. And Hillary Swank, who went on to win a Best Actress Oscar, shows sparkle and potential in the lead. There are many worse movies to rent to watch with your niece. My score -- 6/10.",
         "Here is introduced a new kid , girl, with the subsequently two times Oscarized Hilary Swank . This is an entertaining martial arts movie with the intimate Pat Morita , and , as always , the show belongs to Noriyuki-Miyagi . The story deals with a troublesome teenager named Julie ( a newcomer Hilary Swank ) , thanks to Miyagi she aware that Karate is his salvation , as she battles an evil nemesis , facing off a violent young group trained by an expert fighter ( Michael Ironside) . The Japanese Miyagi ( Noriyuki, Pat Morita ) born in Okinawa teaches her martial arts and combat at a Zen temple along with some sympathetic monks . Meanwhile , Julie falls in love with a youngster (Chris Conrad) . This enjoyable movie , a sort of junior version of 'Rocky' , develops a sincere and deep friendship among two protagonists , the rockie young girl and the wise old man . Using more than his fists , Julie learns about herself and the sense of life . Agreeable and likable acting by main actors : Pat Morita and Hilary Swank . Furthermore , appears as secondaries , the ordinary baddie , Michael Ironside , and the veteran Constance Towers who worked in various films directed by John Ford . The picture contains adequate cinematography by Laszlo Kovacs and long-standing musical score , though with some disco-music , by Bill Conti, trilogy's usual . This feel-good message picture is professionally directed by Christopher Cain . The three previous films , all of them produced by Jerry Weintraub and directed by John G Avildsen , are the following : original Karate Kid I (1984) in which are presented the classic characters , Karate Kid II (1986) where the protagonists travel to Okinawa and Part III(1989) where Daniel again battling nasties enemies . Rating : Acceptable and passable following , worthwhile seeing . This heartwarming will appeal to Karate Kid trilogy fans .",
         "I thought this movie was going to be a disgrace to the series. After all, part 3 didn't measure up to part 2, and this one doesn't have Daniel Sawn. Miyagi's humour wasn't quite as witty in this one as in part 3, but it was funny enough to make the movie worth watching. The girl's part was pretty good. She's a lost teenager who needs direction. I find the plot a little hard to believe. That the aunt would simply agree to leave her home and her niece under the care of Mr. Miyagi, a man she just met. Of course, he was a friend of her brother. I did appreciate the monastery. One might think from some of my other reviews that I wouldn't have liked the dancing monks, but I thought it was amusing. It showed that they know how to have some fun. Now if these were monks in ancient China dancing to pop-music, that would have been another matter. Probably the most intelligent part of the movie was when the girl thought it was stupid that the monks wouldn't kill a bug. Miyagi told her that street gangs killing each other is stupid, nations trying to destroy each other is stupid, but having respect for all life is not stupid. Miyagi has expressed such wisdom in the other films as well. I give this movie a 4 out of 10. Sure, there were some things I liked about it. It wasn't as funny as part three, and no character could ever live up to Sato in part 2. This movie has no re-watch value. I can't imagine watching it again, but it is worth seeing once.",
         "I really didn't think The Next Karate Kid was THAT bad. Flawed yes, but it is not terrible I don't think. As I have said, the film does have its flaws. The story is quite predictable and formulaic, though in its defence, the story wasn't necessarily a strong point in the previous three either. Second, the script has its weak spots, it did have its moments such as with Miyagi's humour. Third, there are some unrealistic moments here, the ending especially. Fourth, it isn't as efficiently paced as the first or third films. However, it is nicely filmed, the cinematography is good and the scenery is very nice. The soundtrack is pleasant, and the karate is good. The direction is good enough, and the characters are still at least engaging. The acting is decent, Hilary Swank is a worthy replacement for Ralph Macchio, while Pat Morita elevates this movie to a better level acting who is arguably the best character of the film and giving a strong performance in the process. Overall, it was pretty decent, and better than its reputation. It could have been better, but I have seen much worse movies. 6/10 Bethany Cox",
         "While I totally objected to this chapter ever being made, at least it had a young Hilary Swank (I seem to be her only male fan). While this film was kind of hokie and predictable, at least it accurately portrayed the horrors of men trying to shop for women. Pat Morita's performance in that scene alone was priceless. While this proved to be nothing more than a spin-off grasping at straws, at least no one completely embarrassed themselves. Also, where the heck was Ralph Macchio! Couldn't he have made a guest appearance. It's not like he had anything to do at the time.",
         "\"The Next Karate Kid\" is not a very impressive film. However, it introduces a young actress named Hilary Swank to the mainstream audience. Amazingly, just five short years after this film Swank would be holding the Oscar for her gender-bending role in \"Boys Don't Cry\". In this film she takes Macchio's role and does an admirable job even though the material is just not there. 2.5 out of 5 stars.",
         "Growing up as of child of the movies, one of the trilogies I shall not soon forget is that of the Karate Kid. You can put down Ralph / Daniel all you want, but its the message behind the movies that are important, that its important to be respectful to all creatures great and small, but stand up for yourself when the time calls for it. Getting back to the movie at hand, its rather funny because, I saw Boys Don't Cry and was really impressed with the performance of Hillary Swank, and in flipping through the sea of channels the other night, I came across the showing of this film and I hadn't realized at the time of my first viewing of this movie that she was in it. The story centers around Julie, just like Daniel, not knowing where to fit in or if she even wants to fit in and the master teacher is brought in to help straighten her out and guide her. I really liked this addition to the series as it gave a good feminine side to the story and yes, even some outfits that Hillary were in kept me, shall we say stimulated. Overall 3.5 out of 5",
         "The IMDb voters have been unusually cruel to this film. While it isn't by any means great, I like it and find the 95 minutes or so to be very enjoyable. We now know that then 19-year-old Hilary Swank later won an Oscar for her performance in BOYS DON'T CRY, and here she was already a beautiful young woman and a credible actress. As usual, Pat Morita is perfect as the gentle, stoic martial arts expert who always prefers avoiding a fight, but says, \"If you must fight, then win. (wink and smile).\" some SPOILERS follow, read at your considered discretion... Young Julie lost both parents in an accident and is mad at the world, her only connection seems to be an injured hawk that she cares for on the roof of the school building. Mr Miyagi was her grandfather's pal in the war, and offers to help young Julie cope with life and school. She gets expelled for two weeks on bogus grounds, but she and Miyagi use the time to visit monks and there she perfects her Karate skills. Back at school, she gets a prom date, Miyagi buys her a pretty dress, teaches her how to waltz, but the mean kids hassle them, leads to a showdown on the piers, they burn his car, Miyagi and Julie show up, she kicks the bad kid's butt, Miyagi subdues the teacher, martial arts instructor, and everyone lives happily thereafter. OK, it is greatly contrived. You can't become that good in two weeks at a monastery. Julie just too easily falls under the guidance of Mr Miyagi. The tough kids at school are too much of a cliche'. But the overall message is good, the need to find yourself, to look for the good in yourself and others, to respect all life, even the cockroach. Most of us like a story where the bad guys get put in their places. And the pretty but sad young girl becomes happy. Swank and Morita are a joy to watch, and I will watch it again. The DVD picture and sound are fine, nothing special. No meaningful extras.",
         "When I first saw this movie was included in the Karate Kid DVD Set, I almost thought about just buying Karate Kid by itself. But after watching it, I really enjoyed it. It was really cheesy at parts, but other parts were enjoyable and funny. Miyagi is great as usual, which is the main reason I even bothered to watch the movie in the first place. This movie is worth at least a one-time viewing if you really liked the Karate Kid movies. Hillary Swank did a pretty good job too. The plot was pretty hoaky, and it was similar to the first Karate Kid, but there was a different dynamic since the hero was a girl this time.",
         "Rating: 5/10 Why don't try-hard filmmakers just stop making fools of themselves by sequelizing The Karate Kid? Then the film world would be much more pleasant. This sequel, The Next Karate Kid starts quite well. It hits the mark on the first few lots of 5 minutes and I was possibly interested in seeing the rest of it. Unfortunately, the film faults itself a lot after the promising beginning. The ending in particular is offensive with stupidity and completely overblown. Hilary Swank and Pat Morita handle their main character leads with great emotion, despite some of the cheesy dialogue they are given. The story behind the martial arts is about Julie (Swank) and her best friend, Angel, a bird with a broken wing. Most of the scenes with Angel are touching, and win points for the film. However, the villains are completely laughable and the story leads to times that are so unrealistic that you kind of feel pain for the paper the script has been written on. The film has some mildly good ideas, but overall it fails to make you want to keep watching unless you have absolutely nothing else to do."
      ],
      "genres": [
         "Action",
         "Drama",
         "Family",
         "Romance",
         "Sport"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "During a commemoration for Japanese soldiers fighting in the US Army during World War II, Mr. Miyagi meets the widow of his commanding officer. He gets to know her granddaughter Julie, an angry teenager who is still feeling the pain of losing both her parents in an accident and is having problems with her grandmother and her fellow pupils. Mr. Miyagi decides to teach her karate to get her through her pain and issues and back on the right path.",
         "Mr. Miyagi is back and he takes a new pupil under his wing; a troubled adolescent girl."
      ],
      "budget": 0
   },
   "movielensId": 502,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-07-18",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Christopher Cain"],
      "runtime": 107,
      "movieId": 502,
      "title": "The Next Karate Kid",
      "mpaa": "PG",
      "actors": [
         "Pat Morita",
         "Hilary Swank",
         "Michael Ironside",
         "Constance Towers",
         "Chris Conrad",
         "Arsenio 'Sonny' Trinidad",
         "Michael Cavalieri",
         "Walton Goggins",
         "Jim Ishida",
         "Rodney Kageyama",
         "Seth Sakai",
         "Eugene Boles",
         "Keena Keel",
         "Tom O'Brien",
         "Thomas Downey"
      ],
      "imdbMovieId": "0110657",
      "originalTitle": "The Next Karate Kid",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["eDchGHJdRVs"],
      "plotSummary": "During a commemoration for Japanese soldiers fighting in the US Army during World War II, Mr. Miyagi meets the widow of his commanding officer. He gets to know her granddaughter Julie, an angry teenager who is still feeling the pain of losing both her parents in an accident and is having problems with her grandmother and her fellow pupils. Mr. Miyagi decides to teach her karate to get her through her pain and issues and back on the right path.",
      "tmdbMovieId": 11231,
      "avgRating": 2.31905,
      "releaseYear": "1994",
      "numRatings": 4294,
      "posterPath": "/gu5SOBWsoxDy6mWKAkOt20zTXOb.jpg"
   }
}