{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "yuppie",
            "id": 1873
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "dark comedy",
            "id": 10123
         },
         {
            "name": "failing business",
            "id": 208283
         }
      ],
      "imdb_id": "tt0110649",
      "video": false,
      "title": "The New Age",
      "recommendations": [47907],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Peter Witner",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dcc97",
               "name": "Peter Weller",
               "profile_path": "/qTdm4vdZPsplJpnTU4fSprp0CxJ.jpg",
               "id": 27811,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Katherine Witner",
               "gender": 1,
               "credit_id": "52fe45d4c3a36847f80dcc9b",
               "name": "Judy Davis",
               "profile_path": "/xQMA72T6yz6ebJXv1pCuZC1fDJo.jpg",
               "id": 351,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jean Levy",
               "gender": 0,
               "credit_id": "52fe45d4c3a36847f80dcc9f",
               "name": "Patrick Bauchau",
               "profile_path": "/eAlTfdwkw4xCU8UIxVCkL4LWYO5.jpg",
               "id": 5274,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jeff Witner",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dcca3",
               "name": "Adam West",
               "profile_path": "/8pvRGXFF7lsIZrDS2yaV2dZaG72.jpg",
               "id": 26847,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Alison Gale",
               "gender": 1,
               "credit_id": "52fe45d4c3a36847f80dcca7",
               "name": "Paula Marshall",
               "profile_path": "/631RjKeHEmOGwq6Pw9ijs8w9dtR.jpg",
               "id": 59449,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sarah Friedberg",
               "gender": 1,
               "credit_id": "52fe45d4c3a36847f80dccab",
               "name": "Rachel Rosenthal",
               "profile_path": null,
               "id": 126981,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Anna",
               "gender": 0,
               "credit_id": "52fe45d4c3a36847f80dccaf",
               "name": "Patricia Heaton",
               "profile_path": "/64MJTEHcl6WcFBQJLMC1dsjNuo.jpg",
               "id": 26996,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Dale Deveaux",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dccb3",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Kevin Bulasky",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dccb7",
               "name": "Corbin Bernsen",
               "profile_path": "/c9Y2SKgC3S6LJNq7WKcoauY88kg.jpg",
               "id": 21246,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Woman Customer",
               "gender": 1,
               "credit_id": "582e97939251413e7f0026c7",
               "name": "Rebecca Staab",
               "profile_path": "/stoMDn5LNfdrGGio46XCMGUlh0O.jpg",
               "id": 88168,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dccbd",
               "name": "Michael Tolkin",
               "profile_path": "/32zQ0ZJO4ySK4wu7mL42EpYX0nq.jpg",
               "id": 16939,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5457cd64c3a368642e002836",
               "name": "Michael Tolkin",
               "profile_path": "/32zQ0ZJO4ySK4wu7mL42EpYX0nq.jpg",
               "id": 16939,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.965849,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41588,
      "vote_count": 6,
      "budget": 0,
      "overview": "Peter and Katherine Witner are Southern California super-yuppies with great jobs but no center to their lives. When they both lose their jobs and begin marital infidelities, their solution is to start their own business together. In order to find meaning to their empty lives, they follow various New Age gurus and other such groups. Eventually, they hit rock bottom and have to make some hard decisions",
      "similar": [
         14,
         109414,
         627,
         402897,
         96936,
         7512,
         7446,
         4011,
         1018,
         2758,
         31011,
         9388,
         9473,
         241,
         380,
         7516,
         275,
         1903,
         1429,
         914
      ],
      "original_title": "The New Age",
      "runtime": 112,
      "poster_path": "/fhtW0cu3HXnftqasdt8ptKOQDjU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Alcor Films",
            "id": 644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ixtlan",
            "id": 4198,
            "origin_country": ""
         },
         {
            "logo_path": "/hNuGhsKVlmhnwSRcmOejDBDjh6w.png",
            "name": "New Regency Pictures",
            "id": 10104,
            "origin_country": ""
         },
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-09-16",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "A shopping spree for the morally bankrupt",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Tolkin"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Michael Tolkin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110649/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTIyODU5OTU3OF5BMl5BanBnXkFtZTYwNTI2Njk4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Weller, Judy Davis, Patrick Bauchau | See full cast and crew »"],
      "reviews": [
         "I had heard about Michael Tolkin's film 'The New Age' for several years before actually seeing it, but most of what I'd heard was not especially good and I therefore did not seek it out either in the theatres or on video. It wasn't until a trusted friend insisted that I see it, playing on my great admiration of Judy Davis and all she does. So I watched it and was stunned into a state of horrified deja-vu. It's a painful movie and very, very funny at the same time. I lived in Los Angeles in the late 80s and experienced first-hand the \"new age\" hey-day, hobnobbing with the elite of the channellers, psychics, psychometrists and \"breath\" therapists who moonlighted as acting coaches during the day. One \"healer\" with a great lingam stone tucked between her thighs actually vanished before my very eyes so I cannot honestly condemn all of those people for being charlatans They were the natural outcropping of Werner Erhard's est culture, nurtured by the great wealth of actors and actresses and producers and screen writers with a great deal of free time on their hands. There are many lines in the script of 'The New Age' that I'd heard before in \"real\" life. All the clichés are there, clichés that led a lot of naive and desperate people, talented people in most cases, to the poor house and back to mom and dad in Ohio and Texas. The horror of the L.A. wannabee chic shopping scene, the $500.00 belts, $2,000.00 nighties etc is all documented in this sly and viscious movie. 'The New Age' is truly a movie that can be equated with the fascination of a plane crash. All the magnetic appeal of bloody corpses and burning wreckage is there.The ersatz satisfaction of illicit sex and massages and player-grand pianos is there. It's all real and still exists, only now the new age is free of its patina of spirituality and has been left to chase after money, as it was always about in the first place. Money and sex. That's what 'The New Age' is about and that's what it is still about, only now it's called the \"New Millenium\". As for the movie's technical side; the actors are all fine, horrifyingly believeable. Peter Weller is especially monstrous, shark-like in his est-trainer mode of ambition and grasping and domination of the gentler creatures who are drawn into the circle of his light, the deadly electric blue light, like the night-time sky of Los Angeles, that zaps them like mosquitos. Peter Weller's character finds his true self by the end of the film and it is a role that will serve him well in the new millenium. Judy Davis, as his wife, looks vampiric enough, exquisitely dressed, sexy and desperate. Instead of blood, however, she seeks money. Oddly, no one is seeking love in this movie, that would be too mundane for these characters, too human. The one great point of Judy Davis's character and how it is written is that she is not for one moment a victim. She is a strong woman and her coup-d'état in the suicide scene is spectacularly funny. Only Judy Davis could have played this part this well. The bitchiness of her \"friend\" Anna, played by Patricia Heaton, is the epitome of L.A. chumminess. As one-dimensional and fake as the great silver screen from which they all make their livelihoods. As Anna says to Katherine (Davis), people aren't comfortable around people who are having a bad time. Eventually everyone has a bad time in Los Angeles. 'The New Age' does seem to have its longeurs but this is appropriate given the nature of the subject, slow, meditative, up-close and uncomfortably comfortable. Mr Tolkin does not let the sexual side of L.A. off the hook either with the extended sex party and the nixies of both sexes in the pool. This is an especially beguiling scene. Like a trio of Rhine Maidens the 3 (2 woman and a very pumped-up man) float tantalizingly in the pool beckoning Peter Weller to join them, but he is afraid; he is a fraud, sexually, just as he is told by the Belgian psychic (Patrick Bauchau) at the beginning of the movie. So why did we all do it way back when? Why did intelligent people of all stripes commit themselves to the unseen and the unanswerable mysteries of existence? Well, there is a character, Laura (Maureen Mueller) who is dying of an incurable and painful disease, perhaps AIDS, and it is her plight that reminded me why we, I, spent all that time and money pursuing the spirit of the \"new age\". There was, in fact, something to it. I will never think that there wasn't something valid in that period of time in Los Angeles, captured here in Tolkin's film. There was warmth and caring previously unknown in the realms of Hollywood. Sure, there were frauds and charlatans, they are always around the new fads, especially in L.A. But on the other side of the fakery there is the psychic diva, Sarah, whose opening speech enjoining us to \"just watch\" and not reject out of hand what we see is quite apt. Like all of existence, our opinions are just specks in the face of one of God's pores, who knows what the Truth is. Perhaps that is what makes this movie so horrifying, could it actually be a perversion of something sacred? Maybe. There is another special hook that keeps me coming back to this movie from time to time, when I'm feeling strong, and that is the presence of the ubiquitous (at the time) L.A. doyenne of performance artists (remember performance artists?) Rachel Rosenthal (Sarah). In a bit of surreal memory I am tossed back to the Dorothy Chandler Pavilion and a performance of 'Tristan und Isolde', designed by David Hockney, at which I found myself sitting next to a large, bald woman in black with bizarre dangling earrings, not your typical Wagnerian, at least of the female variety. It was Rachel Rosenthal sitting next to me in the dark as Isolde poisons Tristan, as Isolde and Tristan rise to the heights of ecstasy in Hockney's childish 'Popeye und Olive Oyl' sets. But that is a highly subjective motivation, though it seems fitting that this of all movies should have such an intimate connection for me. It might have the same for you as well. As for the rest, the script is excellent, as if written whilst listening to conversations at Spago or the old Pink Cadillac on Beverly Boulevard. It's authentic. The panoramic shots of L.A. are spectacular and set the story in an appropriately spacious and detached atmosphere, cold and uncaring, just like the real Los Angeles. The great bauhaus fantasy houses are also true to reality. Calme et volupté are the keywords for the settings. As the nixies in the pool say to Peter, \"you can't just watch, Peter, it isn't fair\". Peter says \"I'm scared.\" The nixies say \"we'll be waiting.\" \"The New Age\" is always waiting, like the cobra coiled in the shadows just around the corner.",
         "The response to this film was a little more negative than I expected. I liked the film better than Tolkin's \"The Rapture.\" It's one of my favorites to watch for non-serious viewing. The film has a quirkiness, even a spookiness, that, apparently, many dislike and don't understand. I wanted to recount the plot; however, since that's not desired, I don't see why other reviewers think the plot is so implausible. Peter Weller's and Judy Davis' characters seem to be mismatched partners, but is that so implausible? This dissonance was probably intended, but disliked by many viewers. Anyway, the main characters compromise themselves in many ways: I think Peter and Judy do well in the movie. I also like Adam West in his small part, and the under-rated Patrick Bachau plays his part as a new-age guru with urbane spookiness. Corbin Bernsen has a small part at the beginning as the boss for Peter Weller's character (Weller's character is conveniently named \"Peter.\") Finally, I like the depictions of certain new-age ceremonies and personalities--this is rare in movies.... I think the movie is thoughtful. It does not have much action, but don't most action films today flagrantly violate the law of \"suspension of disbelief?\" This film will not be liked by the multitude in America with the attention span of a gnat.",
         "I liked this film because it does a good job of making the viewer consider what is important in life, and why. On the other hand, it is not the most exciting movie ever made. I recommend this if you want a story to ponder that exposes modern values to criticism. I give it a 7/10. Peter and Katherine are a typical couple of California yuppies. They want to be cool, the want to indulge themselves, they live lavishly on their credit cards, and they hold \"spiritual values\" above wealth and work. Unfortunately, when their careers go down the toilet during the recession in the early 1990s, they fall upon hard times. They try to start an independent business, but their easy and hedonistic lifestyle prevents them from putting in the blood, sweat, and tears that are required for success in retail. Their spiritual values are of no help when things get rough, because their \"New Age\" values are really just a justification for selfishness and egocentricity. The movie is the story of their loss of innocence. To get their lives back on track, they have to work hard at jobs that simply are not cool. Their elitist attitudes must give way to sacrifice and common sense. It is not clear whether this is a triumph or a tragedy for Peter and Katherine. That is left up to the viewer in this one.",
         "This film was a complete surprise to me. It's clever, funny and very thought-provoking. Judy Davis and Peter Weller (that man is underrated) both deliver excellent performances. A warning: The ending isn't quite the usual happy salvation, but it really does hit the perfect note on one of the main themes of the film: You can't always get what you want. And pushing that very feeling to the viewer just before the credits is perhaps the cleverest thing about the whole film.",
         "The previous reviewer's comments mysteriously do not allude to the terrific humor of this film. It is a clever, understated, totally deadpan comedy. If you like black, dry humor, this film is for you. At the same time it skewers the vapidly self-affirming culture of the wealthy, new age set. Slowly, Peter Weller and Judy Davis's characters' natures are purified in the furnace of self-destruction, until they discover their true selves -- mediocrity and greed, which lately pretended to be new age spirituality. A succession of fatuous gurus pushes them down the slope of destruction, until finally Samuel Jackson, in a fabulous cameo, teaches Peter Weller how to attain ultimate truth through techniques of visualization. By this point, the Davis-Weller characters have lost their jobs, their wealth, their \"friends\", their home, their failed business, and their relationship (did I mention the affairs?), and, perhaps, all illusions that there was anything at their core. With the exception of one or two scenes, everything in this film is deliciously subtle and understated, but all the more wickedly funny for it. You might not realize how good it is at first. A second viewing will really help your appreciation of it. If this film doesn't make you laugh, grasshopper, then perhaps you still do not know yourself.",
         "Critics seem to have split widely on this film, and it's easy to see why. It's a rather painful, plodding thing to sit through--yet one can't get it out of the mind afterward. Writer/director Tolkin has a lot of disturbing things to say about post-industrial affluence in America in the 1990s, and in trying to say everything in one movie he has piled it on so thick that the brain requires a postmortem to reflect. Judy Davis, as she was in \"Husbands and Wives,\" is dynamite, and the film is worth seeing just for her. The film has an uncanny eye and feel for the bleak interiors of the contemporary American service economy: the boutiques, the high-rise telemarketing boiler rooms, the house-poor interiors of career people who are hardly ever at home, etc. The film's title refers to the spiritual quest of the couple to find a meaning to their existence, or at least some alternative approach to life to their destructive materialism. How they go about it is all wrong, of course. In true hedonist fashion, they try everything. At the same time they seek a simpler, spiritual, non-materialistic life via a bunch of wacky gurus and cultists, they are indulging in carnal and other pleasures as diversions. When they open a small business, ostensibly to gain more control over their lives and income, the forces of the world are worse than any bosses. In all of this, they seem to be outside of everything they do, as in dreams when you watch yourself and are powerless to control the changing scenery. Despite their doldrums and hostility, this is a couple who have too much in common to split. During the course of all this, Tolkin gets plenty of jabs in about an American economy that seems to be teetering on wisps of hope rather than on any true productivity. By the end, the \"new age\" looks uncomfortably like a very old one, in which the law of the jungle reigned.",
         "Yes, The New Age is beguiling art film and not for everyone, but I enjoyed its take on the L.A. nouveau riche set. Peter Weller and the luscious Judy Davis are back again as a whacked out couple that are not unlike the pair they played in Cronenberg's Naked Lunch. I liked the look of the film, the off the wallness of it all, and its sly sense of humor. We need another reteaming of Weller and Davis for the new millenium, daddy-o. But if you like art movies about the rich bitch L.A. scene go see The New Age. Solid.",
         "Gee ... I started to type in One of and the computer filled in the rest, so obviously ... i've named some other movie here on the IMDb one of my favorites ... oh well ... room for more than one. This movie, The New Age, is one of those great black comedies that sort of fell through the cracks on release ... and for some odd reason has not yet been released on DVD, which is a shame. I just rented it tonight and dragged my VHS player out so I could watch it. It's been awhile since I've seen it ... just some great lines and scenes ... a walk through southern California new age spiritualism and materialism ... A very intelligent script ... great acting and casting ...",
         "This movie is not fun to watch like those wonderful Bob Fosse films or any of the movies shown on American Movie Classics or network television, but it does carry a couple of compelling messages. First, those who go into sales would be well advised to avoid selling to friends. Second, those who work in telemarketing are corrupted more by their occupation than a person's dead body is by the agents of decay. This movie contains the best examples of the sociopathic nature of sales people since the chapter of Steinbeck's, \"The Grapes of Wrath,\" about the thought process of a used car salesman in the Great Depression. It would have rated a \"10\" if there had been a scene at end where the main characters were shown burning in hell.",
         "who is better in this movie?,,wellers/davis?,,i don't know,both are amazong!,,even the other actors do great,especially samuel l jackson and adam west,,yes adam west.....this will be a cult classic in the future,maybe the first non-box office cult classic?,,the french guy,who ever he is is also very good!,,,it makes you wonder why wellers doesn't act much anymore?!!,,,though not a major problem it is a little slow,so i give it a 9 out of 10."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Alcor Films",
         "Ixtlan",
         "New Regency Pictures"
      ],
      "summaries": [
         "Peter and Katherine Witner are Southern California super-yuppies with great jobs but no center to their lives. When they both lose their jobs and begin marital infidelities, their solution is to start their own business together. In order to find meaning to their empty lives, they follow various New Age gurus and other such groups. Eventually, they hit rock bottom and have make some hard decisions.",
         "Episodic movie about a rich yuppie couple who, going broke, can't decide if they want to stay together and meanwhile openly sleep around and experiment with different lifestyles."
      ],
      "budget": 0
   },
   "movielensId": 503,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-16",
      "dvdReleaseDate": null,
      "directors": ["Michael Tolkin"],
      "runtime": 112,
      "movieId": 503,
      "title": "The New Age",
      "mpaa": "",
      "actors": [
         "Peter Weller",
         "Judy Davis",
         "Patrick Bauchau",
         "Adam West",
         "Paula Marshall",
         "Rachel Rosenthal",
         "Patricia Heaton",
         "Samuel L. Jackson",
         "Corbin Bernsen",
         "Rebecca Staab"
      ],
      "imdbMovieId": "0110649",
      "originalTitle": "The New Age",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["0hEU3WAs34o"],
      "plotSummary": "Peter and Katherine Witner are Southern California super-yuppies with great jobs but no center to their lives. When they both lose their jobs and begin marital infidelities, their solution is to start their own business together. In order to find meaning to their empty lives, they follow various New Age gurus and other such groups. Eventually, they hit rock bottom and have to make some hard decisions",
      "tmdbMovieId": 41588,
      "avgRating": 3.09028,
      "releaseYear": "1994",
      "numRatings": 144,
      "posterPath": "/fhtW0cu3HXnftqasdt8ptKOQDjU.jpg"
   }
}