{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "sexuality",
            "id": 738
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "culture clash",
            "id": 1463
         },
         {
            "name": "isolation",
            "id": 1533
         },
         {
            "name": "strangeness",
            "id": 1942
         },
         {
            "name": "violent husband",
            "id": 2320
         },
         {
            "name": "new zealand",
            "id": 2658
         },
         {
            "name": "maori",
            "id": 2659
         },
         {
            "name": "arranged marriage",
            "id": 2692
         },
         {
            "name": "settler",
            "id": 3591
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "secret love",
            "id": 7879
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "sign language",
            "id": 188953
         },
         {
            "name": "piano",
            "id": 207592
         },
         {
            "name": "19th century",
            "id": 207928
         },
         {
            "name": "mother daughter relationship",
            "id": 240315
         }
      ],
      "imdb_id": "tt0107822",
      "video": false,
      "title": "The Piano",
      "recommendations": [
         1245,
         859,
         746,
         10998,
         409,
         7984,
         8293,
         11386,
         1985,
         1630,
         9576,
         1715,
         873,
         12102,
         1632,
         11051,
         10436,
         11050,
         10876,
         38718
      ],
      "backdrop_path": "/dVDdABRCmQglgXod01GMHgtkS8k.jpg",
      "revenue": 116700000,
      "reviews": [{
         "author": "CRCulver",
         "id": "5a890dc8c3a3686339062f2a",
         "content": "Jane Campion's third feature film, THE PIANO is a historical drama that tells of a Scottish woman, Ada McGrath (Holly Hunter), who is married off to a colonist in New Zealand that she has never met. Ada is mute, a development that mysteriously came upon her in childhood, but she is a virtuoso pianist and her cherished instrument is one way she communicates her feelings to the world. As Ada and her illegitimate daughter Flora (Anna Paquin) land on the shores of New Zealand's South Island sometime in the mid-19th century, her new husband Stewart (Sam Neill) ignores her sign-language entreaties to carry her piano inland along with their other belongings. Feeling no love for this man she has been forced to marry, Ada is drawn into sexual bargaining with another colonist, Baines (Harvey Keitel) who offers to get her the piano back if she does what he wants.\r\n\r\nThe first half of this film is an interesting study in sexual power and the tragedy of a woman's lot during this historical era. Neither Stewart or Baines are admirable men; Stewart is uncaring of Ada's true passion for the piano, but Baines exploits her distress and powerlessness to get what he wants and he doesn't respect consent. Unfortunately, as the film develops, Campion decides to ultimately turn this into a straight-up romance novel, where the heroine willingly gives in to the roguish bad-boy. I realize that Campion might go for the common desire of a woman to feel desired, but that shouldn't come at the expense of glorifying a creep as she does here.\r\n\r\nTo better serve as a foil for Baines, Stewart's squareness is played up, and the two characters are reduced to crude cutouts of a \"good guy\" and \"bad guy\". This extends to a critique of 19th-century colonialism and racism: naturally, as the man who audiences are supposed to feel is disgusting and unattractive, Stewart is keen on stealing land from the indigenous Maori people. Baines, on the other hand, as the cool heartthrob, hangs out with the Maori and respects their culture even to the point of learning their language and tattooing his face.\r\n\r\nWell, even if the actual plot is a ridiculous pulp fantasy, the production values are fine. New Zealand's wild shore and rainforests are memorably captured by cinematographer Stuart Dryburgh. The film has a distinctive blue cast that unites the thick cover of the forest and the depths of the sea. While some controversy remains about the depiction of the Maori people here, they are still given a great deal of screen time and the ability to speak their own language on film. The piano-heavy soundtrack by English composer Michael Nyman is deservedly celebrated: deliberately anachronistic, its saccharine, minimalist feel of the 20th century represents Ada's innermost thoughts.\r\n\r\nThere is good acting as well. Anna Paquin, of course, won an Oscar for her depiction of Flora, and one wouldn't expect such mature composure and convincing emotions from a child of this age. Holly Hunter has to convey everything through gestures and facial expressions and she does this marvelously. One of the delights of Campion's feature debut SWEETIE was Genevieve Lemon, and here in a supporting role she turns in here a mildly comedic performance that adds some levity to the severe sexual drama.\r\n\r\nSeeing it again some two decades after it came out, THE PIANO feels like a rather slighter film than I remembered it, and it is difficult to understand what drew critics to the time to rave about it. I would really only recommend this to people with a specific interest in New Zealand or Michael Nyman's soundtrack, but I don't see this as an all-time classic.",
         "url": "https://www.themoviedb.org/review/5a890dc8c3a3686339062f2a"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ada McGrath",
               "gender": 1,
               "credit_id": "52fe426ec3a36847f801e337",
               "name": "Holly Hunter",
               "profile_path": "/sfqLoSx2dmfQTafqbv8lNHnBeUW.jpg",
               "id": 18686,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "George Baines",
               "gender": 2,
               "credit_id": "52fe426ec3a36847f801e33b",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alisdair Stewart",
               "gender": 2,
               "credit_id": "52fe426ec3a36847f801e33f",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Flora McGrath",
               "gender": 1,
               "credit_id": "52fe426ec3a36847f801e343",
               "name": "Anna Paquin",
               "profile_path": "/5Q4vZK2PqHkreQLmbPspIgrSLUP.jpg",
               "id": 10690,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Mana",
               "gender": 2,
               "credit_id": "52fe426fc3a36847f801e36b",
               "name": "Cliff Curtis",
               "profile_path": "/dkSlTaKKe0uaKKAscVaSHlGq4g3.jpg",
               "id": 7248,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Aunt Morag",
               "gender": 1,
               "credit_id": "52fe426ec3a36847f801e34b",
               "name": "Kerry Walker",
               "profile_path": "/n5vtFTmK9mdeiChohCPw4qlTgup.jpg",
               "id": 10756,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Hira",
               "gender": 0,
               "credit_id": "52fe426ec3a36847f801e347",
               "name": "Tungia Baker",
               "profile_path": null,
               "id": 10755,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Reverend",
               "gender": 2,
               "credit_id": "52fe426fc3a36847f801e367",
               "name": "Ian Mune",
               "profile_path": "/iV8i8vAgJOY7edzXqx0D1TT0gO8.jpg",
               "id": 7255,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Nessie",
               "gender": 0,
               "credit_id": "52fe426fc3a36847f801e36f",
               "name": "Genevieve Lemon",
               "profile_path": "/fgpd0MzMdvbnLOLWRROoBMGZLdp.jpg",
               "id": 10760,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Hone",
               "gender": 2,
               "credit_id": "52fe426fc3a36847f801e373",
               "name": "Pete Smith",
               "profile_path": "/gYVa8DLfNqr88GEngJr6o29dtMc.jpg",
               "id": 7249,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Chief Nihe",
               "gender": 0,
               "credit_id": "52fe426fc3a36847f801e377",
               "name": "Te Whatanui Skipwith",
               "profile_path": null,
               "id": 10761,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Blind Piano Tuner",
               "gender": 2,
               "credit_id": "57f77a2fc3a368240d0000f8",
               "name": "Bruce Allpress",
               "profile_path": "/v4mSTKKk5imJI7H2nzWh5vJdDDZ.jpg",
               "id": 173431,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Angel",
               "gender": 1,
               "credit_id": "5585cf2392514121fc0007af",
               "name": "Rose McIver",
               "profile_path": "/wMbfF650SDV9Oyy78EvYOi9aQqV.jpg",
               "id": 53485,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Tahu",
               "gender": 2,
               "credit_id": "57f77bf8c3a368248b000155",
               "name": "Neil Gudsell",
               "profile_path": "/3ZbJH72at7eaeRvTAswAmpduXLS.jpg",
               "id": 1690610,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Taunting Man",
               "gender": 2,
               "credit_id": "57f77c9292514175b30001ab",
               "name": "Jon Sperry",
               "profile_path": "/NAICtTUPFVGXm02Brp9BWbItk4.jpg",
               "id": 1404551,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe426ec3a36847f801e351",
               "name": "Jane Campion",
               "profile_path": "/4Bx7nrotQmiGB80ynUvPDPoiJCe.jpg",
               "id": 10757,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe426ec3a36847f801e357",
               "name": "Jane Campion",
               "profile_path": "/4Bx7nrotQmiGB80ynUvPDPoiJCe.jpg",
               "id": 10757,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe426fc3a36847f801e363",
               "name": "Michael Nyman",
               "profile_path": "/yAjkiel4NWG4zu9o53GusvsdTEn.jpg",
               "id": 10759,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe426fc3a36847f801e37d",
               "name": "Stuart Dryburgh",
               "profile_path": null,
               "id": 7262,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe426fc3a36847f801e383",
               "name": "Veronika Jenet",
               "profile_path": null,
               "id": 10762,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57d6c0c9c3a3684f3c008957",
               "name": "Alain Depardieu",
               "profile_path": null,
               "id": 1462022,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57d6c0da9251416f550081bd",
               "name": "Mark Turnbull",
               "profile_path": null,
               "id": 75478,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 11.216942,
      "production_countries": [
         {
            "iso_3166_1": "NZ",
            "name": "New Zealand"
         },
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 713,
      "vote_count": 394,
      "budget": 7000000,
      "overview": "After a long voyage from Scotland, pianist Ada McGrath and her young daughter, Flora, are left with all their belongings, including a piano, on a New Zealand beach. Ada, who has been mute since childhood, has been sold into marriage to a local man named Alisdair Stewart. Making little attempt to warm up to Alisdair, Ada soon becomes intrigued by his Maori-friendly acquaintance, George Baines, leading to tense, life-altering conflicts.",
      "similar": [
         1586,
         1903,
         116,
         75174,
         281957,
         6114,
         153,
         1278,
         15705,
         27066,
         283227,
         1628,
         884,
         230266,
         4507,
         95610,
         8457,
         193687,
         521,
         93
      ],
      "original_title": "The Piano",
      "runtime": 121,
      "poster_path": "/yuGqa81ye11dDAeBZ9MResJSmoY.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "mi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "New South Wales Film & Television Office",
            "id": 418,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CiBy 2000",
            "id": 7832,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jan Chapman Productions",
            "id": 14089,
            "origin_country": ""
         },
         {
            "logo_path": "/w7d3hoHQaC0XwjrxEG1yPeuUhu5.png",
            "name": "Australian Film Commission",
            "id": 417,
            "origin_country": "AU"
         }
      ],
      "release_date": "1993-05-19",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jane Campion"],
      "runtime": 121,
      "synopsis": "The Piano tells the story of a mute Scotswoman, Ada McGrath (Holly Hunter), whose father sells her into marriage to a New Zealand frontiersman, Alistair Stewart (Sam Neill). She is shipped off along with her young daughter Flora McGrath (Anna Paquin). Ada has not spoken a word since she was six years old, expressing herself instead through her piano playing and through sign language for which her daughter has served as the interpreter. Ada cares little for the mundane world, occupying herself for hours every day with the piano. It is never made explicitly clear why she ceased to speak. Flora, it is later learned, is the product of a relationship with a teacher whom Ada believed she could control with her mind, making him love her, but who \"became frightened and stopped listening,\" and thus left her. Ada, Flora and their belongings, including the piano, are deposited on a New Zealand beach by the ship's crew against her angry objections. As there is no one there to meet them, they spend the night alone, sheltering under a tiny tent made of a hoop skirt frame. The following day, Alistair arrives with a Mori crew and his friend Baines (Harvey Keitel), a fellow forester and a retired sailor, who has adopted many of the Maori customs, including tattooing his face and socializing with the Maori instead of his own race (save Alistair). There are insufficient men to carry everything and Alistair abandons the piano, again eliciting objections from Ada. Alistair proves to be a shy and diffident man, who is jokingly called \"old dry balls\" by his Maori cohorts. He tells Ada that there is no room in his small house for the piano. Ada, in turn, makes no effort to befriend him and continues to try to be reunited with her piano. Unable to communicate with Alistair, she goes, with Flora, to Baines and asks to be taken to the piano. He agrees, and the three spend the day as she plays tunes on the beach. While he socially allies himself with the Maori, Baines has steadfastly refused any sexual activity with their women. But he clearly finds Ada attractive due to her passion for music. Baines eventually retrieves the instrument and suggests that Alistair trade it and lessons from Ada for some land that Alistair wants. Alistair consents, oblivious to the budding attraction between Ada and Baines. She is surprised to find that he has had the piano put into perfect tune after its rough journey. He asks to simply listen rather than learn to play himself, and then offers to let her buy the piano back, one key at a time, by letting him do 'things he likes' while she plays. Ada ambivalently agrees as she is attracted to Baines. In the meantime, Ada and Alistair have had no sexual, or even mildly affectionate, interaction even though they are by now formally married. Baines is sexually aroused by Ada's playing to the point that he openly approaches her. Finally, she yields to her own lust one afternoon, and she and Baines have sex. Alistair finally begins to suspect the love affair and after discovering them, he angrily boards up his home with Ada inside when he goes off to work on his timberland. After that interlude, Ada avoids Baines and feigns affection with Alistair, though her caresses only serve to frustrate him more because when he makes a move to touch her in return, she pulls away. Before Alistair departs on his next journey, he asks Ada if she will go to see Baines she shakes her head 'no' and he tells her he trusts that she won't go to him while he's gone. Soon after, Ada sends her daughter with a package for Baines, containing a single piano key with an inscribed love declaration. Flora has begun to accept Alistair as her 'papa' and is angered by her mother's infidelity. She brings the piano key instead to Alistair. After reading the love note burnt onto the piano key, Alistair furiously returns home and chops off Ada's index finger with an axe to deprive her of the ability to play her piano. After Ada recovers from her injury, Alistair sends her and Flora away with Baines and dissolves their marriage. They depart from the same beach on which she first landed in New Zealand. While being rowed to the ship with her baggage and the piano jammed into a rowboat, Ada feels that the piano is ruined as she can no longer play and insists that Baines throw the piano overboard. As it sinks, she deliberately puts her foot into the loops of rope trailing overboard. She is rapidly pulled deep underwater connected by the rope to the piano but then she changes her mind and kicks free to be pulled back into the boat. In an epilogue, Ada describes her life with Baines and Flora in Nelson, England, where she has started to give piano lessons in their new home, and her severed finger has been replaced with a silver digit made by Baines. Ada says that she imagines her piano in its grave in the sea, and herself suspended above it, which 'lulls me to sleep.' Ada has also started to take speech lessons in order to learn how to speak again. The film closes with the Thomas Hood quote, from his poem \"Silence\", which also opened the film: \"There is a silence where hath been no sound. There is a silence where no sound may be in the cold grave under the deep deep sea.\"",
      "writers": ["Jane Campion"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107822/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAyOTA0MzQ5NTReQTJeQWpwZ15BbWU3MDQ4NDkwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Holly Hunter, Harvey Keitel, Sam Neill | See full cast and crew »"],
      "reviews": [
         "This is one of my all-time favorite films. It combines masterful scripting, cinematography, performances, and musical score into a disturbing, erotic, and ultimately uplifting piece. The movie's heroine, wonderfully portrayed by Holly Hunter, is mute (symbolic of the fact that she has no say in her own life), with her daughter (the astonishing Anna Paquin) and her piano as her personal obsessions. Her conscripted husband, coldly played by Sam Neill, is trying to win her heart and her desire in all the wrong ways, while his crude tribal neighbor, sensually played by Harvey Keitel, understands her needs and ultimately captures her ... physically, intellectually, and romantically. The film's message and its delivery are extraordinarily powerful, the cinematic technique is rich ... the sequence shot with Hunt, Pacquin, Keitel and the piano on the beach is one of the best pieces of work I've ever seen. Lasting impact.",
         "There are very few female directors in the film industry that have been given proper acknowledgment or had their works introduced to mainstream filmgoers. Jane Campion is one of these precious few, a director who carefully paces and sculpts her works so that they magnificently flow like a musical interlude. \"The Piano\" is her ultimate masterpiece, a film of such simplicity, described with calm and tense complexity. Holly Hunter received an Oscar for her fascinating performance as Ada, a mute woman who is forced into an arranged marriage with a New Zealand landowner, played convincingly by Sam Neill, a native Australian actor himself. Ada journeys to New Zealand with her young daughter (Anna Paquin, also an Oscar-winner that year), few other possessions, and her treasured piano, a part of her that amplifies her voice that she cannot express through vocal communication. I believe it would be wrong to assume that any of the characters are martyrs in this tragic story, nor would it be right to think Sam Neill's character a villain. You may think this is crazy, but I think the piano itself serves as both a good and bad omen for all that are involved. I would relate it to a \"Pandora's box\" of sorts, a treasure that exposes all the evil and sin in the world, but which also provides hope as well. The piano is Ada's sounding box, a tool that allows her to escape from a world that does not understand her, but that also threatens her moral compass, removing her from marital conventions and forces her to lose herself. The performances in \"The Piano\" are particularly good, especially Holly Hunter's. It is interesting to note that all of Hunter's piano playing in the film is actually Hunter herself performing in front of us. You can visually and aurally feel the mood of Hunter's character through the music she plays. We the audience lose ourselves right along with her, lost upon a sea of music. We see why Keitel becomes enamored by her, and why Neill becomes overcome with jealousy and betrayal. Not many films would allow us to enter the emotions of all three main characters, but this film is truly an exception. Rarely do we witness real beauty captured on film. \"The Piano\" is such a visually stunning film, it's almost intoxicating how its atmosphere sweeps across the screen. This landscape is equaled by the performances, bringing understanding and mystery to this wonder. Sometimes symbolism of this nature can be distracting to an audience. \"The Piano\" dares to follow this symbolic path, and hits a bullseye with full emotional force. Rating: Four stars.",
         "The Piano is a beautiful film in many different respects. In terms of cinematography, I've seen few like it. It is dark and beautiful and compelling. The story seems, on paper, as a torrid love story without much originality. But the sensuous portrayal of Harvey Keitel and Holly Hunter and the complex acting of a young Anna Paquin allow this story to ring true. I was skeptical upon viewing a film so lauded by critics and film snobs, but found myself both moved and connected to the film that holds strangely relevant themes for modern times. It is rare that I love both a film's visual beauty and it's script as well. This is that rare occasion.",
         "Director-screenwriter Jane Campion started at the movies in the early 1980s at the Australian School of Film and Television... She clearly emerged from her cultural heritage to become one of the world's premiere female directors... Campion's films typically have a treacherous terrain of searing emotional intensity... We recognize ourselves in the ways her characters think and behave... Her work signifies a break with the tragic, the Gothic and the sentimental... Her exquisite film which won three Academy Awards including one for Campion's screenplay, is not about sex, but about passion... Jane challenges the viewer on many levels... Her film (literary inspired from 'Wuthering Heights') explores new territory in the delicious handling of female sexuality and pleasure with the ecstasy of a loving relationship... In one scene Ada, with tears of anger, hits Baines hard across the face, as if she has spoken words of love... With each new breath, with every moment that their eyes remain locked together, the promise of intimacy is confirmed and reconfirmed and detailed... Only their feelings and emotions guide their instincts... No woman artist had approached sex in such a direct and liberating manner... Campion's scenes shows Baines' face crumpling with the exquisite pain of his pleasure... Ada moving his head to her chest, and Baines struggling through her dress anxious to touch her skin... Nominated for eight Academy Awards, the film tells the story of Ada, a strong willful 19th-century Scotswoman who hasn't spoken, since she was six years old... Ada has been set up in an arranged marriage to a British emigrant in New Zealand... The film opens with Ada who is carried to shore on the shoulders of five seamen to meet her husband Stewart, a landowner who is without much emotion or real love... Her large Victorian skirt spreads across the men's arms and backs... On her head a black bonnet... Around her neck her pad and pen... Campion manages to chose a cast to suit her purpose and style... Ada is not any easy role and Holly Hunter plays her without vanity... Her face is alight with facial expression, sometimes tender, sometimes sad, sometimes humorous, sometimes soft, while her hands and fingers are quick and neat... Ada speaks through sign-language translated by her young daughter Flora, and through her beloved piano which happens to be the prime source of her expression... She takes great delight in feeling her fingers on her piano's keys... But in the way she eyes the illiterate, uncultured Baines, there is an insolence and lack of respect... We watch her stopping abruptly, indignantly, as he touches her neck... Harvey Kietel plays the lonely neighbor George Baines, a depressive man who is everything Stewart is not... He has never seen a graceful woman behave with so much abandon... Ada moves to the piano... She wants to touch it, but she is torn by her feelings, wanting it, but not owning it... Baines views Ada totally absorbed in her piano music... He seems satisfied to watch... He finds himself edging irresistibly closer, magnetically drawn to the spectacle... Baines enjoys her fingers moving on the keys and the small details of motion on her face... Twice he closes his eyes and breathes deeply... He is experiencing a strange sense of appreciation and lust... He feels powerless... He is desperate and romantic... He no longer admires her absorption with the piano... He is jealous of it... His attention finally focuses on her neck as it bends further or closer to the piano... Ada's long white neck proves irresistible... Baines comes across the room, kisses her, and asks: 'Do you know how to bargain, nod if you do. There's a way you can have your piano back.' Anna Paquin has been proclaimed one of the best child acting roles ever... She gives a subtle and complex performance as the very cute little girl torn between her mother and stepfather... She looks over at the house suddenly aware that the piano playing has stopped suddenly... She investigates the mystery peeping through the various cracks and holes in the loosely built hut... Her venture is one of challenge and curiosity... Her complex portrayal of Flora won her the Best Supporting Actress... Sam Neill plays the intense, moralistic and very-Victorian husband Alistair Stewart, who never understands his woman's nature... He surveys Baines' hut suspiciously... There are sounds inside which are worrying him... By wondering around the hut, he finds a hole where he can see the two lovers kissing, and undressing... He reels back angry, but just as we might expect him to burst through, he steps up to look again... Jane Campion creates an unusual film, poetic and lyrical, complimented by a beautiful cinematography of the haunting woods, which by many critics has been named as a masterpiece... She is the first female director to win the Palme d'Or at Cannes...",
         "Jane Campion's Oscar-winning movie follows Ada (played by Holly Hunter), an immigrant to the New Zealand outback and an arranged marriage, who has not spoken for years and lives her life through the sound of her piano. Her husband (played by Sam Neill) is a man without much understanding, who tries to break the connection between his new wife and her piano; in contrast to him is the wild illiterate Baines (played by Harvey Keitel), a tattooed loner, who reaches into Ada's soul and helps her to regain contact with her emotions and ultimately, her voice too. The film is visually compelling, with its muted colours and wide open spaces, and uses the soundtrack by Michael Nyman in such a way so all the elements fit together. Keitel and Hunter give excellent performances within a sensitive and sensual screenplay, while Anna Paquin is impressive as Ada's wise daughter, always watching and always aware. Campion managed to make the story touching, involving, and sexy, and it well deserved the plaudits heaped on it.",
         "The Piano is an amazing movie- the cinematography stunning- like the piano on the beach and the sinking piano at the end. There is no praise high enough for Holly Hunter's depiction of Ada. Ana Pacquin and Sam O'Neill also shine. And Harvey Keitel- having gone native- by marking his body in the native style- gives a truly sympathetic and daring performance. This movie stays with the viewer long after it is over. At times I actually felt the dampness of the scenery... most of all it explores the regions of the heart- through the innovative music and the body language of Hunter. A film not to be missed by those who appreciate good story and good filmaking. Thanks Jane Campion for this classic.",
         "If one wants to see true acting, just watch Hollie Hunter in this film. She does more with her facial expressions than twenty actors can with a thousand words. Her stature, her presence, her determination are so intense. One could feel sorry for her in places. She has been ripped from her world for reasons we cannot fathom. She has been deemed expendable. When she arrives she expects to be treated properly. Anna Paquin as her daughter settles into the new environment and begins to prosper. But it is not without sacrifice. The piano is the symbol of what was left behind. Her affair with the Maori is partly passion, partly payment. We never know how much of each. The performances are stunning across the board and, this time, worthy of Academy Awards. There are some very sensual scenes and scenes of great danger. There is pain inflicted and selfishness and power. Hollie Hunter rises above it all and makes her way through this quagmire (the rainy muddy jungle in this case), and arises, victorious in her own fashion.",
         "Ada, A woman chosen to be mute, travels with her daughter and baby grand piano across the seas from England to an exotic land in New Zealand during the Victorian Era. This woman has been oppressed in her homeland and denied her womanhood. She has been arranged a marriage with a Landowner who is afraid of fleshly desire. She meets an exotic Caucasian male who seduces her into a world she can be herself in. She is able to release her oppression through their passion. A film of intrigue. Why make such a story? It has a touch of magical realism. Jane Campion creates a mythical world and fills it with the human condition. Holly Hunter plays Ada with a fierce and graceful flowing note and deservedly won her awards. She plays woman's independence. The Piano is a strange film and very effecting on it's story. The screen emits the mystery of the forest that surrounds and engulfs Ada's spirit. Haunting and lyrical.",
         "I wonder if an assessment of all the bad reviews of this movie would include almost all men. Although there are certainly men who enjoyed this movie, I can understand why a lot of men would fail to appreciate it, simply because so much of its sensual potency deals with what is inextricably feminine. I just watched it for the the first time in ten years, and I was as wowed by it as I was the first time. If you told me I would ever find Harvey Keitel sexy, I would have called you crazy...but ooh baby! The man sees her inner passion and is transfixed, then reaches out to her with a graphicness that is somehow also tender, almost reverential. In contrast, Sam Neill is blindly reaching out like he would to a wooden doll, not seeing \"her\" at all. It's a delicious contrast and heightens the beauty of the very real connection that occurs between the lovers. Ada (Holly Hunter's) response is to be wooed despite herself. She doesn't \"want\" to give herself to this man who is so contrary to her image of a lover, but she recognizes his identification with who she is. Willful as she is, once her heart is given, it becomes impossible for her to do other than to seek him out. This is truly an archetypal dance.",
         "Can someone explain to me why \"The Piano\" ain't in the IMDb top 250 and, for example, movies like \"Sin City\" or \"Crash\" (!!!!!!!!!!) are????????????? This movie,is,by far, one of the most delicate and intelligent ever; it softly touches you, emotionally AND physically, for the filming and the photography are exceptional. Actors in it are troubling, beautiful and so... beautiful(again,i know)! Holly Hunter, who plays a mute piano goddess and manages with her not enough known acting skills to express more with her eyes,her grace and her tiny hands than 100 Gwyneth paltrows put together!!!(no offense,i much enjoyed Shakespeare in love,but,come on...)Harvey Keitel in this broken-hearted warrior/peasant role is more than touching;love embraces him as it embraces us,viewers. Still, Jane Campion avoids the unfortunately fashionable arrogant and tutorial directors touch (oscar for best movie, Crash?????? where the hell are we??????) and lets the viewer flow on his own in this huge ocean of naked and oh so true feelings and respects the pain and/or the anger (Sam Neil,probably the only role in his carrier that shows his great talent) of her clearly beloved characters.Landscapes,seashores,humid forests,mud,rain: nature, as well as human nature, are captured by Campion's eyes and heart in the most sensitive and unartificial way. And, of course, Michael Nyman's score,which, once heard, becomes a part of you. Yes, definitely, the heart asks pleasure first. So treat your hearts and eyes with this unique and sensual Chef d'oeuvre."
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Australian Film Commission, The",
         "CiBy 2000",
         "Jan Chapman Productions"
      ],
      "summaries": [
         "It is the mid-nineteenth century. Ada is a mute who has a young daughter, Flora. In an arranged marriage she leaves her native Scotland accompanied by her daughter and her beloved piano. Life in the rugged forests of New Zealand's North Island is not all she may have imagined and nor is her relationship with her new husband Stewart. She suffers torment and loss when Stewart sells her piano to a neighbour, George. Ada learns from George that she may earn back her piano by giving him piano lessons, but only with certain other conditions attached. At first Ada despises George but slowly their relationship is transformed and this propels them into a dire situation.",
         "A mute woman along with her young daughter, and her prized piano, are sent to 1850s New Zealand for an arranged marriage to a wealthy landowner, and she's soon lusted after by a local worker on the plantation."
      ],
      "budget": 7000000
   },
   "movielensId": 509,
   "movielens": {
      "languages": [
         "English",
         ""
      ],
      "releaseDate": "1993-05-19",
      "dvdReleaseDate": "1998-01-13",
      "directors": ["Jane Campion"],
      "runtime": 121,
      "movieId": 509,
      "title": "The Piano",
      "mpaa": "R",
      "actors": [
         "Holly Hunter",
         "Harvey Keitel",
         "Sam Neill",
         "Anna Paquin",
         "Cliff Curtis",
         "Kerry Walker",
         "Tungia Baker",
         "Ian Mune",
         "Genevieve Lemon",
         "Pete Smith",
         "Te Whatanui Skipwith",
         "Bruce Allpress",
         "Rose McIver",
         "Neil Gudsell",
         "Jon Sperry"
      ],
      "imdbMovieId": "0107822",
      "originalTitle": "The Piano",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["cyTn4XIYH8M"],
      "plotSummary": "After a long voyage from Scotland, pianist Ada McGrath and her young daughter, Flora, are left with all their belongings, including a piano, on a New Zealand beach. Ada, who has been mute since childhood, has been sold into marriage to a local man named Alisdair Stewart. Making little attempt to warm up to Alisdair, Ada soon becomes intrigued by his Maori-friendly acquaintance, George Baines, leading to tense, life-altering conflicts.",
      "tmdbMovieId": 713,
      "avgRating": 3.68563,
      "releaseYear": "1993",
      "numRatings": 18607,
      "posterPath": "/yuGqa81ye11dDAeBZ9MResJSmoY.jpg"
   }
}