{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109950",
      "video": false,
      "title": "Guardian Angel",
      "recommendations": [205680],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cynthia Mckay",
               "gender": 1,
               "credit_id": "52fe4babc3a36847f820ea2b",
               "name": "Cynthia Rothrock",
               "profile_path": "/cdWIhVIGlW8UAXpZ0XKbH5FYrPY.jpg",
               "id": 74375,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4babc3a36847f820ea35",
               "name": "Marshall R. Teague",
               "profile_path": "/qRDCvSWg76O071pggoGeru30SGk.jpg",
               "id": 63941,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4babc3a36847f820ea39",
               "name": "Daniel McVicar",
               "profile_path": "/AoykcLK6G7oFD7oWp6ZJn1s2pZP.jpg",
               "id": 1093379,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4babc3a36847f820ea3d",
               "name": "Lydie Denier",
               "profile_path": "/foY7t05T8ZtfHD1oQ9EbcdAbxrs.jpg",
               "id": 42137,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4babc3a36847f820ea41",
               "name": "John O'Leary",
               "profile_path": "/4DWRI16denoba5UJkwJ7jh4fH6Q.jpg",
               "id": 53552,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4babc3a36847f820ea45",
               "name": "Art Camacho",
               "profile_path": "/bthvmWThKWzm4xaQ6hRdw4iO27g.jpg",
               "id": 112159,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4babc3a36847f820ea49",
               "name": "Robert Miano",
               "profile_path": "/sszrBivDN2Ry0I3vWY5k8CjxYdB.jpg",
               "id": 62715,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4babc3a36847f820ea31",
            "name": "Richard W. Munchkin",
            "profile_path": null,
            "id": 100505,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.406496,
      "production_countries": [],
      "id": 117164,
      "vote_count": 3,
      "budget": 0,
      "overview": "Detective - turned - bodyguard Cynthia McKay (Cynthia Rothrock) is hired by a psychotic icy seductress, Nina Lindell (Lydie Denier), the same woman who killed Mckay's lover months earlier.  With vendetta in her heart McKay accompanies the flamboyantly playful womanizer through the glamourous world of the super-rich as his protector.  In a unique role reversal, it is the woman protecting the man from another woman, erupting into a deadly triangle of passion, suspense and action.",
      "similar": [],
      "original_title": "Guardian Angel",
      "runtime": 93,
      "poster_path": "/hwbKoOSUuzuN2AQppnUxwwd4qOD.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1994-11-22",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "She's no angel of mercy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard W. Munchkin"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Joe Hart"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109950/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1OTA0NDQzN15BMl5BanBnXkFtZTcwMjIwNjQyMQ@@._V1_SY317_CR122,0,214,317_AL_.jpg",
      "actors": ["Stars: Cynthia Rothrock, Daniel McVicar, Lydie Denier | See full cast and crew »"],
      "reviews": [
         "\"Guardian Angel\" could possibly be the best of Cynthia Rothrock's early 90's low-budget American martial arts flicks, IF the whole movie was as good as its first half hour: during that time we get some dynamic fights, gunplay, a car chase, two car crashes, bad girls with guns, a tight plot, etc. But after Cynthia quits the police force and becomes a bodyguard, the film becomes repetitive and starts to drag. The absolutely gorgeous Lydie Denier (who really caught my eye in a couple of \"Acapulco H.E.A.T\" episodes I happened to watch) playing a truly evil bi*ch is a definite plus, but the lack of a proper showdown between her and Rothrock is a disappointment. The climax is a relatively large-scale speedboats-and-helicopter chase, but most of it appears to have been done by stunt doubles and is not very exciting. (**1/2)",
         "A female ex-cop who was drummed out of the force for recklessness (and who could probably beat Chuck Norris in a fight) hires herself out as a private bodyguard; her first client is a worthless playboy type. It takes half the movie for her to get kicked off the force in the first place. Lots of great fight choreography but the plot is strictly by the numbers, and the acting is as wooden as the dialogue. Give this one a miss.",
         "You see, a film like this can't be spoilt. Only enriched. It is so stupid you'll guess the plot after 5 seconds, and then you'll want something more. Well, if you want something more, concentrate on the plot holes etc etc. And the action holes. And the characters we have never seen before who are only in the damn film to get kicked in the head. And the way she kicks the innocent barman in the head in the bar(he was just pouring a drink dammit). And how she starts a gang war!! I thought she was the good guy! And the best bit is the mysterious scene with the brother with a twist in the plot. Except it is completely unrelated to anything. There must have been 1 writer who came up with a devious twist, then the director cut it out halfway through, probably because when he heard twist he was thinking about a twisting snap kick (which would have been to some character who was brought in for two minutes, the plot all became based on him, then he got kicked and died). Im rambling now, but this movie is gold for a laugh. see it now.",
         "Cop Christine McKay (Rothrock) is hot on the trail of a counterfeiting ring and is working the case with her partner and fiancé Nick Taylor (Teague). Behind the operation are the criminals David (Miano) and the super-evil Nina Lindell (Denier). After some tragic events perpetrated by Nina, Christine gets kicked off the force and hits the skids. She ends up living in a trailer with her dog Flash, who she has conversations with about her life. But she vows revenge on the sinister Nina at any cost. Christine ends up taking a bodyguard job for a rich, cocky playboy named Lawton Hobbs (McVicar). Nina was his ex-girlfriend and so there's a personal stake there. Christine will have to use all her skill as a Martial Artist to get to the bottom of this tangled web. Can she do it? We really enjoyed this Rothrock vehicle. PM rarely disappoints, and with a team of PM mainstays both in front of and behind the camera, you really can't lose. Director Munchkin applies the same techniques with Rothrock as he did with Don the Dragon Wilson or Jeff Wincott in the past, and the result is an entertaining movie with plenty of shooting, chases (of the car, helicopter, boat and horse varieties), Martial Arts fights, and Cynthia Rothrock getting off some cute catch phrases after she beats up her assailants. Marshall Teague gets to show off his range - we hadn't seen him play the charming cop before this. We mainly know him as the evil dojo master/teacher from the great A Dangerous Place (1995). Robert Miano pops up constantly and we know him and love him, he does his standard good job. A nice surprise was Lydie Denier as the baddie-ess. She was cold, heartless, and dastardly, and a perfect enemy for Rothrock. Christine's Captain in the movie was female but looked and dressed a lot like David Coverdale. And while McVicar did a decent job as the Hugh Hefner-like lothario, we felt Bruce Campbell could have also played that part. Guardian Angel is also filled with amazingly 90's-looking people. Some of the fashions and hairstyles are pretty impressive and are worth seeing in their own right. Most of the fight/chase scenes have some wailin' electric guitar behind them which underlines the fact that PM knows its audience and wants to give them what they want to see: 80's/90's action in its most uncut form. We definitely applaud that. But this movie also has some comments about the battle of the sexes and some points of view which keep it from getting overly dumb. Plus, Lawton Hobbs (nice name) predates Muammar Qaddafi by many years in initiating the idea of a female bodyguard. Finally, we noticed in the credits that the fight choreographer was Richard Norton. Too bad he couldn't have appeared in the film, even if it was just a cameo. In the end, there's very little NOT to like about Guardian Angel. Cynthia Rothrock is one of our favorite action stars, and here she's backed up by a competent team. You gotta love it. For more action insanity, drop by: www.comeuppancereviews.com",
         "This is one of those wonderful martial-arts movies that begin with two posses of tough gang members facing off in a park; and when the deal goes wrong and the battle starts, it turns out they all know karate and kung fu! The ever-wooden Cynthia Rothrock plays (as usual) a cynical, deadpan, good cop, this time in Los Angeles. She and her police partners are trying to break up a counterfeiting ring, and when that plot line is exhausted, the story just switches over to something else, and Cynthia becomes the personal bodyguard of a wealthy, great-looking tycoon. Within the film's obviously rock-bottom budget, there's some helicopter action, some speedboat action, some car chases, a brawl where Cynthia beats up everyone in a country-western bar, some swimming-pool scenes with bimbos in thong bikinis, and a surprisingly good horseback chase. About a dozen and a half cops get gunned down. A lot of plot twists happen that just don't make any sense; don't worry about them. (And counterfeiting currency is a federal crime, so where the hell is the FBI? I guess they were too busy.) The fight choreography was done by Cynthia Rothrock's frequent co-star Richard Taylor, whose classy and witty presence in front of the camera would frankly have made this a better movie. He also tended to make Cynthia a better actress when they appeared together, and frankly she could use it; she seems tired and bored, and does her best acting in GUARDIAN ANGEL when she is playing opposite a pet dog to whom she delivers bitter drunken monologues. The dog almost out-acts her! She also wears some of the most god-awful clothing any leading lady has ever worn in any movie: loose, baggy-leg jeans with pale acid-washed areas over each buttock were the most shocking. The other actors are all over the map. You can picture many of the minor characters being cast this way: \"Hey, me and some other guys I know are going to be in a movie. You wanna be in it too? No, dude, I'm serious!\" Then there are the slumming professionals: the most fun is Lydie Denier, the stunning French model and veteran of \"Red Shoe Diaries,\" \"Baywatch,\" \"Melrose Place,\" and of playing many, many other variations on the sexy French bombshell; here she plays a psychopathic killer as if she were in BAISEZ-MOI or an \"Alias\" episode and not some direct-to-cable trash like this. There's also the tall, dark and handsome Daniel McVicar, now a regular on \"The Bold and the Beautiful,\" John O'Leary, who has played a dignified old man in dozens of movies and sitcom episodes and does it again here, and Aharon Ipale, the veteran Arab character actor perhaps best known as \"Pharaoh Seti\" from THE MUMMY and THE MUMMY RETURNS. For these professionals, GUARDIAN ANGEL must be the most laughable entry on their resumes. I gave this movie a better rating than it probably deserves because my daughters, who are enthusiastic martial-arts students, both like to see a woman kicking ass and having the big action scenes for a change. They're still a bit too young to care what a low-quality picture this really was, and just enjoyed cheering Cynthia on as she did her swivel-legged, high-kicking, stick-fighting thing. If you like this kind of flick, you could probably enjoy it on that level.",
         "this movie has a decent story in my opinion,very good fight scenes but i was a little bit disappointed by the end of the movie.i think that it was a way better if lydie denier knew karate also or if she knew to use some weapons,her character has become more interesting too and she was a decent opponent to cynthia.i think when the director filmed the final 'battle' between cynthia&denier he wanted to finish the movie earlier so he didn't care how the end was going to be.all in all i think that fans of cynthia rothrock will be very satisfied watching this movie.it's not like 'yes,madam'! or sworn to justice but it was entertainment enough and cynthia looks awesome in this movie so my rate for this movie is a solid 8/10"
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["PM Entertainment Group"],
      "summaries": ["Christine McKay is a cop. She and some other cops which includes her lover are pursuing some criminals. Her lover gets killed by a woman named Nina, who is later caught. Because of his death McKay is leaves the force. A few months later a man named Hobbs calls McKay. And she goes to see him, he tells her, he wants to hire her to protect him. It seems that Nina is his ex and he tells her she escaped. And Hobbs is worried she's coming for him. McKay goes to check it out and finds out it's true. She then goes back to Hobbs and finds Nina there but she doesn't do anything, instead she's looking for something but Hobbs claims not to know what she's talking about. So McKay stays to protect Hobbs and to get Nina."],
      "budget": 0
   },
   "movielensId": 51,
   "movielens": {
      "languages": [""],
      "releaseDate": "1994-11-22",
      "dvdReleaseDate": "2000-05-22",
      "directors": ["Richard W. Munchkin"],
      "runtime": 93,
      "movieId": 51,
      "title": "Guardian Angel",
      "mpaa": "",
      "actors": [
         "Cynthia Rothrock",
         "Marshall R. Teague",
         "Daniel McVicar",
         "Lydie Denier",
         "John O'Leary",
         "Art Camacho",
         "Robert Miano"
      ],
      "imdbMovieId": "0109950",
      "originalTitle": "Guardian Angel",
      "genres": [
         "Action",
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": ["2BBKx2Hji_0"],
      "plotSummary": "Detective - turned - bodyguard Cynthia McKay (Cynthia Rothrock) is hired by a psychotic icy seductress, Nina Lindell (Lydie Denier), the same woman who killed Mckay's lover months earlier.  With vendetta in her heart McKay accompanies the flamboyantly playful womanizer through the glamourous world of the super-rich as his protector.  In a unique role reversal, it is the woman protecting the man from another woman, erupting into a deadly triangle of passion, suspense and action.",
      "tmdbMovieId": 117164,
      "avgRating": 2.58824,
      "releaseYear": "1994",
      "numRatings": 34,
      "posterPath": "/hwbKoOSUuzuN2AQppnUxwwd4qOD.jpg"
   }
}