{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "sport",
            "id": 6075
         }
      ],
      "imdb_id": "tt0107889",
      "video": false,
      "title": "The Program",
      "recommendations": [
         277846,
         4968,
         25576,
         86231,
         27984,
         27307,
         76297,
         41386,
         241432,
         16405,
         38986,
         48918,
         21433,
         26176,
         106135,
         21413,
         68174,
         20863,
         40798,
         333
      ],
      "backdrop_path": "/xuUDm3AGTaCxN9I8x6GxKtBlYfO.jpg",
      "revenue": 23042200,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sam Winters",
               "gender": 2,
               "credit_id": "52fe47629251416c750976f3",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Autumn Haley",
               "gender": 1,
               "credit_id": "52fe47629251416c750976f7",
               "name": "Halle Berry",
               "profile_path": "/w7HRZh4UhimZO2F6GywkYhjgAX3.jpg",
               "id": 4587,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Darnell Jefferson",
               "gender": 2,
               "credit_id": "52fe47629251416c750976fb",
               "name": "Omar Epps",
               "profile_path": "/t4Qg5ANKK2idfOt4RzWzhiP7IEv.jpg",
               "id": 4987,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joe Kane",
               "gender": 2,
               "credit_id": "52fe47629251416c750976ff",
               "name": "Craig Sheffer",
               "profile_path": "/q2y5cm3RoCsztmuLqJie4cOrLBH.jpg",
               "id": 4138,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Camille Shafer",
               "gender": 1,
               "credit_id": "52fe47629251416c75097703",
               "name": "Kristy Swanson",
               "profile_path": "/wxLklfVHTuVg3O7XT4vBpgzc0Tm.jpg",
               "id": 56128,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bud-Lite Kaminski",
               "gender": 2,
               "credit_id": "52fe47629251416c75097707",
               "name": "Abraham Benrubi",
               "profile_path": "/f5o2JsFVIqi0kFbvgXVgriap9cA.jpg",
               "id": 21132,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Alvin Mack",
               "gender": 2,
               "credit_id": "52fe47629251416c7509770b",
               "name": "Duane Davis",
               "profile_path": "/t9tcFEEbffaD64VZdsc0qwnPnr9.jpg",
               "id": 62032,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Bobby Collins",
               "gender": 2,
               "credit_id": "52fe47629251416c7509770f",
               "name": "Jon Pennell",
               "profile_path": null,
               "id": 82719,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Steve Lattimer",
               "gender": 2,
               "credit_id": "52fe47629251416c75097713",
               "name": "Andrew Bryniarski",
               "profile_path": "/xt65UCdoAqreMMbHAkw3qOclCN0.jpg",
               "id": 52366,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Coach Humes",
               "gender": 0,
               "credit_id": "52fe47629251416c75097717",
               "name": "Michael Flippo",
               "profile_path": null,
               "id": 82720,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Coach Clayton",
               "gender": 0,
               "credit_id": "52fe47629251416c7509771b",
               "name": "Ernest Dixon",
               "profile_path": null,
               "id": 82721,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47629251416c75097721",
               "name": "David S. Ward",
               "profile_path": null,
               "id": 12920,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47629251416c75097727",
               "name": "David S. Ward",
               "profile_path": null,
               "id": 12920,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "598dba1192514178d6012849",
               "name": "Aaron Latham",
               "profile_path": null,
               "id": 1193568,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "598dbad9c3a36875a2011a2e",
               "name": "Michel Colombier",
               "profile_path": null,
               "id": 35838,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "598dbae092514178ec012135",
               "name": "Victor Hammer",
               "profile_path": null,
               "id": 56976,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "598dbae992514178d6012964",
               "name": "Samuel Goldwyn Jr.",
               "profile_path": null,
               "id": 65043,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "598dbaf0c3a36875a2011aad",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "598dbafc92514178d601297c",
               "name": "Duncan Henderson",
               "profile_path": null,
               "id": 6870,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "598dbb0492514178b8012f54",
               "name": "Tom Rothman",
               "profile_path": null,
               "id": 210341,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "598dbb0ec3a36875c00114e6",
               "name": "Albert Brenner",
               "profile_path": null,
               "id": 1222,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "598dbb1492514178a4013370",
               "name": "Carol Winstead Wood",
               "profile_path": null,
               "id": 32279,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "598dbb1a92514178d60129aa",
               "name": "Kathe Klopp",
               "profile_path": null,
               "id": 13435,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "598dbb23c3a36875b10116a0",
               "name": "Tom Bronson",
               "profile_path": null,
               "id": 798,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "598dbb2c92514178ec012185",
               "name": "Kimberly Ray",
               "profile_path": null,
               "id": 56594,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "598dbb37c3a36875a2011afb",
               "name": "Paul Seydor",
               "profile_path": null,
               "id": 25141,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.668412,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18133,
      "vote_count": 29,
      "budget": 0,
      "overview": "Several players from different backgrounds try to cope with the pressures of playing football at a major university. Each deals with the pressure differently, some turn to drinking, others to drugs, and some to studying.",
      "similar": [
         13416,
         9655,
         10637,
         22881,
         8923,
         9291,
         2300,
         323677,
         4942,
         10474,
         9563,
         2323,
         86130,
         12163,
         15070,
         1578,
         1374,
         45317,
         42888,
         8456
      ],
      "original_title": "The Program",
      "runtime": 112,
      "poster_path": "/htlXORTSRrJggKYsMMwIagGMXUG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1993-09-24",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "From Different Worlds They Come To Prove Themselves In The Gritty World of College Football.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David S. Ward"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "David S. Ward",
         "Aaron Latham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107889/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4OTczODY3N15BMl5BanBnXkFtZTcwMzQ1NjUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: James Caan, Halle Berry, Omar Epps | See full cast and crew »"],
      "reviews": [
         "Trips Bunch. The Power I. The Cover 2. If you know what these terms mean, and understand their uses in football strategy, then you'll really enjoy watching David S. Ward's the Program. Ward also wrote and directed Major League, a great movie; however, with The Program, it is obvious how much his sports writing style has evolved. The movie traces one season of college football for a once dominant, but now struggling Division 1 powerhouse, the fictional ESU Timeberwolves. James Caan is hilarious and well-cast as the Head Coach on the hot seat, and it's really great watching him deal with serious issues both on and off the field. Craig Shaeffer does a solid job at both his role and the QB position. His character is like a young, much more tortured Steve Young: he can throw the long ball, he can buy time with his feet, and he can do it all while battling inner demons. Omar Epps (the Wood) is simply perfectly cast as Darnell Jefferson, the prototype freshman Tailback fighting for his spot on the 1st team (plus the beautiful Halle Berry plays his love interest). The movie is filled with hilariously awesome lines and performances, and is a classic among people who actually play football. While the editing work could be scrutinized among movie Nazis (the editing job when Kane and his girl are riding his motorcycle is questionable at times), the good far outweighs the bad. Namely, the in-helmet camera work really puts you on the field with them. Overall, David S. Ward does an excellent job of jumping from perspective to perspective, and it quickly builds into this chaotic, early 90s mosaic of Division 1 college football. And surprisingly, the issues explored in the film really resonate with the issues going on in today's sports (i.e. Steroids, Motorcycle death wishes). Listen, if you haven't seen this movie, and you love football, and are of mild intelligence, then you are either really young or really lucky that you missed it because I wish i could watch it again for the first time. However, if you have no appreciation for the game of football, you're better off going elsewhere. Football idealists, be warned as well. This movie is the anti-Rudy. It's the story of one school's fight for a bowl bid, and fighting for that bid at all costs. PS- My vote is very biased. I love to quote this movie with friends. I love to watch football on both Saturday and Sunday. I play fantasy football. I play Madden. I played Division 3 football in college. You have been warned.",
         "OK, so this movie isn't a big Academy Award winner. OK, so it doesn't rank up there with Brian's Song or is as flashy and symbolic as Any Given Sunday. Maybe it doesn't have the attitude of The Last Boy Scout or North Dallas Forty; it lacks the comic appeal of Necessary Roughness. But you know what it does have that all of those above-mentioned films lack, a connection to any person that has ever stepped out on that field and experienced the pressures and bliss that comes with the nitty gritty game of football. I remember seeing this movie in the sixth grade and having never been into football that much, I didn't expect a lot. Yet,I walked away in awe at the sheer excitement experienced from this movie. This was an instant classic and even years later in my high school football days, the players were still talking about it. It is one of the best and most realistic football movies made. It puts you in the mindset of a big play maker like Jefferson or a back-breaking linebacker like Alvin Mack. It also has its human side displaying the pressures of trying to live up to expectations and coping anyway you know how. In Joe's case it's through a bottle. Lattimer sees enhancement drugs as the only way out...the film just takes you down to their level. Better yet, it's a college experience that you haven't experienced yet, or are trying to remember (it goes so fast!). After viewing this movie so many times every year when the college ball season starts, or even back in the day before two-a-days began; I can't help but to get excited and giddy from viewing it. My tape has worn out and I now own the DVD, I just wish they would add the deleted scenes. The Program will always be on my top ten list and that's why I give it a great rating.",
         "The Program may very well be the best film on college football ever done in that it shows its not quite the way it was when Pat O'Brien was playing Knute Rockne or even when Knute Rockne himself was coaching at Notre Dame. During the Nineties another classic film about professional football was done, Any Given Sunday. The main theme about Any Given Sunday was that sports was now more business than anything else. But pro football has always been a business. What The Program shows is just how much a business college football is, yet it maintains the fiction that this is amateur athletics. As is so eloquently put, no one is going to pay for a ticket to see a chemistry exam. Football with its ticket revenue, its alumni contributions, it's TV and radio rights, it's memorabilia rights is a very big business. It brings in money for the colleges, hence the colleges have a vested interest in a winning team. And some will do quite a bit more than others. James Caan does a fine job as the coach of mythical ESU who is a decent man caught up in the system. He operates his program straining the bounds of ethics. He knows full well that some of his kids are being greased right through college without an education, but football is his life and living and Caan operates the best he can. His players are a cross section of young America. Craig Sheffer is the very talented quarterback from a white trash background trying hard to rise above it. Omar Epps is the inner city ghetto kid who sees football as his ticket out. Andrew Bryniarski is the defensive player that steroids gave us, something Caan pretends not to notice until it really smacks him in the face. By the way Bryniarski was also in Any Given Sunday. My favorite in the entire film is Duane Davis who is another kid from the ghetto who both really loves the game, can barely read and write, and who also sees it as a way of rising from poverty. He's a nice kid, but a bad influence on Epps who he constantly tells that The Program will grease him through. Davis just lives for that National Football League contract. I do love the way Davis psyches himself before a scrimmage. You have to see the film to appreciate. Sad to say his is the saddest of all the stories here. You have to be made of stone to not be moved by seeing him at home, leg in a cast, listening to the final championship game with his mother, knowing the future he foresaw for himself is blasted to smithereens. Halle Berry and Kristy Swanson are there as love interests to both Epps and Sheffer respectively. There characters are quite a bit more than the usual air-headed cheerleaders cast in these parts. Another good performance is John Maynard Pennell as Sheffer's second string backup. He romances and talks Caan's daughter into taking an exam for him. When she's caught both are expelled. Caan personally kicks him out of the university and then has to swallow his pride and a good deal more to bring Pennell back when Sheffer has to go into rehab. That's also a classic scene. The Program is one of the finest, if not the finest film on college football ever done. I think more than sports fans will appreciate this finely crafted piece of cinema.",
         "The Program is an extremely pumped up look at college football and at individual players on a college team. Speaking from experience as a college player, most of the things in this movie are grossly exaggerrated (no teammates I played with ever wanted me to spit in their mouth). However, there are a few revealing moments in this movie that capture life on a college football program. Standard performances, directing and screenplay are adequate in this film, but its true enjoyment will be by those who have participated in organized football, especially college. A rating of 7 out of 10 was given.",
         "This is the best football movie ever made. It doesn't have all the clichés that normal football movies have where the starting quarterback gets the beautiful cheerleader and any certain game is won at the buzzer on some totally bizarre play. It's about the truth of what goes on in the college game. Sure, this stuff doesn't happen everywhere, but it certain frickin' happens. I'm talking about the steroids, the football players being allowed a free pass when it comes to academics, the fact that some people cannot even read but are able to go to college just to play a damn game. This movie shows it all. James Caan does a perfect job of playing the coach trying to keep it all together. Although he is corrupted just as much as his players, he had his own problems to worry about with losing his job so he had a big balancing act to perform. This movie was NOT about triumph, it's about tragedy and sacrifice that young men make just to be a top player in a sport which in the long run normally doesn't amount to anything. Great watch for you people who don't know much about the \"behind the scenes\" stuff and if you haven't seen this movie and are interested in college football, check it out. It's not necessarily a greatly acted movie, but it's a very telling movie which more people should pay attention to. 7 out of 10 in my book for what it's worth.",
         "The Program is a mostly solid movie that takes us into the world of college football, and more specifically into the world of one particular team as it tries to overcome obstacle after obstacle on it's way to a bowl game after a few disappointing seasons. First off I thought the football aspects were done very well. The action looked realistic and that is the least (and most) that I expect in a sports movie. And playing \"Welcome to the Jungle\" by Guns N' Roses during a football practice is surely worthy of some credit. All in all the game footage was pretty short, a few minutes at a time. What was more interesting, and what the film focuses on most, was what happened to the players between games as they dealt with their personal lives and game preparation. I'm guessing the movie was trying to shock us with this part. Steroid abuse by one player; alcohol abuse, a bar fight, and suicidal tendencies by another; cheating on an exam by yet another and his subsequent expulsion then reinstatement; girl problems with a couple players; etc. The movie has a lot to say and it's a good message, but I didn't find this shocking. Rather this sort of things is really common knowledge among sports fans, although how rampant these issues actually are in real life I can only guess. Having said that, this part of the film is done well for the most part. The one exception is the relationship stuff, which I just didn't find very believable due to a lack of chemistry between the participants. Addressing two of the criticisms that I have read others say about this film. Yes, it does tend to follow a lot of players and their respective issues, but I didn't feel that it spread itself too thin. I thought that despite this fact it did feel like we followed each player enough to get to know the issues he faced. The movie seemed to take a snapshot of one player and what he was dealing with, then quickly moved on to the next, and I thought in the context of this film it worked quite well. The second criticism I have read is that everything ends up working out well for everyone in the end and everyone comes out a better person. This just isn't true at all. **SPOILER ALERT** The defensive end (Alvin Mack I believe) busted up his knee and at the end of the movie it appeared that he would never play again. This was surely the most poignant moment in the film. Lattimer, the one with the steroid problem, was back on the juice and you get the feeling he won't ever lick this problem. Even Joe Kane will likely struggle with booze indefinitely. So I actually give this film a lot credit for not choosing the cliched ending where everyone ends up happy. **END OF SPOILER ALERT** 7/10 - for an overall solid effort",
         "This is a great football movie. Being a former college footballo player I can speak from experience of the pressures of the field and the perks you get off it. Craig Sheffer was outstanding as Joe Kane the star Quarterback dealing with demons, his demon was a big one alcohol. Kristy Swanson was great as Camile Joe's love interest. These two have excellent chemistry. Andrew Bryhanski roll as Lattimer was dead on. He played a steroid abuser perfectly. The best part of the movie is the last game when Latts makes the goal line play and The coach(played by James Caan) grabs him looks at him and they both know latts is back on the juice. All in all this is a outstanding movie and I would recommend it to anyone.",
         "OK ladies this movie, is about football. No its about the Program, yeah the program. I was scratching my head recently trying to remember this movie which i thought may have had Cuba Gooding JR in it about football. These two scenes kept playing out in my head, one was of a bunch of guys on the yellow line in the middle of a two lane street lying down head to foot while cars rushed by. The other was of this guy head-butting car windows. Well thats all i had to go on and after much scouring i found the movie the same place i always do. In a thrift store for a dollar! So i run home and toss it in waiting to see this part with the team on the ground in the street, and its not there. Apparently life imitates art and people who saw the original screening took to the streets and lay down in traffic. Some people died and plenty were hurt in a scarring prospect that left filmmakers to delete, and destroy the negative. I actually thought the movie was pretty good sides that and the head-butting scene is totally in tact. I wonder how many people head-butted cars after this? Or did steroids, this movie has an odd charm. I only played pop warner so i don't know if this is an accurate portrayal of college football, but really does it matter? were not exactly talking about portraying Jesus Christ here, its football and despite the name feet are mostly used just for running. Bunch of up and comers and well established actors and actresses in this one. Done well, it was worth the dollar, but in all honesty it was good. Seven thumbs.",
         "During the course of high school and college, we always come across numerous stereotypes. The 'jock' stereotype is possibly the most recognized. This movie transcended that and only focused on the brotherhood and comradery that arises from playing an organised sport. Not only did I enjoy this movie to a great extent I thought it to be both hilarious and dramatic. I believed the quality of acting in this film to have been superb, as well as the football scenes.",
         "No other football movie has made that remark more truthful than this one. I think this movie touches on an interesting topic but never probes any further. College football must have some dirty little secrets and this movie shows what a few might be. If they had put a little more emphasis on characters this would have been great. Although being a great football fan the action was pretty good anyway."
      ],
      "genres": [
         "Action",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Samuel Goldwyn Company, The",
         "Touchstone Pictures"
      ],
      "summaries": [
         "A college football coach is told by his bosses that unless they do better this season it could be his last. To bolster the team he recruits a talented wide receiver. A female student is assigned to help him assimilate with college life and that includes doing his studies because he spent his whole life just playing football. And he finds himself attracted to her and she already has a boyfriend who is also on the team but he might be more concern about losing his position than losing her to him. And the coach has to deal with his other players' situations like the team's quarterback who deals with his father being distant by drinking and it eventually gets him in trouble. And one of the team's defensive players is obviously using steroids but passes the drug tests.",
         "Several players from different backgrounds try to cope with the pressures of playing football at a major university. Each deals with the pressure differently, some turn to drinking, others to drugs, and some to studying."
      ],
      "budget": 0
   },
   "movielensId": 511,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-09-24",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["David S. Ward"],
      "runtime": 112,
      "movieId": 511,
      "title": "The Program",
      "mpaa": "R",
      "actors": [
         "James Caan",
         "Halle Berry",
         "Omar Epps",
         "Craig Sheffer",
         "Kristy Swanson",
         "Abraham Benrubi",
         "Duane Davis",
         "Jon Pennell",
         "Andrew Bryniarski",
         "Michael Flippo",
         "Ernest Dixon"
      ],
      "imdbMovieId": "0107889",
      "originalTitle": "The Program",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["MwRD6qCUV3Y"],
      "plotSummary": "Several players from different backgrounds try to cope with the pressures of playing football at a major university. Each deals with the pressure differently, some turn to drinking, others to drugs, and some to studying.",
      "tmdbMovieId": 18133,
      "avgRating": 3.14095,
      "releaseYear": "1993",
      "numRatings": 1724,
      "posterPath": "/htlXORTSRrJggKYsMMwIagGMXUG.jpg"
   }
}