{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "radio station",
            "id": 1224
         },
         {
            "name": "radio",
            "id": 2135
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "director",
            "id": 14530
         }
      ],
      "imdb_id": "tt0110939",
      "video": false,
      "title": "Radioland Murders",
      "recommendations": [
         83105,
         40000,
         77073,
         2648,
         20983,
         152586,
         41313,
         28134,
         27070,
         34600,
         38916,
         31556,
         63622,
         75013,
         156659,
         94583,
         47044,
         133319,
         37618,
         23305
      ],
      "backdrop_path": "/WGdU3U3yRla7XjTvBLkoUqC1wu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Roger Henderson",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fa1",
               "name": "Brian Benben",
               "profile_path": "/j0FSmUUpM6HtBUkbCO66Ifocqlt.jpg",
               "id": 84690,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Penny Henderson",
               "gender": 1,
               "credit_id": "52fe4447c3a368484e019fa5",
               "name": "Mary Stuart Masterson",
               "profile_path": "/jQLmmJWumj0MsxE2DjvMHbf5ysz.jpg",
               "id": 31140,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "General Walt Whalen",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fa9",
               "name": "Ned Beatty",
               "profile_path": "/aO5MtnqcZHpsVYz1nINdjqgEJUl.jpg",
               "id": 13726,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Milt Lackey",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fad",
               "name": "George Burns",
               "profile_path": "/4Uw1GXgr21eSMWDZiAQkIXg5axL.jpg",
               "id": 80625,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fb1",
               "name": "Scott Michael Campbell",
               "profile_path": "/kMHZLJUwa8QCaLsBEAdEj8UtMGL.jpg",
               "id": 65728,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Bernie King",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fb5",
               "name": "Brion James",
               "profile_path": "/4Vm3Zq6arXq3jyFfq3yJgH9Jj2l.jpg",
               "id": 591,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Lieutenant Cross",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fb9",
               "name": "Michael Lerner",
               "profile_path": "/7VlkzO1z5wh96UCXpPZ0rUFx8aN.jpg",
               "id": 4250,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Rick Rochester",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fbd",
               "name": "Michael McKean",
               "profile_path": "/iVcsvBb15nep7TZ07MlJFcxMzvD.jpg",
               "id": 21731,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Walt Whalen, Jr.",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fc1",
               "name": "Jeffrey Tambor",
               "profile_path": "/csB350am07xyRL5Ik1BWuSY12tH.jpg",
               "id": 4175,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Max Applewhite",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fc5",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Zoltan",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fc9",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Herman Katzenback",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fe5",
               "name": "Larry Miller",
               "profile_path": "/xA8zCxNrwtamLaLWNBkLyX5tGtU.jpg",
               "id": 1211,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Claudette Katsenback",
               "gender": 1,
               "credit_id": "52fe4447c3a368484e019fcd",
               "name": "Anita Morris",
               "profile_path": "/mfvWMh7Gz3zbt28Ho2kDtq7qEyX.jpg",
               "id": 159753,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Dexter Morris",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fd1",
               "name": "Corbin Bernsen",
               "profile_path": "/c9Y2SKgC3S6LJNq7WKcoauY88kg.jpg",
               "id": 21246,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe4447c3a368484e019fd5",
               "name": "Rosemary Clooney",
               "profile_path": "/xtyI9UlHmpn9tLZpVtUkPSilpj9.jpg",
               "id": 77674,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Wild Writer",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fd9",
               "name": "Bobcat Goldthwait",
               "profile_path": "/wYwGbSqEGAqpT4or8YHQ79ycoz4.jpg",
               "id": 95024,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fdd",
               "name": "Robert Walden",
               "profile_path": "/mHnGfHeA7wgC7McycPPqSlujJ87.jpg",
               "id": 13729,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Jasper",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019fe1",
               "name": "Dylan Baker",
               "profile_path": "/6r8DkPjWQDVe3Ak1peMeOHhtXqL.jpg",
               "id": 19152,
               "order": 17
            },
            {
               "cast_id": 26,
               "character": "Billy Barty",
               "gender": 2,
               "credit_id": "5947b35ac3a36816e403c94e",
               "name": "Billy Barty",
               "profile_path": "/h6Xf5csmdoIOUIFi8iRjtQMygQT.jpg",
               "id": 12659,
               "order": 18
            },
            {
               "cast_id": 27,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5947b368925141400d03dd2d",
               "name": "Billy Barty",
               "profile_path": "/h6Xf5csmdoIOUIFi8iRjtQMygQT.jpg",
               "id": 12659,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019f7f",
               "name": "Mel Smith",
               "profile_path": "/t9aojcL97IStdae9fP90D84NlSJ.jpg",
               "id": 141450,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019f85",
               "name": "George Lucas",
               "profile_path": "/8qxin8urtFE0NqaZNFWOuV537bH.jpg",
               "id": 1,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019f8b",
               "name": "Willard Huyck",
               "profile_path": null,
               "id": 686,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4447c3a368484e019f91",
               "name": "Gloria Katz",
               "profile_path": null,
               "id": 687,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019f97",
               "name": "Jeff Reno",
               "profile_path": null,
               "id": 4179,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e019f9d",
               "name": "Ron Osborn",
               "profile_path": null,
               "id": 4178,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.763848,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22588,
      "vote_count": 15,
      "budget": 0,
      "overview": "In 1939, WBN, a fourth radio network, is about to take to America's airwaves. As if the confusion of the premiere night wasn't enough, Penny Henderson, the owner's secretary, must deal with an unhappy sponsor, an overbearing boss and a soon-to-be ex-husband who desperately wants her back. As the broadcast begins, a mysterious voice breaks the broadcast and suddenly members of the cast turn up dead. It's up to her husband Roger, to find out whodunit as the police chase him through the halls of WBN.",
      "similar": [
         858,
         824,
         801,
         838,
         45269,
         2757,
         177699,
         9476,
         39939,
         2898,
         51828,
         381283,
         271718,
         1586,
         4995,
         51876,
         267192,
         12444,
         694,
         340666
      ],
      "original_title": "Radioland Murders",
      "runtime": 108,
      "poster_path": "/7OISTd5DyzQ6yW8UMGA2EfieG8u.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1994-10-21",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "At station WBN, the hits just keep on coming.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mel Smith"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "George Lucas",
         "Willard Huyck"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110939/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU3MzI5ODIzNV5BMl5BanBnXkFtZTcwNDY4MzMzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Brian Benben, Mary Stuart Masterson, Ned Beatty | See full cast and crew »"],
      "reviews": [
         "I am glad to say that I have this picture on video now, and it is still one of my favourite movies. I think the film brilliantly captures how a radio station (or a stage production even) can be controlled chaos at times. This film was unfairly maligned in my opinion. I like the murder mystery/comedy genre. At times, it can be badly done, but here it is very well-handled. Brian Benben, Mary Stuart Masterson and the squad of celebrities who cameo, handle their scenes very well. My only real complaint would be that Christopher Lloyd and Michael McKean have very little to do. But the plot twists and the resolution both pay off excellently and Mel Smith directs the piece with panache. There are also several great musical numbers thrown in as well. I give this film 8/10.",
         "Unfairly and almost universally trashed, this is a charming and atmospheric imagining of a hectic night in the life of a Chicago radio station whose ambition it is to go national. The sponsors are a tough sell, nothing is going as planned, and everything is pure chaos, compounded by a mounting tally of murder victims. \"Radioland Murders\" is one of the noisiest and busiest live-action movies I've seen, literally wall-to-wall in every frame with rapid-fire slapstick and pratfalls, and it does not quite work as a comedy, but even as a comedy, it's breezy and pleasant in the face of its frenzied pace -- not unlike an old Warner Bros. cartoon of the Merrie Melodies variety. Better, though, it works as a nostalgic notion of old-time radio. The staggering gaps in logic and plot are meant to be ignored, as this is fantasy; it embraces the idea of radio in its heyday as the missing link between paperback adventures and television, requiring the listener's imagination to do half the work, while television requires none of it. The movie amounts to what could likely be a 9-year old listener's visual projection of what he's hearing on the radio. It's technically dazzling, too, with the lens darting into rooms, out of windows and around the action becoming its own frenetic participant, and there's some breathtaking shots of the exterior of the station, often accentuating its height and distance from the city street far below. Brian Benben and Mary Stuart Masterson might strike the same one or two chords throughout the movie, but they're likable, as is this movie. And Scott Michael Campbell is very funny as Billy the pageboy, a kind of wide-eyed Quentin Tarantino of the radio age; fast-talking (everyone in the film is fast-talking, actually) and easily distracted (the look on his face as he accidentally barges into the ladies' dressing room and becomes mesmerized by the sight of the topless actresses is priceless), his entire grammar and understanding of life is derived from the radio shows of which he has encyclopedic knowledge. Finally, \"Radioland Murders\" closes with some wistfully ironic thoughts (the movie is mostly free of contemporary irony, with the exception of this and an unsuccessful line about warning labels on cigarette packs) about television (best summed up by three uniformed cops hypnotized by a cathode ray tube) and the immortality of radio. A movie more about myth than story, \"Radioland Murders\" is written in the scattershot style of the radio programs depicted. It might merely be a sanitized and moderate entertainment (particularly when viewed against something like \"The Hudsucker Proxy\"), but it's affectionate, features lively music, looks great, and is completely innocent.",
         "If you're looking for a serious mystery--or for that matter, a serious anything--don't watch this movie. If you just want a fun movie that you can watch again and again, this one is for you! It takes place in the studios of radio station WBN on the night of its national debut. The station managers, directors, writers, and actors, already stressed with the debut and pleasing the affiliates, are shocked when a trumpet player in the orchestra is poisoned and killed. The station crew then has to keep the programs going while the police investigate and the writers go on strike. After more murders are committed, writer Roger Henderson, the innocent prime suspect, has to simultaneously evade the police, rewrite scripts for shows about to air, and solve the crime to prove his innocence. There are some discrepancies and parts I'm sure critical people split hairs over. Don't expect a masterpiece, just some good fun.",
         "This is the all-time great overlooked flick! Filled to the brim with intricate timing, sight gags, 40's-style dialogue, radio in-jokes, ensemble acting, and great music, this movie had everything to love and nothing to hate! Most baffling to me, on finally seeing it on video was how people could not like it! I have yet to show it to a friend or relative who did not agree that this is an excellent movie! See it now! See it later! See it both! If you CAN laugh, if you like movies, if you liked the radio, if you breathe, you should like \"Radioland Murders!\"",
         "This film is a niche film, in that it IS a who-dunnit, but deeper than that, there seems to be a gap between modern audiences and the pre-television world of pop-culture radio. This, in part, accounts for some of the lack of popularity this film experienced. However... This film is intriguing in that it features some great performances, manic and frantic dialog indicative of the behind-the-scenes and on-the-air intonations of the age, and a slick style which elevates this work far above the rating it currently enjoys here at IMDb. The filming style is mesmerizing. The long shots of the outside of the radio building contributes to the feeling of isolation from the rest of the world, as the body count begins to accumulate. The sponsors just won't be sold on the station, everything which can go wrong is, and the station is dying to go into national syndication. All while the intrigue builds into suspense without generating the atmosphere of a thriller, which this is not. It was a difficult balance to maintain, but it never slips, never fails. I have no idea why this was universally thrashed. This was delightful! It rates an 8.9/10 from... the Fiend :.",
         "You can see what critics in 1994 were complaining about. You can get a headache from this movie. Gags are too snappy (too packaged), editing is too rapid (if someone trips over the shot is only just long enough to cover the actual tripping over - we don't see the crucial bit at the start where they don't trip over, or the bit at the end after they trip over), and there's not a single moment of still contemplation which would allow all the feverish activity to be as funny as it deserves to be. And while it's nice to see a film that doesn't milk its gags for more than they're worth, at least that would be a fault on the right side. Some of the comic ideas are just begging to be WALLOWED in. For example (I'm going to end up recommending this film, so if you don't want its best sight gag ruined, for God's sake skip the next paragraph)... One of the radio serials is about an aristocratic English explorer and his native jungle sidekick. We hear the former saying things like `What ho, I mean to say, steady on, old chap', while the latter is going, `Ooga booga - me mongo mongo man' - then we see that the African is being played by a dopey-looking white man, and the Englishman is being played by a black (in a tuxedo). It's a glorious moment. We realise what if their roles had been reversed they would BOTH have been demeaned ... as it is, they merely look like a couple of prize wallies. Unfortunately, that's IT. If we'd seen more of this radio play - and got to watch the bemused/assured/disgusted/bored expressions on the faces of the two voice actors - it would have continued to be funny; it would have got even funnier. But we cut to some other zany thing or other and the moment is lost. (To be fair, some throwaway gags - like the one involving the policemen and television - are true throwaway gags: snappiness suits them.) But it works, on the whole. There are plenty of good jokes, many of which have been weakened by the style of presentation, but by no means destroyed. The radio performances are amazingly polished and varied - you'd swear that Lucas sent talent scouts back in time to 1939. Sure, the film wants to be more than a highly entertaining comedy variety show (it's also trying for murder mystery, love story, nostalgic reverie, and social commentary), so it fails on its own terms, but it IS a highly entertaining comedy variety show, which is good enough.",
         "This is a wonderful, obscure film completely lacking subtlety which is why some people may hate it but exactly why I like it. The countless visual and verbal puns mean you can watch this film 20 times and never find them all. AND eventhough you KNOW what is coming next, you will still laugh at the punchlines. Great story movement, dialogue; every stereotype known to Hollywood and YET, every stereotype seems to get violated; its like stereotypes of stereotypes. The only weakness is the movie keeps interupting some great songs. One of my favorites. OK, so I don't have great tastes. Its still a really fun movie.",
         "Radioland Murders is one of the greatest comedy features I've ever seen! The gags are hilarious, the cast is absolutely brilliant, what can I say more? Just watch this movie and ENJOY :) Radioland Murders have unbelievable \"rhythmic\" vision, editing and plot line. I can't believe that Radioland Murders is so underestimate movie?!? I was very happy and proud when I've found it on Amazon on a unreasonable low price? Whatever, Radioland Murders is one of my 'all time favourites' and I recommend it to everyone who love great comedy movies. And it's not just comedy. It's a unique masterpiece depicts the daily ground of early radiostations.",
         "This movie takes us back 70 years ago at the City of Chicago, where station WBN hosts the variety of many radio programs. Unfortunately, it's also the place of interest where six murders are committed. Brian Benben stars as hapless writer Roger Henderson, who tries to solve the murders of stool-pigeon trumpet player Ruffles Reedy(Jack Sheldon), Toupee wearing Director Walt Whalen Jr.(Jeffery Tambor), Bossy Stage Manager Herman Katzenback(Larry Miller), Sleazy Radio Announcer Dexter Morris(Corbin Bernsen), humorless sponsor Bernie King(Brion James), and WBN Head Man General Walt Whalen(Ned Beatty). Accused of being the killer by Short-Tempered Lt. Cross(Michael Lerner), he, along with bell boy Billy(Scott M. Campbell) and his wife Penny Henderson(Mary S. Masterson), must find out who committed the murders and why. It features appearances by well-known comedian George Burns as the 100-year-experienced radio comedian Milt Lackey, Anita Morris' last appearance as the Va-Va-Va-Voom Girl with the Va-Va-Va-Voom voice Claudette Katzenback, Christopher Lloyd as the sound effects man Zoltan, and Peter MacNicol(who is known for his starring role in the Mr. Bean Movie) as the son of one of the writers. To find out who the killer really is... You'll have to watch the movie. This movie is a nostalgia of classic radio and mystery with a dash of LOL. I guarantee you'll like this movie! 1000/1000",
         "The year was 1939 and America was in the flux of world wide change. Hitler was in Germany, Roosevelt was in the White House and a New Radio station was inaugurating it's first night on the air-waves. There are a hundred things which could go wrong and after watching this film for just a few minutes, the audience will indeed come to that conclusion. In the mist of growing chaos, personal problems also are thrown in the mix. Mr. Roger Henderson, (Brian Benben) in trying to win back his wife Penny (Mary Masterson) who threatens him with divorce. At the same time, the radio station employees are confronted with murder as several top executives are found dead. Several key characters add to the general mayhem such as General Whalen (Ned Beatty), Billy The Gopher, (Scott Campbell) Michael Lerner (Michael Cross) Zolttan (Christopher Lloyd) Herman Katsenback (Larry Miller), Billy Barty, Bobcat Goldthwait and Robert Walden. Director Mel Smith and writer George Lucas even threw in the Late George Burns. The station is flooded with everything from on stage Key-stone slap-stick, pratfalls, sight gags, verbal innuendos and hilarious vaudeville entertainment. The center of the story are the mysterious murders which are complex and interesting. All in all, the movie is wondrously exciting and musically entertaining. A fun visit to a far-away place where imagination of voice could transport you to anytime and place. Offered to anyone seeking a slice of radio memorabilia. ****"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Musical",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Lucasfilm"
      ],
      "summaries": [
         "In 1939, WBN, a fourth radio network, is about to take to America's airwaves. As if the confusion of the premiere night wasn't enough, Penny Henderson, the owner's secretary, must deal with an unhappy sponsor, an overbearing boss and a soon-to-be ex-husband who desperately wants her back. As the broadcast begins, a mysterious voice breaks the broadcast and suddenly members of the cast turn up dead. It's up to her husband Roger, to find out whodunit as the police chase him through the halls of WBN.",
         "On one fateful evening in 1939, WBN, a fourth radio network, is making its nationwide debut--and is engulfed in chaos. Penny Henderson, the station owner's secretary, has her hands full coping with a disgruntled sponsor, a tyrannical boss, an incompetent director, temperamental stars, unpaid writers on the verge of mutiny and, worst of all, her soon-to-be ex-husband Roger, who's determined to win Penny back. As the curtain rises on the opening act, a mysterious voice interrupts the program and menacing events begin to unfold--leading the WBN team to realize that dead air is the least of their worries! As cast members turn up dead, it is up to Roger to find out whodunnit as the police chase him through the halls of WBN."
      ],
      "budget": 0
   },
   "movielensId": 513,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-21",
      "dvdReleaseDate": "2006-08-22",
      "directors": ["Mel Smith"],
      "runtime": 108,
      "movieId": 513,
      "title": "Radioland Murders",
      "mpaa": "PG",
      "actors": [
         "Brian Benben",
         "Mary Stuart Masterson",
         "Ned Beatty",
         "George Burns",
         "Scott Michael Campbell",
         "Brion James",
         "Michael Lerner",
         "Michael McKean",
         "Jeffrey Tambor",
         "Stephen Tobolowsky",
         "Christopher Lloyd",
         "Larry Miller",
         "Anita Morris",
         "Corbin Bernsen",
         "Rosemary Clooney",
         "Bobcat Goldthwait",
         "Robert Walden",
         "Dylan Baker",
         "Billy Barty",
         "Billy Barty"
      ],
      "imdbMovieId": "0110939",
      "originalTitle": "Radioland Murders",
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Music",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": ["lgJUIRe6hYE"],
      "plotSummary": "In 1939, WBN, a fourth radio network, is about to take to America's airwaves. As if the confusion of the premiere night wasn't enough, Penny Henderson, the owner's secretary, must deal with an unhappy sponsor, an overbearing boss and a soon-to-be ex-husband who desperately wants her back. As the broadcast begins, a mysterious voice breaks the broadcast and suddenly members of the cast turn up dead. It's up to her husband Roger, to find out whodunit as the police chase him through the halls of WBN.",
      "tmdbMovieId": 22588,
      "avgRating": 2.94942,
      "releaseYear": "1994",
      "numRatings": 603,
      "posterPath": "/7OISTd5DyzQ6yW8UMGA2EfieG8u.jpg"
   }
}