{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "vietnam veteran",
            "id": 422
         },
         {
            "name": "commercial",
            "id": 1004
         },
         {
            "name": "advertising expert",
            "id": 5920
         },
         {
            "name": "kaserne",
            "id": 8066
         },
         {
            "name": "stau",
            "id": 9479
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "unemployment",
            "id": 156052
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "teachers and students",
            "id": 193547
         }
      ],
      "imdb_id": "tt0110971",
      "video": false,
      "title": "Renaissance Man",
      "recommendations": [
         10407,
         9099,
         6463,
         12280,
         6723,
         10859,
         11384,
         11566,
         16384,
         22317,
         10694,
         26261,
         10411,
         9440,
         2620,
         24073,
         10467,
         71142,
         10896,
         9941
      ],
      "backdrop_path": "/lnDE9cLfBAO4B04ZVsExbNeIBp2.jpg",
      "revenue": 24332324,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bill Rago",
               "gender": 2,
               "credit_id": "52fe44949251416c75039ce7",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Pvt. Tommy Lee Haywood",
               "gender": 2,
               "credit_id": "52fe44949251416c75039d27",
               "name": "Mark Wahlberg",
               "profile_path": "/z2wJh5n7qZRUE1y9uB8UrivAV2b.jpg",
               "id": 13240,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sergeant Cass",
               "gender": 2,
               "credit_id": "52fe44949251416c75039ceb",
               "name": "Gregory Hines",
               "profile_path": "/rvvQWFQGeGR14WFVNe0Qg1J7uVY.jpg",
               "id": 66804,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Captain Tom Murdoch",
               "gender": 2,
               "credit_id": "52fe44949251416c75039cef",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Jack Markin",
               "gender": 2,
               "credit_id": "52fe44949251416c75039cf3",
               "name": "Ed Begley Jr.",
               "profile_path": "/au4qlxxeHitgPDHmt7WhWTA7Znb.jpg",
               "id": 42157,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Soldat Donnie Benitez",
               "gender": 2,
               "credit_id": "52fe44949251416c75039d1b",
               "name": "Lillo Brancato",
               "profile_path": "/zdSXmg2uNARHmA75YvUUJwwLGGK.jpg",
               "id": 17917,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Soldat Miranda Myers",
               "gender": 1,
               "credit_id": "52fe44949251416c75039d1f",
               "name": "Stacey Dash",
               "profile_path": "/1YZ5qh5Bq1lfozK5ZYpatOAcui1.jpg",
               "id": 58150,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Soldat Jamaal Montgomery",
               "gender": 2,
               "credit_id": "52fe44949251416c75039d23",
               "name": "Kadeem Hardison",
               "profile_path": "/aCuoYn6GdVqZyy35JmqaY6TS9bO.jpg",
               "id": 66554,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Colonel James",
               "gender": 0,
               "credit_id": "52fe44949251416c75039d2b",
               "name": "Cliff Robertson",
               "profile_path": "/q8DvYrkVZ6GajgU2V771Y0dOGWy.jpg",
               "id": 19153,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Pvt. Jackson Leroy",
               "gender": 2,
               "credit_id": "52fe44949251416c75039d2f",
               "name": "Richard T. Jones",
               "profile_path": "/ccELAB9yHvG4OxG8dURdUXznwJ8.jpg",
               "id": 55755,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Pvt. Roosevelt Nathaniel Hobbs",
               "gender": 2,
               "credit_id": "52fe44949251416c75039d33",
               "name": "Khalil Kain",
               "profile_path": "/cg21H1qo8VvLpABRbdVrQZpFArc.jpg",
               "id": 79538,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Pvt. Melvin",
               "gender": 2,
               "credit_id": "5974f8f4c3a3685e0101b439",
               "name": "Gregory Sporleder",
               "profile_path": "/xkgNtF5JZE56vhE22fA6lG7cwWD.jpg",
               "id": 10000,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44949251416c75039cf9",
               "name": "Penny Marshall",
               "profile_path": "/uNL3L08uZWuRJF542IAUR0VNXfz.jpg",
               "id": 14911,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44949251416c75039cff",
               "name": "Jim Burnstein",
               "profile_path": null,
               "id": 66258,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44949251416c75039d05",
               "name": "Robert Greenhut",
               "profile_path": null,
               "id": 3658,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44949251416c75039d0b",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44949251416c75039d11",
               "name": "Adam Greenberg",
               "profile_path": "/te3aqArBCPkza8DeJpDx0Rncen8.jpg",
               "id": 2723,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44949251416c75039d17",
               "name": "George Bowers",
               "profile_path": null,
               "id": 11454,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 7.968607,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11858,
      "vote_count": 104,
      "budget": 40000000,
      "overview": "Danny DeVito plays an advertising man who is slowly sliding downhill. When he is fired from his job in Detroit, he signs up for unemployment. One day they find him a job; Teaching thinking skills to Army recruits. He arrives on base to find that there is no structure set up for the class.",
      "similar": [
         12162,
         1369,
         112160,
         858,
         13,
         634,
         437557,
         345009,
         43923,
         141,
         153,
         297762,
         242224,
         8457,
         2771,
         10590,
         10735,
         5781,
         36208,
         157360
      ],
      "original_title": "Renaissance Man",
      "runtime": 128,
      "poster_path": "/uaiykEOEFs91WclowDhsVYNdGfX.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cinergi Pictures Entertainment",
            "id": 1504,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1994-06-03",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "One Man's Mission To Teach The Few, The Proud... The Impossible!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Penny Marshall"],
      "runtime": 128,
      "synopsis": null,
      "writers": ["Jim Burnstein"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110971/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MDI4MzM4M15BMl5BanBnXkFtZTcwMTE2MTIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny DeVito, Gregory Hines, James Remar | See full cast and crew »"],
      "reviews": [
         "Renaissance Man is directed by Penny Marshall and stars Danny DeVito, Gregory Hines, James Remar, Mark Wahlberg, Stacey Dash and Kadeem Hardison. Hans Zimmer scores the film and it's written by Jim Burnstein. The story sees DeVito as Bill Rago, a divorced advertising executive who loses his job and finds himself unemployed. Not only that, but the relationship with his daughter has started to feel the financial strain. However, the unemployment agency find him a short time position at U.S. Army training base, Fort McClane. The position entails him to teach basic comprehension to a class of academic under achievers. Initially he's not enthused by the job, nor are the class particularly responsive to his civilian status. But just maybe this odd coupling may turn out to be good for both parties? That is if Drill Sergeant Cass (Hines) lets them that is? A box office flop that was first marketed as a comedy, then as a drama {it's very much both}, Renaissance Man holds no surprises what so ever. The formula remains the same as every other piece featuring a teacher and an unruly/troubled/under educated class. So with that in mind, and considering the film has largely been kicked by the professional critics, I'm not here to sell this movie to anyone, because sometimes you have to acknowledge that a film can hit a spot of your own personal psyche, yet at the same time be a million miles away from someone else's. The choices we make dictate the life we lead For me personally, Renaissance Man is one such film. It was one dark rainy night back in the mid 90s and I had the blues, I popped over to the video store to see what was available, I couldn't find anything that remotely sounded like something to lift me out of the stupor I was in. I then spied a copy of Renaissance Man, a film I hadn't heard anything about, and although I took that as a bad sign, Danny DeVito's beaming smile on the cover of the box lured me in. I was thinking how much I had enjoyed him in Twins at the back end of 1988, so to me it didn't seem such a bad gamble to take. I was expecting a comedy and I got one, but the bonus was that what I also got was a very uplifting dramatic tale about the human condition, people learning from each other, a tale that shows the power of artistry and how it can unite and lift people. A tale that shows that maybe some folk aren't as clever as others, but if they can grasp a straw and be all that they can be, then their heads will be well and truly held up high. Renaissance Man, I believe, is a sadly undervalued film on this, or any other film related site. But that's just me, because hey! We all got different psyche's right. Right? 8/10",
         "This is a feel good movie, not very deep BUT well conceived, written and acted. DeVito is excellent as a failing marketing man being transformed into a thoughtful, caring army educator. As important is the film's excellent presentation and discussion of the works of Shakespeare. No surprise, DeVito's self centered abrasiveness meets with antipathy. Army officers don't care. Convinced of their own worthlessness, DeVito's students are disinterested, at best. During the semester, DeVito, mellows, students learn enough to advance,and Army brass begins to appreciates the new teacher. The best part of this film is not DeVito's or the student's redemption but the film's beguiling Shakespeare presentation. DeVito teaches the Bard with passion. The writers deliver illuminating, focused student dialog. As one who didn't \"get\" Shakespeare until seeing MacBeth a year after graduation. This movie was a better class than anything I took in high school or college. Enjoy the film and the class.",
         "What a polarity of opinions on this one! It's either love it or hate it time. Put me definitely in the camp of this movie's admirers and supporters. I noticed that many of this film's fans were from all over: Texas, Canada, Scotland, Brooklyn, Australia, and Paris! Many noticed the similarity to Dead Poets Society as did I. Other movies it could be compared to are Mr. Holland's Opus and Konrack, and the more recent French film, The Chorus, movies in which other teachers too are celebrated for enriching the lives and spirits of their students. I think your Parisian correspondent sums it up the best: to see fine art working its way into the psyches of those previously unaware of it and to see people growing in spirit as a result of their exposure to and interactivity with it: that's what makes this story such a treat and an inspiration. It's what makes being a teacher worthwhile and justified. It moved and touched me. I had a personal connection to this movie's plot line as well: I knew a teacher who used to go into inner city schools and also taught the kids Shakespeare, especially the old-fashioned swear words the author used in the plays! Quite successfully too. Also, I grew up in Detroit so I appreciated the opening of the film set on familiar streets of the Motor City. A beautiful and touching film. None of the film's critics or supporters commented on the plot line in which the teacher recovered the true history of his recruit's father's unrecognized heroism. That was beautiful too. Go see this film and be inspired.",
         "Army recruits categorized as, shall we say, neither the best nor brightest, but they somehow get turned on when reluctant teacher DeVito reads Shakespeare's Hamlet to them and it hits a chord. The high point of the film is reached when one of those recites on command his \"irrelevant\" Shakespeare on a rainy night's drill to Sergeant Gregory Hines and finds in his memory from \"Henry V\" (with lead-in not at hand) \"We few, we happy few, we band of brothers. For he today that sheds his blood with me, Shall be my brother.\" This is a truly nice movie, about heroes but not about touting war. At a later point, my usually stoic wife shed some tears. Danny De Vito is surprising to me. He generally leaps over my expectations, no matter how far I raise them up.",
         "This film is about educating the most unlikely people so that they will be able to appreciate beauty of the classical works. For me, it's very moving because enjoying good works of art are fully part of enjoying life. Besides, the film is well done and funny. And last but not least, education is properly shown as a two-way process: the teacher will learn a lot from his students during the very time he teaches them. In summary, I loved the story and sent everyone I met to see it. And most of them were happy too.",
         "Let me start off by saying that this movie is miss-marketed as a comedy. As a comedy, this movie is, at best, mediocre. Sure, there are some funny moments, but it isn't nearly as hilarious as it claims to be. However, what this movie lacks in comedy, it makes up for with it's other qualities. This is a warm, fuzzy, feel-good movie with a lot of wisdom in it. The character development is excellent and we really get to like the characters. The bond between DeVito and his students is strong. This movie is very touching, with a few funny moments in-between. Sure, there are some corny scenes (the rap scene) but hey, every teacher has their own way of making their students understand their material, right? I would recommend this movie, although not as a comedy.",
         "The older I get the more I realize how this movie is a little cheesy, But if you really like a feel good movie you can't go wrong with this one. Danny Devito did a wonderful job playing a teacher in the army.(a job he didn't ask for and is not looking forward to)He is brought in to teach these kids that everyone thinks are stupid. Every one of the characters left an impression in my mind. They all did a wonderful job at playing their roles.Each one of the student's are different and everyone knows someone in real life like each one of them. It is a little like dead poet's society but with more comedy and a more \"happy good feeling\" I am always in a GREAT mood at the end of this movie!",
         "One of the most moving experiences in cinema I had during the Nineties was watching Renaissance Man. It's more than a comedy about underachievers realizing their potential. It's about the man who makes them realize their worth as human beings getting quite an education about life himself. Danny DeVito is that man in a role about as far removed as you can get from Louis DePalma in Taxi and Lawrence Garfield in Other People's Money. He's an advertising man who loses a couple of big clients while getting stuck in traffic and gets bounced from his job. Needing an income while looking for a job, the Michigan Unemployment Department gives him an interesting job, a civilian remedial education teacher for the United States Army. He's assigned to a class of eight trainees who might wash out if they don't shape up. It's their mental attitudes that need adjusting. A little trial and error and DeVito hits upon the idea to use Shakespeare, specifically Hamlet as a teaching tool. Interpreting and learning life's lesson from one of the greatest works of literature in the English language apparently works and in ways far beyond making these trainees get through basic training. This is my favorite film with Danny DeVito and he's not an easy fit into army life. Cliff Robertson, James Remar, and Gregory Hines are some of the army people he deals with. But the eight trainees are the heart of the film. Mark Wahlberg, Lillo Brancato, Kadeem Hardison, Richard Jones, Khalil Kain, Gregory Sporleto, Stacey Dash are seven of them. One of them doesn't make it through and ironically because of an act of kindness. But my favorite in the film is Peter Simmons who plays Private Brian Davis from Grand Forks, North Dakota. It's young men like him and his father before him in Vietnam who was killed in action who keep this country safe and secure. He gets the best recognition possible at the end of the film and you are guaranteed not to have a dry eye when you see it. Renaissance Man is a beautifully crafted film from Penny Marshall and should not be missed when broadcast.",
         "I love this movie. I first saw it when I was about eight, and it inspired me to read Shakespeare. Of course, because of my age, I was unable to understand HAMLET, but I thought I would just mention it. This movie is a great portrayl of how a formerly selfish man changed himself and his students through Shakespeare. This movie is deep, but it's also very funny and entertaining. There are some great, brilliant moments in here, especially when DeVito says, \"All I know is, the choices you make dictate the life you lead. To thine own self be true. \" There is also an excellent scene where one of the students recites Shakespeare for Hines, the drill sergeant. This is a fantastic movie that I absolutely loved, as did my English teacher. I highly recommend it. Of course, if you only find Bruce Willis movies entertaining, this movie is not for you.",
         "This film is a very nice one. There are a few reasons for that. Danny de Vito (playing Bill Rago) is great and plays his role very enthusiast. De Vito's best scene is the one where he is in the office where he's going for a job. He totally does NOT want to be there because he's ashamed of being there. When he gets a teaching job offered, the look on his face,when he finds out he is supposed to teach soldiers in the army, is marvelous. All the other actors are playing (very) good, especially Gregory Hines as drill-instructor who wants Bill Rago gone. The few scenes Hines and De Vito share together are no less than hilarious, that's for sure. The story is not as strong as the (sometimes) brilliant acting from the whole cast. To be honest, the story of Jim Burnstein is predictable and boring. Not only is the ending something you know 30 minutes before it's there, also the most important lines of the story are predictable and because of that boring. I can't spoil the movie, but let me tell you: For this film, Jim Burnstein wanted all happy things and endings, even when it's not appropriate. If you have read Willliam Shakespeare's 'Hamlet' (a brilliant book, if I may say so) you'll enjoy this film a lot more. If you like this motion picture you should also see 'Dead Poets Society' with Robin Williams."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cinergi Pictures Entertainment",
         "Parkway Productions",
         "Touchstone Pictures"
      ],
      "summaries": ["A down-on-his-luck businessman desperately takes the only job offered - a teacher in the U.S. Army. His mission: keep a ragtag bunch of underachieving misfits from flunking out of basic training! Be on alert as this unlikely new teacher and his underdog class unexpectedly inspire each other to be all they can be!"],
      "budget": 40000000
   },
   "movielensId": 516,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1994-06-03",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Penny Marshall"],
      "runtime": 128,
      "movieId": 516,
      "title": "Renaissance Man",
      "mpaa": "PG-13",
      "actors": [
         "Danny DeVito",
         "Mark Wahlberg",
         "Gregory Hines",
         "James Remar",
         "Ed Begley Jr.",
         "Lillo Brancato",
         "Stacey Dash",
         "Kadeem Hardison",
         "Cliff Robertson",
         "Richard T. Jones",
         "Khalil Kain",
         "Gregory Sporleder"
      ],
      "imdbMovieId": "0110971",
      "originalTitle": "Renaissance Man",
      "genres": [
         "Comedy",
         "War"
      ],
      "youtubeTrailerIds": ["axB27AE4FkA"],
      "plotSummary": "Danny DeVito plays an advertising man who is slowly sliding downhill. When he is fired from his job in Detroit, he signs up for unemployment. One day they find him a job; Teaching thinking skills to Army recruits. He arrives on base to find that there is no structure set up for the class.",
      "tmdbMovieId": 11858,
      "avgRating": 3.08454,
      "releaseYear": "1994",
      "numRatings": 3578,
      "posterPath": "/uaiykEOEFs91WclowDhsVYNdGfX.jpg"
   }
}