{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "sanatorium",
            "id": 3179
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "historical figure",
            "id": 6165
         },
         {
            "name": "cornflakes",
            "id": 8890
         }
      ],
      "imdb_id": "tt0111001",
      "video": false,
      "title": "The Road to Wellville",
      "recommendations": [
         26261,
         12772,
         46270,
         56821,
         60276,
         18414,
         18966,
         54613,
         53417,
         9440,
         21512,
         46061,
         20242,
         23303,
         12774,
         10831,
         2144,
         6463,
         11465,
         37019
      ],
      "backdrop_path": "/ZgvMwfWNkAJKvunnis1NVRYlzX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. John Harvey Kellogg",
               "gender": 2,
               "credit_id": "52fe43759251416c75011309",
               "name": "Anthony Hopkins",
               "profile_path": "/btweZvSRBiE6jaMME93BSXeTQN6.jpg",
               "id": 4173,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eleanor Lightbody",
               "gender": 1,
               "credit_id": "52fe43759251416c7501130d",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "William Lightbody",
               "gender": 2,
               "credit_id": "52fe43759251416c75011311",
               "name": "Matthew Broderick",
               "profile_path": "/j9ETatVKFxYR5Ijk8l5tzKO4HPn.jpg",
               "id": 4756,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Charles Ossining",
               "gender": 2,
               "credit_id": "52fe43759251416c75011315",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "George Kellogg",
               "gender": 2,
               "credit_id": "52fe43759251416c75011319",
               "name": "Dana Carvey",
               "profile_path": "/1SyPT9N3J3NAycz89JmSmPd2xZ7.jpg",
               "id": 56159,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dr. Lionel Badger",
               "gender": 2,
               "credit_id": "52fe43759251416c7501131d",
               "name": "Colm Meaney",
               "profile_path": "/irPAowqDk7llCvm8uyCJuBClzJw.jpg",
               "id": 17782,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Ida Muntz",
               "gender": 1,
               "credit_id": "52fe43759251416c75011321",
               "name": "Lara Flynn Boyle",
               "profile_path": "/wAVWGJefzTgXWgop58H1ttHS5H6.jpg",
               "id": 6684,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Endymion Hart-Jones",
               "gender": 2,
               "credit_id": "52fe43759251416c75011367",
               "name": "John Neville",
               "profile_path": "/b6s37ak6b0ikhpVk6XVG56QWVqp.jpg",
               "id": 12642,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Nurse Irene Graves",
               "gender": 1,
               "credit_id": "58497ad6c3a3681428012224",
               "name": "Traci Lind",
               "profile_path": "/miY35kDAwcTdp2uKYmPEtbhQwUt.jpg",
               "id": 64062,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Virginia Cranehill",
               "gender": 1,
               "credit_id": "5a4990d4c3a36805f6006f00",
               "name": "Camryn Manheim",
               "profile_path": "/baUSk3l2bcmxGvIpifFAyHq2v28.jpg",
               "id": 20187,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011327",
               "name": "Alan Parker",
               "profile_path": "/vABD5OnVL9TcuxLHae6EOTDfWiW.jpg",
               "id": 9168,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43759251416c7501132d",
               "name": "T. Coraghessan Boyle",
               "profile_path": null,
               "id": 65381,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011333",
               "name": "Alan Parker",
               "profile_path": "/vABD5OnVL9TcuxLHae6EOTDfWiW.jpg",
               "id": 9168,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011339",
               "name": "Marc Abraham",
               "profile_path": "/cpj3Rg8jmHPfqZxRaW2B36R5D91.jpg",
               "id": 15219,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c7501133f",
               "name": "Armyan Bernstein",
               "profile_path": null,
               "id": 41587,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011345",
               "name": "Robert F. Colesberry",
               "profile_path": null,
               "id": 1994,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c7501134b",
               "name": "Alan Parker",
               "profile_path": "/vABD5OnVL9TcuxLHae6EOTDfWiW.jpg",
               "id": 9168,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011351",
               "name": "Tom Rosenberg",
               "profile_path": null,
               "id": 68602,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43759251416c75011357",
               "name": "Rachel Portman",
               "profile_path": "/AkMflxC3EkbWuyPoltQ406EJvue.jpg",
               "id": 3562,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c7501135d",
               "name": "Gerry Hambling",
               "profile_path": null,
               "id": 9163,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43759251416c75011363",
               "name": "Peter Biziou",
               "profile_path": null,
               "id": 10717,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.554903,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10467,
      "vote_count": 53,
      "budget": 0,
      "overview": "An unhappy young couple visit the infamous Kellogg spa in Battle Creek, Michigan while a young hustler tries get into the breakfast-cereal business and compete against John Kellogg's corn flakes.",
      "similar": [
         872,
         533,
         9472,
         11631,
         585,
         812,
         10882,
         15121,
         824,
         703,
         134,
         3933,
         11224,
         15969,
         18947,
         19404,
         41233,
         46195,
         254470,
         55721
      ],
      "original_title": "The Road to Wellville",
      "runtime": 118,
      "poster_path": "/zh7OVdFMpqpZ027z9RgVIwzxYjZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Beacon Pictures",
            "id": 10157,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-10-28",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "A comedy of the heart and other organs.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alan Parker"],
      "runtime": 118,
      "synopsis": "Matthew Brodericks uptight Edwardian newlywed visits a new age health farm run by crackpot doc Anthony Hopkins. Scatologically-obsessed satire from director Alan Parker.",
      "writers": [
         "T. Coraghessan Boyle",
         "Alan Parker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111001/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0MDc4NTY5N15BMl5BanBnXkFtZTcwMzU1NTYyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Anthony Hopkins, Bridget Fonda, Matthew Broderick | See full cast and crew »"],
      "reviews": [
         "I just can't believe the comments I read here. Pure crap? Come on! One of the worst films ever? Pah! This film is good, well written, well directed, and really funny. What else can I say? It seems like whenever a film with real humour is made by a well-known director, it's viewed as bullsh...! While plain stupid comedies (Pretty Woman etc..) are praised by many, elegant and clever ones like \"Road to Welville\" are considered as crap... I just can't believe it. I feel saddened that such a good work is being flamed. Maybe it's because it didn't reach its public... Or that the whole purpose of the film is being missed by the majority of the public... Or that people think Parker should only make serious movies... I don't know. It's not the first time I'm so deeply amazed by the way a film is perceived by others, but gee...",
         "I can't believe some of the reviews I've read on this site about The Road to Wellville. Some people complain that it was crude and disgusting, others complain that it didn't have a coherent plot, and still others whine that it wasn't historically accurate (concerning Dr. Kellogg's methods). Those reviewers clearly missed the boat. As for those who thought the movie was crude and disgusting, what did you expect from a comedy set in a turn-of-the-century health sanitorium run by a well meaning but eccentric doctor? Such a movie is bound to contain scenes of patients vomiting, getting enemas, and having a sexual tryst or two, just as undoubtedly occurred in many health sanitoriums at that time. Furthermore, none of those scenes were graphic, so I don't understand anybody being offended by them. As for complaints that the movie didn't have a coherent plot, it didn't need one. It was a comedy, not a drama! The health sanitorium setting was a perfect vehicle for satirizing turn-of-the-century attitudes about health, and it was the dialogue and comedic situations that held the movie together and kept it moving, not its plot. Finally, for those who complain that the movie wasn't historically accurate about Dr. Kellogg's actual methods (such as his character's use of electric-powered machines for health therapy), the movie was a comedy, not a biography! It was meant to elicit laughs, and in that respect it was a smashing success. I haven't laughed so much during a movie in a long time. Some people should take Sargeant Hulka's (\"Stripes\") advice and \"lighten up.\" Good comedy is not dependent on plot or historical accuracy to be entertaining; all that matters is that it's funny, and Wellville was one of the funniest comedies I've ever seen.",
         "When I saw this movie years ago in the theater, I hated it. I just watched it again (2002) and loved it. It has several laugh out loud jokes and is a running smirk movie. If you've ever had any experience with alternative meds - you'll love it to. It is so self effacing it is wonderful. Don't expect The Godfather cinema type and you won't be disappointed. It is wonderful to see Hopkins & Broderick playing it straight. Kudos.",
         "Not having seen this film before, it came as a total surprise the other night when it was shown on cable. Alan Parker, the director, has adapted the T. Coraghessan Boyle's book into a hilarious comedy that evidently, judging from some of the comments to this forum, is not a crowd pleaser, yet, the film rewards those with an open mind to enjoy this hysterical take of a mad scientist, a spa, and the people that tend to patronize those places. The story about the use of cereals, championed by Dr. John Henry Kellogg, is the basis of the story. This revolutionary doctor's methods were amazing in the way they were applied to patients going for the cure of their bad stomachs caused by the prevailing eating habits of the time. This farce is great fun because of the cast assembled for the movie. Anthony Hopkins plays the mad Dr. Kellogg with glasses and false teeth that distort his face. We have to look hard into this mad man to realize the transformation Mr. Hopkins achieves with his character. John Cusack, as the enterprising Charles Ossining, travels to Battle Creek, Michigan in search of riches, trying to capitalize on the cereal craze. He finds a partner in the devious Bender, played with great panache by Michael Lerner, one of the best character actors in the American cinema. As the patrons of the spa, we encounter a young couple, the Lightbodies that go for a treatment. Briget Fonda and Matthew Broderick play the Lightbodies, a pair that is separated at their arrival and who encounter satisfaction in more ways than one, as they discover their sexuality. Lara Flynn Boyle, Camryn Manheim, Traci Lind, John Neville, Dana Carvey, Colm Meany and Jacob Reynolds are all good in their small roles. This film, with its different kind of humor, will make anyone laugh.",
         "After seeing a part of the movie for the tenth time or so (this one seems to be playing a lot on one of the satellite movie channels), I figured it was high time to give it a rating. I was very surprised and disappointed to see that it rated so low overall, as I've always enjoyed the movie (over and over again!). I'm beginning to think that the general movie-viewing public has become too generic in their tastes, and don't have an appreciation for throwback oddball comedies such as The Road to Wellville. If that's so, it's a real shame! Ah well, to each their own! As for me, I love the movie's offbeat and subdued humor, with much of the cast greatly contributing to why I'm kept smiling. George (both the youth and adult versions), is especially hilarious-- \"Meat and Potatoes!\", \"Give us a hug\", and simply his appearance in both forms. I've always liked John Cusack and Matthew Broderick, so having them together in a movie such as this was a treat. And what a role for Anthony Hopkins-- a far cry from Hannibal Lector! The period nature of the movie was likewise attractive... oh how it would be fun to be able to step back into a setting such as that, though I'll pass on the cleansing processes!",
         "RTW is by all means a very funny movie. Sure, one can find it disgusting in some details, but it is nothing more than a point of view. On the formal side, you cannot say much against it: it has an excellent cast, superb costumes and buildings, it almost captured this long gone time. And, by the way, these stupid gadgets and therapies, they were real, they didn´t invent anything. OK, the story could be a little bit straighter, but thats all. Otherwise, RTW is holding a mirror for the health and fitness obsession of our times and one should be able to laugh about that too. All in all a good one. I´m sorry for those, who cannot like it because of their prudery, rest of you just try to watch a little bit more open - minded.",
         "I judge the worth of a movie by how many times I want to watch it and I never seem to get tired of this one. An outstanding cast coupled with a delightful mix of period and real history add to the enjoyment. In addition, the director has an excellent sense of timing, the movie is well costumed and the music often lends itself well to comic moments. Of course, an overwhelming element of sex adds to its irreverent charm. The leads read(pardon the cliché)like a who's who of fine acting. Anthony Hopkins, John Cusack, Mathew Broderick, Dana Carvey and Bridgette Fonda head an excellent cast of character actors. If you look closely, you might recognize one of the \"cookoo cookoo\" Pigeon sisters from the original Odd Couple playing John Cusack's aunt. If you have any more doubts just remember the words of Nurse Graves \" An erection is a flagpole on your grave\".",
         "Battle Creek, Michigan is hometown to me and several generations of my family. So, maybe I appreciated 'The Road to Wellville' more than most. After all, anyone living in Battle Creek either works for the Kellogg Company or is close to someone who does. Kellogg's and Post cereal companies have affected nearly every level of Battle Creek's evolution for 100 years or more. The great cereal boom of the early 1900s is still talked about today. And tales of the legendary Dr. Harvey Kellogg (artfully played by Anthony Hopkins), Seventh Day Adventists, and the famous (or infamous) Battle Creek 'San' are fondly retold by some of the town's elder residents. The health regimens practiced at the B.C. Sanitarium led to a host of other health-related businesses in Battle Creek which made everything from dubious exercise equipment to nearly tasteless all-veggie soybean burgers. This film is a lively, tongue-in-cheek rendition of the intriguing story about an era when entrepreneurship in the U.S. was at its peak. The cast, featuring Matthew Broderick, John Cusack, Bridget Fonda and Dana Carvey, is excellent and the humor as wacky as it gets. Bon appetit!",
         "I rate the picture highly simply because it evokes the period and attitudes so interestingly. The tongue-in-cheek narrative follows the experiences of several people in and around the Battle Creek (Michigan) Sanitarium, that was operated as a health spa by Dr. John Harvey Kellogg. A member of the Seventh-Day Adventist Church, Dr. Kellogg was a firm believer in vegetarianism, no smoking, no drinking, regular exercise and abstinence from sexual activity as the roadmap to a healthy life. Much of what he was peddling was unscientific bushwa. But he did invent the breakfast cornflake, although it was his brother who successfully marketed it. The movie is set just after the turn of the 20th century, when the town of Battle Creek was host to dozens of wannabees who attempted to develop and market their own vegetarian breakfast foods. A well-meaning but gullible young man arrives to cash in on the breakfast food craze. A troubled young married couple visit the \"San\" to cure the man of his bowel troubles. Both find gratification not of the kind generally permissible under Dr. Kellogg's regime. The Dr.'s own family, that consists of he, his wife, and dozens of adopted children, is uniquely dysfunctional. One uncooperative child opposes the Dr. early on and later demonstrates peculiarly and emphatically what, exactly, in Dr. Kellogg he found repulsive. The movie is about sex. The regime is sexually repressive yet one finds sexual tension relieved at every turn. But, alas, there are no car chases.",
         "*Spoilers* Lots of negative comments here about the \"bathroom\" humor and general naughtiness. Some of it may be valid, but most probably isn't once you know what's going on. The bathroom humor here is about as naughty as Edwardian-era people got in public. What they did elsewhere is, well, human. If you can tolerate most of Mel Brooks' movies, you can handle this without too much trouble. It helps to be (or in my case, have been) in the holistic therapies trade, in my case Massage Therapy. A lot of folks see some of the odd machinery and treatments portrayed in the movie as absurd today, but in their time it wasn't so. Even today, we still dip hands or feet or other sore areas in hot paraffin wax, use hydrotherapy (hot and/or cold baths), and, in some modalities, use enemas of various types for internal cleansing. There are even stranger treatments around today, which I need not elaborate here. It all probably works about as well today as it did just after the turn of the century. The film addresses our continuing fascination with treatments for our many maladies. Little has changed in 100 years, in some ways. The book was a bit more serious in tone than this film, but I don't think that detracts from the screenplay. I think the story shows us our addictions and obsessions, whether that is with new diets, exercise, alcohol, drugs, or enemas. Speaking of which, one of my favorite lines in the film is after Dr. Kellogg's scatological exam of Will: Dr. K: \"I prescribe 15 gallons of yogurt.\" Will: \"15 gallons?! I can't eat 15 gallons of yogurt!\" Dr. K: \"Ohhhhh, your not gonna get it in that end, Mr. Lightbody . ..\" The movie seems to have a bit more sex in it than the original book (the whole business with Miss Muntz and Will is missing in the book, among other things), as was a lot of the business with George. I admit the additions made for a more amusing and interesting film. The side stories here add color. I'm always amazed at how poor Will must have felt, once he busts out of the San and heads for the Tavern, where there's nice thick Porterhouse steaks sizzling and beer and potatoes and gravy. Imagine eating gerbil food and gravel for a week and then heading for, say, Outback. The breakfast food business is enlightening too. Perfoo? Where do they get these names? And then there's the business of Dr. Spitzvogel and \"handabung\" therapy. I admit I was a bit aghast at finding the former transporter chief O'Brien from Star Trek TNG butt naked in the woods. Dr. Kellogg was a real person, and was definitely a man of conviction (or obsession depending on your viewpoint) and he had his eccentricities, as many of us do. I'm not certain of all the facts presented in the movie about him, but like anything else probably at least have some basis in truth."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Beacon Communications",
         "Columbia Pictures Corporation",
         "Dirty Hands Productions"
      ],
      "summaries": [
         "A madcap portrayal of William Lightbody's stay at the health farm run by cereal king Dr. John Harvey Kellogg. William's wife, Eleanor, has persuaded him to go to Kellogg to have his system cleaned of impurities. Kellogg is very unconventional, and almost barbaric in his treatments.",
         "In Welville, at Battle Creek, eccentric rich Dr. John Harvey Kellogg (a historical figure) runs a stylish health farm for the wealthy, an idea ahead of his time, based on extreme vegetarianism, neither sex, masturbation or even sensual stimulation, but laughing therapy and purging the 'polluted' body, mainly by exercises, often in open air, vicious diet, his invention corn flakes, laxatives, anal yogurt cure, enemas and brutal mechanical cleansing. Eleanor Lightbody drags her sickly, incredulous husband Will along to the therapy; the couple is almost immediately separated and getting horny for more available members of the opposite sex. Kellogs stubbornly willful adopted son (among over 30 kids) George is a filthy embarrassment, paid off just to stay away. Charles Ossining panics when arriving in Battle Creek he finds his aunt's fortune made him partner in the empty shell- health food company Per-fo, not the planned corn-flakes factory; however with a former Welville-employee and George's name they hope to get rich from their own cornflakes brand. When an electric therapy goes fatally wrong and several other patients die, Will's incredulous reluctance turns to panic...",
         "A story about the ins and outs of one unusual health facility in the early 20th century, run by the eccentric Dr. Kellogg."
      ],
      "budget": 25000000
   },
   "movielensId": 518,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-28",
      "dvdReleaseDate": "2002-09-10",
      "directors": ["Alan Parker"],
      "runtime": 118,
      "movieId": 518,
      "title": "The Road to Wellville",
      "mpaa": "",
      "actors": [
         "Anthony Hopkins",
         "Bridget Fonda",
         "Matthew Broderick",
         "John Cusack",
         "Dana Carvey",
         "Colm Meaney",
         "Lara Flynn Boyle",
         "John Neville",
         "Traci Lind",
         "Camryn Manheim"
      ],
      "imdbMovieId": "0111001",
      "originalTitle": "The Road to Wellville",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["wQviGrzIKQY"],
      "plotSummary": "An unhappy young couple visit the infamous Kellogg spa in Battle Creek, Michigan while a young hustler tries get into the breakfast-cereal business and compete against John Kellogg's corn flakes.",
      "tmdbMovieId": 10467,
      "avgRating": 2.69844,
      "releaseYear": "1994",
      "numRatings": 1280,
      "posterPath": "/3i5zFVewQMGlcPhsHoHmf0VHV02.jpg"
   }
}