{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "skinhead",
            "id": 379
         },
         {
            "name": "resistance",
            "id": 836
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "right wing radicalism",
            "id": 6218
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "white supremacists",
            "id": 207915
         },
         {
            "name": "nazi fiction",
            "id": 241017
         }
      ],
      "imdb_id": "tt0105275",
      "video": false,
      "title": "Romper Stomper",
      "recommendations": [
         9519,
         12877,
         25476,
         527,
         21252,
         4012,
         9344,
         476,
         10683,
         10692,
         994,
         10307,
         9306,
         16608,
         12143,
         9558,
         9434,
         9067,
         9696,
         11880
      ],
      "backdrop_path": "/yIAwrHHGZRlddCnPs6niueDKRq7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hando",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6cf",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Davey",
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f6d3",
               "name": "Daniel Pollock",
               "profile_path": null,
               "id": 65023,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gabe",
               "gender": 1,
               "credit_id": "52fe436a9251416c7500f6d7",
               "name": "Jacqueline McKenzie",
               "profile_path": "/qBAp4Syl6GhbhZFV96BSDM8Fxjv.jpg",
               "id": 28744,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6db",
               "name": "Alex Scott",
               "profile_path": "/5OugW6hgsZzEK7PUbBY0QnVQUrx.jpg",
               "id": 65024,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sonny Jim",
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f6df",
               "name": "Leigh Russell",
               "profile_path": null,
               "id": 65025,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Cackles",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6e3",
               "name": "Daniel Wyllie",
               "profile_path": "/vOE8xx5mWUxamHWvAq5q07Ud2WO.jpg",
               "id": 3062,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6e9",
               "name": "Geoffrey Wright",
               "profile_path": null,
               "id": 65026,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6ef",
               "name": "Geoffrey Wright",
               "profile_path": null,
               "id": 65026,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f6f5",
               "name": "Ian Pringle",
               "profile_path": null,
               "id": 65027,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f6fb",
               "name": "Daniel Scharf",
               "profile_path": null,
               "id": 65028,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f701",
               "name": "John Clifford White",
               "profile_path": null,
               "id": 65029,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe436a9251416c7500f707",
               "name": "Ron Hagen",
               "profile_path": null,
               "id": 29081,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f70d",
               "name": "Bill Murphy",
               "profile_path": null,
               "id": 63962,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.002635,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 10412,
      "vote_count": 168,
      "budget": 0,
      "overview": "Nazi skinheads in Melbourne take out their anger on local Vietnamese, who are seen as threatening racial purity. Finally the Vietnamese have had enough and confront the skinheads in an all-out confrontation, sending the skinheads running. A woman who is prone to epileptic seizures joins the skins' merry band, and helps them on their run from justice, but is her affliction also a sign of impurity?",
      "similar": [
         2253,
         1696,
         11826,
         16869,
         101,
         948,
         423,
         238636,
         369885,
         663,
         10029,
         341006,
         400,
         12662,
         10285,
         2832,
         5925,
         1359,
         4141,
         1991
      ],
      "original_title": "Romper Stomper",
      "runtime": 94,
      "poster_path": "/yvvMC6AVPgObMmjfe5disvRE14y.jpg",
      "spoken_languages": [
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "Tiếng Việt",
            "iso_639_1": "vi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Seon Film Productions",
            "id": 39712,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Victoria",
            "id": 11840,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Romper Stomper Pty. Ltd.",
            "id": 50619,
            "origin_country": ""
         },
         {
            "logo_path": "/w7d3hoHQaC0XwjrxEG1yPeuUhu5.png",
            "name": "Australian Film Commission",
            "id": 417,
            "origin_country": "AU"
         }
      ],
      "release_date": "1992-03-05",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Give Him Smack In Head Special ...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Geoffrey Wright"],
      "runtime": 94,
      "synopsis": "A gang of violent neo-Nazi skinheads from Footscray, Victoria, Australia attack two Vietnamese-Australian teenagers in a subway tunnel at Footscray Station (filmed at Richmond Station). The gang is led by Hando (Russell Crowe) and his friend and second in command, Davey (Daniel Pollock). They meet drug addict Gabrielle (Jacqueline McKenzie) the day after her sexually abusive, highly affluent father Martin (Alex Scott), has her junkie boyfriend beaten up. Gabrielle starts a romantic association with Hando. Some of gang's skinhead friends visit from Canberra, one of whom has joined the Royal Australian Navy and is home on leave. After a long night of drinking, fighting, and sex, two members of the gang go to their local pub. Unbeknown to them the owner has sold it to a Vietnamese Australian businessman. Upon seeing the new owner and his sons, they inform Hando. Hando and his gang arrive and savagely beat the new owner's sons. A third Vietnamese youth phones for help, and several armed Vietnamese men descend on the skinheads. The Vietnamese outnumber the skinheads and a few are killed. The Vietnamese force them to retreat to their rented warehouse, where the Vietnamese ransack the building before setting it on fire. The skinheads find a new base at a nearby warehouse after evicting a pair of squatters, and plan their revenge against the Vietnamese. Learning that gang members plan to buy a gun, two female friends of the gang depart. Gabrielle suggests the gang burgle her father's mansion. They ransack the house, beating Martin up, smashing one of his cars and raiding his wine collection. Gabrielle tells Martin that the burglary is revenge for his years of abuse. Later she reveals to Davey her plan to take Hando away from his violent life. Martin eventually frees himself and uses a handgun to scare away the gang before they can take any of his property. Davey begins to have doubts about his violent life style. Gabrielle criticises Hando's handling of the robbery and he abruptly dumps her. Davey announces his intention to leave at the same time, giving Gabrielle the address of his German grandmother, where he will be staying. Gabrielle informs the police of the gang's location and then spends the night with Davey. Davey reveals his doubts about his violent lifestyle, having removed the racist patches from his flight jacket out of concern for his grandmother. The police raid the warehouse while Hando is out. The youngest skinhead is shot dead after pointing a non-working gun at police. Police arrest the rest of the gang. Hando watches from a distance and flees. Arriving at Davey's flat, Hando finds his friend in bed with Gabrielle. Hando accuses her of informing the police, but Davey says they were together the whole time since leaving the squat. Hando convinces Davey to stick by him, and the trio go on the run. They rob a service station, and Hando strangles the Asian attendant to death. Driving all night, they stop at a beach. On the beach, Gabrielle overhears a conversation wherein Hando tries to convince Davey to leave her behind. Gabrielle then sets their car on fire. She admits to phoning the police. Hando attacks her, attempting to drown her in the surf. Davey stabs Hando in the neck with his Hitler Youth knife, killing him. Davey cradles a horrified Gabrielle on the beach watched by a busload of Japanese tourists, while Hando's bloody corpse gazes at the ocean.",
      "writers": ["Geoffrey Wright"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105275/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxNjgxNDA4MV5BMl5BanBnXkFtZTcwNTY4NDEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Russell Crowe, Daniel Pollock, Jacqueline McKenzie | See full cast and crew »"],
      "reviews": [
         "Every thing about this movie is unique, right down to the 16mm film that they used to shoot it. Even though it was filmed in 1992, it has the look a an early 80's film. I defy you not to think about A Clockwork Orange as you watch it. Some people have said that the film glorifies skinheads. I would have to ask those people, WHAT FILM WERE YOU WATCHING? This film presents skinheads and their society and says this is the way it is. It does not glorify, nor does it jump on a soapbox. Not to tip anything off, but by the end of the film I don't think there are going to be too many people saying \"being a skinhead is a wonderful life.\" In fact, I think that is why the film is so good. The subject matter is not black and white, it is very gray. Skinheads exist for a reason, they do things for a reason. The reasons might sound immoral to us, but the world is made up of different types. In fact, most of the movie deals with Hando (Russel Crowe) trying very hard to hold his skinhead bunch together. However, the destructive nature of the characters is bringing about the destruction of their lifestyle. The performances in this film are great. In particular, Daniel Pollock is great as Davey. I was very saddened to hear that he died right after this movie. He is often silent during the film, but his facial expressions are very powerful. For anyone that is interested in examining some of the darker groups that wander around this world, Romper Stomper has a very interesting one for you to look at.",
         "This film will stay with you for quite awhile. It tells the story of Hando (Crowe) and his best mate Davey. Both are Skinheads in the Melbourne area, 1980's. Hando and Davey's lives revolve around collecting Nazi relics and attacking Orientals that have chosen to live in Australia. The two are very tight and big believers in the cause, keep Australia free of outsiders. However, when a girl enters the picture, one will start to see that life is more than just mindless violence and the other will go mad as he sees that his small group of Skins cannot change the fate of his country. This film is not preachy and does not come across as black and white. Both Hando and Davey have positive and negative traits. Instead, the picture tries to show what motivates Skins in doing what they do. The film has some violence, but only in attempt to show how pointless violence is. In my opinion, this is Crowe's finest performance. Moreover, the actor that played Davey is brilliant as well (sadly, he died shortly after the film was finished). If you want to see an excellent historical lesson about hate and how it destroys, see Romper Stomper.",
         "I'm sure people may have dismissed this movie as a nazi tribute to white power. On the contrary, it gives an excellent picture of what happens when powerless people try to find some control over their lives. Nazi-ism itself is scapegoating and blame disguised as fascism, and this movie uses it to paint a picture of desolation and desperation. White power and immigrant-hatred are not what this movie is about. It's about friendship and the need to belong to something. Russell Crowe's Hando is powerful - I couldn't take my eyes off of him. Hando uses that magnetism to draw people into his ideology, thus creating control and power for himself. Things begin to unravel when Gabe, the girl who comes between Hando and Davey, throws off the hold Hando has enjoyed over his little crowd. Remember what Orwell says: Absolute Power corrupts absolutely? Well, so does arrogance. Arrogance and the lack of respect for one's fellow man, regardless of race or creed, are key players in this plot. I wish there had been more of Davey (Daniel Pollock) in this film, and I'm sorry to have learned of his real-life suicide in the weeks after it's completion. I recommend this film to people who are interested in how poverty, ignorance, and powerlessness change people into strange earthly demons capable of indiscriminate violence.",
         "Romper Stomper takes great pains for an accurate depiction of the skinhead culture; the dress is perfect (except for the roles of the females of the crew) as well as the music; the overall movie captures the culture very well on those factual bases, and on the artistic fronts and aspects of the film the portrayel is also enjoyable, accurate, and sparks great thought. The film demonstrates some very well-done action sequences; the thuggish violence that is seen throughout the film is very well crafted, and done in a manner that I found to be pleasing to anyone who likes realism (nothing cartoonish or over the top -- just shear teeth-clenching violence). On top of the action sequences is a relatively intriguing story; however, the plot is never fully developed and there are certain parts of the story that interest you very much, yet you do not get to find out more. The film is very much worth watching though it has its' flaws. A very good film, overall, that gives you good action and some things for you to think about. Mostly this film ought to be lauded for its' graphic depictions and its' attempts at accuracy (which greatly supersede most films). It is a very beautiful demonstration of Australian cinema (and proudly so) that is greatly underrated and underviewed. I advise anyone to watch this film.",
         "Firstly, I'd like to start by saying that anyone who thinks this is somehow pro-racist or pro-skinhead has REALLY missed the point, thats if they've even seen it,that is. That would be like saying 'Saving Private Ryan' glorifies war, or 'Trainspotting' glorifies drugs. It revolves around a bunch of lawless Australian skinheads, as they party to loud skrewdriver-esquire music, drink, fight (amongst each other as well as against the Vietnamese immigrants living nearby), cause mayhem..and so on so forth. They are living in a dilapidated old garage and scrounge off the system whilst hating it. They are portrayed as hopeless, angry lost kids held together by a psychopathic and violent leader;Hando Where to start with Hando, seriously, this is undoubtedly Russel Crowe's most unforgettable performance. Whether its his tattoo's, shaved head, unshaven face or cold eyed glare...you can't help but be drawn in by Hando. He is by far the most relentless and ruthless member of the gang, and during the film you wonder whether or not they'd even exist without him. During the film, things take a turn for the worse, actually they take several turns for the worst...which has an increasingly negative effect on the gang. I rated this film a 9, as it achieves what it sets out to do. Give the viewer a no-holds barred trip into the destructive lives of social outsiders, and the violence and hatred that follows. Not easy viewing, but I recommend this film to anyone who likes their movies gritty and upfront.",
         "Very violent and if for any reason you need to get your heart racing, this is the ticket. Takes awhile to get going and for a plot to actually form, but when it does all bets are off and the movie is running at 1000mph for the rest of the running time. There are moments of human interaction and even some tenderness but they make the violent scenes so much more meaningful. Different from \"American History X\" but similar in many ways too. Crowe is great, as always. He can play anything, I am starting to believe his recent Oscar win was a really great thing. Hando is a totally different person from Bud White in 'L.A. Confidential', Maximus in 'Gladiator', Andy in 'Proof' and Jeff in 'The Sum of Us'. I can only imagine what he'll do in 'A Beautiful Mind' but I bet it'll be something. 8/10",
         "Romper Stomper is enjoying renewed interest due to the current fame of its star, Russell Crowe, but the movie stands on its own regardless. Crowe plays the leader of a violent group of racist skinheads, who are upset over Vietnamese immigrants in their neighborhood. There are quite a few clashes, a love story, and betrayal all wrapped up in a disturbing package. While watching Romper Stomper I found myself sympathizing with at least one of the racist characters, even though my views are far from his -- it's just that well written and acted. There aren't a lot of surprise in this film, but the surprises that exist are truly interesting and plausible. This does not mean that the movie is cliche and boring, though -- it presents its ideas in an interesting fashion with well-written and directed acting.",
         "Caused a lot of controversy in Oz and here in the UK when first released in 1992 and its not that difficult to see why. This is is no American History X with its somewhat 'weekend' boneheads who still live with mummy and hold down jobs or attend school. Hando and his crew live outside society with no outside control or scrutiny of their actions.There is no attempt by the makers to moralise on what Hando and co get upto, they simply show how it is with Neo-nazi groups Russel Crowe's depiction of Hando surely ranks as one of the greatest portrayals of pure menacing evil ever and the fight scenes are brilliantly staged and edited. For a companion film to this I'd recommend viewing 'Ultra', an Italian language film that follows a group of football thugs in a similar way.",
         "Wow. This was recommended by a coworker and I must say I liked this film. Especially the gang war sequence. There's about 15 minutes straight of brutal violence and with NO guns. Awesome. Good backstory as well with a bizarre love triangle, parental molestation, and epilepsy. The whole thing fits together in a neat little package and is essential viewing for any Crowe fans who want to see some of his earlier work. 7/10....",
         "Skinheads\u0097love 'em or loathe 'em, you can't ignore them; and if you tried, they would kick your head in! Russell Crowe gives a bravura performance as Nazi-loving Hando, leader of a gang of racist thugs hell-bent on giving a good drubbing to the immigrants that have taken over his neighbourhood. Romper Stomper is a brutal and uncompromising look at the ugly face of prejudice and the futility of anger and violence. Hando's gang are a seething mass of hate and ignorance, lashing out at those they do not understand. The inevitable result is pain and suffering (and not just for those who get their heads cracked by the bovver-booted bully boys). No-one is allowed a happy ending in this film; everyone winds up dead, nearly dead or at least getting a good pasting. With excellent performances from all involved, this disturbing look at youth and blind hatred is compelling and well worth a look."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Australian Film Commission, The",
         "Film Victoria",
         "Romper Stomper Pty. Ltd."
      ],
      "summaries": [
         "Nazi skinheads in Melbourne take out their anger on local Vietnamese, who are seen as threatening racial purity. Finally the Vietnamese have had enough and confront the skinheads in an all-out confrontation, sending the skinheads running. A woman who is prone to epileptic seizures joins the skins' merry band, and helps them on their run from justice, but is her affliction also a sign of impurity?",
         "A group of skinheads become alarmed at the way their neighbourhood is changing."
      ],
      "budget": 0
   },
   "movielensId": 522,
   "movielens": {
      "languages": [
         "Português",
         "Deutsch",
         "English",
         "日本語",
         "Tiếng Việt"
      ],
      "releaseDate": "1992-03-05",
      "dvdReleaseDate": "2000-11-21",
      "directors": ["Geoffrey Wright"],
      "runtime": 94,
      "movieId": 522,
      "title": "Romper Stomper",
      "mpaa": "",
      "actors": [
         "Russell Crowe",
         "Daniel Pollock",
         "Jacqueline McKenzie",
         "Alex Scott",
         "Leigh Russell",
         "Daniel Wyllie"
      ],
      "imdbMovieId": "0105275",
      "originalTitle": "Romper Stomper",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Tu2JLPh4A40"],
      "plotSummary": "Nazi skinheads in Melbourne take out their anger on local Vietnamese, who are seen as threatening racial purity. Finally the Vietnamese have had enough and confront the skinheads in an all-out confrontation, sending the skinheads running. A woman who is prone to epileptic seizures joins the skins' merry band, and helps them on their run from justice, but is her affliction also a sign of impurity?",
      "tmdbMovieId": 10412,
      "avgRating": 3.54479,
      "releaseYear": "1992",
      "numRatings": 1362,
      "posterPath": "/yvvMC6AVPgObMmjfe5disvRE14y.jpg"
   }
}