{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0105032",
      "video": false,
      "title": "Savage Nights",
      "recommendations": [
         85769,
         5282,
         62364,
         48009,
         47792,
         43460,
         28685,
         66043,
         16659,
         74544,
         53234,
         19958,
         42225,
         55368,
         121652,
         32279,
         47717,
         80919,
         59990,
         21056
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jean",
               "gender": 2,
               "credit_id": "52fe45e1c3a36847f80dfc29",
               "name": "Cyril Collard",
               "profile_path": "/jIB9tBti0ny3tpdhklaEl8b90Qy.jpg",
               "id": 127283,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Laura",
               "gender": 1,
               "credit_id": "52fe45e1c3a36847f80dfc2d",
               "name": "Romane Bohringer",
               "profile_path": "/keVDM0uUbKmo0yOVNrjMuKiH1B2.jpg",
               "id": 40938,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Samy",
               "gender": 0,
               "credit_id": "52fe45e1c3a36847f80dfc31",
               "name": "Carlos López",
               "profile_path": null,
               "id": 256268,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Laura's Mother",
               "gender": 0,
               "credit_id": "52fe45e1c3a36847f80dfc35",
               "name": "Corine Blue",
               "profile_path": null,
               "id": 1162582,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jean's Mother",
               "gender": 1,
               "credit_id": "52fe45e1c3a36847f80dfc39",
               "name": "Claude Winter",
               "profile_path": "/3kbRY0CJOMI5LBvKVRIFbeTenEv.jpg",
               "id": 286184,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Marc",
               "gender": 0,
               "credit_id": "52fe45e1c3a36847f80dfc3d",
               "name": "René-Marc Bini",
               "profile_path": null,
               "id": 23300,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Noria",
               "gender": 0,
               "credit_id": "52fe45e1c3a36847f80dfc41",
               "name": "Maria Schneider",
               "profile_path": "/nhWpHPbiwRQFFQ2pRXDUMSGTggy.jpg",
               "id": 18329,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e1c3a36847f80dfc25",
               "name": "Cyril Collard",
               "profile_path": "/jIB9tBti0ny3tpdhklaEl8b90Qy.jpg",
               "id": 127283,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e1c3a36847f80dfc47",
               "name": "Cyril Collard",
               "profile_path": "/jIB9tBti0ny3tpdhklaEl8b90Qy.jpg",
               "id": 127283,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e1c3a36847f80dfc4d",
               "name": "Jacques Fieschi",
               "profile_path": null,
               "id": 23506,
               "department": "Writing",
               "job": "Adaptation"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.156131,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 41878,
      "vote_count": 15,
      "budget": 0,
      "overview": "Jean is young, gay, and promiscuous. Only after he meets one or two women, including Laura does he come to realize his bisexuality. Jean has to overcome a personal crisis and a tough choice between Laura and his male lover Samy.",
      "similar": [],
      "original_title": "Les Nuits Fauves",
      "runtime": 126,
      "poster_path": "/i9Yg2QH13DfezpKVvdrl0Olpe9V.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 16366,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Société Nouvelle de Cinématographie",
            "id": 249,
            "origin_country": ""
         }
      ],
      "release_date": "1992-08-19",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cyril Collard"],
      "runtime": 126,
      "synopsis": null,
      "writers": [
         "Cyril Collard",
         "Jacques Fieschi"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0105032/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzMjExNzE1NF5BMl5BanBnXkFtZTcwNzgzNzcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Cyril Collard, Romane Bohringer, Carlos López | See full cast and crew »"],
      "reviews": [
         "The first serious movie to deal with HIV, \"Les nuits fauves\" felt like a Joe Frazier hook when it came out in 1992. Gone are all the pitiful sentimental demonstrations of future films like \"Philadelphia\" . In fact, AIDS is merely the backdrop of the film. Cyril Collard never asks for pity. The movie is both a confession and an hymn to life. It doesn't try to moralize the audience, although some spectators were concerned about the \"message\" such a film might send. You have to remember that the events described in LNF take place in 1986, when the concept of HIV and AIDS were still abstract and to be defined. Collard himself said in a 1992 interview that the irresponsability of his character, Jean, having unprotected sex although aware he is infected, would be rightly considered criminal by now. The virus serves as a driving force for a main character that is learning to love, opening himself to others, to the world. But to reach the light, you must first go through the darkness and the task is not an easy one to witness. LNF demands a lot on the viewer, asking him to let go of his preconceive ideas and ideals. Very much influenced by his mentor Maurice Pialat, Collard makes a daring film, one which you could never imagine coming from the all too clean world of Hollywood film making. Here, energy comes first, technical aspects of movie making later. Therefore life, real life, shines through. \"Les nuits fauves\" is a force to be reckon with. An unsettling experience I will never forget.",
         "...but pictures a completely different perspective on HIV and AIDS. No supportive family here. No struggle with society for it to acknowledge on our humanity, regardless of sexual preference or health status. This picture is an invaluable reference for all those trying to understand terminal disease -AIDS in particular- or in the process of facing death. Just seems important to mention that Collard's actual treatments were filmed and included on the final cut. The bouncing around of high-low's, from absolute certainty of overcoming the disease to deep depression and sending everything -love included- straight to hell. But also the dangerous and sometimes silly sense of humor with which the director plays his role, is what makes this movie invaluable to me. To my knowledge this is the first film in which HIV positive blood is used as a defensive weapon, and saves the life of two of the characters. I sincerely hope that there is some form of afterlife, and that they have cable. Collard deserves to know he was, is, deeply appreciated, as so many others who where \"cheated\" out of time, to see their work achieve recognition. One is what one does, they say.",
         "I should probably take back the word masterpiece since Cyril Collard's directorial debut was actually his only film. The director, writer and main character of the film died just three days before his film swept the Caesars(the Oscar's french counterpart). Collard died of AIDS and brought to life one of the most compelling films surrounding this theme. It is not just people whining because of the departure of the beloved one but a tour de force involving hatred, passion, self destruction, and all those \"nice\" feelings that accompany a person who knows that he will die sooner than the rest, and culminating in spiritual redemption. This film also portrays one of the finest love triangles on film; the at times sickening at times profoundly erotic and at times inevitably cathartic relationship between Jean and his two lovers is a genius example that love is not \"Sleepless in Seattle\". Romane Bohringer(probably best known for her character as Verlaine's wife in Total Eclipse) is a must see in her breakthrough performance as a confused and VERY passionate young girl.",
         "For a movie about how AIDS affects a person, his behavior, and the compounded effects on those around him, one might expect the film to play the emotions of the viewer in an obvious way. However I must say I was engrossed from the beginning to shortly before the end by the film, never having the opportunity to distance myself and view the scene or action as a critic, dissecting what the director's intent was. I was very pleased.",
         "It appears to me that lately Hollywood has rediscovered a new well that is producing plenty of treasures and stories about a still present evil, that seemed largely forgotten in the movies and that rendered in the past great pictures aligned with social commentaries, denounces and good fights against prejudices. Stories about the HIV/AIDS epidemic and they're coming in the thousands: right after brilliant documentary \"How To Survive a Plague\", the stream continued with \"Dallas Buyers Club\", \"Behind the Candelabra\", and the upcoming adaptation of \"The Normal Heart\". They're all heroic, real and influential tellings and they're getting a lot of praise from everybody. Meanwhile, I took the time to look back at the time machine and search for works that were released back in the nightmarish days when the plague was a horrific death sentence and a theme barely touched on the screen. Among those, \"Les Nuits Fauves\" (\"Savage Nights\") is one that needs to receive a special attention. It's unlike any of the fore-mentioned titles, it's daring at the same time it's unpleasant, careless, controversial, and it's a different take from almost all the other films of the period. This is the anti-\"Philadelphia\" - I make this comparison because they were released very next to each other (the same year in most countries). What you're about to see was a real story, fictionalized at times but real. Its writer, director and main star Cyril Collard exposes a dark truth that frightens, revolts and angers, but he was being truth to himself and to the public. First, with his 1986 novel of same name and then by making this adaptation, huge risks in presenting his story about Jean, a HIV positive cinematographer wanna be director who refuses to deal with his condition, still living a hedonistic and wild life of parties, drugs and sex with both men and women. We focus on two of his lovers: the 17 year-old Laura (Rohmane Bohringer), naive and impressionable enough to fall in love with him; and the rugby player Sami (Carlos López), bisexual just like Jean, but they're more into the attraction part than dealing with a love/hate kind of thing. Torn between these two and also with casual sex encounters with strangers under a Parisian bridge, Jean ignores his disease living as if things never changed, deeply knowing that he is changing, getting affected more and more each day goes by. Everything's resumed into knowing that he's alive and kicking and there's some time to be enjoyed before death. But don't be fooled. \"Savage Nights\" is pain after pain, pleasure is very limited. The relation with Sami is a pure escapism since most of the time he's committed with girls and finding time to be join a racist/homophobic group, beating up people like Jean, where he can release his frustration of not living the same way he did with his criminal father back in Spain; the \"love\" affair with Laura is a constant headache, mostly because she doesn't handle well the fact that Jean likes guys (and she knows about Sami). It gets worse when Jean reveals that he's HIV positive and she might be as well because they had unprotected sexual relations. His excuse for not saying it before is unreasonable yet believable (and probably used by many folks out there): he thought she'd never get AIDS because their love is strong and overcomes anything, even a deadly virus. It's the greatest and most difficult scene of the film, and some will focus their anger and hate not on the character but on Collard. I appreciated the film because Collard has given a different perspective on a delicate theme at the time, had a lot of nerve in telling his story (but not necessarily a full factual retelling, there's rumors that the story ended differently for the real girl who inspired Laura) and despite the obstacles faced with his new reality, finding ways to see life with some optimism, grasping to it with the few strength he has and seeing it a little differently. Sure, he's still careless about others and himself, always putting his feelings above the others, including family and friends but now he can truly say he loves his life. Sickness feels less important, the complete opposite of what happens in similar themed films where you see characters slowly succumbing to the disease, which is always on the foreground, preventing them to do anything about it. Collard's adaptation of his own novel doesn't betray his source, though he left out great sequences - the one in Morocco is reduced to bits and pieces, but it was poetic translated in surreal scenes - but the way he conducted its transformation to the screen was very good, small chapters and fragments of a full speeding life that runs towards the inevitable end that never seems to actually feel it. It's a circle of parties, drugs, sex, wild nights, fights and risky business in a city whose corners seems to invite all of those at any given moment. But what's wrong with \"Savage Nights\"? It's lack of focus in the disease's progress. The character forgets about his problems and still lives his life but in terms of reality the disease becomes overlooked when it shouldn't. But forget that. What about his message to audiences? I'm positively sure that Collard was simply telling his own story without endorsing or condemning his actions - though anyone else can get easily confused with everything presented there. Let people figure out for themselves. That's what happened but it wasn't very helpful since many critics reacted badly with the movie, others praised it, and the man hasn't lived enough to expose his thoughts, dying a few days earlier of the rain of awards at the Cesar. The enigma stays on with this film testament, who was he and how to describe him and his acts? Rebellious, honest, sickening, hateful, fearless? Hero or villain? Choose yours. 8/10",
         "This film was a succès de scandale when it was released twenty years ago, and although (in Europe and America) HIV is not the death sentence that it was at the time, the film still packs an emotional wallop. It is the portrait of a completely self-centered man who is willing to put others at risk in search of his own pleasure and self-actualization. Is he a despicable character? Yes. Does that mean the film is automatically bad? No,however... The film contains too many unfocused scenes of characters lashing out. By the fourth or fifth scene of the young female protagonist screaming on the phone, screaming in the street, screaming at the door of the apartment, it becomes overdetermined. The film tries to tackle too many subjects--sadomasochism, skinheads, internalized homophobia, bisexuality, AIDS and responsibility, teenage love... it ends up something of a hot mess. I gave it six out of ten because I feel that it is worth seeing, because it captures a certain zeitgeist of the pre-antiretroviral moment, but one does feel a bit on watching it today that it has not aged all that well.",
         "\"Les nuits fauves\" is one of the most honest films I have ever seen about human condition and one of the aspects of our sexuality. For a start, the depiction of ambisexuality is quite sincere, showing the suffering this ambiguous sexual behavior (considered an orientation, in spite of its apparent lack of direction) brings to people really involved or in love with the so-called bisexual entity who feels attracted to both men and women. The motion picture is not fiction or a bad joke, but mainly facts based on Cyril Collard's own life, who infected the woman he was involved with (played here by Romane Bohringer), knowing he was HIV-positive. First came the revelation through the novel of the same title, and then the film, in which he played his own part because no French actor even considered to play it, finding it too risky for their careers. Collard plays himself apparently as he was: a vain, irresponsible, hedonistic strong case of satyriasis (the male counterpart for female erotic mania), and thanks for his daring to show his lifestyle, his passions and his mistakes, at least he left a starting point for open-minded partners to discuss a subject that may be affecting their relationships. It is a film as hard and bleak as Wong Kar-Wai's \"Happy Together\", but both are necessary. There is time for \"To Wong Foo\" and for \"Priscilla, Queen of the Desert\"; there is even time for explicitness. But there should be also time for putting moralistic judgment aside, and watch and talk about dramas that show aspects of our condition that we tend to trivialize or deny, and that may make unhappy the persons we love. Five days after Cyril Collard died, \"Les nuits fauves\" won the César (France's top film prize) for Best Film, Best First Work, Best Film Editing and Best Female Newcomer (Miss Bohringer, who three years later played again the \"victim\" of two men in love: Leonardo DiCaprio and David Thewlis, as Rimbaud and Verlaine, in Total Eclipse). Collard's motion picture also won the Audience Award, the International Film Critics Prize and the Special Jury Prize at the Festival of Young Cinema, in Torino, Italy.",
         "Many films are described as \"true life dramas\". but this is the one if ever there was one. The central character Jean (Cyril Collard) a hedonistic young film producer who engages in sex with both men and women mirrors the real life story of Cyril Collard who was suffering from the AIDS virus during the making of this film and succumbed to it when the film was finished. This is a great shame because obviously Cyril Collard has lots of talent both as actor and producer, and had he lived we could have enjoyed a whole lot of top quality films. This film starts on a quiet note but gathers strength after Jean reveals he is suffering from AIDS. His girl friend Laura is shocked at the revelation as they had been engaged in unprotected sex. Wild scenes of erratic and uncontrolled behaviour indicate the frustrations of the couple. His outburst \"I don't want to die!\" is a high point and her constant appeal to him to give up his male contacts bears little fruit. \"Help me to leave you!\" is her pathetic cry. Cyril Collard has a great charm and infectious smile which he uses to advantage in his characterisation of Jean. It is a powerful drama with a constant feeling of desperation as we the viewers anticipate the fatal outcome. Not a film to cheer you up after a hard day, but it has a frightening authenticity about it which compels you to watch it to the end. The film clearly makes the point that we have a responsibility re the health of others beyond our own self satisfaction.",
         "Cyril Collard, French actor/director who in 1993 (one year after this release) died of AIDS at 35, made this unique movie in which the emotional burden of a HIV-positive person is perfectly evoked (supposed it's possible). Some scenes are notable (beautiful Paris-la-nuit views), others are less, but anyway it's worth watching it in video, better by yourself alone and thinking seriously about life,love and,ultimately, what's the sense of it ALL! If you want to have a good time, don't rent it! Just in case you feel like you're fixing to die.....:)",
         "One of the best early films to deal with AIDs and the powerful feelings that come up when one has to deal with it. The acting and the passion of the roles by the actors is very good, very intense. The love for life that comes through in the desperation of the main characters is beautiful. Lots of frustration and anger about having AIDs but ultimately the choice to fight to live comes through and this film was much ahead of it's American counterparts for the time. Most of the contemporary films in America were about the death and dying of people with Aids not the struggle to go on living and that's what sets this film apart from the others of it's time. Highly recommended!!"
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Banfilm",
         "La Sept Cinéma",
         "Société Nouvelle de Cinématographie (SNC)"
      ],
      "summaries": [
         "Jean is young, gay, and promiscuous. Only after he meets one or two women, including Laura does he come to realize his bisexuality. Jean has to overcome a personal crisis (he is HIV-positive) and a tough choice between Laura and his male lover Samy.",
         "Jean is a bisexual, sexually active man, who learns he's HIV+. The movie is about him coping with the disease, with his new and violent love with the young and very passionate Laura, his desire for Samy, and his appetite for sexual diversity."
      ],
      "budget": 0
   },
   "movielensId": 526,
   "movielens": {
      "languages": [
         "Français",
         "Deutsch",
         "Español"
      ],
      "releaseDate": "1992-08-19",
      "dvdReleaseDate": null,
      "directors": ["Cyril Collard"],
      "runtime": 126,
      "movieId": 526,
      "title": "Savage Nights",
      "mpaa": null,
      "actors": [
         "Cyril Collard",
         "Romane Bohringer",
         "Carlos López",
         "Corine Blue",
         "Claude Winter",
         "René-Marc Bini",
         "Maria Schneider"
      ],
      "imdbMovieId": "0105032",
      "originalTitle": "Les Nuits Fauves",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jean is young, gay, and promiscuous. Only after he meets one or two women, including Laura does he come to realize his bisexuality. Jean has to overcome a personal crisis and a tough choice between Laura and his male lover Samy.",
      "tmdbMovieId": 41878,
      "avgRating": 3.15493,
      "releaseYear": "1992",
      "numRatings": 142,
      "posterPath": "/i9Yg2QH13DfezpKVvdrl0Olpe9V.jpg"
   }
}