{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0110299",
      "video": false,
      "title": "Lamerica",
      "recommendations": [
         43596,
         49650,
         99657,
         138093,
         58098,
         76575,
         58416,
         32636,
         122683,
         81775,
         80705,
         43000,
         43195,
         42086,
         4500,
         396485,
         144599,
         73455,
         49697,
         42147
      ],
      "backdrop_path": "/lsX2VN11LJ2MOBptQQQLuJACRqt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gino",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813acfb",
               "name": "Enrico Lo Verso",
               "profile_path": "/riYINKQIv8mxYwtfj0L899K0iPu.jpg",
               "id": 27392,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Fiore",
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813ad11",
               "name": "Michele Placido",
               "profile_path": "/j8krw9CE6VYP9BSiS86lQPMb8DM.jpg",
               "id": 25819,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Selimi",
               "gender": 0,
               "credit_id": "52fe4787c3a36847f813ad15",
               "name": "Piro Milkani",
               "profile_path": "/dTPj82a3Hmyh1keTsOIRAl8fNse.jpg",
               "id": 1149435,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Spiro",
               "gender": 0,
               "credit_id": "52fe4787c3a36847f813ad19",
               "name": "Carmelo Di Mazzarelli",
               "profile_path": "/7wj5odXZSEGALvhovZnTfd0CKy0.jpg",
               "id": 1180060,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Selimi's Cousin",
               "gender": 0,
               "credit_id": "59f797669251413db400057f",
               "name": "Elida Janushi",
               "profile_path": null,
               "id": 1306493,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Interrogator",
               "gender": 0,
               "credit_id": "5a0eac8592514138f900bdc2",
               "name": "Besim Kurti",
               "profile_path": null,
               "id": 1209552,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Factory's Manager",
               "gender": 1,
               "credit_id": "5a13a8019251417260000a40",
               "name": "Marjeta Ljarja",
               "profile_path": "/47TTPYmxy5aFeLorzjm3IU4NlrE.jpg",
               "id": 1837056,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813acf7",
               "name": "Gianni Amelio",
               "profile_path": "/tHXPXlExztj7MV10UkbWr6w6HYZ.jpg",
               "id": 128107,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813ad01",
               "name": "Gianni Amelio",
               "profile_path": "/tHXPXlExztj7MV10UkbWr6w6HYZ.jpg",
               "id": 128107,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4787c3a36847f813ad07",
               "name": "Andrea Porporati",
               "profile_path": null,
               "id": 35096,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4787c3a36847f813ad0d",
               "name": "Alessandro Sermoneta",
               "profile_path": "/4OV4PsAaNwLxENs0RhXj1m0T9hZ.jpg",
               "id": 567786,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.759419,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         }
      ],
      "id": 49133,
      "vote_count": 12,
      "budget": 0,
      "overview": "Fiore, an Italian conman, arrives in post Communist Albania with Gino, his young apprentice, to set up a shoe factory that will never open. The con requires a native Albanian, so they designate Spiro, an impoverished and confused former political prisoner as chairman of the board. When Fiore returns to Italy to get government funds for the project, Spiro unexpectedly disappears and Gino sets out on a journey to find him. The search leads him to discover Spiro's tragic personal history and witness Albanian poverty firsthand.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769,
         793
      ],
      "original_title": "Lamerica",
      "runtime": 116,
      "poster_path": "/pnoaKYhIhFxdtpdvtuPqQlwTG5X.jpg",
      "spoken_languages": [
         {
            "name": "shqip",
            "iso_639_1": "sq"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [],
      "release_date": "1994-01-01",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gianni Amelio"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "Gianni Amelio",
         "Andrea Porporati"
      ],
      "originalLanguage": "Albanian",
      "imdbLink": "http://www.imdb.com/title/tt0110299/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MTI5MjU3MF5BMl5BanBnXkFtZTcwMjMzODUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Enrico Lo Verso, Michele Placido, Piro Milkani | See full cast and crew »"],
      "reviews": [
         "I first saw 'Lamerica' at its British premiere at the Edinburgh film festival. After the screening, director Gianni Ameilo, a wonderful man in love with his own film, gave an effusive talk about how it had been made: how he had wanted for years to make a film about his father's emigration from post-war Italy to America, but chose, at the time of the Albanian refugee crisis in Italy in the 1990s, to tell the tale allegorically instead; how he cast amateurs in almost all the roles; how he plucked the amazing Carmelo de Mazzarelli from a Scicilian street to play the role of Michele because he to liked his face; and how he directed him, never showing him the full script but merely telling him what was required from each individual scene. This may be an unconventional style of film-making, but the result is triumphant. 'Lamerica' is both epic and comic, some elements bring to mind David Lean and others Mike Leigh (a feat otherwise only managed, in my opinion, by the films of Emil Kusturica). The acting is superb, the comedy dry, laced with sad irony (even the occasional Albanian mis-translation of Italian is inspired). At the centre of this film is a conventional road-movie, a story of an odd couple who bond; but it's put into a wider context by the extraordinary scenes, set in Tirana, that top and tail the movie: this film is political as well as personal, addressing not just the contemporary Albanian reality but also wider questions, such as racism and the relationship of the affluent west to the poorer world. But what stands out most of all is the remarkable visuals, both of the stunning Albanian landscape and also of the people: few directors make as much use of the widescreen format as Amelio, and the way he creates landscapes from faces so expressive they are almost fluourescent is in a class of its own. In some ways, he is almost too effective in doing so: the film feels manipulative because of the power of the images in making its point (and one wonders, can life in Albania really have been this bad?). This is a film that might almost be silent, the pictures tell the story. When, for example, Enrico la Verso's character drinks the milk, the significance of this simple act hits home with the force of a sledgehammer. Now released on DVD, 'Lamerica', one of the least typical but best films of the 90s, is well worth seeking out. And even if (like me) you have to wait 9 years for a second viewing, I promise that its imagery will linger in your mind.",
         "I just finished watching this film and it brought back to me memories of my life in Albania. the film is very precise in it's description of life in our poor land after the riots and the exoduses that occurred in the early '90s. I was lucky myself not to have gone through what most people go through during this film but I can identify with some of it. even though the film focuses more on the italian businessman, the struggle for survival that most Albanians had to go and still have to is quite clear. this film should be watched by all interested in understanding why people have to abandon their homelands. this is a perfect example and should open eyes to many.",
         "In his 1994 Lamerica Gianni Amelio raises traditional linear Italian film-making to new heights using the methods of neorealism to carry his audience along on a dreamlike, ironic mythologizing journey whose mood and methods are all his own. This very powerful film, which is as fantastic as it is vividly concrete and sad (imagine Kafka with a Sicilian accent), tells the story of two Italians, Fiore (Michele Placido, director of the recent Romanzo criminale) and his assistant Gino (Enrico Lo Verso) who come to the impoverished, wrecked post-communist Albania with the scam of setting up a shell shoe factory as what they -- or Fiore, at least, because he alone is the mastermind and evil genius of the scam -- thinks will be a profitable tax shelter. They corrupt an Albanian official named tellingly Kruja which they turn into Croce (cross) to grease the bureaucratic wheels and get the plan government approval. Unsatisfied with others who have cooperating families who could make claims, they find Spiro (Carmelo Di Mazzarelli) a doddering, half senseless old man they are reassured to be told is an orphan and who has been imprisoned by the communists for fifty years, and sign him up as the Albanian figurehead \"president\" of the company. Fiore goes back to Italy in a hurry and leaves Gino in charge of watching over the derelict factory they've taken control of and making sure old Spiro stays out of trouble. As soon as Fiore is gone, things go wrong, and as the story progresses, they go more and more wrong, until Gino has lost everything, even his identity as an Italian. The journey we go on is compulsive watching and echoes tragic wanderings like those of the father and son in De Sica's Bicycle Thief; or the couple in Fellini's La Strada, the emigrants from Turkey and Armenia in Kazan's epic America America, or the children in Clément's Forbidden Games. Amelio achieves a sense of understanding and a sorrow and pity that one can have only when everything has been stripped away and nothing but one's essential humanity remains. Imagine the worst that could happen to you on a journey, and then take that ten steps further, and you have an idea of the trajectory and transformative emotional power of Lamerica. When Gino finally gets through to Fiore on the phone, he learns that the scam has failed, they are in deep trouble, and he and Spiro are both out of a job. Of course Spiro says he knew it all along. Old Spiro is the pivot point of the film. At first he appears a doddering derelict, worse than a bum, covered with dirt, inarticulate and almost blind, clearly crazy. When asked his age he holds up his fingers twice, and you realize he thinks he's twenty -- the age he was when he was first imprisoned. But strangely somehow inside him there is a young man who seems slowly to be coming out. Gradually he emerges as a figure of great humanity and energy and hope, more stalwart than tragic or confused. The first disaster is that Spiro disappears from the nuns' institution where they have left him. After being a prisoner for fifty years, he wants only to escape. Gino finally finds him, and takes him on a journey to the coast in a jeep, but once they're out in the boonies, Gino is lost. He runs around looking for Spiro, and when he gets back to the car, it's been stripped of its tires. He calls for the police, but he speaks only Italian. Does anyone understand? They only stare at him. The staring faces are brushes Amelio paints with, and at the end, on a boat heading for Italy at last -- though Spiro thinks they're heading for America -- the director gives us an awesome series of faces that are worthy of Paul Strand or the best of the FSA photographers of the Dust Bowl of the Thirties: faces that speak volumes. Struggling to get to this point, Gino and Spiro begin to communicate. It turns out Spiro is really a Sicilian named Michele Talarico and he came to Albania as a soldier during the war. He thinks he is a young man, with a young wife and a child born four years ago.. Gradually Spiro comes to life. He is strong, perhaps more resilient than the young Gino. But as Gino grows more haggard -- Lo Verso's dark, southern Italian face is deeply expressive -- he grows more Italian and closer to Spiro and to the most human and beautiful and real people of the world -- the poor, those who have nothing but hope and the will to go on. Like the great Italian neorealist filmmakers of the Forties and Fifties from whom he has learned so much, Amelio uses real places and real people with almost miraculous skill. What's all this mean? First of all, it's an affirmation of the sheer power of poverty. And chaos. They're forces of nature more powerful than Fiore's pathetic, mean-spirited scam. But the fact that Spiro's insanity comes to seem beautiful and hopeful shows that the film isn't to be taken too literally. It's more a powerful myth than a message that it has to convey, and it's better to dwell on its gut-wrenching sadness than to analyze too much what it has to say about Albania, about colonialism, about rich and poor nations and economic exploitation. Lamerica is an amazing film, and clearly sets Amelio apart as the most powerful and humanistic Italian filmmaker working today. (The riveting and soulful Lo Verso is equally central to Amelio's saga about Italy in the post-war period, The Way We Laughed/Così ridevano, 1998, and his 1992 Stolen Children/Ladri di bambini). We don't know what will happen to Gino. He may not go to Sicily to pick olives as Spiro suggests. But he won't ever rejoin Fiore and his scams.",
         "Amelio stile of directing amazes me everytime more and more. A powerful movie, being very realistic and documentary. Once again, Enrico Lo Verso acting and leading the movie is great. This movie was filmed few years after the government was overthrown and I consider AMelio to be brave with this theme and from my understanding he reflected what happened in a realistic way.",
         "I thought this was an incredible film with a story that was in many ways simple, yet complex in dealing with redemption. An Italian swindler goes to Albania to make a few quick lire, only to get swallowed up by the depth of the Albanian situation.",
         "\"Lamerica\" takes the audience through the devastation of post-communist Albania as it follows the odyssey of a young Italian man who has come to make some easy money but finds himself caught up in the same curious mix of hopeful despair etched into the faces of people he's come to swindle. The film has little plot, the feel of a documentary, and most of the scenes are perfunctory. Nonetheless, \"Lamerica\" will beg a strange fascination from those who find grizzled realism interesting.",
         "In many ways a more sophisticated, complex, political re-telling of Amelio's great 'Stolen Children'. In this case two Italians go to just post communist Albania to try and make a killing setting up an exploitative factory, taking advantage of the desperately poor local workers. They hire a half- crazed old man to be the necessary local figurehead. (The local is amazingly played by a non- actor.) Then, of course, everything in their plan goes wrong. Tremendously moving, with only brief whiffs of manipulation or easy emotion. A portrait of colonialism and capitalism crashing into communist bureaucracy, and leaving behind shattered souls.",
         "Rather abruptly - and permanently - veering from its storyline at first confused this viewer. The suggested plot seemed so pregnant with intrigue, fun, potential, etc. Then the plot shifts and the impact such has on the two main characters is, I have concluded, what makes LAMERICA a good movie. LAMERICA is about a person's comprehension of values as well as the impact of age and wisdom upon such. I concede that the film uses rather ordinary plot devises of violent setting, young vs. old, etc., to contrast the characters' predicaments. But LAMERICA's lessons are taught without moralizing or melodrama or preachy dialog. For example, a death during the film comes about in mundane fashion; i.e., entirely without tragedy, violence or emotion. It takes reflection on the entire film to recognize its importance, place, etc. The same can be said about bits of dialog and brief encounters throughout the film: Much as in real life, their importance, the lesson they impart, is only understood when stepping back to look at the big picture.",
         "This movie started slowly for me but got better and better as it progressed. It's the story of a couple sleazy Italian con men who were looking to strike it rich in post-Communist Albania. They were creating a fake company and needed a stooge to be their Albanian CEO. For this, they want someone who is completely forgotten, so they go to a hell-hole that had been a prison for political prisoners and pick out an addle-brained man who'd been incarcerated there for almost 50 years. The way this poor soul is treated is pretty pathetic, however the irony occurs when the younger crook is stranded in Albania and his car is vandalized. He THINKS everything will be fine since he is a foreigner. But, he too becomes a refugee like so many Albanians. At this point, the \"crazy old man\" shows he isn't quite as crazy as you'd thought and despite his incarceration, he has not lost his humanity--all this being revealed as the Italian jerk slowly loses everything he has. It's an amazing juxtaposition and this makes this strange movie so worth seeing.",
         "This Italian film is actually set behind the fall of dictatorship in Albania, a country once part of Soviet rule. LoVerso's part in the movie as one of the protagonists is wonderfully acted. The first film I had seen him in was Il Ladro di Bambini. LoVerso takes his characters and challenges them, creating deep personalities that continue to develop throughout the film. I would recommend this film solely based on the wonderful acting by all actors in the film."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Alia Film",
         "Cecchi Gori Group Tiger Cinematografica",
         "Arena Films"
      ],
      "summaries": [
         "Two Italian racketeers come to Albania just after the fall of the communists to set up a fictive firm and pocket the grants. They need a stooge. They choose an old one in a jail : Spiro. But the youngest italian, Gino, once alone with Spiro, encounter a few problems. Far from his roots, loosing his identity in deep Albania, he begins to change...",
         "This movie depicts a lesson of history before, during and after Mussolini, a transition between socialism and communism, poverty and early technology in the humanity's timeline. It's a beautiful compilation of both worlds, Italy and Albania, on social conditions, promise of a better future, business partnership, adaptation to a new world. Characters speak either Italian or Albanian or both. Spiro Tozaj, the Albanian name of a dual character, is a political prisoner - a true Italian World War II prisoner who admits he deserted to be with his family - lost track of time and events of the world. In his mind, he still has a boy, Giovanni, of 3-4 years old, and a wife, Rosa. In reality, about 50 years have elapsed. Originally from Sicily, he ended up in an Albanian prison and eventually, a home for elderly people. The racketeers are erroneously recruiting him thinking he's an honest Albanian with no relatives, the perfect candidate for business, giving hope to local Albanians for an honest business of a shoes company, Alba Calzature, a money laundering business. While Gino, the Paisa' (short for 'paisano', peasant, as Spiro calls him) starts an adventure on Albanian territory trying to bring the old man to Italy, he learns that his true name is Michele Tallaricoof, a Sicilian. Personal trouble comes upon both when they separate, the old man almost losing his life in an incident where children almost asphyxiated him with smoke. As he's trying to move on towards Italy, other incidents along the way make the characters grow, communicate and discover true introspection into what life really is. Roles shift onto making the old man become the wise one who finally speaks and gives words of wisdom to the young ones. Trouble comes Gino's way when the business falls apart and he ends up in a jail himself. His precious freedom is negotiated for the head of a corrupt Albanian, Dr Kruja - Mr Croce - and his eventual departure to America brings Gino new endeavors, hopes, dreams and introspection into his own solitude. God made both Catholics meet again on the ship to America where they realize they need each other the most."
      ],
      "budget": 0
   },
   "movielensId": 53,
   "movielens": {
      "languages": [
         "shqip",
         "Italiano"
      ],
      "releaseDate": "1994-01-01",
      "dvdReleaseDate": "2004-05-25",
      "directors": ["Gianni Amelio"],
      "runtime": 116,
      "movieId": 53,
      "title": "Lamerica",
      "mpaa": "",
      "actors": [
         "Enrico Lo Verso",
         "Michele Placido",
         "Piro Milkani",
         "Carmelo Di Mazzarelli",
         "Elida Janushi",
         "Besim Kurti",
         "Marjeta Ljarja"
      ],
      "imdbMovieId": "0110299",
      "originalTitle": "Lamerica",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["3Fd6ZlgOFqs"],
      "plotSummary": "Fiore, an Italian conman, arrives in post Communist Albania with Gino, his young apprentice, to set up a shoe factory that will never open. The con requires a native Albanian, so they designate Spiro, an impoverished and confused former political prisoner as chairman of the board. When Fiore returns to Italy to get government funds for the project, Spiro unexpectedly disappears and Gino sets out on a journey to find him. The search leads him to discover Spiro's tragic personal history and witness Albanian poverty firsthand.",
      "tmdbMovieId": 49133,
      "avgRating": 3.70312,
      "releaseYear": "1994",
      "numRatings": 160,
      "posterPath": "/407nYlg60AOj95lqDZ4tvUTTm1k.jpg"
   }
}