{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "social worker",
            "id": 2438
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "orphanage",
            "id": 6783
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "small village",
            "id": 194430
         }
      ],
      "imdb_id": "tt0111102",
      "video": false,
      "title": "Second Best",
      "recommendations": [
         62819,
         81949,
         96092,
         48862
      ],
      "backdrop_path": "/3CPjwSQz8xFAkfoTspmEUQYRZse.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Graham Holt",
               "gender": 2,
               "credit_id": "52fe4a1ec3a36847f81baa8f",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Jimmy",
               "gender": 0,
               "credit_id": "52fe4a1ec3a36847f81baa93",
               "name": "Nathan Yapp",
               "profile_path": null,
               "id": 1033782,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe4a1ec3a36847f81baa97",
               "name": "Keith Allen",
               "profile_path": "/qLaiCqSlCrcGWETlMWQ4VTJTo9Z.jpg",
               "id": 20056,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe4a1ec3a36847f81baa9b",
               "name": "Jane Horrocks",
               "profile_path": "/1Uru2m9LC2ptTa67bEIh1TEgl6r.jpg",
               "id": 34902,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Bernard",
               "gender": 2,
               "credit_id": "52fe4a1ec3a36847f81baa9f",
               "name": "Alan Cumming",
               "profile_path": "/5U7rmz20snvKB099P30IJu2nmRb.jpg",
               "id": 10697,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Uncle Turpin",
               "gender": 2,
               "credit_id": "52fe4a1ec3a36847f81baaa3",
               "name": "John Hurt",
               "profile_path": "/rpuH2YRLpxJjMxHq4T1QdOSVtlN.jpg",
               "id": 5049,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a1ec3a36847f81baa73",
               "name": "Chris Menges",
               "profile_path": null,
               "id": 8969,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a1ec3a36847f81baa79",
               "name": "David Cook",
               "profile_path": null,
               "id": 201866,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a1ec3a36847f81baa7f",
               "name": "David Cook",
               "profile_path": null,
               "id": 201866,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a1ec3a36847f81baa85",
               "name": "Sarah Radclyffe",
               "profile_path": null,
               "id": 18073,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a1ec3a36847f81baa8b",
               "name": "Simon Boswell",
               "profile_path": "/docJpHQG30F8wdMxKhQJpOuYkK0.jpg",
               "id": 7741,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.764362,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 103413,
      "vote_count": 9,
      "budget": 0,
      "overview": "The difficult relationship between a british postal officer and his adoptive son.",
      "similar": [
         20352,
         17663,
         14873,
         11773,
         8340,
         880,
         237614,
         21198,
         428642,
         890,
         283725,
         283550,
         283715,
         283547,
         283683,
         283714,
         283565,
         135195,
         283709,
         283705
      ],
      "original_title": "Second Best",
      "runtime": 105,
      "poster_path": "/f3uKBkqwE0Gj8lity7JR5E7sUpl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Alcor Films",
            "id": 644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fron Film Production",
            "id": 37265,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-09-30",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chris Menges"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "David Cook",
         "David Cook"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111102/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAwMDE0ODczNzFeQTJeQWpwZ15BbWU3MDQ3NjgxMzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Hurt, Nathan Yapp, Keith Allen | See full cast and crew »"],
      "reviews": [
         "I rarely write reviews for movies. And having seen the other excellent reviews, mine is hardly needed. But I stumbled across this movie and felt I had to comment on it. This is an excellent movie with wonderful acting, directing, writing, screen play, and filming. I saw the last 2/3 of the movie by accident and could not tear myself away from it. William Hurt and the boy actor (sorry - forgot the name) are thrown together by life's accidents and develop bonds for one another. The rough edges on each character are worn smooth as each accommodates the other and learns of the other's trials and humanity. The acting is superb and rarely gets in the way of the content - more to the point, the acting complements the story well. But what makes the movie special is the character development. The writing, directing, and screen play successfully convey the existential experiences of the actors as they develop and react to one another. A good song, a good poem, a good book - are made special if they are accessible - if they evoke within you the ring of truth and personal history. This movie communicated with me extremely well on a personal basis, on many plans at the same time. Every element of this film was well crafted. The movie is cerebral and touching - with very few rough edges. I couldn't recommend it more highly for an adult audience.",
         "This is an exquisitely poignant tale of a love-starved, troubled orphan boy and an emotionally incomplete man who has decided to reach out for what he wants most in life: a son. Jamie very much wants to love the kind man who wants to adopt him but is prevented from doing so by the promise he made to his biological father just before dad went to jail: to love him \"best in the whole world forever.\" In what may just be the greatest dramatic performance by a child ever captured on film (surpassing even that of Freddie Bartholomew in \"Captains Courageous\" who had held that title for that past 60 years), Chris Cleary Miles demonstrates a precocity which makes one wonder if he hasn't already overcome some great tribulation(s?) in his short life in order to give such a compelling performance. Alternately masochistic, loving, violent and affectionate, the range and depth of emotion he portrays are nonpareil. I am still having trouble believing it was only a movie! It is unfortunate that Miles never acted in another movie; on the other hand, when you start at the top you can only go down. Others have called this William Hurt's greatest role and I would have to agree. While his transformation from the stiff, detached loner to loving father was beautifully written in the book by David Cook, Hurt interprets this flawlessly. In fact you might say the film's brilliance was relatively easy on the heels of Cook's depictions. Nevertheless every scene in the movie is significant and the editing with the multiple flashbacks was excellent. Why this film did not win all kinds of awards is beyond me. \"Second Best\" is second best to none in its genre.",
         "Paul wrote a beautiful review with the proper amount of reverence towards what is in our culture almost a sacred subject, the father son relationship. This is the story of two such relationships, each one gone bad, and how the two survivors find the solution in each other and could find the solution in nobody else. The filmmakers also had a problem which needed a solution and found that in the cinematography, direction and marvelous acting and casting (several actors for each character at different ages) and music you'll remember long after the lights go up. Because it's such a small scale picture I would only give it a 9/10 and BenHur and Laurence of Arabia get a 10, yet they're no better, only bigger.",
         "The story theme rings true and shows the way. The world is still not a \"kid friendly\" place. It takes a very special adult and effort for a damaged child to re-bond with an adult. The single act that made it possible for James to finally re-connect was Graham taking in James' father. James needed that closure. I think one of William Hurt's best efforts. And Chris Cleary Miles gave a riveting performance. It's a shame he didn't do anything else. Simon Boswel's haunting theme and score was an added plus. I wish they'd make the movie available in the DVD format and re-release the sound track.",
         "David Cook, author of the novel of the same title and also involved in the film, is known for his sensitive and probing treatments of characters marginalized in society. After seeing the film, I made a point of searching for the book, and at long last spotted a \"galley proof edition\" in a used bookstore in Oxford. The picture is faithful to the novel-- if anything, excessively so. Much dialogue is reproduced intact. A number of small incidents and gestures which seem inconsequential or puzzling in the movie were revealed as symbols or evocations of episodes which the book had fleshed out. Directors themselves so immersed in every detail are at risk of assuming too much understanding from the audience, depriving them of just another few words, or a brief camera close-up, which would have put a point across coherently. But these are quibbles, for there is enough depth and quiet eloquence left here to call for a rare ten stars out of ten. This is the story of an unlikely relationship which succeeds as the mutual balm for unusual wounds. The man Graham and the boy Jamie both suffer profoundly from separation from their fathers-- physical separation in Jamie's case (his adored dad is in prison), emotional in Graham's. Each discovers that the other cherishes the memory of just a few days of filial closeness, shattered shards of supreme bliss sparkling in the dismal landscape of their emotional lives. Yet not only does Graham, a candidate to adopt Jamie, lack the primary qualification for a stepfather: a wife. He is a shy nerd with no obvious charisma whatsoever for a hyperactive, street-wise, cynical kid. But traumas in his past have stamped this boy with a vehement misogyny. As little as he fancies anyone presuming to take his father's place, he craves having a stepmother even less. Graham's bachelorhood is a relative advantage. Graham proves himself gradually with humility, honesty, and a quality of unfailing respect for the person struggling underneath Jamie's sullenness which one can only describe as reverence. A \"special-ed\" teacher of my acquaintance called Jamie (and Chris Cleary Miles' passionate characterization) very realistic, and pronounced Graham (as brought to life masterfully by William Hurt) \"a genius\" in his approach to the developing relationship. While some will complain that this film drags, others will value its quiet atmosphere in which heart-codes are patiently decrypted. The more important the dialogue is, the likelier it is to approach whispers. One crucial central scene, barely audible, as the haunting strains of the score's \"rift\" theme echo away more faintly still, never to be heard again, must be one of the tenderest moments ever captured on celluloid. Perhaps Graham has been plagued by a touch of agoraphobia. The cinematography deftly suggests this world view: interiors of small rooms, fussy wallpaper, obtrusive props, brilliant curtains covering the windows; exteriors somehow painting scenes of ravishing beauty with brushstrokes of vague terror. Graham Holt is an unlikely hero, but a true one. If more people treated one another the way he does, the world would be a better place.",
         "I've read the other reviews posted here and concur with all of them. The film triumphs in its realistic depiction of two broken hearts, Jamie's and Graham's. I think, in order to appreciate the story, one must have somehow experienced the psychic shock of childhood abandonment, either emotionally or by outright physical abandonment. The pleasure of watching this film, aside from the acting and cinematography, is having the sense that it will work out okay. At the very end, when Jamie walks briskly to catch up with Graham, slips his hand into the grownup's hand, and then walks much more slowly, one can see in their stride together the fulfillment each has received. I rewound the film at that point to see that scene again.",
         "This is a moving, touching film. For me a little bit frightening too. In the real world there are some people, who behave like Holt. (Unimportant, but funny that the word \"Holt\" means Dead in Hungarian which is my first language.) This movie is like a therapy, an advice for unhappy, lonely people. A believable film is a great pleasure nowadays, but if you meet your own life face-to-face in a script, well... it's pretty scary. If you pay attention good enough, it changes your life! Thank God for this film!",
         "William Hurt is an interesting actor. Although he has made many money making Hollywood films, he seems to enjoy also making small artistic films that MUST bring him a lot less money but perhaps more personal satisfaction. Among these many \"little\" films he has done is Second Best--an odd little film well worth watching. Is it a perfect film? Certainly not. At times, it is a bit slow and emotionally sterile--though this is needed due to the type man Hurt is portraying. For some inexplicable reason (it would have been nice to know more about WHY), Welshman Hurt decides to take in a hard to adopt boy with the intention of adopting him. Because the boy has lots of emotional baggage, they do not easily bond and their relationship is strained. However, just because there are these awkward moments, do not stop watching--the payoff is there and the characters are much more realistic (with all their foibles) than what you are usually given in a typical movie!",
         "William Hurt is very believable as a west country postmaster and the adoption process is taken apart in a sympathetic and believable manner. The film has charm and pace while dealing with a difficult subject. If it were to be made now would there be a different emphasis in the light of current obsessions with protecting children from paedophiles?",
         "Second best is a touching and moving masterpiece directed by Chris Menges . The plot reminded me of another great British movie \u0096 \"Dear Frankie \".I guess it is that father \u0096 son relationship that makes movies like these two so special. The loyalty of the son both in the characters of Jimmy played by Nathan Yapp and Graham Holt (William Hurt) is touching and I am not ashamed to admit that there were moments of this movie which truly brought tears to my eyes. One other reviewer wrote: \"Chris Cleary Miles' apparently initial screen performance as the troubled youth is near amazing.\" And I just couldn't agree more with that \u0096 the acting of Chris Cleary Miles, William Hurt and for that matter all the other actors in this movie is first class \u0096 their gestures, the words they say , the way they say them \u0096 you just have to watch it to experience the movie \u0096 because that is what you are going to get an unforgettable experience. The flashbacks moments (the memories of the little Jimmy) were very careful chosen and I felt really weird watching them , knowing that there is something more hidden out there\u0096 this feeling stayed with me until the final scenes in which these flashbacks became more revealing \u0085 There is also a lot of symbolism is Second Best \u0096the scene in which the boy looks at the man who wants to adopt him trough a broken window is just one example and if you watch it more than once you will sure notice many other symbols \u0096 the letter, the scars ... etc You just couldn't watch the movie without noticing how much the music contributes to it \u0096 piano or guitars, it fits the scenes really good - making the emotional impact they have on the viewer's powerful and overwhelming."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Alcor Films",
         "Fron Film Production",
         "Regency Enterprises"
      ],
      "summaries": ["Graham Holt is a lonely middle-aged man who runs a postal substation in a small village in England. He decides to adopt a son. James is the troubled youth he gets with the assistance of social worker Debbie. James has been in an orphanage for years since his mother committed suicide. He adores his outlaw father John, sent to prison not long after the mother's death. Can James learn to love Graham? Can Graham settle for being second best?"],
      "budget": 0
   },
   "movielensId": 530,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-30",
      "dvdReleaseDate": null,
      "directors": ["Chris Menges"],
      "runtime": 105,
      "movieId": 530,
      "title": "Second Best",
      "mpaa": "",
      "actors": [
         "William Hurt",
         "Nathan Yapp",
         "Keith Allen",
         "Jane Horrocks",
         "Alan Cumming",
         "John Hurt"
      ],
      "imdbMovieId": "0111102",
      "originalTitle": "Second Best",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "tI3PqOgC0Q4",
         "mJNjXDI1RVc"
      ],
      "plotSummary": "The difficult relationship between a british postal officer and his adoptive son.",
      "tmdbMovieId": 103413,
      "avgRating": 3.02632,
      "releaseYear": "1994",
      "numRatings": 38,
      "posterPath": "/f3uKBkqwE0Gj8lity7JR5E7sUpl.jpg"
   }
}