{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0111194",
      "video": false,
      "title": "A Simple Twist of Fate",
      "recommendations": [
         79783,
         16814,
         102947,
         20468,
         17362,
         52734,
         18913,
         77073,
         36278,
         63988,
         96333,
         19855,
         58434,
         34014,
         27332,
         61168,
         48249,
         11221,
         61651,
         25665
      ],
      "backdrop_path": "/3SzLf92VfLrg8qSVmUzad9VVEKO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael McCann",
               "gender": 2,
               "credit_id": "52fe464fc3a36847f80f8001",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Tanny's Playmate",
               "gender": 1,
               "credit_id": "56409a01925141705f001027",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "John Newland",
               "gender": 2,
               "credit_id": "52fe464fc3a36847f80f800b",
               "name": "Gabriel Byrne",
               "profile_path": "/lFIH4De52Eg21m7pScPMXezZDUh.jpg",
               "id": 5168,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nancy Lambert Newland",
               "gender": 1,
               "credit_id": "52fe464fc3a36847f80f800f",
               "name": "Laura Linney",
               "profile_path": "/unRRWITXrZsbk9iTmnjVxd6yZv9.jpg",
               "id": 350,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "April Simon",
               "gender": 1,
               "credit_id": "52fe464fc3a36847f80f8013",
               "name": "Catherine O'Hara",
               "profile_path": "/nDlIwrkmvz11mwsKSTAbM2dfDgC.jpg",
               "id": 11514,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tanny Newland",
               "gender": 2,
               "credit_id": "52fe464fc3a36847f80f8017",
               "name": "Stephen Baldwin",
               "profile_path": "/w2nZjBsEsjboQDZJXEkysuGgue4.jpg",
               "id": 9045,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe464fc3a36847f80f8007",
            "name": "Gillies MacKinnon",
            "profile_path": null,
            "id": 33405,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.395455,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43535,
      "vote_count": 31,
      "budget": 0,
      "overview": "When Michael McCann is thrown over by the woman he loves, he becomes something of a misanthrope and a miser, spending all of his spare money on collectible gold coins. Living in the same town is an affluent family with two sons: John and Tanny. Tanny's a wild boy, whom John cannot control, and one night he breaks into McCann's house, and steals the gold and disappears, which nearly confirms McCann's distrust of mankind. But then, a mysterious young woman dies in the snow outside McCann's house, and her small daughter makes her way to McCann's house and into McCann's life and heart. He names her Matilda, and raises her, finding companionship and a new joy in life with his adopted daughter. But the secret of Matilda's birth may tear them apart.",
      "similar": [],
      "original_title": "A Simple Twist of Fate",
      "runtime": 106,
      "poster_path": "/lxbPaaVF5zdknuf04iTDwQej7GM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1994-09-02",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "A twist of fate brought them something wonderful... Each other!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gillies MacKinnon"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "George Eliot",
         "Steve Martin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111194/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1ODY3Njc4Nl5BMl5BanBnXkFtZTcwNzE4MDYxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Martin, Gabriel Byrne, Laura Linney | See full cast and crew »"],
      "reviews": [
         "I had never even heard of this movie until a couple of years ago. This is yet another stellar movie from the tremendous class of 1994. I was absolutely enthralled by this story, so I went and read the novel it was derived from, Silas Marner by George Eliot. It was a really good story as well, but Martin's adaptation was outstanding. He managed to modernize the story so it could be more meaningful to new audiences, and yet still preserved the heart and soul of the story. While the original story was good, the novel was difficult to read not just because of the time difference (it was written in 1861) but also because of Eliot's overly descriptive language, making a wonderful story fairly unapproachable to most people. For me, the most successful adaptations must start with a great story, then keep the best parts and lose the worst parts, while understanding and compensating for the differences between the mediums. Martin's screenplay excels at this, even surpassing Darabont's outstanding adaptation for The Shawshank Redemption. The acting in the movie was very good as well. There's just something about a gifted comedian playing a dramatic role. Kind of like the image of a clown crying, when someone you normally associate with happiness and laughter convinces you that they're sad, there's a finer point to it, it has more impact. (Think of Robin Williams in Dead Poets Society, Awakenings and more recently, Good Will Hunting). Steve Martin was convincing and provided a character that you could empathize with. Gabriel Byrne and Laura Linney were very good as they always are. The girls that played Mathilda were just right-extremely adorable and convincing, yet not so cute that you couldn't take it. This is one of my favorite movies and I highly recommend anyone who hasn't seen it give it a try.",
         "This film is so understated and underrated as to be in danger of completely disappearing from the radar screen. For Steve Martin to be in a non-Jerk type roll makes seeing this movie next to impossible for a great number of people. No, he's not acting weird. No, he doesn't have an arrow on his head. No, he isn't going for the laugh. This is Mr. Martin at his acting best. If you were impressed by his recent turn in 'Shopgirl' the do yourself a favor and go out of your way to find a copy of this movie. Are there times when humor finds its way into this movie? Oh yeah but for the most part there is nothing but good solid storytelling with excellent casting and an excellent script. See this movie if you want to see a wonderful character study acted out by a superb cast.",
         "Ok, let me set the record straight by saying that I have NEVER cried over ANY movie. That is, when I saw this, I ALMOST cried. The story begins in Washington DC in 1979, when music teacher Michael McCann is instructing his students, when his wife shows up and tells him that the baby is not his. The movie then flashes forward to 1984 Virginia, where he has become almost like a miser. Steve Martin (one of my fave performers, just read my reviews) turned in a stellar performance as Michael McCann. He had such a sweet personality at the start of the film, then all of a sudden he became a lonely miser, hoarding his coins, until Billy Baldwin, my most loathed of all Baldwins-besides Daniel (I LOVE Steven and Alec) steals them. Then, a beautiful toddler comes to his house, and he immediately takes her in. I love his chemistry with young Mathilda, who went from being a cute baby to a beautiful young girl. Kudos to Alana Austin, who played Mathilda at 11. She was fabulous, and I think she is one of the best child actors I've seen in a long time. Now that I have seen this film, for my school's summer reading assignment, I am going to convince my Literature teacher to let me read \"Silas Marner,\" where this movie comes from. I hope I can. See this film. You'll be glad you did!!!",
         "Steve Martin is, and will always be, a comedian first and foremost. But everyone needs to do something different in their life and he does it well! Mr. Martin took the story of Silas Mariner and has updated it to a wonderful story. It's not a comedy movie because it's not a comedic book that it came from. I think that Mr. Martin has kept the feelings of loss and rebirth (for lack of a better phrasing) vibrantly alive in this adaptation. Steve Martin CAN do drama and he does it so well. The story and characters are rich. You are drawn in to the despair of the main character, feeling for him, but still wanting to kick him in the pants and tell him to get on with, not just life, but living. And when the opportunity to do so presents itself to him. It is a joy to watch him become human again. I could go on forever, but I'm only allowed 1,000 words. Not enough for this movie, so see for yourself what it is that makes Steve Martin not just a versatile actor, but a GOOD actor.",
         "I feel that Steve Martin acted well in this movie as well as adapting it. I've heard people comment that Martin was not made for this role, however I've seen him do worse in his natural genre, i.e. The Man With Two Brains. Watching the movie prompted me to read the book and it did not ruin the book. Maybe because the two stories are set in different era's, but I choose to believe that it is because Martin adapted the book nicely for the movie and that George Eliot wrote a good book. Viva la Steve!",
         "Steve Martin wrote, directed and starred in this film. And he did a great job! A heartwarming film about an adopted child, her adopted father, and some very unhappy rich people. Thank you very much Mr Martin",
         "It was only by a simple twist of fate that i saw this film, that twist being that there was nothing else worth watching on tv last night, and so i tuned in and watched this film, and really enjoyed it. Like so many people have commented, it is a nice change to see S M doing drama, i found that he added some very comical moments to the film (the weather ballon scene). This is a touching story that makes you happy. aaaawwwwwwwwww, sniff***sniff****",
         "Note: This doesn't really contain spoilers, but hey, one slip of the mouse could blacklist me. I just finished watching the outstanding Shopgirl and I couldn't help but think of this film. I've probably seen it around ten times. Only two or three times at home, but in high school I swear teachers showed it once or twice a year to kill some time. It didn't matter if we were reading Silas Marner or not. It has never gotten old. People seem to go into this movie expecting a comedy, but it's really not. It's a haunting and beautiful movie filled with imagery that I can still see in my head, even though I haven't seen the movie in a couple of years. I assume when this came out, it was largely ignored because it had the look and conventions of other lesser movies of the time. Besides, who would want to see a drama from Steve Martin? Now that it's years removed from the climate it was released, it can truly be appreciated for what it is. A true gem.",
         "This movie is one of the best that Steve Martin has done. The only people who wouldn't like this movie would have to be fans of Martin from The Jerk and The Man With Two Brains, neither of which movie I enjoy in the slightest. Thank the heavens that Mr. Martin broke out of his stereotype, and showed us he can REALLY act. Coming a long way from his thankfully bygone days as the Jerk, Martin shows us his tender side, in a touching portrayal of a bitter hermit saved by the love of an orphan child. While it was not the laugh a minute comedy I was mislead to expect by the promotions for this movie, I still enjoyed every moment of it. Warm, sad, happy, and wistfully funny, it's a movie that can be watched many times and not lose its magic. And the Austin sisters who portray Mathilda at 5 and 11 are absolutely wonderful, and are a perfect fit with Martin.",
         "I missed the first two or three minutes that would have included the credits and so did not realize that I would be watching George Eliot's moving novel. Although the movie was thoroughly modernized it took very little time for me to realize what I was watching. -- Much to my surprise and delight. I felt that George Eliot would have loved this movie. I give it a strong recommendation if you have read \"Silas Marner\". Those who have not, though, may find it contrived."
      ],
      "genres": [
         "Drama",
         "Comedy"
      ],
      "productionCompanies": ["Touchstone Pictures"],
      "summaries": [
         "Michael McCann is a man who feels totally betrayed by the world, after his wife revealed to him that their child was not his. A few years after his break-up we find him living alone in a small town. But, everything in his miserable life changes when he adopts a little girl whose mother died outside his house. After several years, the real father returns to claim the girl from Michael, thinking that she will be an advantage for his political career.",
         "When Michael McCann is thrown over by the woman he loves, he becomes something of a misanthrope and a miser, spending all of his spare money on collectible gold coins. Living in the same town is an affluent family with two sons: John and Tanny. Tanny's a wild boy, whom John cannot control, and one night he breaks into McCann's house, and steals the gold and disappears, which nearly confirms McCann's distrust of mankind. But then, a mysterious young woman dies in the snow outside McCann's house, and her small daughter makes her way to McCann's house and into McCann's life and heart. He names her Matilda, and raises her, finding companionship and a new joy in life with his adopted daughter. But the secret of Matilda's birth may tear them apart.",
         "His life was emotionally closed off from the world, until an orphaned baby showed up at his house."
      ],
      "budget": 0
   },
   "movielensId": 536,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-02",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Gillies MacKinnon"],
      "runtime": 106,
      "movieId": 536,
      "title": "A Simple Twist of Fate",
      "mpaa": "PG-13",
      "actors": [
         "Steve Martin",
         "Anne Heche",
         "Gabriel Byrne",
         "Laura Linney",
         "Catherine O'Hara",
         "Stephen Baldwin"
      ],
      "imdbMovieId": "0111194",
      "originalTitle": "A Simple Twist of Fate",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["e7bD5BNqfwY"],
      "plotSummary": "When Michael McCann is thrown over by the woman he loves, he becomes something of a misanthrope and a miser, spending all of his spare money on collectible gold coins. Living in the same town is an affluent family with two sons: John and Tanny. Tanny's a wild boy, whom John cannot control, and one night he breaks into McCann's house, and steals the gold and disappears, which nearly confirms McCann's distrust of mankind. But then, a mysterious young woman dies in the snow outside McCann's house, and her small daughter makes her way to McCann's house and into McCann's life and heart. He names her Matilda, and raises her, finding companionship and a new joy in life with his adopted daughter. But the secret of Matilda's birth may tear them apart.",
      "tmdbMovieId": 43535,
      "avgRating": 3.27522,
      "releaseYear": "1994",
      "numRatings": 783,
      "posterPath": "/lxbPaaVF5zdknuf04iTDwQej7GM.jpg"
   }
}