{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pastor",
            "id": 1499
         },
         {
            "name": "married couple",
            "id": 2587
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "painting",
            "id": 5918
         },
         {
            "name": "drawing and painting",
            "id": 6023
         },
         {
            "name": "blasphemy",
            "id": 161216
         }
      ],
      "imdb_id": "tt0111201",
      "video": false,
      "title": "Sirens",
      "recommendations": [
         107131,
         42371,
         42610,
         41667,
         16771,
         37718,
         17629,
         34101,
         125769,
         911,
         36351,
         21626,
         12656,
         18153,
         47749,
         44490,
         33303,
         34637,
         30194,
         15402
      ],
      "backdrop_path": "/b2YPH3b4wGTKq9mGo4DqbdtKpvh.jpg",
      "revenue": 7770731,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Anthony Campion",
               "gender": 2,
               "credit_id": "52fe44f29251416c75046787",
               "name": "Hugh Grant",
               "profile_path": "/lzCB9YN6MjGosh8v27o6omhSmjL.jpg",
               "id": 3291,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Estella Campion",
               "gender": 1,
               "credit_id": "52fe44f29251416c7504678b",
               "name": "Tara Fitzgerald",
               "profile_path": "/qpS1nff6LgwbWXzS14qsmW6YIOi.jpg",
               "id": 47615,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Norman Lindsay",
               "gender": 2,
               "credit_id": "52fe44f29251416c7504678f",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sheela",
               "gender": 1,
               "credit_id": "52fe44f29251416c75046793",
               "name": "Elle Macpherson",
               "profile_path": "/1XWYq795rjP2dQtH8PRC8GUI3aI.jpg",
               "id": 5590,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Giddy",
               "gender": 1,
               "credit_id": "52fe44f29251416c75046797",
               "name": "Portia de Rossi",
               "profile_path": "/sPf2YdfciJT2ov1i7xp0IqfMaKP.jpg",
               "id": 62010,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Pru",
               "gender": 0,
               "credit_id": "57c3eada9251414fd00002a3",
               "name": "Kate Fischer",
               "profile_path": "/a27N7IfiTR8ebcDlCSxsC1O1p6o.jpg",
               "id": 100518,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Rose Lindsay",
               "gender": 0,
               "credit_id": "57db2ce0c3a36816cf000026",
               "name": "Pamela Rabe",
               "profile_path": "/xVkyLuupFcjv92hiiCgHYCCogLU.jpg",
               "id": 217137,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Lewis",
               "gender": 2,
               "credit_id": "57db2cee92514167eb000025",
               "name": "Ben Mendelsohn",
               "profile_path": "/nAeZkSUXh9CUAUq1cFAg77rZLIS.jpg",
               "id": 77335,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Tom",
               "gender": 2,
               "credit_id": "57db2cf6c3a36816cf00002b",
               "name": "John Polson",
               "profile_path": "/rsjpQFAvQSo05HflPSCODCCbYFl.jpg",
               "id": 15337,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Devlin",
               "gender": 0,
               "credit_id": "59b3d2979251414a33013b1c",
               "name": "Mark Gerber",
               "profile_path": null,
               "id": 186418,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f29251416c7504679d",
               "name": "John Duigan",
               "profile_path": "/bLrx4OQz5g1RnlLQc9ungQ4XKqR.jpg",
               "id": 72624,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f29251416c750467a3",
               "name": "Justin Ackerman",
               "profile_path": null,
               "id": 72626,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f29251416c750467a9",
               "name": "Sue Milliken",
               "profile_path": null,
               "id": 72628,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f29251416c750467af",
               "name": "Rachel Portman",
               "profile_path": "/AkMflxC3EkbWuyPoltQ406EJvue.jpg",
               "id": 3562,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f39251416c750467b5",
               "name": "Geoff Burton",
               "profile_path": null,
               "id": 72629,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f39251416c750467bb",
               "name": "Humphrey Dixon",
               "profile_path": null,
               "id": 12759,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f39251416c750467c1",
               "name": "Robert Jones",
               "profile_path": null,
               "id": 4584,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f39251416c750467c7",
               "name": "Hans Brockmann",
               "profile_path": null,
               "id": 9038,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f39251416c750467cd",
               "name": "John Duigan",
               "profile_path": "/bLrx4OQz5g1RnlLQc9ungQ4XKqR.jpg",
               "id": 72624,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.165128,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 12519,
      "vote_count": 37,
      "budget": 0,
      "overview": "In 1930s Australia, Anglican clergyman Anthony Campion and his prim wife, Estella, are asked to visit noted painter Norman Lindsay, whose planned contribution to an international art exhibit is considered blasphemous. While Campion and Lindsay debate, Estella finds herself drawn to the three beautiful models sitting for the painter's current work, freethinking Sheela, sensual Pru and virginal Giddy.",
      "similar": [
         263472,
         509885,
         12627,
         1259,
         3482,
         12225,
         39452,
         25313,
         134673,
         296449,
         38651,
         117233,
         411678,
         71945,
         151923,
         155526,
         84997,
         85519,
         38730,
         348799
      ],
      "original_title": "Sirens",
      "runtime": 98,
      "poster_path": "/ch1xbOAsBCYWbBio6OaBzcCkmld.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sarah Radclyffe Productions - Sirens Limited",
            "id": 25158,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Screen Finance Ltd",
            "id": 25159,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Samson Productions II",
            "id": 25160,
            "origin_country": ""
         }
      ],
      "release_date": "1993-10-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "In the 1930s, an artist and his models scandalized a nation with their controversial paintings. For a young couple, meeting them was the experience of a lifetime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Duigan"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["John Duigan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111201/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2NDQzNTYwMV5BMl5BanBnXkFtZTcwOTQ1MTEyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Hugh Grant, Tara Fitzgerald, Sam Neill | See full cast and crew »"],
      "reviews": [
         "Excellent entertainment value (for those who don't seek perfection in every fictional accounting of an event). You either like it or you don't! For those who didn't like and posted here, I am surprised you took such elaborate measures to critique it to the umpteenth degree. Had the movie been heralded as \"The Greatest Movie Ever Made\", I would better understand your criticism. However, since it was not, it doesn't really deserve the harshness of some of the posts in here. If your expectations were not fulfilled, its not the fault of the movie! And I'll bet dollars to do-nuts that the majority of the people who went to see this movie went to satisfy their curiosity regarding the nudity. Of all the scenes in this flick that have been talked about in these postings, the most obvious tongue in cheek scene has been overlooked. At the end, Lindsay walks into a building and tosses a hammer to the \"blind\" man sitting on a cot and says 'lets get to work'............the \"blind\" man deftly catches the hammer and gets up. For all those whose comments are detracting, at least give the author a little more credit for inserting that, so obvious, yet unmentioned.",
         "While this film is often not taken seriously because of its explicit nudity, it is in fact one of the most thought-provoking commentaries on religious values I have ever seen on the screen. This film provides us with the stark contrast of the repressed preacher from London and the artist's three models in rural Australia, a throwback to Shakespeare's \"Green World.\" The fulcrum of this contrast is the preacher's wife, being pulled in both the oppressive, \"moral\" direction by her upbringing and her husband and the free and expressive direction of the artist. The breathtaking cinematography and stunning visual symbolism of this film contribute to make it into a powerful attack on the Christian moral code that dominates western thinking. I have been scoffed at on more than one occasion for praising Sirens, but I left the theater questioning my own views about what is and is not moral. The fact that this film's sexual content seems to invalidate it as art in many people's eyes merely underscores the value of its message. Along with Sling Blade, Sirens to me stands as the most provocative film about morality made in the 1990's. A solid 8 on a scale of 1 to 10.",
         "I had never heard of this film before I saw it on television one night. Luckily I saw it in Australia and it wasn't edited for content. I found it refreshing and intelligent. Set in the 1920's, it's about a reverend and his wife who travel to the Outback of Australia to \"tame down\" an artist (played well by Sam Neil) who has been creating \"lewd\" paintings. In the end, the film successfully criticizes religion's hang ups about sex. The reverend, of course, plays the part of conservative who is against these paintings that he deems are pornographic. During the course of the film he has several opportunities to explain his objections. While the film ultimately suggests that he is wrong, it still allows us to understand the reverend's point-of-view and perhaps even sympathize with it. The most remarkable thing about this character was his \"some things are best left untold\" stance concerning his wife's misbehaviors. This was a brilliant unexpected twist for me. At no point in the movie is the reverend made out to be a villain. Rather, he is presented as an intelligent and forgiving man, who just happens to be conservative about sex. With that said, I do not believe criticizing religion's view of sex was the main purpose of this film. The true story -- related but not the same -- was about the reverend's wife finding her own repressed sexuality while also well-aware of her husband's views which she initially shared. She is the heroine of the film. She makes a journey, encounters inner conflict, and returns changed by her experiences for the better (or we are led to believe). Any review of Sirens would be incomplete if it failed to comment on the sex scenes. They are explicit but nothing to be alarmed about especially considering this film targets a purely adult audience. The sex scenes are tastefully done even if they are built on lust instead of love. If I may venture an opinion, I think most women will find this movie very erotic. Take for instance, the perpetually bare-chested muscular blind guy. This character fulfills no other purpose than to incarnate female sexual desires. Men however will not find this film very arousing. It explores the sexual desires of women not men. But there are plenty of beautiful naked women to kept them interested even if the story doesn't. But as a man, I enjoyed the movie too. (I can't even recall any film attempting to explore men's sexual desires artfully at this moment...) In summery, a very good film that is thought-provoking and well-done. 7/10",
         "\"Sirens\" seems to have touched a nerve here. Some reviewers dismiss it as derivative soft-core drivel. Others love it. It probably helps to know that there's little derivative about the story-it's based on real people and a real incident. Sam Neill's character--Norman Lindsay--was real. Lindsay, a prolific artist and novelist, was also a libertine living a Hugh Hefner lifestyle when the rest of the world was awakening from the Victorian Age. \"Sirens\" was filmed at the Lindsay home and gallery, a 40-acre estate now run by the Australian National Trust. The artworks are all Lindsay's. And the storyline is based on an incident in which the Anglican Church dispatched a cleric to convey concerns about \"The Crucifixion of Venus.\" As for the plot, it's simply a humorous retelling of what might have been--with lots of voluptuous nudes and erotic symbolism tossed in for good measure. Yes, it's all quite predictable. You know five minutes into the film that the Converters will become the Converted. But it's a fun ride getting to that inevitable destination. `Sirens' is not for everyone. If full-frontal male and female nudity offends, you will be offended. If ridiculing the Church or its values offends, you will be offended. And if the notion that the cure for a boring marriage is a little extra-marital dalliance offends, you will truly be offended. Otherwise, it's a little erotic gem and a great way to start an even better evening. :)",
         "I personally believe this film is \"so\" subtle that it cruises under the scope of the average person - no insult intended! So many say they \"liked this film but...\" just goes to show how subtle this film really is. The photography is absolutely breathtaking. Film stills would make such a collage - oy! The acting is so right on and precise from each and every actor - the characters so well defined. The story is so exquisitely told...! During the whole movie, I kept expecting that statue (you know the one!) to take off walking. At the end, in the dream sequence when the statue stepped down from her pedestal and walked off into the mist, it nearly blew my mind! The way the story switches back & forth between conscious & unconscious day-to-day experiences so seamlessly amazes me. I fell totally in love w/this movie. I went thru a stage of watching it at least once a day for about 1 1/2 years - almost w/out fail! I am married to an artist. I have been his model. I am a woman. This film speaks to these matters with such clarity it's truly amazing. The transition Tara Fitzgerald's character goes thru in waking up to her womanhood is also an integral and major part of the story. The symbolism of the painting of the dual woman - and her being awakened each night by something in the natural/instinctive world calling her to consciousness. Lucid dreaming - becoming conscious thru internal knowledges calling forth her true nature. Please forgive me for not writing in complete proper syntax. I'm usually much better at expressing myself than this. But my relationship with this film is so very personal as to be abstract in tho't. Plus, I've never tried to express my feelings about \"Sirens\" before. I am almost shocked when I read that some of you think it was less than a \"10\"! \"Predictable\"?! Maybe you are more on the ball than I am and than I am giving you credit for. Pardon me please! This is \"one\" of the all time best movies ever - for me anyway! And - really! - when the preacher & his wife arrive - one of the first people to greet them on their mission is the old fella on the car bumper with,\"Get f***ed!\" Ya gotta love that!",
         "\"Sirens\" (title refers to Homer's sirens) tells of a young church official who is dispatched to visit a painter at his remote Aussie studio/estate to dissuade him from showing a painting of a nude on a cross. Hugh Grant plays the minister who, with his wife, encounters four beautiful models (one is the artist's wife) who bemuse him with their nude romps and sensual ways. Moreover, he's distressed by his wife's apparent interest in the unabashed frolicking. \"Sirens\" is a not too serious and somewhat sensual film with a thin plot. The film's appeal is in the moment-to-moment situations, the shangrila \"feel\" given to the harsh outback locale, the feminist antics of the bevy of babes, etc. Some will find the film tedious while others will be captivated by it's subtle charms.",
         "This film was funny and inspiring, with beautiful music by Rachel Portman (the \"only\" female composer in films in the \"top ten\" almost all male composer lists). Lots in this film will stay with you; especially the scenes with Australian animals and waters and snakes. Great philosophical and comedic themes as well. Bears watching a number of times to \"get it all.\" Thanks to everyone concerned for making this wonderful and funny film; first time I've smiled in a long time!",
         "I never heard of this film until the director for our theater company mentioned it as a possible project to adapt to live theater. I have to say when I first viewed the film I was a bit shocked for personal reasons. We have a fairly small group and if taken directly it would mean I would be playing one of the nude models. After studying the film's critiques and background I slowly came around to appreciate the film's merits, if not completely comfortable with the nudity. The point is that the nudity is not suppose to be comfortable from the audience point of view. The story takes place in an almost mystical world untarnished by outside influences and taboos. It is indeed a wonderful Eden. As an actress I had to be comfortable within the Eden created on stage, despite being uncomfortable in front of fellow \"actors\" and the audience. This has become one of my favorite films for helping me grow as an actress and as a member of the audience.",
         "This is truly one of my favorite films of all time. From the clever dialogue, lush scenery and amazing cinematography, I find it irresistable. While it was an admittedly erotic film, I found it extremely 'body/nude positive' in the sense that it showcased the true beauty of the human form and seemed to celebrate it. Also, the creative way that the director \"morphs\" scenes into and from noted works of art. Brilliant! The Soundtrack -- by Oscar winning composer RACHEL PORTMAN -- melded the at times ethereal emotions of many scenes and drew the viewer in. Again, irresistable... A few scenes that stand out: *Dream sequence of Tara Fitzgerald's character when she descends into the water at night in a gauzey Egyptian cotton nightgown and the three models emerge from the water and caress her. *The scene when the \"Statue\" comes to life and walks off into the illuminated night mist... This is a film NOT to be missed. One will not regret viewing it.",
         "Sirens is the story of a preacher named Anthony Campion(Hugh Grant) and his wife, Estella (Tara Fitzgerald) who are sent to investigate Normal Lindsay (Sam Neill), an artist who has been accused of painting lewd pictures. They find the artist living with his wife and three beautiful models, none of whom have any problem with nudity. Although shocked at first, Anthony and Estella find themselves being seduced by the beauty and sensuality around them and they are both changed forever by the visit. This is a sexy movie that isn't about the sex. It is filled with sweeping vistas, and has a wonderful score. It's a great movie to sit with your significant other and watch!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "British Screen Finance Ltd.",
         "Samson Productions II",
         "Sarah Radclyffe Productions - Sirens Limited"
      ],
      "summaries": [
         "A young reverend and his wife are on the way from England to Australia to minister to their flock. The bishop asks him to visit an eccentric artist prone to sexual depictions and requests that he voluntarily withdraw a controversial work call \"Crucified Venus\" from his show. The minister, who considers himself a progressive, is shocked at the amoral atmosphere surrounding the painter, his wife, and the three models living at his estate. The minister's wife is troubled also, and has to deal with latent sexual urges while trying to remain loyal to her husband.",
         "When a painting is termed blasphemous, a young minister and his wife visit the artist... and the three sexually playful models living with him."
      ],
      "budget": 0
   },
   "movielensId": 537,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-10-01",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["John Duigan"],
      "runtime": 98,
      "movieId": 537,
      "title": "Sirens",
      "mpaa": "R",
      "actors": [
         "Hugh Grant",
         "Tara Fitzgerald",
         "Sam Neill",
         "Elle Macpherson",
         "Portia de Rossi",
         "Kate Fischer",
         "Pamela Rabe",
         "Ben Mendelsohn",
         "John Polson",
         "Mark Gerber"
      ],
      "imdbMovieId": "0111201",
      "originalTitle": "Sirens",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["JTzat7vRdCQ"],
      "plotSummary": "In 1930s Australia, Anglican clergyman Anthony Campion and his prim wife, Estella, are asked to visit noted painter Norman Lindsay, whose planned contribution to an international art exhibit is considered blasphemous. While Campion and Lindsay debate, Estella finds herself drawn to the three beautiful models sitting for the painter's current work, freethinking Sheela, sensual Pru and virginal Giddy.",
      "tmdbMovieId": 12519,
      "avgRating": 3.16178,
      "releaseYear": "1993",
      "numRatings": 3545,
      "posterPath": "/ch1xbOAsBCYWbBio6OaBzcCkmld.jpg"
   }
}