{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "con man",
            "id": 3202
         },
         {
            "name": "new york city",
            "id": 14512
         },
         {
            "name": "art",
            "id": 14893
         },
         {
            "name": "art dealer",
            "id": 155795
         }
      ],
      "imdb_id": "tt0108149",
      "video": false,
      "title": "Six Degrees of Separation",
      "recommendations": [
         10337,
         91217,
         54087,
         9440,
         12280,
         118915,
         9941,
         48249,
         14667,
         47676,
         2321,
         13703,
         47817,
         10786,
         61280,
         10551,
         40509,
         41588,
         84278,
         40962
      ],
      "backdrop_path": "/9bqgNqlwBn2gEjFAMeQUqgXOWqn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e020081",
               "name": "Will Smith",
               "profile_path": "/5V4OKHQpIEffF9rqgzGYK4TNaGg.jpg",
               "id": 2888,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "John Kittredge",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e020085",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Louisa Kittredge",
               "gender": 1,
               "credit_id": "52fe4462c3a368484e020089",
               "name": "Stockard Channing",
               "profile_path": "/5UFMOfbzod42UiPUna59Ch1e37a.jpg",
               "id": 8893,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Geoffrey Miller",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e02008d",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kitty",
               "gender": 1,
               "credit_id": "52fe4462c3a368484e020091",
               "name": "Mary Beth Hurt",
               "profile_path": "/A1Whvk91g7uMZHjRX5rdxJsofeY.jpg",
               "id": 54782,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Trent Conway",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e020095",
               "name": "Anthony Michael Hall",
               "profile_path": "/eQnkUzHVrO69bQ08W82Qa9idJxp.jpg",
               "id": 1904,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "52fe4462c3a368484e020099",
               "name": "Heather Graham",
               "profile_path": "/rHIEhPAnZQn8BTbB1EVQ5ggEOX7.jpg",
               "id": 69122,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e02009d",
               "name": "Anthony Rapp",
               "profile_path": "/a9SBIDqSXkJaxJHqDaHXNkLhOUs.jpg",
               "id": 6165,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Doug",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e0200a1",
               "name": "J.J. Abrams",
               "profile_path": "/uiEVOx3QclxnN76t8PU6v5IcUUP.jpg",
               "id": 15344,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Adele",
               "gender": 1,
               "credit_id": "52fe4462c3a368484e0200a5",
               "name": "Kelly Bishop",
               "profile_path": "/rXjKYHafK17IiqgjWvmZYdmpdo9.jpg",
               "id": 728,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Rick",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e0200a9",
               "name": "Eric Thal",
               "profile_path": "/lJEMlle09Ux6hKBhCpK2nNaglOP.jpg",
               "id": 53574,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Larkin",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e0200ad",
               "name": "Bruce Davison",
               "profile_path": "/kYFBIffblcsbLMITDZYHhVf5c9f.jpg",
               "id": 52374,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Dr. Fine",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e0200b1",
               "name": "Richard Masur",
               "profile_path": "/w8qQdmxLRRSXNXkjHKHlY5vawXG.jpg",
               "id": 15416,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e0200b5",
               "name": "John Cunningham",
               "profile_path": "/mGwPTNlYQINjvCrQn0ZoAMCAPge.jpg",
               "id": 167561,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Detective",
               "gender": 2,
               "credit_id": "52fe4462c3a368484e0200b9",
               "name": "Daniel von Bargen",
               "profile_path": "/fFiiZCvBCqQ4xmCzYpMJQ7xboP3.jpg",
               "id": 1473,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Mrs. Bannister",
               "gender": 0,
               "credit_id": "52fe4462c3a368484e0200bd",
               "name": "Kitty Carlisle",
               "profile_path": "/i1Zf471Cjxvr9mB9sy7Bdw2aYiv.jpg",
               "id": 121019,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Polly",
               "gender": 1,
               "credit_id": "573c5666c3a3687dbf001150",
               "name": "Maeve McGuire",
               "profile_path": "/ui57yBr0GsAPUXcvw5SzOrsdPHz.jpg",
               "id": 1217963,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4462c3a368484e020077",
               "name": "Fred Schepisi",
               "profile_path": "/gN30W0bFd4p55fiCT3oeBFVJqs9.jpg",
               "id": 64061,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4462c3a368484e02007d",
               "name": "John Guare",
               "profile_path": null,
               "id": 87025,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 4.915358,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23210,
      "vote_count": 91,
      "budget": 0,
      "overview": "The story of a young, gay black con artist who, posing as the son of Sidney Poitier, cunningly maneuvers his way into the lives of a white, upper-class New York family.",
      "similar": [
         18487,
         306819,
         269795,
         968,
         210860,
         509885,
         1429,
         12159,
         1281,
         9475,
         98566,
         44214,
         194662,
         76025,
         9277,
         9292,
         311,
         426,
         120467,
         152742
      ],
      "original_title": "Six Degrees of Separation",
      "runtime": 112,
      "poster_path": "/uBbjfRWu5Z9YbzC1LyvA0o1DeyZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/hNuGhsKVlmhnwSRcmOejDBDjh6w.png",
            "name": "New Regency Pictures",
            "id": 10104,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Maiden Movies",
            "id": 36889,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-12-08",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "For Paul, every person is a new door to a new world.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fred Schepisi"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "John Guare",
         "John Guare"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108149/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5ODk1NTI4NV5BMl5BanBnXkFtZTcwNDYzMjI3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Will Smith, Stockard Channing, Donald Sutherland | See full cast and crew »"],
      "reviews": [
         "A writer at the centre of one of the most elegant, entertaining, thoughtful and soulful tales to come out of Hollywood in a long, long time. John Guare's children are based , it seems, in real life people. How lucky for Guare to have found the great Fred Schepsi as their perfect foster father. Will Smith plays a man without identity, choosing one for himself, with such care, with such gusto that everyone remains enthralled, first of all us, the audience. Stockard Channing's Ouisa discovers a new side to her own self in front of our eyes. It is a performance of guts and beauty. Donald Sutherland's Flan is a first for the movies, we've never met a character like him on the screen. The scene in which he listens to Will Smith's Paul explain his thesis is a triumph. We see Flan falling in love. It is chillingly beautiful. Then, of course, the aforementioned Will Smith, he moves with a borrowed self confidence, like his character and it's impossible not to love him. He has the elegance of a Cary Grant and the charisma that we all now associate with Will Smith. I only regret that he didn't go for the kiss. That would have completed the shocking sum of all his parts. I love this film. I love John Guare for writing it. I love Schepsi (he's an old love of mine \"Cry in Dark\" \"Plenty\") The superb editing, the wonderful tangoish score and the work of the production and costume designers makes \"Six Degrees of Separation\" one of the most rewarding movie experiences. On this terrible summer of World at Wars, New Batmans and some other horrors, do yourself a favour. Rent the DVD and stay for dinner at home with the Kittredges.",
         "SIX DEGREES OF SEPARATION is an outstanding play transformed to the screen with dignity but with a script that keeps us in the live theatre instead of in a motion picture. Not that that is a bad thing: the script by John Guare is brilliant. It simply seems a little static, with its marvelous plays on words, repeated phrases, and disjointed movements significant unto themselves but not really taking advantage of cinematic possibilities of flow. Essentially the tale of how a married couple who deal art (Stockard Channing and Donald Sutherland - both in peak form) are so caught up in their superficial lives that they are taken in by a handsome young African American con artist (Will Smith) whose various antics bring the couple round to reexamining their shallow existence. Most of the story is related over art dealings and dinner conversations and are peopled by such luminaries as Kitty Carlisle, Ian McKellen, artists Chuck Close and Kazuko, Mary Beth Hurt, Bruce Davidson etc - a really fine ensemble. There are many social comments clustered in this story and it continues to play well after its origins on the stage and fifteen years after the movie was made. This was one of Will Smith's entries into film as well as one of the gifted Stockard Channing's finest roles. Highly recommended for repeated viewings. Grady Harp",
         "Puzzling offhanded moody film. I was struck by what seemed the underlying assertion: the deep if unconscious longing of the divided social classes in the country -- the wealthy and the disenfranchised -- for each other. The deep longing to heal the rift of \"separation\" that the whole class system perpetuates through how people behave, who they associate with, who is considered desirable. The rich couple and especially Stockard Channing's character of Louisa is caught up in an affluent world of witty pretentious empty existence -- one they are exceedingly skilled at, and are able to milk to good profit. When they meet Paul (Will Smith's character), they are drawn to his directness, his charm -- he is skilled at being relaxed and conversant in their cultured world, yet he lacks the pretense of the elder members or the (satirically exaggerated) spoiled disaffection of the younger members, their children. They both relish telling the story \u0096 and their friends seem undyingly riveted by it -- and Loisa especially tastes of a richness, a directness, a spark to life that she does not have. Will Smith's character of Paul also longs for a life he does not have, their Upper East Side life. For the wealth, certainly, but also for the very real values of education, ideas, and that spark of art that is separate from the worldly commercial side of art's buying and selling. The slap that Louisa joyously gives to the hand of God in the Sistine Chapel. Both sides are profoundly hurt by the rift, the gulf, that exists almost never to be crossed between Paul's ghetto and the Kittridges' beautiful penthouse. There may be a \"mere\" six degrees of separation between them \u0096 but as Louisa meditates, how to broach them? How to find the people that came connect you? (In \"Six Degrees\" it is interesting and telling that it is the gay member of the set that serves as the crossover person, the means by which Paul can make his more profound crossover. Somehow, those who are owning-class gay stand with a foot in both worlds \u0096 they have a large degree of entree into the worldly affluent classes, yet they are also outcasts.) As a comment outside the movie, it's my opinion that the class system is kept inexorably in place so that the wealthy might never have human relationships as equals with those whose labor they exploit, so as to avoid the pangs of conscience about benefiting unjustly from their labor. (One of Gandhi's seven root causes of injustice is: Wealth Without Work. In a just world, every person reaps the product of her or his own work; while to be wealthy, one generally must have people working for you from whom you derive some percentage profit of their work.) But while this may sound radical, my further belief is that not only does this system hurt the poor, it also hurts the wealthy in profound ways. They get the wonderful apartments and private access to the Kandinsky, but their lives are empty and they don't see a way out, they must keep going to the obligatory mannered dinner parties at the price of a life that feels rich and alive with imagination.",
         "This is the film that made even the most harshest critics admit that Will Smith had real potential as far as being a serious actor is concerned. This is the story of a young gay hustler named Paul (Smith) who knocks on the door of Ouisa and Flan Kittredge (Stockard Channing and Donald Sutherland) and tells them a story of being mugged and also being the son of Sidney Poitier. He says he knows their children from college and remembered they lived there so thats why he came. After a lot of talking and impressing them he cooks them a nice dinner and they invite him to spend the night. They also loan him money but in the morning they find him with another man and they kick everyone out. The Kittredge's talk to their friends and find out that they all encountered Paul as well but were afraid to say something because they were embarrassed. The films title refers to the fact that we all know everyone by six people or degrees. The main focus of the film deals with how this young man made these characters take a good hard look at themselves and the relationship they have with each other and their children. The writing is very sharp and for most of us what is being said onscreen can easily go over our heads. Its a very intelligent script that forces the characters to see things that they seem to take for granted. Directed by Fred Schepisi who has shown a real knack for filming plays before and he also has shown to be very good at making films that are more character oriented. I remember one of his first films from the 70's called \"The Devils Playground\" and was impressed at that time by his direction. What really stood out for me though were the performances. Will Smith seems to tackle this complex script with an all to easy manner. As I watched his performance it was clear that he really understood the script and his character. You don't see that everyday from such a young actor, especially one that has limited training. But for me the best performance comes from Stockard Channing who was in the play as well. She's always been a very strong actress and a very underrated one at that. While watching her character in this film Channing does a wonderful job of allowing the viewer to watch her characters attitude change from the first scene to the very last. It really is Channings film and she received a well deserved Oscar nomination for it. Its one of the best in her career and its the driving force for the film. Casual film watchers may be put off by the sharp dialogue at first but I hope they stay with it, its a very good film about self realization and all the actors here are terrific.",
         "At once you can see this was a stage play, with the concentration on dialogue, and although it stands out somewhat here, and there is a slight edge of everything being just a notch above the usual, the visuals and acting bring you into this great story quite easily. Will Smith acts his pants off, well quite literally in some scenes, but he is superb in this role, and acting along such names as Stockard Channing and Donald Sutherland, both of whom are spectacular in their roles. A story based around the idea that everyone is connected to everyone else by a maximum of six other people, it's just finding those six that make the link, and this is turned into an extremely interesting story, told in a series of anecdotal discussions between the main characters and their friends and business partners at various different social occasions. You find yourself drawn and fascinated to the tale as it unfolds, almost feeling as though you are one of those people, eager to hear the next step in the tale. However, I felt somewhat disappointed in the ending, almost as though it didn't fit and came out of nowhere. Yet the ideas of the stranger giving the couple more than they gave the stranger was a good one, I just think what they finally got wasn't what the story needed\u0085but then, sometimes that's life. A very good story, with brilliant performances, well worth watching.",
         "This movie is absolutely stunning. Very original in plot, colors, and directing, with a superb soundtrack. It discusses how we are all no more then 6 degrees of separation from eachother. Yet this aspect is only the plot. In reality it adds another perspective on our daily lives. Through Ouisa Kittridge it teaches us how mundane our everyday events are, that we all need something drastic to happen to bring us out of sleepy everyday into a fun, exciting, new being. We are equated to John Kittridge who lives his self involved life not noticing the people around him - not the hippy couple in the park who happen to be artists, nor his kids away in college, not even his wife's true personality. Through Ouisa we are shown how we all look for something new to enter our lives, even a sham like Paul can turn us around, give a new meaning to the mundane. Of course the tango musical theme combined with extensive monologues by Paul forces viewer to dance with and listen into the characters, almost becoming one. (9+/10)",
         "I don't understand why the public and the critic didn't celebrate \"Six Degrees of Separation\". It is a very, very good and unusual dramatic comedy about, among other subjects, the high society life and the ambitions. I liked this film very much and I highly recommend it. However, there is a hollow ending and so I gave it a 9 out of 10. The same way a must-see.",
         "I saw Stockard Channing do this play on Broadway, and it remains one of the best theater experiences ever. It's really the story of her character Ouisa gradually seeing that her life is just pretty surfaces, and in meeting this young con-man with whom she makes an intense emotional connection, that she wants more than her marriage, her friends, her life. The dialogue goes like the wind and you barely get a chance to catch your breath; some of the dialogue is spoken as a soliloquy. It's John Guare's mastery of the language at its best, better than \"The House of Blue Leaves.\" I'm much more of a movie person than a theater person, but this play really sang. Unfortunately the translation to film is only partially successful. Whereas the play is a spoken confessional of Oiusa Kitteridge, the movie emphasizes Paul (Will Smith). Smith does a good-to-great job with this character. The transition from a verbal to a visual medium robs the language of much of its power, and rather than re-write it as a movie, it's sort of a 'half-transition,' which doesn't really please anyone. The other problem I had with it was Donald Sutherland; who wasn't half-bad. But John Cunningham, who played the role on Broadway, was sharper, harder, a GAMBLER...Sutherland just comes across as a nice guy that gets a bit upset that he's been conned. And the emotional blow that comes at the end of the play when you realize that Oiusa's perfect marriage is falling apart just doesn't come across. Still fascinating for its premise and worth a look; even this watered-down version never fails to entertain.",
         "((((SPOILERS)))) \"David took a great joy in living the life he lived,\" said attorney Ronald Kuby, who knew Hampton for more than a decade. \"It was performance art on the world's smallest possible stage, usually involving an audience of only one or two.\" -- Obituary for David Hampton, Associated Press Saturday, July 19, 2003 In SIX DEGREES OF SEPARATION, Paul, a con artist passing himself off as the son of Sidney Poitier, has a wonderful monologue. He goes into detail describing a nonexistent thesis he claims to have written about the book \"The Catcher in the Rye\" and about how its themes have become a manifesto for violence. It is a beautifully written piece by playwright/screenwriter John Guare that Will Smith does so well that you might not at first realize that it is really about the character that Smith is actually playing. \"Catcher's\" Holden Caulfield is a liar, but he hates phonies; wants to be liked, but mostly shows contempt for others; and he complains that people just don't see what is obvious. Holden sees himself as one person, but reveals himself to be someone quite different. So does Paul. SIX DEGREES, play and movie, is based on a true incident. David Hampton pulled the Sidney Poitier scam in the early 1980s and insinuated himself into the lives of various affluent New Yorkers. His hoax was eventually revealed and the result for Hampton was a jail sentence and, thanks to Guare's fanciful play, minor celebrity status. Told mostly from the viewpoint of the generous, star-struck and gullible people that Hampton scammed, personified by the fictitious Flan and Ouisa Kitteridge (Donald Sutherland and Stockard Channing), the film apparently expands on monologues from the play, opening things up so that the tale slowly becomes a minor New York urban legend. As the Kitteridges compare notes with other victims of Paul's masquerade, the legend grows and the story shifts from anger, to amazement, to giddy amusement, before turning suddenly tragic. For the most part the film is a gentle comedy, not that far removed from the screwball farces of the 30s and 40s which found basically good people falling for lovable rascals who brazenly assume false identities. The message was that respectability is only skin deep; true integrity lies much deeper. SIX DEGREES embraces that ideal by making Paul's con game basically harmless, a plea for acceptance and identity, not a petty swindle. As long as the film maintains this sense of innocence, it is an utterly charming tale. But like Paul, the filmmakers reach beyond their grasp and the film falters. The film has problems, which standout all the more because of the intelligence of the overall quality of the production. It is jarring, for instance, when we are introduced to the various children of the main characters, because they are shown to be loud, bitter and antagonistic. Since the adults are shown to be so nice, albeit self-absorbed, it is hard to believe that they are all supposedly to be lousy parents. Certainly these college kids are meant to represent a contrast to Paul's overt politeness, as well as illustrate a generation gap, but the kids are just too overwhelmingly unpleasant and ungrateful. Their scenes ring false. Also, Ouisa at one point angrily insists that the entire story has to be more than just a cocktail party anecdote; yet in the end, that is all that it is and that is how the film unfolds. It is a stylishly told tale, made all the more intriguing because it is based on the truth, but the film strives to romanticize it all of out of proportion. It is suggested that what would rightly be no more than an amusing footnote in these characters' lives, should be treated as mythic tragedy. The film ends on a particularly ridiculous note, wherein Ouisa apparently walks out on Flan because he doesn't share her belief that Paul's story has been a life transforming experience. We are to assume from the ending that her encounter with Paul has been a liberating experience that has awakened her to the shallowness of her life and the emptiness of her marriage. This is absurd, especially the latter part; Flan and Ouisa are depicted as being deeply devoted to each other throughout the story, making her sudden exit inexplicable. But feminist cliche dictates that liberated women must abandoned their husbands. Channing is, as always, just wonderful in the role of Ouisa, and she almost makes the character's impulsive behavior seem credible. But, in the end, we are left befuddled like Flan, not irate and angry like Ouisa. It is a pity that Guare and director Fred Schepisi weren't satisfied with simply letting the story be a gentle satire on our celebrity driven society. It seems they had to somehow justify making the film by creating fake drama out of real life farce.",
         "This movie is a pretentious, vacuous waste of time. There is nothing interesting about the characters or the plot. The film seems to take its only delight in shocking the audience with its own repugnance. I believed that this movie was funded by the makers of Prozac, as they would be the only group with a financial interest in seeing this movie produced. The only reason I wanted to see this movie was because of the title \"Six degrees of Separation.\" This is supposed to mean that through six human contacts any person in the world will know any other person. Sadly, this movie never even explores this idea. Instead, we get to see Will Smith play a ridiculously unbelievable gay con man. He cons his way into the homes of Donald Sutherland and Stockard Channing for the sole purpose of befriending them. That's it; he's not after their money but rather their friendship. Why? Apparently it's because he's a flaming effeminate psycho. Unbelievably, they gave Stockard Channing an academy award nomination for her role. Their is absolutely no reason to do so. Her character was barely even part of the story. A very unbelievable and uninteresting story."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Maiden Movies",
         "New Regency Pictures"
      ],
      "summaries": [
         "New Yorkers Ouisa and Flan Kittredge are upper class private art dealers, pretentious but compassionate. Their prized possession is a double sided Kandinsky, one side that represents control, the other side chaos. They relay a story to their friends and acquaintances that over time becomes legendary. It is their encounter with a young black man who they had never met or heard of but who comes stumbling upon their front door one evening as they are courting an important investor, Geoffrey Miller, who could make them wealthy beyond what they could have dreamed. That black man is Paul Poitier, who has just arrived in the city, was just mugged outside their building and is sporting a minor knife wound to the abdomen. He is a friend of the Kittredge's children, who are attending Harvard, but more importantly is the son of actor/director Sidney Poitier. Tomorrow, Paul is meeting up with his father who is in town directing a movie of \"Cats\". Beyond the attraction of talking Paul into getting them roles in the movie, Ouisa, Flan and Geoffrey all end up being captivated by the charm, charisma, pedigree and eloquence of Paul, who the Kittredges, after tending to his wounds, invite to stay the night. Their encounter with Paul ends up being an all too familiar story, which they will soon learn, and leads the Kittredges on a search for Paul after he leaves their abode the next morning. In that search, Ouisa, in particular, begins to view critically their life and just how much compassion they really have.",
         "Flan and Ouisa Kittredge, rich NYC art dealers, are called on one night by a young man, Paul, who professes to be a friend of their kids' from Harvard. They offer him a bed for the night; he enchants them with a home-cooked meal and magnificent conversation. The next morning, they learn that he is not all he seems to be. Their investigations are intriguing and lead them to re-evaluate their lives.",
         "In New York, the art dealers John Flanders ('Flan') Kittredge and Louisa ('Ouisa') Kittredge are ready to have a business dinner with their South African friend and client Geoffrey Miller, when a wounded young black man comes to their fancy apartment telling that he had been just robbed in Central Park and asking for help. He introduces himself as Paul, a friend of their son and daughter in Harvard and son of Sidney Poitier, and the couple invites him to stay with them. During the night, they find that Paul is not who he claims to be. When they investigate the life of Paul, they find the hidden truth.",
         "An affluent New York couple find their lives touched, intruded upon, and compelled by a mysterious young black man who is never quite who he says he is."
      ],
      "budget": 12000000
   },
   "movielensId": 538,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-12-08",
      "dvdReleaseDate": "2000-08-15",
      "directors": ["Fred Schepisi"],
      "runtime": 112,
      "movieId": 538,
      "title": "Six Degrees of Separation",
      "mpaa": "R",
      "actors": [
         "Will Smith",
         "Donald Sutherland",
         "Stockard Channing",
         "Ian McKellen",
         "Mary Beth Hurt",
         "Anthony Michael Hall",
         "Heather Graham",
         "Anthony Rapp",
         "J.J. Abrams",
         "Kelly Bishop",
         "Eric Thal",
         "Bruce Davison",
         "Richard Masur",
         "John Cunningham",
         "Daniel von Bargen",
         "Kitty Carlisle",
         "Maeve McGuire"
      ],
      "imdbMovieId": "0108149",
      "originalTitle": "Six Degrees of Separation",
      "genres": [
         "Mystery",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["HLIyuYwbVnA"],
      "plotSummary": "The story of a young, gay black con artist who, posing as the son of Sidney Poitier, cunningly maneuvers his way into the lives of a white, upper-class New York family.",
      "tmdbMovieId": 23210,
      "avgRating": 3.69584,
      "releaseYear": "1993",
      "numRatings": 5410,
      "posterPath": "/uBbjfRWu5Z9YbzC1LyvA0o1DeyZ.jpg"
   }
}