{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "thanksgiving",
            "id": 4543
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "liar",
            "id": 9468
         },
         {
            "name": "pancreas",
            "id": 171508
         },
         {
            "name": "thong",
            "id": 171518
         },
         {
            "name": "city boy",
            "id": 171521
         }
      ],
      "imdb_id": "tt0108186",
      "video": false,
      "title": "Son in Law",
      "recommendations": [
         12475,
         9536,
         10406,
         19326,
         13997,
         13595,
         26255,
         19064,
         26261,
         42580,
         14361,
         12518,
         19176,
         10019,
         14671,
         11933,
         10169,
         11310,
         15602,
         15413
      ],
      "backdrop_path": "/fGUsG6pAUL5s5YOQkmuN1KfOkmG.jpg",
      "revenue": 36448200,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Crawl",
               "gender": 2,
               "credit_id": "52fe454e9251416c75052003",
               "name": "Pauly Shore",
               "profile_path": "/rCoEeH3jmwpNjMHAVv9SchtnNJh.jpg",
               "id": 64998,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rebecca Warner",
               "gender": 1,
               "credit_id": "52fe454e9251416c75052007",
               "name": "Carla Gugino",
               "profile_path": "/xddYLCp8zWLgYcQRck7REEgCUWl.jpg",
               "id": 17832,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Walter Warner",
               "gender": 2,
               "credit_id": "52fe454e9251416c7505200b",
               "name": "Lane Smith",
               "profile_path": "/js7GonfBVNHLYhaB0Xjtnm93DpH.jpg",
               "id": 65019,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tracy",
               "gender": 1,
               "credit_id": "52fe454e9251416c7505200f",
               "name": "Tiffani Thiessen",
               "profile_path": "/bsl5t8SAQ1z1KRgALylk9Oh0Kua.jpg",
               "id": 19187,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Connie Warner",
               "gender": 0,
               "credit_id": "52fe454e9251416c75052013",
               "name": "Cindy Pickett",
               "profile_path": "/6CqKvPebiGfLtPkUO2wJi9kd572.jpg",
               "id": 74276,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Walter Warner Sr.",
               "gender": 2,
               "credit_id": "52fe454e9251416c75052029",
               "name": "Mason Adams",
               "profile_path": "/ty5wmpiFUWgKgPapYT6exGsS6vf.jpg",
               "id": 59945,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Zack Warner",
               "gender": 2,
               "credit_id": "52fe454e9251416c7505202d",
               "name": "Patrick Renna",
               "profile_path": "/uZNv29XVECaeAokMoz7N0hANZ3e.jpg",
               "id": 69740,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Theo",
               "gender": 2,
               "credit_id": "52fe454e9251416c75052035",
               "name": "Dennis Burkley",
               "profile_path": "/cCmRR9saqVLLmYqlBGTEcom8Lfq.jpg",
               "id": 83362,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Travis",
               "gender": 2,
               "credit_id": "561c89d4c3a3682264002f60",
               "name": "Dan Gauthier",
               "profile_path": "/6ofGZR0XMbtulf2Iff9ddHaV8j3.jpg",
               "id": 93321,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Link",
               "gender": 2,
               "credit_id": "5ab7413ac3a3680a2b015afb",
               "name": "Brendan Fraser",
               "profile_path": "/n8VOWXp94nhIEo5nS9o6bOpUHiN.jpg",
               "id": 18269,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe454e9251416c75052019",
               "name": "Steve Rash",
               "profile_path": "/t7sZbMXWCHp80p5tPFTnsPY037h.jpg",
               "id": 54590,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe454e9251416c7505201f",
               "name": "Patrick J. Clifton",
               "profile_path": null,
               "id": 38693,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 1,
               "credit_id": "52fe454e9251416c75052025",
               "name": "Susan McMartin",
               "profile_path": "/y94dx4X3bMfBgcRsNqZzvacFBmb.jpg",
               "id": 74277,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "5ac40b80925141271203fd79",
               "name": "Michael Rotenberg",
               "profile_path": null,
               "id": 24177,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ac40b890e0a260c140408ac",
               "name": "Peter M. Lenkov",
               "profile_path": null,
               "id": 58839,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ac40baa0e0a260c3904324c",
               "name": "Peter Deming",
               "profile_path": "/3NgM7E5kRYFMXY5znBPktbeI6qB.jpg",
               "id": 9573,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5ac40bb5c3a3682d66048813",
               "name": "Dennis M. Hill",
               "profile_path": null,
               "id": 30606,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac40bcd92514126be03fef6",
               "name": "Richard Gibbs",
               "profile_path": "/5jTk1fUsMzslWB86XdWB8JoYdMl.jpg",
               "id": 21068,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.539371,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13203,
      "vote_count": 101,
      "budget": 0,
      "overview": "Country girl Rebecca has spent most of her life on a farm in South Dakota, and, when she goes away to college in Los Angeles, Rebecca immediately feels out of place in the daunting urban setting. She is befriended by a savvy party animal named Crawl, who convinces the ambivalent Rebecca to stay in the city. When Thanksgiving break rolls around, Rebecca, no longer an innocent farm girl, invites Crawl back to South Dakota, where he pretends to be her fiancé.",
      "similar": [
         325133,
         10760,
         114150,
         8469,
         9285,
         8277,
         440021,
         12620,
         46127,
         270302,
         10642,
         11137,
         431072,
         9609,
         13969,
         15762,
         11004,
         84306,
         368031,
         2259
      ],
      "original_title": "Son in Law",
      "runtime": 95,
      "poster_path": "/zVnzFkQqcPC1uxhAuIaWx4H0kEO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
         "name": "Hollywood Pictures",
         "id": 915,
         "origin_country": ""
      }],
      "release_date": "1993-07-02",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "He's a relative nightmare.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Rash"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Patrick J. Clifton",
         "Susan McMartin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108186/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxNDkyODMwN15BMl5BanBnXkFtZTYwODA3NjU5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Pauly Shore, Carla Gugino, Lane Smith | See full cast and crew »"],
      "reviews": [
         "Son In Law didn't do so hot in the box office, but that only means the masses were wrong. This movie is one of the few movies that Pauly Shore really excels in, with some of the funniest lines I've ever heard. Although the ending is sub-par, the antics of Shore carries the movie.",
         "People rag on Pauley Shore for being a bad actor. On the contrary, he wasn't an actor at all, but a swell entertainer. You could stick him in a dumb situation and he could just jump in, act naturally, and have a whole lot of fun doing lots of stupid things. That's what makes his movies so damned funny. The story isn't anything new. A city boy is planted in a rural South Dakota farm town. He's an outcast at first (and likewise they're alien to him), but eventually they mesh and he rubs off a bit on them and vice versa. But, here, Pauley (as Crawl) follows his college friend to her home in the boonies for Thanksgiving break. Trying to avoid her boyfriend who just insists on getting married, she comes up with some story that they're actually engaged. Her parents are blown away by it because obviously they'd rather see her settle down with the townie than with the very strange Crawl. In the end, everything works out fine, obviously. The actors are swell. I particularly enjoyed Patrick Renna as the once-obnoxious little brother with a rad sense of humor. And of course, Pauley Shore was good at what he does: making people laugh. Thumbs up.",
         "Along with In the Army!, this ranks as one of Pauly Shore's best movies, if there is such a thing. While the whole West Coast-meets- Midwest-culture-clash isn't anything new, this film proves to make the story a little more entertaining with the wild and unpredictable antics of a then fresh Shore. While the change in values probably would have gone in the other direction, the whole concept was rather entertaining. Not only was Shore's interaction with the family hilarious, it also had Carla Gugino and Tiffani- Amber Theissen (she'll always have the Amber in my book) in two ravishing and early roles. One of those films I have no problem watching when it is on TV.",
         "One of our all time family favorites. When we need a laugh...we just put this one in and laugh all way thru like it is the first time we've seen it. This film has good, clean family humor. Pauly Shore is brilliant! With no plans for the thanksgiving holiday, Crawl (Shore) is invited to spend the holiday with a conservative coed, Becca. Crawl, being a big city boy, must adjust to the farm life if he is to fall in love with Becca. But, Crawl isn't the only one who is learning new things. Crawl teaches Becca and her parents how to be more open about their feelings and accepting others. This is fun for viewers of all ages.",
         "Before I saw \"Son In Law\" I only had a vague idea who Pauly Shore was. Now I know. He is a superb comedic actor. In this movie he plays \"Crawl\", an upperclassman dorm counselor, who is a bit eccentric. He meets freshman \"Becka\" from South Dakota and they become fast friends. He helps her break out of her small town mold. In a Thanksgiving visit to her parents' home, he pretends to be her fiancee to save her embarassment of a sort with an old boyfriend. I loved two things about this movie. Pauly Shore and the comedic situations are the first. The second is the message. How generations of \"men\" had perpetrated the same offenses against each other, and \"Crawl\" helps them see a better way to treat each other. He gets Becka's mom also to feel \"alive\" again, and rekindles romance between the parents. The whole movie is a fresh approach to comedy, is a joy to watch. I rate it a strong 7 of 10.",
         "Despite myself, I really kinda like this movie. Pauley Shore is invariably laugh-out-loud funny, and here is no exception. He is just excellent at playing the weirdo with a heart of gold. His performance in this, although nothing out of the ordinary for him, is so good, it seems to lift other cast members' performances. Perhaps this is because he's the kind of guy it's easy to bounce off of. The clichés about country life in this movie are hilarious and the way Shore's \"city boy\", Crawl is so at odds with the way of life, is funny too, but it's not only he who's a fish out of water; comedy also comes from the fact, that to any \"ordinary\" person or people, Crawl is a freakish nightmare of a person. That's why this movie works in such a great way: we love Crawl, he's a breath of fresh air, but we can also sympathise with the Warners. He is one hell of a culture shock. Although this movie is classic Pauley Shore, so there's no great brain power needed to enjoy the movie, enjoy it you do, and there's even a \"never judge a book by it's cover\" type moral here somewhere. Not bad, not bad at all.",
         "I love it! I love Pauly Shore. It seems some people don't agree. It's humor, and he's not like everyone else. The movie is great. I love the story line and most of the people in the movie. It's funny from the first time she meets him at school. I like the fact that she chooses him over the guy back home. I like that Tiffani Theissan isn't a bad girl in the end. All the secrets are let out. Only the people you want to see are left in the end. (except for those of you who don't like Pauly Shore.) Even if you don't like him, there are funny parts, and her family tortures him through most of the movie. She's country girl gone wild and needs to be heard. She finally makes it. It's got just the right amount of love and romance. I give it an 8 out of 10.",
         "I didn't expect much when I decided to watch this movie, so I was surprised to find myself thoroughly enjoying it. A couple of scenes had me laughing almost uncontrollably. The characters were engaging (no pun intended); however, the story is predictable. The fun of it comes from watching Crawl (Shore's character), a ditzy-yet-wise California dude a country college girl brings home for Thanksgiving, trying in his awkward (yet endearing) way to fit in to their lifestyle. I was also surprised that in all this there was a message. If you have a chance, see this movie!",
         "this is pauly shore's best,and funniest movie. it has some funny jokes,but the movie is more entertaining than it is funny. pauly shore is funny,but not real,real funny. as long as the movie is entertaining,pauly shore doesn't have to be real funny. i give son in law *** out of ****",
         "Country-girl, Gugino meets rock 'n' roller, surfer-dude (comedian Pauly Shore) while attending college in California; they fall in love (for reasons that remain a mystery to the audience) and she brings him back to the farm to meet his future in-laws. Shore spends most of the film's running-time making animal noises and pronouncing words in a slightly unconventional manner because the writers couldn't be bothered to come up with any jokes. To top it off, the leading lady is also a bitch who heartlessly dumps her boyfriend for the sake of our \"charming\" genetic- defect, and while this movie does try to justify this by making him a cheater. The problem is, she doesn't find out until the end, so for all she knew, she could have been breaking the heart of an innocent man. Let me tell help you out here movie; merely making one character an ass doesn't exempt the other from being a bitch. Also, merely exaggerating the length of a word (buuuuuuuudy) isn't funny. Lazy humor at it's, err, laziest."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Hollywood Pictures"],
      "summaries": [
         "Country girl Rebecca begins college in Los Angeles. There she meets Crawl, a student who is crazy, unpredictable and wild. During the holidays she brings him with her home. Her parents have never seen anything like him and are shocked when Rebecca tells them that they are engaged to be married. Two different worlds collide...",
         "South Dakota farm girl Rebecca \"Becca\" Warner has just graduated from high school, and she has decided that she will go to college at UCLA. Becca's parents Walter and Connie, and especially her boyfriend Travis, hate to see her go to college so far away. Becca is overwhelmed and ready to go home after just a few days at UCLA. But the dorm counselor, Crawl, convinces her to stay and give the city a chance. She does, and it works its magic. Becca digs into SoCal life, dropping her farm duds for hot city threads, changing her hair style and color, getting a tattoo and spending what little free time she has left roller-blading like a maniac. Soon Thanksgiving looms, and the thought of an almost-certain marriage proposal from Travis fills her with mixed emotions. Becca impulsively invites Crawl to come home with her for Thanksgiving, and Walter, Connie, Becca's brother Zack, Grandpa Walter Sr, Travis, and hired hand Theo regard him first as an object of curiosity, then scorn. When Travis -- who has his eyes on Becca's friend Tracy -- tries to ask Becca to marry him, Becca panics, and Crawl comes to the rescue by announcing his own engagement to Becca, with whom he's in love. Walter is outraged -- especially after Crawl announces his plans to take over the family farm after Walter retires -- and Travis punches Crawl in the nose. But Zack is won over when Crawl helps him with a computer problem, and Becca starts falling in love with Crawl. Walter sics Theo on Crawl, and under the guise of training, Theo puts Crawl through numerous farm tortures, from pitching manure to slopping the hogs. But rather than wilting, Crawl takes to farm living in a big way, eventually earning Walter's and Grandpa Walter Sr's respect. Travis tries to win Becca back, with Theo's help, by drugging Crawl and Tracy and placing Crawl and Tracy beside each other in the barn to make it look like Crawl and Tracy slept with each other. Will Becca fall for this trick, and believe what Travis tells her?",
         "Having gotten a taste of college life, a drastically changed farm girl returns home for Thanksgiving break with her best friend, a flamboyant party animal who is clearly a fish out of water in a small farm town."
      ],
      "budget": 0
   },
   "movielensId": 542,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-07-02",
      "dvdReleaseDate": "1999-09-07",
      "directors": ["Steve Rash"],
      "runtime": 95,
      "movieId": 542,
      "title": "Son in Law",
      "mpaa": "PG-13",
      "actors": [
         "Pauly Shore",
         "Carla Gugino",
         "Lane Smith",
         "Tiffani Thiessen",
         "Cindy Pickett",
         "Mason Adams",
         "Patrick Renna",
         "Dennis Burkley",
         "Dan Gauthier"
      ],
      "imdbMovieId": "0108186",
      "originalTitle": "Son in Law",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["8pnnGZUe14g"],
      "plotSummary": "Country girl Rebecca has spent most of her life on a farm in South Dakota, and, when she goes away to college in Los Angeles, Rebecca immediately feels out of place in the daunting urban setting. She is befriended by a savvy party animal named Crawl, who convinces the ambivalent Rebecca to stay in the city. When Thanksgiving break rolls around, Rebecca, no longer an innocent farm girl, invites Crawl back to South Dakota, where he pretends to be her fiancé.",
      "tmdbMovieId": 13203,
      "avgRating": 2.86305,
      "releaseYear": "1993",
      "numRatings": 3848,
      "posterPath": "/zVnzFkQqcPC1uxhAuIaWx4H0kEO.jpg"
   }
}