{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "scotland",
            "id": 388
         },
         {
            "name": "butcher",
            "id": 4452
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "axe murder",
            "id": 157758
         }
      ],
      "imdb_id": "tt0108174",
      "video": false,
      "title": "So I Married an Axe Murderer",
      "recommendations": [
         11718,
         10859,
         8873,
         2107,
         10276,
         9749,
         1552,
         12596,
         9080,
         10379,
         11584,
         12518,
         14577,
         14628,
         11933,
         11543,
         11591,
         11821,
         9409,
         8388
      ],
      "backdrop_path": "/1JYWkmjwt1sKj0QyOa6wUJAY3SY.jpg",
      "revenue": 11585483,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Charlie Mackenzie",
               "gender": 2,
               "credit_id": "52fe43729251416c75010a47",
               "name": "Mike Myers",
               "profile_path": "/sa8MMxXZrHgQ85hTAP11WS4N3ik.jpg",
               "id": 12073,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Harriet Michaels",
               "gender": 1,
               "credit_id": "52fe43729251416c75010a4b",
               "name": "Nancy Travis",
               "profile_path": "/5galk3XJxxlIEmrnAQBuJsY1AaD.jpg",
               "id": 18331,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tony Giardino",
               "gender": 2,
               "credit_id": "52fe43729251416c75010a4f",
               "name": "Anthony LaPaglia",
               "profile_path": "/22sOEc37TsxxcnIl1XmucuW3IDl.jpg",
               "id": 57829,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rose Michaels",
               "gender": 1,
               "credit_id": "52fe43729251416c75010a53",
               "name": "Amanda Plummer",
               "profile_path": "/uICpVUj29yBcwCEGVZzE77FL98W.jpg",
               "id": 99,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "May Mackenzie",
               "gender": 1,
               "credit_id": "52fe43729251416c75010a57",
               "name": "Brenda Fricker",
               "profile_path": "/z2ARJBvxE1mCwQ6XARTKvvPQySu.jpg",
               "id": 18345,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Commandeered Driver",
               "gender": 2,
               "credit_id": "52fe43729251416c75010a91",
               "name": "Charles Grodin",
               "profile_path": "/8lHT8QePWTpSfw0DQJ5k8YUuZt1.jpg",
               "id": 28164,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Ranger John 'Vicky' Johnson - Alcatraz Guide",
               "gender": 2,
               "credit_id": "52fe43729251416c75010a95",
               "name": "Phil Hartman",
               "profile_path": "/rf62sAab9vOjm9x7ZA0VBWDkHvD.jpg",
               "id": 14104,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Susan, Tony's Girlfriend",
               "gender": 1,
               "credit_id": "52fe43729251416c75010a99",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Pilot",
               "gender": 2,
               "credit_id": "52fe43729251416c75010a9d",
               "name": "Steven Wright",
               "profile_path": "/m9827iUNPGTbAsfjHD9tpMCXYbR.jpg",
               "id": 3214,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Newspaper reporter",
               "gender": 2,
               "credit_id": "52fe43729251416c75010aa1",
               "name": "Michael Richards",
               "profile_path": "/fhUgS8p7YBSwDNEFb7WO0jdItBx.jpg",
               "id": 50807,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Obituary Writer",
               "gender": 2,
               "credit_id": "52fe43729251416c75010aa5",
               "name": "Mike Hagerty",
               "profile_path": "/xDfY3QdSlvS7UwDr6DP1YjYNgzu.jpg",
               "id": 15105,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Tony's Boss / Precinct Capt. (uncredited)",
               "gender": 2,
               "credit_id": "52fe43729251416c75010aa9",
               "name": "Alan Arkin",
               "profile_path": "/gcrKO2z0YVUXBXVeB9V8PndG0IJ.jpg",
               "id": 1903,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Cafe Roads Performer",
               "gender": 2,
               "credit_id": "59a5bbf99251412f16010ee7",
               "name": "Patrick Bristow",
               "profile_path": "/tFsUNsW1UlrQePj7ZOjb0frHsXs.jpg",
               "id": 111080,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Cafe Roads M.C.",
               "gender": 0,
               "credit_id": "59a5bc08c3a3684037010582",
               "name": "Cintra Wilson",
               "profile_path": null,
               "id": 1878988,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Butchershop Customer",
               "gender": 0,
               "credit_id": "59a5bc1a9251412f50011354",
               "name": "Al Nalbandian",
               "profile_path": "/gyx16JUR7P3RhEfcCW7MzzRrFwP.jpg",
               "id": 161318,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Butchershop Customer (as George Mauricio)",
               "gender": 0,
               "credit_id": "59a5bc2fc3a36840050118e9",
               "name": "George F. Mauricio",
               "profile_path": null,
               "id": 1878989,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Butchershop Customer",
               "gender": 0,
               "credit_id": "59a5bc4cc3a36840560114ac",
               "name": "Kiki Douveas",
               "profile_path": null,
               "id": 1878990,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Alcatraz Visitor (uncredited)",
               "gender": 1,
               "credit_id": "52fe43729251416c75010aad",
               "name": "Marla Sokoloff",
               "profile_path": "/qNyn2sQpvMxmZjaEVXElUYb9IRl.jpg",
               "id": 80109,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43729251416c75010a5d",
               "name": "Thomas Schlamme",
               "profile_path": "/qwpO1XxptBjW5MAMET9suEopddp.jpg",
               "id": 15106,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43729251416c75010a63",
               "name": "Robbie Fox",
               "profile_path": null,
               "id": 65316,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43729251416c75010a69",
               "name": "Robert N. Fried",
               "profile_path": null,
               "id": 54797,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43729251416c75010a6f",
               "name": "Bernard Williams",
               "profile_path": null,
               "id": 2384,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43729251416c75010a75",
               "name": "Cary Woods",
               "profile_path": null,
               "id": 5505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43729251416c75010a7b",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43729251416c75010a81",
               "name": "Julio Macat",
               "profile_path": null,
               "id": 11506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43729251416c75010a87",
               "name": "Colleen Halsey",
               "profile_path": "/jFQWc44sN5CNb7UQeDRYr2ooGWt.jpg",
               "id": 1917,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43729251416c75010a8d",
               "name": "Richard Halsey",
               "profile_path": null,
               "id": 1918,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.686806,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10442,
      "vote_count": 156,
      "budget": 20000000,
      "overview": "Just after a bad breakup, Charlie MacKenzie falls for lovely butcher Harriet Michaels and introduces her to his parents. But, as voracious consumers of sensational tabloids, his parents soon come to suspect that Harriet is actually a notorious serial killer -- \"Mrs. X\" -- wanted in connection with a string of bizarre honeymoon killings. Thinking his parents foolish, Charlie proposes to Harriet. But while on his honeymoon with her, he begins to fear they were right.",
      "similar": [
         984,
         15069,
         96,
         807,
         4771,
         75780,
         357096,
         10651,
         11423,
         2749,
         18587,
         26390,
         15762,
         37645,
         12150,
         1949,
         979,
         4638,
         193893,
         281
      ],
      "original_title": "So I Married an Axe Murderer",
      "runtime": 93,
      "poster_path": "/3dkBFXZKlpdVizQkaQzRQgsUlcL.jpg",
      "spoken_languages": [
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1993-07-30",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The honeymoon was killer.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thomas Schlamme"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Robbie Fox"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108174/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3OTY0NzYzMV5BMl5BanBnXkFtZTcwMDc2MjYxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Mike Myers, Nancy Travis, Anthony LaPaglia | See full cast and crew »"],
      "reviews": [
         "So, I married an Axe murderer is not the sort of Mike Myers comedy that people have become used to over the years. Myers will, undoubtedly, be most remembered most for his Austin Powers series, but this is a film that certainly should not be forgotten; Myers was never funnier than he is in this movie. The plot centres around Charlie Mackenzie (Myers), a man who can never have a girlfriend without finding a flaw with her which always leads him to end the relationship. That is until he meets Harriet Michaels. She seems perfect, but the flaw that Charlie finds with this woman, may cost him his neck... What follows is a tour-de-force of comedy. It is true that a few of the jokes don't really work, but the ones that do REALLY work, and it 's easy to forgive the movie for the ones that don't. In fact, I haven't seen this movie in over a year, but I'm laughing as I type this. This movie features some positively brilliant moments, from Myers' poetry sessions (\"Woman! Woah-man, wooaaaaaahhhhh-man\"), to the very Scottish father, played to perfection by Myers who has a duel role(\"Head! Move! Now!\") to Charlie's police man friend, who is definitely the man with the most comedy; his conversations with Charlie regarding the song \"Only You\", the moments with his police chief (a memorable performance by Alan Arkin) and most notably, the parts with the commandeered driver (\"No, it's one of my favourite things\") are positively hilarious. The entire cast of this movie delivers their lines with a great comic timing; a lot of the quotes I mentioned aren't funny out of the context of the film, but due to the way they are delivered and the context of the movie, the dialogue is side splitting. There isn't a lot of plot or heart to chew on with this movie, which accounts for the lot of the reason that this is a short review; but when a film is this funny, who cares what it's about? In the face of Myers' more commercially successful movies, such as Wayne's World, Austin Powers and Shrek; So, I Married an Axe Murderer isn't going to win a lot of fans as it's not as outgoing as the other three and a lot of the humour is very wry. However, this is Myers finest hour and this little comedy gem should definitely not be forgotten.",
         "Probably one of Mike Myers' finest films. The film is the story of Charlie MacKenzie, a commitment phobic who performs in a coffeehouse as a poet. Charlie is looking for the right girl of which he finds in Harriet, an attractive butcher whom Charlie falls head over heels for. The two begin to date but Charlie begins questioning his relationship when clues pointing to an serial killer show up and point directly to Harriet. Funny performances from Mike Myers pulling double duty as sarcastic Charlie and his Scottish dad Stuart MacKenzie, Brenda Fricker as Charlie's horny mother who's got the hots for Tony, Anthony LaPaglia as best friend Tony, and Nancy Travis as girlfriend Harriet. Look for a few surprise cameos from the likes of late great Phil Hartman, Michael Richards, Alan Arkin, Charles Grodin, Steven Wright, and Debi Mazar. Definitely a good rent on a Saturday night.",
         "In this greatly under-rated film, Mike Myers plays a man scared of commitment, until that is he meets Harriet and they fall in love, but does she have a rather macabre secret? This film flows wonderfully, carrying you along before you realise it, right until the end. Some of the better comedic moments, though, come from the cameos, especially by Steven Wright and Charles Grodin, who is always wonderful, whatever film he is in, although the poetry scenes are quite funny too. For some reason this film was not as successful as other Mike Myers' efforts such as the Wayne's Worlds, and it does appear that audiences prefer Myers in character than as himself, and indeed you will come out liking Myers better as his father than as his main role, but nevertheless a great movie!",
         "This movie is an unexpected delight. It has the love story aspect most women like, the mystery component that should please the watchers of thrillers and some action sequences that males are sure to enjoy. There was even a nudity scene so this has something for everybody. Mike Myers is at his talented best playing both Charlie and his father. In fact, it's his father's role that steals the show in both the Harriet meets Parents scene with his comments about his younger brother's \"Heed\" and also at the wedding with his shouting out \"Lets get P*seed\" at the end of the ceremony. Nancy Travis does a great job of looking slightly suspicious throughout the movie. I especially like her appearance in the scene where Charlie drives past whilst she is rolling out the awning wearing Dutch national costume. Anthony LaPaglia's portrayal of the frustrated undercover policeman is a real hoot. You can't help but love the part where his Captain comes into his office, kicks his feet off the desk and gets stuck into him for nosing into a case belonging to Homicide, particularly, since when he comes back into the office and tells him how much he loved that outburst. The other winner is Brenda Fricker who portray's Charlie's mother with the hots for his friend (LaPaglia). I loved the way she explained the story of Mrs X from her favorite paper \"News of the World\" totally ignoring Charlie's depiction of it as a sensationalist rag. Although there were some dead parts in the movie, they were easy to ignore and more than made up for with the pace of the script. This is a movie you can watch repeatedly, especially when you've seen everything else in your DVD library, it's fun, not meant to be taken serious, the hero gets the girl (somewhat) and nobody get's hurt except the drunken bagpiper at the wedding reception.",
         "The sad thing is that this is Mike Myers' lowest grossing film, which shows just what most people know. It's absolutely his best one though, with more likeable wit than the 2 Austin Powers pics and better characters and plot than the Waynes World movies. Myers can only really do about 4 voices (Himself, Wayne, Austin and a Scotsman, which he's doing AGAIN in Shrek now) and he gets to show them all off here, which is actually great. He's great as his miserable dad, and the whole thing is just great fun, a really good film. Nancy Travis and Anthony LaPaglia as his insecure cop buddy support Myers well all the way through. Mike Myers and this movie just rule.",
         "For a first (and I know it's not his absolute first but close to it) this movie was fantastic. The more I watched, the funnier it got and the best are the small nuances. After following his work and being a fan of his other films I appreciate the humour he's written into this movie even more. If there's any doubt that this is a masterpiece, bring up the scene where he visits his parents in any crowd and watch the quotables start flying. When asked what my favorite movie of all time is (a supremely tough question for a movie buff) this one always pops out first. It's cute, smart, hilarious, and no body gets hurt! Watch it! Love it!",
         "\"So I Married an Axe Murderer\" is a delightfully offbeat, inventive comedy I can see again and again, and laugh every time. Mike Myers, in a dual role as the neurotic but romantic Charlie McKenzie and Charlie's cantankerous father, gives the best performance I've seen from him so far (I've yet to see the \"Austin Powers\" movies but I didn't especially care for \"Wayne's World,\" maybe because I couldn't stand Dana Carvey or his character). Nancy Travis is quite good as Harriet, the seemingly perfect girlfriend who's got a secret. The supporting cast also does excellent work, especially Anthony LaPaglia as Charlie's policeman buddy Tony. What makes this movie truly special isn't the principal story line -- the romance-mystery-suspense -- but the many wonderful bits of inspired lunacy/hilarity along the way. Among them: every scene involving the hero's cantankerous dad; Harriet's sister Rose persuading Charlie to stay for breakfast; Phil Hartman's cameo as a very intense tour guide at Alcatraz (this scene gets butchered when the movie is edited for TV, even non-premium cable; make sure you see the uncut version!); Charles Grodin as the surly driver of a vehicle commandeered by a cop; an episode involving a guy who works on the obituary page of a newspaper; the side-splitting scenes between Tony and his precinct captain (a very funny Alan Arkin). There are many such moments throughout the film, turning up in the most unexpected places. The dialogue is witty, and the humor is completely unpredictable and fresh.",
         "Mike Myers gives Waynes World a rest and delivers what I think is a better movie.... well better than Waynes World 2 anyway. It is a truly great movie with Mike playing a duel role, firstly as Charlie MacKenzie a young guy who is scared of commitment to women, then his dad Stuart MacKenzie a very funny Scotsman who could take the lead role in X Files with his ideas on Conspiracy. Nancy Travis stars as a butcher... Harriet, who ends up with Charlie..... A great movie that is very funny in the pre Austin Powers age, a 7 out of 10.",
         "SO I MARRIED AN AXE MURDERER (1993) *** Mike Myers, Nancy Travis, Anthony La Paglia, Amanda Plummer, Brenda Fricker, Alan Arkin, Michael Richards. Hilarious comedy about a marriage phobia plagued neo-Beat poet (Myers) who finds the girl of his dreams (Travis) may in fact be a psychopathic serial killer. Impressive supporting cast with absurdly hilarious situations and performances. Myers also plays his ribald Scottish dad and Charles Grodin has a hysterical cameo.",
         "Charlie Mackenzie (Myers) is a San Francisco coffee house poet whose poems are about all of his failed relationships with women and he's scared of commitment. Things change when Charlie meets Harriet Michaels (Travis) a local butcher who isn't just beautiful but has a heart of gold, their relationship is going great until he suspects Harriet of being Mrs. X a woman who kills her husbands on their wedding night. His friend Tony (Lapaglia) thinks he's just being paranoid but the story reaches a climax when the real murderer is revealed and tries to kill Charlie. The cast includes Brenda Fricker, Amanda Plummer, Alan Arkin and a cameo appearance by Charles Grodin. So I Married An Axe Murderer is one of the funniest yet scary romantic comedies of 1993. Mike Myers also plays the role of Stuart Mackenzie Charlie's father. 8/10 Stars"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Fried/Woods Films"
      ],
      "summaries": [
         "Charlie, a poet, hasn't had much luck with women, but then he meets Harriet, the girl of his dreams.. or is it his nightmares. Charlie begins to suspect that Harriet is Ms X, a woman who marries then kills her husbands.",
         "Charlie MacKenzie is a dedicated San Francisco coffeehouse poet, whose poems revolve around his numerous failed relationships. Every one that ends on his doing because of some weird, inexcusable paranoia. His best friend Tony and mother May can only criticize him for his wrong-doings. But Charlie believes he very well may have found the perfect woman in Harriet, a meat butcher with a heart of gold. But Charlie begins suspecting something about Harriet that may not be so perfect.",
         "A San Francisco poet who fears commitment has a girlfriend who he suspects may not be who she appears."
      ],
      "budget": 0
   },
   "movielensId": 543,
   "movielens": {
      "languages": [
         "Pусский",
         "English"
      ],
      "releaseDate": "1993-07-30",
      "dvdReleaseDate": "1999-06-01",
      "directors": ["Thomas Schlamme"],
      "runtime": 93,
      "movieId": 543,
      "title": "So I Married an Axe Murderer",
      "mpaa": "PG-13",
      "actors": [
         "Mike Myers",
         "Nancy Travis",
         "Anthony LaPaglia",
         "Amanda Plummer",
         "Brenda Fricker",
         "Charles Grodin",
         "Phil Hartman",
         "Debi Mazar",
         "Steven Wright",
         "Michael Richards",
         "Mike Hagerty",
         "Alan Arkin",
         "Patrick Bristow",
         "Cintra Wilson",
         "Al Nalbandian",
         "George F. Mauricio",
         "Kiki Douveas",
         "Marla Sokoloff"
      ],
      "imdbMovieId": "0108174",
      "originalTitle": "So I Married an Axe Murderer",
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "youtubeTrailerIds": ["O3TgDBN7wk4"],
      "plotSummary": "Just after a bad breakup, Charlie MacKenzie falls for lovely butcher Harriet Michaels and introduces her to his parents. But, as voracious consumers of sensational tabloids, his parents soon come to suspect that Harriet is actually a notorious serial killer -- \"Mrs. X\" -- wanted in connection with a string of bizarre honeymoon killings. Thinking his parents foolish, Charlie proposes to Harriet. But while on his honeymoon with her, he begins to fear they were right.",
      "tmdbMovieId": 10442,
      "avgRating": 3.21134,
      "releaseYear": "1993",
      "numRatings": 14370,
      "posterPath": "/3dkBFXZKlpdVizQkaQzRQgsUlcL.jpg"
   }
}