{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "philadelphia",
            "id": 276
         },
         {
            "name": "boat",
            "id": 1422
         },
         {
            "name": "observer",
            "id": 5446
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "homicide detective",
            "id": 180668
         }
      ],
      "imdb_id": "tt0108238",
      "video": false,
      "title": "Striking Distance",
      "recommendations": [
         9319,
         9292,
         9604,
         2124,
         8838,
         10538,
         11517,
         9208,
         2142,
         178,
         2636,
         9869,
         4824,
         4954,
         2320,
         1727,
         11384,
         6723,
         11258,
         7007
      ],
      "backdrop_path": "/nNn1pStpiA0VEhT09GbwIdSG0ik.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Det. Tom Hardy",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023ceb",
               "name": "Bruce Willis",
               "profile_path": "/kI1OluWhLJk3pnR19VjOfABpnTY.jpg",
               "id": 62,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jo Christman",
               "gender": 1,
               "credit_id": "52fe43f29251416c75023cef",
               "name": "Sarah Jessica Parker",
               "profile_path": "/chjO3dDzkT7UzAZk1AGjXdbezyg.jpg",
               "id": 520,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Capt. Nick Detillo",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023cf3",
               "name": "Dennis Farina",
               "profile_path": "/o649nAtUimSZxEV6xa5JbMSgsED.jpg",
               "id": 1117,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Det. Danny Detillo",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023cf7",
               "name": "Tom Sizemore",
               "profile_path": "/soINOuacuiThRb2LyPD4tTWve7C.jpg",
               "id": 3197,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Det. Eddie Eiler",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d2b",
               "name": "Brion James",
               "profile_path": "/4Vm3Zq6arXq3jyFfq3yJgH9Jj2l.jpg",
               "id": 591,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Det. Jimmy Detillo",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d2f",
               "name": "Robert Pastorelli",
               "profile_path": "/bgoNfv93PaKf6Pg3mwyxJZN8CVp.jpg",
               "id": 7866,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Tony Sacco",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d33",
               "name": "Timothy Busfield",
               "profile_path": "/8sQr5B1h0wJ4kOcTgwWyCDfzzYq.jpg",
               "id": 23881,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Lt. Vince Hardy",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d37",
               "name": "John Mahoney",
               "profile_path": "/jK2uDKxfysuYjNAgUxbwyhd4fKD.jpg",
               "id": 4251,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Dist. Atty. Frank Morris",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d3b",
               "name": "Andre Braugher",
               "profile_path": "/9VtD8RlQ0urgDKS7B8tR456dW50.jpg",
               "id": 6861,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Sgt. Fred Hardy",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d3f",
               "name": "Tom Atkins",
               "profile_path": "/gZZx9ByxKyt2idABNwr2XTN9jzU.jpg",
               "id": 11784,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Dispatcher",
               "gender": 0,
               "credit_id": "53aa269d0e0a2646cc000cc8",
               "name": "Jeffrey J. Stephen",
               "profile_path": "/krBGyBelQSG7FOFS7WpKDQSA0eQ.jpg",
               "id": 141582,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43f29251416c75023cfd",
               "name": "Marty Kaplan",
               "profile_path": null,
               "id": 65021,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d03",
               "name": "Rowdy Herrington",
               "profile_path": null,
               "id": 63943,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f29251416c75023d09",
               "name": "Marty Kaplan",
               "profile_path": null,
               "id": 65021,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d0f",
               "name": "Arnon Milchan",
               "profile_path": "/5crR5twLRcIdvRR06dB1O0EQ8x0.jpg",
               "id": 376,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d15",
               "name": "Brad Fiedel",
               "profile_path": null,
               "id": 2722,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d1b",
               "name": "Mac Ahlberg",
               "profile_path": "/a1BF9YiCGQ66Mncin2UmYi1g2iN.jpg",
               "id": 4614,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d21",
               "name": "Pasquale Buba",
               "profile_path": null,
               "id": 15840,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023d27",
               "name": "Rowdy Herrington",
               "profile_path": null,
               "id": 63943,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.488568,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11074,
      "vote_count": 271,
      "budget": 30,
      "overview": "Coming from a police family, Tom Hardy ends up fighting his uncle after the murder of his father. Tom believes the killer is another cop, and goes on the record with his allegations. Demoted to water-way duty Tom, along with new partner Jo Christman, navigate the three rivers looking for clues and discovering bodies. This time the victims are women Tom knows, he must find the killer to prove his innocence.",
      "similar": [
         39874,
         2832,
         984,
         274,
         10285,
         948,
         1359,
         1991,
         1949,
         4232,
         4638,
         181283,
         3597,
         3600,
         10781,
         44247,
         8090,
         1696,
         10585,
         238636
      ],
      "original_title": "Striking Distance",
      "runtime": 102,
      "poster_path": "/swxJEeSHQ6sM23KsLLFoTv8j4hM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Columbia Pictures Industries",
            "id": 5848,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Columbia Films S.A.",
            "id": 6386,
            "origin_country": ""
         }
      ],
      "release_date": "1993-09-17",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "They shouldn't have put him in the water, if they didn't want him to make waves.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Rowdy Herrington"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Rowdy Herrington",
         "Marty Kaplan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108238/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMDEwMTc5N15BMl5BanBnXkFtZTgwMzczNjQxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bruce Willis, Sarah Jessica Parker, Dennis Farina | See full cast and crew »"],
      "reviews": [
         "I'd be lying if I didn't admit this is yet another patterned Bruce Willis flick. The kind where he plays the hard boiled cop with a colorful past, but I gave it a chance. This one finds Willis as Tom Hardy. A cop from a family of cops and things aren't going too well. First off, he's just ratted out his violent partner (Robert Pastorelli) at an official police inquiry and that doesn't win him any fans in the department. Then his depressed former partner jumps off a bridge killing himself. What a load to carry. All of the while there's this killer on the loose and when his father is murdered by him, he lets it be known he thinks the killer is a cop and suddenly he's reassigned to River Patrol. This movie succeeds on a basic level -- it's entertaining. Sure the story is loose and the film's surprises are somewhat stale, but it's all in good fun. Willis gets to look aptly serious and hunt for the killer on the waters and there's just enough suspense to sustain interest and the minor twists of the story keep things at a good pace. Meanwhile the rounded supporting cast keeps things lively and keeps the viewer going, \"Where have I seen him before?\" or \"Hey that's such and such\". I've read on here how people think this is stupid, dumb and lacks any suspense or thrills. Like any of the Die Hard movies had exceptionally smart stories, you didn't know what was gonna happen next or how it would all end. Of course not. For a entry level Bruce Willis flick, this one satisfies. Now if only I could get the Little Red Riding Hood Song out of my mind...!",
         "I don't understand why this film is so over-looked. It has pretty everything fans of Bruce Willis would want. He is a cop, not liked by his fellow officers, and he is on a murder case where no one believes what he has to say. There is action, swearing, one liners, and even some sex. Bruce doesn't usually have that in his films, maybe that is what threw people off. Just Kidding. By all means, this is no masterpiece, but it is an entertaining mystery with an AWESOME car chase. One of the best. Bruce Willis fans should definitely check this movie out. It is pure Bruce and without him the \"lone cop\" story wouldn't work as well nor be as credible as it is because of him. 8/10 Rated R: violence and profanity",
         "More than any film I can remember in a long time, I have never understood why this film hasn't gotten higher ratings than it has. The plot, while not ingenious (and even somewhat predictable) is still exciting and will keep you engrossed. The film's creators get a lot of points in my book for locale creativity. Instead of setting the film in some predictable location such as New York, Los Angeles, Miami or San Francisco they set it in Pittsburgh, PA, definitely not your ordinary movie location. It's one that adds a wonderful freshness to the movie however. The location shooting is outstanding. The scenery is different and excellent, the photography is great, even spectacular in places and the action is on a par with some of the best action films ever, including Bullitt. Who would normally think to expect extensive boating and water action in a state as synonymous with mountains as Pennsylvania is? That alone is worth taking a look at this movie. I do not usually care much for Bruce Willis. I thought he was very well cast in this movie however and Sara Jessica Parker added extra special chemistry. The cast is much better than average overall and includes such outstanding actors as Andre Braugher, of the outstanding tv series \"Homicide\". I thought that the casting in general, as well as the photography, location and action very adequately made up for any possible deficiencies in the plot itself. I would warn that there is extensive foul language in this film, more than is necessary even for a film of this genre in my opinion and probably it's biggest drawback. I would still say that the film is well worth watching when your in the mood for some escapist fun and action fare. As I said earlier, I think the film deserves higher ratings than it's gotten so far. I've watched it twice now (it was just as good the second time, in fact even better) and that definitely won't be the last time I watch it.",
         "I caught this one on TV at about midnight, and I wasn't planning to see more than five minutes of it. I did (why would I write this comment if I didn't) and it kept my interest through the whole film. Bruce Willis and Sarah Jessica Parker were excellent together and the supporting cast was also outstanding. Director Rowdy Herrington also brought us the awful A Murder of Crows (1999), but he didn't ruin this one, even if it did get a little far-fetched in places. An interesting plot line, and Willis is believable in his role. + (GOOD THINGS) 1.) Direction 2.) Chemistry between Willis and Parker 3.) Ending (unlike everyone else, I didn't see it coming) 4.) Length 5.) The score 6.) John Mahoney's performance - (BAD THINGS) 1.) Believability 2.) The script (uneven in places) TOTAL: 7/10",
         "I took a chance on this one on a slow night and wish I hadn't bothered. It started off with some promise and atmosphere, and includes a pretty good car chase early on. However, it then starts throwing bad cliches that you've already seen 100 times in all over the place. The troubled cop is haunted by a past incident and is now a detached loner who drinks far too much. Gee, how many times have we seen that before? Making matters worse, the final 30 minutes become so implausible, ridiculous, and insulting to the audience's intelligence, I found myself yelling insults at the director and producer for their complete and utter lack of imagination. In short, do yourself a favor and pass on this one. There's bound to be something better to do or watch even on the slowest of nights. If you are tempted to take a peek due to the presence of Bruce Willis or because you like serial killer films in general, do so at your own risk, but don't say you weren't warned!",
         "Great support cast. Dialogue between Farina & Willis is as real as it gets. Irish vs Italian is always interesting. Needed more of those scenes. Some cliché movie lines but storyline hides the cheese. Location, Location, Location. All things being equal, I'd rather be in Philadelphia (right: Willis from Die Hard). I prefer Philly movies, but Pittsburgh is a great setting. Not NY. Not LA. I'll take it and it works. Every other profession has been glammed up by Hollywood so river police was a refreshing change. Getting back to the cast, most of them are interchangeable with other actors. But there is no substitute for Dennis Farina as tough cop. He ad libs in his own way as well as Hackman & Matthau. If he's a non-smoker in real life, he should have won an Oscar for this role. This is one of those movies where the pre-quels would be just as action packed. Yeah I know the Episode IV thing has been done before in a galaxy far far away. But these characters would be interesting in their younger years.",
         "Actually watched this on a bus ride home. Found myself entertained for once! Bruce Willis plays good cop Tom Hardy, who's convinced the police killed his dad and framed some poor sap. He opens his big mouth too often and they demote him to river duty! Tom is still on the job and now he's partnered with sexy diver Jo (Sarah Jessica Parker). They keep finding dead women and Tom realizes the killer is toying with him! Tom and Jo hook up, and I actually found their romance quite charming, has SJP ever been bad in anything? She's a really good actress and looks great in this, and try to actually solve the murders, which angers his uncle, played by the underrated Dennis Farina. Even the chief, a ogre of a cop played by the terrific late character actor Brion James, just wants Tom to stay quiet. His cousin Jimmy, I couldn't believe that was Robert Pastorelli, the guy from \"Murphy Brown\" he was totally dissolved into the part, just seems like a wise-ass, but watch him. The film is well paced and nicely shot, I liked that the Ohio river seemed smelly like in real life. Willis actually bothers to act here, though I understand he didn't like the film, and you won't see the killer coming. Striking Distance is a good action flick, with an excellent cast. Its rated \"R\" for profanity and violence.",
         "A cop receives phone calls wherein he hears the murders of young women perpetrated by a wily serial killer. Okay, the premise is not new. It is a bit reminiscent of the Zodiac killer, but only a bit. The truth is, only a big star like Willis could pull this one out of the $1 bin and set it upon the eye-level shelves. Fortunately, Willis and Sarah Jessica Parker manage to do just that. This film is highly underrated and under-appreciated, and wrongly so. The performances by even the supporting cast (actors who are known for lesser films and lesser performances) are wonderful. No, I'm not trying to say this film is Oscar-worthy, but it IS highly entertaining. It properly generates atmosphere, and delivers upon generation. All in all? I found this work entertaining and enjoyable. It rates an 8.3/10 from... the Fiend :.",
         "I'm not going to say it's original, because it isn't. I'm not going to say it's unpredictable, because it isn't. I am going to say that it was enjoyable. Sure the whole maverick, womanising cop with a bit of an alcohol problem thing is fairly worn out, but still, it works. Truth be told I actually guessed who the killer was before the end- it was a little obvious. The only real shock was when it was revealed that Sarah Jessica Parker was actually working undercover to 'spy on' Bruce Willis (there was certainly a lot to spy on in some scenes, if you know what I'm saying). I did say that it wasn't very original. It is in fact stereotypical Bruce Willis. At the same time, however, there is a certain timelessness to stereotypical Bruce Willis films. The one-liners never get annoying, the action is never not exciting, the swearing is never nonexistent and the nudity is always manageable but yet somewhat awkward for a teenager such as myself. It was well-acted, well-shot and a perfectly enjoyable action film.",
         "Detective Tom Hardy (Bruce Willis) grows up in the family of cops. Hardy turns against his uncle Captain Nick Detillo (Dennis Farina), since he believes that he's protecting somewhere who's corrupted and fighting him since the death of his dedicated Lt. Vince Hardy (John Mahoney). When Hardy's cousin Jimmy (The late Robert Pastorelli) committed suicide from jumping off a bridge. Since Hardy knew there was something wrong with his cousin. Since Hardy's get fired from his job believing that a cop has murder womens in the streets of Pittsburgh but he can't prove it. Months has passed, now Hardy works for the boat patrol for the city. He's forced to work with a young by the book officer Jo (Sarah Jessica Parker) as his new partner. Which Hardy prefers to be alone. When Hardy is called on the crime scene to the river to discover that the latest murders are woman, which Hardy knew before. Now the killer calls Hardy from his phone and he wants to play of Cat & Mouse with him. He has to find the next victim before it's too late, while the local police especially his uncle thinks that Hardy isn't right in the head. Directed by Rowdy Herrington (Road House) made an watchable-thriller that tries to be suspenseful but overall the script is quite predictable sadly. The identity of the villain is too easy to guess for most viewers. Since Willis' was quiet disappointed with his experiencing working this forgotten thriller. But it is not boring, thanks to a strong cast that includes Tom Sizemore, The late Brion James, Andre Braugher and more that keeps this far from being boring. Willis tries to do something different with his role. But his scenes with the character Jo slows the movie down, especially when they start a romance. It is quite unintentionally funny at times and way over the top towards the conclusion. Herrington's previous picture \"Road House\" was much more fun to watch than this failed effort. \"Striking Distance\" is one of those films that certainly plays better on TV and fans of Willis' work might enjoy this movie much more than others. Check your brain out the door before watching it. (***/*****)."
      ],
      "genres": [
         "Action",
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "A serial killer is back in Pittsburgh to torment the former homicide detective who was on his trail years before. Tom Hardy, who has been relegated to water-way duty, along with new partner Jo Christman, navigate the three rivers looking for clues and discovering bodies. This time the victims are women Tom knows, he must find the killer to prove his innocence.",
         "Tom Hardy comes from a family of cops and has just broken the cardinal rule--never speak out against another cop, which he did. Which now makes him persona non grata with the other cops. Presently there's a serial killer on the loose and when Tom and his father and some other cops corner him, a big chase ensues and when it is over Tom's father is dead, supposedly killed by the perp. Later a suspect is brought in whom Tom doesn't believe is the one but most of the cops just don't want to believe him or think that he's objective is clouded. Eventually he is drummed out and the only position he could get is at river rescue. Two years later he still sticks to his beliefs and apparently the killer is back but everybody doesn't believe him and some people think that he is copy catting the killer.",
         "Tom Hardy is a fifth-generation cop. When his father dies during the chase of a serial killer, Hardy further complicates matters by implicating his partner and cousin Jimmy in a police brutality case. Two years after Jimmy is believed to have committed suicide, women from Hardy's past start to turn up dead, and his father's alleged killer is found. Believing that the alleged killer is a patsy, Hardy conducts his own illegal investigation into his father's own death, and the women's deaths as well. In a riveting climax, Hardy and the killer ultimately lock horns in a showdown that ties all the loose ends on both cases.",
         "Coming from a police family, Tom Hardy ends up fighting his uncle after the murder of his father. Tom believes the killer is another cop, and goes on the record with his allegations. Demoted then to river duty, the killer taunts Tom."
      ],
      "budget": 30000000
   },
   "movielensId": 544,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-09-17",
      "dvdReleaseDate": "1998-07-14",
      "directors": ["Rowdy Herrington"],
      "runtime": 102,
      "movieId": 544,
      "title": "Striking Distance",
      "mpaa": "R",
      "actors": [
         "Bruce Willis",
         "Sarah Jessica Parker",
         "Dennis Farina",
         "Tom Sizemore",
         "Brion James",
         "Robert Pastorelli",
         "Timothy Busfield",
         "John Mahoney",
         "Andre Braugher",
         "Tom Atkins",
         "Jeffrey J. Stephen"
      ],
      "imdbMovieId": "0108238",
      "originalTitle": "Striking Distance",
      "genres": [
         "Crime",
         "Action",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["5PbX4LXD6Es"],
      "plotSummary": "Coming from a police family, Tom Hardy ends up fighting his uncle after the murder of his father. Tom believes the killer is another cop, and goes on the record with his allegations. Demoted to water-way duty Tom, along with new partner Jo Christman, navigate the three rivers looking for clues and discovering bodies. This time the victims are women Tom knows, he must find the killer to prove his innocence.",
      "tmdbMovieId": 11074,
      "avgRating": 2.92767,
      "releaseYear": "1993",
      "numRatings": 2309,
      "posterPath": "/swxJEeSHQ6sM23KsLLFoTv8j4hM.jpg"
   }
}