{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "saving the world",
            "id": 83
         },
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "royalty",
            "id": 9920
         },
         {
            "name": "dinosaur",
            "id": 12616
         },
         {
            "name": "based on video game",
            "id": 41645
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "multiple dimensions",
            "id": 194215
         }
      ],
      "imdb_id": "tt0108255",
      "video": false,
      "title": "Super Mario Bros.",
      "recommendations": [
         11667,
         1497,
         1498,
         9312,
         9612,
         9823,
         10336,
         11158,
         1499,
         11597,
         9644,
         16314,
         2157,
         8831,
         1649,
         2436,
         12139,
         10414,
         9493,
         9824
      ],
      "backdrop_path": "/prtM6joU0bEKJjyb4mWoEZjDkHl.jpg",
      "revenue": 20915465,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Mario Mario",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba52d",
               "name": "Bob Hoskins",
               "profile_path": "/mIgAC6q5HcHHxZUIiCOvE6mHLGs.jpg",
               "id": 382,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Luigi Mario",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba531",
               "name": "John Leguizamo",
               "profile_path": "/rbq24AzthnwRXUYcVfUnP5bKN50.jpg",
               "id": 5723,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "King Koopa",
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba535",
               "name": "Dennis Hopper",
               "profile_path": "/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg",
               "id": 2778,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Princess Daisy",
               "gender": 1,
               "credit_id": "52fe4510c3a36847f80ba539",
               "name": "Samantha Mathis",
               "profile_path": "/dzUjIFu7AAbwwJfj6aFRPfvYgC3.jpg",
               "id": 20767,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Iggy",
               "gender": 2,
               "credit_id": "56c0ff54c3a368180a00de7c",
               "name": "Fisher Stevens",
               "profile_path": "/TutpOyw0A6FF5hEoFDYseI2EVN.jpg",
               "id": 26473,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Spike",
               "gender": 2,
               "credit_id": "56c0ff729251410ae6000b4f",
               "name": "Richard Edson",
               "profile_path": "/7YegwxrBppretnwGEEMxEI453Ef.jpg",
               "id": 6396,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Lena",
               "gender": 1,
               "credit_id": "56c0ff94c3a36817f200d0b7",
               "name": "Fiona Shaw",
               "profile_path": "/74b0OuN3xKs0dTMYBnbhDLwv8Oq.jpg",
               "id": 10981,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Toad",
               "gender": 0,
               "credit_id": "56c0ffc4c3a36817e400532c",
               "name": "Mojo Nixon",
               "profile_path": "/tU7JuVTqw45xtdtArnozQCMI7KO.jpg",
               "id": 939703,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "The King",
               "gender": 2,
               "credit_id": "56c100f7c3a368180a00de9d",
               "name": "Lance Henriksen",
               "profile_path": "/wf4Pr9RxsHGd0O9fLPiB3Al8IVC.jpg",
               "id": 2714,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "56c1012392514108d300099f",
               "name": "Dan Castellaneta",
               "profile_path": "/u1fr7FgO1rw7lLLst64LPoqAw9x.jpg",
               "id": 198,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4510c3a36847f80ba4f3",
               "name": "Annabel Jankel",
               "profile_path": "/t7mhYWKHHjG5gQUB7gq9oyE3Z5y.jpg",
               "id": 58164,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba4f9",
               "name": "Rocky Morton",
               "profile_path": "/neGDKDOkpWJ5mmEzn3YaEp1mmWn.jpg",
               "id": 58165,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4510c3a36847f80ba4ff",
               "name": "Parker Bennett",
               "profile_path": null,
               "id": 58166,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4510c3a36847f80ba505",
               "name": "Terry Runte",
               "profile_path": null,
               "id": 58167,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba50b",
               "name": "Ed Solomon",
               "profile_path": "/dfhHU0NT1mtEhfuPZgNSHe1N1lH.jpg",
               "id": 9612,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba511",
               "name": "Jake Eberts",
               "profile_path": null,
               "id": 2359,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4510c3a36847f80ba517",
               "name": "Roland Joffé",
               "profile_path": "/kis74mAa2ZsccFr1ToDsrkMy7Gn.jpg",
               "id": 8965,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba51d",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba523",
               "name": "Dean Semler",
               "profile_path": "/AnqGebF9LTL5mkertSBIegQvlB7.jpg",
               "id": 4501,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4510c3a36847f80ba529",
               "name": "Mark Goldblatt",
               "profile_path": null,
               "id": 898,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "554ec10fc3a3687b7d00052c",
               "name": "Roger Huynh",
               "profile_path": null,
               "id": 1460602,
               "department": "Visual Effects",
               "job": "Visual Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 8.808382,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9607,
      "vote_count": 307,
      "budget": 48000000,
      "overview": "Mario and Luigi, plumbers from Brooklyn, find themselves in an alternate universe where evolved dinosaurs live in hi-tech squalor. They're the only hope to save our universe from invasion by the dino dictator, Koopa.",
      "similar": [
         8967,
         234004,
         411,
         326359,
         433,
         38843,
         818,
         112160,
         858,
         89,
         141,
         298312,
         244772,
         634,
         773,
         437557,
         297762,
         242224,
         277216,
         10054
      ],
      "original_title": "Super Mario Bros.",
      "runtime": 104,
      "poster_path": "/bmv7fmcBFzjnJvirfAdZm75qERY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinergi Pictures Entertainment",
            "id": 1504,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Allied Filmmakers",
            "id": 1755,
            "origin_country": ""
         },
         {
            "logo_path": "/r2EGQhzBsx7GON251DPpfsWtaj2.png",
            "name": "Nintendo",
            "id": 12288,
            "origin_country": ""
         }
      ],
      "release_date": "1993-05-28",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "This Ain't No Game.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Annabel Jankel",
         "Rocky Morton"
      ],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Parker Bennett",
         "Terry Runte"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108255/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDc3OTQ1OTkwNV5BMl5BanBnXkFtZTcwMzUzOTUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bob Hoskins, John Leguizamo, Dennis Hopper | See full cast and crew »"],
      "reviews": [
         "First off.... I absolutely love this movie. It's such a treat to a fan with a good imagination. Secondly, why would anyone in their right mind take this kind of movie seriously, to the point of bashing it for things like \"being to fake\" and \"not sticking to the Mario bro's storyline.\" People, in the games all Mario did was jump around, bop things on the head, throw fireballs around, and fly. If they would have made movies about that people would be asleep before the first 5 minutes. This movie was meant to entertain and captivate, and it certainly does the trick. They took the classic game and adapted it to a fantasy reality that parallels our own and for that, it was simply brilliant. The rendition of koopa-manhattan was great and is not something that people should criticize. The city adds life the the movie, it makes it real in it's own fantastic way. It makes the city so crazy it works. And boy oh boy did those goomba's make me laugh. I love this movie for everything it relates to the game and everything it added to make it a more fun-filled ride. If you love the games and have an open minded imagination, this is a must watch movie",
         "This is a cheesy movie for people who play video games. I don't understand why some people adamantly insist this movie should never have been made. It's cute and entertaining. It doesn't stay completely loyal to the game storyline, but Bob Hoskins and John Leguizamo are perfect for these two roles. Worth watching if you see it on TV.",
         "Yes, this no classic, but it's not that bad. And yes it bears no resemblance to the video games that inspired it except for the jumpsuits that look like the heroes overalls, but it's not bad. Mario & Luigi (Bob Hoskins & John Leguizamo) are the two down on their luck brother plumbers who get involved with a college student named Daisy (Samantha Mathis) who turns out to be a princess from an alternate dimension. Once transported there themselves, they must fight the evil King Koopa (Dennis Hopper) and save their world from being merged with Koopa's and the human race from being turned into monkeys. It may be hard to believe that John Leguizamo is Bob Hoskins brother, but the two have good chemistry and John has a convincing Brooklyn accent (although Tom Selleck would have been a more convincing Luigi in some respects). Bob reprises his gruff detective persona from \"Who Framed Roger Rabbit\" to great effect. Samantha Mathis is cute as the princess and manages to feel less shallow than most heroines in these situations. Dennis Hopper hams it up as the film's villain. Lots of gags and good natured humor, and a beautiful song from Roxette, \"Almost Unreal\". Worth a rental.",
         "Let me start off by saying that this is a great movie. Many people were expecting this movie to be piece for piece off of the video game which is pretty stupid considering that the Mario bros. games don't really have too much of a storyline besides just saving the princess from Koopa. The fact that they kept the basic ideas of the Mario games and added on their own take of it was great in my opinion. The actors were good and were perfect for their parts (especially Bob Hoskins). If people want to see a \"perfect\" Mario bros. movie where all there is too watch is a person jumping on monsters and going down pipes just because its true to the video game than please by all means go make one and see how many people don't fall asleep while watching it. I believe people should see it with an open mind instead of watching it hoping to see an exact replication of the game.",
         "It is clear that this film has been unfairly dismissed. OK, so it doesn't fit the criteria of a 'good film', but, it's a great kids film. It's dark and strange, things generally uncommon of kids films, and, if it wasn't for watching this film as a child, I wouldn't be into people like cronenberg, lynch and, in particular, Gilliam, whose sinister darkness I enjoy so greatly. It is self-evident that there is a lack of imagination, especially recently, in the kids film genre, and this is where Super Mario Brothers earns the 7 out of 10 that I have given it. My film collection would be much less exciting without having watched this film as a child. This is why I urge those of you who have given it a poor rating to re-evaluate, considering what I have said.",
         "I made the mistake of watching this movie the day i had knee surgery. So i was doped up on all kinds of pain killers and thought the movie was great. However a few years later i remembered how much i enjoyed the movie so i watched on tv when it was run agian. I was blown away with how horribly bad it was. I was also amazed on how much i remembered being in the movie that wasnt. so as the title says be careful how you watch. As a side note this is not an endorsement to do drugs just to make bad movies better.",
         "The plot:Two plumbers who are known as the Marios, meet a strange young girl that has a rock on her neck. Two idiots from another world kidnap the strange girl known as Daisy, after kidnaping other girls from Brooklyn. The two Marios decide to rescue her from the Two Idiots that have taken her to another world ruled by an evil king known as Koopa. The View:Performances aren't the major thing here, but the special effects and creations are to be noticed more. The movie itself isn't bad and as a comedy, will have a few(just a few)giggles. It's all really just a fun fantasy movie that just doesn't shine through and doesn't make any effort to make an historical movie, but the film is fun and you will enjoy it as a complete no-brainer. ***",
         "If you watch this movie as if it had no connections to the video game...It's not that bad. I loved the sets. The actors were great. And It's basically the same rescue the princess story but in a different setting. Like a more Modern Day Mario. Like I said it's the same Mario Brothers but in a different world. To me Bob embodies Mario perfectly. And So Does John as Luigi. All he needed was the mustache and maybe someone else's voice. It has some really cool action sequences. And I love the flame thrower thing. They could have done a better job on the goombas and koopa though. Look at it as a Mario reference movie. And not the Live Action Mario Movie. And most of all. Keep an open mind and enjoy for what is. And not what everyone thought it was suppose to be. Watch this and then watch the film again http://www.youtube.com/watch? v=od-FughI-C8",
         "This movie is much hated practically everywhere and of course I can understand why. Basically everyone from the '70's , 80's and 90's generation grew up with playing Nintendo games and the Super Mario games in particular. However when one sees this movie, it becomes pretty obvious early on that this movie has almost nothing to do with the Super Mario video games. The atmosphere, settings and characters are totally different, which is probably the main and also only reason why this movie was and still is hated among so many all over the world. However, when one has to look at this movie with a fair and unbiased view, one has to come to the conclusion that this movie is good decent entertainment. No, it's not a GREAT movie but it does serve its purpose and that is to provide the viewer with 104 minutes of mindless, simple entertainment. Kids will most likely like this movie best. The story is wonderfully adventurous and it all is very childishly simple constructed. I mean, the story and setting all basically have very little to do with the games but when you just have to judge the story, it's a pretty good and well thought out one. If the main characters were, let's say, some average Manhattan plumbers named the William's brothers and the entire movie wasn't based on a series of video games, than perhaps the movie would had received a far better reception and would had entertained and reached a wider audience. All of the characters are pretty entertaining and work out well in the movie. This is probably mainly due to the well known cast. Bob Hoskins and John Leguizamo are the Mario brothers and they form a pretty good main duo. Dennis Hopper also is in his element as the ruthless, over-the-top, stereotyped villain King Koopa. He gives the movie a certain extra fun and flair. Other well known actors in the movie are Fiona Shaw, Gianni Russo (Carlo Rizzi from the first two The Godfather movies) and Lance Henriksen in a very small cameo role. Unlike the games, the movie is a dark one. All of the sets are dark which was perhaps not the greatest atmospheric mood for the story and the entire movie in general. All of the sets are disappointing, small and unimaginative looking. Same goes for the costumes and most of the make-up effects. The movie however has some good and convincing looking early special effects. Remember folks, that it was 1993 when this movie was released. The movie however is most of the time a bit too childishly told and the dialogs are below par and too simple. The pace and editing is good but the movie severely lacks some action and real interesting moments. At moments it takes too long before something good or interesting happens again, which makes this movie perhaps a bit boring and uninteresting to watch at certain points. All in all it's a not very successful- but still yet entertaining first attempt at making a movie based on a video game. Certainly better than some of those movies based on video games, released this present day! 6/10 http://bobafett1138.blogspot.com/",
         "Super Mario Bros the Movie manages several well-known things - firstly it's the first ever mainstream Video Game Movie adaption, and secondly star Bob Hoskins has stated it as the worst film he's ever made. So how can I review this film so highly, despite the main star's objections to the quality of it? The truth of the matter is that this film isn't as terrible as the hype states it is. Being the first Hollywood adaption of a video game series, and being different from it's source material, there wasn't really anything to compare it to. If you were hoping for a genuine conversion of the game's storyline into a movie, then you are going to be highly disappointed - but then you've made a rather rash assumption that the basic story of the game series would work as a film to begin with. Movies need to be like epic events, a major moment of the character's lives cataloged within an hour and a half (minimum). The game's theme of 'Bowser has the Princess, run into castle and have toad say \"Your Princess is in another castle\" 7 or 8 times before the end' doesn't make for a good film. Excuses aside, the film does succeed in the way it intends to. It is extremely fun. Unlike other films with it's reputation, the Super Mario Bros Movie is genuinely enjoyable and even more so thanks to the few downfalls in it's script. Bob Hoskins cracks me up as Mario \"Get Your Belt on Kid! We're going' in!\", and Dennis Hopper is clearly the inspiration for Doctor Evil from Austin Powers \"See you later, Alligator\". The movie manages to do something few films manage - it improves with age. I'm not going to state that it's as superb as Blade Runner (As stated on the box), because they're from two very different worlds. Blade Runner is a classic in terms of being a thought-provoking high-caliber sci-fi drama, Super Mario is a classic in terms of being a cheesy fun-fueled thrill-ride. The only reason these two were compared in the first place was the similarity of a run-down ugly futuristic city, both of which were furnished with surprisingly high quality set design and standards. I would love to see a full Blu-Ray restoration of this movie because there is so much intricate work done on the backgrounds and in the details that the additional quality Blu-Ray affords would allow us even more joy. There are some good jokes in here, the pace is good and never slacks, and while there are some bad script- writing problems the enjoyment should allow most people to gloss over those issues without much problem (Look at Star Trek 2009, horrific script, plot holes and some truly terrible Hollywood writing but because it was so fun and full of action, it is hailed as a great film). This makes it more closely related to being the Star Trek 09 movie of its day, with special effects that were (at the time) really impressive and a mixture of family humor and more adult action (Bob Hoskins sticking his face in a black woman's chest - golden). I would love to see a restored Blu-Ray of this movie, as it is a great fun movie. It is more fun than many more recent video game based movies (The Resident Evil series is stale, the Degeneration movie was miss-able, the Final Fantasy films were badly directed, they even got it wrong with Yakuza: Like A Dragon...), most are bland (Something nobody could say about Super Mario Bros, whether they like it or not) or outright horrific, especially if made by Uwe Boll. Super Mario Bros is not the best movie ever made, but it never intended to be. It wasn't supposed to be a movie epic like Blade Runner or 2001: A Space Odyssey, nor was it supposed to be a direct translation of the game, which in itself would have been far worse and less enjoyable. It was intended to stand on its own two feet as a fun, family-oriented action movie with darker sci-fi undertones and while it never accomplishes them to perfection, it certainly succeeded well enough to continuously provide a fun and entertaining movie experience. Some ideas are quite cool, others are a little childish, but that tends to come with the territory with family-friendly Hollywood movies. Again, now more than ever, Nintendo are family-oriented and their Wii console is centered around allowed the kids in as much as the teens and adults - another sign of this film being more accurate now than it was even at the time of its release. As for possible Blu-Ray extras, I would adore an audio commentary by Bob Hoskins with him just hating on the film. You can imagine that would be a funny commentary. The Raw Deal Blu-Ray has an HD extra of a movie critic slating the movie. He-man DVDs have fan-commentaries ragging on the quality of the episodes while still speaking fondly of the series they adore. If the extras on these don't harm the sales, then the same thing for Super Mario Bros would only raise the sales of this film as people would be keen to hear what he has to say since his outbursts on the movie in the media. Other extras can include original script outlines and differences, several deleted scenes and the possibility of a re-cut. I hope to see a decent Blu-Ray release of this movie soon. They've got Blu-Ray releases of Street Fighter, Mortal Kombat and other video game movies of the era, Super Mario deserves at least the same."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Allied Filmmakers",
         "Cinergi Pictures Entertainment",
         "Hollywood Pictures"
      ],
      "summaries": [
         "Can you make a movie out of a video game? That's the question that is answered by this film. Mario Mario and Luigi Mario, two hard working plumbers find themselves in an alternate universe where evolved dinosaurs live in medium hi-tech squalor. They find themselves the only hope to save the Earth from invasion.",
         "This is the story of two hard-working Italian plumber brothers named Mario Mario and Luigi Mario, who befriends a young paleontologist named Daisy. She uncovers a massive find of mysterious new dinosaur bones. While exploring the tunnels where dinosaur fossils lay, saboteurs hired by the Mario Bros. rival businessman, Anthony Scapelli, to break some underground pipes. Meanwhile, in a hidden world called Dinohattan, King Koopa's land is running out of water and going through problems so he sends Spike and Iggy to kidnap Daisy! Now the Super Mario Bros. find themselves the only hope to save the Earth from invasion then challenge a diabolical lizard king and they must battle giant reptilian goombas, outwit misfit thugs, and undermine sinister scheme by taking over the world!",
         "Mario and Luigi, two wacky plumbers, undertake a daring quest to save a princess in Dinohattan -- a hidden world where the inhabitants evolved from dinosaurs! Mario and Luigi face deadly challenges from a diabolical lizard king and must battle giant reptilian goombas, outwit misfit thugs, and undermine a sinister scheme to take over the world!",
         "Two Brooklyn plumbers, Mario and Luigi must go to another dimension to rescue a princess from the evil dictator King Koopa and stop him from taking over the world."
      ],
      "budget": 42000000
   },
   "movielensId": 546,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-05-28",
      "dvdReleaseDate": "2003-06-03",
      "directors": [
         "Annabel Jankel",
         "Rocky Morton"
      ],
      "runtime": 104,
      "movieId": 546,
      "title": "Super Mario Bros.",
      "mpaa": "PG",
      "actors": [
         "Bob Hoskins",
         "John Leguizamo",
         "Dennis Hopper",
         "Samantha Mathis",
         "Fisher Stevens",
         "Richard Edson",
         "Fiona Shaw",
         "Mojo Nixon",
         "Lance Henriksen",
         "Dan Castellaneta"
      ],
      "imdbMovieId": "0108255",
      "originalTitle": "Super Mario Bros.",
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["wtMZKYnLg5c"],
      "plotSummary": "Mario and Luigi, plumbers from Brooklyn, find themselves in an alternate universe where evolved dinosaurs live in hi-tech squalor. They're the only hope to save our universe from invasion by the dino dictator, Koopa.",
      "tmdbMovieId": 9607,
      "avgRating": 2.08909,
      "releaseYear": "1993",
      "numRatings": 6409,
      "posterPath": "/bmv7fmcBFzjnJvirfAdZm75qERY.jpg"
   }
}