{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "artist",
            "id": 2679
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "band",
            "id": 33624
         }
      ],
      "imdb_id": "tt0113158",
      "video": false,
      "title": "Georgia",
      "recommendations": [
         23333,
         40562,
         88052,
         125034,
         82432,
         253277,
         47889,
         172824,
         74790,
         159153,
         104043,
         28026,
         257249,
         350362,
         60792,
         84278,
         172469,
         60158,
         17168,
         90949
      ],
      "backdrop_path": "/3GYEt6EICZDmCbBTHnZJa4TD0JJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sadie Flood",
               "gender": 1,
               "credit_id": "52fe49de9251416c750d60cb",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Georgia Flood",
               "gender": 1,
               "credit_id": "52fe49de9251416c750d60cf",
               "name": "Mare Winningham",
               "profile_path": "/hDaZAbMo9fLranbNDei5e0t8VjL.jpg",
               "id": 51544,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jake",
               "gender": 2,
               "credit_id": "52fe49de9251416c750d60d3",
               "name": "Ted Levine",
               "profile_path": "/7O3vgqgicfNeGr3leC0qB074fjX.jpg",
               "id": 15854,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Axel Goldman",
               "gender": 2,
               "credit_id": "52fe49de9251416c750d60d7",
               "name": "Max Perlich",
               "profile_path": "/baFBjA3vKNqZCbXrJepVweeLj3d.jpg",
               "id": 7268,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bobby",
               "gender": 2,
               "credit_id": "52fe49de9251416c750d60db",
               "name": "John Doe",
               "profile_path": "/EuDIT3BBTqkkLKD8wgp7MwuGCx.jpg",
               "id": 42746,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Herman",
               "gender": 2,
               "credit_id": "52fe49de9251416c750d60df",
               "name": "John C. Reilly",
               "profile_path": "/3LpfXon9xQZc1M2AFvfXyLeICbg.jpg",
               "id": 4764,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Trucker",
               "gender": 2,
               "credit_id": "52fe49de9251416c750d60e3",
               "name": "Jimmy Witherspoon",
               "profile_path": null,
               "id": 590356,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Chasman",
               "gender": 2,
               "credit_id": "52fe49de9251416c750d60e7",
               "name": "Jason Carter",
               "profile_path": "/ytMY52hZiaaL21wh9dkyabZwX1k.jpg",
               "id": 52308,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49de9251416c750d60c7",
               "name": "Ulu Grosbard",
               "profile_path": null,
               "id": 140354,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49de9251416c750d60ed",
               "name": "Barbara Turner",
               "profile_path": "/iPSb5pqku8Q26tbPUb9Y8UelrS4.jpg",
               "id": 72583,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "5aa51c6b925141278401f2f9",
               "name": "Melissa Matthies",
               "profile_path": null,
               "id": 1995909,
               "department": "Art",
               "job": "Property Master"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.28454,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 97406,
      "vote_count": 16,
      "budget": 0,
      "overview": "Sadie looks up to her older sister Georgia, a successful folk singer who's happily married with children, but can't break out of the bar-band circuit and hit the big time she desperately covets. It's in part due to her attraction to drugs and booze, and also to her own unwise choice in men. Finally, though, Sadie's Achilles heel is a rough, unlovely voice very different than her sister's crowd-pleasing singing.",
      "similar": [
         28026,
         786,
         627,
         179144,
         8363,
         525,
         824,
         4771,
         6075,
         18947,
         109421,
         106646,
         4995,
         27,
         69,
         122081,
         75174,
         23514,
         339692,
         306819
      ],
      "original_title": "Georgia",
      "runtime": 115,
      "poster_path": "/1zyWzArwbwoacn1M7QR9mB7VPr7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CiBy 2000",
            "id": 7832,
            "origin_country": ""
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         }
      ],
      "release_date": "1995-05-19",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The toughest act to follow was their dreams.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ulu Grosbard"],
      "runtime": 115,
      "synopsis": "This plot synopsis is empty. Add a synopsis",
      "writers": ["Barbara Turner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113158/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMjgyNTk3OF5BMl5BanBnXkFtZTcwNTIxODcxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Jennifer Jason Leigh, Mare Winningham, Ted Levine | See full cast and crew »"],
      "reviews": [
         "I suppose 'Georgia' makes a more mellifluous title than 'Sadie,' because that's the Flood sister that gets the lion's share of attention in this movie. Sister Georgia has built herself a career as a successful country music singer and has a stable marriage and family life. Sadie sings too, sort of; she's not that good and performs with semi-pro bands in mostly empty nightclubs. The two women have a complex and fragile relationship. Sadie seems to love her sister and admire her talent, but just below the surface lurk envy and resentment. Georgia for her part is always polite but somewhat on edge when Sadie is around, as if she's afraid her sister might lose control of herself and do something stupid or embarrassing. That fear is not unfounded, for Sadie is, as one critic described her, an emotional black hole, the kind of person who sucks in all the concern and attention in a family. She's also a substance abuser who is always walking on the edge of personal destruction. The movie was written by Barbara Turner, mother of Jennifer Jason Leigh who plays Sadie, and directed by Ulu Grosbard. They tend to underplay rather than overplay Sadie's drug use and erratic behavior. She often threatens to do something out-of-control or embarrassing but most often stops just a bit short. Only once in the film is she shown really suffering the ill effects of being a junkie, but it's a harrowing scene. Also, Sadie and Georgia are often right on the verge of an emotional bust-up scene, but they only really have it out one time as well. This keeps the film from degenerating into caricature but it may stop it from being a great film rather than just a good one. Director Grosbard took one very large chance on a scene where Sadie is Georgia's guest onstage at a benefit show. Sadie sings a Van Morrison song, \"Take Me Back,\" stretching it out with her own improvised lyrics before an uncomfortably silent audience, forcing Georgia to come to both Sadie's and the crowd's rescue. To make this scene work, Grosbard had to let the song run on a long time, some eight minutes. This runs the risk of alienating some viewers and providing an easy target for critics, but you have to admire the daring it took to include it. 'Georgia' is a good, solid, if not spectacular film about sibling rivalry and family relations. Leigh is good in her role, as is Mare Winningham as the more subdued title character. Of the supporting cast I especially liked Max Perlich as a hero-worshiping fan that Sadie uses by turning him into her husband.",
         "This movie really touched me. It made me feel so much, and it moved me in so many ways, I can't even put a name on all the emotions it awoke within me. It contains some great music from Lou Reed, Van Morrison and Elvis Costello just to name a few. But the movie belongs to Jennifer Jason Leigh, whose performance as singer Sadie Flood, the sister of a another - but famous - singer, Georgia (Mare Winningham), was the best in 1995. She should've got the Academy Award (OK, Susan, Sharon, Elizabeth, Meryl and Emma were all good, but really... the characters they played were not nearly as complex as Jennifer's, except maybe for Elizabeth's). Jennifer Jason Leigh always give great performances, and I'm pretty sure she'll get an Oscar eventually too. She deserves it. Anyway, this movie is a definite 10-pointer. Go rent it. It's money well-placed, I assure you!",
         "This film presents a fairly accurate portrayal of the chaotic, symbiotic environment of the bar band music scene. If you are looking for a coherent, one-two-three plot and are expecting realism at the same time, forget it. You would be missing the point. Having \"been there\" and \"done that\", I can affirm that this movie does a pretty good job at portraying interesting and realistic snapshot views of people in this particular music genre. In addition, this film even goes so far as to attempt realistic discriminations between different types of musicians (e.g., between ones who want to just succeed, ones who just want to play, ones who can't get their lives together enough to make it, starving artists, etc.). This film initially may seem innocuous and even simplistic to some casual viewers. I must admit that I didn't get much the first time I casually viewed it. \"Georgia\" is very layered and textural -- the more you stand back and look, the more you can almost reach out and touch it -- but, as with most true art -- one must stand back and really take a look at it to appreciate the many layers. The layers of this particular artwork is done via multiple, sometimes concurrent, relationships, which intermittently share the foreground and the background with some really great music and various elements of the music scene. There is the relationship between Georgia and Sadie -- of course, the most obvious relationship that maintains precedence, but if you spend too much time on this one, you will miss so much. There is the Sadie-Axel layer; the Sadie-Georgia's husband layer; the Sadie-Herman layer; the Sadie-and the music layer; the Sadie-Sadie layer; the Sadie-drugs layer; the Sadie-father layer; on and on. All these relationships involving Jennifer J.L's character puts a lot of pressure on J.J.L, and I think she brings it about beautifully. I don't find her \"overacting\" in any scene -- the only \"overacting\" that is done is done by Sadie, not by J.J.L. J.J.L. has rarely disappointed me in her character portrayals. I have always found her an interesting sort of actress: she does not have that obvious physical \"stand out\" star quality about her, but more of a quiet, well-played character actress, genuine star quality about her. I think she, along with the other actors in this movie, did a terrific job with very difficult material (about a very unusual and difficult, but interesting, lifestyle), and this movie calls out to me to watch it every time it plays on my satellite service. This movie should not be judged along with \"standards\". It is a rare piece of filmwork, and should be judged entirely on its own standalone merits.",
         "Georgia is a stark and harrowing exposition into the relationship of two sisters, Sadie played by Jennifer Jason Leigh and the eponymous Georgia played by Mare Winningham (best supporting actress nominee 1996). The film follows Sadie, a young woman trapped within her envy and aspirations to achieve the success, and more importantly recognition, of her older sister Georgia, a revered folk and country singer in the pacific north west of America. In her pursuit of these desires however, she tears at her tenuous relationship with her sister and all those around her. It seems only her contagious beauty and vulnerability keep the people she hurts close to her, as we follow her through smoky clubs and bars, cheap motels and onwards into oblivion. Georgia is often a trying film on the viewer, as its director, the Belgium born Ulu Grosbard pushes mainstream codes of cinematic language, and at the same time, deals with a central character who is often caustic, abrasive and unredeeming. That said, Jennifer Jason Leigh's visceral portrayal of Sadie Flood is utterly compelling and inspired. Indeed, her performance truly brings alive a disaffected character wrought by insecurity, isolation, depression and self-loathing; all culminating in an itinerant and bohemian lifestyle of club singing, alcoholism, heroin addiction and disillusionment. Worthy of note also are the stellar performances of the support cast, notably Georgia's loving husband played by Ted Levine, Sadie's doting and tortured partner played by Max Perlich and Herman the drug-addled band-mate of Sadie's, performed by the ubiquitous character actor John C Reilly. Another great feature of this film is the soundtrack, and in many ways this film could be considered a musical. Contributions come from Van Morrison, Lou Reed, Elvis Costello, Eric Clapton, Tom Waits and Otis Redding, many of whom were active in the music to the film. John Doe and the late Jimmy Witherspoon for example, both acclaimed recording artists in their own right, act and sing in the film. Indicative of the soundtrack's integral contribution to the overall film, please note the cover of 'this magical place is more than it seems' from the Wizard of Oz score, as Sadie more so than anything wants to click her heels together and get back to the old house, back home. In summation, this film will appeal to people who drink too much, people who tell me that it's a sin to know and feel too much within, which according to Bob Dylan many claim to live by and i concur; those with a penchant for '90s Seattle, rock and roll and dark character studies into alcoholism, thwarted ambition and pervasive despair.",
         "'Georgia' is a strong, sometimes harrowing drama about the relationship between two singing siblings: the eponymous elder sister, an established country-folk star, and the less talented Sadie, who is actually the central character of this film. Jennifer Jason Leigh is in her element as the self-destructive, self-loathing Sadie, and delivers perhaps her finest performance; but Mare Willingham is also good in the subtler role of Georgia, a woman whose capacity to feel compassion has been tested to the limit, and which only survives when focused through a prism of superiority. Georgia is instinctively careful with words but Sadie compulsively goads her into betraying these instincts; the telling dialogues between them are constructed with a deadly precision, the high points of a generally excellent screenplay. What's also surprising is that the music is also good. In any film about art, a central problem for the director is creating a belief in the merits of the fictional work; in 'La Bellie Noiseuse', for example, Jean-Jacques Rivette created an explicit plot justification for not having to show the painting that is the film's centrepiece to his viewers, rather than letting us judge it. By contrast, in this film, Georgia sounds genuinely good, while Sadie veers between downright awful and almost interesting; this allows the film to actually use the music as a means of conveying the narrative of the story. This slows the pace of the film, and if you don't like the types of music played, might be excruciating; but it's interesting to see the (fictional) truth conveyed through the medium of performance. One of the film's strengths is that it grants us no indulgent fantasies; because of this, the narrative arc is limited (especially as the film is quite long). In some senses, the film resembles other great films about the self-destructive, like 'Five Easy Pieces' or 'Naked'. It's not quite in that class, but it's double-headed structure makes it more reflective, less visceral, but by no means uninteresting. Overall, it's an unjustly neglected work.",
         "Georgia is a stunning movie of emotional intimacy and complexity. As many times as I watch it I'm still concerned and interested and wondering. Jennifer Jason Leigh plays Sadie (a boozing talent-less signer) and Mare Winningham plays Georgia (a respected folk signer), who's also Sadie's sister. The movie is about the trials of finding a career and the relationship between the two sisters. One of the greatest scenes is where, in a small bar, the two sisters attempt a duet. It becomes clear what these two's relationship has been, and will be. Georgia signs serene and soft while Sadie belts out the song and steals as much thunder from her sister as possible. A remarkable movie.",
         "Jennifer Jason Leigh is an incredible actress, climbing into a character and making you feel what the character feels. She accomplishes that to an intense degree as Sadie Flood in \"Georgia.\" The problem is that I didn't really want to feel what Sadie felt. She scared and disgusted me. Mare Winningham (who knew she had such a clear, sweet singing voice?!?) matches Leigh's believable portrayal, but had a more sympathetic character with which to work. The stand-out, though, is Max Perlich as Sadie's worshipful husband/doormat. My heart broke for him. While the acting was strong, I found this film exhausting and kept checking to see how much time was left - it felt more like an assignment than entertainment.",
         "While I love Mare Winningham and Jennifer Jason Leigh, I felt terrible for the lead character of Sadie Flood who longs for the same success as her older married, conventional sister Georgia. The film earned nominations for Winningham who plays the role with understanding and grace like most of her performances. I just find it so sad for Sadie who is genuinely a tragic figure of a character who loves and is at loss about her relationship with Axel, a quiet pizza guy, who falls in love with her. I remember them hitch-hiking rather than ride in a car with Georgia and her husband. It is a sad, thoughtful movie about sibling rivalry and relationships.",
         "Leigh is the best actress of the modern (color) era, and this is her best performance (exceeding the little seen gem Last Exit From Brooklyn) Aside from taking such a wide range of diverse and incredibly difficult parts (some parts could be played easily, but only if the goal wasn't for the performance to be worth mentioning), what really separates her is that she has no on screen ego. She does not care what depth she has to sink to or how unflattering she'll come across, after all it's never her, always the character she's portraying. She'll always research that character until she can become them on the screen, which is why her performances are so painstaking realistic and believable. She never wins any major awards because `making people happy' always takes precedent over what should be important, which is the believability, accuracy, realness, the generally the way they come to life. This is not a movie where `a lot of things happen.' In fact, it's tempting to say that `not much happens,' but either would be totally missing the point because it's a character and relationship study about a main character that is incapable of getting things together, succeeding, and healing the wounds she's caused on those around her. It's also about a sister that tries her hardest to deal with this character. She can only take so much, but she can't bring herself to force her sister out of her life. As she always does when she's in the lead role, Leigh takes the movie on her back and gives a totally engrossing, multidimensional performance. A performance that should make you feel different things about her character at different times even though it's always obvious that Sadie is a no-hoper. Calling Sadie unlikable is misses the point to some extent because the characters and relationships in this movie are all so complex. Leigh's mother Barbara Turner wrote this story in a way that none of the relationships would be black and white. Sadie is the center of virtually every scene and wears her emotions on her shoulder, but with everyone else there's the spoken and the unspoken. Director Ulu Grosbard has left enough room for the viewer to interpret how everyone really feels toward Leigh. Sadie is frustrating in the sense that no matter how much people go out of their way to help her, it's useless. Sadie is the person that will always make herself the center of attention, and will suck everyone around her dry. This character is an incredibly flawed person, but the thing is she holds that certain power over people where she's so real, so emotional, and so interesting in addition to being so f***ed up that one way or another people are drawn to her. This is where Leigh's talent really comes to the forefront because she makes the character so interesting that you can see why, as hopeless as she is, the people around Sadie can't help but accept her with her flaws and try to help her. Sure, at some point most of them reach their limit, but even when they do you can see it's tearing them up inside. Aside from her sister Georgia (Winningham), no one really has the guts to confront her on why they have to get away from her, or even how awful her singing is and how out of hand her substance abuse is. Winningham's performance as the polar opposite sister is so impressive and worthy of supporting awards. She has the restraint and ability to be able to convey the emotions while staying in the background. That's the only way her character could credibly function because as the opposite of Leigh, she's the quiet, unassuming one that has her life totally together (aside from Leigh turning up when she's desperate and pulling her down). Even though she isn't passionate about her profession and doesn't care about fame and fortune, she is the highly successful singer because she's talented and doesn't do anything (aside from perhaps putting Leigh on stage) that would harm her career. Since she's got the dough, she's giving but look for the subtle falseness in the generosity. The most telling portion of the movie is when she puts Leigh on stage for one song at an AIDS benefit concert, and Leigh does the longest, most emotional rendition of Van Morrison's `Take Me Back.' The problem is the same as always, she's plastered, no one responds to her bizarre pre-song comments, and she sings as bad as anyone can possibly sing without sounding like they are just trying to sound awful. This song seems to go on forever, so Winningham finally reaches the point of embarrassment (and perhaps disgust) where she comes back on stage and makes it a duet so she can `save' her sister and end this debacle. Due to the actresses, a horrible song has never been so amazing to sit through. Of course, Sadie thinks that passion and living the music is what makes for an exceptional performance, so her voice (if she even notices it sucks) isn't important because her show (and her whole life for that matter) is essentially a display of pain open to the public. In the car after Georgia's show is over, Sadie has to ask her husband Axel (Max Perlich), Georgia's husband Jake (Ted Levine), and Georgia `was I great or was I great?' Perlich & Levine, who don't get a tremendous amount of screen time but still offer strong support, agree she was great (well, Levine says she was something so again it's open for interpretation, but to Leigh it's an agreement), but Winningham doesn't want to say anything. After being prodded, she finally can't hold back her real feelings anymore, although she still says it in the `is this what you want to here' way. The true irony of the scene is that throughout the movie, and especially when Sadie got Georgia to come up and sing a duet with her at one of her performances before a few drunks by putting Georgia on the spot, Sadie had always tried to outdo Georgia and steal her thunder. That's the point of the title, although Sadie is the character that gets all the attention and thus screen time, everything she does always comes back to her sister Georgia. *Spoiler alert* This is a movie that doesn't have a definitive beginning and ending point. By that I mean, it's obvious that the events were going on long before we started seeing them and they'll continue long after we've left them. That's why the ending of this movie is so perfect. There's none of that it has to be happy and uplifting crap to take away so much of the power of what came before it. There's what we already knew followed by one line from Sadie that shows a small positive change in her character, but at the same time does not lead you to believe that she's poised for either a slow or sudden spiral in either direction. These sisters are who they are. This may not be a movie that you'll think is one of the greatest of all-time, but Leigh's performance and the basis of the movie itself should stick with you for a long time. 9/10.",
         "If you enjoy or are in the mood for a character driven movie with terrific performances and can endure scenes where a character so embarrasses him- or herself that you cringe, then you'll find Georgia rewarding viewing. Jennifer Jason Leigh is terrific as always\u0097but so is Mare Winningham. If you don't enjoy such movies, or are not in the mood for one, you will be bored or annoyed or upset by Georgia. There is not much in the way of a plot, and the movie stops rather than ends. As you can tell by my rating, I (often, but not always) enjoy character driven movies, and I think Georgia is one of the most memorable I've seen. That said, I have found myself in moods where I'd rather gargle glass than watch this (or a John Cassavetes movie, who I think is the master of the type). The plot\u0097or perhaps situation is a better word\u0097is simple. Jennifer Jason Leigh stars as Sadie Flood, a singer whose chops are mediocre at best but can convey raw, honest emotion, and whose life is lived in the shadow of her successful sister, Georgia, a country/folk singer with a mellifluous voice that conveys no emotion whatsoever and who enjoys a bit more than modest success in the Pacific Northwest. As played by Leigh, Sadie is an open wound of a human being: for every chance given her, she will mess it up; every trust extended she will betray. Why? Because she has neither the talent nor the love of her sister, who is as tightly wound a control monster as you will ever meet in life or fiction. About the only emotion she allows herself to express is a poisonous hatred for Sadie. Early on the movie you can see it leaking from Georgia in spite of herself, and there is a scene where Georgia extends a chance to perform for a large audience, and Sadie's performance is so awful (purposefully on Leigh's part, of course) that it might cause a viewer to feel such disdain is justified, but Georgia must surely know her sister, and to give her a such chance is to invite disaster. As I wrote above, the film does not end as much as stop, inter cutting between two performances by Sadie and Georgia. I don't know if Georgia even knows she hates Sadie, but Sadie knows she will always be in her sister's shadow; hence her never ending abuse of drink and drugs to blot out that knowledge and the pain of rejection."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "CiBy 2000",
         "Miramax"
      ],
      "summaries": ["Sadie is desperately looking up to her older sister Georgia who is a famous C&W artist. Sadie wants to be a famous artist like her sister, but is always doing everything wrong. Her desperate need to be accepted by her sister is constantly complicated by her drug and alcohol problems. Georgia lives a very ordered life with husband, house and children, and Sadie does everything to get her attention."],
      "budget": 0
   },
   "movielensId": 55,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-05-19",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Ulu Grosbard"],
      "runtime": 115,
      "movieId": 55,
      "title": "Georgia",
      "mpaa": "R",
      "actors": [
         "Jennifer Jason Leigh",
         "Mare Winningham",
         "Ted Levine",
         "Max Perlich",
         "John Doe",
         "John C. Reilly",
         "Jimmy Witherspoon",
         "Jason Carter"
      ],
      "imdbMovieId": "0113158",
      "originalTitle": "Georgia",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["jG9pUsmjAO8"],
      "plotSummary": "Sadie looks up to her older sister Georgia, a successful folk singer who's happily married with children, but can't break out of the bar-band circuit and hit the big time she desperately covets. It's in part due to her attraction to drugs and booze, and also to her own unwise choice in men. Finally, though, Sadie's Achilles heel is a rough, unlovely voice very different than her sister's crowd-pleasing singing.",
      "tmdbMovieId": 97406,
      "avgRating": 3.22546,
      "releaseYear": "1995",
      "numRatings": 978,
      "posterPath": "/5OTTRuKfiso75xofN8Vl5mRXOQP.jpg"
   }
}