{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "crush",
            "id": 9986
         },
         {
            "name": "pillow fight",
            "id": 187368
         },
         {
            "name": "catcher in the rye",
            "id": 187370
         },
         {
            "name": "odd couple",
            "id": 187376
         },
         {
            "name": "water balloon",
            "id": 187387
         },
         {
            "name": "pregnancy scare",
            "id": 187401
         },
         {
            "name": "water gun",
            "id": 187416
         }
      ],
      "imdb_id": "tt0111418",
      "video": false,
      "title": "Threesome",
      "recommendations": [
         15850,
         29932,
         102059,
         84038,
         36920,
         58905,
         906,
         56310,
         32519,
         249391,
         32888,
         5591,
         253496,
         72495,
         56085,
         11691,
         43601,
         77291,
         80346,
         36614
      ],
      "backdrop_path": "/l5nWWamL5P6rYywpIGdWb3qp2NW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Eddy",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b3f",
               "name": "Josh Charles",
               "profile_path": "/gO5zHbDQ38bZKJULUk9wIrFW1w4.jpg",
               "id": 2694,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Stuart",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b43",
               "name": "Stephen Baldwin",
               "profile_path": "/w2nZjBsEsjboQDZJXEkysuGgue4.jpg",
               "id": 9045,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alex",
               "gender": 1,
               "credit_id": "52fe43999251416c75016b47",
               "name": "Lara Flynn Boyle",
               "profile_path": "/wAVWGJefzTgXWgop58H1ttHS5H6.jpg",
               "id": 6684,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dick",
               "gender": 1,
               "credit_id": "52fe43999251416c75016b4b",
               "name": "Alexis Arquette",
               "profile_path": "/jNRBwGKXOZFWLI2ceff1sMUdxcE.jpg",
               "id": 19578,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Renay",
               "gender": 1,
               "credit_id": "53883e1ec3a3681aea003f96",
               "name": "Martha Gehman",
               "profile_path": null,
               "id": 79007,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Larry",
               "gender": 2,
               "credit_id": "53883ed50e0a26144a005b6f",
               "name": "Mark Arnold",
               "profile_path": "/jXyf24Gg18cVzaAZE2KALANBnBW.jpg",
               "id": 119893,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016b51",
               "name": "Andrew Fleming",
               "profile_path": "/eKmrsArF6QebMIlIHDXY537Smo6.jpg",
               "id": 41549,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016b57",
               "name": "Brad Krevoy",
               "profile_path": null,
               "id": 51702,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016b5d",
               "name": "Thomas Newman",
               "profile_path": "/nZSsNIrjbkqqxFYwsD3zcHskxdP.jpg",
               "id": 153,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016b63",
               "name": "Andrew Fleming",
               "profile_path": "/eKmrsArF6QebMIlIHDXY537Smo6.jpg",
               "id": 41549,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016b69",
               "name": "Alexander Gruszynski",
               "profile_path": null,
               "id": 33651,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43999251416c75016b6f",
               "name": "William C. Carruth",
               "profile_path": null,
               "id": 66167,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.494599,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10635,
      "vote_count": 76,
      "budget": 0,
      "overview": "Eddy and Stuart share two-thirds of a dormitory suite. Due to bureaucratic error, a woman named Alex is added to their room. At first, relations among the three are tense. Soon, however, Alex falls for Eddy, and Stuart lusts after Alex.",
      "similar": [
         11397,
         11522,
         15144,
         10691,
         342,
         70585,
         112973,
         10812,
         198085,
         351,
         381880
      ],
      "original_title": "Threesome",
      "runtime": 93,
      "poster_path": "/sA5gVzzufDoPtS06ODuQFpVmXnA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Motion Picture Corporation of America (MPCA)",
            "id": 11061,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         }
      ],
      "release_date": "1994-04-08",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "One girl. Two guys. Three possibilities.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Fleming"],
      "runtime": 93,
      "synopsis": "Through a beurocratic error, a beautiful coed is assigned to share a room with two guys in an all-male dorm at a large university. All three fall into an sexualised friendship that reveals three unrequited loves.",
      "writers": ["Andrew Fleming"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111418/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1NzQ4NDI3Ml5BMl5BanBnXkFtZTcwMDM0NzMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Lara Flynn Boyle, Josh Charles, Stephen Baldwin | See full cast and crew »"],
      "reviews": [
         "Due to a computer error Alex (Lara Flynn Boyle) accidently gets assigned the same dorm rooms as two guys, Stuart (Stephen Baldwin) and Eddy (Josh Charles). Stuart a sex crazed drunk frat boy is in lust with Alex, however Alex is in love with Eddy and Eddy in turn thinks he may be in love with Stuart! Considering the title and the premise one would not expect to see a smart film that never bashes its characters, but instead fully develops them in an a thoughtful, original manner. This film manages to do just this. Lara Flynn Boyle is both sexy and extremely funny. Josh Charles turns in a tender, compassionate performance. Film could have just easily come off as gratitous, but instead it is sexy and fun. Rated R; Sexual Situations and Profanity.",
         "Due to a computer mix up female Alex (Lara Flynn Boyle) has to share a dorm apartment with two men--sex-obsessed Stuart (Stephen Baldwin) and nice, quiet Eddy (Josh Charles). She begins to fall in love with Eddy but he reveals to her that he's gay--maybe (he's still a virgin). They all become fast friends and make a pact NOT to have sex with each other. But Alex is still in love with Eddy--and Eddy is very attracted to hunky Stuart... Almost perfect comedy/drama. For its time, this was groundbreaking. This was a rare Hollywood film that brought up gay characters and issues and did NOT ignore them or \"miraculously\" make the character straight. SPOILER ALERT!!!!! It is revealed that Eddy IS gay and is happily with a boyfriend at the end of the movie! I remember seeing this in a theatre and being stunned in 1994. NO Hollywood film had ever done that before (letting a gay character stay gay AND be happy). Even today that's a rare occurrence--back in 1994 it was unheard of. For this alone this movie should be better known. END SPOILER ALERT!!! Sexual politics aside it's also a damn funny movie. The characters are believable, the dialogue is frank and VERY adult (this is NOT for kids) and the movie moves quickly--never a dull moment. Boyle was young (24) when she made this. Her performance is great and she looks incredible (unlike now where she looks seriously anorexic); Charles is letter perfect as Eddy--you see has pain and conflict as he comes to terms with his sexuality; even Baldwin is good! His character is an obnoxious jerk but he has his sweet moments and really pulls them off. But it's his character that prevents me from giving this movie a 10. His character IS a real jerk and his sick jokes and comments really wore me down. Also there is a scene between him and Charles which is just bristling with homo eroticism--and the film stops it. I can accept that though--back in 1994 a mainstream audience couldn't have dealt with two guys going at it. Sadly this film bombed in 1994 (a bad ad campaign didn't help matters). This Definitely deserves rediscovery. Exceptional film that deals honestly with college kids and sexual politics. Well worth seeing.",
         "the chemistry between the characters on screen is amazing. The realiztation of homosexuality is touching, and also, the fond descriptions that eddy gives throughout the movie is so sweet, verging on bittersweet towards the end. But while i go on about its senitmentality, i have not even begun to express the blatant exploration of sexuality and the funny ways in which all the characters can pull them off. You'll never look at garden gnomes in the same way i can tell you. The ending is so inexplicably satisfying that the only words the need to express after watching this monumental summarization of 90's sexuality is \"Let's go back to college!\"",
         "Now that movieland seems to avoid anything that might feature just a touch of intelligence, this movie follows the opposite formula : less exploitation, more reflexion. It is funny, understanding, believable, exploring what, for some, would be dark sides of friendship, love and sex, but in a light and amiable way. The I-word strikes again in its deep sensitivity for what human relationships are like and, most of all, there is no morality tacked on at the end. In a different way, it reminded me of the superb French movie \"Le péril jeune\", which dwelt on a bunch of adolescents at the end of the sixties. Check it out .",
         "I saw this movie almost 10 years ago already for the second time and I liked it as much as before. The three main characters develop such a funny and friendly relationship throughout the movie that you just have to like them. Especially Josh Charles as Eddy (formerly admired as Mr. Knox Overstreet in Dead Poets Society) is a hell of a performer. He has something very special in his acting and I simply think he is remarkable. Lara Flynn Boile is no doubt a goddess with respectable acting abilities and even Will Baldwin, who plays a very flat but funny character, pleases the audience. As a group they even go beyond and the result is a romantic comedy with lots of sex appeal, laughing, friendship and even some seriousness. The script is very good and I can recommend this film to anyone over 16. My tip though: Don't watch it alone. It's much more fun with company. Have fun!",
         "I saw this movie in high school, liked it a lot at the time, and have continued to like it a lot. I think it was a much under-appreciated film that, in its own, pop-culture way, is even very brave. Josh Charles and Lara Flynn Boyle, both actors I always enjoy, give strong, genuine performances and Stephen Baldwin does his best acting outside of THE USUAL SUSPECTS. The best thing about the film, however, is Andrew Flemming's screenplay, which is highly literate, witty, extremely aware of itself, it's situation and the nature of its characters, and is studded with some beautiful little gems of sensitivity, understanding and wisdom. Though some people might dismiss it as fluff, the issues of sexuality, confusion and desire being presented are extremely well-handled, and Flemming is very good at addressing them intelligently, through his characters, without ever abandoning believability- especially in regards to how college kids talk and think. Also, a gold star for the portrayal of a gay man who is not flamboyant, dying or AIDS, or stupidly following the heroine around playing confidante; another for exploring the darker, stranger side of the woman-male homosexual relationship so often glamorized in Hollywood; a third for addressing that taboo subject so often dropped from teenage and twenty-something sex comedies: guilt. All in all, a fun, enjoyable movie- with a nice, thought provoking kick in the stomach to make it really worth your time.",
         "Risky even for its release date, THREESOME nevertheless manages to stay fairly true to its material without going too far or restraining itself too much, but staying in a comfortable middle. This can be either its validation or its weak point, because even when the three main characters wind up in bed together and apparently break the friendship bond and consummate their sexual tension, that we aren't allowed to see it and experience it is the only moment when it seems to cheat and retrace its steps cautiously. Because of course, one of the men is Stephen Baldwin, and it would be compromising if he had kissed his co-star Josh Charles, so we only will see him have sex with Lara Flynn Boyle. However, the material is well done, the characters are well drawn -- except for having Alexis Arquette as a more flamboyant gay college student in for laughs than as an actual person -- and the viewing experience translates at times quite poignantly through Charles' voice-overs as he wistfully looks back at those college days that are now gone by.",
         "This is a pretty good little movie about very close roommates. It's got a good deal of humor and easy charm but at the end I had a bit of a \"so what\" feeling about it. Also shows you of how hot Lara was before she turned into Skeletor.",
         "Few movies about college life have the respect for reality that this movie has. Andrew Fleming's screenplay is a near perfect one; so good, in fact, that it would be a terrific play. I had similar experiences in college coming out as a gay man and exploring the tangled web of sex and romance. Fleming gets it so right! You cringe at most teen and college movies that Hollywood passes off these days, but this film is an independent gesture at delving into relationships and characters. It was under appreciated in 1994. On DVD it plays like a masterwork. I must also praise Josh Charles, whose work in this film is also completely right and real. An underated actor, he makes Eddie's dilemmas heartbreaking and humorous at the same time. He should be doing alot more movies!!! Steven Baldwin is a bit over the top at times, but he creates an endearing jock who has moments of sincerity that are rarely seen in this character type. You've got to love his sheer exuberance in the part! And Lara Flynn Boyle gives a multi-textured performance of such nuance that it is a constant marvel watching her in this film. Perhaps the greatest compliment I can give this movie, is that it almost seems totally improvised; it's natural, fun, and a very true slice of college life. It's also a great coming of age/coming out movie that refreshingly has a gay protagonist who isn't a queen, dying of AIDS, or singing musicals!!! HALLELUJAH!",
         "I think what makes this film work is the chemistry between the three main characters. You like these characters, feel with them and believe that they would get along in real life like they do in the movie. The concept is clearly quite controversial, and I guess that's why it's so unpopular. I like the way it isn't really all resolved in the end... there is always a tiny degree of imperfection. The plot at times appears to have been written with the primary intention of being controversial rather than entirely realistic, emotionally or otherwise. I'm not sure if that's true, or it just seems that way. The pacing is pretty good. You're rarely bored. The clever dialog and script keeps your interest as well as consistently making you laugh. The film somehow makes you care about these characters, despite their many shortcomings and flaws. Maybe it's because they're human... we can identify with them, more than usually with American films(that are often shallow). The direction is pretty good. The film pretty much belongs in the 'good, but not entirely sure why' category. You like what you see, but you can't pin-point exactly why. All in all, a pretty good romance-comedy that should be seen by anyone open-minded enough to enjoy it. I recommend this to anyone who isn't offended by the topic(and not easily offended in general) but particularly to those who are fans of one or more of the main actors. 7/10"
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Motion Picture Corporation of America (MPCA)",
         "TriStar Pictures"
      ],
      "summaries": ["Eddy and Stuart share two-thirds of a dormitory suite. Due to bureaucratic error, a woman named Alex is added to their room. At first, relations among the three are tense. Soon, however, Alex falls for Eddy, and Stuart lusts after Alex. Eddy comes to realize not only that he's gay, but that he's attracted to Stuart. The three pledge not to act on any romantic (or lustful) feelings with each other, and become close friends . . . while bottling up a lot of sexual tension."],
      "budget": 0
   },
   "movielensId": 550,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-04-08",
      "dvdReleaseDate": "2001-05-01",
      "directors": ["Andrew Fleming"],
      "runtime": 93,
      "movieId": 550,
      "title": "Threesome",
      "mpaa": "R",
      "actors": [
         "Josh Charles",
         "Stephen Baldwin",
         "Lara Flynn Boyle",
         "Alexis Arquette",
         "Martha Gehman",
         "Mark Arnold"
      ],
      "imdbMovieId": "0111418",
      "originalTitle": "Threesome",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["QWKJ-avtMWQ"],
      "plotSummary": "Eddy and Stuart share two-thirds of a dormitory suite. Due to bureaucratic error, a woman named Alex is added to their room. At first, relations among the three are tense. Soon, however, Alex falls for Eddy, and Stuart lusts after Alex.",
      "tmdbMovieId": 10635,
      "avgRating": 3.0841,
      "releaseYear": "1994",
      "numRatings": 3484,
      "posterPath": "/sA5gVzzufDoPtS06ODuQFpVmXnA.jpg"
   }
}