{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         },
         {
            "name": "neo-noir",
            "id": 207268
         },
         {
            "name": "willing to be murdered",
            "id": 208376
         }
      ],
      "imdb_id": "tt0110259",
      "video": false,
      "title": "Killer",
      "recommendations": [],
      "backdrop_path": "/jiGz4lKHS2jVYKcEQBOVlSZVOIU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mick",
               "gender": 2,
               "credit_id": "52fe492e9251416c910a5279",
               "name": "Anthony LaPaglia",
               "profile_path": "/22sOEc37TsxxcnIl1XmucuW3IDl.jpg",
               "id": 57829,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Fiona",
               "gender": 1,
               "credit_id": "52fe492e9251416c910a527d",
               "name": "Mimi Rogers",
               "profile_path": "/cTXSghmtclAmeTSg4lBBjeOwpoQ.jpg",
               "id": 13920,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Archie",
               "gender": 2,
               "credit_id": "52fe492e9251416c910a5281",
               "name": "Matt Craven",
               "profile_path": "/atUkssC0DowpBbFvsnRf92cEf9y.jpg",
               "id": 13525,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe492e9251416c910a5285",
               "name": "Peter Boyle",
               "profile_path": "/hAZw6rJlAemlqND09Km7qGvpZ6D.jpg",
               "id": 1039,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Laura",
               "gender": 1,
               "credit_id": "52fe492e9251416c910a5289",
               "name": "Monika Schnarre",
               "profile_path": "/eH2taq6fmrhijYnx5tnvo6dhIHO.jpg",
               "id": 101905,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dr. Alstricht",
               "gender": 2,
               "credit_id": "545bbb820e0a261fb9002223",
               "name": "Joseph Maher",
               "profile_path": "/hgq8vDtBsk0ovVxRJHkAyXzTVth.jpg",
               "id": 20626,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe492e9251416c910a5275",
               "name": "Mark Malone",
               "profile_path": null,
               "id": 85547,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545bbb670e0a261fad00240b",
               "name": "Gordon Melbourne",
               "profile_path": null,
               "id": 1372827,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "545bbb72c3a3685353001a69",
               "name": "Mark Malone",
               "profile_path": null,
               "id": 85547,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.566957,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 85247,
      "vote_count": 2,
      "budget": 0,
      "overview": "This lyrical, modern-day film noir finds cynical hit man Mick (Anthony LaPaglia) tiring of his job and asking his boss, mob kingpin George (Peter Boyle), for time off. George gives him the assignment of his life, however, prompting Mick's soul-searching to reach new heights. Mick is asked to kill the sultry Fiona (Mimi Rogers), who owes George money and claims she wants to die. But as Mick spends time with her, he finds himself falling for her.",
      "similar": [
         10651,
         101,
         8012,
         64689,
         4771,
         769,
         186,
         2252,
         7516,
         1538,
         1422,
         59967,
         156022,
         245891,
         241554,
         13184,
         877,
         400,
         9873,
         11647
      ],
      "original_title": "Killer",
      "runtime": 97,
      "poster_path": "/z6R35t0hXAtLFbauhmsEaSVMBMf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Republic Pictures (II)",
            "id": 10348,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Keystone Film Company (II)",
            "id": 37572,
            "origin_country": ""
         }
      ],
      "release_date": "1994-09-14",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "You only hurt the one you love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Malone"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Gordon Melbourne",
         "Mark Malone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110259/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTI3NzU3OTE1MF5BMl5BanBnXkFtZTgwMjk3ODk1MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anthony LaPaglia, Mimi Rogers, Matt Craven | See full cast and crew »"],
      "reviews": [
         "How this sensational first feature failed to become a massive critical hit I am at a loss to understand. With just a few characters and a rudimentary plot, Mark Malone has fashioned a stare into the soul as bleak and uncompromising as anything since Last Tango in Paris. Lapaglia and Mimi Rogers make a heart-stopping duo thrust into a situation so replete with irony that it is almost Shakespearean. And to continue the theatrical reference, Malone uses Brechtian chapter titles to distance the audience and make the whole tragedy bearable. Finally under no circumstances should audiences miss the post-credit sequence (at the end) which perfects a classic circular structure and monumentalises the work. 'Nuf said!",
         "This movie is one of the most surprising films I have ever seen. I started once to watch it in Polish TV about midnight. Movie was described in TV guide as horror. In fact I didn't want to watch it but I was not sleepy enough to turn off TV set. Thanks God, I haven't done it.. Beginning - nothing special, rather disgusting... Some guy killed another, later on he tried to kill prostitute just for fun... Soon he is ordered to kill some girl... Seems like C class move, isn't' it? But the story becomes psychodelic. Killer turns out to be human being. His brainless companion becomes killer. The victim wants to be killed... I do not want to tell the story. But it is strictly complete. It's hard to see such well-invented story in American movie business nowadays. \"Killer\" has an atmosphere of \"Crying Game\" or \"House of Games\" in one. In fact - the story is a riddle, nothing looks like its seemed on the beginning... Mimi Rogers as fatal woman is marvellous. Her sad, peaceful eyes stay with you for long time ...",
         "A Must See! Anthony LaPaglia, Peter Boyle and Matt Craven do a terrific job. However, it's Mimi Rogers outstanding and shocking performance of desperation, resignation, and the ability to play 'the game' on her terms using powerful emotion and sex, with the shady characters that makes this movie awesome. She does this from start to finish and you can be the judge if she's doing this out of necessity or out of pleasure, or \"just to play the game\". The plot is complete and has twists and turns. Originally it was released as \"Bulletproof Heart\". Great character study and human nature teeming with emotion in all the characters. The assassin, the old friend who's now a driver, will make you twitch while you watch this movie, and the Boss. The Boss who pushes the assassin to clean up his act with this new hit, since his last assassination was blotched up. It weaves together to create a super movie, you'll never forget!",
         "I've searched for a copy of this movie on DVD in stores, on-line for 10 years and finally located a VHS copy from Amazon. I truly do NOT understand why this movie isn't listed in Mimi Roger's or Anthony Lapaglia's Wikis as I regard it as their best work. I plan to copy the VHS to DVD ands share it on torrent sites. No one else seems to give a flip about marketing it on DVD or I'd have ordered it by now. Never play leapfrog with a Unicorn. I'd rather have a bottle in front of me than a frontal lobotomy. There's your ten lines, Bubba.",
         "Before the Sopranos went on air we have a hired gun, a maffiosi, a killer who doubts the real meaning of it all. In fact he wonders the meaning of meaning. Without being to psychological it is a good thriller with the question 'Will he kill her'. Possibly a little too soon it is obvious whether he will or not but as a whole it is definitely worth watching albeit just for Mimi Rogers who till the end keeps you asking whether she - as an actress - is really terminally ill or just pulling everbody's strings",
         "I first saw this film many years ago when it came out on video. Having just recently bought a copy it proved fascinating to watch it again after so long. The set piece I remembered in most detail was of the two protagonists seated facing each other in an empty warehouse.The emotional charge in the scene is ferocious. The film is a curious work, mixing almost Steve Martin comedy with high gangster genre \"Carlito's Way\" style drama. I'm not sure if the screenwriter and the director between them completely pull off this trick. Personally I would have preferred it if the comedic element had been dropped. The film concerns an extremely efficient though extremely jaded hit-man called Mick (played by Anthony LaPaglia). He has unemotionally killed so many people that it seems as if violent death and sex, as it were the agony and the ecstasy, for him have merged. (Early in the film he is shown lying semi-naked in bed, and as the prologue to having intercourse he is receiving a somewhat intimate massage from a masseuse/prostitute. As she straddles him he is shown contemplating stabbing her with a pair of scissors.)When he goes to dispatch his latest kill Fiona (Mimi Rogers) only to find that she is positively waiting to be killed he is totally thrown. In her seduction of him he becomes the apparent willing victim, being both tied by the wrists to the bedhead and thrashed across the face; as things climax so to speak he manages to break free. This appears to be his epiphany,the awaking of deeply repressed feelings of love and compassion within him. At this juncture I feel compelled to indicate that in English seventeenth-century love poetry words such as \"Kill\" and \"Come\" were interchangeable, and I did wonder if the allusion here was intentional. It seemed so in respect of the ending of the movie. Unfortunately this means that the viewer must plod through all the credits in order to see the denouement. This is ultimately a very sad film as one is left with the impression that Mick is now a completely broken man. He had briefly found love only to lose it again. The only difference being that now he knows exactly what he has lost. As a little aside I must add here that I have never seen anyone either in movies or television drama who cries more convincingly or affectingly than Anthony LaPaglia. The acting of both Mr LaPaglia and Miss Rogers is faultless throughout. The film does have its weaknesses as I have hinted at, but overall is a different and interesting slant on the old gangster/hit-man type story.",
         "Although just a decade ago, Anthony LaPaglia was a wild guy in movies, not the subdued leader of the hit TV program \"Without A Trace.\" He usually played very profane guys, too. That's certainly the case here in this film which I've always seen labeled \"Bulletproof Heart,\" (not \"Killer\"). Actually, all four lead actors in this movie were interesting: assassin LaPaglia, love-sex- interest Mimi Rogers, comedians Matt Craven and Peter Boyle. The latter two play comedian-types, I should say. Craven is particularly funny in this movie. Rogers is here mainly to show off her huge breasts. She shows them off particularly in a bondage-type scene that is a bit sick. (This movie isn't exactly The Sound Of Music, morally-speaking. It's pretty sleazy.) The film has a good mixture of drama, humor, sex, violence and suspense. However, it also is a good example of Hollywood's depravity, pagan views and fatalistic viewpoints. Seeing more and more of that with my second and third viewing of this , my rating went lower and lower until I finally canned this from my collection. It's just too sordid.....but, for the first-time viewer, a real eye-opener which keeps your attention.",
         "\"Bulletproof Heart\" Anthony LaPaglia stars as a mob hit man, Peter Boyle as his contractor, Matt Craven as his drooling sidekick, Mimi Rogers as his mark. Very stripped down movie. Only (roughly) eight people have any kind of speaking parts. Only four sets. A noir, of course. You know when you pick up a movie like this, just from looking at the box, even if you couldn't read the blurbs, that it's a noir. He, very unsmiling, has got his black hair slicked back; sultry she is in a low-cut sequined dress; the spotlight is on his big, shiny gun. It is a B movie. One feature that separates B movies from A's is editing. Someone needed to step in and arrest scenes that went more or less like this: \"You have to kill her.\" \"I don't want to kill her.\" \"You have to kill her.\" \"I don't want to kill her.\" And someone needed to snip bits where the movie tells rather than shows. LaPaglia is reduced to verbally explaining that he is an amoral hit man, after the movie has already sufficiently shown that he is an amoral hit man. An A movie would have just shown him being an amoral hit man, and skipped the didactic speech explaining what the viewer has just seen. The direction was thoroughly flatfooted. Director Malone seems to hate three-dimensional space. Actors were placed within it the way figures are placed on ancient altar triptychs. They are in the center of a rectangular frame; they occupy three quarters of the screen; and they are shown full front. Snore. And I never got a sense of any space any character occupied other than that necessary to create the rectangular frame around that rigid composition. Having said all that, I've gotta say, this movie wrecked me. I cried. I was tremendously moved. I kept thinking of Noel Coward's famous line, \"Extraordinary how potent cheap music is.\" There were two hit men, and I identified with \u0096 and actually pitied \u0096 both of them. LaPaglia has to kill Mimi Rogers. He arrives at her apartment and a sexual game right out of a Strindberg play begins. Who has the power? Who is afraid of whom? Who is killing whom? Who is resurrecting whom? This all sucked me in. It had genuine tension. Neither overplayed, but you could see the shifts on LaPaglia's face, from amoral hit man to possible prey animal to something entirely other. I was a bit put off by Mimi Rogers' acting at first. When she wanted to emote, her eyebrows began to jerk and quiver as if they were caterpillars being directed by an offstage wild animal trainer. But she grew on me. She seduces him. The director did handle the intimate scenes well. If I said I came three times, would that turn this review into something other than an intellectual discussion of a movie? Not knowing the answer to that, I won't say it. La Paglia and Rogers develop fantastic chemistry. It seems to grow, in a real way, out of their peculiar situation. La Paglia is given a few chances to deliver the kind of witty and surprising speeches hit men deliver in gangster film noir. They are surprising, of course, because you have this totally exotic creature, a hit man, speaking about banalities we all share, like the boredom that sometimes comes with doing the same work day after day, and surprising because they offer a chance for identification with such an exotic, condemned creature, and surprising because you begin to identify, to see the world through his eyes, \"Oh, yeah, if I look at it that way, being a hit man makes perfect sense!\" to see how his world and your world aren't so different. And surprising because you begin to see how his morality could be superior to that of someone who has a more conventionally valorized way of making a living \u0096 Mimi Roger's psychiatrist, for example, is shown to be a real sleaze -- and even murderer -- in comparison to LaPaglia. Rogers and La Paglia begin a dialogue on the worth of human life. And, I gotta tell ya, for all the guns and the really good sex, that's what got me. These dialogues and scenes aroused in me confrontations with my own thoughts and feelings about life, death, murder, suicide, love, the human capacity for regeneration, faith, hope, investment, what we expect / need from people we love \u0085 what we need / expect from film noir \u0096 a very important question !!! I don't wanna give too much away, here. There is a genuinely, darkly funny moment when Mimi Rogers shrugs and says, \"Men.\" You have to see the movie, and you'll know what I mean. This is exactly the kind of movie I think of when I think of people who walk out of movies and drive me crazy by saying something like, \"Hey, that was nice. Wanna go get something to eat?\" and more or less abort any conversation about the movie. If a date said that to me after this movie, I'd have to be physically restrained. This is the kind of movie I'd have to talk about afterwards. Really, this may sound sacrilegious, but it's the kind of movie that leaves me with a feeling close to reverence \u0096 like, after seeing it, I need to inhabit a liminal zone before I segue back into real life.",
         "It has been a while since I've seen this movie. But I have some recollection of what goes on in it. Basically, a hit-man (Lapaglia) is given his next assignment, a woman(Rogers) who has stolen from the mob. But when they meet he finds that she is expecting him and prepared for the inevitable. She seduces him and he ends up falling for her and so finds it hard to complete the assignment. What follows is (what I think) a crisis of conscience for Lapaglia. Rogers is stunningly seductive in this and seems to relish the sexy role. This is a movie that made me stand up and take notice of Rogers and I would recommend you see it just for her performance. There are too other main carachters in this. The guy who gave the assignment and a bungling idiot of a \"friend\". But I do not want to give away too much as there is an interesting and major twist near the end involving one of these people. For what I would describe as a psychological drama, the acting is very understated and, considering the title, action seems to be kept to the minimum required. But it is a thinking person's film. For me it was more about a crisis of conscience, because even though he develops feelings for the woman he's supposed to take out, he is from an emotionally detached world and may never have known true love. But somehow she got inside his head. And there is an issue that she may want the inevitable to happen but he has developed a fondness for her. I enjoyed this film. It is thought provoking. My judgement: see it and make up your own mind.",
         "Lapaglia is tremendous as the icy hitman who not only thaws from the heat of passion, but burns to a cinder in the process! Mimi Rogers is good as the object of his obsession. This modern noir film should not be missed. Lapaglia stunning performance runs the gambit of emotion and melts the screen!Don't miss it!"
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Keystone Film Company (II)",
         "Republic Pictures (II)"
      ],
      "summaries": ["A professional assassin, having just \"cleaned up\" a botched \"job,\" is pressured into another new assignment by his boss. He is beginning to find himself off-balanced and self-questioning about his chosen career, when he is thrown into complete turmoil by the unusual nature of this latest \"hit.\" A prominant woman has accumulated a massive amount of bad debt from shady characters and threatened them with police exposure, yet seems resigned to her fate when informed of a contract on her life. In fact, she even seems to look forward to her own demise. Why? As the killer tries to understand and resolve the situation, he begins to feel emotions long suppressed, perhaps, that he didn't even know he possessed. Before he can straighten out this upside-down, backwards, and inverted, crazy situation, his boss turns up the heat. Having his driver around, who is an old friend but unreliable and twitchy, nonetheless, does little to settle his jangly nerves. Finally, an impasse is reached with dire consequences for all...."],
      "budget": 0
   },
   "movielensId": 561,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-14",
      "dvdReleaseDate": null,
      "directors": ["Mark Malone"],
      "runtime": 97,
      "movieId": 561,
      "title": "Killer",
      "mpaa": "",
      "actors": [
         "Anthony LaPaglia",
         "Mimi Rogers",
         "Matt Craven",
         "Peter Boyle",
         "Monika Schnarre",
         "Joseph Maher"
      ],
      "imdbMovieId": "0110259",
      "originalTitle": "Killer",
      "genres": [
         "Thriller",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Vnh6xMo02UE"],
      "plotSummary": "This lyrical, modern-day film noir finds cynical hit man Mick (Anthony LaPaglia) tiring of his job and asking his boss, mob kingpin George (Peter Boyle), for time off. George gives him the assignment of his life, however, prompting Mick's soul-searching to reach new heights. Mick is asked to kill the sultry Fiona (Mimi Rogers), who owes George money and claims she wants to die. But as Mick spends time with her, he finds himself falling for her.",
      "tmdbMovieId": 85247,
      "avgRating": 3.43939,
      "releaseYear": "1994",
      "numRatings": 231,
      "posterPath": "/z6R35t0hXAtLFbauhmsEaSVMBMf.jpg"
   }
}