{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "new jersey",
            "id": 586
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "mockery",
            "id": 2422
         },
         {
            "name": "ugliness",
            "id": 2544
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "little girl",
            "id": 12663
         },
         {
            "name": "school life",
            "id": 190116
         }
      ],
      "imdb_id": "tt0114906",
      "video": false,
      "title": "Welcome to the Dollhouse",
      "recommendations": [
         10683,
         13073,
         16550,
         476,
         39800,
         16448,
         11855,
         16233,
         9786,
         9685,
         25504,
         2742,
         10608,
         10692,
         441,
         9430,
         12772,
         21450,
         3033,
         24798
      ],
      "backdrop_path": "/75QGyEZbzc0q0z4ME160dhJnGgW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dawn Wiener",
               "gender": 1,
               "credit_id": "52fe44419251416c7502e3c7",
               "name": "Heather Matarazzo",
               "profile_path": "/xcwR8aPuSkUCDPIyKU049M1CXph.jpg",
               "id": 33656,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lolita",
               "gender": 1,
               "credit_id": "52fe44419251416c7502e3cb",
               "name": "Victoria Davis",
               "profile_path": null,
               "id": 69482,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cookie",
               "gender": 1,
               "credit_id": "52fe44419251416c7502e3cf",
               "name": "Christina Brucato",
               "profile_path": "/cOUcnlgdOqqhZ2cNgzjTZHaWRtX.jpg",
               "id": 69483,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cynthia",
               "gender": 1,
               "credit_id": "52fe44419251416c7502e3d3",
               "name": "Christina Vidal",
               "profile_path": "/7Th8N0AymiBn5ROxBjPekM8SKMd.jpg",
               "id": 61904,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Chrissy",
               "gender": 0,
               "credit_id": "52fe44419251416c7502e3d7",
               "name": "Siri Howard",
               "profile_path": null,
               "id": 69484,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Brandon McCarthy",
               "gender": 2,
               "credit_id": "52fe44419251416c7502e405",
               "name": "Brendan Sexton III",
               "profile_path": "/kQsOIQuGcqwdpolSEzLV7RfYVsV.jpg",
               "id": 2839,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Missy Wiener",
               "gender": 0,
               "credit_id": "52fe44419251416c7502e409",
               "name": "Daria Kalinina",
               "profile_path": null,
               "id": 974425,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Mark Wiener",
               "gender": 2,
               "credit_id": "52fe44419251416c7502e40d",
               "name": "Matthew Faber",
               "profile_path": "/iKmAhmKfJuTo2WZIa6ACbIWA7qb.jpg",
               "id": 80541,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Barry",
               "gender": 2,
               "credit_id": "52fe44419251416c7502e411",
               "name": "Ken Leung",
               "profile_path": "/kftJqCNab1x5W29b46rLUeXkwZi.jpg",
               "id": 2131,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Kenny",
               "gender": 0,
               "credit_id": "52fe44419251416c7502e415",
               "name": "Josiah Trager",
               "profile_path": null,
               "id": 109102,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Mr. Wiener",
               "gender": 2,
               "credit_id": "52fe44419251416c7502e419",
               "name": "Bill Buell",
               "profile_path": "/yN1Z8yHnaODrTO0fqHF7lc7EFsh.jpg",
               "id": 76764,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Steve Rodgers",
               "gender": 2,
               "credit_id": "52fe44419251416c7502e41d",
               "name": "Eric Mabius",
               "profile_path": "/mfYqgYHkvJRgPus0kN2V1GhsFOU.jpg",
               "id": 11867,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Mary Ellen Moriarty",
               "gender": 0,
               "credit_id": "52fe44419251416c7502e421",
               "name": "Stacey Moseley",
               "profile_path": "/nSmFiodivB8jx206kWHKY1qHkh0.jpg",
               "id": 171300,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Mr. Edwards",
               "gender": 2,
               "credit_id": "52fe44419251416c7502e425",
               "name": "Will Lyman",
               "profile_path": "/xYU1FSeQhXLyg6VskqRBofFyoU8.jpg",
               "id": 163671,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44419251416c7502e3dd",
               "name": "Todd Solondz",
               "profile_path": "/9qRwwtUTviJLA1td24BMhWxfCbn.jpg",
               "id": 66605,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44419251416c7502e3e3",
               "name": "Todd Solondz",
               "profile_path": "/9qRwwtUTviJLA1td24BMhWxfCbn.jpg",
               "id": 66605,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44419251416c7502e3e9",
               "name": "Todd Solondz",
               "profile_path": "/9qRwwtUTviJLA1td24BMhWxfCbn.jpg",
               "id": 66605,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44419251416c7502e3ef",
               "name": "Donna L. Bascom",
               "profile_path": null,
               "id": 69485,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44419251416c7502e3f5",
               "name": "Jill Wisoff",
               "profile_path": null,
               "id": 69486,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44419251416c7502e3fb",
               "name": "Randy Drummond",
               "profile_path": null,
               "id": 69487,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44419251416c7502e401",
               "name": "Alan Oxman",
               "profile_path": null,
               "id": 52988,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5a9567349251413261008c9c",
               "name": "Joana Vicente",
               "profile_path": null,
               "id": 13234,
               "department": "Production",
               "job": "Associate Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.440641,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11446,
      "vote_count": 131,
      "budget": 0,
      "overview": "An unattractive 7th grader struggles to cope with suburban life as the middle child with un-attentive parents and bullies at school.",
      "similar": [
         11236,
         4347,
         858,
         281957,
         452507,
         132833,
         10054,
         133805,
         2142,
         45153,
         8272,
         3134,
         2275,
         298312,
         182560,
         4476,
         8967,
         2288,
         4771,
         769
      ],
      "original_title": "Welcome to the Dollhouse",
      "runtime": 88,
      "poster_path": "/jvxLLHwpK52ZJUusd2RJv8oLHUJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-05-24",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Not all girls want to play with dolls.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Todd Solondz"],
      "runtime": 88,
      "synopsis": "Dawn Wiener (Heather Matarazzo) is a shy, unattractive, unpopular 12-year-old 7th grader in a middle-class suburban community in New Jersey. Her older brother Mark (Matthew Faber) is a nerdy 11th grade high school student who plays the clarinet in a garage band and shuns girls in order to prepare for college. Dawn's younger sister Missy (Daria Kalinina) is a seven-year-old spoiled, manipulative little girl who pesters Dawn and dances happily in a tutu. Their mother (Angela Pietropinto) is a shrewish, overbearing woman who dotes on Missy and always sides with her in disputes with Dawn. Their father is a meek, selfish businessman who always sides with Dawn's mother. Dawn's only friend is an effeminate fifth-grade boy named Ralphy (Dimitri DeFresco), with whom she shares a dilapidated clubhouse in her backyard. Dawn's life in junior high is even more miserable: all of classmates call her names and cover her locker with derisive graffiti, the cheerleaders call her a lesbian, an abrasive teacher unfairly keeps her after school one day for no reason, another girl forces her to use the toilet while the girl watches, and she is threatened with rape by a bully named Brandon McCarthy (Brendon Sexton), who has almost as much trouble socializing as she does. Her attempts to take out her frustrations only get her into trouble. At home, her mother punishes her for calling Missy a lesbian and refusing to be nice to her (considering that Missy is never friendly towards Dawn). The next day at school, Dawn accidentally hits a teacher in the eye with a spitball and she gets suspended for three days. Dawn's stupid and ignorant parents continue to be unsure of what is causing her rude behavior and Dawn refuses to talk to them about her hellish life at school, aware that they will not understand. Brandon's first attempt to rape Dawn after school fails when he does not seem to force himself upon her, but he orders her to meet him again the next day after school. After she presents herself to him and he takes her to an abandoned field, he starts an earnest conversation and only kisses her, even though she is obviously willing. Brandon is clearly not the bad seed that he puts himself out to be, but just like Dawn, he is a socially awkward kid who hides his own unhappiness behind anger and aggression. Meanwhile, Mark's band is joined by Steve Rodgers (Eric Mabius), a cool, handsome 19-year-old guy who intends to become a rock star. Dawn immediately falls in love with him, and she decides to pursue him romantically after he spends some time with her, even though one of Steve's former girlfriends explains to Dawn that she has no chance to become his current girlfriend. As the film continues, Dawn and Brandon treat each other ambivalently. He bonds with her in her clubhouse only after another girl rejects him, and Dawn pursues him only after Steve rejects her. Toward the end of the film, Brandon is expelled from school for suspected drug dealing and, after kissing Dawn, runs away to avoid being sent to military school. Dawn comes over to Brandon's house the day he runs away to visit and sees that his home life is even worse then hers; He has an abusive and alcoholic widowed father, and a mentally retarded older brother who requires constant supervision. After angrily rejecting Ralphy as a boyfriend, Dawn is left with no friends at all. The next occasion of Dawn's embarrassment is a lawn party to celebrate her parents' 18th wedding anniversary. When Dawn refuses to tear down her clubhouse to make room for the party, her mother has Mark and Missy destroy it and gives them her share of a chocolate cake. At the party, Missy humiliates Dawn when she pushes her into a kiddie pool for no reason in front of the assembled guests who laugh at it. That evening, the family watches a videotape of the party, with all of them (except Dawn) laughing when Dawn falls into the water, which further alienates her as her immature parents continue to remain oblivious to Dawn's alienation. Later that night, Dawn smashes the videotape to pieces with a hammer and briefly brandishes her hammer over Missy's bed as she sleeps to bludgeon her to death. But Dawn cannot bring herself to commit murder and instead walks away and goes to bed. Dawn's ultimate personal disaster occurs a few weeks later when her father's car breaks down while he is driving home from work and her mother has to pick him up. Dawn is to tell Missy to find a ride home from ballet class while their mother is away. However, Missy argues with Dawn, who retaliates by not telling her, with the result that Missy is kidnapped by a stranger while she is walking home alone. When Missy's tutu is found in Times Square, Dawn goes to New York City hoping to find Missy and become a hero to make her difficult parents notice and respect her. After a full day and night of searching fruitlessly for Missy, Dawn phones home to check up on what is going on and Mark tells her that Missy has been found by the police after she was abducted by a pedophile neighbor. Dawn returns home dejected and sees that her mother was too preoccupied with Missy's traumatic kidnapping ordeal to even notice Dawn's absence. But at least to Dawn's credit, her parents never figure out that she was indirectly responsible for Missy kidnapping by withholding information from her that led to Missy being abducted in the first place. After this, Dawn's classmates make fun of her as she gives a speech in the assembly hall to thank them for their \"emotional support\". It is only after the principal orders the unruly students to be quiet, Dawn gives herself enough mental strength to finish her speech. A few more weeks later, school is let out for the summer. Dawn is relieved that her painful ordeal at school is over... at least for the next three months. Afterwards, Dawn's mental state takes a further blow when Mark offers her no hope of a better life until high school... which according to him is will not be much better. As the movie comes to an end, Dawn finds herself literally back where she started... only worse. She is still unpopular and unattractive. Her parents have gone from mistreating and neglecting her to ignoring her completely in favor for Missy's abduction. Rather then counting down the long summer days to go back to school for 8th grade (and thus endure another hellish year of bullying and abuse), Dawn decides to get away from her home life by signing herself up for a month-long school summer trip to Florida's Walt Disney World. Her self-involved parents are still too pre-occupied with their own lives to approve of Dawn's permission to leave for the summer, and do not even notice her packing up to leave, much less say \"goodbye\" to her. The final scene shows Dawn sitting anonymously among her other classmates on the school bus as she obediently joins other students singing the school anthem during the field trip to Florida as she sorrowfully looks out the bus window to ponder her uncertain future.",
      "writers": ["Todd Solondz"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114906/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxMzk5NzY4OV5BMl5BanBnXkFtZTcwNzcxNTgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Heather Matarazzo, Christina Brucato, Victoria Davis | See full cast and crew »"],
      "reviews": [
         "Grimly convincing portrayal of life in junior high school for the unpopular. If you aren't blown away by how realistic this is then you weren't unpopular enough: this is the real deal. This movie strips away the rosy patina of nostalgia that covers most other films that portray the grim nature of childhood. I admire the film for avoiding the common trap of making the lead an innocent victim. Heather is, when the opportunity arises, just as cruel as anyone else in the film. The movie doesn't make Heather a child, but instead makes her a confused human being full of conflicting emotions such as hatred, lust, anguish and guilt. I think to understand this movie though, you need to realize that you are viewing everything from Heather's point of view. Teachers and parents are ridiculously unfair, classmates are alarmingly sadistic, and you could point at some action and say, oh, I doubt that would happen, but there's a strong emotional truth; this is what it feels like to be an unhappy child. When I watch movies about unpopular kids, I am always disappointed because their lives are better than mine was, and this is the first movie I could point to and say, if you want to see what I was dealing with in Junior High, watch Dollhouse. But while I always wanted a movie that shows the unvarnished truth, it is really difficult to watch. Although if you can make it through the first half hour it gets just a shade less horrific. And it does have a quirky sense of humor that lightens it some. I avoided this movie for years because I was afraid it would be too painful, and a friend said no, it's not that painful, and she was sort of right and sort of wrong. But it's definitely worth seeing.",
         "\"Welcome to the Dollhouse\" was the introduction of an important voice in the American cinema. Todd Solondz's incisive study of a suburban family is one of the best indie films of the last decade. Having seen it in its theatrical release, we had the opportunity recently to take a new look at it. Mr. Solondz has created a picture of what cruelty does to a child, and how prevalent it is everywhere. When we first meet the Wieners, living in suburban New Jersey, they appear to be the ideal family. Both parents, on the surface, look normal, but in watching them closely we come to the conclusion they are not. Some couples are not meant to be parents and the Wieners, obviously, while supportive of the older son, Mark, and the cute younger daughter, Missy, turn a blind eye toward Dawn, their middle daughter who is going through a hard time as she starts junior high school. Not only is Dawn an unhappy girl, but she is the object of cruelty in the hands of the other students, both in her class, and in her school, in general. We watch as Brandon, the punkish boy, begins to taunt Dawn in his own sadistic way. Other girls come right out and ask Dawn whether she is a lesbian. There's also another girl that terrorizes her when both meet in the school bathroom. Every time Dawn tries to rebel, it turns out in disaster. Her school teacher doesn't even see anything wrong with Dawn, who is obviously affected by all she is experiencing at this crucial moment. Dawn hits a nerve with Brandon when she calls him a retard. Little does she know his own brother is mentally challenged. Usually in the case of bullies like Brandon, they are acting up their frustrations by taking it on others they perceive as weaker, which is why he thinks he can do anything to Dawn because she will never do anything to him. In a scene that gives cruelty a new name, we watch as the Wieners are having dinner one night. When Dawn contradicts something her mother has said, she is punished by not getting her dessert. We watch in total disbelief as the other Wieners begin to eat and Dawn's slice of chocolate cake remains near her mother until Missy asks to share that piece with Mark. Dawn only has a friend. The young boy who shares her interests in hanging out in the dollhouse in the Wiener's backyard. When the hunky Steve Rogers joins Mark's band, Dawn discovers an irresistible attraction toward this loser. Dawn turns against her only friend and will call him names that we all realize is her own way to deal with emotions she has no control on. Instead of finding happiness among her peers, Dawn only encounters scorn and ridicule. In Heather Matarazzo, the director found a young talent to give life to Dawn Wiener. Ms. Matarazzo has a peculiar kind of beauty, but she is made to wear horrible clothes to capture the essence of this sad young teen. Ms. Matarazzo under the guidance of Mr. Solondz makes an appealing Dawn. This young actress gave her character a range of emotions that even older, and more accomplished, actress wouldn't have given to this lost soul. The rest of the cast is perfect. Brendan Sexton plays Brendan, the boy from a poor and broken home that has to deal with the blow life has given him. Angela Pietropinto as Mrs. Wiener is seen as the mother from hell. Mattew Faber and Daria Kalinina play Dawn's siblings. This was a film that put Todd Solondz on the map. As he has shown with later films, he is a voice to be reckoned with in the independent cinema.",
         "Do not go into Welcome to the Dollhouse expecting a charming coming-of-age story. Don't expect to have a lot of laughs either. I'd seen this film several times before this viewing, including its original theatrical run, and it was just as cringe-worthy as the first time, if not more so because you know what to expect and find that you are bracing yourself. Solondz gives us the story of Dawn Weiner, a painfully awkward 13 year old girl who not only has to contend with being ostracized and friendless at school, but is essentially ignored and treated with disdain at home as well. Being the middle child is obviously not the easiest thing to deal with within the family dynamic, but when your older brother is a geeky over achiever and your little sister is a gorgeous ballet-dancing cherub who commands total devotion from her mother, life is generally difficult for Dawn. Solondz throws in some intriguing plot points that punch up the story and encourage introspection, but while the story and presentation are excellent, the real breakout element of the film is the performance of Heather Matarazzo. It is amazing that she was the same age as her character during filming because the performance, while the right age, exhibits a talent beyond her years. You would be hard pressed to find someone who actually found the torment against her as humorous. Rather, Solondz is so relentless with the abuse that it's almost like picking at a scab. However, in the character of Dawn Weiner, we also see strength and conviction to go along with her vulnerability. It's as if she finally realized and perfected these defense mechanisms simply so she can `survive' junior high school. Welcome to the Dollhouse is not a feel-good movie by any means. It is a stark and realistic look at adolescence in a way that we don't normally see it \u0096 it is not a sunny and idyllic junior high/high school experience, and not every `nerd' is stereotypical, a fact soundly proven by the complexity of the heroine of this great movie. --Shelly",
         "WELCOME TO THE DOLLHOUSE (1996) **** Heather Matarazzo, Brian Sexton Jr., Eric Mabius, Matthew Faber, Daria Kalinina, Angela Pietropinto. Easily one of the best independent films ever produced. Matarazzo is brilliant perfection as 11 year old Dawn Wiener - Wiener Dog - who is trying desperately to survive the 7th grade NJ suburban hell with her existence as a gawky, nerdy yet smarter- than-the-rest protagonist facing every conceivable roadblock to hurdle including a dimwitted hunky high schooler and a seemingly threatening classmate (Sexton who is also great) who can't decide if he wants to \"rape\" her. Heartbreaking and all too close to the bone perfectly realized depiction of how judgemental we all are and just how harrowing adolescence really is. Dare not to be angered when her self-indulgent mother takes away her cake at the dinner table while the rest of the monstrous family greedily eat their desserts. Black comedy satire and documentarian genres blending seamlessly to a genuine masterpiece of poignancy sharply observant parable of anomie and angst by writer and director Todd Solondz (who won the Best Picture prize at Sundance). Wickedly funny and dead on accurate.",
         "\"Welcome to the Dollhouse\" is a fresh, creative, no frills pic about a junior high school girl who is the personification of \"uncool\". This poignant film could be dark comedy, light drama, satire or even farce depending on how its interpreted. However that may be, it shows in painful detail the assassination of the self esteem of a sweet, kind, and thoughtful girl who wants little more than to be liked. Entertaining as it may be, \"...Dollhouse\" is a movie with a message for everyone who has ever been 12.",
         "This is a shining example of the potential of independent cinema. More specifically, American independent cinema. If you put together nearly every Hollywood movie dealing with early adolescence, their combined weight in truth would not equal what we see in this one film. For some reason, it seems that most screenwriters and directors seem to look back on their youth with blinding nostalgia - painting the whole experience like it was some kind of carefree paradise. One full of prank playing, football games, pep rallies, getting laid, wild parties and having an all-around great time. What makes this movie so powerful and so unique is that it never shies away from being honest, even when it gets really nasty. As you are reading this, kids all over world are being ignored, taunted, degraded, pushed around, abused... And they are doing anything to try escape it. Running away, turning to drugs, committing suicide... WELCOME TO THE DOLLHOUSE basically details the life of a tween social outcast and middle child named Dawn Weiner (Heather Matazzaro). For Dawn, every day is a struggle for both survival and distraction from her 'real life'... She is degraded on a daily basis by her peers at school who refer to her as either \"lesbo\" or \"weiner dog,\" is receiving sexual threats from fellow outcast Brandon (Brendan Sexton III) and has to deal with a complete lack of love and nurturing from her frustratingly inept parents, who don't try to hide the fact that they prefer her brainy older brother and ballerina younger sister to her. Part of the genius of this film is that, despite the extremely grim subject matter, it is also blisteringly funny. You will laugh and you will wince... and often at the same time. The acting (largely from a group of unknowns) is spot-on, the writing is excellent and the suburban sets are appropriately gaudy. Interestingly, I've noticed skimming through other reviews and on the message board, that those who are/were near the bottom social ring in middle and high school seem to find more to grab on to here and much more emotional impact. Many of the haters seem to think this is wholly fabricated... possibly because they didn't have to deal with the the abuse, the whispering, the everyday torment that many others have to endure. Or possibly because they put someone else through it.",
         "This movie was great. I was shocked to see no one had posted a comment on it. A fantastic performance by Heather Matazarro. The movie is all about growing up in a world that expects you to already be an adult. Because Dawn Weiner is \"ugly\" she is mistreated, harassed, and ignored by everyone she comes across. I don't think I've ever seen a movie that featured a character more emotional alone. There is a scene where Dawn's mother offers Dawn's dessert to her siblings to get back at her. They take it, eagerly. Most movies like this are either black comedies or feature a character who is stoicaly non-conformist or just stoic. Dawn is neither. She bleeds, right up until the movies end, which I won't spoil but I will say that it is all the more heartbreaking for its inertia as for its action. Go find this one. You'll either love it or hate it. It's not a movie that just lets you go.",
         "Just imagine for one second that you are an 11 years old girl with ugly glasses. You are a middle child (the film also known as Faggots and Retards (working title) or Middle Child) with an older brother who is a computer wiz and a little sister, a pretty ballerina. Your name is Dawn Wiener, and almost every student in your middle school hates you, tells you in your face that you are ugly, and nobody remembers your name, you are called Dog Face or Wiener Dog', and one of your classmates greets you every morning with the words, \"I'll rape you today at 3 pm\" . The film should be called \"Welcome to Hell\", and Todd Solondz is our Virgil in this Inferno. Heather Matarazzo is absolutely terrific. She was able to play both, an archetype of an insecure, unloved, misunderstood, and lost in this cruel world child as well as one very real suffering young girl from New Jersey. That's why I could not forget her Dawn, I wanted to talk her, to tell her that yes, the world is cruel, and she was dealt the mixed cards from the beginning but she could play them, there is always hope, there are books, music, and art. Hang on; I would tell her, you are not going to be an \"ugly duckling\" forever. You'll take off your stupid glasses, you will grow up, you'll be just fine and you will find friends \u0096 just wait. But how can one wait at 11? The time drags so slowly in childhood, and every day is descending to Hell\u0085 One of the best films about the \"happy\" school years I've ever seen. 9.5/10",
         "Welcome to the Dollhouse is an excellent film. It shows, in a strictly un-opinionated manner, a young girl's experiences as one of the unpopular kids in her junior high-school. She is faced with the extreme viciousness commonly shown in schools towards the students who, for whatever reason, don't fit in. The film never attempts to go any deeper than simply displaying these occurences to us, never really analyzing them or questioning why things like that happen. It just shows what is, what we've all experienced or at least seen, and for that I think it's all the more effective. There are also some humorous moments thrown in, which I thought were nice and somewhat alleviated the otherwise depressing mood of the film (not that I'm complaining). Welcome to the Dollhouse is a great snapshot of human behaviour. That's the best way I can describe it.",
         "Look past the seemingly disturbing dialog in this film and take a deep look into its almost perfect portrait of the American Suburbs. Mr. Solondz writes in such a bold and daring fashion that it would be hard to top him. He writes and directs perfect Dark Comedies. The kind of movie I die for. He is a Satirist and he knows just how to disturb his audiences. If you take your time and give this film the multiple viewings it deserves it all begins to make sense. This was the first Solondz movie I saw, so I wasn't expecting what I got. The second viewing made me see the down right funny parts. This is the perfect portrait of an awkward pre-teen. Its doesn't make the \"freak\" turn out to be some sort of hero. It's new, fresh, and funny. ****/****"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Suburban Pictures"],
      "summaries": [
         "Seventh-grade is no fun. Especially for Dawn Weiner when everyone at school calls you 'Dog-Face' or 'Wiener-Dog.' Not to mention if your older brother is 'King of the Nerds' and your younger sister is a cutesy ballerina who gets you in trouble but is your parents' favorite. And that's just the beginning--her life seems to be falling apart when she faces rejection from the older guy in her brother's band that she has a crush on, her parents want to tear down her 'Special People's Club' clubhouse, and her sister is abducted....",
         "Seventh grade Benjamin Franklin Junior High School student Dawn Wiener is a social outcast who wants to be liked. At school, she is often bullied and called Wiener Dog. The other social outcasts don't want to associate with her. Her teachers don't even seem to like her. And at home, her parents, especially her mother, favors Dawn's younger sister, the ballerina princess-like Missy, or Dawn's older brother, the nerdish Mark who at least has a focus on the goal of getting into a good college. Because of this lack of attention at home, Dawn will often use the bullying tactics used on her by others on Missy, which gets her into even more trouble with her parents. Dawn's want for social acceptance leads her quietly to foster the attention of one of her primary school bullies, Brandon McCarthy, a boy from the proverbial wrong side of the tracks who always threatens to rape her. But Dawn's focus on Brandon lessens when Mark enlists the services of older popular student Steve Rodgers for his mediocre band (in exchange for help at school). Because he doesn't shun her, Dawn works toward the goal of getting Steve to be her boyfriend.",
         "Insightful look at an unattractive 7th grader as she struggles to cope with un-attentive parents, snobbish classmates, a smart older brother, an attractive younger sister, and her own insecurities."
      ],
      "budget": 800000
   },
   "movielensId": 562,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-05-24",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Todd Solondz"],
      "runtime": 88,
      "movieId": 562,
      "title": "Welcome to the Dollhouse",
      "mpaa": "R",
      "actors": [
         "Heather Matarazzo",
         "Victoria Davis",
         "Christina Brucato",
         "Christina Vidal",
         "Siri Howard",
         "Brendan Sexton III",
         "Daria Kalinina",
         "Matthew Faber",
         "Ken Leung",
         "Josiah Trager",
         "Bill Buell",
         "Eric Mabius",
         "Stacey Moseley",
         "Will Lyman"
      ],
      "imdbMovieId": "0114906",
      "originalTitle": "Welcome to the Dollhouse",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["PTCoF7ZQG0E"],
      "plotSummary": "An unattractive 7th grader struggles to cope with suburban life as the middle child with un-attentive parents and bullies at school.",
      "tmdbMovieId": 11446,
      "avgRating": 3.76359,
      "releaseYear": "1995",
      "numRatings": 7026,
      "posterPath": "/jvxLLHwpK52ZJUusd2RJv8oLHUJ.jpg"
   }
}