{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "industrial revolution",
         "id": 7025
      }],
      "imdb_id": "tt0107002",
      "video": false,
      "title": "Germinal",
      "recommendations": [
         78830,
         42394,
         63225,
         2065,
         81119,
         50211,
         76128,
         54012,
         33302,
         72822,
         59054,
         66070,
         108521,
         64559,
         17376,
         64207,
         43767,
         54157,
         16276,
         48769
      ],
      "backdrop_path": "/kxKQAE08hohDNZ7vQqaILCEQZR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Maheude",
               "gender": 1,
               "credit_id": "52fe4810c3a36847f8156755",
               "name": "Miou-Miou",
               "profile_path": "/oqTRzZm0h7KDTQEy5K4DSskaBrm.jpg",
               "id": 4274,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Toussaint Maheu",
               "gender": 2,
               "credit_id": "52fe4810c3a36847f8156759",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Étienne Lantier",
               "gender": 2,
               "credit_id": "541421f7c3a3687dc50018b7",
               "name": "Renaud",
               "profile_path": null,
               "id": 2189,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Vincent Maheu",
               "gender": 2,
               "credit_id": "5414221e0e0a26198a0018f7",
               "name": "Jean Carmet",
               "profile_path": "/dKtbIjEH9FI8Oa55uI5n8BA5qGK.jpg",
               "id": 24540,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Catherine Maheu",
               "gender": 0,
               "credit_id": "541422480e0a26198300190a",
               "name": "Judith Henry",
               "profile_path": "/oyt0uQQMUYRGHLQII0afKoi0Wg2.jpg",
               "id": 136757,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Chaval",
               "gender": 2,
               "credit_id": "5414226a0e0a26198300190c",
               "name": "Jean-Roger Milo",
               "profile_path": "/qIyAqoLvvbpQikebeHJwgIVfVwW.jpg",
               "id": 70168,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Souvarine",
               "gender": 2,
               "credit_id": "5414228b0e0a261992001907",
               "name": "Laurent Terzieff",
               "profile_path": "/kBqdwFxTqhwmKIYpbntGB6TRga5.jpg",
               "id": 24385,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Victor Deneulin",
               "gender": 2,
               "credit_id": "57befd579251414e3600240f",
               "name": "Bernard Fresson",
               "profile_path": "/qKxPvfwtiy7eYbmIGK7vz4JzZPd.jpg",
               "id": 24422,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Rasseneur",
               "gender": 0,
               "credit_id": "57befd6e9251414dee00241f",
               "name": "Jean-Pierre Bisson",
               "profile_path": "/bL7gu3gor8mR3wDEXkuPSmVvEBH.jpg",
               "id": 24395,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Philippe Hennebeau",
               "gender": 0,
               "credit_id": "57befd83c3a3685c4200291b",
               "name": "Jacques Dacqmine",
               "profile_path": "/2YcFSHJFHidivSXUoyETDRaA3ju.jpg",
               "id": 266665,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Madame Hennebeau",
               "gender": 1,
               "credit_id": "57befd9dc3a36821550066b9",
               "name": "Anny Duperey",
               "profile_path": "/qu7goZBv9ETl8BbIagaCPzNwQ0O.jpg",
               "id": 24475,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Paul Négrel",
               "gender": 2,
               "credit_id": "57befdd5c3a36838730056ad",
               "name": "Frédéric van den Driessche",
               "profile_path": "/awnNbWdhbmT6soOREzqwnb58D0F.jpg",
               "id": 37605,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Madame Grégoire",
               "gender": 1,
               "credit_id": "57befde7c3a3685c4200294e",
               "name": "Annick Alane",
               "profile_path": "/ybhENlcONNKYqMshNEIpCt4g6Yp.jpg",
               "id": 23733,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Léon Grégoire",
               "gender": 0,
               "credit_id": "57befdfe9251414e3600244a",
               "name": "Pierre Lafont",
               "profile_path": null,
               "id": 39531,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "la Levaque",
               "gender": 1,
               "credit_id": "57befe12c3a3685c42002962",
               "name": "Yolande Moreau",
               "profile_path": "/xvNEPTrfgvHeH1wOvMq0WGzovKv.jpg",
               "id": 2415,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Maigrat",
               "gender": 2,
               "credit_id": "57befe219251413dae005d61",
               "name": "Gérard Croce",
               "profile_path": "/leC1NOxwK4kkhlBwniJWJXKcswK.jpg",
               "id": 1652994,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4810c3a36847f815673f",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4810c3a36847f8156745",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4810c3a36847f8156751",
               "name": "Arlette Langmann",
               "profile_path": null,
               "id": 38397,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a2ae47192514103261334c0",
               "name": "Émile Zola",
               "profile_path": "/oXA6DkOtc1xYaKmmbAUc2l56UEh.jpg",
               "id": 87667,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.313435,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 51980,
      "vote_count": 69,
      "budget": 0,
      "overview": "It's mid 19th century, north of France. The story of a coal miner's town. They are exploited by the mine's owner. One day the decide to go on strike, and then the authorities repress them",
      "similar": [
         3082,
         44103,
         8953,
         116369,
         515374
      ],
      "original_title": "Germinal",
      "runtime": 160,
      "poster_path": "/iEDH8xmYdMnDDTxfbIZvcEO8Fs9.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Renn Productions",
            "id": 82,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "DD Productions",
            "id": 1524,
            "origin_country": ""
         }
      ],
      "release_date": "1993-09-29",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Who needs God and Heaven? We can change this lousy world.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Berri"],
      "runtime": 160,
      "synopsis": null,
      "writers": [
         "Claude Berri",
         "Arlette Langmann"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0107002/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzk5NTA4MjMwNl5BMl5BanBnXkFtZTYwMTg4NTg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Renaud, Gérard Depardieu, Miou-Miou | See full cast and crew »"],
      "reviews": [
         "\"Germinal\", based on a novel by Emile Zola, is an epic film which studies the anatomy of a strike in a 19th century French coal mine. During it's 2.5+ hour run time, the film shows the wretchedness of coal miners, their deplorable living conditions, their attempts to organize, negotiations, strike, rioting, police suppression, sabotage, etc. The story is woven around a handful of characters who represent the forces at work; management, union, profiteers, scabs, etc. About Zola's novel, Havelock Ellis wrote: \"It was neither amusing enough nor outrageous enough to attract the multitude\". So it is with the film which emphasizes realism over romanticism and exists more as a study of a timeless social/political issue than pure commercial entertainment. A must see for cinema buffs but not likely have broad commercial appeal.",
         "\"Germinal\" (French, 1993): This EPIC story, adapted from Emile Zola's novel and put to film by Claude Berri (director of \"Jean de Florette\" and \"Manon of the Spring\"), is the gritty depiction of hard working coal miners in 1800's France, trying to eek out a living and better their lives by forming a labor union. Loaded with issues rising through the Industrial Age, Gerard Depardieu, Miou-Miou, Judith Henry, and Jean-Roger Milo deservedly star in a frighteningly bleak setting, with ominous musical scoring, and the relentless, black dust of coal. Comparisons to the wealthy mine owners lives, opulent and very isolated from their industry's realities, are blatant and clear. Zola wanted some economic and moral balance \u0096 even just a little \u0096 and set about depicting a situation that could not be denied.",
         "I've never been interested in costume drama's that deal with 18th and 19th century high society. As I once said before in another review: \"There is just too much gold foil, too much ugly wigs and pompous costumes, too much over the top decors, just too much of everything that I detest in it\" and I really haven't changed my idea about that so far. But when I'm able to see a movie that deals with the life of the ordinary man in that time period, than I'm always willing to give it a chance. \"Germinal\" is such a movie that deals with life of the ordinary man and woman. It tells the story of the coal miners in the region of Lille, in the North of France at the end of the 19th century. They are all poor, they work too hard in awful conditions and they don't get paid what they deserve by the bosses who only want to get richer and richer by doing whatever they can so they won't have to pay a cent to their workforce. Of course the miners aren't happy with that situation and when they get into contact with two men who both want to change the situation, one a communist union man and the other one an anarchist, the miners soon go on a strike, with some very unpleasant consequences as a result... What first went through my mind while seeing this one, was that this movie has a lot of similarities with \"Daens\" (1993), the Belgian movie that tells the story of the poor textile workers in Flanders at the end of the 19th century. It's the same time period and both regions are only about 60 miles or 90 kilometers apart. If you like to see what life in the European industrial regions at the end of the 19th century was like, than both movies are certainly something you shouldn't miss. What I liked about the movie as well was that it had a good pace and that it stayed interesting from the beginning until the end. It could have been very easy for the director to make a movie about this subject that lasted 5 or 6 hours, but than it might have lost much of its power. Now, you get a pretty good idea of what life in that region during the industrial revolution was like, without having to struggle through too many details that don't really contribute to the story. Next to the good story, I must say that I also liked the acting. Even though Gérard Depardieu hasn't always made the best choices of movies to play in, I always like him in the role of the ordinary man, the underdog that has to fight the system. I liked him in the mini-series \"Les Misérables\" as well and he has the same kind of role in this movie. The other actors did a fine job as well, even though I have to admit that I don't really know anyone of them, except for Bernard Fresson perhaps. All in all this is a very good adaptation of the novel by Émile Zola. It does exactly what I expected from it and that's why I give it at least a 7.5/10.",
         "\"Germinal\" is a vivid, colorful, eloquent rendering of how the life of mine workers was in Europe in late 19th century. It is also a powerful illustration of how a strike could come about in that time, and how difficult - almost hopeless - it could seem for those dirt-poor people to try and improve their miserable life conditions. Of course, the contrast with the bourgeoisie is striking and thought-provoking. Depardieu (as Maheu) is, as usual, a giant figure, and most other actors are also very convincing. One question that remains when you saw it all is : can you really change a society's deep, unfair structure without violence?",
         "Genius - Hollywood can never touch this. We should be thankful that there is a country that produces real films - and of this scope. I cringe to think how badly this would have been mutilated by Americans - we'd have a happy ending, they'd \"go easy\" on the commie stuff, there would be no premarital relations, the shopkeeper would be spared, some bland and muscly \"action hero\" type would catch the saboteur character and they'd fight with wrenches - sparks flying in the mineshaft. They would take out all social commentary, rename it etc etc... And then - the sequel \"Germinal 2 - the Heroes of the Pit!\" in a modern day setting with oil wells and helicopters. Anyway, in all sincerity, I hope the accountants of Hollywood never try to butcher this story.",
         "Reducing Zola's masterful but monstrously long novel to a movie is the problem that Claude Berri does not seem to have resolved. He sticks close to Zola's text, which means that we get lots of undeveloped snippets of what were very developed scenes in the novel. If you don't know the novel, this probably causes a certain sense of confusion. If you do know the novel, and it is well-known in France, you have the sense that you are just skimming the surface. I think that Berri would have done better to be less faithful to the novel, or at least less comprehensive in his adaptation of it. That said, there are most certainly good things in this movie. Miou Miou delivers, in my opinion, the movie's best performance. No, she is not at all the earth mother that Zola's la Meheude is. But she acts with her face, saying far more with a facial gesture than many words would have said. In a movie that skims over a lot of material, that makes for very effective acting. Depardieu is sometimes very good - physically he is perfect for the part of le Maheu - sometimes he seems to deliver the lines without thinking about them. The actor who plays Souvarine is very striking. The cinematography is nice, but does not convey a lot of what Zola emphasizes in the novel: the heat and lack of space in the mine tunnels, etc. A good movie if you haven't read the novel; a disappointing one if you have.",
         "A straightforward, generally fast-moving, recounting of a gripping social struggle, portrayed without any special effects for special effects' sake (though I think there was plenty of unobtrusive special effects), with the emphasis always on the dramatic line; good acting by all concerned; generally plain, clear photography that served the story-telling and not some \"artsy\" vision--all these added up, for me, to an enthuasiastic vote of \"ten.\" Cannot praise this film enough. No, it's not some summit of art, but it's a textbook example of how to tell a story, keep the audience's attention, and honor the dramatic basis of the project instead of indulging in \"artistic\" whims and triviliaties that will appear dated in five or six years. I'll be watching this one again. (By the way, I found the distant shot of the striking workers marching across the plain especially moving. And I had the feeling throughout the film that this was how things really looked at that terrible period of French, and European, history.)",
         "Tackling a book such as Germinal is a mammoth task - and one that I always thought was extremely difficult to transfer onto the big screen. There are two ways you can do it, keep it simple or explore everything and bore the audience to death. You can see here that the director has decided to keep the story as simple and straightforward as possible. This means there are a few gaping holes in the film, as it ignores some of the intricacies of the story and many of the sub-plots which punctuate the story and add to the feel of the book. In one sense he succeeds, as the tempo of the film is high and it rattles along at a fair pace, not reading like a 2 and a half hour story. But the major drawback of this tactic is that Germinal ends up looking like a simplistic noble workers versus the greedy bosses story, when the novel is anything but that. Scorn is poured on both sides with equal contempt by Zola, and plenty of sympathy is given to some of the \"wealthy\" protaganists in the book. Having said this, I do understand that in order to keep the film from turning into a 4 hour behemoth, you need to try and keep it as simple as possible. On the whole, however, it is pretty well acted and the art direction is utterly breathtaking. The villages, the pits, the landscapes, the mines are fabulously shot. You really can feel the poverty oozing from every inch of the screen. Gerard Depardieu (Maheu) and Renaud (Ettiene) put in some pretty convincing turns but feel that Jean-Roger Milo rather over-egged Chaval, turning him into some pseudo incredible hulk type character who is incapable of speaking normally. Judith Henry also seems a little to young and fresh faced to play Catherine. I think I let my interpretation of the book cloud my judgement, and as a result I was disappointed because I expected more from the film than I should have. Rating: 3 out of 5",
         "Making a two-hour film out of a 500 page book is tough, sure. But this version stinks. I'm sure someone really thought (Claude Berri?) this would be good. The problem is the film scratches the surface of the world Zola created. An obvious example is the mine, Le Voreux itself, in the beginning is described as a kind of living, breathing, horrific thing that swallows humans by the cartload. The trepidation of Etienne in going down to work is described in the book with such detail that when you watch the film the reality of what horror it must have really been is reduced to a simple look of anxiety on Etienne's face while he comfortably waits to descend. There is no trace of the idea of Le Voreux being a monstrous man-swallower. Missing this thematic point has nothing to do with a film's running length. It's a classic movie rendering of a book, without flavor, without guts, without imagination. The casting is atrocious. Etienne is supposed to be twenty-one years old, this guy looks well into his thirties (he was 40 in 1992). It's an important factor. Gerard Depardieu is fat as Maheu, in the book these poor people were starving to death, skinny to the point of emaciation, yet here is Depardieu looking very well fed. Who said Depardieu was physically perfect for the role? Are you nuts? These people were starving to death. The way they portrayed the poor was so prettied up, the younger sister was hunchbacked by malnutrition in the book but here is a cute healthy looking girl of course, their hair is clean and clothes relatively tidy, they look like modern people dressed up. If they wanted to make it look real, these people would have looked like they were suffering physically, as Zola described them. Malnourished, with bad skin, teeth, etc. Berri or whomever didn't have the guts to really show what they must have looked like, it would have been too extreme. Yet the extremity is the book's central character in a way. Without that, this is garbage. Another example, in the mines, in the book, the characters would have to crawl on their hands and knees to get to the seam in places, in pitch-black darkness at points, and Etienne would have suffered all sorts of bruises and cuts, but in the movie they just stroll on up to the spot. The characters and setting in the movie do no justice to how the book describes things like the temperature, freezing cold one minute and dying of heat the next. There are many examples like this. I had to turn it off. The acting wasn't that good either, not necessarily their fault, when they're forced to generalize things that were compressed and not naturally developed in the film the way they were in the book. Look, of course it's difficult to adapt a book, especially a good book, but if you can't do it, just don't. You're embarrassing yourself. The contrast between the classes in this book and how it completely illuminates their difference make the story make sense. This movie unfortunately doesn't come close. Only stupid 21st/20th Century minds from the Civilized West could actually think the poor characters in the movie were shown realistically as impoverished. We have no idea. That's why you read the book. Make the movie if you have the courage to do it justice. Without showing the real conditions, the desperation of the people to strike doesn't make sense, they have to be willing to die, because they're dying already.",
         "Big production values supported by the humane acting and a heart wrenching story of poverty and misery. The script has a few gaping holes in it but you manage to overcome those obstacles and be affected by this touching film."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Renn Productions",
         "France 2 Cinéma",
         "DD Productions"
      ],
      "summaries": [
         "It's mid 19th century, north of France. The story of a coal miner's town. They are exploited by the mine's owner. One day the decide to go on strike, and then the authorities repress them",
         "In mid-nineteenth-century northern France, a coal mining town's workers are exploited by the mine's owner. One day, they decide to go on strike, and the authorities repress them."
      ],
      "budget": 0
   },
   "movielensId": 563,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1993-09-29",
      "dvdReleaseDate": null,
      "directors": ["Claude Berri"],
      "runtime": 160,
      "movieId": 563,
      "title": "Germinal",
      "mpaa": null,
      "actors": [
         "Miou-Miou",
         "Gérard Depardieu",
         "Renaud",
         "Jean Carmet",
         "Judith Henry",
         "Jean-Roger Milo",
         "Laurent Terzieff",
         "Bernard Fresson",
         "Jean-Pierre Bisson",
         "Jacques Dacqmine",
         "Anny Duperey",
         "Frédéric van den Driessche",
         "Annick Alane",
         "Pierre Lafont",
         "Yolande Moreau",
         "Gérard Croce"
      ],
      "imdbMovieId": "0107002",
      "originalTitle": "Germinal",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["chCnbs7UMSk"],
      "plotSummary": "It's mid 19th century, north of France. The story of a coal miner's town. They are exploited by the mine's owner. One day the decide to go on strike, and then the authorities repress them",
      "tmdbMovieId": 51980,
      "avgRating": 3.45455,
      "releaseYear": "1993",
      "numRatings": 363,
      "posterPath": "/969W3oYh0Ne6dkVysxaulQf13C2.jpg"
   }
}