{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "industrialist",
            "id": 2456
         },
         {
            "name": "scarab",
            "id": 2907
         },
         {
            "name": "invention",
            "id": 3338
         },
         {
            "name": "immortality",
            "id": 4978
         },
         {
            "name": "aging",
            "id": 4995
         },
         {
            "name": "tycoon",
            "id": 5728
         },
         {
            "name": "antique dealer",
            "id": 185420
         }
      ],
      "imdb_id": "tt0104029",
      "video": false,
      "title": "Cronos",
      "recommendations": [
         1433,
         28942,
         11879,
         4961,
         27429,
         8852,
         24274,
         931,
         11167,
         25508,
         13550,
         11772,
         21484,
         29161,
         20620,
         31417,
         20481,
         16093,
         25627,
         9538
      ],
      "backdrop_path": "/zcMJL31W31a0MHYr7HELl7dza78.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jesus Gris",
               "gender": 2,
               "credit_id": "52fe44719251416c75034fcf",
               "name": "Federico Luppi",
               "profile_path": "/lNMqvLiykP9VIM6bCYf8jLuglVM.jpg",
               "id": 17094,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Angel de la Guardia",
               "gender": 2,
               "credit_id": "52fe44729251416c75034fd3",
               "name": "Ron Perlman",
               "profile_path": "/xZyrXT2iEmSOokQRc1hedmxrbTi.jpg",
               "id": 2372,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "De la Guardia",
               "gender": 0,
               "credit_id": "52fe44729251416c75034fd7",
               "name": "Claudio Brook",
               "profile_path": "/4lvR0Ixy7csWDZR6H6NQlfUw5fL.jpg",
               "id": 39008,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mercedes",
               "gender": 1,
               "credit_id": "52fe44729251416c75034fdb",
               "name": "Margarita Isabel",
               "profile_path": "/b9LL69HihaKQSd0JR4Uep1rNmo8.jpg",
               "id": 70364,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Aurora",
               "gender": 0,
               "credit_id": "52fe44729251416c75034fdf",
               "name": "Tamara Shanath",
               "profile_path": null,
               "id": 70365,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Alchemist",
               "gender": 2,
               "credit_id": "55e11926c3a3682cbf000b2e",
               "name": "Mario Iván Martínez",
               "profile_path": "/yi6aygCSr9Ui6w5uTT8FAa5GexV.jpg",
               "id": 148189,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44729251416c75034fe5",
               "name": "Guillermo del Toro",
               "profile_path": "/aBPPwt3jcFw2ridEkKTgchfPaic.jpg",
               "id": 10828,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44729251416c75034feb",
               "name": "Guillermo del Toro",
               "profile_path": "/aBPPwt3jcFw2ridEkKTgchfPaic.jpg",
               "id": 10828,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44729251416c75034ff1",
               "name": "Arthur Gorson",
               "profile_path": null,
               "id": 70366,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44729251416c75034ff7",
               "name": "Bertha Navarro",
               "profile_path": null,
               "id": 17001,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44729251416c75034ffd",
               "name": "Javier Álvarez",
               "profile_path": null,
               "id": 70369,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44729251416c75035003",
               "name": "Guillermo Navarro",
               "profile_path": "/AfZkxrEiLlqqHONhfJyVOLrHR8A.jpg",
               "id": 3113,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44729251416c75035009",
               "name": "Raúl Dávalos",
               "profile_path": null,
               "id": 48457,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.120172,
      "production_countries": [{
         "iso_3166_1": "MX",
         "name": "Mexico"
      }],
      "id": 11655,
      "vote_count": 188,
      "budget": 0,
      "overview": "Faced with his own mortality, an ingenious alchemist tried to perfect an invention that would provide him with the key to eternal life. It was called the Cronos device. When he died more than 400 years later, he took the secrets of this remarkable device to the grave with him. Now, an elderly antiques dealer has found the hellish machine hidden in a statue and learns about its incredible powers. The more he uses the device, the younger he becomes...but nothing comes without a price. Life after death is just the beginning as this nerve-shattering thriller unfolds and the fountain of youth turns bloody.",
      "similar": [
         11654,
         15772
      ],
      "original_title": "Cronos",
      "runtime": 94,
      "poster_path": "/6ZgqGgguuKU0Ba2aQOjzikbwnNQ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "CNCAIMC",
         "id": 6566,
         "origin_country": ""
      }],
      "release_date": "1993-09-12",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Guillermo del Toro"],
      "runtime": 94,
      "synopsis": "\"In 1536, fleeing from the Inquisition, the alchemist Humberto Oganelli disembarked in Veracruz, Mexico. Appointed official watchmaker to the viceroy, Oganelli was determined to perfect an invention which would provide him with the key to eternal life. He was to name it the Cronos device. Four hundred years later, one night in 1937, part of a wall in a building collapsed. Amongst the victims was a man of strange skin, the color of marble in moonlight, his chest mortally pierced. His last words: Sua tempore. This was the alchemist. The authorities located the residence of the dead man. What they found there was never fully revealed to the public. After a brief investigation, the mansion and its contents were sold at public auction. Never on any list or inventory was the Cronos device mentioned. As far as anyone knew, it never existed.\" What was not revealed to the public was that a human male was found hanging from his feet, his blood draining into a basin. Also unknown to the public, except for a dying millionaire named de la Guardia [Claudio Brook] who will stop at nothing to obtain it, the Cronos device had been hidden in the base of a statue of an archangel. De la Guardia had spent his life acquiring old statues of archangels, always in search of the hidden Cronos device... so far in vain... until the day that the archangel shows up in the antique shop of Jesus Gris [Frederico Luppi]. Jesus and his granddaughter find the device and, not knowing what it is, Jesus activates it. He is horrified as claws protrude from the orb, hold fast to his hand and proceed to dig into his flesh. Meanwhile, de la Guardia (who lives in an antiseptic chamber) sends his nephew Angel [Ron Perlman] to buy the archangel. When the statue proves to be empty, however, Angel is forced to take strong measures. He kills Jesus. Fortunately, Jesus has come to realize that the Cronos device confers immortality, and he uses it. But there is a cost. He begins to crave human blood, and his flesh starts peeling off, exposing a strange layer of skin, the color of marble in moonlight. In the final confrontation between Jesus, de la Guardia, and Angel, Jesus emerges victorious. Still, he smashes the Cronos device and goes home to Aurora and his girlfriend... to die. [Original synopsis by bj_kuehl] ___ A voice over (Jorge Martínez de Hoyos) tells the story of Humberto Oganelli (Mario Iván Martínez), an Alchimist who arrived to Veracruz in Mexico running away from the Inquisition. In 1937, a building collapsed, and a grey-skinned men was discovered. It was Oganellli, the inventor of the Cronos device. He is supposed to die at that moment, impalled onto an iron stick. Every together renmant of that building was auctioned, including the small statue of an angel. Years later, the angel appears at the antiquarian's shop. Somebody (Luis Rodríguez) enters to look at it but leaves without buying it. Jesús Gris (Federico Luppi) has bought it. He realises that the angel is hollow, because, through one of the eyes' empty plaster socket, several huge bus fall down to the floor. Jesús picks up a kind of oval machinery thingy; it's the Cronos watch, a golden watch in the shape of a metal scarab. His mute granddaughter, Aurora (Tamara Shanath) is with him when he finds it. Ángel de la Guardia (Ron Perlman) is told where the angel statue is. In his turn, he tells his uncle, a millionaire De la Guardia (Claudio Brook) the news. De la Guardia wants the angel statue at all costs. Ángel buys it for him. Jesús wants to keep the watch. He sets the machiney onto motion. At first, it looks safe, but then 6 cocroach-like legs protude from the watch and make a hole on his hand. He doesn't let Aurora to get near the thing. His girlfriend Mercedes (Margarita Isabel), a tango-dance teacher, tends to his wound. She takes out a kind of metal sting from his hand and gives him some stiches. At night, Jesús doesn't feel very well. He goes to drink some water to the fridge, but the thing which attracts him the most is the bright red meat. Jesús feels restless. He sets the watch in motion again. A fourth sting comes out of the back side of the watch. That morning, the sun is shining outside. Jesús draws the curtains. His face looks much longer, but he shaves and he tells his girlfriend that he looks much younger because he has saved his white-haired moustache. When Jesús arrives to the shop, it has been vandalised. He contronts Ángel. He is frustrated because the archangel statue was hollow... and empty. De la Guardia tells him about the history of the Cronos mechanism. He also admits that he's dying of his sickness, and no treatment has worked so far. Jesús doesn't want to lose the Cronos. Jesús leaves on a hurry by the rooftop trying to look for Aurora, as he suddenly realises she's in danger. Aurora has picked up the Cronos to play with it. When he finds Aurora, he realises that she is frightened and tries to hide from him, or maybe she's scared about him, in any case she stops playing with her toy teaset and hides away from him. He tries to calm her down. She has hidden the Cronos inside her teddy bear. Immediately, Jesús uses the Cronos again, this time on his chest. Jesús is still guessing at the nature of the Cronos, but he feels that it's doing him good. His chest wound now expels a kind of mucose, and his eyes feel weird. Mercedes insists on his leaving the bathroom and go with her to the New Year's Eve party. Mercedes wonders how anyone can change so fast in such a short period of time. They dance in love there at the party. Aurora goes with them, but the girl usually stays on her own, silent as always. During the party, a man (Javier Álvarez) gets hurt and starts bleeding profusely. Jesús can't refrain from following that man to the gent's. They make small talk, but Jesús can't stop himself from staring at the spilled blood. He gets down on the floor to lick a blood stain. Somebody kicks him while he's doing that, knocking him out. The countdown to the first day of the year is being celebrated by everybody else. Meanwhile, Jesús is pushed out of the place where the party takes place. When he wakes up, he's in a car with Ángel, who beats him up. Ángel won't stop seeking the Cronos. Jesús asks what they want it for. Ángel leaves Jesús unconscious. Ángel pushes the car down from a cliff with Jesús inside. A funeral technician called Tito (Daniel Giménez Cacho) is preparing Jesús' corpse for burial. He is told that he'll be cremated, so all his excellent artistic work will be useless. De la Guardia tells off his nephew because he couldn't get the scarab and probably Jesús is still alive. Ángel goes to the funeral home and tries to wake Jesús up by closing his nostrils. Ángel leaves him for dead. Tito prepares the crematorium to burn the coffin - but there are problems with the gas and the piping, as all the tubes and pipes are really old and they would need maintenance. The technician leaves the room for some seconds to solve the problem. He doesn't realise that the coffee is empty, he just closes it down again without thinking about it. Ángel appears with the funeral house director (Juan Carlos Colombo) to enquire about the body of Jesús. The technician shows him the empty coffin burning to ashes in the oven. Ángel smiles. It's freezing. It's night. Jesús walks dazed confused and with a grey wounded face. He stops by a rubbish bin and he sees printed his own orbituary. Jesús tries to phone Mercedes. When he finally speaks up, Mercedes hangs up. Jesús limps home. It's Christmas and decorations are on the streets and the main hall of his building. He is opened the door by Aurora, who offers a towel for him. Jesús uses the Cronos mechanism again. Daylight really hurts him, so he hides inside an old trunk. Aurora paints the trunk and keeps on playing. Jesús writes a long letter to Mercedes. Jesús' faces is worst still. Jesús comes back to De la Guardia's warehouse, and he realises that Aurora has followed him. He tries to scare her away. She finds the little book written by Humberto Oganelli. There are some pages missing, and De la Guardia says that he's eaten them. De la Guardia takes off some pieces of dangling skin from Jesús' face nows feels metalic. De la Guardia rings the bell for his son. Ángel is pissed off at being disturbed by his uncle. De la Guardia tells Jesús that he needs to artifact to keep himself alive, and that he also needs blood. Jesús shows the Cronos to him and asks for the exit. De la Guardia knighs him. He fights with Jesús, but Aurora hits De la Guardia with a long stick. Jesús wakes up. Ángel appears and he tries to talk to his uncle. Jesús drinks the blood from De la Guardia's body. Ángel gets off from the lift and finds his uncle dead. Jesús and Aurora have hidden away. Ángel laughs with joy as everything will become his. However, at that moment, De la Guardia asks him for help, but his nephew kills him, fed up of being kept waiting. Jesús and Aurora hit Ángel. They run across the rooftops. He tells her granddaughter to leave by doing down the façade's ladder. Ángel hits Jesús. His victim looks week and unable to defend himself: he can only crawl away from him. To end the matter, Jesús throws himself agains Ángel's body, making him fall to the floor. Aurora sets the mechanism onto motion. Inside the scarab, a huge bag gives Jesús life. Aurora caresses Jesús' deformed face. Jesús peels off his own skin. Aurora was a bit hurt, so she's broken her lip. She offers her blood to Jesús, who finally decides to reject it with a supreme effort. Jesús shouts \"NO!\", and he removes the Cronos from his chest. He uses a stone to break it into pieces. He repeats his own name over and over again. Jesús dies, being cried by his granddaughter Aurora. ---written by KrystelClaire",
      "writers": ["Guillermo del Toro"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0104029/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MTU0MzE1N15BMl5BanBnXkFtZTcwOTg1OTU0NA@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Federico Luppi, Ron Perlman, Claudio Brook | See full cast and crew »"],
      "reviews": [
         "Guillermo Del Toro's stylish and original take on the vampire legend is one of the most strangely overlooked and underrated films of the 1990's. It's films like this that make me want to watch films - films that are fresh, unpredictable and so rich in symbolism that it has leaves lots of room for discussion. Del Toro was little more than an amateur director at the time this made, but in spite of that he's more than given the professionals a run for their money. Every scene is adeptly filmed, and the way that Del Toro makes contrasts between locations and the two central families is a pleasure to observe. The way that the film switches language from English to Spanish and back again is indicative of the fact that this is a rich tapestry of contradictions and one that makes intelligent comments on many subjects, from obvious ones such as addiction, to more concealed ones, such as a commentary on family; stemming from the way that the roles of child and parent become reversed when our hero becomes afflicted with the vampire-like curse. For the story, Del Toro has taken the classic vampire theme and mixed it with essences of mechanics and the human lust of being able to live forever. The story follows Jesús Gris, an antique dealer that lives with his granddaughter Aurora and wife Mercedes. One day, our hero happens upon a mechanical scarab that latches itself onto his palm, causing him to bleed. Jesús slowly gets addicted to the mystical scarab, but there's someone else that wants it and will stop at nothing to get it. The mythology of the scarab is told in a great opening sequence that sets the viewer up for an intriguing and original horror story. The film retains the intrigue that it sets up in it's intro for the duration, and Del Toro ensures that his audience is always left guessing and wanting to see what comes next. The film works due to interesting characters that the audience is able to feel for, and is constantly interesting by the way that Del Toro handles the contrasts that the story presents. On the whole, this is a fabulous horror story that takes an existing legend and makes it it's own. This is exactly the sort of film that cinema needs more of; and it's not one that film fans will want to miss. Highly recommended viewing.",
         "An antiques dealer finds a device that gives everlasting life, but with it comes a horrible price. Cronos follows the story of a kind hearted Mexican antiques dealer Jesus (a well cast Frederico Luppi), who one day stumbles upon a huge golden mechanical bug that when applied to specific parts of his anatomy seemingly starts reversing the aging process. However lurking in the background are a demented man (played by a very haunting Claudio Brook) who realizes the potential of the mechanical bug's power and will stop at nothing to acquire it. Assisting him in his search to get the mechanism is his maniacal son Angel (Ron Perlman in one of his best performances). Writer/Director Guillermo Del Toro proves that he could be one of the most innovative low budget mexican directors to come about since Robert Rodriguez. The scenes showing the inside of the cronos device are very sharply done and it seems you are actually looking inside the device. To compliment Guillermo on his writing, never before have I seen such an interesting spin put on the vampire/zombie genre. And in saying that I may be giving away too much of the plot. Unfortunately due to low production cost, the movie moves along at a slow pace and without a lot of shock. It is, however, kept strong by first rate acting, especially by Jesus' little granddaughter (Tamara Shanath), who in my opinion, if given the chance, will grow up to be a very fine actress. Which is actually a great feat for all actors involved because this movie is a cross between drama and horror and requires fine acting. All in all, this best picture winner at Cannes is a hidden horror gem that just pours out originality, and can really not be overlooked by any true horror or movie buff. The twists come aplenty and there is enough gore to suffice any horror fan. So for any person looking to rent a mindless gorefest rent C.H.U.D. But for those looking for a horror film with a little intelligence, do yourself a favour and pick up Cronos, it's well worth the rent. Overall Rating: 7 out of 10",
         "I can't think of many 90's films that will be remembered as classics of the horror genre, this film is an exception. When you think of Mexican horror, you no doubt think of the El Santo Vs. the Aztec Mummy type films made in the 60s, don't get me wrong, I like them too. In interviews, director Guillermo Del Toro has said that his influences come more from American and British horror (such as the classic Universal and Hammer horror films) than from Mexico's horror tradition. Still, the film does have a distinctly Mexican sensibility, especially with it's abundance of Catholic imagery. First time director Del Toro, cinematographer Guillermo Navarro (who would go on to do great work for Robert Rodriguez and Quentin Tarantino, among oth ers), and production designer Tolita Figuero create a very unique, interesting look for the film. All of the actors are great, especially veteran Argentinian actor Federico Luppi, who plays the main character Jesus Gris, and Luis Bunuel's favorite Mexican actor Claudio Brook, who plays Dieter De La Guardia. What really makes the film for me is it's quirky sense of humor and odd characterizations, I found scenes toward the middle of the film to be hilarious. The effective, subtle, score by Javier Alvarez also adds to the mood of the film. The film also manages to be a very different kind of vampire story than usual, It makes me think a little bit of the \"Wurdulak\" segment of the great Mario Bava's film Black Sabbath. Vampire films of late have become very tiresome, it's nice to see someone take a different approach. I think Guillermo Del Toro is a talent to watch for.",
         "Some of the most imaginative films originate in Mexico. This one is no exception. When Jesus Gris, an old antique dealer opens the base of an ancient statue, a golden object in the shape of a large beetle drops out. This mechanically activated object can clutch a human arm and inject a magical fluid which can prolong life. The early scenes, when the camera moves about the treasures in the antique shop, set the atmosphere and draw us into the story. Each piece seems to hold a special secret. When the mechanical beetle suddenly grabs at the old man's forearm, we can feel the excruciating pain as he screams out and we see the pointed legs piercing his skin. Then follows the injection by the scorpion-like tail. Terror reigns until he dislodges the device. (What a relief!). Now wait for the miracle to happen! Excellent make-up on the main character as this horror story unfolds makes it almost believable at times. The sincerity of the acting between the old man and little granddaughter who plays about the shop makes for a really warm and loving relationship. (Where do they find such wonderful child actors?). Evil is portrayed by the cruel Dieter de la Guardia and his henchmen who set out to steal this ancient invention of the alchemists. Much of the excitement of the film is provided by a chase through upper rooms and rooftops (real edge of the seat viewing!). One of the most unforgettable scenes is the close-up view of the whirring golden cogwheels inside the device. They make a cruelly fascinating and threatening sound as they wind up to do their mysterious work. Movie-goers who have a horror of hypodermic needles should perhaps give the film a miss but you brave ones will enjoy the age-old theme of searching for the secret to eternal life.",
         "This is a unique film. This is not a gore-fest type of flick, but instead, a compassionate story about an elderly antique dealer named Jesus Gris who discovers an object called \"The Cronos\" which causes him to crave blood. While still in Jesus Gris's possession, \"The Cronos\" is actively pursued by Angel de la Guardia (a big \"Herman Munster\" of man) played convincingly by Ron Perlman. Angel de la Guardia is the nephew of another deteriorating elderly man \"Dieter\" who wishes to have \"The Cronos\" because it will give him eternal life as a vampire. Can Jose Gris love for his grand daughter overwhelm his craving for blood? Find out for yourself!!! What I liked best about this film is the compassionate story line, the dark humor of the mortician, and the effective use of subtitles. -Bottom Line: Very unique and Nicely Done!!!",
         "Severely underrated on this website, Cronos is an engaging tale that captivates the viewer for the entirety of its duration. Guillermo Del Toro's first ever film is a thoughtful, heart-wrenching story which above all manages to be fresh, intriguing and unique while managing to captivate the feel of horror films in the same mould as The Shining, whereby it is a film about family first, and a horror film second. Cronos is most definitely not associated with the slasher end of the horror market and nor is it anywhere near the filthy attack on the sense provided by goreography. What Cronos manages to achieve is an attack on the mind and the soul, the essence of what a horror film must succeed in doing if it wishes to leave a lasting impression. Given this I can, to an extent, see where the mediocre rating has derived from, it's not a blood fest it doesn't provide a scare a second and nor does it have gratuitous scenes of eyes being gauged out by rusty pick axes, but as every true horror fan knows is these are merely sideshow attractions to the superior horror films like The Shining, like The Fog, and Cronos if not completely at the top, is very close indeed. There are three things which notably stand out about this film and make it undoubtedly worth watching. The most subtle is the commentary on US-Mexico relations that Guillermo Del Toro has littered throughout his film. It provides an interesting portrayal into how he, and undoubtedly many Mexicans, feel about their encounters with the US, that they are always trying to be dominated and they must stand up on their own, to strive to succeed. The most obvious is that of the highly notable Christian references and intentional name play. Our protagonist, the antique dealer, is named Jesus for simple reincarnate issues, but there a great deal of \"my God\", \"my Lord\" and more comments of that ilk in the film, there is undoubtedly a side plot on the directors behalf of pointing out the good that still emanates from our protagonist. Jesus' granddaughter and wife are named Aurora and Mercedes respectively, and by knowing the meanings of their names which are \"the dawn or first light\" and \"mercy\" provides the films finale with a sense of completion. Lastly of note is the acting on the part of Federico Lupi and Tamara Shanath, who provide the necessary gravitas even in motion if not through vocals to convey the deep emotional tie between grandfather and granddaughter which when all else is removed is the main driving force of this story, and the one that will have you coming back for more. It's innocence is soul-wrenching, yet Aurora's ability to see what is happening with unclouded eyes, provides the cornerstone for the emotional drama to take hold. One critic in 'The Daily Telegraph' claimed this to be as \"scary as hell\", and to be honest he is wrong. This film isn't scary in the 'popping out from behind the bushes with a meat cleaver' manner, this film is an attack of that which makes us, and indeed Jesus, human. It is a cerebral assault which plucks at your heart strings and confuses the soul, and for it is severely likable and very watchable while occasionally disconcerning. Cronos is human drama at its most wonderful, emotional and chilling and more importantly a wonderful debut by a director who will build in stature and promise greater things, but this is a debut with bite to it, and once it grabs hold of you, it's very difficult to get it off.",
         "When antiques dealer Jesús finds the legendary Cronos device within a statue he accidentally uses it. It feeds on his life force in exchange for eternal life. However wealthy Dieter and his nephew Angel also want the device and are willing to do anything to get it. This is certainly a different vision of the vampire story, it dispels with a lot of the gore, the castles, Igor etc, but keeps the sunlight, the through the heart death etc. The story moves very slowly and is focused on Jesús and the devices' effect on him. His accidental transformation causes concern within his granddaughter and he finds that eternity has a price. The scenes between Jesús and Aurora are touching and make a nice change from the blood letting scenes. The action is never really forthcoming and it is a little stilted in a way. Pearlman's character is a good addition to the story, but it does move so slowly that it may be a disappointment to those expecting a horror film. Luppi is good as Jesús, haunted by a gift he never wanted, Tamara is also strong as his granddaughter. Overall it's an interesting retelling of a famous story. The direction is faultless although the story occasionally feels aimless and drifting.",
         "This is one of the best horror films of the 90's. It has an excellent plot, a great script, good acting, and masterful direction. The horror scenes were brilliantly executed, the humor well-balanced, the cinematography effective, and the make-up effects were stunning. Don't worry if you hate subtitles, this one will have you gripped until the last frame. 8.5/10.",
         "'Cronos' is a rarity: an original, intelligent, suprising, and genuinely creepy horror movie! A wonderful unpredictable script, inventive direction from Guillermo del Toro (an impressive debut!) and uniformly strong acting from all concerned, make this essential viewing for not only horror buffs, but lovers of fantastic cinema of all types. 'Cronos' is a treasure! I cannot recommend this movie highly enough!",
         "Cronos During Bravo's \"Top 100 Scariest Moments\" (should've been \"Movies\" instead) countdown, I happened to catch the sequence about this particular film. It looked pretty damn good, so I set myself out to see it. It's directed by the man best known now for \"Hellboy\" and \"Blade.\" Rather than being action-packed, violent, and bloody, it's actually simply a dark and unusual horror film. And, one of the more refreshingly original plots I've seen in some time. The film centers around an old man who owns an antique shop in Mexico who stumbles upon a small, gold, mechanical object. The object was created 400 years prior by an alchemist seeking immortality--and as such, the device grants that most sought-after of gifts. By violently piercing the flesh of whoever activates it and delivering immense pain. Well, there is someone else--a very rich and very dying man who has sought the device for a large portion of his life. His nephew is played by human gorilla, Ron \"Hellboy\" Perlman--and he is simply the old man's caretaker and go-to guy. Well, as it turns out, the antique store owner, named Jesus, finds out in the most unpleasant of ways that the Cronos device has a set of rules meant for its use--and only the rich old dying bastard knows them--and he will only trade the rules for the device. Here's the breakdown: The Good: --The more I see Ron Perlman in movies, the more I like him--he's a very versatile actor. Especially if you take into account that he's made films in France, Mexico, and America, has spoken French, English, and some Spanish; and went from this to \"City of Lost Children\" to \"Enemy At the Gates\" (as a Russian soldier) to \"Hellboy.\" His role is plenty entertaining here. --The acting is quite good. --The story is really unique, fresh, and original. --The special effects are very nice--not a drop of CG anywhere in the film. The mechanical workings of the Cronos device and the insect inside are really cool. --Good music. --Good atmosphere and some excellent bizarre and creepy scenes that really hold attention. Didn't Hurt It, Didn't Help: --Unfortunately, the film never states what those rules are for successful use of the Cronos device--only a little bit is hinted at or discovered and it felt like there were actually a lot of guidelines to the device. --Somewhat slower pace--but it's used as a tension builder. --Pretty good sets. The Bad: --Not enough scares--but then, this is a slower movie made to build up a creepy story. Not a scare-a-minute-shocker. The Ugly: --Somewhat clumsy opening scene that has some unanswered questions about it. I was a little confused about exactly how the old man came to know or believe that Jesus had the device. --It also would've been nice to have a little more background story on the Cronos gadget, it's maker, and exactly how the sickly old man that Perlman watches over came to know about it as well as what started his search for it. Memorable Scene: --Jesus (the character, not the Bible-guy) licking blood off the floor of a men's room. --Also, Ron Perlman's character obsessing about getting a nose job--and he gets punched in the nose twice. A Note About The DVD: --For some reason, getting the proper sound/subtitles mix was a real hassle--it didn't like to be set up ahead of time for some reason. Maybe I just had a DVD with some errors or something, but I selected Spanish with English Subtitles and ended up with an Audio Commentary--in Spanish! I eventually had to restart the film and just change everything as it played. I went through the opening sequence about five times and I think I still ended up with subtitles for the deaf or hard-of-hearing--because even Ron Perlman was subtitled and he spoke English through most of the film! Acting: 8/10 Story: 10/10 Atmosphere: 8/10 Cinematography: 8/10 Character Development: 7/10 Special Effects/Make-up: 9/10 Nudity/Sexuality: 0/10 Violence/Gore: 6/10 (Very little gore, and only mild violence--all decent quality) Sets/Backgrounds: 7/10 Dialogue: 9/10 Music: 8/10 Writing: 8/10 Direction: 9/10 Cheesiness: 1/10 Crappiness: 0/10 Overall: 8/10 Overall, I think this deserves an 8, maybe a 7, but I settled with what I thought it deserved. It's not the best horror film out there, but it's quite good and very original. Recommended to all Horror fans. People with a passing interest in horror should check it out, too. Not too dark, violent, or gory for the squeamish. A Mexican gem. www.ResidentHazard.com"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "CNCAIMC",
         "Fondo de Fomento a la Calidad Cinematográfica",
         "Grupo Del Toro"
      ],
      "summaries": [
         "In 1535, an alchemist builds an extraordinary mechanism encapsulated into a small golden device. The invention, designed to convey eternal life to its owner, survives its maker until 1997, when it shows up with an antiques dealer. Fascinated with the strange device, Gris (Luppi) doesn't note that there's more than one person looking for it. The promise of eternal life has become an obsession for old and sick Mr. De la Guardia (Brook). He and his nephew (Perlman) will do anything to get the Chronos Invention.",
         "An aging antique dealer named Jesus Gris happens upon an elegant mechanized scarab. When opened, it painfully stabs whomever is holding it, but the wound brings youthful vigor and a vampire's need for blood. The device is relentlessly pursued by a dying tycoon named Dieter de la Guardia, whose nephew Angel, reluctant to see his uncle live a moment longer, must still do the old man's bidding. Meanwhile, Gris's desires endanger his own granddaughter, Aurora.",
         "A mysterious device designed to provide its owner with eternal life resurfaces after four hundred years, leaving a trail of destruction in its path."
      ],
      "budget": 2000000
   },
   "movielensId": 565,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1993-09-12",
      "dvdReleaseDate": "2003-10-14",
      "directors": ["Guillermo del Toro"],
      "runtime": 94,
      "movieId": 565,
      "title": "Cronos",
      "mpaa": "R",
      "actors": [
         "Federico Luppi",
         "Ron Perlman",
         "Claudio Brook",
         "Margarita Isabel",
         "Tamara Shanath",
         "Mario Iván Martínez"
      ],
      "imdbMovieId": "0104029",
      "originalTitle": "Cronos",
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["xFTJ2FqLmH8"],
      "plotSummary": "Faced with his own mortality, an ingenious alchemist tried to perfect an invention that would provide him with the key to eternal life. It was called the Cronos device. When he died more than 400 years later, he took the secrets of this remarkable device to the grave with him. Now, an elderly antiques dealer has found the hellish machine hidden in a statue and learns about its incredible powers. The more he uses the device, the younger he becomes...but nothing comes without a price. Life after death is just the beginning as this nerve-shattering thriller unfolds and the fountain of youth turns bloody.",
      "tmdbMovieId": 11655,
      "avgRating": 3.21871,
      "releaseYear": "1993",
      "numRatings": 871,
      "posterPath": "/6ZgqGgguuKU0Ba2aQOjzikbwnNQ.jpg"
   }
}