{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "photographer",
            "id": 1003
         },
         {
            "name": "marriage proposal",
            "id": 1459
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "cosmetologist",
            "id": 170125
         }
      ],
      "imdb_id": "tt0107315",
      "video": false,
      "title": "Kika",
      "recommendations": [
         4307,
         8222,
         8219,
         4203,
         2469,
         102492,
         8220,
         267,
         163910,
         158112,
         107673,
         103130,
         79359,
         116696,
         143529,
         132994,
         115360,
         8047,
         8088,
         216971
      ],
      "backdrop_path": "/hB81eWanubh9BYS1p353COyK0Cc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Kika",
               "gender": 1,
               "credit_id": "52fe4498c3a36847f809f10d",
               "name": "Verónica Forqué",
               "profile_path": "/rki2ZGDMQOMqrWS7BN2gNr27gSY.jpg",
               "id": 54146,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Andrea Caracortada",
               "gender": 1,
               "credit_id": "52fe4498c3a36847f809f111",
               "name": "Victoria Abril",
               "profile_path": "/qVszystVNlXomQQrhM9u3joaw9P.jpg",
               "id": 25256,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Nicholas",
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f115",
               "name": "Peter Coyote",
               "profile_path": "/5zVvYZxE6T0OeL1iaFBBCzY3QOi.jpg",
               "id": 9979,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Juana",
               "gender": 1,
               "credit_id": "52fe4498c3a36847f809f119",
               "name": "Rossy de Palma",
               "profile_path": "/3IH9ZBUcFNwBr8IcS1RZhMKTpeg.jpg",
               "id": 25258,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Ramon",
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f11d",
               "name": "Àlex Casanovas",
               "profile_path": "/baxjkmFM8B5vLdmvc6nVsYa6JRz.jpg",
               "id": 26661,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Pablo",
               "gender": 0,
               "credit_id": "52fe4498c3a36847f809f121",
               "name": "Santiago Lajusticia",
               "profile_path": null,
               "id": 26928,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Susana",
               "gender": 0,
               "credit_id": "52fe4498c3a36847f809f125",
               "name": "Bibiana Fernández",
               "profile_path": "/r2HB3GSSzdknWv6U6X5U5yMIpxa.jpg",
               "id": 34794,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Amparo",
               "gender": 1,
               "credit_id": "52fe4498c3a36847f809f129",
               "name": "Anabel Alonso",
               "profile_path": "/uQ1knhXYGBYMpKsnJUxCVXoTwYV.jpg",
               "id": 24894,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Policía",
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f12d",
               "name": "Jesús Bonilla",
               "profile_path": "/4sESForON08GdTsK4PsA7EiK3u8.jpg",
               "id": 24900,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Policía",
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f131",
               "name": "Karra Elejalde",
               "profile_path": "/kHODqgc2c7RaZz9Sp7cedgadvzG.jpg",
               "id": 24977,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Doña Paquita",
               "gender": 0,
               "credit_id": "52fe4498c3a36847f809f135",
               "name": "Francisca Caballero",
               "profile_path": null,
               "id": 25269,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Paca",
               "gender": 0,
               "credit_id": "52fe4498c3a36847f809f139",
               "name": "Mónica Bardem",
               "profile_path": null,
               "id": 22372,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Víctima del asesino",
               "gender": 0,
               "credit_id": "59b53caf92514123b30004e1",
               "name": "Blanca Li",
               "profile_path": "/ukXvQPB2UvCbe4Ixw4vyvfo1QDn.jpg",
               "id": 222221,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Modelo",
               "gender": 0,
               "credit_id": "52fe4498c3a36847f809f145",
               "name": "Claudia Aros",
               "profile_path": null,
               "id": 27003,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Asesino",
               "gender": 2,
               "credit_id": "5495a9c492514132ed002b3b",
               "name": "Joaquín Climent",
               "profile_path": "/5TReMP6aSaTW5e18g3uS3HocfpY.jpg",
               "id": 272018,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f0f7",
               "name": "Pedro Almodóvar",
               "profile_path": "/9dc8NqjMnOcZ8EiUvaAQiMiT4Tz.jpg",
               "id": 309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f0fd",
               "name": "Pedro Almodóvar",
               "profile_path": "/9dc8NqjMnOcZ8EiUvaAQiMiT4Tz.jpg",
               "id": 309,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f103",
               "name": "Agustín Almodóvar",
               "profile_path": "/4IaZOzYR2gVFpYdmV8rRrNGLT5J.jpg",
               "id": 952,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a36847f809f109",
               "name": "José Salcedo",
               "profile_path": null,
               "id": 413,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4498c3a36847f809f14b",
               "name": "Alfredo Mayo",
               "profile_path": null,
               "id": 1143456,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.315564,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 8223,
      "vote_count": 73,
      "budget": 0,
      "overview": "Kika, a young cosmetologist, is called to the mansion of Nicolas, an American writer to make-up the corpse of his stepson, Ramon. Ramon, who is not dead, is revived by Kika's attentions and she then moves in with him. They might live happily ever after but first they have to cope with Kika's affair with Nicolas, the suspicious death of Ramon's mother and the intrusive gaze of tabloid-TV star and Ramon's ex-psychologist Andrea Scarface.",
      "similar": [
         806,
         1427,
         2288,
         205,
         881,
         2652,
         334541,
         205775,
         284276,
         996,
         343,
         43923,
         2048,
         77949,
         956,
         59967,
         238636,
         712,
         26973,
         527
      ],
      "original_title": "Kika",
      "runtime": 117,
      "poster_path": "/jUEBKaMqcvrz0HHF8Cei8asjRWr.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CiBy 2000",
            "id": 7832,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "El Deseo S.A.",
            "id": 11736,
            "origin_country": ""
         }
      ],
      "release_date": "1993-10-28",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pedro Almodóvar"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Pedro Almodóvar",
         "Pedro Almodóvar"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0107315/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5MTU3NzQ3MF5BMl5BanBnXkFtZTYwOTU1NzU5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Coyote, Verónica Forqué, Victoria Abril | See full cast and crew »"],
      "reviews": [
         "Maybe this isn't as good as the bulk of Almodóvar's output: not having seen the bulk of his output, I'm in no position to tell. I do remember that there was general disappointment in 1993. As I recall - obviously, one could find out by checking primary documents whether or not my recollection is correct - every critic and his dog took the opportunity to say \"This time Almodóvar has gone too far\", which meant, depending on the critic, either \"Almodóvar is being too silly\", \"Almodóvar is trying too hard to get our attention\", or \"Almodóvar has finally lapsed into morally reprehensible sexism\". I find all of these reactions hard to understand. \"Kika\" is such a sweet, such an INNOCENT film! Maybe you didn't have fun, as I did; but how could anyone OBJECT to it? Far from being hard to like, the characters were such that I found myself warming to the worst of them: Kika herself is completely adorable, the outrageous Andrea turned out to have a heart, of sorts - certainly she had an ethos -, and even Nicholas and Ramón revealed some human traits. If I have a complaint about anyone's characterisation it would be Ramón's. When we first meet him he's just a cold fish; not a bad man, but we can't like him. By the end of the film I found myself wondering if the mild warmth Almodóvar discovered had really been there all along, or if he it had been smuggled in when we weren't looking. No matter: the film isn't about him, anyway. There's nothing gruesome about \"Kika\", nothing cruel, nothing hard to watch. (Well, maybe a touch of blood in one final scene, but I can forgive that.) There's a lot of sex, no doubt, but none of that terribly EARNEST stuff one finds in American movies... [I'm about to reveal something. Stop reading now if you haven't seen the film.] ...One of the things I'm sure many critics objected to was the rape scene. Almodóvar played it as a comedy, in the way that so many directors will play an armed robbery - and it was a kind of armed robbery - as comedy. At first we wonder if Kika is so clueless that she doesn't realise she's being raped. But in fact she's just postponing her shock, in a way that is - well, ludicrous, but also commonplace. The entire extended sequence of which the rape is part is so delightfully ridiculous BECAUSE, not in spite of, all the characters' perfect clarity of purpose. If this IS one of Almodóvar's lesser works I shouldn't hesitate to see the rest.",
         "This was one of the funniest comedies I have ever seen. Almodóvar is in a hilarious, flimsy mood. The convoluted story feels somewhat as if Dario Argento, master of italian giallo, had cooperated with Edika, the not so inhibited french comics maker. Most humour come from the direct, practical and naive manner in which Kika, cosmetologist, handles the most tragic and disturbing situations. Forget about drama - this is a farce, and in the humour lies the usual Almodóvar admiration and wonder over females.",
         "***SLIGHT SPOILERS*** In my opinion, the second best (after the magnificent \"Todo sobre mi madre\") film the Spanish \"enfant terrible\" ever created. Kika is a funny movie-but it's also dramatic. It has to do with showbusiness and its servants, those unscrupulous people that don't stop anywhere in order to force viewers to watch their garbage. Andrea Caracortada (A superb Victoria Abril)is a symbol of those people.Her performance is just one good reason to see this movie. It's also reccomended because of its infamous rape scene (SPOILER):It's hilarious and heartbreaking at the time A masterpiece",
         "What everyone in the press seemed to miss about this film was that it was a spoof on the media and especially the talk show mentality which has come to dominate our lives. The central figure of the film is not so much Kika as it is Caracortada (scarface) who runs a real life television program featuring live footage from video cameras. She chases down much of this footage herself, having a camera inserted into a helmet and flying around town on a motor scooter. We are drawn into this web -- during the middle of a rape sequence, the rapist actually says something funny -- and in the audience with whom I saw the film when it premiered, many laughed (and then somehow gasped that they were laughing in the middle of a rape scene). That is as nearly perfect as black comedy gets. Following the rape, Caracortada interviews the victim and asks \"How big was he?\" Isn't this indicative of the intrusiveness of media in our lives? How did the press and so many commentators miss it?",
         "Almodóvar does Fellini? Well, that seems to be the general tone of the film here, as the director takes a central caricature and drops them into a mocking satire of grotesque farce, frightening colours and the continual abstractions of 1950's melodrama, all the while revelling in the juxtaposition of highbrow movie references and lowbrow humour. Understandably, with such a giddy concoction of ideas, the film is something of a mess; with the collage of styles and somewhat awkward combination of film references combined with the over-the-top production design and characterisations of the director bombarding us from the first scene to the last, while some of the more outré moments of satire, including the (intentionally) morally bankrupt nature of the character \"Scarface\" and the near-infamous rape sequence that plays out in the same frivolous, high-camp approach as the rest of the film are sure to raise a few groans of disagreement from many of the less liberal of reviewers amongst us. Having said that, I personally feel that despite its position in Almodóvar's career as something of a creative misstep, there are still some incredibly intelligent and highly interesting ideas at work behind the film, some of which we have to really search for amidst the camp theatricality of the characters and the screaming kitsch of the narrative and its overall design. It has certain similarities to Fellini's La Dolce Vita (1960), with the comment on journalism and the depiction of the media against an episodic background that seems to go nowhere until the last twenty minutes of the film, at which point Almodóvar introduces a new strand to the drama that will probably make it necessary for a second or perhaps even third viewing to fully comprehend. It also has the same interesting concept of the writer creating the story as it unfolds that we previously saw in the excellent Law of Desire (1987), with the character played by Peter Coyote writing a crime book that might be a veiled comment on his own character and role within the film, or might be the plot of the film itself. However, unlike Law of Desire, the idea isn't carried off quite so well, with the notion eventually being pushed into the background as we focus more on \"Scarface\" and her trash TV empire that forces itself into the lives of the characters, creating an interesting comment on the idea of cinema as voyeurism previously foreshadowed in the \"keyhole\" iconography of the opening sequences, and the thread of exhibitionism that is cemented by the film's male lead, the photographer Rámon. Throughout the film these themes jostle for our attention as we watch the drama unfold from an affluent apartment building overlooking an obviously artificial recreation of night-time Madrid, as the characters seem to just drift from one scenario to the next in a way that doesn't always make sense until pondered over in light of the film's somewhat enticing \"twist\" ending. Ultimately, you could argue that with Kika (1993), Almodóvar really bit off more than he could chew, as he takes full advantage of the larger dramatic canvas offered to him by the international success of Law of Desire, Women on the Verge of a Nervous Breakdown (1988) and Tie Me Up! Tie Me Down! (1990) to truly indulge his interests in farce, design, fashion and theatrics. It's a self-indulgent work, without question, but I feel for an artist of Almodóvar's calibre, such indulgences are excusable; especially when the purging of such indulgences eventually leads to work of the impeccably high-standard of Live Flesh (1997) and All About My Mother (1999). The film is also a triumph of perfect casting, though one does wonder why Coyote - with his voiced awkwardly dubbed into Spanish - is present over a greater actor like Eusebio Poncela, who in my mind would have been perfect for the part? Other than that rather odd choice, we have the film tied rigidly to the underrated performance of Veronica Forqué, who manages to convey the moves from comedy to tragedy without compromising the colourful tone or her somewhat ditzy characterisation. Her performance is really a marvel in my opinion and definitely makes Kika worth experiencing, even in spite of its various limitations. There's also fine support from Victoria Abril, Alex Casanovas and the truly iconic Rossy de Palma (once seen, never forgotten). Certainly, I can understand why many wouldn't like this film, what with the provocative nature of the tone, the lapses in character and the occasional slow pace, but there are still some interesting touches that should make this required viewing for anyone already familiar with the director and his work. As with the other Almodóvar films that I've seen from this era, Kika is bright and vibrant and filled with moments of keenly observed character-play and fanciful farce against an approach to film-making that rivals the very best of contemporary European cinema.",
         "Although the film is ostensibly about \"Kika,\" she is actually only one character featured in this raunchy, ensemble comedy. The plot here is all over the place! This is not necessarily bad--one character ties into another character's life and the focus of the movie moves in a circular manner which eventually returns to our heroine, the naive but lovable Kika (well-portrayed by Verónica Forqué). This film is funny! It's a combination of \"There's Something About Mary,\" Woody Allen at his zaniest, and \"Sex and the City.\" Good for a laugh, especially for the poor dubbing of Peter Coyote's Spanish.",
         "Kika is a movie whose plot sounds tasteless beyond belief if merely read aloud. After all it features an extended rape scene played for laughs; the rapist himself is a porn star who has sexually assaulted so many girls that his sister forms an incestuous relationship with him to take his mind off raping even more women. This is hardly typical comic fare it has to be said. Imagine if in 1979 Mel Brooks had decided to make a spoof of I Spit on Your Grave, the results would have been an absolute travesty. That's what the synopsis of Kika makes you think of. However, Kika was made by Pedro Almodóvar and for some reason he seems to be capable of making even the most grossly offensive material so completely ridiculous it comes at you in reverse and can be alarmingly funny. The rape scene in Kika is comedic and before watching the movie I simply could not understand how such a thing could ever be. The film is named after the cosmetologist played by Veronica Forqué. But the movie is not really her story, it has several memorable characters. Ramón is a young photographer whose mother commits suicide. Nicholas is his womanising step-father. The latter hires Kika to work on the corpse of Ramón, who comes back to life unexpectedly and embarks on a relationship with Kika. Kika's maid Juana is a lesbian who is in love with Kika, her brother Pablo is the porn star rapist. All the time in the background on the television is Andrea (a.k.a. Scarface) the host of a reality TV show that celebrates real life tragedy, death and destruction. The movie concludes with an unexpected serial killer plot strand. It's true that the story is somewhat chaotic. There are so many separate ideas in here that the film seems a bit unfocused. But because it is essentially a comedy this isn't really so much of a problem. While there is a lot of silly humour, the film is mainly a media satire. With this in mind the most important and memorable character is Andrea who is kitted out in some fantastically over-the-top Jean-Paul Gaultier outfits, including her street gear which includes a helmet with attached movie camera. Victoria Abril is really excellent in this role. She is simultaneously wicked and sexy at all times. The scenes of her broadcasting her show from a stage are the most visually iconic in the movie. She roams the streets of Madrid intrusively filming scenes of grieving people and aftermaths of violent encounters. She is the black heart of Kika. Despite the controversial moments it's simply impossible to take the events depicted at all seriously. Almodóvar's typical colourful aesthetic is present throughout and the tone is consistently absurd. This means that he gets away with material that would have been contentious otherwise. As it is, Kika is very entertaining.",
         "This movie is called \"Kika\" yet does not tell the story of the cosmetologist, just smalls bits of it. It should be called \"Nicolas meets Kika\" or \"Ramon meets Kika\", which are the ones this movie is about. Nevertheless, Kika's appearance doesn't affect the plot line. Nick's crazy killing spree would've been far more interesting if there was any background at all, and at the beginning when Ramon's mother commits \"suicide\" it is very plain to see that someone else shot her in the chest, leaving the rest of the movie pretty predictable. I know this is supposedly a comedy, but the raping scene it's just awful and Kika's reaction afterward even more unrealistic. I wanted to see how Pablo was caught and Kika turned into lesbian, and formed a couple with Juana. Also I wanted to see more about Andrea Scarface's show and Juana's obvious lesbianism. I completely disliked this film, it didn't made me laugh even once and the only thing I can say I agree about, is Juana's lines about not wanting to shave because mustaches are not men's heritage only.",
         "There is no director whose films embody the strange spirit of the new wave movement of the 60s like Pedro Almadovar. His weird, disjointed and patently bizarre works are a breath of fresh air given that we live with movies that come out of a Hollywood that prefers that directors just bow their heads and do as they are told. His most striking works came before his notoriety with the overrated 'Women on the Verge of a Nervous Breakdown'. Before that he fleshed out such singular masterpieces as 'Law of Desire' and 'What Have I Done to Deserve This?'. No film since 'Women' (until the recent 'All About My Mother') has captured his pre-fame brilliance and during that dry spell came one of the worst, a little disappointment named 'Kika'. The main topic of discussion given to 'Kika' has been it's politically incorrect rape scene played here for laughs but comes off as ridiculous and uncomfortable. But seething around that scene is Almadovar's target - the rape given by the media into the private lives of anyone who ever takes their clothes off. The villain of the piece is a tabloid journalist named Andrea Scarface who runs a hot TV show called 'Today's Worst' and buzzes around on a motorcycle with a camera mounted on her helmet hoping to catch crimes as they happen. Andrea's former lover is now seeing the title character, a shapely cosmetologist with a big mouth named Kika whose personality is infectious but (I believe) would have been better served in a different movie. Kika is currently being lusted after by her lesbian maid (Almadovar regular Rossy de Palma) and the maid has a chauvinistic brother who is not only an ex-porn star but who's first day out of jail leads to aforementioned rape scene. Also attached to the story is an expatriate writer (Peter Coyote) whose wife's murder remains a mystery and has driven him nearly comatose. 'Kika' feels like a first draft, there is little interest in the underwritten characters and most of the outrageous scenes exist, not for laughs but just for the sake of being outrageous. It lays a lot of characters on the canvas but can't find a use for them outside of their introductory status. This is a minor effort in which the biggest joke is really on the viewer.",
         "I am not sure what Pedro was thinking when he wrote this film, considering he made the Oscar-nominated 'Women On The Verge of a Nervous Breakdown' five years earlier. The film tries too hard to be a comedy. Veronika Forque is over-the-top in her performance, which is the point in most of Pedro's films, but this is exaggerated. There is nothing comedic about the infamous rape scene, nor should rape be classified as comedy ever. I do appreciate the character Andrea, because she represents the media in how she considers every horrific event as news entertainment. Perhaps that is the point Pedro Almodovar wanted to make. Otherwise the rest of the film falls flat. Do not make this film have you turn away from such a wonderful director. His later works are masterpieces, and he only improves through age. I recommend any of his other films, especially 'Broken Embraces' or 'Volver'."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "El Deseo",
         "CiBy 2000"
      ],
      "summaries": ["Kika, a young cosmetologist, is called to the mansion of Nicolas, an American writer to make-up the corpse of his stepson, Ramon. Ramon, who is not dead, is revived by Kika's attentions and she then moves in with him. They might live happily ever after but first they have to cope with Kika's affair with Nicolas, the suspicious death of Ramon's mother and the intrusive gaze of tabloid-TV star and Ramon's ex-psychologist Andrea Scarface."],
      "budget": 0
   },
   "movielensId": 567,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1993-10-28",
      "dvdReleaseDate": null,
      "directors": ["Pedro Almodóvar"],
      "runtime": 117,
      "movieId": 567,
      "title": "Kika",
      "mpaa": "",
      "actors": [
         "Verónica Forqué",
         "Victoria Abril",
         "Peter Coyote",
         "Rossy de Palma",
         "Àlex Casanovas",
         "Santiago Lajusticia",
         "Bibiana Fernández",
         "Anabel Alonso",
         "Jesús Bonilla",
         "Karra Elejalde",
         "Francisca Caballero",
         "Mónica Bardem",
         "Blanca Li",
         "Claudia Aros",
         "Joaquín Climent"
      ],
      "imdbMovieId": "0107315",
      "originalTitle": "Kika",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["dK9qQ9w_Gww"],
      "plotSummary": "Kika, a young cosmetologist, is called to the mansion of Nicolas, an American writer to make-up the corpse of his stepson, Ramon. Ramon, who is not dead, is revived by Kika's attentions and she then moves in with him. They might live happily ever after but first they have to cope with Kika's affair with Nicolas, the suspicious death of Ramon's mother and the intrusive gaze of tabloid-TV star and Ramon's ex-psychologist Andrea Scarface.",
      "tmdbMovieId": 8223,
      "avgRating": 3.36098,
      "releaseYear": "1993",
      "numRatings": 428,
      "posterPath": "/jUEBKaMqcvrz0HHF8Cei8asjRWr.jpg"
   }
}