{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "sport",
            "id": 6075
         }
      ],
      "imdb_id": "tt0110363",
      "video": false,
      "title": "Little Big League",
      "recommendations": [
         34600,
         265330,
         375428,
         42580,
         40562,
         41313,
         22588,
         63622,
         214671,
         11107,
         289401,
         26441,
         30765,
         15902,
         39128,
         21845,
         23449,
         73257,
         14868,
         45664
      ],
      "backdrop_path": "/ktRAfthRu7ePZ864PWRZyOujGJE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Billy Heywood",
               "gender": 2,
               "credit_id": "52fe44819251416c91013245",
               "name": "Luke Edwards",
               "profile_path": "/fAutv48tad09s8DHgUzrYuAZ33m.jpg",
               "id": 33052,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lou Collins",
               "gender": 2,
               "credit_id": "52fe44819251416c91013249",
               "name": "Timothy Busfield",
               "profile_path": "/8sQr5B1h0wJ4kOcTgwWyCDfzzYq.jpg",
               "id": 23881,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mac MacNally",
               "gender": 2,
               "credit_id": "52fe44819251416c9101324d",
               "name": "John Ashton",
               "profile_path": "/omfIdOt1F8LDkb7AMZTtLDiyJ3O.jpg",
               "id": 778,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "George O'Farrell",
               "gender": 2,
               "credit_id": "52fe44819251416c91013251",
               "name": "Dennis Farina",
               "profile_path": "/o649nAtUimSZxEV6xa5JbMSgsED.jpg",
               "id": 1117,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jim Bowers",
               "gender": 2,
               "credit_id": "52fe44819251416c91013255",
               "name": "Jonathan Silverman",
               "profile_path": "/khx8B9Ln5isYyag7gG48DogOHHx.jpg",
               "id": 55265,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Thomas Heywood",
               "gender": 2,
               "credit_id": "56ef20a39251415d06002142",
               "name": "Jason Robards",
               "profile_path": "/d5t554TsCjMvI9zwe7M5gNLvZeX.jpg",
               "id": 4765,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Arthur Goslin",
               "gender": 0,
               "credit_id": "56ef20dcc3a368225300c8a0",
               "name": "Kevin Dunn",
               "profile_path": "/85thH2pUn2tPP97QhnYQI7MBiCW.jpg",
               "id": 14721,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44819251416c9101325b",
               "name": "Andrew Scheinman",
               "profile_path": null,
               "id": 3030,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44819251416c91013261",
               "name": "Gregory K. Pincus ",
               "profile_path": null,
               "id": 139756,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44819251416c91013267",
               "name": "Gregory K. Pincus",
               "profile_path": null,
               "id": 139757,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44819251416c9101326d",
               "name": "Andrew Scheinman",
               "profile_path": null,
               "id": 3030,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.651932,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31504,
      "vote_count": 26,
      "budget": 0,
      "overview": "When the owner of the Minnesota Twins passes away, he bequeaths the team to his preteen grandson. The newly minted head honcho quickly appoints himself manager, causing unrest in an organisation that struggles to take orders from a 12-year-old.",
      "similar": [
         10393,
         2300,
         9655,
         9291,
         86130,
         4942,
         11287,
         10637,
         8923,
         22881,
         13416,
         323677,
         9614,
         42888,
         9472,
         11770,
         37136,
         9390,
         920,
         17108
      ],
      "original_title": "Little Big League",
      "runtime": 119,
      "poster_path": "/bch2eAwnwcs8k7ClaOg7uNoowqZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-06-29",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The Minnesota Twins Have A New Owner",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Scheinman"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Gregory K. Pincus",
         "Gregory K. Pincus"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110363/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMDE3MzU0OF5BMl5BanBnXkFtZTcwNDM0NTIyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Luke Edwards, Timothy Busfield, John Ashton | See full cast and crew »"],
      "reviews": [
         "I thought this was a perfectly nice family film and almost canned it after the first 15 minutes, but I was glad I didn't because it turned to be a good movie. The first 15 minutes including two GDs by Dennis Farina and some uncalled-for vulgarity by Jason Robards, but everything settled down after those two exited the film soon after and it wound up being a \"cute\" baseball movie and very impressive in its realism. The last comment about \"realism\" was the most impressive aspect of the film to me. I had grown up seeing every baseball movie and never seeing any actors who knew what they were doing until Kevin Costner came along with his \"Field Of Dreams\" (and later with \"For Love Of The Game\"). So I appreciate the more modern-era of movie-making where at least we see actors who can throw and hit. This movie is about as close to seeing real baseball as you're going to get: very realistic diamond action. The story was outlandish - an 11-year-old managing a Major League baseball team, but the baseball was so good and a good mix of comedy and drama made it turn out to be a satisfying film to watch. There are some nice shots of Fenway Park and Yankee Stadium in here, too. Luke Edwards, as the kid, was just fine and a kid you could root for, not a wise- guy. He was aided by adults John Ashton and Timothy Busfeld. This is a nicer role for Ashton (\"Midnight Run\") and Busfeld, couldn't have played a more likable ballplayer. He was great to watch. This a good film for adults, not just kids, and especially if you enjoy baseball.",
         "I saw this movie lots of times and one of things that made me really like it was how well baseball was accurately portrayed in this movie. I think alot of movies try to make sports seem as real and accurate as they can but it's a pretty tough job because they're making a hollywood movie with actors. And you can tell that it's acting because the pitches or plays can all look fake and the overall play can look pretty weak. But this movie did a really good job of making the game look realistic. Obviously, the appearances of guys like Mickey Tettleton, Rafael Palmeiro, Griffey, Johnson, O'Niell, Alex Fernandez and others really helped. But the stadiums all looked great and accurate and how they would look in real life. Mainly, the game just looked real in the film, which is something that I havent seen in a lot of baseball movies. I think it's definitely one of the best baseball films out there in terms of accuracy and appearance and the story line really did of a good job of how major league life can go. Things can be going your way at minute, but a few months or weeks later, things can all change and your team can go downhill. I think the movie did a good job of showing a major league baseball team, the Twins, and the ups and downs of a season. Good job",
         "Between 1993-1995, many baseball movies such as Little Big League, The Sandlot, and Rookie of the Year came out, but I think that Little Big League was the most clever of them all. There were plenty of funny scenes that adults, rather than children, could relate to. It was well done and well acted. I enjoyed this movie and I have owned it since it came out.",
         "I really think this movie was done exceptionally well. The humor wasn't just the standard nose-picking, mud-throwing, loud-farting jokes that are so standard in kids movies. This movie was actually well written! I laughed the whole way through it, it's really too bad it gets put in the same class with movies like Rookie of the Year and The Big Green. It's so much more sophisticated (strange word to use to describe a kids movie...I know) as far as the writing style and humor goes than any of those other movies were. I really think that adults may enjoy this movie more than kids, because kids may not get all the jokes. It's disappointing that it will never be seen by so many because of the type of movie that it is and the way it was marketed.",
         "I remember that I didn't want to see this movie at the theater (or as a rental for that matter) because of the marketing of the movie and what I thought would be a dumb story. However, I was pleasantly surprised. For what it was worth, it was a pretty good movie. Yeah, the story-line was not believable and it was cheesy at times, but the basis behind the story was pretty solid, it had some pretty good lines, and it was pretty entertaining the whole way through. Word of warning, though - Don't let Randy Johnson scare you. That guy had to have fallen out of the ugly tree and hit every single branch on the way down, THEN bounced and hit every single branch on the way up. Plus he's called the 'Big Unit'; scary! 6.5 out of 10.",
         "Little Big League is a great film. I enjoy most baseball films because I am a big baseball fan, not necessarily the Minnesota Twins. I only saw this movie just to get entertained. After the movie started, the owner of the Twins passes away from natural causes. He gives his team to his grandson, Billy. After Billy fired the manager, he becomes the manager of the team on their quest to win the pennant. As a baseball fan, I do find it pretty hard to see a kid managing the team, but this is purely entertainment. I was happy to see major league stars such as Randy Johnson, Ivan Rodriguez, Paul O'Neill(especially), and Rafael Palmeiro. As a die-hard Yankees fan, I am glad to see great views of Yankee Stadium. At least I will see this film when I want to see the old Yankee Stadium because they are tearing it down soon. In entertainment areas such as acting, everything is simple and smooth. A good baseball film! I rate this movie 8/10.",
         "A great baseball movie. Maybe the best baseball movie of the 1990's. Though more for children, I thought it was good for any true fan of the game. The film was well done all-around. It was funny how the players look so big compared to 12-year-old Billy Heywood, who is to be the leader. Actual major league players are in this movie, too.",
         "We got this movie on videotape for the kids, but it just blew me away. Here we are in 2009, and Lou Pinella, Randy Johnson and Ken Griffey Jr. -- all of whom are in this movie -- are still part of the game. That's just luck, but the dialog in this film is outstanding. It is far more than a kids' movie. Sure, there are scenes where a so-called ''adult'' film would have relied on profanity (Jerry Johnson letting his 12-year-old manager know that he didn't like being cut, no matter how much the kid liked his baseball card) but the message is clear. When the kid asks pitcher Mike McGreevy how much a free agent who can't throw strikes is worth, or when he puts down his hot-headed reliever by asking if he thinks the team doesn't have anybody else who can get people out, it's priceless. Or how's this from his bench coach, about Johnson's slump: \"Kid, don't you think there's a problem when you get that excited over a seeing-eye single?\" or (from the angry reliever): \"I've been looking over some film, and you were right about my mechanics, so I ... guess you're not a rat boy.'' Despite what might seem like an absurd premise, I have never seen a more realistic baseball movie, and I am a member of SABR and a baseball fan of more than 50 years. The Twins are still wearing the uniforms in this film, and until today (10/11/09) were still playing in the same stadium. It pays homage to the franchise's history by calling the team's GM \"Goslin'' -- a Hall of Famer from the Twins' days as the Senators. Get this movie. Even the music is good. You will not regret it.",
         "Little Big League was one of my favorite movies as a kid. Growing up in Minnesota I thought it was the coolest thing that there was a movie about our Twins, and a good movie at that. Being a baseball player is every kids' dream, and owning one would be the next best thing. This movie, unlike some sports films, accurately shows the game of baseball and what it is like on and off the field. The acting is fairly good and the characters and story line are not one dimensional and boring like some kid's movies. It is humorous but can be very serious at times. Watching it makes me feel young again and reminds me of my love for baseball. Little Big League is a movie that both kids and adults can enjoy.",
         "I have probably seen this movie 10 times and I still enjoy it as much as the first time.I laughed and smiled all the way through.It was a great family movie.The trick they played on Ken Griffey Jr was priceless.For anyone who hasn`t seen this movie I highly recommend it."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Lobell/Bergman Productions"
      ],
      "summaries": [
         "When the owner of the Minnesota Twins dies suddenly, his will bequeaths the team to his grandson Billy, a devotee of baseball who, although only 12, has devoured voluminous lore, knows the team intimately, and has shown an uncanny sixth sense of what they need to improve. They hate their manager, so Billy quickly fires the SOB, winning their instant approval. However, this turns to dismay when he announces their new manager: Billy Heywood. How will Billy convince a gang of proud, tough men to stick around and take orders from a kid? On the other hand, what's to lose-- the team has nowhere to go but up.",
         "The Chairman of the Minnesota Twins Baseball team passes away of natural causes and in his will leaves his grandson, Billy Heywood, ownership of the team. Billy, despite being only 12-years-old, is a devotee of the sport, knows the Twins inside out and believes he has what it takes to make the Twins a championship winning team, so he appoints himself the new manager. But will the proud, arrogant players of the team be willing to take orders and tactics from a 12-year-old boy? In an attempt to get the players efforts into the game, he dedicates the season to his Grandfather, and vows to win the Championship with the Minnesota Twins. Is this enough to receive the trust and acceptance of the players, fans and critics of the sport?",
         "A young boy is bequeathed the ownership of a professional baseball team."
      ],
      "budget": 0
   },
   "movielensId": 569,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-06-29",
      "dvdReleaseDate": "2005-09-06",
      "directors": ["Andrew Scheinman"],
      "runtime": 119,
      "movieId": 569,
      "title": "Little Big League",
      "mpaa": "PG",
      "actors": [
         "Luke Edwards",
         "Timothy Busfield",
         "John Ashton",
         "Dennis Farina",
         "Jonathan Silverman",
         "Jason Robards",
         "Kevin Dunn"
      ],
      "imdbMovieId": "0110363",
      "originalTitle": "Little Big League",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["6NOZXwAvFFY"],
      "plotSummary": "When the owner of the Minnesota Twins passes away, he bequeaths the team to his preteen grandson. The newly minted head honcho quickly appoints himself manager, causing unrest in an organisation that struggles to take orders from a 12-year-old.",
      "tmdbMovieId": 31504,
      "avgRating": 2.94153,
      "releaseYear": "1994",
      "numRatings": 1753,
      "posterPath": "/bch2eAwnwcs8k7ClaOg7uNoowqZ.jpg"
   }
}