{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "generations conflict",
            "id": 2200
         },
         {
            "name": "baltimore",
            "id": 2672
         },
         {
            "name": "thanksgiving",
            "id": 4543
         },
         {
            "name": "family clan",
            "id": 7629
         },
         {
            "name": "family conflict",
            "id": 155294
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0113321",
      "video": false,
      "title": "Home for the Holidays",
      "recommendations": [
         35196,
         25562,
         54933,
         12616,
         22792,
         77469,
         20067,
         18913,
         59585,
         95630,
         17450,
         20718,
         50035,
         24625,
         14167,
         19361,
         31633,
         3064,
         66599,
         43079
      ],
      "backdrop_path": "/d9UBz6c39l5tTSC0Dwjg5HrdrwN.jpg",
      "revenue": 17519169,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Claudia Larson",
               "gender": 1,
               "credit_id": "52fe44dbc3a36847f80ae03f",
               "name": "Holly Hunter",
               "profile_path": "/sfqLoSx2dmfQTafqbv8lNHnBeUW.jpg",
               "id": 18686,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Tommy Larson",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae043",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Adele Larson",
               "gender": 1,
               "credit_id": "52fe44dbc3a36847f80ae047",
               "name": "Anne Bancroft",
               "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg",
               "id": 10774,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Henry Larson",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae04b",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Kitt Larson",
               "gender": 1,
               "credit_id": "52fe44dbc3a36847f80ae04f",
               "name": "Claire Danes",
               "profile_path": "/6Lr3Yc53iifCPtJz1jTzjhVxa0j.jpg",
               "id": 6194,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Leo Fish",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae053",
               "name": "Dylan McDermott",
               "profile_path": "/4VVyvrxVVrrX9GsKlkSnUz32Ft6.jpg",
               "id": 32597,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Aunt Glady",
               "gender": 1,
               "credit_id": "52fe44dbc3a36847f80ae057",
               "name": "Geraldine Chaplin",
               "profile_path": "/mnPoiJrhJjJArySW8wMpf84pCxu.jpg",
               "id": 400,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Walter Wedman",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae05b",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Russell Terziak",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae05f",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Joanne Larson Wedman",
               "gender": 1,
               "credit_id": "52fe44dbc3a36847f80ae063",
               "name": "Cynthia Stevenson",
               "profile_path": "/4EClZk1ZIKe3SwcfFr5FrK0xd84.jpg",
               "id": 65528,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80ae00b",
               "name": "Jodie Foster",
               "profile_path": "/eAIE6bnOQ8rm0f933gyeAQdIwrP.jpg",
               "id": 1038,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dac3a36847f80ae011",
               "name": "Chris Radant",
               "profile_path": null,
               "id": 56945,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dac3a36847f80ae017",
               "name": "W.D. Richter",
               "profile_path": null,
               "id": 18179,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44dac3a36847f80ae01d",
               "name": "Jodie Foster",
               "profile_path": "/eAIE6bnOQ8rm0f933gyeAQdIwrP.jpg",
               "id": 1038,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dbc3a36847f80ae029",
               "name": "Peggy Rajski",
               "profile_path": "/wXvcBCMfHWcsTuNI9NbmK4G3g2K.jpg",
               "id": 56947,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae02f",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae035",
               "name": "Lajos Koltai",
               "profile_path": null,
               "id": 47275,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44dbc3a36847f80ae03b",
               "name": "Lynzee Klingman",
               "profile_path": null,
               "id": 3394,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "555516df9251411e4d00071d",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "555516bec3a368776f000768",
               "name": "Stuart Kleinman",
               "profile_path": null,
               "id": 56946,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "555516f3c3a36877790005f9",
               "name": "Andrew McAlpine",
               "profile_path": null,
               "id": 19872,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "55551706c3a36877740006a5",
               "name": "James E. Tocci",
               "profile_path": null,
               "id": 9025,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5555171ac3a3687779000600",
               "name": "Barbara Drake",
               "profile_path": null,
               "id": 8648,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5555172e9251411e5f00067c",
               "name": "Susan Lyall",
               "profile_path": null,
               "id": 20172,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "555517549251411e62000681",
               "name": "Taryn Weaver",
               "profile_path": null,
               "id": 1413197,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "555517719251411e5100066d",
               "name": "Dianne Dreyer",
               "profile_path": "/aN6Upw31PFDhH3cVE6QUat29nHD.jpg",
               "id": 958273,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "555517909251411e62000687",
               "name": "Anne S. Reilly",
               "profile_path": null,
               "id": 1467165,
               "department": "Crew",
               "job": "Unit Publicist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.955785,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9089,
      "vote_count": 50,
      "budget": 0,
      "overview": "After losing her job, making out with her soon to be ex-boss, and finding out that her daughter plans to spend Thanksgiving with her boyfriend, Claudia Larson has to face spending the holiday with her family. She wonders if she can survive their crazy antics.",
      "similar": [
         858,
         141,
         634,
         9762,
         242224,
         112160,
         437557,
         258480,
         43923,
         297762,
         209263,
         68924,
         27586,
         2771,
         9587,
         3134,
         11236,
         10735,
         13075,
         9813
      ],
      "original_title": "Home for the Holidays",
      "runtime": 103,
      "poster_path": "/smK19jzldabfCtKM6IgbkySfWas.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Egg Pictures",
            "id": 802,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "1995-11-02",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "We'll do it every year... until we get it right.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jodie Foster"],
      "runtime": 103,
      "synopsis": "This story is a real imbroglio with a lot of character development and complicated relationships between diverse adult family members at the annual big dinner event. We learn about the family member and their numerous frailties and conflicts and wonder can they ever get along or will disaster ensue. will Holly Hunter have romance with her gay bros friend? There is the usual family football game in yard. Many things go awry. Secrets revealed. People get upset. People grow.",
      "writers": [
         "Chris Radant",
         "W.D. Richter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113321/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMTMyNzU4MV5BMl5BanBnXkFtZTcwMzIwMDkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Holly Hunter, Anne Bancroft, Robert Downey Jr. | See full cast and crew »"],
      "reviews": [
         "People either love or hate this film. It seems to me that, for those who hate it, there is too much going on in the scenes. The dialogue is often open ended, and the action is at times frenetic so that the viewer isn't sure where he/she should be focusing attention. That, I submit, is the true beauty of this unusual movie. It has an over the top realism that makes it a rewarding film to watch multiple times. There are so many layers in the dialogue and the acting, so many subtleties between characters, that you can watch it many times and still be noticing something new. This may be billed a comedy, but it is filled with heartbreak and tragedy, betrayal and disappointments. This is not a run of the mill feel good holiday movie. I think those who rate this movie poorly, in some way, miss that. I hope Jodie Foster directs again. She's immensely gifted.",
         "\"Nobody means what they say on Thanksgiving, Mom. That's what the holiday is all about. Torture.\" - Claudia That is my favorite line in this, one of my favorite movies. This is a holiday at anyone's home: a congregation of people you love beyond comprehension and hate beyond belief but are bound to by blood. There are so many wonderful and true moments in this film both funny and dramatic, that I cannot possibly name them all except to say that these moments, even the one between the sisters near the end, are what we give thanks for even if they are painful. Yes family gatherings are dreaded, but once they are over we are happy to have attended, because somewhere amidst the chaos we remember why we love these people, where we came from, who we are, and what is truly important in this life. coming to realizations such as this inevitably involves torture. we would much rather not think about it... this movie forces us to. Great movie.",
         "I am so glad I found this movie. It is a snug little favorite of mine already. I come from a big family (all weirdos) who somehow get along very well. But this story of a bunch of weirdos who do not is just GRAND. Others may say that the themes of family and home and blah blah are the central idea here, but I say it is that Claudia (Hunter, playing our protagonist) has a really wonderful brother (Downey Jr. who nearly steals this film altogether). Brother Tommy comes home for the holidays unexpectedly because he finds out his sister has just had a reaaaaalllly bad day (fired from her job, teen daughter announces she's going to have sex, loses her coat, makes out with her boss, etc) and dealing alone with the family would be unthinkable. He arrives with some hilarious fanfare, and proves to be excellent moral support for Hunter, a distraction for his family, and the provender of an interesting new element....in the person of Leo Fish, who may or may not be Tommy's new \"partner.\" Tommy ((heavily embellished and ad-libbed by Downey...listen carefully to his banter...hilarious)ends up taking the inevitable flack for his gayness (probably why he was not going to come home in the first place) but her lets it roll off his back, choosing instead to enjoy his sister's company and his parents' foibles. He also really enjoys (and so do we) watching Claudia and Leo Fish figure each other out. They do...albeit obliquely and elliptically, with the conclusion sort of up in the air (hee hee). But in the process we are treated to Leo's very funky and offhand outlook on life. Listen for his very wry speech about trying to talk golf with his own father....\"Par Par Bogie Bogie Par Par\" has become a catchphrase for \"blah blah blah\" in my house... Anne Bancroft and Hunter are stellar, and McDermott is darned cute (the making-out-on-the-doorstep scene is darling). But Downey (yet again) is the one you watch. The director's commentary by Foster gives a clue that he was frustrating to work with, but it seems very worth it here. He is just SO watchable, boistrous, too-energetic, motor-mouthed and loveable. We should all have such a brother. Lucky Claudia. OH! Don't miss the turkey scene. Play it again to catch the peripheral characters' faces. I cannot wait for Thanksgiving!",
         "What I like most about this movie is the atmosphere it creates: the anticipation of returning home during the dreariness of the season's weather, the hustle and bustle of the holiday, the conflict between the loneliness and yet the quiet peace of waking to the first moonlit dusting of snow. There's always such a buildup to that big day, and then it's over, and, as one titled scene suggests, \"now what?\" But what touches me about this movie is what it has to say about love. \"The very thought of you\" is more than a song at the movie's end, it's a theme that permeates the movie: such as when the father watches the home movie of his children, illuminating one of the pivital moments of his life that was only seconds in length, but brings his life such joy and meaning. The movie reminds us that it is \"the very thought of you\" that brings joy to us all.",
         "I have never written a review before, though I am frequently on IMDB, but now I think it is my duty to let prospective watchers of this movie know that it is really very good. Holly Hunter, Robert Downey Jr, and Anne Bancroft are all highlights. Cynthia Stevenson and Geraldine Chaplin are great too. The story is funny and smart, and Jodie Foster got most of the details right on. Rent this movie on Thanksgiving for the full effect; I do every year.",
         "Jodie Foster managed to give us(with an outstanding ensemble of actors)a deliciously written and directed film about the tribulations of belonging to a family and the consequential heartache brought by growing apart from them as one becomes an individual. The sincerity of the script turns out to be one hell of a smash in the head to anyone that can empathize with the basic situations confronted in a typical holiday gathering. Probably the saddest part(and one that most of us who have brothers/sisters will understand) is the sudden knowledge that blood sometimes isn't enough to love somebody. The crackings in fraternal relationships are deeply touching and hard in this one, and while it is not my case, I think a mother and father will break a few tears too as the going away of children and subsequent cutting of the umbilical chord is depicted as an evident transformation that is usually more painful to the elder than to the young. The cast is magnificent, and while the film is very simple in its construction, I would avidly recommend it.",
         "You grow older. But so does everyone else in your family. The small people who were your little brother and sister, the big people who were Mom and Dad - they all grow up and have their own lives, their own families. The world sees you as an adult with children of your own, problems that are real, concerns that completely outside and removed from this group you have known since infancy. Your family sees you as the kid who fought with your sister, and dated the class loser. And when you congregate, you realize that while your baby shoes don't fit you anymore, you're not sure what does. Neither does anyone else. Ann Bancroft as the penultimate Mom is a jewel, pulled between her love of her family, her need to support them, her incomprehension of who they have become, and her own strong will. Robert Downey is fabulous as the manic family clown, not knowing when to stop, not knowing how to protect his closely held secret. Geraldine Chaplin steals your breath (Literally!) as the dotty maiden aunt who uses her eccentricities as a shield against the disappointments of her life. Her soliloquy is perfect. Holly Hunter is wonderful as the eldest daughter, her world in tatters around her feet, looking for and not finding comfort within the confines of her family. Cynthia Stevenson is perfect as the angry middle child, left out and feeling betrayed by her oh so much more exciting siblings. Charles Durning is the father at peace with the world and himself, wondering what all the fuss is about. And Dylan McDermott is the supreme observer, wanting to be part of their lives, looking for a way in to the circle, allowing everyone their dignity, giving them permission to laugh at their absurdities. In spite of all this, or maybe because if it, this film is funny. It could be your own sister, your own mother. There is a wondrous joy here, a happiness that family, at least, is predictable. Jodie Foster did an incredible job of showing the humor, drama, poignancy, frustration, love, loathing, fear, and comfort found in families. As exhausting as these two days were for this family, you know they'll be back next year. Or, as Charles Durning's character says, \"There's always Christmas\".",
         "This is a great little gem of a film. The whole time i was watching this film i couldn't help but notice the similarities to my family. The craziness, the fights i mean everything. I laughed so hard during this film but mostly when Robert Downey Jr. was on screen. It is not to say that Holly Hunter was bad, she was quite good as was everyone else but Downey had this presense on the screen and he just stole the movie. while it was apparent he was using heavily he was still at his best on screen. The DVD commentary by Jodie Foster really gives insight to the film and it really sounds like Downey was a pain to work with because of his improvising everything but you feel she has a genuine sisterly love for him. Bottom line is that it was a funny, insightful, and realistic film.",
         "A script lacking dramatic weight and humorous bite, along with characters that are just too 'off centre', mean that Jodie Foster's second outing as director is not a terribly memorable one. Holly Hunter, always an enjoyable screen presence, impresses as Claudia Larson, a single mother who finds herself making yet another annual flight to celebrate thanksgiving with her painful family. All this on top of losing her job and discovering that her sixteen year old daughter is about to begin having sexual relations with her boyfriend. Life sucks sometimes! Unfortunately Holly's character is really the only one the audience is going to be able to relate to, or even stomach for that matter. Anne Bancroft's mom is a nightmare of paranoia, dad (Charles Durning) is a nostalgic, rotund old fool who is quite possibly losing his grip, while sister and brother-in-law (Cynthia Stevenson and Steve Guttenberg) are obnoxious and self-centred. Add to this a nutty Aunt (Geraldine Chaplin) and a totally flaky and intensely irritating homosexual brother (a most unlikeable Robert Downey Jnr.) and you find it very hard to feel sympathy for, get involved with, or laugh at any of this sorry lot. The screenplay swings from drama to comedy to romance to tragedy on many occasions, but Foster is unable to gain effect in any of these modes. In the end neither cast nor crew can pick up the pieces of what was really a misdirected project to begin with. My advice......don't bother going \"Home for the Holidays.\" Saturday, May 25, 1996 - Capitol Cinema, Melbourne",
         "I love this movie!! I watch it again and again it is so very funny. Holly Hunter is hysterical and so is her nutty family!!! I have to watch it every thanksgiving! I just love it!! My favorite part of the movie is when Tommy Larson played by Robert Downey Jr. comes home and wakes his family. we laugh until we cry. I think it is a really funny movie . I think every one can relate to having an off the wall relative like Aunt Gladys. If you are looking for a movie that is funny and all about family this is good for a laugh. The family is funny and real I have a sister just like Joanne. The overall movie is just simply funny and to laugh at them as a family is to laugh at your self."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Polygram Filmed Entertainment",
         "Egg Pictures"
      ],
      "summaries": [
         "After losing her job, making out with her soon to be ex-boss, and finding out that her daughter plans to spend Thanksgiving with her boyfriend, Claudia Larson has to face spending the holiday with her family. She wonders if she can survive their crazy antics.",
         "Forty-year-old single Chicagoan Claudia Larson gets a lot of bad news just before Thanksgiving, putting her in an even worse mood in preparation for her visit with her family in Baltimore at the home of her overbearing parents, Henry and Adele Larson. Others coming for Thanksgiving dinner are Adele's crazy sister, Glady; Claudia's humorless sister Joanne Wedman and her equally humorless family, Joanne who acts as the primary care-giver for their parents; (unexpectedly) Claudia's younger mischievous gay brother, Tommy Larson, and his new \"boyfriend\", Leo Fish; and Russell Terziak, Claudia's sad old \"friend\" who Adele is trying to reintroduce to Claudia. Beyond the disasters and potential disasters Claudia is anticipating as well as the unexpected ones that do ultimately occur at dinner, Claudia is most concerned about what happened between Tommy and his long term boyfriend, Jack Gordon, and what her own teen-aged daughter, Kitt, is doing at home without her.",
         "After losing her job, making out with her soon-to-be former boss and finding out that her daughter plans to spend Thanksgiving with her boyfriend, Claudia Larson faces spending the holiday with her family."
      ],
      "budget": 20000000
   },
   "movielensId": 57,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-02",
      "dvdReleaseDate": "2001-09-04",
      "directors": ["Jodie Foster"],
      "runtime": 103,
      "movieId": 57,
      "title": "Home for the Holidays",
      "mpaa": "PG-13",
      "actors": [
         "Holly Hunter",
         "Robert Downey Jr.",
         "Anne Bancroft",
         "Charles Durning",
         "Claire Danes",
         "Dylan McDermott",
         "Geraldine Chaplin",
         "Steve Guttenberg",
         "David Strathairn",
         "Cynthia Stevenson"
      ],
      "imdbMovieId": "0113321",
      "originalTitle": "Home for the Holidays",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["ThH8WocPRM0"],
      "plotSummary": "After losing her job, making out with her soon to be ex-boss, and finding out that her daughter plans to spend Thanksgiving with her boyfriend, Claudia Larson has to face spending the holiday with her family. She wonders if she can survive their crazy antics.",
      "tmdbMovieId": 9089,
      "avgRating": 3.32335,
      "releaseYear": "1995",
      "numRatings": 2522,
      "posterPath": "/smK19jzldabfCtKM6IgbkySfWas.jpg"
   }
}