{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109828",
      "video": false,
      "title": "Foreign Student",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1010,
               "character": "April",
               "gender": 1,
               "credit_id": "52fe49919251416c750cc49f",
               "name": "Robin Givens",
               "profile_path": "/sFJW5HWMK2oEYES9f59DzdFPhVh.jpg",
               "id": 59153,
               "order": 0
            },
            {
               "cast_id": 1011,
               "character": "Philippe Leclerc",
               "gender": 2,
               "credit_id": "52fe49919251416c750cc4a3",
               "name": "Marco Hofschneider",
               "profile_path": "/n1gUzpoikh4Fc8FVA9LEgVpLWM3.jpg",
               "id": 23797,
               "order": 1
            },
            {
               "cast_id": 1012,
               "character": "Cal Cate",
               "gender": 0,
               "credit_id": "52fe49919251416c750cc4a7",
               "name": "Rick Johnson",
               "profile_path": "/xIB9G0w6t6X2Z2sQzGa43a3twnY.jpg",
               "id": 171960,
               "order": 2
            },
            {
               "cast_id": 1013,
               "character": "Elizabeth 'Sue Ann' Baldridge",
               "gender": 1,
               "credit_id": "52fe49919251416c750cc4ab",
               "name": "Charlotte Ross",
               "profile_path": "/hlqsMqI8YQs7lUXo1w0SkwBMojM.jpg",
               "id": 82622,
               "order": 3
            },
            {
               "cast_id": 1014,
               "character": "Zachary 'Zach' Gilmore",
               "gender": 2,
               "credit_id": "52fe49919251416c750cc4af",
               "name": "Edward Herrmann",
               "profile_path": "/3AGRAverIuT6kgSfGQPiY55QZzG.jpg",
               "id": 52995,
               "order": 4
            },
            {
               "cast_id": 1015,
               "character": "Rex Jennings",
               "gender": 2,
               "credit_id": "52fe49919251416c750cc4b3",
               "name": "Jack Coleman",
               "profile_path": "/gGpXU2knJgft75Hr3JtudN9tyDt.jpg",
               "id": 113927,
               "order": 5
            },
            {
               "cast_id": 1016,
               "character": "Howlin' Wolf",
               "gender": 2,
               "credit_id": "52fe49929251416c750cc4b7",
               "name": "Charles S. Dutton",
               "profile_path": "/ajXBoMz8xGgDDcn8xpRi8LmXKKa.jpg",
               "id": 17764,
               "order": 6
            },
            {
               "cast_id": 1017,
               "character": "Sonny Boy Williamson",
               "gender": 2,
               "credit_id": "52fe49929251416c750cc4bb",
               "name": "Hinton Battle",
               "profile_path": "/e0KEfjlswSxTtkj4r2T0JajCnWK.jpg",
               "id": 15567,
               "order": 7
            },
            {
               "cast_id": 1018,
               "character": "Mrs. Baldridge",
               "gender": 1,
               "credit_id": "52fe49929251416c750cc4bf",
               "name": "Ruth Williamson",
               "profile_path": "/fcicq7yuxCxbF9Ys0tVPnvjUbgw.jpg",
               "id": 168797,
               "order": 8
            },
            {
               "cast_id": 1019,
               "character": "Harrison",
               "gender": 2,
               "credit_id": "52fe49929251416c750cc4c3",
               "name": "Michael Reilly Burke",
               "profile_path": "/aAupliSxOJAwrzdfs4YGk2Jetb5.jpg",
               "id": 108774,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49919251416c750cc465",
               "name": "Eva Sereny",
               "profile_path": null,
               "id": 1006705,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49919251416c750cc46b",
               "name": "Philippe Labro",
               "profile_path": null,
               "id": 69681,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe49919251416c750cc471",
               "name": "Menno Meyjes",
               "profile_path": null,
               "id": 736,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49919251416c750cc477",
               "name": "Tarak Ben Ammar",
               "profile_path": null,
               "id": 16787,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49919251416c750cc47d",
               "name": "Mark Lombardo",
               "profile_path": null,
               "id": 57120,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49919251416c750cc483",
               "name": "Jean-Claude Petit",
               "profile_path": null,
               "id": 37187,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49919251416c750cc489",
               "name": "Franco Di Giacomo",
               "profile_path": null,
               "id": 66641,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe49919251416c750cc48f",
               "name": "Howard Cummings",
               "profile_path": "/aiCfULiZjQJ0HZflX11p0OVVHdx.jpg",
               "id": 9041,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe49919251416c750cc495",
               "name": "Jeanette Scott",
               "profile_path": null,
               "id": 63292,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe49919251416c750cc49b",
               "name": "Carol Ramsey",
               "profile_path": null,
               "id": 10397,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.157627,
      "production_countries": [],
      "id": 95743,
      "vote_count": 1,
      "budget": 0,
      "overview": "A French football playing exchange student falls in love.",
      "similar": [],
      "original_title": "Foreign Student",
      "runtime": 90,
      "poster_path": "/4sObGxR5CNh42qi7Jjv0I8ygF8G.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1994-07-29",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eva Sereny"],
      "runtime": 90,
      "synopsis": "They Don't Teach Life In A Classroom",
      "writers": [
         "Philippe Labro",
         "Menno Meyjes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109828/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NzcyODQ3N15BMl5BanBnXkFtZTcwOTMxNzgwMw@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Robin Givens, Marco Hofschneider, Rick Johnson | See full cast and crew »"],
      "reviews": [
         "In 1955 a French student named Philippe (Marco Hofschneider) spends a year at a college in Virginia as an exchange student. There he meets a beautiful black woman (Robin Givens) and falls in love...but that was forbidden back then. But he can't stop his feelings for her... Laid-back adaptation of a true story. It's good but distressingly TOO mild. This story has been told before and this is a good version but everything is so toned down it's hard to react to it. Also it mixes in football, blues music, a nervous breakdown and alcoholism in bits and pieces making it a jumble--the movie seriously lacks focus. Still this is not unwatchable. It's beautifully filmed and has a feel for the period in clothes and cars (LOVE Cal's one). The acting really pulls this one through. Hofschneider is just great--young, handsome and full of life. His reactions when someone tries to get him into a blues club are hilarious. Rick Johnson is also good playing his best friend Cal. Givens is pretty terrible--a one note performance but she IS beautiful. Also the film is tasteful. There is a sex scene between Hofschneider and Givens but no nudity is shown! Hofschneider however was completely nude when they filmed it--he complained it was too cold shooting it and thought it was unnecessary but he did it. All in all the film DOES work. I actually cried a little at the end. This came and went VERY quickly in 1994. It was supposed to boost Givens' career but didn't do a thing. It's worth seeing but don't go out of your way. I give it a 7.",
         "The Foreign Student is about a French foreign exchange student having an \"Interlude of inestimable value\" at a University in Virginia circa 1956. He has a passionate affair with a local \"colored girl\" (Robin Givens) despite rampant bigotry. The critics didn't like this film, but I like it very much. The character development is wonderful, and Robin never looked better. The themes are profound, and the cinematography is spectacular. This film will not get your adrenalin pumping, but it will touch your heart.",
         "A slightly above average film, watchable for the entire time (I saw it a lazy Sunday afternoon). It never got too slow, the plot moved along regularly, with sufficient evolving narrative to evoke interest throughout. The tale centers on a young man who leaves Paris, France to study as a freshman in college in rural Virginia. The movie heralds his attempts at acceptance, sometimes funny, sometimes poignant, politically charged with one main issue of the day (race relations). The four main characters, and several supporters, were well developed. A pre-Tyson Robin Givens (as April) did a fine job, she was smoldering hot. Marco Hofschneider (Philippe) was not at his most emotional, but although some might call his performance wooden, his range of emotion seemed appropriate for me. Heck, it's not as if all actors must seem as if they're hamming it up during an audition for All My Children. Rick Johnson (Cal) and Charlotte Ross (Sue Ann) more than make up for any perceived lack of emotion by Marco with their satisfying efforts.",
         "Foreign student is a beautiful film. It's been a long time since i've come away from watching a film feeling 'high' on romance, or with my head in the cloud!! I love watching romantic movies involving interracial couples....it's so refreshing, new, and interesting! I also loved the song played in Foreign student, called 'you turn my life around' but i can't find it anywhere on the internet. Marco looked absolutely handsome and Givens looked beautiful...such a sweet couple...aaaaaaaaaah if i could find a man alike marco's character in Foreign student, or more precisely if he finds me and chases me i would me one happy girl!!! I need a man to sweep me of my feet, to really want me....i think all girls do. I recommend anyone go and see this film because it truly is beautiful and inspires you to find your true love and not to give up hope in finding it because it's out there for everyone!!!!",
         "I just saw this movie and thought it was great. I was moved to tears. I just loved the way you can almost FEEL the love and tension between the characters. The movie is both funny and touching. It's a great love story. I also thought the main Character, Phillipe, is very good looking which adds to the appeal.I REALLY DID feel a connection with the characters and I recommend it.",
         "In the role of naive French student Phillipe, Marco Hofschneider(Immortal Beloved) is extremely likeable and convincing. His character is a French student who has come to a college in 1956 Virginia on exchange, to naturally find that everything if different. He wishes to play football, but gotten it mixed up with the European version, which results in quite a mishap. He also wishes to fraternize with the local colored citizens, particularly a housekeeper called April, whom he is madly in love with...but he sounds finds out that falling in love with people of another race is also something that's well, done differently in the United States. It's forbidden. Yet, while Phil may seem simple in some areas, even he knows to keep their love a secret, and that results for more scrapes and turmoil. Forbidden love is always an interesting story, but not a very original one. Nevertheless, \"Foreign Student\" manages to avoid many cliches, and good performances by supporting players Rick Johnson, Edward Herrman, Charlotte Ross, and particularly Hofschneider make for a passably good film.",
         "The theatrical picture \"Foreign Student\" is, looked at on its own, a sensitive and often moving film. The atmosphere of 1950s Virginia is skillfully re-created, the performances, are for the most part, incisive and stirring, and the script is tender and refreshingly non- melodramatic, allowing the proceedings to evolve in a mature and realistic way. Yet for all that, all this, the greatest plus, the most positive element is--drum roll, please--Robin Givens. As April, the local schoolteacher who also works as a domestic, she deftly creates a soulful and sexual woman. We immediately see why French exchange student Phillipe is drawn to her, why he falls in love with her. Indeed, we rather envy the young Parisian for being able to hook up with such a sexy and mature and quietly passionate girl. And when, at the end, they part and April leaves him a warm and loving good-bye note (\"To Phillipe. All my love. Always. April\"), we genuinely feel Phillipe's satisfaction at having had such a gorgeous and caring and fully-rounded lover. It is Robin's graceful beauty, her smoldering sexiness, and her classy intelligence that make her such an admirable love object and cause her to be the high point of the picture. When People Magazine did a story on her during the 1980s, it quoted her as contending that her long-range plans included more parts for \"wholesome black girls--we don't have many female heroes in that vein.\" Robin Givens's character in \"Foreign Student\" may not be \"wholesome,\" but through her smooth good looks and stylish sex appeal, she is certainly, definitely a \"female hero\" for black girls and, in fact, for girls of all races.",
         "FOREIGN STUDENT Aspect ratio: 1.85:1 Sound format: Dolby Stereo Based on Philippe Labro's bestselling memoirs, Eva Sereny's film FOREIGN STUDENT strives valiantly for a sense of lyrical beauty, exemplified by cinematographer Franco Di Giacomo's evocative vision of rural Virginia in 1956, and by the sparse poetic voice-over, much of it presumably lifted from the book. But the narrative suffers from the vacuum of Marco Hofschneider's decidedly uncharismatic performance in the crucial leading role. The central romance lacks passion."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Carthago Films S.a.r.l.",
         "Featherstone",
         "Holland Coordinator and Service Company"
      ],
      "summaries": [
         "Paris, 1955. Philippe Leclerc is overjoyed: he has just been granted the fellowship he applied for and he will be able to study for a year at the prestigious Asheland-Stuart University of Virginia. Once on the spot, he discovers how different the South of the USA is from his native France and the period of adjustment is no bed of roses, notably when he mistakes American football for soccer while playing a game and becomes the laughing stock of the college. Philip nonetheless gains the friendship of the captain of the team and gradually adapts to his new environment, discovering American literature through the lectures of a fascinating professor, rock and roll and jazz, among other things. A Southern belle, Sue Ann, falls for his French charm but, unfortunately for her, her love is unrequited and she breaks down nervously as a result. As for Philippe he falls madly in love with April, a beautiful Black domestic worker...",
         "A French football playing exchange student falls in love."
      ],
      "budget": 0
   },
   "movielensId": 572,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-07-29",
      "dvdReleaseDate": null,
      "directors": ["Eva Sereny"],
      "runtime": 90,
      "movieId": 572,
      "title": "Foreign Student",
      "mpaa": "R",
      "actors": [
         "Robin Givens",
         "Marco Hofschneider",
         "Rick Johnson",
         "Charlotte Ross",
         "Edward Herrmann",
         "Jack Coleman",
         "Charles S. Dutton",
         "Hinton Battle",
         "Ruth Williamson",
         "Michael Reilly Burke"
      ],
      "imdbMovieId": "0109828",
      "originalTitle": "Foreign Student",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A French football playing exchange student falls in love.",
      "tmdbMovieId": 95743,
      "avgRating": 2.63158,
      "releaseYear": "1994",
      "numRatings": 38,
      "posterPath": "/4sObGxR5CNh42qi7Jjv0I8ygF8G.jpg"
   }
}