{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "injury",
            "id": 158591
         },
         {
            "name": "neighborhood",
            "id": 180523
         },
         {
            "name": "recuperation",
            "id": 214954
         }
      ],
      "imdb_id": "tt0111252",
      "video": false,
      "title": "Spanking the Monkey",
      "recommendations": [
         2074,
         37820,
         94725,
         114266,
         114556,
         19033,
         25389,
         19094,
         41480,
         82545,
         5719,
         16939,
         16135,
         20324,
         111605,
         29964,
         124296,
         31919,
         24621,
         116857
      ],
      "backdrop_path": "/zu4NFqTbvaVHLzi1GdLZBbcTl1x.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ray Aibelli",
               "gender": 2,
               "credit_id": "52fe47369251416c7509181d",
               "name": "Jeremy Davies",
               "profile_path": "/xPM0Wf4zVDpdNw3xokD2mDTqtoP.jpg",
               "id": 4654,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Tom Aibelli",
               "gender": 2,
               "credit_id": "52fe47369251416c75091821",
               "name": "Benjamin Hendrickson",
               "profile_path": "/4ultgQSqarLpUMHesR4BU1hIKtf.jpg",
               "id": 128428,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Susan Aibelli",
               "gender": 1,
               "credit_id": "52fe47369251416c75091825",
               "name": "Alberta Watson",
               "profile_path": "/iy3Qgqap1U1GRqNzjoX2mFwdqD3.jpg",
               "id": 19958,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Toni Peck",
               "gender": 1,
               "credit_id": "52fe47369251416c75091829",
               "name": "Carla Gallo",
               "profile_path": "/g9QYMQvFxfEXbkxcjX7rM2nGmcF.jpg",
               "id": 54708,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Nicky",
               "gender": 0,
               "credit_id": "52fe47369251416c7509182d",
               "name": "Matthew Puckett",
               "profile_path": null,
               "id": 930069,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Aunt Helen",
               "gender": 1,
               "credit_id": "52fe47369251416c75091831",
               "name": "Judette Jones",
               "profile_path": null,
               "id": 994104,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Curtis",
               "gender": 2,
               "credit_id": "52fe47369251416c75091835",
               "name": "Zak Orth",
               "profile_path": "/rKupoahQ3pgeVVXS8EWd1WSnKEO.jpg",
               "id": 6212,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Joel",
               "gender": 2,
               "credit_id": "52fe47369251416c75091839",
               "name": "Josh Philip Weinstein",
               "profile_path": null,
               "id": 164270,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Don",
               "gender": 0,
               "credit_id": "52fe47369251416c7509183d",
               "name": "Judah Domke",
               "profile_path": "/AeO3uTfWO4IGcgisVHNsYBJqIic.jpg",
               "id": 1120876,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Fran Gibson",
               "gender": 0,
               "credit_id": "52fe47369251416c75091841",
               "name": "Lleana Stratton",
               "profile_path": null,
               "id": 1150841,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Dr. Peck",
               "gender": 0,
               "credit_id": "52fe47369251416c75091845",
               "name": "Richard Husson",
               "profile_path": null,
               "id": 1150842,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47369251416c75091813",
               "name": "David O. Russell",
               "profile_path": "/6aERBGHkLHpnd6V3pftvHoTvRvr.jpg",
               "id": 17883,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c75091819",
               "name": "David O. Russell",
               "profile_path": "/6aERBGHkLHpnd6V3pftvHoTvRvr.jpg",
               "id": 17883,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c7509184b",
               "name": "David Carbonara",
               "profile_path": null,
               "id": 5340,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c75091851",
               "name": "Michael Mayers",
               "profile_path": null,
               "id": 238447,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe47369251416c75091857",
               "name": "Pamela Martin",
               "profile_path": null,
               "id": 17147,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe47369251416c7509185d",
               "name": "Ellen Park",
               "profile_path": null,
               "id": 1150843,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe47369251416c75091863",
               "name": "Susan Block",
               "profile_path": null,
               "id": 35146,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47369251416c75091869",
               "name": "Carolyn Greco",
               "profile_path": null,
               "id": 1062466,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.98151,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17600,
      "vote_count": 35,
      "budget": 200000,
      "overview": "Bright young student Raymond Aibelli is forced to sidetrack an important medical internship because his mother, Susan, is recovering from a broken leg. When he isn't tasked with the most mundane aspects of Susan's recuperation, Raymond finds distraction in a neighborhood girl, Toni Peck. But, as Susan begins relying on her son for both physical and emotional needs, Raymond starts developing disturbing and unwanted new yearnings.",
      "similar": [
         27066,
         1259,
         37265,
         14055,
         283227,
         52449,
         80752,
         81774,
         86331,
         28468,
         244772,
         1278,
         263472,
         9777,
         11004,
         9716,
         9529,
         32868,
         527,
         10822
      ],
      "original_title": "Spanking the Monkey",
      "runtime": 106,
      "poster_path": "/nr3KNkAu7tmiaBnNgxabrcyCLX0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Swelter Films",
            "id": 55150,
            "origin_country": ""
         },
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Buckeye Films",
            "id": 55151,
            "origin_country": ""
         }
      ],
      "release_date": "1994-01-15",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "A gripping comedy about letting go.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David O. Russell"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["David O. Russell"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111252/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5NTA0MDc0Ml5BMl5BanBnXkFtZTcwMTQ4MjYzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeremy Davies, Alberta Watson, Elizabeth Newett | See full cast and crew »"],
      "reviews": [
         "Ray comes home for 2 days to look after his mother before going back to his new town to take up an internship in his summer break from MIT. However his father informs him that he will need to stay much longer than that to care for her as she has broken her leg. While in the house Ray becomes increasingly frustrated and fins himself drawn into lust for his mother with devastating results. This independent film is refreshingly straightforward but has enough quirk in it to have an edge of humour. The drama is sort of Shakespearean as Ray finds his life controlled by his mother who he becomes filled with desire for after rubbing her legs, showering her etc. This quickly finds him in a situation where, unable to masturbate due to the family dog following him everywhere and unable to have sex with a young girl because he is too rough he is increasingly drawn to mum! This is not a comedy but a tragedy that deals with a very taboo subject. It deals with it gradually and in such a way that you can understand why it happens. Even when it happens there is no judgement \u0096 Ray is more sensitive after that and his mother seems nonplussed altogether. The fact that people hated it because they were expecting a teen comedy shows not a weakness in the film but a fault from the audience. That's not to say this is a classic \u0096 it has flaws, some characters and scenes appear to have no meaning and the ending wasn't as concrete as I'd hoped for. But it still handles the central theme well and is a good tale of a young man who slowly loses a lot due to lust. The performances are all good \u0096 expect Gallo who is a little directionless in her character. Overall THIS IS NOT A TEEN COMEDY! But it is a good drama on a taboo subject. It may be a little light on basic plot but the underlying themes will give you plenty to consider after you watch it.",
         "Given the budget limitations ($80,000), \"Spanking the Monkey\" manages to hold interest albeit with some poorly chosen scenes. The core of the movie is the relationship between mother and son. The rest of the cast exists to point the way to the inevitable. The philandering, materialistic, self absorbed husband/father illuminates the barren marriage. The fumbling sexual attempts of the son with the girl next door and her contradictory accusations of his sexual attempts as either too rough or not rough enough (gay), understandably confuse the son and provide the mother with a mentoring, nurturing sexual role for her son about how to sexually succeed with women. The mother, stumbling upon a bedroom sexual session between the son and the girl next door, reacts more in jealousy than in any maternally disproving fashion. The mother's flirtatious ways with the male neighbors, doctors, and ultimately with the girl next door's father point out that while she may be her son's mother, she is still a very desirable woman in the eyes of the rest of the male world. From the beginning through the end, you never believe the son and mother ever had a mother/child bonding. Both of them are intellectually superior, highly educated. The mother was young when she gave birth and she thinks of herself as her son's educational, intellectual and ultimately sexual mentor, not his mother. The teenage son's inability to \"spank his monkey\" combined with the boredom, liquor and medications downed by his mother provide the explosive elements that are just waiting to be lit. The mother's seductive smile and a slight hiking of her nightgown set off the explosion. This movie is nowhere near perfect, but it's compelling enough to let you sit through the unnecessary (e.g. stoner friends) and that's a lot more than you can say for most movies with a budget that is a thousand times greater.",
         "The climax it where it's at in this movie; didn't see it coming the first time I watched the film. Plenty of nice shots and solid character development. Funny and at times painful to watch, but definitely makes you think. The characters are written well and are performed admirably by the cast (with an early role for Jeremy Davies). Great movie to watch in the middle of the day, with the pacing slow relative to many movies. But it works, and it makes the payoff all the more rewarding. The interactions feel so real. This is as good as it gets for under $100,000.",
         "An independent film that bravely confronts the subject of consensual incest is presented as a dark comedy in which ALBERTA WATSON and JEREMY DAVIES, as mother and son, have the key roles. It's their mother/son relationship at the heart of the story that is compelling and sometimes erotic--especially the scene where Davies has to massage his mother's legs and toes while they discuss why her road travelling husband isn't there to do it for her. When the story strays to others outside this relationship, it fails to make the same connection. The father is strictly a man so obsessed with his own career that he ignores his wife. She, in turn, is a manipulative shrew who virtually seduces her son because she's a needy woman. The son's friends are depicted as total drug-happy boors and boozers whose minds are completely idle. At times the story becomes dark and brooding--even intense--and yet there's a surface tension broken by laughter at some of the shenanigans going on in this dysfunctional, to say the least, family. Outstanding work by JEREMY DAVIES and ALBERTA WATSON. He's highly sympathetic in his predicament all the way through and she's totally despicable in the manner by which she exerts control over him. Both show complete understanding of their difficult roles. Summing up: Interesting tale, character-driven and flawed, but worth watching.",
         "It's simply another one of the Greek myths retold in a modern setting. Those Greeks really knew how to write a cunning tale that cuts close to the bone. They wrote straight from human experience and feeling. Incest crept up on the young hero of the film with terrifying inevitability. They both knew what they were getting into, and went ahead even though they knew that they would subsequently experience \"decision regret\". A very enjoyable film that magically captures the passion of a summer holiday gone badly wrong. Copying a tried and tested tale from the past is always a successful recipe for a good modern film, as Lucas has shown with borrowing from Homer's \"The Iliad\". This film is certainly capable of provoking strong emotion from the viewer, and I think that most of us would have a hard time resisting sexual advances in those circumstances if the woman in question was such a fox. A compelling tale, made all the more sickening for it's overt basis in human experience. Not one to watch with your mum (unless you fancy her!).",
         "It's always nice when Americans make thoughtful, atmospheric, and reflective films. Especially when they are black comedies, because America is home to some of the masters of the genre. Dealing with the most taboo of all subjects, this film makes you squirm in your seat even more than Thomas Vinterberg's 'Festen', and the subject is dealt with using the tact and subtlety that many Hollywood directors lack. Anybody expecting a slapstick, South Park type movie will be sorely disappointed, but fans of Todd Solondz will probably love it. Plus there is a great soundtrack by Morphine.",
         "THIS COMMENT CONTAINS SPOILERS, GIVEAWAYS AND REVELATIONS. Or something. Okay, to my mind what holds this movie together is the chemistry between Susan (Alberta Watson) and Ray (Jeremy Davies). Almost everything else is superfluous and a great deal of the last half hour could have wound up on the cutting-room floor. Tom, the controlling, philandering dad, could have been fleshed out more. As it is, we see a driven, conniving, dishonest man - with no idea of what made him that way, or why Susan stayed with him. There is a scene rather late in the film where he opens up, but it's wedged between about six other speed-the-plot scenes, and loses almost all its meaning. His character works best not as a real person, but as another one of the many pressures that act against Ray all summer long. You can see Ray's fear, resentment and anger build through the entire film. Jeremy Davies' performance is agile and moving. I did not need even one appearance of Ray's stoner friends; they don't advance the plot or even give any comic relief. We're supposed to understand that Ray is only there because he's friends with Nicky (played by guitarist Matthew Puckett), but the other three jokers take up so much cinematic room that there's no way to tell what Nicky and Ray meant to each other. Likewise, when Ray jumps off the cliff, we're supposed to understand that he's making a desperate bid for freedom, and that his old life is over (rebirth / baptism / etc). But not half an hour ago he was trying to kill his mother. Too much information. Toni Peck is the little girl from down the lane who's had a crush on Ray without ever meeting him. She is a precocious thing who has read more about life than she's actually experienced. The early scenes with her and Ray could have had more bite - what he says to her in the pagoda is not really enough for her to go home in a snit. And if she can't take that kind of verbal treatment, how in the world does she manage to stand up to Hurricane Susan later on? I don't feel that Toni's character was really thought through (and her father should have been excised from the movie). She was not really a person, but a study in contrast. Ray is awkward, graceless and fumbling when he's with Toni, but with Susan he's the consummate lover - relaxed, confident, passionate, healing. Jeremy Davies does not quite pull off every trick in Ray's book. Too often he is a limp dishrag - not at all vibrant or interested in interacting with the world. Makes sense for his character but is very boring to watch. He is at his best when he's with Susan - there are long loving closeups of his face as he massages his mother's feet, calves, thighs... those are some of the few times in the entire film Ray looks really involved. The phrase \"smoldering lust\" comes to mind. Alberta Watson was phenomenal. Her character is the only one who really does anything. She behaves inappropriately with her son and suffers the consequences. Tom is a cipher, and Ray's biggest problem is that he is acted upon. Everything he does is a reaction. Even the climactic leap at the end. Morphine's score is sardonic, rueful and knowing - very well suited to this movie. And the cinematography isn't stunning by any means, but the camera is so voyeuristic when Ray and Susan are in the bedroom - those extreme closeups, coupled with panning shots that don't cut away even when you're flinching and squirming and wanting to leave the room. Those are the scenes I go back to - they are erotic, but for all the wrong reasons. Even as you're drawn in, you really wish you could look away. Kick a few plot twists (will Ray won't Ray ever get to Washington?) and extra characters (Aunt Helen) to the curb, and this movie would have been tight as a snare drum, extremely compelling cinema. As it stands, it's a darkly flawed diamond. 6.5/10.",
         "Considering the plethora of reviews here, both good and bad, there isn't much I can say that hasn't already been said. I will add that the first half works \"reasonably\" well, allowing viewers to understand perhaps how such a thing as an incestuous encounter could possibly happen. But then the film derails, and derails big time. The boy blames his mother completely for what they did, and the film seems to side with him despite the fact that it had previously shown us that he was just as guilty as she in the liaison. The film gets unspeakably ugly from there. The subject of consensual incest has been addressed by film only a few times over the years, always with unsatisfactory results---perhaps this is reflective of society's uneasiness with the subject. Consensual incest is about the only \"sexual more\" that is never discussed (even by psychologists), even though it likely occurs in real life with more frequency than we would like to believe.",
         "A college dude heads home for the summer to take care of his broken legged mom. In among his daily routine is letting her brace herself on him as he stands outside the shower, his would-be goofy romance with a neighbor girl, and peer pressure from the guys he hangs out with. Not to mention taking one of the most annoying dogs of movie history for walks. The capper comes when after rubbing cream on mom's legs, he's unable to sleep. Turned on perhaps? The two proceed to get drunk and tear one off (insert your \"EWWW\" here). He tries to put it behind him and concentrate on the neighbor girl, even though earlier she nearly accused him of rape...after accusing him of being gay and telling him to be more agressive! This girl is true schmuck/dink. Maybe the most stunning moment is the sex scene, or near sex scene, involving him, the girl, and mom toward the end. And that's mostly what the film does: stun, not really shock. Mostly it just annoys, as all of the characters are totally unlikable, the meanie mother and father, the bonehead girl, and even Davies as the lead, comes off cold or irrational sometimes. Plus the ending, which leaves everything up in the air. Ridiculous, too, is the business with the family dog, that is constantly distracting Davies from the doing the title deed, as it wimpers outside the bathroom door. Sheesh, man, lock the damn dog in a room! That's what I do. Uh, I mean, that's what I WOULD do, WOULD do, not what I do do. Ahem. Anyway, this one's good to gather a group of friends around for some uncomfortable laughs. Or for the most awkward experience, I'd use the classic line from the Video Hound movie review book: \"See it with a relative\".",
         "This film tends to reject the Hollywood made-for-TV oedipus complex (which is usually only expressed in undertones) scenario of a youth beset with confusion over his seemingly unhealthy relationship with his mentally ill mother, and his need to have a uncomplicated non-incestous relationship with Miss American Apple Pie. What we're presented with is a story of an independant young man who has dedicated himself to being unfettered by his emotionally distant, overzealous parents. When his mother suffers a badly broken leg, he is called upon to take full responsibility for her care thru her entire recuperation. Very reluctantly, he is forced to acknowledge their authority yet again. He is immediately confronted with her immasculating condensations, but is unnerved by her very uninhibited demenor when under the influence of her prescribed pain-killers. When me and my friend saw this, we were somewhat uncomfortable with the realistic candor of the actors portraying the mother and son. I can say this film, unlike any other I've seen elicits the nervous humor response far more effectively, and truly makes this worth seeing."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Buckeye Films",
         "Swelter Films"
      ],
      "summaries": [
         "Raymond Aibelli is a promising medical student ready to begin a prestigious summer internship. But Susan, his mother, is immobilized by a broken leg, and his father Tom, a travelling salesman, makes Raymond stay home and take care of his mother, an attractive though unhappy woman. His mother's condition leads them to a degree of immediate physical contact which Raymond finds disturbing. He soon meets Toni, a high school girl, but his sexual impulses are increasingly confused, especially since he is still upset over losing the internship.",
         "Ray is a promising pre-med student at MIT, home briefly (he thinks) before leaving again for a prestigious internship. His plans evaporate when his callous father insists he stay home to care for his mother after an accident, while the father travels on sales calls. The ensuing days are spent struggling to run the large suburban household alone, masturbate undisturbed, and keep his mother happy. The boredom and Vodka tonics kick their Oedipal urges into overdrive, and the girl next door only adds to his confusion."
      ],
      "budget": 200000
   },
   "movielensId": 574,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-01-15",
      "dvdReleaseDate": "2005-12-06",
      "directors": ["David O. Russell"],
      "runtime": 106,
      "movieId": 574,
      "title": "Spanking the Monkey",
      "mpaa": "",
      "actors": [
         "Jeremy Davies",
         "Benjamin Hendrickson",
         "Alberta Watson",
         "Carla Gallo",
         "Matthew Puckett",
         "Judette Jones",
         "Zak Orth",
         "Josh Philip Weinstein",
         "Judah Domke",
         "Lleana Stratton",
         "Richard Husson"
      ],
      "imdbMovieId": "0111252",
      "originalTitle": "Spanking the Monkey",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["zCxlFPnsEU4"],
      "plotSummary": "Bright young student Raymond Aibelli is forced to sidetrack an important medical internship because his mother, Susan, is recovering from a broken leg. When he isn't tasked with the most mundane aspects of Susan's recuperation, Raymond finds distraction in a neighborhood girl, Toni Peck. But, as Susan begins relying on her son for both physical and emotional needs, Raymond starts developing disturbing and unwanted new yearnings.",
      "tmdbMovieId": 17600,
      "avgRating": 3.29819,
      "releaseYear": "1994",
      "numRatings": 1437,
      "posterPath": "/nr3KNkAu7tmiaBnNgxabrcyCLX0.jpg"
   }
}