{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "coming of age",
         "id": 10683
      }],
      "imdb_id": "tt0106878",
      "video": false,
      "title": "À la mode",
      "recommendations": [],
      "backdrop_path": "/aDTuJRsnNlUB76JO2Qg68Hbd1Ug.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mietek Breslauer",
               "gender": 2,
               "credit_id": "55aa7f739251411e0b005a5f",
               "name": "Jean Yanne",
               "profile_path": "/79Z1qcDpbyRp5HPSBQvm15xwqOI.jpg",
               "id": 24381,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Fausto",
               "gender": 0,
               "credit_id": "55d95014c3a3683201003776",
               "name": "Ken Higelin",
               "profile_path": null,
               "id": 1499582,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Tonie",
               "gender": 1,
               "credit_id": "55d9502dc3a3683207003ad8",
               "name": "Florence Darel",
               "profile_path": "/zpAg60GH1s1X22thPrAKuEV3mwO.jpg",
               "id": 37923,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "55aa7f2ac3a368648e004218",
            "name": "Rémy Duchemin",
            "profile_path": null,
            "id": 1354907,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0,
      "production_countries": [],
      "id": 349394,
      "vote_count": 0,
      "budget": 0,
      "overview": "Fausto enters an orphanage and is initially bullied, but then makes friends with a new bunkmate, Raymond. He is apprenticed to Mietek, a tailor in the Jewish quarter, who teaches him the trade. Fausto charms everyone in the quarter, and falls in love with Tonie, the mechanic's daughter. He starts making outrageous suits for publicity and, after dressing Tonie, decides that he wants to be a famous couturier.",
      "similar": [
         449176,
         112160,
         398818,
         376660,
         9779,
         84892,
         8363,
         2105,
         391713,
         43923,
         308369,
         10229,
         14,
         76726,
         376867,
         85350,
         281007,
         1391,
         11421,
         147773
      ],
      "original_title": "À la mode",
      "runtime": 82,
      "poster_path": "/qbpjtFUPpYHtILQOLlgMImV1Cyo.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1993-09-10",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rémy Duchemin"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Richard Morgiève",
         "Richard Morgiève"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0106878/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2NzQxOTcyM15BMl5BanBnXkFtZTcwMTM4MDcxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Ken Higelin, Jean Yanne, Florence Darel | See full cast and crew »"],
      "reviews": [
         "A sweet little romantic comedy; inherently conservative at its core, but overall it's just so charming and sweet you can't do anything but smile through most of it. I don't know much French, but the credits tell me \"A La Mode\" translates to \"In Fashion,\" and not \"With Ice Cream,\" as was my first guess. It's fluff, but it's French fluff, so if you're into romantic comedies and want something a little different, this might make a nice rental. Very French, R-rated (one scene of nudity), wacky fun that melts as soon as it's over, but is well worth the experience. 8/10, though that goes up or down depending on your enjoyment of fabric.",
         "Just to clear up a couple of things from the previous review - à la mode literally means \"in fashion\", NOT \"with ice cream\". And Fausto was the main character's first name, not last name. I thought this was a cute movie with a few laughs and would recommend it for some light entertainment. Yes, some of it was cliché and predictable, but so what? The characters were likeable and I was entertained. I got my $1.99 rental fee's worth!",
         "There are some dramatic moments in A La Mode, but it is mainly a comedy. I understand French humor may differ from that of the U.S., but there was enough common ground for me to get a couple laughs and more than a few smiles out of A La Mode. I am grateful to this movie for introducing me to the astounding beauty of Florence Darel. The main character, Fausto Barbarico, played by Ken Higelin, has very little to say in the movie, and this somehow works. Again, it may be a nuance that European movie watchers would understand and appreciate more than the typical American: Fausto is traumatized by his father dying and being sent to an orphanage to live. This would tend to cause, in many individuals, the semi-catatonia that Fausto seems to be a victim of. Jean Yanne is very good as Meitek: His animated and driven character plays a perfect foil for Fausto's receding nature. Barbarico's \"fashions\" are ridiculous, but I think they were meant to be, to enhance the comedic element.",
         "Ok, so here we have this movie that I picked up, called \"A La Mode\", which literally means \"With Ice Cream\"... Which doesn't make much sense, and neither, coincidentally, does \"Fausto\", the original title of the movie. The title is in reference to the main character's last name, but it sounds actually like an italian version of 'Faust' which sounds more interesting than this movie. The movie starts out with a cliche of the worst order. Fausto and his Mom and Dad are happily happily cycling along the mountains somewhere... Oh they are so happy.. NOTHING could spoil this day! Until... That's right, Fausto's parents are victim to The Vehicle That They Would Have Noticed If They Would Have Been Paying Attention! After this rather unfortunate incident, Fausto becomes an orphan, (a rather old orphan it looks like, he's supposedly 17, where he LOOKS oh, 25).. All the kids hate him, where the Orphanage places him into another room of the orphanage, where he's greeted by a kid who can fart music. (hey, I'm not making this up). Of course Fausto is instantly charmed by this, and they become fat friends. Soon Fausto is apprenticing at a local tailor where he finds the art making men's suits rather boring. When he comes across the local mechanic's daughter however, he comes across the brilliant idea to become what seems to be the only straight women's fashion designer ever. A La Mode is very predictable from the get go, but admittedly, the actor playing Fausto won me over with his sweet charm. But, really, can't you choose something better?"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Lili Productions",
         "BBD Productions",
         "France 2 Cinéma"
      ],
      "summaries": ["Fausto enters an orphanage and is initially bullied, but then makes friends with a new bunkmate, Raymond. He is apprenticed to Mietek, a tailor in the Jewish quarter, who teaches him the trade. Fausto charms everyone in the quarter, and falls in love with Tonie, the mechanic's daughter. He starts making outrageous suits for publicity and, after dressing Tonie, decides that he wants to be a famous couturier."],
      "budget": 0
   },
   "movielensId": 576,
   "movielens": {
      "languages": [""],
      "releaseDate": "1993-09-10",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Rémy Duchemin"],
      "runtime": 82,
      "movieId": 576,
      "title": "À la mode",
      "mpaa": null,
      "actors": [
         "Jean Yanne",
         "Ken Higelin",
         "Florence Darel"
      ],
      "imdbMovieId": "0106878",
      "originalTitle": "À la mode",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Fausto enters an orphanage and is initially bullied, but then makes friends with a new bunkmate, Raymond. He is apprenticed to Mietek, a tailor in the Jewish quarter, who teaches him the trade. Fausto charms everyone in the quarter, and falls in love with Tonie, the mechanic's daughter. He starts making outrageous suits for publicity and, after dressing Tonie, decides that he wants to be a famous couturier.",
      "tmdbMovieId": 349394,
      "avgRating": 2.5,
      "releaseYear": "1993",
      "numRatings": 26,
      "posterPath": "/qbpjtFUPpYHtILQOLlgMImV1Cyo.jpg"
   }
}