{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109120",
      "video": false,
      "title": "Andre",
      "recommendations": [
         35645,
         41582,
         118430,
         41579,
         17745,
         20551,
         40688,
         33657,
         40344,
         276530,
         3288,
         19371,
         20648,
         36929,
         239899,
         210599,
         52687,
         80346,
         7269,
         32304
      ],
      "backdrop_path": "/l0CO255nMbn0kv1e8rbrSUmerlk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Toni Whitney",
               "gender": 1,
               "credit_id": "52fe4415c3a368484e00e83d",
               "name": "Tina Majorino",
               "profile_path": "/kGzCUaPddOm84cRlExLKOvZEoqP.jpg",
               "id": 53930,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Harry Whitney",
               "gender": 2,
               "credit_id": "54f94daac3a36878d8000ac1",
               "name": "Keith Carradine",
               "profile_path": "/b2GbGSrgb6twTdjfvUK4y0WrIjx.jpg",
               "id": 30613,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Thalice Whitney",
               "gender": 1,
               "credit_id": "52fe4415c3a368484e00e841",
               "name": "Chelsea Field",
               "profile_path": "/9NnerSpNB4Ro3f3iMRorv1uvYlA.jpg",
               "id": 27008,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Billy Baker",
               "gender": 2,
               "credit_id": "54f94db9925141439f000d69",
               "name": "Keith Szarabajka",
               "profile_path": "/rNeAyOrLNiP1YeCWXpBLTa7pLxZ.jpg",
               "id": 87957,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Mark Baker",
               "gender": 2,
               "credit_id": "54f94dc9c3a36878e1000f55",
               "name": "Joshua Jackson",
               "profile_path": "/e1btrP27otWpSRvgVV9PsOKCpJG.jpg",
               "id": 11866,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Steve Whitney",
               "gender": 2,
               "credit_id": "52fe4415c3a368484e00e845",
               "name": "Shane Meier",
               "profile_path": "/dyCdl0VQS6zU3I0D5sda6jVXuai.jpg",
               "id": 130935,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Paula Whitney",
               "gender": 1,
               "credit_id": "52fe4415c3a368484e00e849",
               "name": "Aidan Pendleton",
               "profile_path": null,
               "id": 198700,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4415c3a368484e00e84f",
               "name": "Harry Goodridge",
               "profile_path": null,
               "id": 932380,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a368484e00e855",
               "name": "Lew Dietz",
               "profile_path": null,
               "id": 932381,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a368484e00e85b",
               "name": "George T. Miller",
               "profile_path": null,
               "id": 1174031,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5378313b0e0a261431003d09",
               "name": "Donald Kushner",
               "profile_path": "/uYzKylQSQUiVGsUPK47OSuYGUCA.jpg",
               "id": 6889,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 5.282842,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21352,
      "vote_count": 39,
      "budget": 0,
      "overview": "The true story of how a marine seal named Andre befriended a little girl and her family, circa 1962.",
      "similar": [],
      "original_title": "Andre",
      "runtime": 94,
      "poster_path": "/dB6aXyLns7nKsxcPAE5Dj40dNSx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1994-08-17",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "The greatest adventure is finding your way home.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Miller"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Harry Goodridge",
         "Lew Dietz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109120/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3MjU1MzYyMl5BMl5BanBnXkFtZTcwNzI4MjEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tina Majorino, Keith Carradine, Chelsea Field | See full cast and crew »"],
      "reviews": [
         "GOOD - What gave this movie appeal and made it a bit different is that a seal is the star. The likable seal, \"Andre,\" (in real life, Tory, the sea lion) has cute face with big brown eyes and likes to stick his tongue out and give everyone \"the raspberry.\" The latter joke is way overdone, but it's okay. The most likable human is the father, played by Keith Carradine. The kids are somewhat spoiled but the little one, the star (Tina Majorino) isn't bad. THE BAD - Too much typical Hollywood families in which (1) there is a stupid teen romance with a rebellious, pouting female teen; (2) the nasty foe who makes trouble for no apparent reason; (3) the nice-guy husband who gets unfairly blamed or is proved wrong in family affairs (the Liberal mother always winning out). OVERALL - A little more of the seal and less of the teen girls and other annoying people would have made this a lot better. As it is, one viewing was enough.",
         "This is probably my favorite movie ever. Its amazing.. i've probably seen it at least 50 times. It's a great movie for the whole family and I promise anyone who sees it will love it. You will want to watch it over and over again, one time is not enough. Three times is really not enough. The story of a seal and the family who takes him in is amazing, all of the details which are added make it even better. All of the characters are interesting. The movie will make you laugh and cry, but you'l'l be smiling all the way through. It makes you want to find a seal of your own, if thats possible. The characters are people you will want to meet, if not for their great personality then for your own amusement. When I have children, I will show them this movie at least as many times as I have seen it. You should watch this movie- it's my absolute favorite and you will definitely love it.",
         "Great acting by a beautifully trained seal (how do they do it?) based on a true story. One more animal movie for children and families, but with a twist. The interaction of seal and humans is heart warming. Prepare for a lump in the throat with a happy/sad ending.",
         "ANDRE, in my opinion, is a very touching movie about a special friendship for all ages that will warm your heart. I really loved the tricks that Willy did. If I could have, I would have helped hide him myself. The only problem is how I would hide him, though. The score was good, the costumes were perfectly designed, everyone was cast perfectly, and the direction was flawless. In conclusion, I highly recommend this very touching movie about a special friendship for all ages to anyone who hasn't seen it. You're in for a real treat and a good time, so go to the video store, rent it or buy it, kick back with someone close to you, and watch it. I guarantee you you'll thoroughly enjoy it.",
         "Andre is a seal pup who is orphaned and taken in by a little girl in New England coastal town. The seal become a local celebrity in town. The seal in the film is almost like a dog, but with flippers. It is a light hearten and touching film. A movie I would recommend for the whole family to watch.",
         "It was only when I saw the credits, I then understand it's based on a true story. It made me smile even more. So I guessed I knew why I saw this few days back for a reason. The trailers had won me over and when I saw the movie itself, it was just so heart-warming. Toni's attachment to Andre is one maybe I can sort of relate to. Sentimental attachment to something where one have feeling for after sometime. Throw in a bit of drama as well, and one can see how Toni reacts especially to how others who don't really like Andre's sudden popularity in the town. This is just one of those where the family can all enjoy it together. Sometimes we just need a bit of old-fashioned goodness. Quite a heart-warming movie.",
         "Well, yes, this movie was probably the best kid's movie i've seen in a long time. couple of swears, and it WASN'T a rip off of Free Willy. Free Willy was a rip off of Andre. How do i know? Because this movie is based on a true story. Willy isn't. The movie starts with a young girl marrying off a sparrow (or some kind of bird)and a chicken. it ENDS with the little girl giving up her pet at last, and letting it live in the wild, but Andre still returns. He made 24 trips home. :) I loved the movie, and i definitely recommend watching it. Spoiler time... It comes time in the movie that Toni finds out by mistake that the seal is going to be taken back, to the wild. You see her in bed that night, saying good night to her mom, and crying, exclaiming \"he's my best friend. we're best friends.\" you may find it odd that she would say this, but Toni is shy, and she doesn't have very many friends. I wouldn't say she's shy, as does the movie reviews on the back of the case... but... well, you'll see what i mean when you watch the movie yourself. Keep in mind that this story is about a fourth-grader, not a four-year-old, yet this little girl doesn't seem to have ever been separated or had a sleep over, or anything. Until along comes Andre, an orphaned seal. How was he orphaned? you'll see when you watch the movie. I highly recommend seeing the movie. it's one that isn't just for young, but old people too. :) i promise, you'll love it. *Another Little Note* FOR THOSE OF YOU THAT DO NOT REALIZE IT, THIS MOVIE CANNOT, AND I REPEAT, CANNOT!!! BE A RIP OFF of *ANY* MOVIE!!!! IT'S A TRUE STORY FOR CRIPES SAKE!!! YOU CAN'T CONTROL WHAT HAS REALLY HAPPENED, ALL YOU CAN DO IS MAKE SOMETHING OF IT!!!!! SHEESH!",
         "Andre is a seal , adopted by the family of Harry Whitley the local harbourmaster (Keith Carradine),and a particular favourite of his tomboy 7 year old daughter,Toni (played by Tina Majorina).Seal and child become inseparable but trouble is brewing when the local fishermen blame the animal for damaging their nets ,thus putting their livelihood in jeopardy.They set out to kill him and Toni puts out to sea,in the middle of a raging storm ,to try and save Andre from the fate they have in store for him. Its all very predictable and manipulative not helped by wooden acting and an animal I personally found very resistable .However it will be enjoyed by animal lovers and is suitable for those seeking fare they can watch as a family unit without fear of violence or profanity. Not my scene but reasonable of its type",
         "Andre has to be one of my all-time favorite movies. I read the book for a science project and was thrilled when it was made into a movie. Although it didn't follow the book exactly, I thought it was good nevertheless. Tina Majorino is a wonderfully gifted actress, and did a great job in her roll of Toni. The casting was well done, period. The sea lion (although it was supposed to be a seal) is adorable. It is a heart-warming, must-see movie.",
         "Based on a true story and from a library book, ANDRE shows viewers the love, triumphs, and companionship animals can bring. It does teach the perfect lesson about wild marine animals, too. A lot of \"family\" movies express this kind of idea, making this one more of the same like the rest, which was expected for me. They now suffer from a lack of originality and a very simple plot. I also hate the wasteful oldies put into this and I've heard enough of them already! Andre's characterization will charm and delight the young, though. I had a feeling this was going to rip off FREE WILLY at the time of its release. Actually, this is not that kind of movie. Parents and siblings will appreciate this one before the evening supper. Give the kids something else other than cute little old playful animals for a change!"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Kushner-Locke Company, The"
      ],
      "summaries": [
         "Toni Whitney and her family adopt a baby sea lion. When it grows and starts getting into mischief, it antagonizes some of the fisherman in the town. One of the fisherman, Billy Baker, is upset with the Whitney's because Toni's father, Harry, was appointed Harbor Master instead of him, partially because of the seal. But when the humorous antics of the sea lion attracts media attention, further squeezing out Mark, and running down his business, he gets even more upset.",
         "The true story of how a marine sea lion named Andre befriended a little girl and her family, circa 1962."
      ],
      "budget": 0
   },
   "movielensId": 577,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-08-17",
      "dvdReleaseDate": "2002-03-12",
      "directors": ["George T. Miller"],
      "runtime": 94,
      "movieId": 577,
      "title": "Andre",
      "mpaa": "PG",
      "actors": [
         "Tina Majorino",
         "Keith Carradine",
         "Chelsea Field",
         "Keith Szarabajka",
         "Joshua Jackson",
         "Shane Meier",
         "Aidan Pendleton"
      ],
      "imdbMovieId": "0109120",
      "originalTitle": "Andre",
      "genres": [
         "Drama",
         "Family",
         "Adventure"
      ],
      "youtubeTrailerIds": ["FDgsQvDhwO0"],
      "plotSummary": "The true story of how a marine seal named Andre befriended a little girl and her family, circa 1962.",
      "tmdbMovieId": 21352,
      "avgRating": 2.81129,
      "releaseYear": "1994",
      "numRatings": 673,
      "posterPath": "/dB6aXyLns7nKsxcPAE5Dj40dNSx.jpg"
   }
}