{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "letter",
            "id": 3344
         },
         {
            "name": "postman",
            "id": 4461
         },
         {
            "name": "fisherman",
            "id": 5420
         },
         {
            "name": "poet",
            "id": 5933
         }
      ],
      "imdb_id": "tt0110877",
      "video": false,
      "title": "The Postman",
      "recommendations": [
         13386,
         27670,
         38251,
         56784,
         11216,
         56975,
         439,
         12776,
         24382,
         24160,
         20914,
         29458,
         22826,
         24188,
         37975,
         19200,
         10599,
         10569,
         179144,
         11447
      ],
      "backdrop_path": "/32pvxFiXNo2TdNpBiuHN8k2Mr4K.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Pablo Neruda",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021dd1",
               "name": "Philippe Noiret",
               "profile_path": "/13vb0RuOI0t8I1y04pnz81vLptl.jpg",
               "id": 24366,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Mario Ruoppolo",
               "gender": 0,
               "credit_id": "52fe43e29251416c75021dd5",
               "name": "Massimo Troisi",
               "profile_path": "/4MYP8iFkyi1txnPmR5LlPISt77X.jpg",
               "id": 67792,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Beatrice Russo",
               "gender": 1,
               "credit_id": "52fe43e29251416c75021dd9",
               "name": "Maria Grazia Cucinotta",
               "profile_path": "/bgI6qh8V7zKslCcGxRflom4H7yS.jpg",
               "id": 10777,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Telegrapher",
               "gender": 2,
               "credit_id": "52fe43e29251416c75021ddd",
               "name": "Renato Scarpa",
               "profile_path": "/4jANi4vGdTqFG7a5OjtbM9ikwOe.jpg",
               "id": 14149,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Donna Rosa",
               "gender": 0,
               "credit_id": "53ea63d6c3a3680eb5001318",
               "name": "Linda Moretti",
               "profile_path": "/4RXo3cS27IP6jYj464OU9M89ITM.jpg",
               "id": 538696,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Di Cosimo",
               "gender": 2,
               "credit_id": "53ea6400c3a3680ebd0012a6",
               "name": "Mariano Rigillo",
               "profile_path": "/qyAwLvscb3FHFz0f3smaTZv5la.jpg",
               "id": 24290,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Matilde",
               "gender": 1,
               "credit_id": "53ea6416c3a3680ec1001376",
               "name": "Anna Bonaiuto",
               "profile_path": "/yp4iL38XyshPUpnqlMQ9Dlpabp2.jpg",
               "id": 225301,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Elsa Morante",
               "gender": 1,
               "credit_id": "53ea6429c3a3680eca001353",
               "name": "Simona Caparrini",
               "profile_path": "/unfHetKyp0yJ3FnB5ORXhzhI0Jv.jpg",
               "id": 1351952,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 2,
               "credit_id": "53ea647dc3a3680eca001360",
               "name": "Carlo Di Maio",
               "profile_path": "/yWiwrHtPR0iSn0OuNlWtELMcKPV.jpg",
               "id": 1352578,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "53ea64a7c3a3680eca001369",
               "name": "Nando Neri",
               "profile_path": null,
               "id": 1352580,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "53ea64d0c3a3680ecc001360",
               "name": "Vincenzo Di Sauro",
               "profile_path": null,
               "id": 1352582,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "53ea6500c3a3680ec70013bf",
               "name": "Orazio Stracuzzi",
               "profile_path": "/zttVmTiKYr9p10sd7pBWpSbjUM3.jpg",
               "id": 1189964,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 0,
               "credit_id": "53ea6578c3a3680ec10013af",
               "name": "Sergio Solli",
               "profile_path": "/awwiyTMCPpHv2IvnNTZ1I7zI7Wm.jpg",
               "id": 1151165,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "53ea65a7c3a3680eca001387",
               "name": "Alfredo Cozzolino",
               "profile_path": "/1lkBHO97DOlKehwH32C4oilM5Oo.jpg",
               "id": 1352583,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021d97",
               "name": "Michael Radford",
               "profile_path": "/hunHPqyqiiLpinVywy824EvJZiu.jpg",
               "id": 28898,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021d9d",
               "name": "Antonio Skármeta",
               "profile_path": "/r3zKiL1t1007Qdz4UwQh4wJvL9a.jpg",
               "id": 67789,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021da3",
               "name": "Furio Scarpelli",
               "profile_path": null,
               "id": 5812,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e29251416c75021da9",
               "name": "Giacomo Scarpelli",
               "profile_path": null,
               "id": 67790,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021daf",
               "name": "Mario Cecchi Gori",
               "profile_path": "/vXszJw9m6Iifr6pKROKo1yIDjxm.jpg",
               "id": 32309,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e29251416c75021db5",
               "name": "Vittorio Cecchi Gori",
               "profile_path": "/84qBljbXDIv8FgKnIKMkoPacShX.jpg",
               "id": 57301,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e29251416c75021dbb",
               "name": "Gaetano Daniele",
               "profile_path": null,
               "id": 67791,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021dc1",
               "name": "Luis Bacalov",
               "profile_path": "/d9hYl7eX4KxIz4wZ9psdKjxmaSF.jpg",
               "id": 66675,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e29251416c75021dc7",
               "name": "Franco Di Giacomo",
               "profile_path": null,
               "id": 66641,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e29251416c75021dcd",
               "name": "Roberto Perpignani",
               "profile_path": null,
               "id": 18333,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a1f0c1e925141033907f3e6",
               "name": "Massimo Troisi",
               "profile_path": "/4MYP8iFkyi1txnPmR5LlPISt77X.jpg",
               "id": 67792,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a1f0c2c925141033307dc60",
               "name": "Massimo Troisi",
               "profile_path": "/4MYP8iFkyi1txnPmR5LlPISt77X.jpg",
               "id": 67792,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a1f0c450e0a264cd007ff93",
               "name": "Michael Radford",
               "profile_path": "/hunHPqyqiiLpinVywy824EvJZiu.jpg",
               "id": 28898,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.440383,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 11010,
      "vote_count": 268,
      "budget": 0,
      "overview": "Simple Italian postman learns to love poetry while delivering mail to a famous poet; he uses this to woo local beauty Beatrice.",
      "similar": [
         810,
         27902,
         597,
         109424,
         205775,
         10191,
         71805,
         3600,
         4347,
         3131,
         35056,
         1213,
         873,
         11324,
         3176,
         15472,
         166426,
         167073,
         254,
         804
      ],
      "original_title": "Il Postino",
      "runtime": 108,
      "poster_path": "/qkq2JfINRQi4Iu9VTMMtQFfmGWZ.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "1994-09-22",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Radford"],
      "runtime": 108,
      "synopsis": "Mario Ruoppolo is a young man in an insular Italian fishing village where time moves slowly. Since Mario's seasickness doesn't allow him to fish, he is given the job of postman, delivering mail on a bicycle to only a single customer, the famous Chilean poet Pablo Neruda. After a while, the two become good friends. Neruda has been exiled to Italy because of his communist views. In the meantime, Mario meets a beautiful young lady, Beatrice Russo, in the village's only cafe. With the help of Neruda, Mario is able to better communicate his love to her through the use of metaphors. The two are later married. The poet Neruda and his wife are allowed to return to Chile. Some months after Mario makes a recording of village sounds for Neruda. Years after Neruda come back to the island as a tourist, he finds Beatrice and her son in the same old cafe. Through her, he discovers that Mario had been killed a while back. He was going to read his poetry at a large political gathering in Naples but was killed by police intervention. Beatrice gives Neruda the recordings of village sounds, which also record the sounds of police brutality leading to Mario's death.",
      "writers": [
         "Antonio Skármeta",
         "Furio Scarpelli"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0110877/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5NDI4NjQyOV5BMl5BanBnXkFtZTYwODI1NDE5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Massimo Troisi, Philippe Noiret, Maria Grazia Cucinotta | See full cast and crew »"],
      "reviews": [
         "Michael Radford, an English director, ought to be given credit for bringing this beautiful story to the screen. It speaks volumes that Mr. Radford achieves a triumph with a film that for all practical purposes should have been directed by an Italian. This is a timeless story of friendship, poetry and love set in a desolated island that was to be Pablo Neruda's home in exile. The story is a simple one. Mario Ruoppolo, a poor man without a job, suddenly applies for a vacant position that will pay almost nothing, but by becoming a letter carrier he gets the chance of meeting a man that will make a deep impression on him and who will change his life completely. Mario, the postman, is almost illiterate. He can read and write, with only the basic knowledge he probably picked up in the island school. He is allergic to fishing, and can't make a living like his father, and probably most of his ancestors before him. It's the time after WWII in which a poor Italy is still recovering from the devastation and defeat. Pablo Neruda, the Chilean poet, finds a rustic home in the island. He is the most famous person ever to set foot in there. Mario is in charge for bringing Pablo his packages and mail. An easy friendship develops between them. Like everyone else in the island, Mario is impressed by the foreigner. In trying to imitate his poet friend, Mario awakens to all the beauty around him and discovers love with the gorgeous local girl, Beatrice Russo. The film's mood changes right after Pablo Neruda and his wife receive assurances they can go back to their native land. This leaves Mario in a sad state, but now that he is married, he has other responsibilities to live for. Neruda had awakened in Mario a desire to speak for himself and to seek justice. This is a film totally dominated by the late Italian actor Massimo Troisi, who as Mario, completely captures us by just being a simple soul with no malice. Mr. Troisi is splendid in his take of this poor man who discovers beauty and poetry late in his life. Philippe Noiret, is Pablo Neruda. Mr. Noiret makes a great contribution as the man who sees beauty everywhere and translates it into poetry. Maria Grazia Cucinotta is the beautiful Beatrice, the woman who loves Mario. Renato Scarpa and Linda Moretti, play minor roles with success. \"Il Postino\" is helped by the magnificent cinematography of Franco di Giacomo who captures the island in all its splendor. The music score is another asset. Luis Bacalov's tuneful background music adds another layer in this film rich texture. This film is an excellent way to be introduced to Pablo Neruda's poetry, even if it's only for the curiosity the film will give even a casual viewer. Thanks to Michael Radford for a poetic view of this lonely place where two people meet and are changed forever.",
         "A beautiful movie that does an excellent job bringing to life Neruda's love poems and how they touch the life of a simpleton postman. It inspires in one, a spiritual and sensual love for poetry. The music is intricately woven into the fabric of the story, and is surely a high point in the movie. Great cinematography, matched frame by frame with the splendid acting, especially that of Massimo Troisi and Philippe Noiret. Watch this movie if you are disillusioned with the notion of romance, and need some succour. The movie once again reinforces my admiration for the Italian film-makers. What amazes me is their simplicity in relating a tale, and how subtly pathos is displayed in their movies. This is also evidenced in \"Life is Beautiful\" and \"The Bicycle Thief\".",
         "Nominated for Best Actor (Massimo Troisi), Best Adapted Screenplay, Best Music, Best Director, and Best Picture, \"Il Postino\" is a tender tale of love and poetry on a small island in the Mediterranean Sea, inspired by an incident in the life of Pablo Neruda, the Chilean poet who was briefly exiled, in 1952, for his communist ideas which have often got him into trouble... 'Il Postino' is a beautiful, heartbreaking movie, funny in its simplicity and honest dialog... Massimo Troisi leaves his final legacy in the role of a shy, hesitant and uncultured postman who possesses the heart of a poet with truly peculiar observations, such as 'the whole world is the metaphor for something else,' often without realizing how exciting his comments are... Director Michael Radford had the care to create a wonderful film which floats on the love of words, rhythm, and imagery... His movie is much heightened by a music score that includes quotes, paraphrases and Argentinean tangos... His film turns out to be a great little movie... It deals with a friendship between a lethargic villager, who takes the modest job of delivering letters to the celebrated poet living in a secluded area... Poetry becomes their connection... Mario Ruoppolo is a simple man with a complicated set of values who rides his bicycle climbing the hard road to Neruda's cozy home and with his timid manners delivers the armful of correspondence to the single customer of the island... A polite Neruda shows little interest in his personal postman, but he favors him, one day, with his autograph, signing one of his books with the words 'Regards, Pablo Neruda.' Nevertheless as time passes the 'poet of love' becomes a bit more friendly, intrigued by Mario's enthusiasm regarding his poetry and poetic manner of speaking... Mario, impressed that almost every letter delivered to Neruda is from a female, couldn't understand how his new resident, despite his advancing age, has such magical power over women... So he tries, with his simple way of thinking, to understand all the secrets of the exalted poet, sharing his thoughts with him... He becomes increasingly curious, asking a lot of questions about the mystical creation of poetry, forcing the fascinating celebrity to reveal some of the unexposed materials of his artistic vision... Neruda introduces Mario to the verbal rupture of metaphors, attempting to teach them to his anxious pupil... The two men discover an unexpected friendship based on their mutual view that life should be a framework for seduction and romance... As the film goes on, Mario, crafted with a tender spirit, attempts, through Pablo, a gentle intervention and poetry to win over the woman he has fallen for, Beatrice Russo - played by Sicilian fashion model Maria Grazia Cucinotta... Becoming in a slow way his 'Latin Cyrano de Bergerac,' Neruda guides his postman into romance, but refuses to write a poem that could charm his young passionate Beatrice... To attract the prettiest girl in town, Mario becomes a bit of a poet himself... But when he finds his own words insufficient to his romantic mission, he appropriates one of his tutor's sensuous poems, and protests, when discovered, that \"Poetry doesn't belong to those who write it, but to those who need it.\" Unbelievably his 'lyrical words' fascinate the sensual bombshell who was playing a mean game of table soccer in a low cut dress, but disturb greatly her disapproving aunt Donna Rosa, who sees that Mario is contaminating her niece with his nice words... Nevertheless the postman wins the beautiful Beatrice and convinces her to marry him... Heartbreak comes when Neruda receives a telegram that he can return to the country he loves so much... From here on, an extended epilogue with smiles, tears and regret, takes the story on... And the film almost breathes lyrical tenderness in its depiction of an honest man who longs so much for love... Mario, who has not received any word or greeting from the poet and had remarked that it's quite normal for the poet not to remember him, returns to the poet's villa to revisit the place that had once been alive with the sounds and sights of emotional discovery... In the silence that now surrounds it, he realizes that the poet has taken all the beautiful things away with him... He gets the idea to create a 'live' poem for his dearest friend Don Pablo... An outdoors tape to let him listen to the wonderful sounds of the island, from the small and big waves at the Cala di Sotto, to the wind on the cliffs, to the wind through the bushes, to the sad nets belonging to his father, to the church bell of Our Lady of Sorrow, to the starry sky over the island, to Pablito's heartbeat... Philippe Noiret (best remembered for 'Cinema Paradiso') charms us once again as the affectionate mentor to Mario... He convinces the postman that poets are quite human but warns Mario about the old Dictaphone saying, 'Even the most sublime ideas sound ridiculous if heard too often.' The sets and the cinematography, accompanied by an Oscar Winning Score, create a wonderful atmosphere of the remote poor island with no running water, of the modest houses with pealing plaster, of the Rocky cliffs overlooking the blue Mediterranean, of the post-war fishing village under the shades of rose and salmon... Like love itself, some great movies seem surprisingly human... Delbert Mann's 'Marty' was one, Cameron Crowe's 'Say Anything...' was another, and now Michael Radford's \"Il Postino\" is exceptional... His film stands tall in its own right as a 'must see' movie... It's tough to imagine anyone not liking it... It simply revives our memories, and breaks our heart...",
         "\"Il Postino\" is a movie that received oodles of critical acclaim upon its release in 1994. While I don't think it was as good as advertised, I understand why it received such praise. In a movie world that is filled with dry and unamusing romance stories, \"Il Postino\" is a relatively lush and beautiful tale. The plot is fairly simple but loaded with subtleties that allow, even encourage, multiple viewings. Mario (Massimo Troisi) longs for something more than his simple fisherman life on an Italian island, so he takes a small job as a postman, delivering mail to famed romantic poet Pablo Neruda (Phillipe Noiret), who is living in exile on the same island. Over time, they develop a relationship that is based on Neruda aiding Mario in wooing his beloved Beatrice (Maria Grazia Cucinotta). The final act is where the film makes the leap from well-made standard fare to something greater. With a couple plausible plot developments, characters and relationships are deepened beyond a basic love story, to a place that accents everything that happens leading up to that point. I can't say much else without giving things away, but stick with the movie to the end, even if you're dragging midway through. As you might expect from an Italian film, \"Il Postino\" has a very European feel. The passion of Italy is present throughout, explained through lifestyles, literal and metaphorical imagery, and the emotions of the characters. The setting is far from the bustling dollar-driven society in which Americans dwell, and a movie like this wouldn't get made in America, because the cultures are drastically different. The film's star, Massimo Troisi, is excellent. He embodies everyman qualities exceptionally, similar to Tom Hanks, yet with more...something. Soul perhaps? He, like the entire film, is just more European, and I hope you understand what I mean by that. Noiret portrays Neruda perfectly, expressing his romantic ways through both words and actions. Everyone else is very good, although no one stands out; the overall anonymity of the cast aids the viewer in establishing culture as well. The cinematography and the scenery it presents is often breathtaking, although not in the sweeping manner of something like The Lord of the Rings. Rather, cinematographer Franco Di Giacomo wisely chose to let the pictures speak for themselves. The elegant cliffs, white-capped waves, and rolling topography of the island gently yet firmly frame and support the story. A straight-forward tale should have suitable pictures, and \"Il Postino\" meets that requirement. The film is touted as a romantic comedy, and it is, although not in the traditional sense. The comedy isn't slapstick and won't elicit bushels of laughter. But there is an underlying sense of humor laced through the whole movie, often in simple movements, tasks, or occurrences. All of this combines to present something like a fairy tale replete with Italian heart and soul. \"Il Postino\" won't blow you away, but its tender lessons about life, love, and friendship will stick with you for some time, urging another viewing. Bottom Line: A very European romance that is better than most anything Hollywood can conjure up. 8/10. (If you like the film, get the Collector's Edition DVD; it's quite good.)",
         "Set in a beautiful Italian sea coast village, Il Postino is a gem of a movie. There is an undescribable beauty to it. I appreciate 1) the beauty of the ocean, 2) the lovely music, 3) the Italian language, 4) the poetry of Pablo Neruda, 5) the time that the Nobel Peace Prize poet spends with a poor mail deliverer who comes up hills on his bicycle, explaining to him what is a metaphor, 6) the beautiful and sincere friendship between the two men, 7) the love that Neruda has for his woman, and 8) how Mario wants to impress the woman of his dreams with nothing else, but the poetry written by Neruda. After his time in asylum Neruda goes back to Chile and his friend Mario misses him. Later in the movie Neruda returns to the island and realizes how much he misses that honest and simple man who was so eager to learn when they met at the beach town. I love this movie! If I watch it some more my Italian will improve tremendously, I can understand enough to watch the movie and not read the subtitles. I guess that makes the movie more meaningful to me, as I understand it in the language that it was made in. Mario really wanted Neruda to mention him in interviews because he sensed that they both had influenced each others' lives. Unfortunately when Neruda meets Pablito, Mario is no longer around. I highly recommend this movie. My favorite scene: Is Neruda explaining to Mario what a metaphor is. That scene also provided me with my favorite quote: Neruda:\" Metaphors.\" Mario: \"What are those?\" Neruda:\" How can I explain, when you talk of something comparing with the other?\" Mario: \"Something you use in poetry?\" Neruda: \"Yes! For example: when you say the sky weeps, what do you mean?\" Mario: \"It is raining.\" Neruda:\" Very good! That is a metaphor.\" Mario:\"It's easy then. Why has it got such a complicated name?\" Neruda: \"Man has no business with the simplicity of complexity of things.\" I have the tape and have enjoyed this movie every time I watched it. This movie deserves every award it has received. It is a wonderful movie.",
         "Lyrical, moving and beautifully photographed gentle comedy in which an exiled Chilean poet inspires his Italian postman to woo and marry a local girl. Massimo Troisi gives a wonderfully contained performance as the postman who learns to see the beauty in poetry and his home on an Italian island. Philippe Noiret plays the poet Pablo Neruda with the usual assuredness. It is difficult not to be moved by the simple beauty of the film.",
         "'Il Postino' is a love story between men. There's something poetic about that, in this movie about love & poetry. Neither of them is gay, mind you. In fact, a ravishing beauty (Maria Grazia Cucinotta) is the object of the title character's affection. Still, this movie belongs to Philippe Noiret and the Oscar-nominated Massimo Troisi. Noiret is a Chilean poet, exiled in Italy for his communist leanings. Troisi is the postman, a man going nowhere who comes to idolize this intelligent poet. They become friends and Noiret essentially Cyranos Troisi into Cucinotta's ample heart. I didn't find the entire film to be heart-rending, but the final scenes add deep resonance to the material. My eyebrows were raised when the movie ended and there was a \"For Massimo\" credit. Troisi died less than a day after they finished shooting. It seems fitting that the end of the film is bittersweet because the cast & crew had been working with a dying man who wanted nothing more than to finish this final project. 'Il Postino' ended up grossing a boatload of money, so his subtle performance clearly struck a chord with audiences. Troisi got all the press for his fine work, but Noiret is certainly his equal. Director Michael Radford does well to stay out of their way. I like how he didn't sentimentalize the Troisi/Cucinotta relationship. He's infatuated with her, but that diminishes a bit once he gets her. They're a fair representation of a real couple who were brought together for what might have been the wrong reasons. In fact, the film is filled with surprises. It's a quiet character study, but all the players in 'Il Postino' go through earth-shaking changes of personal proportions. And the Noiret/Troisi friendship is right at the heart of the matter.",
         "With the possible exception of Shakespeare, perhaps, who can explain matters of the heart? For love can be that most elusive of butterflies, as a smitten young man discovers in 'Il Postino,' directed by Michael Radford. There's a bit of 'Cyrano' in this tale of Mario Ruoppolo (Massimo Troisi), a somewhat unprepossessing part time mailman (he has but one customer) who falls for a local beauty, Beatrice (Maria Grazia Cucinotta), but has no idea how to pursue the longings of his heart. But as luck would have it, Mario's customer just happens to be Pablo Neruda (Philippe Noiret), a South American expatriate who is also a world renown poet recently exiled to this small island off the coast of Italy. Not wanting to make a pest of himself, Mario only very gradually strikes up an acquaintance with Neruda, while his love for Beatrice goes unrequited. Once Neruda is apprised of Mario's situation however, he begins to instruct him in the art of regarding the world around him in terms of metaphor, as well as how to thus express himself. Soon Mario is composing poetry of his own, with hopes of not only attracting Beatrice's attention, but of winning her heart. It's a warm and touching story that plays to the heart, rather than the intellect, and will capture you with it's humanity. There is nothing singular about Mario; he is nondescript, just an average guy, and it illustrates that common bond among us all, that of having wants and needs to be expressed and fulfilled-- especially with regards to matters of the heart-- for as Mario discovers, love knows no boundaries. Troisi gives a strong performance as Mario, but is almost too retiring to be effective, though his character contrasts well with that of Noiret's Neruda, whose zest for life is more readily apparent. Still, it's that underplayed sense of the 'Everyman' that Troisi conveys so well that allows the audience to relate to him. Anyone who has ever yearned for the affections of that special someone will be able to identify with Mario. Ironically, it's his benign manner that makes him-- as contradictory as it may seem-- so memorable and forgettable at the same time, perhaps depending upon the emotional investment the individual viewer is disposed to make. As the poet Neruda, Noiret gives a notable performance, lending the character the sense of one who has known celebrity, yet is nonetheless still somewhat accessible. And in him you can readily perceive a true poetic nature-- though somewhat self-centered-- which gives the character credibility and makes him real. The supporting cast includes Linda Moretti (Donna Rosa), Renato Scarpa (Telegrapher), Mariano Rigillo (Di Cosimo) and Anna Bonaiuto (Matilde). A romantic film in every sense of the word, 'Il Postino' nevertheless transcends the romantic and takes a somewhat anticlimactic turn that encompasses loyalty and passion to a cause, as well as love. In the end, it's a lyrical, pacific film that seeks to discern the beauty in all things, and certainly makes a statement about the nature of life and love. I rate this one 7/10.",
         "Set in the early 1950s on a small Italian island, there are three central characters in this movie, one real and the other two fictional. The real one is Chilean poet Pablo Neruda (played by French actor Noiret who resembles Neruda quite nicely). Neruda died in 1973, but really did spend several years in exile in Italy, and really is a world-famous poet. In this fictional story, simple and honest, but somewhat dim, 40-something Mario Ruoppolo (Massimo Troisi, who died of heart failure right before the movie was released) is the son of a small time fisherman. Mario really doesn't like the fishing, but has no job. At dad's encouragement, he finds a temporary job as a postman, \"il postino.\" The famous poet is moving into the small village and a man with a bicycle is needed to deliver his mail daily. It pays very little in this poor village, but it is a job. And the friendship that eventually develops between Neruda and Mario changes their lives. The third central character is pretty and sexy 20-something Beatrice (Maria Grazia Cucinotta) who works in her fiercely protective aunt's bar and restaurant. Mario admires her from afar, but Neruda's poetry gives Mario an entry. He tells Neruda later, \"Poetry doesn't belong to those who write it, it is for those who need to use it.\" A very charming and meaningful movie on DVD for those who don't mind reading English subtitles. Or, listen to it in Italian or French. Some of my favorite scenes were the conversations between Mario and the poet when the mail was delivered. SPOILERS FOLLOW. Mario manages to win the affections of Beatrice through his poetry and they marry. The political climate changes in Chile allowing Neruda to return there. Mario is sad that Neruda does not seem to remember them. But he turns up perhaps 6 or 8 years later, meets Mario's young son and Beatrice, but finds that Mario had died in a rumble during a Communist rally in the square. The movie ends with Neruda on the beach where he and Mario had had so many wonderful conversations, reflecting on the beauty of the island and how it influenced his poetry. And the friendship with Mario.",
         "Having just visited the opera version of this film IL POSTINO by Daniel Catan courtesy of PBS Great Performances it is rewarding to return to the original source to honor the nidus for the inspiration for the opera. Directed by Michael Radford the film relates the heartwarming story of Mario (Massimo Troisi), a gentle and simple postman who falls for the beautiful café waitress Beatrice (Maria Grazia Cucinotta) from his village, but is too shy to speak to her. He meets the famous Chilean poet Pablo Neruda (Phillipe Noiret), and, as their friendship develops, the postman's own inner poet awakens. Soon he is able to win the love of Beatrice and even stand up for and express his own beliefs. This is a simple story graced by sensitive performances: of not the actor Massimo Trosi died from heart failure on the last day of production of the film. It is possibly this knowledge of the loss of one of Italy's best comedic actors along with the clarity and transparency of the film's gentle message about love and art that has made it a cult film. At any rate this is a film that belongs in every movie lover's library. Grady Harp"
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cecchi Gori Group Tiger Cinematografica",
         "Penta Film",
         "Esterno Mediterraneo Film"
      ],
      "summaries": [
         "Pablo Neruda, the famous Chilean poet, is exiled to a small island for political reasons. On the island, the unemployed son of a poor fisherman is hired as an extra postman due to the huge increase in mail that this causes. Il Postino is to hand-deliver the celebrity's mail to him. Though poorly educated, the postman learns to love poetry and eventually befriends Neruda. Struggling to grow and express himself more fully, he suddenly falls in love and needs Neruda's help and guidance more than ever.",
         "The life of the fisherman Mario changes dramatically when the famous Chilean writer Pablo Neruda settles on his little Italian island. Living in exile becuase of his political beliefs, Neruda needs a postman to deliver the huge quantities of mail sent to him by his admirers and Mario takes the job since he hates fishing anyway. The two become friends and Neruda helps the shy and clumsy Mario to win the heart of Beatrice, the beautiful waitress at the village's inn, by showing him the beauty and power of poetry.",
         "Simple Italian postman learns to love poetry while delivering mail to a famous poet; he uses this to woo local beauty Beatrice."
      ],
      "budget": 3000000
   },
   "movielensId": 58,
   "movielens": {
      "languages": [
         "Italiano",
         "Español"
      ],
      "releaseDate": "1994-09-22",
      "dvdReleaseDate": "2000-03-14",
      "directors": [
         "Michael Radford",
         "Massimo Troisi"
      ],
      "runtime": 108,
      "movieId": 58,
      "title": "The Postman",
      "mpaa": "",
      "actors": [
         "Philippe Noiret",
         "Massimo Troisi",
         "Maria Grazia Cucinotta",
         "Renato Scarpa",
         "Linda Moretti",
         "Mariano Rigillo",
         "Anna Bonaiuto",
         "Simona Caparrini",
         "Carlo Di Maio",
         "Nando Neri",
         "Vincenzo Di Sauro",
         "Orazio Stracuzzi",
         "Sergio Solli",
         "Alfredo Cozzolino"
      ],
      "imdbMovieId": "0110877",
      "originalTitle": "Il postino",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["0or7hSz-7gc"],
      "plotSummary": "Simple Italian postman learns to love poetry while delivering mail to a famous poet; he uses this to woo local beauty Beatrice.",
      "tmdbMovieId": 11010,
      "avgRating": 3.96503,
      "releaseYear": "1994",
      "numRatings": 13368,
      "posterPath": "/qkq2JfINRQi4Iu9VTMMtQFfmGWZ.jpg"
   }
}