{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0110892",
      "video": false,
      "title": "Princess Caraboo",
      "recommendations": [],
      "backdrop_path": "/4eL45ApKVdB1XtYmHDVjLjdfGGB.jpg",
      "revenue": 3021629,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mr. Worrall",
               "gender": 2,
               "credit_id": "52fe46419251416c9104e66b",
               "name": "Jim Broadbent",
               "profile_path": "/50TV6UKJKjmqdn1GQNuuCIYHLzP.jpg",
               "id": 388,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Princess Caraboo / Mary Baker",
               "gender": 1,
               "credit_id": "52fe46419251416c9104e66f",
               "name": "Phoebe Cates",
               "profile_path": "/zOUE6cOZjFGrIeqidjOfrONj98G.jpg",
               "id": 16171,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Frixos",
               "gender": 2,
               "credit_id": "52fe46419251416c9104e673",
               "name": "Kevin Kline",
               "profile_path": "/u9QXn3fL7zCC2c6HA2vFgH1JxZg.jpg",
               "id": 8945,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Gutch",
               "gender": 2,
               "credit_id": "52fe46419251416c9104e677",
               "name": "Stephen Rea",
               "profile_path": "/taD1NngDbW8cyCuacAT3YaecSEG.jpg",
               "id": 9029,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Professor Wilkinson",
               "gender": 2,
               "credit_id": "52fe46419251416c9104e67b",
               "name": "John Lithgow",
               "profile_path": "/uquz3dZ0fs0lAK57lCXwxaslVkb.jpg",
               "id": 12074,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mrs. Worrall",
               "gender": 1,
               "credit_id": "52fe46419251416c9104e67f",
               "name": "Wendy Hughes",
               "profile_path": "/vB0fDnhvJt48sZDoj3ldhH9NkCc.jpg",
               "id": 42134,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ella",
               "gender": 1,
               "credit_id": "52fe46419251416c9104e683",
               "name": "Kate Ashfield",
               "profile_path": "/5O99Xnb7RaGTSvpaGg4oEtFu2fM.jpg",
               "id": 11110,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe46419251416c9104e689",
            "name": "Michael Austin",
            "profile_path": null,
            "id": 67756,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 0.953824,
      "production_countries": [],
      "id": 37345,
      "vote_count": 6,
      "budget": 0,
      "overview": "Bristol, England, early 19th century. A beautiful young stranger who speaks a weird language is tried for the crime of begging. But when a man claims that he can translate her dialect, it is understood that the woman is a princess from a far away land. She is then welcomed by a family of haughty aristocrats that only wants to heighten their prestige. However, the local reporter is not at all convinced she is what she claims to be and investigates. Is Caraboo really a princess?",
      "similar": [],
      "original_title": "Princess Caraboo",
      "runtime": 97,
      "poster_path": "/wABzjM2MTIcINrIGo2Ap3NIc8g7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1994-09-16",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "She was everything they dreamed of... And nothing they expected.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Austin"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Michael Austin",
         "John Wells"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110892/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MDg5ODgzN15BMl5BanBnXkFtZTcwNzQ1ODEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Phoebe Cates, Jim Broadbent, Wendy Hughes | See full cast and crew »"],
      "reviews": [
         "Phoebe Cates was very cute in the lead role of \"Mary Baker/Princess Cariboo.\" The story was a nice one, too, with no complaints about inappropriate language or behavior. Kevin Kline supplies many of the laughs, at least with me. I preferred him over John Lithgow or Jim Broadbent. This is supposedly based on a true story but I am going to assume they took a lot of liberties with it. Nonetheless, it's a story and a decent for \"the whole family,\" as the cliché goes. However, I think this is mostly appealing to females. I found it pleasant, but more of a \"chick flick\" than a guy's film. Thus, I doubt I would watch it again, especially knowing the surprise ending. I definitely recommend this comedy-drama-romance for people who haven't seen it, and for most people who are not adult males.",
         "This story is set several hundred years ago. A mysterious girl who apparently speaks no English is found begging in the streets. The magistrate wants to put her in jail, but the wife of one of the prominent men of the city wants to take her home to stay with her. Several people are consulted to determine what language the girl speaks, including one language expert played by John Lithgow who is very funny (especially when he tries to speak various languages). The girl doesn't look Asian or Middle Eastern, but if she's faking it (as some suspect) she's doing a good job. She has a tattoo and strange religious customs that provide clues, though the language in which she writes is not known to anyone. It is decided that she is speaking a dialect from Asia. When she does understand what is going on, she comes across as quite charming. Eventually, it is determined that she must be a princess, and her name seems to be Caraboo. Phoebe Cates gave a performance worthy of an Oscar nomination. Whether her character did as well I won't say. You'll just have to watch. I was worried when the movie wasn't funny at first, but the humor came in large doses after a while, and not the usual type of movie humor. This was quite a sophisticated film considering it often tried to be silly, and the costumes and the settings were very nice. The music was magnificent, whether highbrow classical or period music that sounded more like what ordinary people would enjoy. Everything about this movie was well done, and while it's not normally the type of movie I would watch, I enjoyed it.",
         "\"Princess Caraboo\" is a rare breed of film these days -- aimed at adults, but highly respectful of the human soul and therefore safe for all ages. All viewers should find the historical angle fascinating, lovers of whimsical, offbeat humor will be delighted, \"romantics\" will be stirred by the powerful ending...and the ravishing color palette of the sets and costumes will enchant those who crave sheer visual beauty. I personally thought the wonderful ending was handled very well -- it was particularly powerful for being beautifully understated, and did not \"take away\" from the effectiveness of the story. Because it had been foreshadowed (with great subtlety) throughout the movie, it did not arrive as a shock but rather as a fulfillment. I must also put in a good word for the glorious music...another home run. See this film. As others have noted, it will stay with you long afterward.",
         "\"Princess Caraboo\" is about the selfish and fashionable endeavors of the aristocracy of 19th century England, about the role of true charity and from whence it comes, and perhaps most of all it is about humankind's fascination with the story. Although we catch glimpses of, and come to care for, the true character of Caraboo (Cates), the movie's namesake serves mainly as a vessel through which the subject of the film can flow. In this movie a young beggar who speaks no English is taken in by a well-to-do family, and before long they have determined that she is a queen of the Orient. In no time, she is the town's sensation, and if nothing else, living like royalty. Her story attracts the attention of a newspaper man (Mr. Gutch played by Stephen Rea) who, in determinedly trying to discover the truth about Caraboo, falls in love with her. He half hopes the legend is true, half hopes that she's remarkable enough to have made up a story and a language and a manner to fool the very class she'd always been taught to fear and respect. I liked this movie for many reasons. It must be said that it's decidedly predictable, but such is the case in movies that are not so much concerned with plot as with characters. The question is, are the characters worth making a movie about? They are. Cates is delightful as always, and in such a role in which she scarcely speaks, she has the opportunity to shine and to demonstrate (through action and manner) her ability to act the part. Stephen Rea is never to be outdone, and has a genuine ability to pull off passion in whatever role he plays. The British aristocracy is portrayed as largely grotesque and corrupt and mind-numbingly self-absorbed. For my part, I always appreciate a movie that doesn't revolve around romance, and though this movie is touched with pieces of romanticism (definitely a chick-flick in certain ways), it's not about the romance. It is instead about how the story completes us, and how compelling the human imagination really is. Despite the moral values the film purports, Princess Caraboo is not didactic and short on sappiness. I think \"Princess Caraboo\" is a delightful and beautiful tale, and I recommend it to those who prefer the story to the action, and who like to see the rich get theirs.",
         "Princess Caraboo is one of those films for all ages and with a superb cast.During the King George III's court,beggars and all kinds types of vagrancy were punished with death or prison. Many problems and farces were frequent,making people very suspicious about humble people in general and even foreigners.One day, a beautiful and exotic girl is found walking down the road by two farmers. She is dressed as a beggar, but since she has oriental and noble aspect/manners, and only speaks in a strange language,people stay confuse about her Ancestry, taking her to a judge, where they make the conclusion that her name is Caraboo and she is a princess from an exotic country who was kidnapped by pirates. Being the focus of so many curiosity by the English court and also by the King himself,Caraboo is analyzed by a language professor and the maids who think she is a impostor. Would be a real impostor or a true princess? Got to found out watching this film. :)",
         "Any film that brings Phoebe Cates 'out of retirement' is already great in my book. This woman is beautiful and talented and I wish she was in every film instead of Jennifer Anniston. Anyway, this is a delightful little fable that also features Jim Broadbent and Kevin Kline, both great comedians, supporting Phoebe Cates. Supposedly based on a true story, this little unseen gem is perfect for the whole family. Well done!",
         "Wonderful piece and the best role Phoebe Cates has ever had. A sweet and sad tale based on true events, although how close this film is to the truth I do not know. But it is still one of my favorites, I even bought the DVD even though it wasn't in widescreen and had no extras, I just could resist owning this wonderful movie!",
         "First the obvious plus points. Phoebe Cates is charming, and the character actors (notably Kevin Kline and Jim Broadbent) are all splendid fun; plus there's excellent cinematography from Freddie Francis. SPOILER ALERT: The film is based on a true story, in which early in the 19th century provincials around Bristol and the West Country in the UK were excited by the apparent appearance of a pretty, oriental princess who had allegedly been kidnapped by pirates and had made her escape to England, where she came under the protection of the Worralls (Mr Worrall being a magistrate - not a banker as portrayed in the film). Eventually, ten weeks later, she was revealed as a fraud - she was in fact a certain Mary Baker - yet Mrs Worrall, whose sympathy Mary kept even after being unmasked, arranged for her to sail to Philadelphia. The film implies that she had been facing the death penalty for her deception, and that she was to enjoy a new life in America. The truth, more prosaically, is that Mary Baker tired of life in the States after seven years and eventually returned to England in the 1820s, where she died in 1865. All this info can be found at http://en.wikipedia.org/wiki/Princess_Caraboo and at http://www.museumofhoaxes.com/hoax/Hoaxipedia/Princess_Caraboo/ All this rather underlines that the film-makers have taken this curious story and given it a harder spin against the English 'establishment', notably the aristocracy (in the form of the prince regent who is purposely made to look ridiculous, a point underlined as 'Caraboo' is apparently faced with the choice of the noble Irish journalist and the foppish and ridiculously dressed up prince). There's no evidence that the historic Caraboo came within spitting distance of the aristocracy, though the British press of the time gleefully had a field day over the gullibility of the local upper classes of Bristol and the surrounding region. Also I'm afraid the contrast of noble/innocent Irishmen (one of Caraboo's fellow inmates is - surprise, surprise - an innocent Irishman) versus evil English power-that-be (the only sympathetic English person who isn't a servant is Mrs Worrall) is becoming a tired cliché. Pity, because otherwise this is quite an enjoyable film.",
         "A true romance, twisted up in a mystery. Phoebe Cates is luminous and graceful, and the supporting cast is perfectly chosen. Kevin Klines \"I speet in your soup\" line never fails to crack me up. A perfect combination of romance, comedy, and mystery, all in one little known movie. This movie is a must see!",
         "This film is a beauty to watch. The scenery, costumes and music are all superb. The acting led by Stephen Rhea and Phoebe Cates was convincing and the entire supporting cast was excellent. It had elements of \"My Fair Lady\" and Cinderella that made you think you knew where the story was going but the surprise ending was even better than what was hoped for. It is such a pleasure to see a film without violence or bad language. The script was well written and the locales in the west of England were just beautiful. The musical background for the ball scenes was well done and the dancing was charming. This certainly was a \"Feel Good\" movie and I would highly recommend it to anyone who enjoys a romantic escape from the cares of living in the 21st century."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "History",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Ardican Films",
         "Beacon Communications",
         "Longfellow Pictures"
      ],
      "summaries": ["Bristol, England, early 19th century. A beautiful young stranger who speaks a weird language is tried for the crime of begging. But when a man claims that he can translate her dialect, it is understood that the woman is a princess from a far away land. She is then welcomed by a family of haughty aristocrats that only wants to heighten their prestige. However, the local reporter is not at all convinced she is what she claims to be and investigates. Is Caraboo really a princess?"],
      "budget": 0
   },
   "movielensId": 580,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-16",
      "dvdReleaseDate": "2001-04-24",
      "directors": ["Michael Austin"],
      "runtime": 97,
      "movieId": 580,
      "title": "Princess Caraboo",
      "mpaa": "PG",
      "actors": [
         "Jim Broadbent",
         "Phoebe Cates",
         "Kevin Kline",
         "Stephen Rea",
         "John Lithgow",
         "Wendy Hughes",
         "Kate Ashfield"
      ],
      "imdbMovieId": "0110892",
      "originalTitle": "Princess Caraboo",
      "genres": [
         "Comedy",
         "Drama",
         "History",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Bristol, England, early 19th century. A beautiful young stranger who speaks a weird language is tried for the crime of begging. But when a man claims that he can translate her dialect, it is understood that the woman is a princess from a far away land. She is then welcomed by a family of haughty aristocrats that only wants to heighten their prestige. However, the local reporter is not at all convinced she is what she claims to be and investigates. Is Caraboo really a princess?",
      "tmdbMovieId": 37345,
      "avgRating": 3.04659,
      "releaseYear": "1994",
      "numRatings": 601,
      "posterPath": "/wABzjM2MTIcINrIGo2Ap3NIc8g7.jpg"
   }
}