{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "pregnancy",
         "id": 13149
      }],
      "imdb_id": "tt0107642",
      "video": false,
      "title": "Café au Lait",
      "recommendations": [
         164126,
         56959
      ],
      "backdrop_path": "/ucpE8EdykQ4vieUVuXbE6EP4oar.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f81295a5",
               "name": "Vincent Cassel",
               "profile_path": "/yTTyX7xziiMibm0nzcH5z6xxLLv.jpg",
               "id": 1925,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lola",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f81295a9",
               "name": "Julie Mauduech",
               "profile_path": null,
               "id": 35075,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jamal",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f81295ad",
               "name": "Hubert Koundé",
               "profile_path": "/rVgtZ1d6bbbaMFcGVujZEznqQNo.jpg",
               "id": 5418,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Felix",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f81295b1",
               "name": "Mathieu Kassovitz",
               "profile_path": "/3FRBEdKKlxhvPWPt0jzgmSjeHwn.jpg",
               "id": 2406,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4736c3a36847f81295a1",
            "name": "Mathieu Kassovitz",
            "profile_path": "/3FRBEdKKlxhvPWPt0jzgmSjeHwn.jpg",
            "id": 2406,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.128502,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         }
      ],
      "id": 47507,
      "vote_count": 7,
      "budget": 0,
      "overview": "Lola is pregnant. But she does not know who the father is : Jamal, the black muslim, son of diplomats, or Felix, the pennyless jewish messenger. Jamal and Felix meet at Lola's, and the race begins.",
      "similar": [
         10160,
         11862,
         34806,
         95610,
         2758,
         4141,
         88,
         8355,
         810,
         195589,
         11472,
         41210,
         1895,
         9732,
         9659,
         9693,
         206487,
         37135,
         381283,
         929
      ],
      "original_title": "Métisse",
      "runtime": 94,
      "poster_path": "/pyCu1ruuGpITUJ8Y7iinFZNJHJy.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1993-01-01",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mathieu Kassovitz"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Mathieu Kassovitz"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0107642/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMDk4MDMzMl5BMl5BanBnXkFtZTcwMTU4ODgyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Julie Mauduech, Hubert Koundé, Mathieu Kassovitz | See full cast and crew »"],
      "reviews": [
         "Literally and figuratively, one of the freshest, most original French releases of the Ô90s, this liberated and intriguing cultural comedy scores on every front. Felix (Mathieu Kassovitz) is a surly, hapless Jewish bicycle courier. Jamal (Hubert Koundi) is a rich, pampered black Muslim studying at the university. Both young men are involved with Indian beauty Lola (Julie Mauduech) who turns up pregnant. She wants to have the baby, and decides to indefinitely postpone choosing between the two men. When the two find out about each other, they initially clash, but later realize they must cooperate in order to nurse Lola through her pregnancy. They all shack up together, and await the baby. Mathieu Kassovitz has been called the Jewish Spike Lee because of his vibrant, kinetic visual style, and indeed the film seems to owe a bit to SHEÕS GOTTA HAVE IT, but Kassovitz has enough of his own creativity to carry things through in a unique way. He fashions a quirky, realistic, strikingly filmed story, underscored by some undeniably ballsy French hip-hop music. A real winner.",
         "I wanted to make an enthusiastic recommendation for Café Au Lait, otherwise known as Métisse, a 1993 Franco-Belgian production written and directed by Mathieu Kassovitz (who did La Haine (Hate)). Kassovitz mostly explores overlapping ethnic and religious communities in modern France, and in Café Au Lait he throws them all into a very amusing and occasionally serious conflict: Muslim, Jew, Christian, black, white, native-born and immigrant. Lola (played by the adorable Julie Mauduech) is a biracial Christian with two boyfriends, one a slightly thuggish ne'er-do-well hip-hop aficionado from a poor neighborhood (Kassovitz himself, playing the Jew, Félix) and the other a refined, educated diplomat (Hubert Koundé, playing the nominally Muslim Jamal). When Lola is pregnant, she refuses to disclose which one the father is, and it becomes a slightly predictable but very nicely executed relationship comedy. Particularly good are the illustrations of contemporary French life that don't usually appear on screen.",
         "This is one of my all time favorites. It has a quirky charm that belies its deeper exploration of economic and ethnic prejudice, and portrays three people's hard journey through modern France's social system on their way to being an oddball kind of family. Kassovitz does a marvelous turn as both star and director, creating both sympathy and disgust for both male protagonists as they wend their way through a truly comic and complicated emotional roller-coaster. It's one of the few movies that treats a love triangle with a compassionate eye, without becoming mawkishly sentimental or overly clinical. Also features a great early performance by a young Vincent Cassel as the wayward older brother. It's worth a look, esp. if you like Beineix or Jeunet!",
         "I've never posted anything on the IMDb site, but the ridiculous comment/review of the other poster proved to be too much to resist. First off, the word \"Metisse\" is used, in French, to describe a mix of races. The closest translation we have to it is \"Melting pot,\" IE a melting pot of culture. So, my good sir, 0/10 for accuracy. Be forewarned, the movie is French, and portrays itself as thus. Our country, being fundamentally Christian and isolated by two giant oceans from the rest of the world, is quite a bit out of touch with how things are addressed and dealt with. The only formidable foreign presence we have in the States comes from Latin America. Because so many of them immigrate here illegally and come without money, it is quite easy to dismiss them as a second-rate people. This is to say that we don't have to think about them, their beliefs, and their cultural tendencies with any degree of equality quite simply because they \"don't belong here\" (not my belief, but that of the general populace). The rest of the world, Europe specifically, falls outside of this situation. Especially now with such an inarguably formidable foreign population, one simply cannot \"ignore\" them like we do here. Considering they are there legally, have won their way, more or less, into the economic \"game,\" and were actually invited by the European countries to immigrate, you simply can't dismiss them as \"beaners.\" OK, this background information goes to define the situation, and to explain the fact that racial/religious differences are much more prevalent outside of the states. Thus, racial/religious disputes tend to be much more volatile and, well, much more honest. The over saturation of political correctness in the States basically translates into the fact that no one can ever say what they really think/feel, for fear of being called racist or a bigot. Call it a cultural difference, but in terms of establishing compromises, the rest of the world has it right. OK, so go into this movie expecting it to be a bit more intense than your average American flick. The story is charming, as are the characters. The movie tries to explode racial and religious stereotypes, which it does very well. You have the sophisticated, learned character who happens to be black and Muslim. You have the poor, \"ghetto-ish\" type character who is white and Jewish. Finally, you have Christian girl placed somewhere in between. She's from Martinique, rendering her skin color dark, but still much lighter than Jamal's (black guy). Starting to see a pattern? The script, while racially provocative, is brilliantly written, as are the subtleties present throughout the duration of the movie. The monologue at the very end, orated by a french conservative fundamentalist named Le Pen, is the brilliant final stroke that finishes the captivating honesty of the film. ' I reckon that if you can't sit through this film because of the racial and religious slurs, then maybe it's because it's touching on a bit of a sensitive spot, and maybe you're afraid of what great literature/movies do: Force you to rethink your convictions and your cultural beliefs. Watch this film. You wont' be disappointed.",
         "Such a lot of yelling and screaming to so little effect: that's what we have in Métisse, a dry run for La Haine which appeared a couple of years later. Same three actors--Kassovitz, Koundé and Cassel--joined by a gorgeous woman named Julie Mauduech, and the same racial and religious strife that I found so tiresome in the latter film. I don't need to be hit over the head by the dialog, I get it. Lola is pregnant, and keeping Jamal and Felix on tenterhooks as they try to guess who the father is. The comic moments, as the director tried to set them up, are just not funny. Only Julie Mauduech, who reminds me a little of Dorothy Dandridge at times, and Gauguin's Tahitian women too, is worth watching.",
         "While this was a pretty good movie, especially with the amusing foreign euphemisms, it really had a lot of racial and religious stereotyping that could have been avoided. The stereotypes did not add any comedy and seemed irrelevant to the plot."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+",
         "Centre National de la Cinématographie (CNC)",
         "Les Productions Lazennec"
      ],
      "summaries": ["Lola is pregnant. But she does not know who the father is : Jamal, the black muslim, son of diplomats, or Felix, the pennyless jewish messenger. Jamal and Felix meet at Lola's, and the race begins."],
      "budget": 0
   },
   "movielensId": 582,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1993-01-01",
      "dvdReleaseDate": "2005-05-10",
      "directors": ["Mathieu Kassovitz"],
      "runtime": 94,
      "movieId": 582,
      "title": "Café au Lait",
      "mpaa": "",
      "actors": [
         "Vincent Cassel",
         "Julie Mauduech",
         "Hubert Koundé",
         "Mathieu Kassovitz"
      ],
      "imdbMovieId": "0107642",
      "originalTitle": "Métisse",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["iozLJsvKHDs"],
      "plotSummary": "Lola is pregnant. But she does not know who the father is : Jamal, the black muslim, son of diplomats, or Felix, the pennyless jewish messenger. Jamal and Felix meet at Lola's, and the race begins.",
      "tmdbMovieId": 47507,
      "avgRating": 3.35106,
      "releaseYear": "1993",
      "numRatings": 141,
      "posterPath": "/pyCu1ruuGpITUJ8Y7iinFZNJHJy.jpg"
   }
}