{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cia",
            "id": 591
         },
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "drug smuggling",
            "id": 13037
         }
      ],
      "imdb_id": "tt0114706",
      "video": false,
      "title": "Tough and Deadly",
      "recommendations": [
         56172,
         80380,
         40661
      ],
      "backdrop_path": "/oPrfnLXH7oUzcUK1ChWvX99aRSb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Elmo Freech",
               "gender": 2,
               "credit_id": "52fe47ba9251416c91073d21",
               "name": "Roddy Piper",
               "profile_path": "/e5u4cqQS1X0ow9PJdTECIGgm0Ii.jpg",
               "id": 44240,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "John Portland",
               "gender": 2,
               "credit_id": "52fe47ba9251416c91073d25",
               "name": "Billy Blanks",
               "profile_path": "/g9HvNvwPQrTKcbWDAkHXdGmviZz.jpg",
               "id": 128191,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Agent Norton",
               "gender": 2,
               "credit_id": "52fe47ba9251416c91073d29",
               "name": "Richard Norton",
               "profile_path": "/yrNyqJ9vhTdtgKhlGhPMtEOySLy.jpg",
               "id": 66055,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Winston Briggers",
               "gender": 2,
               "credit_id": "52fe47ba9251416c91073d31",
               "name": "James Karen",
               "profile_path": "/1w2g6IbGpDsEnze2QubIGFKlZQt.jpg",
               "id": 14852,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Cowboy",
               "gender": 2,
               "credit_id": "5457e593c3a3683993000047",
               "name": "Gary Kasper",
               "profile_path": "/6FDArv288QpZRXZa8PB3mMaUSFi.jpg",
               "id": 62312,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "William Helms",
               "gender": 0,
               "credit_id": "57b301be9251414e4d004d14",
               "name": "Charles Kahlenberg",
               "profile_path": null,
               "id": 1219474,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "Milan",
               "gender": 2,
               "credit_id": "58f1a80bc3a3682ea7001eea",
               "name": "Sal Landi",
               "profile_path": "/vbPLp5EYHK2gYmHjXCOaR0TznA0.jpg",
               "id": 77150,
               "order": 7
            },
            {
               "cast_id": 1010,
               "character": "Trekkler",
               "gender": 2,
               "credit_id": "58f1a8259251412fb5001f79",
               "name": "Phil Morris",
               "profile_path": "/k4qdKVAiWQ9lhttUviatyRBFWdO.jpg",
               "id": 56853,
               "order": 8
            },
            {
               "cast_id": 1011,
               "character": "Maureen Peak",
               "gender": 0,
               "credit_id": "58f1a82f9251412ff4001f28",
               "name": "Lisa Stahl",
               "profile_path": null,
               "id": 1541696,
               "order": 9
            },
            {
               "cast_id": 1012,
               "character": "Carl Weldon (as Brent Van Hoffman)",
               "gender": 2,
               "credit_id": "58f1a8459251412fa9001f9e",
               "name": "Brant von Hoffman",
               "profile_path": "/hbHlNyKhCwAZ6We866OBN86Ibgv.jpg",
               "id": 57358,
               "order": 10
            },
            {
               "cast_id": 1013,
               "character": "Prostitute",
               "gender": 1,
               "credit_id": "58f1a84e9251412fc7001f8e",
               "name": "Lisa Comshaw",
               "profile_path": "/982CRJ8jOkxJlZTjibj5VBFrfbQ.jpg",
               "id": 104609,
               "order": 11
            },
            {
               "cast_id": 1014,
               "character": "Briggers' Man",
               "gender": 2,
               "credit_id": "58f1a85fc3a3682ede001ede",
               "name": "Christopher Kriesa",
               "profile_path": "/x63NKyzA7smylyHk18T4HZSMRS7.jpg",
               "id": 1297931,
               "order": 12
            },
            {
               "cast_id": 1015,
               "character": "Alpha",
               "gender": 1,
               "credit_id": "58f1a870c3a3682ede001ee4",
               "name": "Janet Jones",
               "profile_path": "/vtSxLHwrv0GHWFoVuVePrluMOXM.jpg",
               "id": 19257,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47ba9251416c91073d1d",
               "name": "Steve Cohen",
               "profile_path": null,
               "id": 589306,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5457e5770e0a26115b000032",
               "name": "Otto C. Pozzo",
               "profile_path": null,
               "id": 1381413,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.66319,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 80350,
      "vote_count": 6,
      "budget": 0,
      "overview": "A private eye helps an amnesiac CIA agent elude mobsters who don't want him to regain his memory of their drug operation.",
      "similar": [
         77,
         1903,
         137094,
         346685,
         3132,
         954,
         2501,
         47964,
         68734,
         955,
         146216,
         254904,
         72570,
         1247,
         11808,
         9331,
         11284,
         2502,
         1669,
         38
      ],
      "original_title": "Tough and Deadly",
      "runtime": 92,
      "poster_path": "/2NZiMx5PhtEgKFRnVzGkIWFdYRZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Shapiro-Glickenhaus Entertainment",
         "id": 16636,
         "origin_country": ""
      }],
      "release_date": "1995-02-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Experts with fists and guns and not afraid to use them.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Cohen"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Steve Cohen",
         "Otto C. Pozzo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114706/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5OTQxMjc5NF5BMl5BanBnXkFtZTcwOTY0NTQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Billy Blanks, Roddy Piper, Richard Norton | See full cast and crew »"],
      "reviews": [
         "This is a good movie. Not as good as BACK IN ACTION, but pretty good none the less. There is a good amount of action to keep fans happy. The movie also benefits from how well Piper and Blanks work off each other. Richard Norton is underused though. He should have been the main villain.",
         "Following an assassination attempt, a CIA Agent (Billy Blanks) ends up in a hospital with amnesia. Sensing an opportunity on a possible bounty, skip tracer Elmo Freech (Roddy Piper) tries to get the mystery man's fingerprints, but ends up stopping a second murder attempt instead. Freech then takes the in the dark agent under his wing and dubs him \"John Portland.\" One brief training session later, John is back to kicking ass, which is helpful as a group of assassins (led by Richard Norton) are still out to get him while the head of the CIA (James Karen) wonders what happened to his top secret agent. This is an enjoyable mid-90s action vehicle. Blanks may not be much of an actor, but he makes up for it with his skillful martial arts. The highlight of the film is a midway showdown with Norton, a man as equally talented in the fight game. It is a shame Blanks never got bigger exposure from the 8 or so DTV films he did, but I'm sure Tae-Bo has compensated him well. What is really interesting is the great chemistry between Blanks and Piper. This was their second feature together (following 1994's BACK IN ACTION) and the two have a great rapport.",
         "I bought this movie for two bucks because I wanted to see Billy Blanks in a movie where he has to show off his acting skills. I had seen parts of this movie before on cable, but when I watched it, it was actually entertaining. It had good fight scenes, including one of my new favorites. It's when Billy Blanks kicks a bad guy out of window of a moving car and the guy falls in front of the car and under the wheels (they actually show this, only they use a dummy). This movie is worth seeing once. Check it out.",
         "I caught this movie on cable today and was fairly impressed. Not with the action or special effects, but how well Piper and Banks played off of each other. Piper was more believable in his character than Banks, but Banks held his own. The action was ok, but nothing to get excited about. This actually turned out to be a really good buddy movie with a good mix of action, drama and a fair mix of humor. This is one that is worth watching just for the heck of it. Remember...it's not an A movie...it's a B movie at best.",
         "Most people know Mr Blanks as that guy who did Tae Bo, the one with the crazy hair do and leg warmers... But really, before that, we had some fantastically fun martial arts movies such as this one, his second pairing with Roddy Piper. Tough and Deadly is a rare mid nineties, B-movie, martial arts action classic, that isn't dripping with bad costume design albeit one choice of such for Mr Blanks during a training scene. It also isn't polluted with overly bad acting like most in the genre, making this one a highly entertaining piece of film that should have landed a trilogy for the pair! In a nutshell - More comfortable with each other from their Back In Action project, the stars bond well and pass off their characters with ease, delivering plenty of humour and kick ass fight scenes that come fast and hard! In my opinion - I like Billy Blanks. I like him more as a good guy than as a baddie. I also like Roddy Piper, and I love when these guys get together! Back In Action was a lot of fun, but this follow- up is a much stronger affair, both with characters and fight scenes. It really is unfortunate that we didn't see more films with these guys together, because they shine just as bright as any A-list buddy team up such as that of Lethal Weapon and Rush Hour. Roddy just has a particular knack in charming his way through most films. Although not the greatest actor in the world, he comes across very natural and often funny. Billy takes a different route though... As a bad guy, Billy can be loud and over the top, but in these pairings he really shines as the good guy. And I really enjoy it when he is. In the action department, he really stands tall, with some amazing moves that hints on a martial arts star that should have been bigger. Who would have thought his workout videos would have been the cause of all that!? Tough and Deadly is a charming action flick, that has the right amount of laughs, drama, and kick ass action that is also heightened by an extended cameo from the amazing Richard Norton who gets a few scuffles but is criminally underused. Apart from that, there's not much to complain about... Check it out!",
         "Elmo Freech (Piper) is a rough-and-tumble Private Investigator and ex-cop who does things his way. He ends up teaming up with a mysterious man who has lost his memory, John Portland (Blanks). But Portland appears to be a trained fighter, and together the two men - who certainly don't always see eye to eye - get deeper and deeper into a conspiracy that goes all the way to the top. They're going to have to work together and fight to get to the truth. Can they do it? Tough and Deadly is classic 90's fun at its best. One of its main strengths is its healthy dose of humor. So many movies out there, DTV actioners included, take themselves so seriously - finally, here's a movie with the guts to not take itself so seriously, but also has some killer stunts and fights, which are taken seriously. So it strikes a near-perfect balance of tongue-in-cheek, well, cheekiness, with some nice bone-crunching action. It's a surprisingly rare mix, so our hats go off to the filmmakers on this win. The movie really gives you what you want: on top of the humor, the stunts, fights, etc., it has a very good pace and nice energy. You can actually SEE what's going on. Nothing is shrouded in shadow. Considering there's a barfight AND a poolhall fight, as well as a (completely inexplicable) training sequence followed by a montage, Tough and Deadly truly has it all. Let's not forget the Billy Blanks and Richard Norton fight, which gets the movie off to an engaging beginning. There's also the classic \"I want to listen to country!\" \"I want to listen to rap!\" CD player confrontation between Freech and Portland. Just the names of the characters are insane - Elmo Freech, Winston Briggers (James Karen), Trekkler, and Freech's assistant Maureen Peek (Stahl). Yet, the great Richard Norton plays...Agent Norton. Does he feel cheated that he didn't get a wacky name? At least he's on board. That's all that counts. Naturally, it all ends in the time-honored abandoned warehouse. Also Elmo Freech has a poster in his house that simply says \"Pasta Sauce\". For his interior decoration skills alone, you should see Tough and Deadly. It's easy to see why Piper and Blanks teamed up again after Back In Action (1993). Piper's charm and Blanks' woodenness make an excellent combination. It's sad that they didn't team up on any more movies after this. But at least we have two. While debate continues to rage as to who - John Portland or Elmo Freech - is Tough and who is Deadly - there's certainly no shortage of face-punching action in this prime example of what the 90's Direct-To-Video era could do.",
         "Incredibly boring movie about a top secret CIA agent (Billy Blanks) who loses his memory. He is befriended by an ex-cop, played by former wrestler Rowdy Roddy Piper. Together they get in fights about every three minutes. Blanks discovers he still has the reflexes of a killin' machine, even though he doesn't know why. Sound intriguing? It's not. This is the kind of movie they used to put on the second or even third bill of a drive in movie. The story and direction would chase the customers out--or just played as background to couples making out in their cars. It's just fight after fight after fight. I really enjoyed Piper in \"They Live\", shot just a few years before this, but he's given very little of interest to do here, and Billy Blanks, as fine an athlete as he is, is not remotely interesting as an actor."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Shapiro-Glickenhaus Entertainment"],
      "summaries": ["Elmo Freech is a private investigator and was contracted by John Portland, a CIA agent who suffers amnesia, in oder to reveale a dubious case of drug smuggling in which are involved big fishes of the CIA and from Washington."],
      "budget": 0
   },
   "movielensId": 591,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-02-14",
      "dvdReleaseDate": "2003-10-20",
      "directors": ["Steve Cohen"],
      "runtime": 92,
      "movieId": 591,
      "title": "Tough and Deadly",
      "mpaa": "R",
      "actors": [
         "Roddy Piper",
         "Billy Blanks",
         "Richard Norton",
         "James Karen",
         "Gary Kasper",
         "Charles Kahlenberg",
         "Sal Landi",
         "Phil Morris",
         "Lisa Stahl",
         "Brant von Hoffman",
         "Lisa Comshaw",
         "Christopher Kriesa",
         "Janet Jones"
      ],
      "imdbMovieId": "0114706",
      "originalTitle": "Tough and Deadly",
      "genres": [
         "Thriller",
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["VEvGlp8JELg"],
      "plotSummary": "A private eye helps an amnesiac CIA agent elude mobsters who don't want him to regain his memory of their drug operation.",
      "tmdbMovieId": 80350,
      "avgRating": 2.06944,
      "releaseYear": "1995",
      "numRatings": 36,
      "posterPath": "/2NZiMx5PhtEgKFRnVzGkIWFdYRZ.jpg"
   }
}