{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "music teacher",
            "id": 2176
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "apartment",
            "id": 33632
         }
      ],
      "imdb_id": "tt0110719",
      "video": false,
      "title": "Window to Paris",
      "recommendations": [
         79216,
         72199,
         127608,
         165095,
         273126,
         72204,
         270393,
         129229,
         6029,
         160046,
         195065,
         67958,
         213321,
         90001,
         27940,
         43685,
         63573,
         27942,
         42651,
         20879
      ],
      "backdrop_path": "/2x3aw7BiD51k8Y8enCFEO2OyZmS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Gorokhov",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56d9",
               "name": "Viktor Mikhaylov",
               "profile_path": "/ifR2h2jnwLBU1WaV7VV8ul0Zt4t.jpg",
               "id": 125341,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Vera",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56dd",
               "name": "Nina Usatova",
               "profile_path": "/jJsXjjShEUrYBh3wRWVqbcoUKU.jpg",
               "id": 93548,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nicole",
               "gender": 1,
               "credit_id": "52fe45b2c3a36847f80d56e1",
               "name": "Agnès Soral",
               "profile_path": "/4Go0JWZLjDvOGyCn1d8jcUUzaS3.jpg",
               "id": 34637,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Nikolai Chizhov",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56f1",
               "name": "Sergei Dreiden",
               "profile_path": "/seghK4M9wfL0FqoelKddi6Og9dM.jpg",
               "id": 107761,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Mother-in-law of Gorokhov",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56f9",
               "name": "Kira Krejlis-Petrova",
               "profile_path": "/lny0hABYUlglOJrfQwWCzgutMOo.jpg",
               "id": 582991,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Kuzmich",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d5701",
               "name": "Viktor Gogolev",
               "profile_path": "/wtsrcOg5dPnbJBYm8RlghS0dq1Q.jpg",
               "id": 628267,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Head of the \"Business Lyceum\"",
               "gender": 1,
               "credit_id": "52fe45b2c3a36847f80d5725",
               "name": "Elena Drapeko",
               "profile_path": "/pwDYQcioASiepgc9upLDnuGJE4R.jpg",
               "id": 1004788,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Gulyaev",
               "gender": 2,
               "credit_id": "52fe45b2c3a36847f80d5721",
               "name": "Andrey Urgant",
               "profile_path": "/83XWaJAdHiMaC8ap1pqtJ1v49Zs.jpg",
               "id": 240471,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Monsieur Prevost",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d5709",
               "name": "Jean Rupert",
               "profile_path": "/kXZxRiig4XHilgvjcwk4S45rIU7.jpg",
               "id": 935429,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Daughter of Gorokhov",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56fd",
               "name": "Natalya Ipatova",
               "profile_path": null,
               "id": 935426,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Maria Olegovna, Old woman",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d5705",
               "name": "Tamara Timofeyeva",
               "profile_path": null,
               "id": 935427,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Lady in black",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d570d",
               "name": "Malka Ribowska",
               "profile_path": null,
               "id": 38890,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Construction company agent",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d5711",
               "name": "Bernard Cassus-Soulanis",
               "profile_path": null,
               "id": 935430,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Ivanov - Member of the Regional Party Committee",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d5715",
               "name": "Vladimir Kaliche",
               "profile_path": null,
               "id": 935431,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Petrov, Trumpeter",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d5719",
               "name": "Aleksei Zalivalov",
               "profile_path": null,
               "id": 545613,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d571d",
               "name": "Aleksei Kozodayev",
               "profile_path": null,
               "id": 935432,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56d5",
               "name": "Yuri Mamin",
               "profile_path": null,
               "id": 125340,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56e7",
               "name": "Lavranti Aimrachvilli",
               "profile_path": null,
               "id": 125343,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a36847f80d56ed",
               "name": "Guy Séligmann",
               "profile_path": null,
               "id": 125344,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "546e2c16c3a36817e90002e2",
               "name": "Guy Séligmann",
               "profile_path": null,
               "id": 125344,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "54be8208c3a3686c6100cdbe",
               "name": "Yuri Mamin",
               "profile_path": null,
               "id": 125340,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54be821392514148b000aa10",
               "name": "Arkadiy Tigay",
               "profile_path": null,
               "id": 1076757,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54be821cc3a3681421009e8d",
               "name": "Vladimir Vardunas",
               "profile_path": null,
               "id": 1265114,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 0.955998,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "RU",
            "name": "Russia"
         }
      ],
      "id": 41043,
      "vote_count": 7,
      "budget": 0,
      "overview": "Nikolai (played by Sergei Dontsov) has been fired from his job as a music teacher and has to live in the gym until he finds a place to stay. Finally, he gets a communal room in the apartment of Gorokhov (Victor Mikhalkov). The room's previous inhabitant, an old lady, has died a year ago, and yet her cat, Maxi, is still in the locked room, healthy and fat. Soon, Nikolai and his neighbours discover the mystery: there is a window to Paris in the room. That's when the comedy begins - will the Russians be able to cope with the temptation to profit from the discovery?",
      "similar": [
         52449,
         8841,
         400928,
         10112,
         233063,
         1278,
         2062,
         437670,
         1643,
         707,
         282296,
         9276,
         283227,
         10137,
         11224,
         16859,
         16869,
         1597,
         34584,
         817
      ],
      "original_title": "Окно в Париж",
      "runtime": 87,
      "poster_path": "/m91eOM6qDDVrUkBjuWHeZsPBOPD.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fontaine Sarl",
            "id": 38963,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sodaperaga Productions",
            "id": 7399,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 23647,
            "origin_country": ""
         }
      ],
      "release_date": "1993-12-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yuri Mamin"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Vyacheslav Leykin",
         "Yuri Mamin"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0110719/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5OTAxNjg2NV5BMl5BanBnXkFtZTcwNjQwNDMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sergey Dreyden, Agnès Soral, Viktor Mikhaylov | See full cast and crew »"],
      "reviews": [
         "I thought that i wrote a comment on this movie before, but i can't find it on here. anyway, i am writing it again. I accidentally found this movie from my college's library collections. It was free to watch, so why not. I am certainly glad that I watched it. I love this movie. I have seen a few Russian movies before, most of them have serious topics. I am surprised that this was one a good comedy. I had a great laugh while watching it. and this is a movie that i want to buy. this thing is so funny. and they are not just silly funny, those plots were very original, and well thought, so they don't seem to be silly at all. I am surprised that this movie didn't attract many viewers. This is a classic that you can watch it over and over. those actors were also very authentic, their acting are real, not faked. if you haven't watched it, go get a copy soon! definitely recommended.",
         "I ran across this film recently on the Independent Film Channel ... by accident. But after watching only a few minutes, I was captivated by the plot, by the scenery, the music ... it was pure cinematic magic. Somewhat comedic and lighthearted in nature, it is also a telling drama of how some people can give way to excessive temptation and greed. It's a fascinating way to explore the human soul. I recommend it for anyone who loves a great flight of fantasy, particularly in the ever- increasingly-cynical 1990s.",
         "A funny and scathing critique of Russian society and culture during the transition from communism, OKNO V PARIZH also shows the west in an unfavorable light. A group of Russians living in St. Petersburg (a.k.a. Peter the Great's \"window on the west\") find a magic portal that instantly transports them to Paris. Mamin's film is truly hilarious, and just \"weird\" enough constantly keep even the jaded film viewer on his toes. The songs, the dream sequences, and the deliciously disgusting fringes of society from both cultures mingle to create a memorable and meaningful film. Anyone trying to understand the shift in Russian cultural sentiments since the fall of the USSR should begin here.",
         "I saw this movie in a Russian cinema class, and I knew I would like it as soon as the kids started dancing. The whole thing is very funny - although it has a quirky sense of humor different from what most of us are used to - and if you're willing to take the premise with a grain of salt, you are in for a treat. Another thing - if you were turned off by the trailer or the premise, don't give up on it. I wouldn't have watched the movie except that it was for class. I'm very glad I did, and I recommend it to anyone who is interested in Russia, foreign films, something completely different, or simply a good story. And if you like \"Window to Paris,\" I also highly recommend \"Black Cat, White Cat,\" (Kusturica) another excellent quirky Eastern European (Serbia) comedy.",
         "My first Mamin film, saw it on IFC long ago, and LOVED it. It seemed absolutely artistic, original, fun and hilarious. Not a moment in the film let me down or made me bored, and i was laughing a lot or had a smile on my face. I mean this movie is truly funny. But here's the catch: it's also very artistic and creative - if you don't know Yuri Mamin (probably, sadly, because so many of his GREAT films aren't available here) he has a very original style like no one else's, and for me this isn't even my favorite film of his (right now it's the insane (\"Saideburns/Bakenbardy\"). Also, i have to say as a Russian, this film is great because you really do see what Russians are like. And this is possible because this is a true Russian film to me, NOT a foreign film trying to be American or trying to appeal; Mamin did not sell out (nor has he since, Gorko (1998) was as good if not better. This is true Russian style filmaking that came out of communist Social realism. If you liked this film, i think you have a very high chance of loving Mamin's other films, in fact i like quite a few of them more than this one. I guess this one is his most accessible film. A similar film is Fountain, taking place 6 years before during perestroika, it has the same actor in the leading role, and more of Mamin's regulars who you will recognize from Window to Paris; this one has one supernatural twist in the end but is mostly a realistic comedy, a great one. Viva Mamin, hopefully Criterion will hook all of his movies up one day, he's still working, and his catalog is so great! See any of his films if you can.",
         "This was a wonderful little film that truly was creative and fun--something you see all too seldom in movies. The film begins in Russia just after the fall of the Communist government. As a result, society seems to be in chaos and life has yet to improve now that the old regime is gone. Dirty cities, crime and lack of housing still plague the poor residents of St. Petersburg. Into this scene of bleakness and uncertainty comes an idealistic music teacher. He is among those without a home and he FINALLY gets a letter from the government that tells him he has a tiny room in a nearby flat. When he arrives, the place is a mess but the people seem friendly enough so they all have a lovely party. In the middle of the night, they are awakened by an old lady walking out of the giant wardrobe in the room (I was half expecting Lucy and the other kids from THE LION, THE WITCH AND THE WARDROBE to come out, but they didn't). They are too shocked to do anything at first but decide soon to investigate. Instead of just being a clothes closet, the wardrobe opens into Paris! How the residents of the flat respond to this magical gateway is really intriguing. Some, like the music teacher, are thrilled and in awe. Most of the others are more pragmatic and are mostly concerned with looting everything from Paris before the gateway closes once and for all! These Russian thieves are awful people--greedy, coarse and crude but down deep---VERY DEEP--are hearts of gold. I like how this is a metaphor for the nation now on the brink of Capitalism. At first, they run amok grabbing everything they can and only later do they reveal some depth--but mostly they act much like guests on THE JERRY SPRINGER SHOW! The film has many twists and turns and is both funny and mesmerizing. About the only negative is that due to some harsh language and a nude scene (albeit, a very funny one), this is not a film for kids. This is a real shame, as with some very minor editing, this could have been a great family film.",
         "This is one peace of art! If you like comedy you should watch this! Here comes a funny moment from the movie: \"spoiler\" Nikolai and Goroshkov are walking together in Paris for the first time. They are visiting the local market. And Goroshkov goes: -\"Look Nikolai, how much food they have! Look! One-two-three-ten-thirty-fifty-hundred kinds of meat! But if ask for a tiny-tiny peace, just for the taste, they won't give you. French are very greedy!\" Then Goroshkov takes Nikolai to a TV-shop...Goroshkov: \"Tell me, who needs all these televisions? Look at this monster here, for example!\" Goroshkov points a finger at the \"monster\"-TV and goes: \"And this motherfu*ker...he is supposed to be digging a ditch, but no, he's on TV...wait a minute... that's ME! hahah!\" Wanna laugh? Watch the movie, you won't regret!",
         "Warning: perhaps a spoiler here. I have to agree that Okno v Parizh is an unexpectedly delightful comedy, though the premise of the film might at first glance seem a bit ridiculous... a magic window that takes a group of Russians directly to Paris? Yes, exactly, that sounds a bit ridiculous, but it's a load of fun, too. And this group of inter-window travellers soon embarks on an adventure where they must (for a moment) brave (or happily succumb to) the delicious terrors of the temptations of capitalism... Okno v Parizh is hysterical but also makes some serious points if you look below the surface. In fact, it is amazing how well the film manages to keep a light-hearted tone throughout, despite the obvious dangers the film portrays within St. Petersburg, where the group of Russians must return and where an unsuspecting French woman is transported through the magic window... Overall, I give this funny film high marks: 8/10.",
         "I originally saw this movie as a Blockbuster VHS rental. That was quite some time ago, but still remembered it. Blockbuster doesn't have it anymore. Netflix didn't have it and there weren't many copies on the web -- only a few spendy VHS copies. Recently did finally find it available in DVD form on eBay for a reasonable price (in PAL format, but our DVD player will play PAL discs on our NTSC TV). Wife and I both enjoyed it. The style of the movie is a bit strong, and many if not most of the parts are rather strongly over-played as if amateurs were making it(especially the kids), but it's not bothersome. The contrasts of societies are accentuated in the overplay. There is a bit of political preaching in terms of saying that the young in Russia shouldn't try to escape their not-so-great life but instead should at least try to make things better first. But that's not dominant. It's fairly humorous most of the time. Some downplaying of the west commented upon by others isn't that at all IMO, I take it as a comment about expectations of the Russian characters. At least when taken from my western viewpoint. Perhaps it's a downplay of the west from a Russian viewpoint (which it is literally by the characters saying it). I can't say how literally true to the film the English subtitles are, but I can say that the subtitles were done very well, full of English idioms as if done by a native English speaker -- complete with \"colorful\" language.",
         "What a marvelous and multi-faceted film! Accurately but humorously portrays Communist Russia's class struggle and communal life. Juxtaposes an educated musician against blue-collar \"bloodsucking\" neighbors, as well as bleak Leningrad against the colorful splendors of Paris. A wonderful metaphor for the utopia many dream of finding: our chances of reaching it are limited, and when the opportunity presents itself, some throw themselves fearlessly into it, others hesitate until it is too late, while still others fail to recognize that they're already there. One of the few films that can be viewed hundreds of times and never grow old."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Fontaine Sarl",
         "La Sept Cinéma",
         "Sodaperaga Productions"
      ],
      "summaries": [
         "Nikolai (played by Sergei Dontsov) has been fired from his job as a music teacher and has to live in the gym until he finds a place to stay. Finally, he gets a communal room in the apartment of Gorokhov (Victor Mikhalkov). The room's previous inhabitant, an old lady, has died a year ago, and yet her cat, Maxi, is still in the locked room, healthy and fat. Soon, Nikolai and his neighbours discover the mystery: there is a window to Paris in the room. That's when the comedy begins - will the Russians be able to cope with the temptation to profit from the discovery?",
         "Pietroburgo. Nikolai, insegnante di estetica scopre, in compagnia degli operai con cui coabita, che attraverso una finestra dei tetti di casa si arriva a....Parigi ! Le incursioni dei russi nella città delle luci e della ricchezza provoca scompiglio in famiglia, anche quando la dirimpettaia parigina, attraversando per sbaglio la porta, si ritrova a....Pietroburgo, in vicoli angusti e desolanti. Nell'animo di tutti si compone un difficile dilemma......"
      ],
      "budget": 0
   },
   "movielensId": 598,
   "movielens": {
      "languages": [
         "Français",
         "Pусский"
      ],
      "releaseDate": "1993-12-01",
      "dvdReleaseDate": null,
      "directors": ["Yuri Mamin"],
      "runtime": 87,
      "movieId": 598,
      "title": "Window to Paris",
      "mpaa": "",
      "actors": [
         "Viktor Mikhaylov",
         "Nina Usatova",
         "Agnès Soral",
         "Sergei Dreiden",
         "Kira Krejlis-Petrova",
         "Viktor Gogolev",
         "Elena Drapeko",
         "Andrey Urgant",
         "Jean Rupert",
         "Natalya Ipatova",
         "Tamara Timofeyeva",
         "Malka Ribowska",
         "Bernard Cassus-Soulanis",
         "Vladimir Kaliche",
         "Aleksei Zalivalov",
         "Aleksei Kozodayev"
      ],
      "imdbMovieId": "0110719",
      "originalTitle": "Окно в Париж",
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["S-fO805VDqI"],
      "plotSummary": "Nikolai (played by Sergei Dontsov) has been fired from his job as a music teacher and has to live in the gym until he finds a place to stay. Finally, he gets a communal room in the apartment of Gorokhov (Victor Mikhalkov). The room's previous inhabitant, an old lady, has died a year ago, and yet her cat, Maxi, is still in the locked room, healthy and fat. Soon, Nikolai and his neighbours discover the mystery: there is a window to Paris in the room. That's when the comedy begins - will the Russians be able to cope with the temptation to profit from the discovery?",
      "tmdbMovieId": 41043,
      "avgRating": 3.62722,
      "releaseYear": "1993",
      "numRatings": 169,
      "posterPath": "/m91eOM6qDDVrUkBjuWHeZsPBOPD.jpg"
   }
}