{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cupboard",
            "id": 1990
         },
         {
            "name": "games",
            "id": 6186
         },
         {
            "name": "puppet",
            "id": 6300
         },
         {
            "name": "parallel world",
            "id": 33465
         },
         {
            "name": "toy comes to life",
            "id": 187065
         }
      ],
      "imdb_id": "tt0113419",
      "video": false,
      "title": "The Indian in the Cupboard",
      "recommendations": [
         9446,
         6878,
         9449,
         13225,
         21845,
         15139,
         10166,
         11158,
         14817,
         18975,
         34636,
         26441,
         15489,
         8989,
         11870,
         18935,
         9612,
         12139,
         10603,
         45325
      ],
      "backdrop_path": "/ubZ8SVRM9tk06SSPfzXiIhLjo4S.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Omri",
               "gender": 2,
               "credit_id": "52fe44309251416c7502bdb5",
               "name": "Hal Scardino",
               "profile_path": "/q8TX9vJfLSzYDztSIDmz1ao002t.jpg",
               "id": 69301,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Little Bear",
               "gender": 2,
               "credit_id": "52fe44309251416c7502bdb9",
               "name": "Litefoot",
               "profile_path": "/6MmZFvtuY2Vmnt6lDsC7hw8lk4X.jpg",
               "id": 69302,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe44309251416c7502bdbd",
               "name": "Lindsay Crouse",
               "profile_path": "/mAZTWVbtfmC0R4R6TZ3rjhJSW0b.jpg",
               "id": 32225,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Victor",
               "gender": 2,
               "credit_id": "52fe44309251416c7502bdc1",
               "name": "Richard Jenkins",
               "profile_path": "/iz61iPIgNUp0yk48bRNjEJ5GHO4.jpg",
               "id": 28633,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Patrick",
               "gender": 0,
               "credit_id": "536fecdfc3a36839c1004ea5",
               "name": "Rishi Bhat",
               "profile_path": null,
               "id": 1318612,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "52fe44309251416c7502bde9",
               "name": "Steve Coogan",
               "profile_path": "/ljhsNmGQQrgeBj64x5uL27U6UqY.jpg",
               "id": 4581,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Boone",
               "gender": 2,
               "credit_id": "536fec980e0a2647db012e19",
               "name": "David Keith",
               "profile_path": "/v1b7NQqJifk7xgt9HOGh0lvfkbP.jpg",
               "id": 18181,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "536fececc3a368124a00ee18",
               "name": "Sakina Jaffrey",
               "profile_path": "/cljkdHCxyQm9mpm1Dijp3eOVHJs.jpg",
               "id": 34200,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "52fe44309251416c7502bded",
               "name": "Vincent Kartheiser",
               "profile_path": "/y2i2epgCOwfMyC5FclcF3IU8Iy3.jpg",
               "id": 52646,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "52fe44309251416c7502bdf1",
               "name": "Nestor Serrano",
               "profile_path": "/dZ44mFqSLqVqBmh4XqFRqqfa70N.jpg",
               "id": 14331,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Special Vocal Effects (voice)",
               "gender": 2,
               "credit_id": "5ab7225d0e0a261fee016557",
               "name": "Frank Welker",
               "profile_path": "/b3gImArbw13mMKJIe9leFc9YYb7.jpg",
               "id": 15831,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44309251416c7502bdc7",
               "name": "Frank Oz",
               "profile_path": "/aLH5bYwMIlVxCe4rIDaEsVJqDKn.jpg",
               "id": 7908,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44309251416c7502bdcd",
               "name": "Kathleen Kennedy",
               "profile_path": "/6rGtk7OdbkO2QDM2OQxt9Blww3O.jpg",
               "id": 489,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44309251416c7502bdd3",
               "name": "Melissa Mathison",
               "profile_path": null,
               "id": 9964,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44309251416c7502bdd9",
               "name": "Russell Carpenter",
               "profile_path": "/zhcM8RBTC8goTfJT3TbraeO1x5n.jpg",
               "id": 8523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44309251416c7502bddf",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44309251416c7502bde5",
               "name": "Ian Crafford",
               "profile_path": null,
               "id": 10935,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "558dc7799251415ce000075b",
               "name": "Jane Startz",
               "profile_path": null,
               "id": 1246837,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "558dc7a69251415be8000ebf",
               "name": "Frank Marshall",
               "profile_path": "/dVPOD85wQ1Xscpe3DOVQ1I59IIF.jpg",
               "id": 664,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "558dc7d5c3a36843cf002ee3",
               "name": "Kate Kennedy",
               "profile_path": null,
               "id": 1176290,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "558dc7efc3a3685a310004ef",
               "name": "Margery Simkin",
               "profile_path": "/dCyAWZGEaW1OlGgh5ALiqGfsbpb.jpg",
               "id": 6347,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 6.686242,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11359,
      "vote_count": 173,
      "budget": 45000000,
      "overview": "A nine-year-old boy gets a plastic Indian and a cupboard for his birthday and finds himself involved in adventure when the Indian comes to life and befriends him.",
      "similar": [
         11249,
         11899,
         10895,
         11932,
         11187,
         250546,
         14836,
         862,
         863,
         411,
         927,
         10193,
         13597,
         72105,
         129,
         585,
         492,
         101299,
         62211,
         339964
      ],
      "original_title": "The Indian in the Cupboard",
      "runtime": 96,
      "poster_path": "/l16BtfILyWxYwSqzofL3V1rMSwe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "The Kennedy/Marshall Company",
            "id": 862,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-07-14",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Frank Oz"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Lynne Reid Banks",
         "Melissa Mathison"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113419/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0NjQ5NzQxMl5BMl5BanBnXkFtZTcwMDc5NjUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hal Scardino, Litefoot, Lindsay Crouse | See full cast and crew »"],
      "reviews": [
         "I must first say I was shocked to see that the average rating given this film was below 6 (when I checked it in Jan of '05). While I gave it a 10, I fully expected at least a mid 7 from the IMDb audience. It is a wonderful film that I love to show to my children. What's not to like? It has a unique plot - that of an Indian coming to life in a young boy's cupboard, and wonderful acting and music. Through the boy's experiences with the Indian (wonderfully played by Litefoot) he comes to a new level of maturity. Hal Scardino's acting is natural and totally believable. If you are tired of the cut-out child actors that Hollywood gives us too often, then you'll love Hal. What a fabulously underplayed performance. The ending always makes me and my wife cry. There are so few really good films for children. I hate to suffer through other films I bought for the kids (like \"Inspector Gadget\" - a truly awful film) and I wish that there were more films like this one. This is a wonderful film and I heartily recommend it.",
         "Why this movie doesn't have an average of around 9 eludes me. It is a wondeful film. So well acted and with a very engaging story. This is a great film for the whole family. You'll love it. The lead actor - Hal Scardino - is such a natural. He's completely believable, as is his friend. The Indian is also wonderfully brought to life. How they made the special effects work so well back in 1995 (well... that was a while back for film special effects anyway...) I don't know. I wish we could see more warm hearted films like this today.",
         "I'm a sucker for nice kids, not those snotty ones seen so often in films from the '60s to the present. In here is a wonderful neat-looking little kid, Hal Sardino, who is unusual in that this is the only movie he ever starred in. To his credit, Scardino went on to live a \"normal\" life after this film, eventually going to college as a regular student like you and me with no celebrity status. The film is anything but \"normal,\" a fantasy about a young boy who receives a cupboard that transforms little toy figurines - in this case, an Indian and then a cowboy. - into miniature real-life people. Each time he opens or closes the box with the figures in them, they change to either real or back to plastic. Scardino, who plays Omri,\" is fun to watch, if for no other reason than the great expressions on his face. He has to be one of the most likable children I've ever seen on film. Meanwhile, his best friend \"Patrick\" is the only villain, so to speak, only because he's a bit \"defiant,\" as his mother labels him and he almost spoils everything for \"Omri.\" It's a solid family film that is fun for both the parents and kids to watch at the same time. Both will get a lot of entertainment out of it. With just a bit of profanity early on and a bit of obvious political correctness, there is nothing in here which should offend viewers. Critics didn't seem to care for it, so you know it truly was a nice, wholesome film....and fun to watch.",
         "Omri (Hal Scardino), a young boy growing up in Brooklyn, receives an odd variety of presents for his birthday, a wooden cabinet from his older brother, a set of antique keys from his mother Jane (Linsday Crouse), and a tiny plastic model of an Indian from his best friend Patrick (Rishi Bhat). Putting them all together, Omri locks the Indian inside the cabinet, only to be awoken by a strange sound in the middle of the night. Omri opens the cabinet to discover that the tiny Indian has come to life; it seems that he's called Little Bear (Litefoot), and he claims to have learned English from settlers in 1761. Omri hides this remarkable discovery from his mother but shares it with Patrick; as an experiment, Patrick locks a toy cowboy into the cupboard, and soon Little Bear has a companion, Boone (David Keith), though predictably, the cowboy and the Indian don't get along well at first. Omri comes to the realizations that his living and breathing playthings are also people with lives of their own, and he begins to wonder how much control he should really have over their lives. I liked this movie it was well done, good story, and good acting. Indian In The Cupboard should keep the kids and adults entertained, overall a good film.",
         "[CONTAINS SPOILERS] Today is Omri's 9th birthday. He received a skateboard from his parents and an old cupboard from his brothers Gillon and Adiel. The cupboard looked interesting. Omri's friend Patrick gave him a little Indian figurine. The cupboard was missing a key but Omri's mother had a ton of keys. Omri selected a shiny gold one. His mother's grandmother gave it to her on her death bed. That evening, Omri placed the Indian figurine in the cupboard and locked it with the key, then he unlocked it and to his surprise, the small toy Indian had become a small alive Indian! His name was Little Bear and at first he was afraid of Omri who locked the cupboard and went to bed. In the morning, he unlocked the cupboard to find that Little Bear had become a figurine again. Omri was distraught. After dinner, he unlocked the cupboard again and Little Bear was alive again! The two soon became friends. Omri put a plastic teepee in the cupboard and it became real. Omri then got a bunch of his toys, including a Darth Vader figurine, a T-Rex, RoboCop figurine and G.I. Joe, placed them in the cupboard, locked and unlocked the door and saw them fighting with one another. He quickly transformed them back to toys and in the morning he took Little Bear outside. He wanted to build a Long House because his tribe didn't sleep in teepees. Little Bear was attacked by a bird and was hurt pretty bad. Omri snatched his brothers' toy WWII medic figurine and put him in the cupboard. The medic, Tommy Atkins, soon came alive and fixed Little Bear. He was then placed in the cupboard again and became a figurine again. Omri then left for school while Little Bear began work on his Long House. At school, Omri snatched an elderly Indian figurine with a bow and arrow. He brought it home and brought it to life in the cupboard. The elderly Indian took one look at Omri and keeled over dead. It was then that Little Bear found out Omri was only a kid and became angry with him for using magic he did not understand. Omri's dad wanted him to run an errand for him and when he returned, Patrick came over and gave him a cowboy on a horse figurine. Patrick puts it in the cupboard and the cowboy and horse come to life. The cowboy was named \"Boo Hoo\" Boone because he had a tendency to cry. He and Little Bear begin fighting so they were separated. Patrick wanted to keep Boone so he made Omri promise to bring them to class tomorrow so walking very carefully, Omri brought Little Bear and Boone to class in a pouch. When Little Bear heard Boone was going to school, he wanted to come too. Omri and Patrick fight over them and nearly gave it all away. Omri asked Patrick to spend the night but when they returned home, Omri found his cupboard was gone. Gillon and Adiel had taken it. He found it in the crawl space but the key was missing! That night, Omri, Patrick, Little Bear and Boone watch a film about Indians being shot at. Little Bear was confused and fired his bow and arrow--right at Boone! He desparately needed help but without the key, they couldn't get Tommy. Suddenly, Omri and Patrick noticed the key stuck under the floor boards. Little Bear wanted to go get it but had to be cautious because Gillon and Adiel's rat was loose under there. Little Bear successfully returned with the key so Tommy could come to Boone's aid. He fixed him up as best as he could and Boone would be okay. Little Bear and Boone wanted to return to their own times and Omri decided it was time for them to go. So they were placed in the cupboard, Omri locked and unlocked it and Little Bear and Boone were figurines again but Omri would never forget his friends and I'm sure they will never forget him either. Pretty good movie. Although I think a backstory on why the cupboard and key are magical would've been nice. Although this film looks like Spielberg's work, this film was directed by Frank Oz. We all know him as the puppeteer behind such memorable characters as Yoda, Grover, Cookie Monster, Bert, Fozzie Bear, Miss Piggy, etc. So if you're looking for a nice family film, I recommend The Indian in the Cupboard. A pretty popular scene is the one where Omri places figures of Darth Vader, RoboCop, G.I. Joe and a T-Rex in the cupboard and they fight with one another. In conclusion, I recommend The Indian in the Cupboard! -",
         "If you want to watch a movie with not very familar actors/actress in it, this would be it. Frank Oz is one of the orignators of the Muppets, directed this movie. You got Hal Scardino, Litefoot, Lindsay Crouse, Richard Jenkison, Risji Bhat and Steve Coogan. As the movie opens, a little boy named Omri (Hal Scardino) gets a cupboard for his birthday for one of his brothers, he has two of them. And he aslo gets a plastic indian for his best friend Patrick (Rishi Bhat). Without a key, Ormi tets keys until he finds one that does work and is given to him by his mother who told her dying grandmother that she wanted that key, when she had nothing to leave her. He reads a book called \"Stuart Little\" with his mom after putting the indian in the cupboard. (Spoiler Warning) The next morning he finds that his indian has come to left by closes it right before his father comes up to his room. (Spoiler Warning #2) He comes home from school and finds the indian is plastic again. (Spoiler Warning #3) He wakes up in the middle of the night and finds his indian is alive again, and speaks perfect english after meeting English settlers. His name is Little Bear (Litefoot). And Ormi does all this talking to Little Bear without waking up the rest of the members of his family in the house. The movie is rated PG for mild language, brief video images of violence and sexy dancing (and you may have thought that is is weird that Max Keeble's Big Move got rated PG for some bulling). This came out last year on dvd, and I never heard it coming out and being on dvd until this summer. 10/10",
         "This film was special. It's not to say it ranks high amongst the worlds films technically (which is not to say it fails in this regard \u0096 it simply does not depend upon special effects), but the underlying theme is gentle and beautifully presented. The child actors' performances are solid. Especially the lead 'Omri', and his friend (whom I really liked and really disliked respectively - (hence his acting ability)). It's an innocent story with great imagination, and doesn't take itself too seriously. The relationship and growth that the main character develops with Little Bear (the Indian in the cupboard) is special. It eventually takes on a father/son dynamic after a role reversal or sorts from the Creator/created dynamic the boy has with Little Bear at first. I was touched by this relationship and by Omri's innocence. Frank Oz imagination is conveyed well through this work. I can easily imagine being in Omri's shoes and enjoy this film each time I watch it. Whether you watch this with kids or not, odds are you'll enjoy it.",
         "1995 was certainly a great year for fantasy films and The Indian In The Cupboard was one of the many great movies of that year. A little boy puts a toy Indian in the cupboard and it comes to life. They gradually become good friends throughout the film and the young boy also puts some of his other toys into the cupboard as well. The acting is great throughout and it's a nice little story as well. The great thing about films like this is that they are pure fantasy and they feature the type of things that most young kids dream about. What young child wouldn't like to bring some of their toys to life? It may never happen but it's great to be able to watch a movie where it does happen. All in all, a lovely movie for the kids.",
         "The Indian in the Cupboard is a delightful movie. The sweet and adorable Omri (played by Hal Scardino) is great to go along with on this fascinating adventure. The character Omri is a perfect portrayal of a sensitive and thoughtful 9 year old boy. This movie is most enjoyable in that aspect, above and beyond the story of the strange abilities of the cupboard.",
         "I'll admit...when I first saw the movie, I thought it was the best movie ever. Then, I read the books. This movie strays very far from the book. The big problem is the fact that the books take place in England. And if you read the rest of the books, you'll know how important the location is to the entire story. The movie Americanizes Omri. The movie cuts out and replaces a lot of scenes as well. For instance, in the movie, Boone never sits in the art class drawing his microscopic sketch of his town...a scene that would play an big role in a book to come. Another scene they cut was the principal seeing Little Bear and Boone the way Omri and Patrick do...another big scene that follows them throughout the series. Perhaps they did this because there were no plans for sequels. However, it makes for a huge disappointment for viewers who had read the books before or ran right to the books afterward. The acting and casting for the time travelers, however, was wonderful. As I read the books, I picture Litefoot speaking all Little Bear's lines, Steve Coogan speaking all Tommy's lines, and David Keith speaking Boone's lines. I loved the special effects throughout the movie. The fact that all the others were Americanized causes me to realize they don't fit the Omri, Patrick, etc in the books. Overall, I say that if you enjoy it, then you enjoy it. But chances are, when you read the books, you'll find it a definite disappointment, as it is with so many other book-based movies."
      ],
      "genres": [
         "Family",
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Kennedy/Marshall Company, The",
         "Paramount Pictures"
      ],
      "summaries": ["On his ninth birthday a boy receives many presents. Two of them first seem to be less important: an old cupboard from his brother and a little Indian figure made of plastic from his best friend. But these two presents turn out to be much more magic than the rest..."],
      "budget": 45000000
   },
   "movielensId": 60,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-07-14",
      "dvdReleaseDate": "2001-07-03",
      "directors": ["Frank Oz"],
      "runtime": 96,
      "movieId": 60,
      "title": "The Indian in the Cupboard",
      "mpaa": "PG",
      "actors": [
         "Hal Scardino",
         "Litefoot",
         "Lindsay Crouse",
         "Richard Jenkins",
         "Rishi Bhat",
         "Steve Coogan",
         "David Keith",
         "Sakina Jaffrey",
         "Vincent Kartheiser",
         "Nestor Serrano"
      ],
      "imdbMovieId": "0113419",
      "originalTitle": "The Indian in the Cupboard",
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["yoIBXVm_B9Y"],
      "plotSummary": "A nine-year-old boy gets a plastic Indian and a cupboard for his birthday and finds himself involved in adventure when the Indian comes to life and befriends him.",
      "tmdbMovieId": 11359,
      "avgRating": 3.07167,
      "releaseYear": "1995",
      "numRatings": 7569,
      "posterPath": "/l16BtfILyWxYwSqzofL3V1rMSwe.jpg"
   }
}