{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0110395",
      "video": false,
      "title": "Love and a .45",
      "recommendations": [
         39848,
         30382,
         274480,
         33639,
         55015,
         32742,
         1803,
         37516,
         17831,
         36709,
         37044
      ],
      "backdrop_path": "/u29abwqA9poCU8dxVjRLiKgnvdH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Watty Watts",
               "gender": 2,
               "credit_id": "52fe465d9251416c75076131",
               "name": "Gil Bellows",
               "profile_path": "/msGHWcelT17HW70FDIXdjGmPmMK.jpg",
               "id": 6575,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Starlene Cheatham",
               "gender": 1,
               "credit_id": "52fe465d9251416c75076135",
               "name": "Renée Zellweger",
               "profile_path": "/aeUnfem148WrhpQcmiUuSRGhCYU.jpg",
               "id": 9137,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Billy Mack Black",
               "gender": 2,
               "credit_id": "52fe465d9251416c75076139",
               "name": "Rory Cochrane",
               "profile_path": "/nSwd3TTKPCgZyuO5DqGAzAXQUnF.jpg",
               "id": 51792,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dinosaur Bob",
               "gender": 2,
               "credit_id": "52fe465d9251416c7507613d",
               "name": "Jeffrey Combs",
               "profile_path": "/3dUeJgdLYu8Gb56MEgXsFaCyiqN.jpg",
               "id": 27993,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Creepy Cody",
               "gender": 0,
               "credit_id": "52fe465d9251416c75076141",
               "name": "Jace Alexander",
               "profile_path": "/nkmQTpXAvsDjA9rt0hxtr1VnByF.jpg",
               "id": 20833,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Vergil Cheatham",
               "gender": 2,
               "credit_id": "52fe465d9251416c75076145",
               "name": "Peter Fonda",
               "profile_path": "/dgorN06SQ9ZNL2NY3I7BNxg93lc.jpg",
               "id": 8949,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Thaylene Cheatham",
               "gender": 1,
               "credit_id": "52fe465d9251416c75076149",
               "name": "Ann Wedgeworth",
               "profile_path": "/qi153PFDSHi5afMBkdEqquXwxWc.jpg",
               "id": 83145,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Justice Thurman",
               "gender": 2,
               "credit_id": "52fe465d9251416c7507614d",
               "name": "Jack Nance",
               "profile_path": "/fN9LyZnztco8Tk7NpV0JiGnFkIy.jpg",
               "id": 6718,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mary Ann",
               "gender": 1,
               "credit_id": "52fe465d9251416c75076151",
               "name": "Charlotte Ross",
               "profile_path": "/hlqsMqI8YQs7lUXo1w0SkwBMojM.jpg",
               "id": 82622,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Ranger X",
               "gender": 2,
               "credit_id": "52fe465d9251416c75076155",
               "name": "Michael Bowen",
               "profile_path": "/xGNcy5uCe0Ke5vqC7oZlOV3GGDx.jpg",
               "id": 2234,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Young Clerk",
               "gender": 1,
               "credit_id": "5738e99ec3a3685aa4001e70",
               "name": "Wiley Wiggins",
               "profile_path": null,
               "id": 56934,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe465d9251416c7507612d",
               "name": "C.M. Talkington",
               "profile_path": null,
               "id": 78258,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe465d9251416c7507615b",
               "name": "C.M. Talkington",
               "profile_path": null,
               "id": 78258,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe465d9251416c75076161",
               "name": "Tom Verlaine",
               "profile_path": null,
               "id": 95339,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe465e9251416c75076167",
               "name": "Tom Richmond",
               "profile_path": null,
               "id": 7034,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe465e9251416c7507616d",
               "name": "Bob Ducsay",
               "profile_path": null,
               "id": 7784,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe465e9251416c75076173",
               "name": "Deborah Pastor",
               "profile_path": null,
               "id": 1170667,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe465e9251416c75076179",
               "name": "Kari Perkins",
               "profile_path": null,
               "id": 54761,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe465e9251416c7507617f",
               "name": "Darin Scott",
               "profile_path": null,
               "id": 57777,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.755023,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15477,
      "vote_count": 18,
      "budget": 0,
      "overview": "Small-time criminal Watty Watts attempts to rob a convenience store with his drug-addict buddy, Billy Mack Black. The robbery, however, leads to murder, and soon Watty leaves Billy behind and goes on the run with his beloved girlfriend, Starlene. Heading toward Mexico, the fugitive couple gets plenty of media coverage, until there are even more people on their trail. Can Watty and Starlene make it south of the border without getting caught?",
      "similar": [
         3134,
         27292,
         11564,
         8810,
         12162,
         949,
         793,
         101,
         281,
         948,
         281957,
         156022,
         298312,
         238636,
         445954,
         67822,
         2142,
         400,
         22323,
         133805
      ],
      "original_title": "Love and a .45",
      "runtime": 101,
      "poster_path": "/6ziFdFPGPa3iysyLgJbjrzLLpgw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Trimark Pictures",
         "id": 4063,
         "origin_country": ""
      }],
      "release_date": "1994-11-23",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "This is one jagged twisting ride you'll never forget.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["C.M. Talkington"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["C.M. Talkington"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110395/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzI2MzUxOTcxM15BMl5BanBnXkFtZTcwMjQ2MDA4Mg@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Gil Bellows, Renée Zellweger, Rory Cochrane | See full cast and crew »"],
      "reviews": [
         "Pretty good movie that has been pretty unfairly treated over the years. It has some flaws, but in general it stands out owing to outstanding performances and ingenious direction. It's been called a copy of \"Natural Born Killers\", but that comparison is both unfair and inaccurate. Unfair because the movie was completed *before* Natural Born Killers was released, and inaccurate because the characters are fundamentally different. Natural Born Killers was about two people who were by nature violent and evil, whereas this movie is about two who are by nature *not* violent. Check out the movie yourself, and rather than listen to accusations that it's a rip-off of movies that actually came after it, give it a shot as what it is -- a better-than average entry in a long-standing film genre, the outlaw couple on the run. And where it's due the director gives nods to his influences. Note one item that struck me as an inside joke -- the addition of Peter Fonda, the star of one movie that truly *is* a predecessor of this one: Dirty Mary and Crazy Larry (1974).",
         "Anyone who like their films stacked with dark humour and well-written characters should check this out! It's \"Natural Born Killers-esque\" in style here and there, but was actually made before that movie. Absolutely stunning performances all round. I highly recommend this film.",
         "If you want to see a movie that has no reason for being.... you'll enjoy this. If you want to criticize a movie for looking like Reservoir Dogs or whatever...dont get this one. It's a very good film and the acting is great. But take it for what it is...A MOVIE! This was Rene's last Indy film before taking off with Jerry Maguire and the film is just fun. Dont dig deep in it...just enjoy it. The DP was aweful and the lighting is bad at times but that adds to the film.",
         "Tarantino-esq action thriller which is worth a look and will not disappoint fans of Quentin's films particularly True Romance. It has (lots of ) violence, rapid gun fire, white trash characters and a large dollop of that comic book humour that has got Quent where he is today. It is easy to see that this film takes its inspiration from the aforementioned film, but it does stand on its own feet as the script and the action is good enough to entertain you throughout. Bellows and Zellwegger are good in the leads and the supporting Rory Cochrane is great fun as their psychotic madman 'friend' out to settle a few old scores. Peter Fonda is a standout as Zellweggers' dad. Highly recommended.",
         "Great for fans of the crime-on-the-run films. . . funny and unique twist on the genre with great characters and some very, very funny moments. Similar to Tarantino, and miles above Stone's horrible Natural Born Killers, Love and a .45 is a delight.",
         "I saw this movie late one night and was pleasantly surprised at how very good it was. Of course, it lacked in certain areas, and could have been better developed but I believe that if the budget was better, it would have succeeded. This movie has a decent plot, really well-developed characters and very creative screen shots. I recommend this movie to anyone who is interested in Tarantino's style but by a different director. Definitely a cult classic.",
         "For the genre I thought it was pretty good. It's not so much a Tarentino ripoff, as has been suggested, as another in a long line of White Trash on the Road movies which started back with Bonnie & Clyde & Easy Rider and continues with movies like Freeway, Natural Born Killers etc. The characters were great. They're supposed to be overdrawn and the balance between the main characters bad deeds and that piece of goodness they have that no one else in the film possess was struck just right. Rightly so Renee Zellweger has built a career since this but I'm surprised that the Director, CM Talkington went nowhere from here and the lead Gil Bellows (who is charming here) has had little success either. And who would have thought that Creepy would go on to direct a ton of TV shows!",
         "I took the time to register just so you can see an awesome flick. This film is right up there with Pulp Fiction, Snatch, Lock Stock and 2 Smoking Barrels, even Fight Club. I am not gonna do a critique here, but it has it all - its funny at times, and deadly serious at others. It has a great flow, and the soundtrack is perfect. I'd never heard of the Reverend Horton Heat or Mazzy Star, but they rock this flick. Frankly I am very surprised that we haven't heard from the Director in any other films. I just checked, and this and something called Killers Head are about it. Anyways, watch it and it might become one of your favorites too!",
         "I saw this movie right after it came out and bought it immediately afterward. Though not as multi-faceted & complex as Tarantino's masterpiece, the critically acclaimed \"Pulp Fiction\", \"Love & a .45\" filmed here in Texas,(Austin/Bastrop area), will keep the viewer glued from beginning to end. It is by far one of the best movies released in 1994. From the Texas drawls to the family names mentioned by Dinosaur Bob & Creepy Cody, all can be found in the area. Bravo! to the casting directors for this film, for their choices clearly were well thought out. Each actor brought their own concept of \"Texan\" to the screen. I've read a lot of reviews here on the IMDb about how this movie is a rip-off of \"Pulp Fiction\" -- \"NBK\", another film comparison made here, was also released in that same year...my question is this: How can it be a \"rip-off\" if all 3 films were released the same year? Why not reference the 1992 film by Robert Rodriguez-\"El Mariachi\", exploding on the scene with his own brand of creative artistic Texas filming...and let's not forget about that OTHER famous Texas Director, RichardLinklater who made his debut that following year with his 1993 explosive hit \"Dazed and Confused\"...where Rory Cochrane plays an unforgettable role. Let's just say that 1994 was THE year for Creative Artistic Direction. One thing I do want to ask: Did Big Red Bottling Co. have anything to do with the making of this film? I mean, every scene has some sort of reference to the soft drink Big Red. Could this be \"Free Advertising\" at it's best?",
         "I must admit, I was pleasantly surprised by this film. All I'd heard prior to seeing it was that it featured the world's first celluloid skull tattoo (it does, but that's another story). After seeing it, I highly recommend it to fans of the crime/road trip genre. Gil Bellows and Renee Zellweger are Texas lovers in trouble with the law after killing some cops after him for a robbery/murder. Rory Cochrane, as his crazed ex-partner, follows the two to Mexico. The trip south of the border comprises most of the movie, and what a trip it is. Co-starring are Jeffrey Combs, excellent in a non-horror role, and Peter Fonda as --what else?-- a burn-out. The mostly rockabilly soundtrack is very good."
      ],
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["Trimark Pictures"],
      "summaries": ["Watty has made a living out of robbing convenience stores, but after one of these job turned into murder by his partner, the psychopath Billy Mack, he is on the run with his fiancé Starlene and with both Billy Mack, the police and some loansharks on his trail. Their plan is to go to Mexico but before they do that they want to get married and visit Starlenes parents."],
      "budget": 0
   },
   "movielensId": 600,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-11-23",
      "dvdReleaseDate": "1999-06-08",
      "directors": ["C.M. Talkington"],
      "runtime": 101,
      "movieId": 600,
      "title": "Love and a .45",
      "mpaa": "R",
      "actors": [
         "Gil Bellows",
         "Renée Zellweger",
         "Rory Cochrane",
         "Jeffrey Combs",
         "Jace Alexander",
         "Peter Fonda",
         "Ann Wedgeworth",
         "Jack Nance",
         "Charlotte Ross",
         "Michael Bowen",
         "Wiley Wiggins"
      ],
      "imdbMovieId": "0110395",
      "originalTitle": "Love and a .45",
      "genres": [
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["B3AqG25J_Vo"],
      "plotSummary": "Small-time criminal Watty Watts attempts to rob a convenience store with his drug-addict buddy, Billy Mack Black. The robbery, however, leads to murder, and soon Watty leaves Billy behind and goes on the run with his beloved girlfriend, Starlene. Heading toward Mexico, the fugitive couple gets plenty of media coverage, until there are even more people on their trail. Can Watty and Starlene make it south of the border without getting caught?",
      "tmdbMovieId": 15477,
      "avgRating": 2.98889,
      "releaseYear": "1994",
      "numRatings": 315,
      "posterPath": "/6ziFdFPGPa3iysyLgJbjrzLLpgw.jpg"
   }
}