{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0112606",
      "video": false,
      "title": "Bye Bye Love",
      "recommendations": [
         41779,
         65465,
         25796,
         18856,
         34615,
         17133,
         251733,
         112969,
         130165,
         30385,
         155706,
         85646,
         58250,
         233734,
         31395,
         90164,
         38554,
         33990,
         91217,
         117553
      ],
      "backdrop_path": "/nIvSl2uAEz2JmPmFNh3HItHQbbh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dave Goldman",
               "gender": 2,
               "credit_id": "52fe44239251416c91006319",
               "name": "Matthew Modine",
               "profile_path": "/tEQG1Us5IuoKYtufZe6waWtxfeg.jpg",
               "id": 8654,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Vic Damico",
               "gender": 2,
               "credit_id": "52fe44239251416c91006321",
               "name": "Randy Quaid",
               "profile_path": "/7rywy6gbSTG60xQWepRktD0feek.jpg",
               "id": 1811,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Donny Carson",
               "gender": 2,
               "credit_id": "52fe44239251416c9100631d",
               "name": "Paul Reiser",
               "profile_path": "/fr53dQQrDGfETgbliCktwKqteRU.jpg",
               "id": 781,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lucille",
               "gender": 1,
               "credit_id": "52fe44239251416c91006325",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Susan",
               "gender": 1,
               "credit_id": "58bb4374925141606b02b725",
               "name": "Amy Brenneman",
               "profile_path": "/xC408loYq7tQlkpS5YH68SoaDND.jpg",
               "id": 15851,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Emma",
               "gender": 1,
               "credit_id": "52fe44239251416c91006329",
               "name": "Eliza Dushku",
               "profile_path": "/drQXyoKMVf4IJsCdmnOXpzhBEYL.jpg",
               "id": 13446,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Walter Sims",
               "gender": 2,
               "credit_id": "5a913facc3a36824f6007f97",
               "name": "Ed Flanders",
               "profile_path": "/6zypzeO1joYe3MK6JpXSLps92z3.jpg",
               "id": 70746,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Kim",
               "gender": 1,
               "credit_id": "5a913fb3c3a3682529008979",
               "name": "Maria Pitillo",
               "profile_path": "/hNVHzeqY618snAncfHRSApBYwu1.jpg",
               "id": 3208,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Grace Damico",
               "gender": 1,
               "credit_id": "5a913fbe925141417a007d04",
               "name": "Lindsay Crouse",
               "profile_path": "/mAZTWVbtfmC0R4R6TZ3rjhJSW0b.jpg",
               "id": 32225,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Ben",
               "gender": 2,
               "credit_id": "5a913fdc0e0a2616cc008b2e",
               "name": "Ross Malinger",
               "profile_path": "/oeqoxZ3WgQRUE1DusC68SACHHrC.jpg",
               "id": 12928,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Max Cooper",
               "gender": 2,
               "credit_id": "5a913ff40e0a2616cc008b40",
               "name": "Johnny Whitworth",
               "profile_path": "/xkeywGnloZXCsHjKz6eqbKoClrh.jpg",
               "id": 73589,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Hector",
               "gender": 2,
               "credit_id": "5a913ffec3a368251d007e0d",
               "name": "Wendell Pierce",
               "profile_path": "/uOsldo9Pkl0E79UbIXX5tZZmC8F.jpg",
               "id": 17859,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Michele",
               "gender": 1,
               "credit_id": "5a914008925141418000819e",
               "name": "Mae Whitman",
               "profile_path": "/1QxlJQ1LmfxFQJEZSwwlabRr6a6.jpg",
               "id": 52404,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Meg Damico",
               "gender": 1,
               "credit_id": "5a914018c3a3682502008282",
               "name": "Amber Benson",
               "profile_path": "/hcatQaJNb2lAcBukfn6IOaxtl5F.jpg",
               "id": 35468,
               "order": 13
            },
            {
               "cast_id": 6,
               "character": "Dr. David Townsend",
               "gender": 2,
               "credit_id": "52fe44239251416c9100632d",
               "name": "Rob Reiner",
               "profile_path": "/2zw9Iq9uo4vZiTQNQWdNFwbA1TA.jpg",
               "id": 3026,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Mikey",
               "gender": 2,
               "credit_id": "5a914022c3a36825290089d2",
               "name": "Danny Masterson",
               "profile_path": "/vBC0mHPEVHwhFZYzhXgoHzBKYyK.jpg",
               "id": 18972,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "DJ at Party",
               "gender": 2,
               "credit_id": "5a91402fc3a3682502008291",
               "name": "Jack Black",
               "profile_path": "/vMXgtzMdt2jSAjOECFQ5F53blbr.jpg",
               "id": 70851,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44239251416c91006333",
               "name": "Sam Weisman",
               "profile_path": "/xTUHl1nYyGoTqcEfAxuiFq82Xcr.jpg",
               "id": 54967,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44239251416c91006339",
               "name": "Gary David Goldberg",
               "profile_path": "/89H8vQFSsnnpGpbIR162NVzOSCP.jpg",
               "id": 70738,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44239251416c9100633f",
               "name": "Brad Hall",
               "profile_path": "/2YRqEMFBKLqwj3l3ejh1pT112MF.jpg",
               "id": 70743,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "557308479251416af7003bd2",
               "name": "Kenneth Zunder",
               "profile_path": null,
               "id": 1228794,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55730869925141318e002357",
               "name": "Roger Bondelli",
               "profile_path": null,
               "id": 17164,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55730878c3a3686ef9001996",
               "name": "J.A.C. Redford",
               "profile_path": null,
               "id": 66941,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.404109,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30528,
      "vote_count": 24,
      "budget": 0,
      "overview": "With varying degrees of success, recently divorced friends Dave, Vic and Donny are trying to move on with their lives. Vic feels vilified by his ex-wife's parents, while Donny has a shaky bond with his teen daughter, Emma. Dave, meanwhile, has an enviable problem -- he has more dates than he can handle. As they confront their post-marital challenges, the men take solace in one another's plights.",
      "similar": [],
      "original_title": "Bye Bye Love",
      "runtime": 106,
      "poster_path": "/9yYX5kJ14z3WqXmiorvLtQNq8Lm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ubu Productions",
            "id": 46108,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-03-16",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Donny, Dave and Vic are best friends. They have everything in common ... ex-wives, new girlfriends, and the kids for the weekend.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sam Weisman"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Gary David Goldberg",
         "Brad Hall"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112606/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NDIyMDkzM15BMl5BanBnXkFtZTcwNzcwODcyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Modine, Randy Quaid, Paul Reiser | See full cast and crew »"],
      "reviews": [
         "I am a single dad and I enjoyed this movie a lot! I laughed and I cried. I loved the bad date scene with Randy Quaid and Jeanne Garafalo. She played the bad date to perfection. The movie was not perfect but it was a commendable attempt to bring some humor to a subject which seems far from humurous when you are going thru it. Very entertaining!",
         "A look at modern day divorced American single fathers and their attachment to McDonalds! It has some sincere and funny moments that make it worth the while but as always, when Hollywood gets to close to the truth, it turns to a TV soap style of resolution.",
         "Dave (Matthew Modine), Vic (Randy Quaid), and Donny (Paul Reiser) are a trio of friends and divorced fathers. Dave has a beautiful new young girlfriend named Kim (Maria Pitillo) but still sports a wandering eye. Vic, whose soul was definitely bruised by his ex-wife, is just agreeing to go on a blind date with Lucille (Janeane Garofalo). As for Donny (Paul Reiser), he is also having severe trouble moving on, holding his former wife in high esteem, even though she has remarried. All of the men have children that they love deeply and who fall into their custody at the appropriate times. Yet, meeting their former mates at such places as McDonald's, in order to exchange their children, still gives everyone a pang of hurt. Will Dave learn to commit himself to one woman? Will Vic let go of his resentments and take a chance on a new love? And will Donny realize his ex is never coming back and give himself permission to love someone else, even if it is Dave's former wife (Amy Brenneman)? As for the kids, will they be able to weather their parents divorce, too? This is a truthful and touching film about divorce in modern America. Yes, it is very common now, making life complicated, especially when children are involved. But, even so, it is not the end of the world, as all of the men, women, and kids discover in this movie. All of the actors are wonderful, with Quaid, especially, giving an extremely humorous and thoughtful performance. Special mention should also go to Garofalo for her drop-dead-funny, neurotic-yet-lovable portrayal of a divorcée. Then, too, the California setting is lovely, the costumes very well chosen, and the production values quite high. Most of all, the script is funny, original, and brutally honest. If you have been down the divorce highway, you should definitely make time for this film. It will help heal wounds with its laughs and sensitivity. But, even if you just want to find a film that will let you \"yuck it up\", this one is a terrific choice.",
         "This is a very enjoyable little movie and after seven years and numerous viewings, I still watch it every time it's on TV. Of all the movies I've seen dealing with divorce and broken homes this one comes the closest to portraying what it was like (at least for me and my family). Best of all, it's not a depressing downer of a movie. It's fun to watch and emotional at the same time. The most effective part of the film for me was the relationship between Paul Reiser and his daughter since it reminded me so much of my dad and sister. All of the actors are extremely well chosen (minus the very bland Mathew Modine). It handles the topic of divorce responsibly and doesn't load on the melodramatics. For anyone who's gone through a divorce and wondered \"Now what?\", or a child of divorce... you should get a lot of this movie. I really, really liked it.",
         "WARNING: This review contains a couple of PLOT POINTS and SCENE SPOILERS; if you do not wish to find out too much about this movie, then please DO NOT READ. This film is often billed as a comedy on television, but in fact this is not entirely accurate. People often associate comedy with films such as \"Airplane!\", or \"Hot Shots\", but anybody looking for this kind of humour is going to be a little disappointed. \"Bye Bye Love\" simply tries to bring the subject of divorce, with all the benefits and the costs it can have, in a comical fashion, admittedly, but it does not let the production be ruled by laughs and gags. In fact, it is doused with only a sprinkling of laughs, particularly in the middle of the film itself. The film itself is also incredibly effective at relaying the message it brings, and leaves the audience with some doubt as to whether divorce is the answer to an unhappy relationship - but it also enforces that it is not the end of the world. When the jokes do come in, to relieve some of the tension in the film, they are usually quick and simple, and all the cast deliver with skill. The real star of the show, however, has got to be Randy Quaid (Vic), who plays a spectacular performance and brings out the best comical content in his scenes, particularly those involving his wife's porch, his date (played by Janeane Garofalo, a good foil against Quaid) and his reactions to Dr. David Townsend (played superbly by Rob Reiner). In all, the film tackles some important issues about married life and the problems that can happen, without ever taking itself too seriously, and in the end, it's hard to say how the film might have improved itself.",
         "Divorce is a pervasive fact of life in our society. The three men at the center of the story, Vic, Donny, and Dave, have recently been divorced. It appears that all three have gone through friendly separations, as in all three cases, children are involved. Since the kids are under the mother's custody, the fathers have the right to get them for week-end visits. All three friends seem somewhat adjusted to their new realities. Vic, looks as the most grounded man of the trio. Donny, is the saddest case, and Dave, who is a wishy washy man, is trying his hand at a new relationship with a much younger woman. The wives, on the other hand, have moved on with their lives. The three women appear to have no problems with their new status. The exchange of children occurs in a suburban McDonald's, a neutral territory. This is a type of \"brand placing\" that Hollywood films love to show. Fast food, alas, stands for an allegory of what's missing with most marriages these days when most families don't even share a meal together. There is also the talk radio personality who is in the air taking calls from divorced people and advising them what to do, yet, he doesn't even have a clue about what he is talking about; after all, he's been married five times! The acting is adequate. The best thing in the film is Randy Quaid, who as Vic, makes the most of his role. Janeane Garofalo appears as a date from hell, in a funny sequence. The ensemble cast does fine work under Sam Weisman's direction. The sad fact of this story is that all these children, we see in the film, will probably go through divorces in their own lives.",
         "Call me easily amused, but I think this is a movie more likely to be accepted by those who can relate, having had similar experiences - both hilarious and heartwrenching. The three main characters are divorced dads, each with their own trials in dealing with the ex-spouses and their teenage and young children. My favorite is Randy Quaid, although he is the most bitter. The scene with \"Our House\" cracks me up everytime I see it; \"Go Red Sox\" and of course, \"The Date.\" Matthew Modine portrays the ever insatiable Playboy; he, his kids and his Ex, Amy Brenneman, all have some great lines. And last, the longingly in denial and reluctantly divorced Dad, Paul Reiser, aka the \"BIRTH FATHER.\" *SEMI-SPOILER* In response to a comment posted by Sherlock regarding the \"Mickey D's worker and the old guy sub-plot,\" the old guy is a father with his grown children far away and the young guy has no father in his life; basically, they are both lonely and forgotten people who find their mutual needs help each other remedy their unhappy situations. Definitely a feel good movie, see it for Randy Quaid, if nothing else.",
         "My love for this movie is a bit of a mystery. It seems Bye, Bye, Love would appeal most to divorced parents looking for some redemption for their messed up lives. But I'm a single guy in his thirties who grew up in a very healthy family. But every time I catch this movie replaying on one of the movie channels, I just can't switch away. I guess it appeals to me because it does many things well. Bye, Bye, Love has strong, well-developed, interesting characters. It has comedy, romance, and tension. It makes good use of music and includes some great familiar tunes. The acting is superb. And it paints a pretty realistic picture of what it's like to be a divorced parent in modern America (I assume) while being quite entertaining. I'm surprised this movie hasn't gotten more attention as it remains one of my all-time favorites.",
         "I loved this movie from the start and I still love it.Fifty times no make that 100 times beter than \"Parenthood\" it had good actors that matched their character's personalities to me.I'm a huge fan of Mathew Modine but the two best actors were Randy Quaid and Janeane Garofalo.Both were adorable and funny.All the kids were good too and kudos to Paul Rieser for a heartwarming performance with screen daughter Eliza Dushku.One bad thing-the pairing of the best friend with his buddy's ex-wife.Bull! They didn't have to go there.I bought this movie and I can watch it everyday.Funny,sweet, and I'm sure all families of divorce wish it was as easy as the movie made it. 9/10 stars",
         "Good chemistry between the characters - whether it's friends, parents, ex's, or lovers. The timing was right on, and everyone delivered. Great casting from the Radio Psychologist (Rob Reiner) down to the last little kid. Randy Quaid is one actor that usually needs tempering in his roles.....but not this one. He managed to be outrageous, testosterone laden, and rough-cut without sacrificing the depth of his character. This was also the first movie in which I'd seen Janeane Garofalo (aka \"The Date\"), and I immediately added her to my list of favorites. I've since rented several other of her films, all of which I've enjoyed - especially \"The Truth About Cats & Dogs\". Also keep an eye out for Mae Whitman (\"Michele\") - She needs a little more seasoning, but someday this kid is going to have \"Oscar-winner\" in front of her name. A thoroughly enjoyable film."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Ubu Productions"
      ],
      "summaries": [
         "This is a story about the breakup of the family. In particular, it focuses on the lifestyle of three divorced men. The film is presented from their perspective and it reveals their relationship with their children, ex-wives, girl friends, male friendships, and their identities as divorced men. In addition to dealing with divorce, the film touches on spousal loss and young adult homelessness. The film can be considered a social commentary that is both comical and emotional.",
         "This film about is about three divorced men and their relationships with their ex-wives, their children, and new women in their lives. Donny still carries a torch for his ex, and has trouble relating to his teenage daughter, Emma. Dave can't make a commitment. Vic carries a lot of anger toward his ex, and winds up with the blind date from hell. Needling all of them is a blathering radio psychologist dispensing his advice on the subject of divorce."
      ],
      "budget": 0
   },
   "movielensId": 603,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-16",
      "dvdReleaseDate": "2005-02-08",
      "directors": ["Sam Weisman"],
      "runtime": 106,
      "movieId": 603,
      "title": "Bye Bye Love",
      "mpaa": "PG-13",
      "actors": [
         "Matthew Modine",
         "Paul Reiser",
         "Randy Quaid",
         "Janeane Garofalo",
         "Eliza Dushku",
         "Rob Reiner",
         "Amy Brenneman"
      ],
      "imdbMovieId": "0112606",
      "originalTitle": "Bye Bye Love",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "With varying degrees of success, recently divorced friends Dave, Vic and Donny are trying to move on with their lives. Vic feels vilified by his ex-wife's parents, while Donny has a shaky bond with his teen daughter, Emma. Dave, meanwhile, has an enviable problem -- he has more dates than he can handle. As they confront their post-marital challenges, the men take solace in one another's plights.",
      "tmdbMovieId": 30528,
      "avgRating": 2.94808,
      "releaseYear": "1995",
      "numRatings": 626,
      "posterPath": "/9yYX5kJ14z3WqXmiorvLtQNq8Lm.jpg"
   }
}