{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116552",
      "video": false,
      "title": "Homeward Bound II: Lost in San Francisco",
      "recommendations": [
         6878,
         10438,
         9446,
         14819,
         9822,
         17414,
         9073,
         20737,
         26441,
         18862,
         68927,
         19042,
         11158,
         27281,
         35645,
         10603,
         13962,
         11164,
         18935,
         9438
      ],
      "backdrop_path": "/a1c9rYLgKdhzIGfxPQGsXD1k1SL.jpg",
      "revenue": 32709423,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Chance",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032a63",
               "name": "Michael J. Fox",
               "profile_path": "/2CwTJuL6UHqPJ82oh8WpWUw8Q0V.jpg",
               "id": 521,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sassy",
               "gender": 1,
               "credit_id": "52fe44b6c3a368484e032a67",
               "name": "Sally Field",
               "profile_path": "/ymhpsxujOO3a9qaGYSpkenCt9Le.jpg",
               "id": 35,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Shadow",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032a5f",
               "name": "Ralph Waite",
               "profile_path": "/fvLzvzgEhznLngnM628rXTt53AX.jpg",
               "id": 8853,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bob Seaver",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032a6b",
               "name": "Robert Hays",
               "profile_path": "/1KWB4DXcsTVNDkDOaTJYatiTmDn.jpg",
               "id": 14416,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Laura Burnford-Seaver",
               "gender": 1,
               "credit_id": "54fd18cc92514123af003761",
               "name": "Kim Greist",
               "profile_path": "/u857tppmsyDcYuzqXyj83G70mq0.jpg",
               "id": 387,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Stokey",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032a97",
               "name": "Michael Bell",
               "profile_path": "/izjtUFQ3zJsInc0TSIhrVmUpSd7.jpg",
               "id": 19546,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Sledge",
               "gender": 1,
               "credit_id": "52fe44b6c3a368484e032a93",
               "name": "Tisha Campbell-Martin",
               "profile_path": "/8nfymZ8Ohi7P5mNGOMddRmm5pgF.jpg",
               "id": 141823,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Sparky Michaels",
               "gender": 2,
               "credit_id": "562355b09251413a74008593",
               "name": "Al Michaels",
               "profile_path": "/ftL97S12bCtSXOL0bOBX6l5DXcu.jpg",
               "id": 160028,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Lucky Lasorda",
               "gender": 0,
               "credit_id": "562355c7c3a3680e1900d210",
               "name": "Tommy Lasorda",
               "profile_path": null,
               "id": 1214225,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Trixie Uecker",
               "gender": 2,
               "credit_id": "562355d79251417f4700aa20",
               "name": "Bob Uecker",
               "profile_path": "/zq4Q0u8aqkbElrHBIWbgi7LotFE.jpg",
               "id": 147486,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "French Poodle",
               "gender": 1,
               "credit_id": "562355ecc3a3680e0e00df3d",
               "name": "Tress MacNeille",
               "profile_path": "/nUURm7MBAvKNq79gBhOVfs7Zlhl.jpg",
               "id": 34983,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Ashcan",
               "gender": 2,
               "credit_id": "562355fbc3a3680e2000e496",
               "name": "Jon Polito",
               "profile_path": "/acIcTtPUjIn3LwTMfDsRYU8RDE.jpg",
               "id": 4253,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Pete",
               "gender": 2,
               "credit_id": "5623560f92514171c500d16d",
               "name": "Adam Goldberg",
               "profile_path": "/utlFTzTDP5VDQYXmzdHBbfloYhb.jpg",
               "id": 6163,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Riley",
               "gender": 2,
               "credit_id": "5623562092514135b00013fe",
               "name": "Sinbad",
               "profile_path": "/lQ6VVIxpZuwgXJuBX87YwQkXUoq.jpg",
               "id": 57119,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Delilah",
               "gender": 1,
               "credit_id": "56235630c3a3680e1600c417",
               "name": "Carla Gugino",
               "profile_path": "/xddYLCp8zWLgYcQRck7REEgCUWl.jpg",
               "id": 17832,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Bando",
               "gender": 2,
               "credit_id": "56235642c3a3680e0e00df51",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Jack",
               "gender": 2,
               "credit_id": "5623568292514144b0000208",
               "name": "Michael Rispoli",
               "profile_path": "/mRS7DAXhuLu8Z7PAlicm6kP0EZz.jpg",
               "id": 18313,
               "order": 16
            },
            {
               "cast_id": 26,
               "character": "Pizza Boy",
               "gender": 2,
               "credit_id": "562356afc3a3680e1000cef5",
               "name": "Will Sasso",
               "profile_path": "/5Lz3WLWkgU04Fy4Xa0pjE5U53Wi.jpg",
               "id": 39125,
               "order": 17
            },
            {
               "cast_id": 27,
               "character": "Truck Driver",
               "gender": 2,
               "credit_id": "57911425c3a3683608000e77",
               "name": "Tom Wagner",
               "profile_path": null,
               "id": 109756,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032a71",
               "name": "David R. Ellis",
               "profile_path": "/ww2HEkXJadls2XyDvQCJKzy6ly.jpg",
               "id": 4755,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032a77",
               "name": "Barry Jossen",
               "profile_path": null,
               "id": 146177,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44b6c3a368484e032a7d",
               "name": "Sheila Burnford",
               "profile_path": null,
               "id": 51334,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b6c3a368484e032a83",
               "name": "Chris Hauty",
               "profile_path": null,
               "id": 146178,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44b6c3a368484e032a89",
               "name": "Julie Hickson",
               "profile_path": null,
               "id": 146179,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b6c3a368484e032a8f",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 146180,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 12.661586,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 25059,
      "vote_count": 129,
      "budget": 0,
      "overview": "Your favorite talking animals are back! The film focuses on the further adventures of Shadow (voiced by Ralph Waite), Sassy (voiced by Sally Field), and Chance (voiced by Michael J. Fox). Shadow is the old, wise one and presumably the leader of the three. Sassy is the smart-aleck of the bunch, but helpful in times as well. Chance is the young, anxious one who usually gets into trouble and relies o",
      "similar": [],
      "original_title": "Homeward Bound II: Lost in San Francisco",
      "runtime": 89,
      "poster_path": "/6oFXtbLt9IyoK6rdvdt0ccF6hGP.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1996-03-08",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Homeward Bound Collection",
         "id": 43058,
         "poster_path": "/4S9WMNUJFzxKOjcoS1mGrKFfygI.jpg"
      },
      "tagline": "Your favorite talking animals are back!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David R. Ellis"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Chris Hauty",
         "Julie Hickson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116552/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2ODg4NTg5MF5BMl5BanBnXkFtZTYwMzUwMzk4._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael J. Fox, Sally Field, Ralph Waite | See full cast and crew »"],
      "reviews": [
         "Lacking the beauty, charm and teamwork of the original film (the remake) this sequel makes up in adventure and romance! This one is probably slightly funnier, with another good adventure and almost as much proof as the last one that dogs really are man's best friend. However, this sequel has its flaws, as in things about the film that don't completely make sense if you have watched the first film. For example, in the first film Chance learnt how to be a faithful and kind dog to Jamie, but in this it seem's he's even sillier. Another one of these flaws is that he explains in the first film that he lived on the streets and now Shadow is talking about how he can't live on the streets and he doesn't know how to. WHAT!? Otherwise, an incredibly good sequel, with romance, adventure and charm, but just doesn't have the emotion that made the original film so special and captivating. Chance's, Sassy's and Shadow's owners are going on a camping trip and taking the dogs with them. However, Chance, like in the last film, becomes incredibly confused with the situation and escapes out of his dog box before all three of them are loaded onto the plane. That means they are lost in San Francisco, while the humans go off without them! What can they do? Recommended to people who liked the first film, people who were disappointed that there was no romance in the first film and just people who like dogs! Enjoy \"Homeward Bound II: Lost in San Francisco\"!",
         "If you thought the first movie was great, that's awesome!!!!! But the second movie????? Come along and find out!!!!! Disney made a sequel to the 1993 film in 1996. It was called \"Homeward Bound II: Lost in San Francisco,\" and this is a very exciting Disney live action film. In it, we have the same family as before, and they were packing up on a vacation for Vancouver, Canada. However, the animals escaped at the airport, and now the family left without Chance, Sassy, and Shadow!!!!! Now, like in the last film, they had to find their way home (and it put a huge dent in the family vacation, too). Most people might not like this film, but seeing as how the first film was great, this movie is the same, too. I like how exciting the adventure was, and I thought the pets' encounter with the Blood Red Van was funny, too!!!!! \"HB II: LISF\" is twice as fun as the first one is!!!!! 10 stars",
         "I rented this mostly for my 4-year-old daughter, who enjoys both the 1963 original \"Incredible Journey\", and the 1993 remake. She thought the sequel was very funny, particularly some of Sassy the Cat's antics. I must admit, the movie took me in as well. The sequel is a little heavier-handed than the 1993 remake. Not only do our three main characters have to get home, but they have to defeat a gang of city dogs, outwit two dognappers who are trying to sell strays to the \"The Lab\", rescue a child from a burning building, and find true love on top of it all! Still, not a bad way to spend 89 minutes. Michael J. Fox is again excellent as Chance, Sally Fields is full of indignation as Sassy, and Ralph Waite does an eerily accurate recreation of the late Don Ameche's characterization of Shadow. Sinbad is wasted as Reilly, their new city dog friend. The character seemed to be more of an afterthought than anything. Most pleasant surprise: Al Michaels, Tommy Lasorda and Bob Uecker as three dogs \"broadcasting\" a pee-wee baseball game. If you are looking for a movie to enjoy with your children without feeling totally insulted, Homeward Bound II is a solid bet. A few tense moments, but nothing that should upset anyone beyond the Teletubbies set.",
         "Chance, Shadow and Sassy get lost again.This time those two dogs and the cat try to find their way back home from San Francisco.They are in constant danger as they get chased by illegal dog chasers and a couple of street-wise dogs.But something good happens on the journey when Chance falls for the street dog Delilah.Homeward Bound II: Lost in San Francisco (1996) is directed by David R. Ellis.Michael J. Fox does the voice of the American Bulldog Shance again.Sally Field is the Himalayan cat Sassy again.Ralph Waite has replaced the late Don Ameche as the old Golden Retriever Shadow.Adam Goldberg is the voice of Pete.Carla Cugino is Delilah.Tommy Lasorda is Lucky Lasorda.Michael Bell is Stokey.Jon Polito is Ashcan.Sinbad gives the voice-over for Riley.In plain actors we see Robert Hays, who plays Bob Seaver.Kim Greist is Laura Seaver.Jamie Seaver is played by Kevin Chevalia.Hope Seaver is played by Veronica Lauren.Benj Thall is Peter Seaver.This isn't quite the same level with the first part, but it works.It's fun to watch the small quarrels between those animals.\"Cats Rule, dogs drool\" and that sort of stuff.",
         "Homeward Bound:The Incredible Journey was a beautiful charming film, that I have loved since childhood. And maybe it is just me but I feel it is underrated as well. This sequel is inferior, but in my mind, it is decent. It does have its problems, such as the lame direction, the not-so-crisp editing and one too many slow and corny moments in the plot. But what does compensate hugely is the witty script(of which Sassy gets the majority of the best lines), the lovely soundtrack and the voice acting. Michael J Fox and Sally Field once again do fine work, and while the late Don Ameche was a lot more noble and gentle, Ralph Waite does an above average job as the voice of Shadow the Golden Retriever. The animals also did wonderfully and came very close to stealing the show, and the camera-work is often excellent. All in all, worth the look, but be warned that it doesn't quite live up to its original. 7/10 Bethany Cox",
         "\"Homeward Bound: The Incredible Journey\" is a beautiful, charming, emotional and timeless classic, as well as one of the best animal movies. But I can't say the same about its sequel. \"Homeward Bound II: Lost in San Francisco\" is not a bad film. For a sequel, it's not all that bad. It is still entertaining enough and features the same main cast (except Don Ameche, who passed away in 1993). But the movie just can't reach the greatness of the first one, so the fact that it is disappointing comes to me as no surprise. This movie simply doesn't follow the spirit of the original neither the spirit of others like it. The plot is somewhat similar to the first one's. However, instead of the Sierra mountains, this one takes our 3 pet friends to the urban life, more precisely to the worst streets of San Francisco. Basically it focus more on desert roads, empty streets and dirty alleys. We don't see that much of San Francisco, neither of its most beautiful things. This is a radical contrast with the first movie's environment, which shows us all the beauty of pure nature in the Sierra mountains. In this film, our buddies Shadow, Chance and Sassy often face city's dangers, such as weird people, two dog catchers who lock street dogs in their van to take them to one of those creepy laboratories and two rival dogs: a vicious boxer-like dog and a goofy bulldog-like dog, despite the help of numerous street dogs (Riley and his gang). The two rival dogs are particularly annoying, especially the boxer-like dog. Most of the street dogs here are annoying either, except for Delilah (a beautiful Kuvasz) and Riley. As for the dog catchers, the driver isn't that annoying, but his partner is. On the other hand, the cute little boy Tucker was adorable and his cute kitten Tiger too. The movie isn't nostalgic, emotional or charming like the first one. While it has some funny gags, it isn't humor as pleasant as in the first one. The soundtrack isn't as good as in the first one, although this one still has some good music. One of the few really good things in this movie is the Golden Gate Bridge (the enormous bridge in San Franciso), a construction that always fascinated me.",
         "I thought it was pretty funny. I didn't know Will Sasso was in the movie, he is a good comedian. Chance and Sassy were really funny along with Pete and his partner. This movie was better than the first one. I usually don't like Animal movies but this was one of the only ones I ever liked. This is only my opinion, other's may very. I really like this movie because I'm a big comedy fan and this movie basically was a comedy. Not only that, it was a good heroic tale and shows the strength of family. I wish I could have a dog like Chance and Shadow (though I would like for them to actually speak). Check out the movie for yourself. If you don't like, there is nothing I can do about it, but I would recommend it to comedy lovers and drama lovers.",
         "Homeward Bound II is a sequel to the 1993 film on the same name about 2 dogs and a cat who go missing in a Home Alone style scenario and have to try and find there way back home. This time the family and the 2 dogs and the cat Sassy are off to Canada but one of the dogs(voiced by Micheal J Fox called Chance)ends up freaking out and Shadow(Ralph White) and Sassy(Sally Fields) also free themselves from the cages they were in and end up getting lost in San Francisco. Of course Chance ends up falling for Deliah later on in the movie and two men who are up to no good are after the dogs. So will they or won't they get back home in time to be reunited with their families again? Overall I really enjoyed this movie and I was glad I came across it in HMV this year for a bargain. If I see the original sometime out on DVD I will definitely be buying it too. The voice cast is great,the story is nice and the backgrounds are nice too. Its nice that the dogs mouths aren't moving like in Marmalade or that god awful Beverly Hills Chihuahua. 7/10",
         "Walt Disney Pictures bring back that lovable trio of Chance, Sassy and Shadow. The Seaver family led by Robert Hays is off on vacation and by hook or crook the family pets are not on the flight when the plane takes off. So that leaves Chance(voiced by Michael J. Fox), Sassy(voiced by Sally Field) and the wiser Shadow(Ralph Waite)to hit the mean streets of San Francisco in this sequel to HOMEWARD BOUND: THE INCREDIBLE JOURNEY. New friend Riley(voiced by Sindbad)helps navigate the hazards of the trek home across the Golden Gate Bridge. Chance even falls in love with a persuasive pooch Delilah(voiced by Carla Gugino). There are new things to sniff, friends to make and daring rescues to be made. These three very likable pets are bound to please all ages in this adventure. Others lending voices: Adam Goldberg, Bob Uecker, Tommy Lasorda, Al Michaels, Stephen Tobolowsky and Tish Campbell.",
         "Well maybe some peoples don't like this movie but I can say that is an enjoyable movie. I saw the two movies and I liked both. If someone want to spend a nice afternoon in front of TV then You can watch at Homeward Bound I or II. Sassy is like a lady from a high society , she despises the ordinary life, the ordinary dogs like Chance but in fact she is part from an ordinary life and she like this life. Is a movie for all family, for kids or for adults, take how you wish and in plus is an enjoyable movie. Watch at this movie that will bring a smile on your face."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "City Dogs Productions"
      ],
      "summaries": [
         "Shadow, Sassy and Chance are back! It's been three years since their trek through the woods and over the mountains. Now the family lives in San Fransisco and they're taking a vacation in Canada. Only problem, the pets escape from the airport while being put in the cargo area of the plane. Now their family is in Canada and the pets are all alone in San Fransisco. They meet scruffy bully dogs and a gang of rebel dogs all abandoned and have started their own group. Also looking for them is a \"Blood Red Van\" driven by bumbling dog catchers. Also Chance meets a girl dog and it's love at first bite.",
         "Shadow, Sassy, and Chance have to find their way home after they become stranded at the San Francisco International Airport as their owners fly to Canada on vacation."
      ],
      "budget": 0
   },
   "movielensId": 609,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-03-08",
      "dvdReleaseDate": "2002-04-23",
      "directors": ["David R. Ellis"],
      "runtime": 89,
      "movieId": 609,
      "title": "Homeward Bound II: Lost in San Francisco",
      "mpaa": "G",
      "actors": [
         "Michael J. Fox",
         "Sally Field",
         "Ralph Waite",
         "Robert Hays",
         "Kim Greist",
         "Michael Bell",
         "Tisha Campbell-Martin",
         "Al Michaels",
         "Tommy Lasorda",
         "Bob Uecker",
         "Tress MacNeille",
         "Jon Polito",
         "Adam Goldberg",
         "Sinbad",
         "Carla Gugino",
         "Stephen Tobolowsky",
         "Michael Rispoli",
         "Will Sasso",
         "Tom Wagner"
      ],
      "imdbMovieId": "0116552",
      "originalTitle": "Homeward Bound II: Lost in San Francisco",
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["sSfkkYgv_3o"],
      "plotSummary": "Your favorite talking animals are back! The film focuses on the further adventures of Shadow (voiced by Ralph Waite), Sassy (voiced by Sally Field), and Chance (voiced by Michael J. Fox). Shadow is the old, wise one and presumably the leader of the three. Sassy is the smart-aleck of the bunch, but helpful in times as well. Chance is the young, anxious one who usually gets into trouble and relies o",
      "tmdbMovieId": 25059,
      "avgRating": 3.03114,
      "releaseYear": "1996",
      "numRatings": 2858,
      "posterPath": "/6oFXtbLt9IyoK6rdvdt0ccF6hGP.jpg"
   }
}