{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "aunt",
            "id": 6894
         },
         {
            "name": "gentleman",
            "id": 182376
         }
      ],
      "imdb_id": "tt0116684",
      "video": false,
      "title": "Jane Eyre",
      "recommendations": [
         118895,
         61072,
         14651,
         17015,
         25985,
         37673,
         57289,
         77985,
         4153,
         4732,
         3573,
         21200,
         12254,
         42548,
         10399,
         44446,
         117233,
         59190,
         64310,
         20861
      ],
      "backdrop_path": "/7mPBUgeLYqwHoXpVPXD5GbXhFzC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Young Jane Eyre",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f81276ef",
               "name": "Anna Paquin",
               "profile_path": "/5Q4vZK2PqHkreQLmbPspIgrSLUP.jpg",
               "id": 10690,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Jane Eyre",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f81276f3",
               "name": "Charlotte Gainsbourg",
               "profile_path": "/hWUtcljrFsaSf9ZFTgjIoo4FxfQ.jpg",
               "id": 4273,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Rochester",
               "gender": 2,
               "credit_id": "52fe472dc3a36847f81276f7",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Mrs. Fairfax",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f81276fb",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "John Reed",
               "gender": 0,
               "credit_id": "52fe472dc3a36847f81276ff",
               "name": "Nic Knight",
               "profile_path": "/clkx4e0SKqGPDWUTtTE9ZFrX9pY.jpg",
               "id": 138560,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Eliza Reed",
               "gender": 0,
               "credit_id": "52fe472dc3a36847f8127703",
               "name": "Nicola Howard ",
               "profile_path": null,
               "id": 138561,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Georgina Reed",
               "gender": 0,
               "credit_id": "52fe472dc3a36847f8127707",
               "name": "Sasha Graff",
               "profile_path": null,
               "id": 138562,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Mrs. Reed",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f812770b",
               "name": "Fiona Shaw",
               "profile_path": "/74b0OuN3xKs0dTMYBnbhDLwv8Oq.jpg",
               "id": 10981,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Mr. Brocklehurst",
               "gender": 2,
               "credit_id": "52fe472dc3a36847f8127729",
               "name": "John Wood",
               "profile_path": "/bWt4JT9eGxFtu3q0iCAKFtNv5XK.jpg",
               "id": 8937,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Miss Scatcherd",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f812770f",
               "name": "Geraldine Chaplin",
               "profile_path": "/mnPoiJrhJjJArySW8wMpf84pCxu.jpg",
               "id": 400,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Miss Temple",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f8127713",
               "name": "Amanda Root",
               "profile_path": "/9YntDLcK36bsjxOmTgiy7uTRRVk.jpg",
               "id": 30318,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Helen Burns",
               "gender": 1,
               "credit_id": "52fe472dc3a36847f8127717",
               "name": "Leanne Rowe",
               "profile_path": "/dOuBoFD91xixhdcbmRpoEXdoXJI.jpg",
               "id": 3546,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe472dc3a36847f812771b",
               "name": "Richard Warwick",
               "profile_path": "/8IfGMRToIE1tdKN1CmJD2Ir9BBd.jpg",
               "id": 138563,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Leah",
               "gender": 0,
               "credit_id": "52fe472dc3a36847f812771f",
               "name": "Judith Parker",
               "profile_path": null,
               "id": 138564,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe472dc3a36847f81276c7",
               "name": "Franco Zeffirelli",
               "profile_path": "/rzu0vDf1FtvriZty1gJ1OwhrReN.jpg",
               "id": 24657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe472dc3a36847f81276cd",
               "name": "Charlotte Brontë",
               "profile_path": null,
               "id": 120999,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe472dc3a36847f81276d3",
               "name": "Hugh Whitemore",
               "profile_path": null,
               "id": 78517,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe472dc3a36847f81276d9",
               "name": "Franco Zeffirelli",
               "profile_path": "/rzu0vDf1FtvriZty1gJ1OwhrReN.jpg",
               "id": 24657,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe472dc3a36847f81276df",
               "name": "Claudio Capponi",
               "profile_path": null,
               "id": 138559,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe472dc3a36847f81276e5",
               "name": "Alessio Vlad",
               "profile_path": null,
               "id": 65250,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472dc3a36847f81276eb",
               "name": "Richard Marden",
               "profile_path": null,
               "id": 14931,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe472dc3a36847f8127725",
               "name": "David Watkin",
               "profile_path": null,
               "id": 10639,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.274773,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47333,
      "vote_count": 65,
      "budget": 0,
      "overview": "Jane Eyre is an orphan cast out as a young girl by her aunt, Mrs. Reed, and sent to be raised in a harsh charity school for girls. There she learns to be come a teacher and eventually seeks employment outside the school. Her advertisement is answered by the housekeeper of Thornfield Hall, Mrs. Fairfax.",
      "similar": [
         229297,
         11293,
         13528,
         8617,
         15356,
         10539,
         26367,
         22874,
         50299,
         28288,
         3587,
         24958,
         207937,
         108021,
         27224,
         67740,
         42344,
         22553,
         209154,
         251455
      ],
      "original_title": "Jane Eyre",
      "runtime": 112,
      "poster_path": "/cAcTKmzDGv8xfVNfDMSUXR3qiMX.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1996-02-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The passionate tale of forbidden secrets!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Franco Zeffirelli"],
      "runtime": 112,
      "synopsis": "Jane Eyre (portrayed as a child by Anna Paquin and as an adult by Charlotte Gainsbourg) is an independent and strong minded young woman who is hired by Mr. Rochester (William Hurt) to work as a governess. What she does not realize is that she must share the estate (and ultimately Mr. Rochester) with his wife, Bertha (Maria Schneider), who is, by this point in her life, mentally ill and kept locked away in an upstairs attic.",
      "writers": [
         "Charlotte Brontë",
         "Hugh Whitemore"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116684/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MTg5OTk1NV5BMl5BanBnXkFtZTcwOTI5MDQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: William Hurt, Charlotte Gainsbourg, Anna Paquin | See full cast and crew »"],
      "reviews": [
         "I love the story of Jane Eyre so much, to insult anything that has to do with this beloved character is not easy to say. But I must say how disappointed I was with this adaptation. William Hurt was a poor Rochester indeed. He had a very wooden and unemotional presence throughout the film. His scenes with the Jane Eyre character had no fire or emotion at all. He seemed very detached and aloof. If William Hurt was younger he would have played a better St. John. However, I must say Charlotte Gainsborough was a pretty good Jane Eyre. She looked the part and added very charming persona to the character. But she even, at times seemed cool and unattatched to me too. The worst element to this film was casting Elle McPherson as the role of Blanche. Why? Blanche Ingram was beautiful, true, but she was beautiful in the Victorian sense of the word, not a 90's waif snatched from a Parisian runway. Sheesh. The best element to this film, however was the sequences of young Jane and Helen at Lowood. Anna Paquin was amazing as she embodied the young Jane to near perfection. These early, well done scenes where the best in the entire movie but I regret to say they lead me down the primrose path to disappointment.",
         "What made the idea of seeing this movie so attractive was the hope that it would live up to Charlotte Bronte's brilliance of the original classic story. I was deeply disappointed to find that this movie, which seemed to be either written or filmed in great haste, had not the qualities that made the original novel so powerful. Much of the witty back and forth between the main characters, Jane Eyre and Mr. Rochester, seemed to be either missing from the screenplay or left on the cutting room floor. Also missing was Jane Eyre's charismatic sense of self, which enabled her to suffer through her turmoil and triumph over all. The original Jane Eyre was a hero. The woman in this movie did not seem to have much to triumph over, including one of the greatest parts of the story when Jane runs away from Thornfield and Mr. Rochester. Her struggle to find food and shelter, her shame at having to beg for bread, the threat of freezing to death in the cold, all to get away from a man she loved were, in my opinion, poignant parts of the story that were simply left out of this movie. The title character seemed dry and uninspired. The story was unappealing and for those who did not read the book, I cannot imagine that this story would be the least bit interesting. The screenplay and Direction did little if any credit to the classic story.",
         "Everything about this adaptation is quite good except for the terrible miscasting of Mr Method Acting himself, William Hurt. There is little chemistry between he & Charlotte G. How I cried out to see Alan Rickman, who would give an OUTSTANDING performance as Rochester! Anna Paquin is wonderful as little Jane, and Amanda Root from \"Persuasion\" gives us a warm Miss Temple at Lowood. Also good jobs by Geraldine Chaplin & Billie Whitelaw in small roles. This is worth renting out but not purchasing...",
         "I've seen 3 versions of this movie after having read Charlotte Bronte's book. The first was with Orson Wells as Mr. Rochester, the second with Ciaran Hinds, followed by William Hurt's version. Hurt's Rochester is the only one who didn't bring tears to my eyes. He is a wonderful actor, but it's as if this part was not suited to him. Mr. Rochester is a man of passion, pain, and jealousy; none of which were reflected in this story. The story is great, the actors are great, but story and actors are mismatched in this film. Another disservice is the failure of the movie to maintain the integrity of the book. Jane leaves Thornefield twice; once on the death of her aunt, and once again when left at the alter. In Bronte's book, Jane's travels and subsequent proposal of marriage after being left at the alter are somewhat cumbersome, but necessary to support her final return to Rochester, being willing to be with him under any terms. Unfortunately, these adventures are apparently difficult to incorporate into a film. Charlotte Gainsbourg's performance is the only one I've seen, and I'm anxious to follow her career. She seems to have the ability to well play suppressed emotion.",
         "I've seen this particular film adaptation of Jane Eyre four times, and I'm still not tired of it. As a faithful fan of the book Jane Eyre, I could not be more pleased with the cast and their faithfulness to Bronte's characters. There will never be another Mr. Rochester for me now that I've seen William Hurt craft his subtleties around this firey and complex man. Charlotte Gainsbourg in the difficult title role satisfies completely. They make an odd pairing for such a profound love story, but I BELIEVE THEM. I watch feeling as if it could only be Them telling the story, and that is perhaps why I keep coming back to the movie. I can't recommend this film enough.",
         "Bronte's novel JANE EYRE has been brought to screen several times so far. This adaptation filmed by Franco Zeffirelli seems to me the most individual one. The director does not copy the book but entails his personal feelings and evaluations to the strange fate of Jane Eyre throughout the movie. The film is made wonderfully: the cast, the music, the entire convention - It supplies the viewer with the right picture of the Victorian England. I particularly liked the scenes shot at Haddon Hall with William Hurt. He shines in his role! GREAT ACTOR! He memorably stresses Rochester's goodness combined with his boredom and fear of love, caused by his tragic life experience. The sense of suspicion is also felt throughout. Jane (Charlotte Gainsbourg) comes to Mr Rochester's castle and hears strange laughter. It is much later when it occurs that it was Rochester's insane wife (Maria Schneider). The way love is showed is very \"Zeffirellian\". He loves to show delicate love that is raising in time. There is a feeling on both sides, but it is Rochester who tries to show it first, especially because he considers Jane \"an angel of happiness\" that appeared in his tragic life. Jane is more \"shy\" but her way of dealing with Rochester changes, too. The \"Zeffirelian\" way of showing love is also expressed when applied to friendship. Consider how Franco Zeffirelli shows the friendship between Helen Burns (Leanne Rowe) and Jane Eyre (Anna Paquin). One of the most touching moments of the movie is when Helen Burns dies and tells Jane that God cares for us. She was the girl that could notice everyone, even the orphan who was let down and terribly ignored by pious and pure \"victorian teachers\". Faith, open eyes connected with love and open heart is what Zeffirelli loved to show in most of his films. The music is one of the best from the films I have seen so far. It's very moody but supplies the viewer with wonderful, sometimes even mystical experience. For long after seeing the film for the first time, the music, somehow unconsciously, rang in my ears. Really worth attention! Maybe some people will treat my opinion with some irony but I must say that Zeffirelli's JANE EYRE can be watched many times and each time one can discover something new, something valuable, teaching, and moving. TOUCHED INTO TEARS! That's what I feel whenever I watch this incredible film.",
         "I watched this film shortly after re-reading the novel. I was positively intoxicated by it: the music, the acting, the actors, the plot. For the first time ever, I was enjoying Jane Eyre. Then, suddenly, the movie was ending. The last 10 chapters of the book had been condensed into about 20 minutes. That would be no big deal, except that they are the most important 10 chapters of the entire novel. Otherwise, the ending makes no sense. This is exactly what happened and it ruined an otherwise excellent movie. My advice: watch the movie until the last 20 minutes. Then read the book.",
         "I don't like using the word \"awful\" to describe any work of the cinema for which a great deal of time, effort, talent and money is spent in its creation but Zefferelli's attempt to adapt Charlotte Brontë's novel 'Jane Eyre' is a total waste of time. The script is lacking in finesse and power, everything explained to the viewer in no uncertain terms, leaving little to the imagination. The lead actors are woefully miscast, clearly hired for their star names, and the musical score drippy and dull. Charlotte Gainsbourg and William Hurt have absolutely no chemistry with one another at all. She is like a wet noodle, worse even than Joan Fontaine, who at least was capable of some modicum of emotional involvement in what should be a story of frustrated passion. And William Hurt acts the entire film on one tone and that tone is flat and devoid of energy. Of course the limp and vapid script does not aid any of these otherwise fine actors in their efforts to bring any whiff of life to this flick. Joan Plowright's Mrs Fairfax is like some Disney creation who keeps popping up to sweeten scenes in which she would have been best left out. There is no mystery surrounding the story of Rochester's first wife. The role of the would-be second wife, played like a Barbie Doll by Elle MacPhearson, is an empty cipher. Fiona Shaw, a very great actress, is completely wasted as Jane's Aunt, Mrs Reed. She would have been better-cast as Mrs Fairfax. Only Amanda Root, as Jane's beloved school teacher, evokes any authentic sympathy or believability. I saw this version of 'Jane Eyre' after viewing Robert Young's for British television, made in 1997, starring Ciaran Hinds, Samantha Morgan and Gemma Jones. There is no comparison. Young's vital, romantic and deeply moving version is like an exploding nova compared to Zefferelli's wet squib. I will be interested now to see the 1970 version with Timothy Dalton, about which I've read some very good things on this web-site. I am amazed at how many people liked Zefferelli's Yorkshire picture book. About all I can say good about this film is that the house is beautiful and the cinematography vividly colored, beyond that it is a complete dud.",
         "What was Franco Zeffirelli thinking? Was Hollywood responsible for this travesty, or can I take comfort in the idea that someone who didn't speak English as a first language just completely missed the point of Charlotte Bronte's classic? I don't think I can improve on a comment I read below, so I'll just paraphrase it: \"Jane Eyre is a great great book, the screenwriter should read it sometime.\" It's true that this movie's two leads were sadly miscast. But pity the actors, because the screenwriter left out all of the best scenes. The dialog that makes you understand the Jane and Rochester have a meeting of minds and a shared sense of fun...deleted from the script. The marriage proposal, the fortune teller...gone. The allusions, half joking, half sincerely felt, to Jane as a fairy sprite from olde England come to rescue Rochester in his despair...eliminated. It is unfortunate that Zeffirelli felt the need to completely rewrite the end of the novel and Jane's interactions with the Rivers family. But it is unforgivable that he has surgically removed the love from one of the best love stories ever written. Do yourself a favor and go find the 1983 (?) mini series with Timothy Dalton.",
         "Having read the novel before seeing this film, I was enormously disappointed by the wooden acting and the arrogance of the producers in their blatant disregard of the plot. I feel this film in no way reflects the brilliance of Bronte's work, and rather gave the impression of a shallow love story. In the condensing of the film to a short 2hours, the film lost many of the key features which make the book comprehendable and progressional, thus resulting in a somewhat jumpy plot with little grounding. There is no build up to the romance between Rochester and Jane Eyre, so this appears rather abrupt and unfounded since the two characters have such infrequent interaction you cannot help but imagine their 'love' is superficial. This is such an injustice to Bronte's novel;you are given no impression of Jane's quirky cheek and boldness which attracts Rochester to her, and his arrogance which attracts Jane to him. Despite to poor scripting, I think that a few of the characters were portrayed very astutely, namely Mrs Fairfax and Grace Poole, however overall the production was poor. Given a better scripting, perhaps the film would have been more successful. See \"Jane Eyre\" (1970) with Zelah Clarke and Timothy Dalton for an outstanding production."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cineritino S.r.L.",
         "Flach Film",
         "Mediaset"
      ],
      "summaries": [
         "Jane Eyre is an orphan cast out as a young girl by her aunt, Mrs. Reed, and sent to be raised in a harsh charity school for girls. There she learns to be come a teacher and eventually seeks employment outside the school. Her advertisement is answered by the housekeeper of Thornfield Hall, Mrs. Fairfax.",
         "Jane Eyre, orphaned, is left to live under the charity of her Aunt Reed. After living ten years of mistreatment and segregation in her Aunt's home, she is then sent to Lowood- a boarding school for young girls. Jane grows up both physically and mentally at Lowood and becomes a teacher at age eighteen. She then advertises for the position of a governess and is called upon by Mrs Fairfax at Thornfield. At Thornfield, Jane falls in love with the master, Mr Rochester, and he with her. However, he yields a terrible and dark secret that threatens to tear them apart for good."
      ],
      "budget": 0
   },
   "movielensId": 613,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1996-02-09",
      "dvdReleaseDate": "2003-02-04",
      "directors": ["Franco Zeffirelli"],
      "runtime": 112,
      "movieId": 613,
      "title": "Jane Eyre",
      "mpaa": "",
      "actors": [
         "Anna Paquin",
         "Charlotte Gainsbourg",
         "William Hurt",
         "Joan Plowright",
         "Nic Knight",
         "Nicola Howard ",
         "Sasha Graff",
         "Fiona Shaw",
         "John Wood",
         "Geraldine Chaplin",
         "Amanda Root",
         "Leanne Rowe",
         "Richard Warwick",
         "Judith Parker"
      ],
      "imdbMovieId": "0116684",
      "originalTitle": "Jane Eyre",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["jKvO2TYPuTw"],
      "plotSummary": "Jane Eyre is an orphan cast out as a young girl by her aunt, Mrs. Reed, and sent to be raised in a harsh charity school for girls. There she learns to be come a teacher and eventually seeks employment outside the school. Her advertisement is answered by the housekeeper of Thornfield Hall, Mrs. Fairfax.",
      "tmdbMovieId": 47333,
      "avgRating": 3.6344,
      "releaseYear": "1996",
      "numRatings": 2898,
      "posterPath": "/cAcTKmzDGv8xfVNfDMSUXR3qiMX.jpg"
   }
}