{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "switzerland",
            "id": 1223
         },
         {
            "name": "worker",
            "id": 2346
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "hardship",
            "id": 157192
         },
         {
            "name": "xenophobia",
            "id": 160910
         },
         {
            "name": "foreigners",
            "id": 214887
         }
      ],
      "imdb_id": "tt0070506",
      "video": false,
      "title": "Bread and Chocolate",
      "recommendations": [
         81775,
         65573,
         110447,
         56233,
         47367,
         56402
      ],
      "backdrop_path": "/3YSEZRZDwYpwOgqNeFlwLjz7YFI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Nino Garofalo",
               "gender": 2,
               "credit_id": "52fe47e9c3a36847f814eb7b",
               "name": "Nino Manfredi",
               "profile_path": "/uDnI9viHJVh9yvcfRYnGSx7mfwW.jpg",
               "id": 37583,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Italian Industrialist",
               "gender": 2,
               "credit_id": "52fe47e9c3a36847f814eb7f",
               "name": "Johnny Dorelli",
               "profile_path": null,
               "id": 21234,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Elena",
               "gender": 1,
               "credit_id": "52fe47e9c3a36847f814eb83",
               "name": "Anna Karina",
               "profile_path": "/dEx50cajhgno1eK9A7bBBMmgA8g.jpg",
               "id": 18197,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Gianni",
               "gender": 0,
               "credit_id": "52fe47e9c3a36847f814eb87",
               "name": "Paolo Turco",
               "profile_path": null,
               "id": 143598,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Old Man",
               "gender": 0,
               "credit_id": "52fe47e9c3a36847f814eb8b",
               "name": "Ugo D'Alessio",
               "profile_path": null,
               "id": 142132,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47e9c3a36847f814eb65",
               "name": "Franco Brusati",
               "profile_path": "/3FS1JWTtUDdJ2Cn8GVI1stt7wYV.jpg",
               "id": 49552,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47e9c3a36847f814eb6b",
               "name": "Franco Brusati",
               "profile_path": "/3FS1JWTtUDdJ2Cn8GVI1stt7wYV.jpg",
               "id": 49552,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47e9c3a36847f814eb71",
               "name": "Jaja Fiastri",
               "profile_path": null,
               "id": 143597,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe47e9c3a36847f814eb77",
               "name": "Nino Manfredi",
               "profile_path": "/uDnI9viHJVh9yvcfRYnGSx7mfwW.jpg",
               "id": 37583,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.425529,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 51242,
      "vote_count": 12,
      "budget": 0,
      "overview": "Italian immigrant tries to become a member of Swiss society but fails as a waiter and even as a chicken plucker. He then becomes involved with shady wealthy character and tries to hide his Italian identity. He refuses to give up no matter how awful his situation.",
      "similar": [
         2539,
         340837,
         2976,
         16427,
         8841,
         1713,
         1986,
         19181,
         34666,
         7992,
         302376,
         34752,
         64015,
         258529,
         8972,
         282550,
         38427,
         30195,
         279027,
         135338
      ],
      "original_title": "Pane e cioccolata",
      "runtime": 100,
      "poster_path": "/avYBMsT8qj3A5xR68WAMvR5bLL6.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1974-05-05",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "You'll Laugh Till Your Heart Breaks",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Franco Brusati"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Franco Brusati",
         "Franco Brusati"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0070506/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NjM5MDkzMl5BMl5BanBnXkFtZTcwMDcxNzIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Nino Manfredi, Anna Karina, Johnny Dorelli | See full cast and crew »"],
      "reviews": [
         "For the Italian cinema this is an important film. Not only because there's a big actor -Nino Manfredi- but because it's based on real situations of the time it was made... In the Sixties and Seventies Italian and Spanish workers were the biggest immigrant groups in Switzerland. \"Pane e cioccolata\" talks about the experiences and difficulties of an Italian waiter in this country. Of course, some situations are caricatural, nevertheless the movie still keeps its strength because everything it's credible. Manfredi's character wants to remain in Switzerland because he believes he can make enough money to help his family, he dreams of carrying there wife and children and giving them a better life. We laugh a lot, at the same time there's much sadness because we see someone who tries everything to integrate in another society, without success. A bittersweet comedy, Italians are among the best moviemakers for mixing different feelings and talking about life.",
         "Great tale about the \"joys\" of being an immigrant in 70's Switzerland and being rejected from their society for anything other than for labor. It's all in the title, no connection to the popular \"pane e Stella\" Italian snack here, rather the bread is a metaphor for the immigrants who have little choice but working abroad to put bread on their families table, while the chocolate refers to the luxury Swiss product and symbolizes that country's wealth. It's bread and chocolate as in rich and poor, as in eating for survival as opposed to eating for pleasure, as in immigrant and swiss, etc.",
         "I was four when Bread and Chocolate played at a small theater in San Francisco. My mother decided to take me(no babysitter). The story I've heard many, many times was that I was upset with her that she wouldn't (although now I realize it was more that she couldn't) read the subtitles to me. I eventually became frustrated with her and moved two isles over. My mom has said that she would turn to watch me and although I couldn't truly read the subtitle or comprehend the language, I laughed continually throughout the movie. She said I truly enjoyed Bread and Chocolate. Many years later I rented the movie and it's amazing. It's exactly as I remembered it. Truly a gem of a movie, though the second time around I was able to fully grasp the meaning of this movie. It's universal and it's timeless. I now own this on DVD and have enjoyed sharing it with my family and friends. Certainly a must see movie!",
         "I saw this film when it first came out and fell in love with it. Having spent some time in Switzerland, I knew the truth of the rejection of foreign workers, and I saw the places where they lived in great poverty, in the midst of rich, glittering inter- national crowds. The bigotry was (and still is to a great extent) painfully true. This is one of those marvelous films that makes one cry and laugh, almost simultaneously. As many have said before, it is Chaplinesque. I especially appreciated hearing the various languages actually spoken by the characters - German, Italian, Greek, Turkish. The subtitles help the viewer very well indeed, but the sound of the actual languages enhances the verisimilitude of the story. Just recently I have, after more than 20 years of searching, discovered that this film is on video tape, and I can't wait to acquire it - at long last!",
         "If all the film-festival awards this movie has won haven't convinced you to see it, then my review probably will not either. Regardless, it is important to know how well-done this movie truly is. Nino Manfredi does an absolutely stellar performance as a poor Italian immigrant trying to fit in in a world which dislikes him and his kind. From the start, this seems like a regular enjoyable comedy, but quickly transitions into both a comedy and a drama. On the one-hand, Manfredi's Chaplinesque \"loveable loser\" character is both endearing and hilarious. On the other hand, the film offers true insight into the problem of immigrational bias and cultural dissimilarity, and a stabbing insight into the premise of a national identity; how it is both meaningless and yet extremely important. This film deserves every award it received and then some.",
         "This film about the struggles of an Italian immigrant in Switzerland generates bizarrely conflicting emotions; indeed at times you don't know whether to laugh or cry! I saw this years ago when I was at university and I expect it has dated in the sense that the status of immigrants has changed a lot since then. It may even be disquieting at times for those who have grown-up believing that they must never laugh at particular social groups, but the film is clearly sympathetic to those whose dignity is compromised daily by their circumstances of life. I defy anyone not to cry with laughter at the restaurant and chicken-coop scenes.",
         "This movie brilliantly and movingly, but always with a lot of irony, describes the plight of an Italian migrant laborer in Switzerland. Some scenes are among the best in the history of cinema. A group of migrant laborers are doing some filthy work in a ramshackle barn. Through a small window they see some beautiful young Swiss adolescents riding on horse back. These youngsters look like gods compared to the poor ants in the barn! In another scene the hero of the film has been trying very hard for some time to assimilate, to become even more Swiss then the Swiss themselves. But he can't suppress his deep feelings of identity for ever. One day he enters a pub and watches a soccer match between Italy and Switzerland. At a certain moment he can't control himself any more and starts shouting to encourage the Italian team. He makes such a nuisance of himself that the Swiss throw him out. Utterly brilliant!",
         "This is a warm, wonderful film. It is touching and funny and one of the very best \"humanistic\" films from Italy after Fellini lost his touch. It's hard to understand why this film is so little know to younger movie buffs. If you can find it, take a look!",
         "When this comedy came out in the 70's, it was aptly described as \"Chaplinesque\". The hero, a coarse Italian immigrant in Switzerland, is as much an Everyman as Chaplin's Tramp. The movie was a hit in the US, winning the NY Critics' Award for Best Foreign Film. Nino Manfredi is funny and touching as the earthy immigrant, the \"bread\" in the land of refinement (\"chocolate\"). Anna Karina is stunning as the Greek stowaway who shares some of the same predicament as Manfredi. The \"chicken coop\" sequence is particularly hilarious. I think this is one movie that deserves to be transformed into a Broadway musical. How about it, Mr. Sondheim?",
         "(Some spoilers) This was a very popular film when it was first shown in America in 1978, about five years after its Italian release, and was probably one of the best-known and liked Italian film among the general public in America, along with LA DOLCE VITA, CINEMA PARADISO, and LIFE IS BEAUTIFUL. It was directed by Franco Brusati, and this may be his best achievement. This immensely famous bittersweet comedy stars Nino Manfredi as a Chaplinesque immigrant waiter, Nino, trying desperately to assimilate among the cool and methodical Swiss. His presence in the country is as a temporary worker and much of his time is spent trying to stay afloat and to avoid deportation. Right from the start the film captures the pain and confusion of the outsider with incisive precision, as when he is denounced for public urination. There are many great scenes. One is when Nino finds employment in a chicken farm and lives among a family of eccentrics who find the impersonation of chickens to be the highest of mankind's callings. Another scene, in which Nino watches a group of Swiss youth bathing in a lake and looking like gods in some kind of sensual Valhalla, encapsulates his feelings of inferiority and alienation. An Italian worker \"drag show\", funny and sad, is performed by these men that have left behind friends and family in \"sunny Italy\", to return only at Easter and Christmas. Another great moment occurs when Nino modifies his appearance to attempt to look more north-European, and cannot help but revert to his Italian persona when the locals cheer on the Swiss soccer team and he vociferously applauds an Italian goal. Nino Manfredi rarely had a better role than this one, and Anna Karina, with whom he is tentatively in love, is fine as Elena, the Greek teacher-in-exile with a musical-prodigy of a young son. Johnny Dorelli is memorable as the wealthy Italian industrialist who befriends Nino, but who overdoses when confronted with financial ruin, taking with him some of Nino's own money. Bad luck dogs our hero, but he seems to emerge from the tunnel of despair with renewed hope\u0085and literally so at the film's end. The term \"Bread and Chocolate\" in Italian refers to a snack of Nutella spread on bread and is the equivalent of \"peaches and cream\" or \"fine and dandy,\" which is used with irony here in this great \"commedia all'italiana.\""
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Verona Produzione"],
      "summaries": [
         "Italian immigrant tries to become a member of Swiss society but fails as a waiter and even as a chicken plucker. He then becomes involved with shady wealthy character and tries to hide his Italian identity. He refuses to give up no matter how awful his situation.",
         "Nino è emigrato in Svizzera e fa il cameriere. E' contento di quella che considera la sua nuova patria, ma gli italiani in Svizzera non sono ben visti ed è un brutto giorno quando a Nino viene tolto il permesso di soggiorno stagionale. Decide comunque di restare nel paese come clandestino. Poi incontra un industriale italiano che lo aiuta, ma l'aiuto durerà poco. Pur di superare il pregiudizio degli svizzeri si traveste da uno di loro, solo per peggiorare le cose. Alla fine, ottenuto il sospirato permesso, Nino deciderà però di tornare in Italia..."
      ],
      "budget": 0
   },
   "movielensId": 615,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1974-05-05",
      "dvdReleaseDate": "2002-02-12",
      "directors": ["Franco Brusati"],
      "runtime": 100,
      "movieId": 615,
      "title": "Bread and Chocolate",
      "mpaa": null,
      "actors": [
         "Nino Manfredi",
         "Johnny Dorelli",
         "Anna Karina",
         "Paolo Turco",
         "Ugo D'Alessio"
      ],
      "imdbMovieId": "0070506",
      "originalTitle": "Pane e cioccolata",
      "genres": [
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Italian immigrant tries to become a member of Swiss society but fails as a waiter and even as a chicken plucker. He then becomes involved with shady wealthy character and tries to hide his Italian identity. He refuses to give up no matter how awful his situation.",
      "tmdbMovieId": 51242,
      "avgRating": 3.8609,
      "releaseYear": "1974",
      "numRatings": 665,
      "posterPath": "/avYBMsT8qj3A5xR68WAMvR5bLL6.jpg"
   }
}