{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "spain",
            "id": 514
         },
         {
            "name": "madrid",
            "id": 744
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "suicide attempt",
            "id": 1252
         },
         {
            "name": "novelist",
            "id": 155251
         },
         {
            "name": "old woman",
            "id": 172972
         }
      ],
      "imdb_id": "tt0113083",
      "video": false,
      "title": "The Flower of My Secret",
      "recommendations": [
         8223,
         8219,
         8222,
         8221,
         267,
         56810,
         2469,
         8220,
         102492,
         4203,
         226343,
         429866,
         118898,
         184915,
         4499,
         75503,
         44607,
         194246,
         313563,
         130457
      ],
      "backdrop_path": "/bjdYQKIXwYrFx0uJmGoZqafEMP3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Leo Macías",
               "gender": 1,
               "credit_id": "52fe43bac3a36847f806ae83",
               "name": "Marisa Paredes",
               "profile_path": "/aDfNPZ2plaCmdrYkCkburjBqYnP.jpg",
               "id": 954,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Ángel",
               "gender": 2,
               "credit_id": "52fe43bac3a36847f806ae87",
               "name": "Juan Echanove",
               "profile_path": "/viRJjqoYTf3LqIhiyXZtXykVszW.jpg",
               "id": 36277,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Betty",
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806ae8b",
               "name": "Carme Elias",
               "profile_path": "/zdEM6b1NGwOWKd6rgmPnRCpPedw.jpg",
               "id": 36278,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Rosa",
               "gender": 1,
               "credit_id": "52fe43bac3a36847f806ae8f",
               "name": "Rossy de Palma",
               "profile_path": "/3IH9ZBUcFNwBr8IcS1RZhMKTpeg.jpg",
               "id": 25258,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Madre de Leo",
               "gender": 1,
               "credit_id": "52fe43bac3a36847f806ae93",
               "name": "Chus Lampreave",
               "profile_path": "/dwoyRWC5Nyo2UgE7M6AjqJWSAAD.jpg",
               "id": 3482,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Manuela",
               "gender": 1,
               "credit_id": "52fe43bac3a36847f806ae97",
               "name": "Kiti Mánver",
               "profile_path": "/3xChWWE9LTCspCqWbxZrZmixXRY.jpg",
               "id": 16975,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Antonio",
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806ae9b",
               "name": "Joaquín Cortés",
               "profile_path": "/t0C1otbXmDS0ddBCgmzkSln2nGg.jpg",
               "id": 36279,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Blanca",
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806ae9f",
               "name": "Manuela Vargas",
               "profile_path": "/dtyUQRdk5sOYj5UwJyMh2Ep91B9.jpg",
               "id": 36280,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Paco",
               "gender": 2,
               "credit_id": "52fe43bac3a36847f806aea3",
               "name": "Imanol Arias",
               "profile_path": "/kBM23IB6xM722b1nNW9lHk1JJDy.jpg",
               "id": 36281,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Alicia",
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806aea7",
               "name": "Gloria Muñoz",
               "profile_path": "/ycFzWFeudpbWVpSxZ3jDuUNIZII.jpg",
               "id": 36282,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Tomas",
               "gender": 2,
               "credit_id": "52fe43bac3a36847f806aeab",
               "name": "Juan José Otegui",
               "profile_path": "/bvHs28JNWSri8sJcqYK5dEFLHAE.jpg",
               "id": 36283,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Neighbor A",
               "gender": 0,
               "credit_id": "59555e569251412b310577af",
               "name": "Alicia Agut",
               "profile_path": "/yIihKpIBKJZ2g2trsB4CXq2PDWf.jpg",
               "id": 25221,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Doctor A",
               "gender": 2,
               "credit_id": "598ce48fc3a36875c00000e8",
               "name": "Jordi Mollà",
               "profile_path": "/2XEuPT0T9SRwcpsOXD9vMpm4Vad.jpg",
               "id": 31384,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43bac3a36847f806ae49",
               "name": "Pedro Almodóvar",
               "profile_path": "/9dc8NqjMnOcZ8EiUvaAQiMiT4Tz.jpg",
               "id": 309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43bac3a36847f806ae4f",
               "name": "Pedro Almodóvar",
               "profile_path": "/9dc8NqjMnOcZ8EiUvaAQiMiT4Tz.jpg",
               "id": 309,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe43bac3a36847f806ae55",
               "name": "Dorothy Parker",
               "profile_path": null,
               "id": 30520,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe43bac3a36847f806ae5b",
               "name": "Esther García",
               "profile_path": null,
               "id": 93,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43bac3a36847f806ae61",
               "name": "Agustín Almodóvar",
               "profile_path": "/4IaZOzYR2gVFpYdmV8rRrNGLT5J.jpg",
               "id": 952,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43bac3a36847f806ae67",
               "name": "Alberto Iglesias",
               "profile_path": "/2PGZyiqdAAyi2S0ZpFw5V0ojCqY.jpg",
               "id": 405,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806ae6d",
               "name": "Miguel López Pelegrín",
               "profile_path": null,
               "id": 36273,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806ae73",
               "name": "Max Mara",
               "profile_path": null,
               "id": 36274,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806ae79",
               "name": "Ermenegildo Zegna",
               "profile_path": null,
               "id": 36275,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43bac3a36847f806ae7f",
               "name": "Hugo Mezcua",
               "profile_path": null,
               "id": 36276,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "598cc9a49251414c52000431",
               "name": "José Salcedo",
               "profile_path": null,
               "id": 413,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "598cc9d3c3a3683aaa000481",
               "name": "Bernardo Menz",
               "profile_path": null,
               "id": 3792,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "58484874c3a368141400a393",
               "name": "Affonso Beato",
               "profile_path": null,
               "id": 3656,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "598cc9b79251414c52000449",
               "name": "Esther García",
               "profile_path": null,
               "id": 93,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.70563,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 4307,
      "vote_count": 58,
      "budget": 0,
      "overview": "Marisa Paredes is Leocadia (\"Leo\") Macias, a woman writing “pink” romance novels under the alias of Amanda Gris that are very popular all across Spain. Unlike her romantic novels, her own love life is troubled. Leo has a less than happy relationship with her husband Paco, a military officer stationed in Brussels then later in Bosnia, who is distant both physically and emotionally.",
      "similar": [
         334,
         8967,
         2288,
         4347,
         11631,
         69,
         319,
         401,
         745,
         858,
         470,
         111,
         39254,
         340666,
         244772,
         277216,
         11012,
         10054,
         392,
         425
      ],
      "original_title": "La Flor de mi Secreto",
      "runtime": 107,
      "poster_path": "/a7u61EMTQYWfDIupBMUPIGO4Nc1.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "El Deseo",
            "id": 49,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ciby 2000",
            "id": 105,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-22",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Every woman has a secret...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pedro Almodóvar"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Pedro Almodóvar"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0113083/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMTM1OTQ3MV5BMl5BanBnXkFtZTcwNjQ1MzgyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Marisa Paredes, Juan Echanove, Carme Elias | See full cast and crew »"],
      "reviews": [
         "The title of Almodovar's later film, All About My Mother, was a nod of respect in the direction of the 1950 Hollywood film, All About Eve, which contains Bette Davis's famous line - \"Fasten your seat belts, it's going to be a bumpy night\". This quote could well appear at the start of most of the Spanish director's films, certainly Flower. Here, the rider on his emotional rollercoaster is Leocadia (Leo) Macias (Marisa Paredes), whose marriage and life are in crisis. She is not as young as she was, and her handsome husband Paco (Imanol Arias) has lost interest and is about to leave her. The \"secret\" of the title is that Leo writes romantic novels under an assumed name, but hers is not the only secret revealed in the movie. Spoiled and self-centred Leo is not the most likeable of women; her sister Rosa (the wonderful Rossy de Palma) who looks after their aged mother probably deserves more of our sympathy. But the nicest people don't necessarily provide the most interesting stories; and Almodovar isn't trying to enlist our pity, but our understanding. If, according to the oft-quoted screenplay dictum, character is defined by action, then what he shows us is a courageous character who overcomes her self-pity, and takes up life and love again. Leo comes to terms with her loss, in much the same way as the mother in film's opening scene finally accepts that her son is dead. But that episode turns out to be a repeatable training session for doctors, so perhaps Almodovar is warning Leo that loss of love can take place more than once, or possibly he is suggesting to the audience that they regard Leo's story as a training session for life. This unashamed melodrama is conveyed via magical acting, great camerawork, and above all intense colours. There are a few specifically Spanish touches, including a sequence where Leo and her mother return to their idyllic, picturesque family village, and a flamenco dance (to Miles Davis music). As usual, there are also reminders of the downsides of modern urban life, though some of the references to drugs and unemployment are a little forced and superfluous. All in all, this is a great pictorial story teller telling perhaps not his greatest tale, but certainly one worth listening to and seeing.",
         "Flor is one of Pedro's understated best. The incomparable Marisa Paredes gives this film its ultimate power. Her extraordinary face details every nuance of the loss of her marriage--\"abandonment,\" as Sr. Almodovar labels it. The rich flamenco scenes reframe the passion and pain Marisa's character moves through during the film. And as nearly always, Sr. A. pays homage here to other works that have informed his vision--a barrage of brilliant and troubled women writers (Djuna Barnes, Dorothy Parker, Carson McCullers, et al.), and \"Casablanca\" and \"Rich and Famous,\" for instance. I thank God for Pedro. Without him, life would be as the lyrics of the Bola de Nieve song in this film--\"no me dejes vivir.\"",
         "The film famed for pivoting Almodovar's move away from formless farce to the rich delights of melodrama, which would produce his two masterpieces, LIVE FLESH and ALL ABOUT MY MOTHER. SECRET isn't quite up to those films (the mix of comedy and drama isn't quite digested) but is a wonderful start, with its amazing heroine, whose delusions and needs are revealed but never resolved; its typically eccentric supporting cast; its ruminations on the artist and her art - there are writers, editors, dancers, filmmakers all in the film - and secrets, both private and public; its silly men; its use of interiors and decor; Almodovar's still cherishable, unparalleled use of colour, allied with a new found sense of composition (the later films would reveal his increasing mastery of the camera); some extraordinary shots, especially the paper shower during the students' demonstration.",
         "Having seen most of Almodovar films, I have to say I prefer his more hilarious, comical, absurd ones. High heels, Talk to her are two other examples of Almodovar doing almost straightforward \"drama\" - though not the usual drama fare. That said, this touched me a lot. Without excluding some typically unusual -hillariously funny- Almodovar dialogues and \"usual suspects\", this film is about pasiion, lust, bitterness, disappointment, joy. It is, after all, about life. Acting of the lead actress is top notch, it's human as far as it goes. No silly plot tricks, no deus ex machina, this is not another sorry a$$ American drama with easy solutions or a bright happy end. Almodovar is one of the greatest artists of film!",
         "Some viewers have placed this exciting film 'La Flor de mi secreto' into the 'not up to standard' Pedro Almodóvar films, a classification this viewer finds difficult to understand. Filmed in the luxuriously colorful palette (especially the repeated use of the color red in every scene) that has become his trademark, set with a musical score that includes Spanish song and guitar and flamenco, and introducing a wildly disparate group of over-the-top women played by a bevy of fine actresses - it all seems echt Almodóvar to me. No, there is not the outrageous side of gender bending that suffuses many of his more popular films, but there is a fine story that resonates throughout this remarkable movie that makes it very much worth the attention of lovers of Spanish cinema. The film opens during the credits on a woman being informed that her 16-year old son is brain dead as a result of a motorcycle accident and two young doctors (including the irrepressible young Jordi Molla) are trying to convince her to allow the respirator to be disconnected and the boy's organs harvested for donor transplant. Sad, tense though this opening is we discover soon enough that the trio are actors making a demo film for medical personnel to learn to deal with such possible family encounters! Point: what appears to be a tragedy becomes a 'farcical depiction' guided by a seminar leader Betty (Carmen Elías). Flash into a different scene and we me Leo (the immensely talented Almodóvar favorite Marisa Paredes), depressed to the extreme over the failure of her marriage to her beloved Paco (Imanol Arias), a NATO 'soldier' who took assignments as far from Leo as possible. Now Leo continues to write her trashy novels she has never had published while clinging to the Paco (she wears his clothes, currently his boots) she cannot recover. Noting that the boots are too tight she leaves her typewriter to flee into the streets to find someone to remove the painful boots and after frustrating encounters with less than helpful people, she turns to her best friend Betty (yes, at a seminar!) who successfully removes the shoes. It seems Paco had an affair with Betty, a fact that further flails at Leo's pain. Betty assuages her by introducing her to a literary editor Ángel (Juan Echanove) who asks Leo to come on staff as a critic - most particularly to review the 'example manuscript' Leo has presented him in applying for the job. The reaction is predictable and Leo is at odds with how to continue her life. Along the way of the story Leo gets advice from her hilarious mother and sister (Chus Lampreave and Rossy De Palma in typical Almodóvar creations!) and from her maid Blanca (Manuela Vargas) and Blanca's son Antonio (Joaquín Cortés) who perform Spanish ballet as a side line (and incredibly well, too - with some wonderful flamencoesque moments of artistic relief). Coincidences happen that allow Leo to ultimately catch a new perspective on her life without Paco - in a most unexpected way. So what is not to love about this Almodóvar opus? For this viewer, absolutely nothing. It is a delight from beginning to end and deserves reconsideration in placement in the gifted director's echelon of works. Highly Recommended.",
         "In a very short period of time I've seen several of Pedro Almodóvar's movies and I've become a fan of his work. I love his style of mixing drama with (sometimes absurd) humor and music. I like the fact that he always knows to make you feel as if you know the characters personally after seeing the movie... Having said this, I have to admit that I was a bit disappointed by \"La flor de mi secreto\". The characters aren't as well developed as I'm used to see in his movies and it's sometimes very hard to care for his main character: Leo Macías (Marisa Paredes). As Amanda Gris (her pseudonym), she is a writer of very successful sentimental novels who deal about love, sex and happy endings. But her personal life is a complete mess. She doesn't want to write this kind of novels anymore and she gets an assignment from a magazine to write a review on the work of... Amanda Gris. Her relationship with her man isn't any good. He works for the Nato, is more abroad than at home and when he's at home he wants to leave as soon as possible. She drinks too much, her mother is a cause of many concerns... She wants to change her whole life, but it isn't as easy as she hoped it would be. Even though the story isn't bad or boring, it doesn't really succeed to be as captivating as I would like it to be. The positive thing about this movie is that you already can see Almodovár's talent for the use of humor and music, great camera work, interesting story telling... sipping through. Things that became more obvious in his later work. This movie may not be the best example of his work, but it is worth a watch. I give it a 6/10.",
         "The drama that had been explored in the erstwhile comedic TACONES LEJANOS takes center stage in Pedro Almodovar's LA FLOR DE MI SECRETO (THE FLOWER OF MY SECRET as it's known in English, even when \"flower\" is at the same time a literal misnomer and a symbolic term). Of course, it's not without some incursions into mis-direction. At first, it seems that it's going to be a drama about a mother (Kiti Manver) who is informed that her sixteen-year old son has become brain-dead following a motorcycle accident. It takes time for the mother to realize that her son will no longer be with her. The doctors (one of them Jordi Molla) go on and tell her they need his organs to use in transplants. The mother worries that the organs will go to the wrong bodies... and then it pans to reveal this is just a demo film that intends to show how doctors should react to a situation should it present itself. The organizer of this event is Betty (Carmen Elias), who is Leo Macias' (Marisa Paredes) best friend. And here is when we get introduced to Leo (and the story), proper: dressed like a bag lady, she has wandered out into the streets wearing her husband Paco's (Imanol Arias) boots. The reason? Well, he's left her, she has realized her marriage is a failure, and to top it all, she has taken to wearing his boots while typing about it. The catch is, they're too tight. Which leads her to the seminar Betty is in the middle of (the scene at the start of the film) and their banter about Leo's husband. This will reveal some shared issues one of the women ignores, but that's not where Almodovar wants to go. Leo reveals herself to be a romance novelist who goes by the pseudonym Amanda Gris -- a Spanish version of Nora Roberts -- who's written a completely bleak novel that her publishing agency will not take. After all, the public wants Amanda Gris and demands romance, nothing else. Which has Leo take a job in a magazine run by Betty's gay friend Angel (Juan Echanove). Angel loves Amanda Gris; she presents a critic which stabs at Gris' work, a thing Angel admires. Angel himself states he will act as a counter-critic, a foil of sorts, to Leo's attack on Gris. Both form an unlikely friendship that approaches Leo's pain at a tentative level until Paco's arrival (and some crucial denouements) bring Angel and Leo a lot more closer than they thought they would be. LA FLOR DE MI SECRETO moves at a meandering pace -- almost free-floating, barely dependent on plot and heavy on the use of dialogue. For some, this is an irritating departure of Almodovar's more compact stories -- it's as if he wasn't sure where he was going and decided to take Leo's plight and add on as he went deeper into his story. However, this change of pace and style is important to see Leo as a fractured woman. The mother at the start of the movie whose son is brain-dead is only but a parallel of Leo's own attitude towards her dead marriage -- one she pathetically tries to salvage. Until now, she has seen her life reflected in another man who has alienated himself from her, using his military position as an excuse. When her attempt backfires, she tries to go the way out... but life has more in store for Leo. Here is where Almodovar's story really starts to bloom like the \"flower\" of his title. Almodovar clearly identifies with Leo in her dual role as woman scorned who has to find her way back, and critic who questions the nature of these pulp stories Amanda Gris writes. I would go on and even say that his love for these women is so strong, it wouldn't even be too wild to suggest Angel is his physical stand-in and in a lesser way, the supporting character of Antonio (Joaquin Cortes). Antonio's storyline moves at a parallel level with Leo's and describes the immense love he feels for his mother Blanca (Manuela Vargas), Leo's maid who moonlights as a flamenco dancer. He commits an act of theft which grants them the economic freedom to continue their dance act, and their flamenco sequence is a thing of ferocious beauty. In this, LA FLOR DE MI SECRETO is the first story that incorporates a selfless act of love that goes beyond physical desire, and it shows a director who is okay with not showing comic zaniness in lieu of thoughtful drama that only occasionally has moments of explosive passion.",
         "Yes, the line at the beginning is also on another movie: \"All about my mother\", where Manuela (who is the transplant coordinator at a Hospital) received the same news, with almost the same words. Although, excellent movie and all actors stunning. Chus Lampreave as funny as always, and Rosy De Palma nailed the middle aged lady character. I totally recommend this movie. One of the most dramatic movies from P. Almodovar. Marisa Paredes is a great actress, and had some main roles on Almodovar movies (All about my mother,High Heels/tacones lejanos) and this one. Juan Echanove gets the Teddy Bear tenderness, I just love him. Joaquin Cortes had a brief role, and had a little dance. I think he is very innovative and very powerful Bailaor. I tried to find \"High Heels\" but it seems very hard to find in the States. I'll keep trying.",
         "Only Pedro Almodovar can do a melodrama that crosses genres like this film. In one sense, this is a film that you would expect to see on Lifetime. Marisa Paredes (All About My Mother, Life is Beautiful) is nothing less than outstanding a a writer that is going through a crisis with a husband (Imanol Arias) that does not love her anymore. There is, of course, a crisis with her mother (Chus Lampreave - Volver) at the same time. Then, she finds out that it is her best friend that is having an affair with her husband, and there are profession problems at the same time. Sounds just like a Lifetime movie, doesn't it? But, Almodovar manages to give us a great story with his twists. Laughs are generous as comedic situations occur throughout. It's like wanting to laugh at something at a funeral. It happens, and we just have to deal with it. Juan Echanove (who supposedly gave a great performance in Alatriste, the film that I have been waiting for release theatrically, or on DVD) is superb as Ángel, the newspaper editor who fulfills a dream to write romance novels. and who is in love with Leo (Parades). It is just another great film from Almodovar that defies a description that would ever do it justice. Only experiencing his films can ever be pleasure.",
         "Papate2, this is a common thing for Almodovar, to use some situations in films he made, to produce a new film from this starting point. It's like developing a thread that links all the stories he imagines. For example, his last film \"Volver\" (\"To come Back\") uses the scene of a mother who hides his dead husband inside a fridge...and this story is told by Leo in \"La Flor De mi Secreto\". As well, there is a scene in \"La Mala Educacion\", where you can see the poster of a film called \"Ghost Grandmother\". This is, as well, the poster of \"Volver\", where Carmen Maura plays a dead grandmother who comes back to help her daughters."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "CiBy 2000",
         "El Deseo"
      ],
      "summaries": ["Leo Macias writes sentimental novels with great success but hidden under a pseudonym, Amanda Gris. She is unhappy with her professional life and with her husband, a soldier working in Brussels and Bosnia that is never at home. She will try anything to change her life."],
      "budget": 0
   },
   "movielensId": 617,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1995-09-22",
      "dvdReleaseDate": "2005-04-12",
      "directors": ["Pedro Almodóvar"],
      "runtime": 107,
      "movieId": 617,
      "title": "The Flower of My Secret",
      "mpaa": "",
      "actors": [
         "Marisa Paredes",
         "Juan Echanove",
         "Carme Elias",
         "Rossy de Palma",
         "Chus Lampreave",
         "Kiti Mánver",
         "Joaquín Cortés",
         "Manuela Vargas",
         "Imanol Arias",
         "Gloria Muñoz",
         "Juan José Otegui",
         "Alicia Agut",
         "Jordi Mollà"
      ],
      "imdbMovieId": "0113083",
      "originalTitle": "La Flor de mi Secreto",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["BBzIoP9EgEU"],
      "plotSummary": "Marisa Paredes is Leocadia (\"Leo\") Macias, a woman writing “pink” romance novels under the alias of Amanda Gris that are very popular all across Spain. Unlike her romantic novels, her own love life is troubled. Leo has a less than happy relationship with her husband Paco, a military officer stationed in Brussels then later in Bosnia, who is distant both physically and emotionally.",
      "tmdbMovieId": 4307,
      "avgRating": 3.58793,
      "releaseYear": "1995",
      "numRatings": 580,
      "posterPath": "/a7u61EMTQYWfDIupBMUPIGO4Nc1.jpg"
   }
}