{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0118001",
      "video": false,
      "title": "Two Much",
      "recommendations": [
         31633,
         83489,
         27224,
         16814,
         73249,
         41779,
         38132,
         10879,
         25221,
         44968,
         38222,
         117553,
         71357,
         47608,
         25189,
         25269,
         45225,
         40480,
         18856,
         39472
      ],
      "backdrop_path": "/3FCnyxqVrjsM7VC6iCqnWmriY5e.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Art Dodge",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f81173e9",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe46e0c3a36847f81173ed",
               "name": "Melanie Griffith",
               "profile_path": "/rdRjFsPQDQqPE8JlDQcuT5JDpED.jpg",
               "id": 29369,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Liz",
               "gender": 1,
               "credit_id": "52fe46e0c3a36847f81173fd",
               "name": "Daryl Hannah",
               "profile_path": "/4LLmp6AQdlj6ueGCRbVRSGvvFSt.jpg",
               "id": 589,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Gene",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f8117401",
               "name": "Danny Aiello",
               "profile_path": "/UvPalkz4ynJJrTcrbpfD05gVoO.jpg",
               "id": 1004,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe46e0c3a36847f8117405",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sheldon",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f8117409",
               "name": "Eli Wallach",
               "profile_path": "/nRoyZzUjzY7iGdnp2V2kOgrMMFi.jpg",
               "id": 3265,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Manny",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f811740d",
               "name": "Gabino Diego",
               "profile_path": "/qqAWyPU31uk6juPPP6YLHI6jr3a.jpg",
               "id": 23215,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Dr. Huffeyer",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f811741d",
               "name": "Austin Pendleton",
               "profile_path": "/pxcdhd4oAsnhvUg0BalmiiKJyXg.jpg",
               "id": 6168,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Reverend Larrabee",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f8117421",
               "name": "Allan Rich",
               "profile_path": "/Asmdc5LrKtjklKyWuEochYe3Rn2.jpg",
               "id": 568531,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Sommelier",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f8117425",
               "name": "Vincent Schiavelli",
               "profile_path": "/q2fEosVlli2T8k5db7c7xueNTtc.jpg",
               "id": 3418,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Goon",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f8117429",
               "name": "Jeff Moldovan",
               "profile_path": "/pQtfA5GXGUOSC4FdXBlzh8zh699.jpg",
               "id": 84605,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Goon",
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f811742d",
               "name": "Joe Hess",
               "profile_path": null,
               "id": 84599,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46e0c3a36847f81173f3",
               "name": "Fernando Trueba",
               "profile_path": "/u0o8Oelx0KPL037RBxlNaB6G4Sa.jpg",
               "id": 37526,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f81173f9",
               "name": "Donald E. Westlake",
               "profile_path": "/tPbsbutxJU6tPeyZoOeJBe8ulzp.jpg",
               "id": 21672,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e0c3a36847f8117413",
               "name": "Fernando Trueba",
               "profile_path": "/u0o8Oelx0KPL037RBxlNaB6G4Sa.jpg",
               "id": 37526,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e0c3a36847f8117419",
               "name": "David Trueba",
               "profile_path": "/9kyyqY6N3DLI8A8pyqqjX8njDxZ.jpg",
               "id": 59879,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "576c9016c3a36830b8000b51",
               "name": "Nena Bernard",
               "profile_path": null,
               "id": 1640578,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "576c901e9251411566001ce2",
               "name": "Elaine J. Huzzar",
               "profile_path": null,
               "id": 7731,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "576c90279251414831000a9e",
               "name": "Johanna Ray",
               "profile_path": null,
               "id": 3686,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "576c902f9251411566001cf0",
               "name": "Juan Botella",
               "profile_path": null,
               "id": 1027282,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "576c903992514147e00009f8",
               "name": "Carlos Arditti",
               "profile_path": null,
               "id": 1640579,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "576c903fc3a3682459000ef3",
               "name": "Barbara Peterson-Malesci",
               "profile_path": null,
               "id": 1596655,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "576c8eabc3a3682ff00008d7",
               "name": "Michel Camilo",
               "profile_path": null,
               "id": 1062037,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "576c8eb4c3a3682f61000961",
               "name": "José Luis Alcaine",
               "profile_path": null,
               "id": 4376,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "576c90469251414831000acd",
               "name": "Lala Huete",
               "profile_path": null,
               "id": 16986,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "576c9051c3a3682574000cfa",
               "name": "Ricky Sacco",
               "profile_path": null,
               "id": 1640580,
               "department": "Production",
               "job": "Unit Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.027908,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 46029,
      "vote_count": 37,
      "budget": 0,
      "overview": "A young gallerist is in love with two sisters at the same time. In order to solve the problem he decides to invent his own twin-brother.",
      "similar": [],
      "original_title": "Two Much",
      "runtime": 118,
      "poster_path": "/pTnIGNlRn0aLe4xWVLpXLsnDmt2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sociedad General de Televisión (Sogetel)",
            "id": 20295,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Interscope Communications",
            "id": 10201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fernando Trueba Producciones Cinematográficas",
            "id": 21108,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lolafilms",
            "id": 6861,
            "origin_country": ""
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "1996-02-14",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Fernando Trueba"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "Donald E. Westlake",
         "Fernando Trueba"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118001/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0ODQxMTI0NV5BMl5BanBnXkFtZTcwMTE4NjgyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Antonio Banderas, Melanie Griffith, Daryl Hannah | See full cast and crew »"],
      "reviews": [
         "Donald Westlake deserves much better than this adaptation that Fernando Trueba and his brother David did to the book. Mr. Westlake, together with Elmore Leonard, are two of the best writers of the genre. It appears that either the adapters lost something in translation, or maybe the studio didn't let the Truebas get what they wanted to do. The casting of Antonio Banderas in the dual role of Art/Bart presents problems because he is a quintessential Latin man, who is supposed to be a small con artist working in Florida; his accent doesn't solve this problem either. We don't believe for a moment he is this \"artful dodger\", let alone Art Dodge. Mr. Banderas has done better, but not here. The best sequence in the film involves Art/Bart shuttling between Liz and Betty's separate rooms, where the actor gets all the laughs. Daryl Hannah, who plays Liz, fares better, although it's hard to imagine this brainy woman could fall for this small time con artist. Melanie Griffith doesn't have much to do, and we can be thankful for a performance where all her mannerisms are not shown. The best thing in the film is Joan Cusack, who is seen as Gloria, the art gallery assistant who steals the show from the principals. There is also a delightfully funny appearance by the late Vincent Schiavelli, who is seen as a finicky sommelier at a tony restaurant. (We kept thinking how could Art/Bart pick up the check on the two occasions when he takes Betty, first, and then Liz, to that expensive place, as he can't even pay his other bills...) In some minor roles we see Eli Wallach, Danny Aiello, and Austin Pendleton, among others. The best thing in the film is the musical sound track by the talented Michel Camilo, who had already collaborated with Mr. Trueba in \"Calle 54\". He is seen at the end of the picture playing with some Latin jazz giants like Paquito D'Rivera and Cachao. One kept hoping they would have been seen more in the film.",
         "A great adaptation of one of Donald Westlake's sad-sack comedies, in this case about Antonio Banderas, an unsuccessful art gallery owner who ekes out his income by a variation on the Bible Salesman scam. He winds up engaged to a funny, screeching Melanie Griffith, in lust with her sister -- and Melanie's gangster ex-husband is after him. This won't be to everyone's taste: Westlake's humor is a lot like Tim Burton's and it's a shame Burton has never tried his hand at one of Westlake's novels. None of the screen adaptations of his works have served him well, although the hard-to-find HOT STUFF, from his own script works well. But this is about as good as it gets, with a perfect supporting cast, including Eli Wallach, Darryl Hanna, Danny Aiello and the woman who can make you laugh while she's having a nervous breakdown: Joan Cusack. Give this a try. And if you know Tim Burton, suggest he try a Dortmunder novel or two.",
         "This movie has enough funny moments with some outstanding performances of Joan Cusack and (even though in a very small role) Vincent Schiavelli as Sommelier, watch and see what I mean, I fell of my chair with the few scenes with him. For me 7 out of 10.",
         "A bit of fluff with lots of laughs and screwball comedy with Banderas trying to have not only his cake and eat it two, but two cakes! Some very funny bits as he tries to keep his \"twin\" from being exposed -hence \"Two Much.\" In my opinion, Joan Cusack stole the show with her broad comedic talents. She plays along with the charade, using wry humor when she finds herself in the middle of a difficult situation, and gently scolding Banderas for his questionable behavior. She was simply wonderful!",
         "You will especially like this film if you are fans of Antonio Banderas, Melanie Griffith and Daryl Hannah. Nothing creative or unique, just good fun and nice eye candy for all to enjoy. You could probably drive down the road and get the milk and cereal for tomorrow's breakfast, while the movie is still running back home, and not miss much...but hey, this is just a comedy for a few laughs.",
         "Art Dodge runs Art's Gallery, but he's not doing too well. He looks for obituaries of rich people and shows up at the home of the deceased claiming he sold the person a painting. One day Art gets caught and has to hide in Betty's expensive car. He and Betty hit it off, but then Art discovers Betty has a sister, Liz. Betty's ex Gene wants her back and when he comes after Art, Art is wearing glasses instead of contacts, and he gets an idea. He claims to be Art's brother Bart, and Gene is not all that bright so he believes it. Art comes up with a history for Bart and tries to make him into a man Liz would like. Art is actually quite convincing as Bart, so his main problem is explaining why the two are never together. Faking a phone call is not that big a problem. There is a hilarious scene where both men stay over with their respective girlfriends, who live in the same large house. There is not as much zany comedy as I would have expected. At times the film seems to be more of a drama, more 'chick-flick'. Antonio Banderas seems to give a better performance in these scenes than where he is supposed to be funny; I never thought the man was a comic actor. Banderas seems natural for Bart, but not Art. Joan Cusack gives the best acting performance, in my opinion, as Art's sarcastic secretary. Daryl Hannah and Melanie Griffith also do well. I was expecting more from Eli Wallach as Art's forgetful father Sheldon--he starts out giving an Oscar-caliber performance, for about two lines. Then he's just ordinary. Though it is funny when he actually starts believing he has two sons. One more highlight from the movie: a car chase involving Gene's goons and Sheldon's poker buddies. I don't know exactly what that was about. Despite its flaws, this movie had a lot to offer for me.",
         "SPOILERS THROUGHOUT: This zany screwball comedy isn't going to win any awards but I liked it. One reason for that is probably the main players in this movie: Bandarus, Hanna and Griffith. All play their roles well and the movie, though not a classic or a perfect 10, is surprisingly enjoyable in some places and a good summer's pick. There are times when this movie really drags and I wont say it is the type of movie that makes you roar with laughter. It's a classic romantic comedy in many respects, with a great setup as Bandarus basically plays two people and Daryl Hanna and Melody Griffith play the sisters who both fall in love with him. Everyone works well together here and this, I believe is the movie where Bandarus and Griffith fell in love off camera, and man do they have chemistry on screen. In fact, Bandares has chemistry with both ladies and Hanna and Griffith work very well together So I think that's primarily what makes the movie work because let's face it, it's quite silly in some places and the draggy factor is indeed there. But when Bandarus and one of his respective leading ladies are on screen together, it's actually interesting and if not hilarious, then highly entertaining. I'd give Two Much about a 6.5, it's not anywhere as bad as some have said though it's far from a 10. It's a good enough movie to watch though when one just wants an entertaining, fun screwball comedy.",
         "Well we've had it all before. This movie is just a variation on the 'Boeing Boeing' theme. Ok, Banderos play is great for this role, and the running gags (e.g. the chase between two rooms with the pool in between and the various ways to escape falling into it) are really hilarious. But it all is beaten by the supporting role of the french restaurant somelier (Vincent Schiavelli)! His two short appearances are worth watching this film and lead to my rating 7 (would have been 5 without this). Ah and then there's the happy end of course. As we knew from the beginning, everyone gets what/whom he/she deserves.",
         "After winning a Best Foreign Film Oscar for \"Belle Epoque\", Fernando Trueba's follow up was this comedy starring Antonio Banderas and Melanie Griffith. It was not the first time that Trueba had directed a picture in English with English-speaking actors (\"El sueño del mono loco\" starring Miranda Richardson and Jeff Goldblum was a critical success) but \"Two much\" seems to have gone out of his hands. It might have looked good in the script, a comedy that captures the essence of the comedies from the 50's, but the eventual result is quite disappointing. The three leading actors (Banderas, Griffith and Daryl Hannah) have been much better almost elsewhere, and some of the jokes and gags are kind of cheesy. However, a superb supporting cast helps to save the show. Joan Cusack is a delight to watch in a role Thelma Ritter would have done a few decades before. Danny Aiello does as much as he can with his clichéd character, and Elli Wallach is also excellent, but his role is little more than a glorified cameo. If you like Dean Martin comedies you might appreciate the effort of resurrecting these kind of comedies, but don't expect the result to be anywhere near those classics. If you are looking for a few laughs and an acceptably amusing comedy, then you might not be disappointed.",
         "*The cast: - Antonio Banderas : Art / Bart Dodge - Daryl Hannah: Liz Kerner - Melanie Griffith: Betty - Joan Cusack: Gloria - Eli Wallach: Sheldon *The story: Art Dodge is an art swindler. He looks at the death announcements in the papers. At the day of the funeral, thên he goes to the family and says that the dead person had bought a painting of him a few weeks before he died. At that moment, he meets Betty a rich woman who divorced the same man twice. They fall in love with each other, but love becomes complicated when Art meets Betty's sister... he is deeply in love with her too. So he decides to transform himself in Bart (his twin brother) and then you get some humoristic moments, which aren't very funny at some moments. Sheldon is the father of Art. Joan Cusack is the employee of Art. An interesting note is that Melanie and Antonio fall in love on the set, and they married and had 1 child, Stella Banderas. *Appreciation: This film is too confusing and although Daryl Hannah played her part wonderfully, the film has something of a disaster. Although the actors did their best to make a comedy. A catastrophe occurred But don't forget that alL these actors had done some wonderful acting. Some examples; Melanie Griffith: Cecil B. Demented -- Daryl Hannah: Steel Magnolias -- Antonio Banderas: Philadelphia and Eli Wallach: the Misfits. Sadly they made this time a wrong choice... Mostly I like the movies that I saw and on the whole I give good comments about them. But this time I can only say that this film was a big disappointment and I hoped that it would have finished quickly. However I didn't lose my faith in the actors because it was just the wrong script that didn't work. Rating: 5,5 /10"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Fernando Trueba Producciones Cinematográficas",
         "Interscope Communications",
         "Lolafilms"
      ],
      "summaries": ["A young gallerist is in love with two sisters at the same time. In order to solve the problem he decides to invent his own twin-brother."],
      "budget": 0
   },
   "movielensId": 618,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-14",
      "dvdReleaseDate": "2003-04-08",
      "directors": ["Fernando Trueba"],
      "runtime": 118,
      "movieId": 618,
      "title": "Two Much",
      "mpaa": "PG-13",
      "actors": [
         "Antonio Banderas",
         "Melanie Griffith",
         "Daryl Hannah",
         "Danny Aiello",
         "Joan Cusack",
         "Eli Wallach",
         "Gabino Diego",
         "Austin Pendleton",
         "Allan Rich",
         "Vincent Schiavelli",
         "Jeff Moldovan",
         "Joe Hess"
      ],
      "imdbMovieId": "0118001",
      "originalTitle": "Two Much",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young gallerist is in love with two sisters at the same time. In order to solve the problem he decides to invent his own twin-brother.",
      "tmdbMovieId": 46029,
      "avgRating": 2.74868,
      "releaseYear": "1996",
      "numRatings": 378,
      "posterPath": "/pTnIGNlRn0aLe4xWVLpXLsnDmt2.jpg"
   }
}