{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "monkey",
            "id": 15149
         },
         {
            "name": "chimpanzee",
            "id": 157972
         },
         {
            "name": "animal actor",
            "id": 157987
         },
         {
            "name": "critically bashed",
            "id": 158024
         }
      ],
      "imdb_id": "tt0116165",
      "video": false,
      "title": "Ed",
      "recommendations": [
         31535,
         18935,
         26386,
         20468,
         31118,
         7269,
         20066,
         131805,
         31131,
         112937,
         107438,
         55449,
         67162,
         32013,
         83412,
         31279,
         31254,
         36259,
         429126,
         36896
      ],
      "backdrop_path": "/a4yAIFClhalxnFxKJtdkcSox6UR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack \"Deuce\" Cooper",
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d44b",
               "name": "Matt LeBlanc",
               "profile_path": "/35sPf8IBVl54vdmc9Tyv17otMnk.jpg",
               "id": 14407,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Chubb",
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d475",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "545544df0e0a2648d6004e77",
               "name": "Jayne Brook",
               "profile_path": "/adrS4ZwaRgXpnJpV2U7uiFU9Cmd.jpg",
               "id": 11627,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Tipton",
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d47d",
               "name": "Bill Cobbs",
               "profile_path": "/cP2ETKFdk93z4e1oXZVG0utI3IM.jpg",
               "id": 8854,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Dizzy",
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d479",
               "name": "Jim Caviezel",
               "profile_path": "/koyFOeFdQyyFs26DNyDHWluBibB.jpg",
               "id": 8767,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d46d",
               "name": "Gene Ross",
               "profile_path": null,
               "id": 9295,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d471",
               "name": "Paul Hewitt",
               "profile_path": null,
               "id": 177049,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d481",
               "name": "Troy Evans",
               "profile_path": "/74r7ajwva1F0yd6moWljQFfqnnR.jpg",
               "id": 31006,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44cd9251416c9101d451",
               "name": "Bill Couturié",
               "profile_path": null,
               "id": 116103,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cd9251416c9101d457",
               "name": "Ken Richards",
               "profile_path": null,
               "id": 92118,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cd9251416c9101d45d",
               "name": "Janus Cercone",
               "profile_path": null,
               "id": 73497,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cd9251416c9101d463",
               "name": "Stephen Endelman",
               "profile_path": "/1ey21aHi5U3FS5iZeVwvnodwSrX.jpg",
               "id": 21276,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "53635acfc3a368157d0019d8",
               "name": "Alan Caso",
               "profile_path": null,
               "id": 22057,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5463ad9ec3a3681252002a09",
               "name": "David M. Evans",
               "profile_path": "/h4PUTxhvUuRVO9EMQznDt5F2vZO.jpg",
               "id": 69741,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.479021,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32308,
      "vote_count": 28,
      "budget": 0,
      "overview": "Jack Cooper (Matt LeBlanc) could be a world-class baseball pitcher if he didn't keep buckling under the pressure. He tries to keep his spirits up after he's traded to a minor league team but loses all hope when he discovers that Ed, one of his teammates, is a chimp. Ed used to be the team mascot, but was promoted to third base when the owners realized he had a talent for baseball. As Jack struggles to get used to his new surroundings, Ed helps him regain his confidence on and off the field.",
      "similar": [
         9655,
         9291,
         2300,
         86130,
         11287,
         22881,
         8923,
         10637,
         323677,
         17108,
         10474,
         5693,
         26602,
         319888,
         9955,
         9767,
         9563,
         10158,
         13680,
         10393
      ],
      "original_title": "Ed",
      "runtime": 94,
      "poster_path": "/oSNX3zyTpRMN0ExtOobt7eaJfPD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1996-03-15",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "Minor league. Major friendship.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill Couturié"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Ken Richards",
         "Janus Cercone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116165/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MjU2NDUxNV5BMl5BanBnXkFtZTcwNzIyMDIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Matt LeBlanc, Jayne Brook, Gene Ross | See full cast and crew »"],
      "reviews": [
         "Despite persistent talk of Hollywood's \"Golden Age of Cinema\", movie-making did not truly reach its zenith until 1996. The movie was \"Ed\", not to be confused with the Whoopie Goldberg abortion of celluloid \"Eddie\", that premiered during that same year. In \"Ed\" award-winning documentary filmmaker Bill Couturie employs the technique of cinema verite that lets the camera capture a true slice of sporting Americana... a monkey playing minor league baseball. \"Ed\" is not merely, as Brad Laidman of filmthreat.com raved, \"[a movie] some would say that kids may like,\" but rather the examination of the symbiotic relationship between man and monkey. Despite their outward appearances, can a clear distinction really be made between the monkey Ed and his human counterpart, Matt LeBlanc? In the film, excel at baseball (although the monkey is the star), both delight in flatulence, and both have giant cartoon teeth. And wonderfully, when the film reaches it's glorious climax, it is the monkey that most clearly embodies our notions of humanity, imbibing LeBlanc with the confidence to again throw his curve-ball, the pitch that eventually paves his way into the Big Leagues (this is despite LeBlanc's supposed ability to throw a 125 mph fastball). Although there may be some factual inaccuracies in the film (in a conversation with LeBlanc, a teammate tells him that Carlton Fisk was a flop in Boston, but went on to find greatness in Chicago), the true essence of \"Ed\" is in it's spirit... and in the fact that it has a monkey as it's star. Watching this film for the first time, I realized that I was examining the very embodiment of greatness. This being the case, \"Ed\" became the basis on which I would judge all future films. Forget Siskel and Ebert (especially Siskel) with their thumbs... forget Leonard Maltin with his stars... and forget A.O. Scott with his homosexual, liberal bias. The only scale worthy of film review is the Banana Scale. Based on 3 bananas (because really, who needs five?) this scale cuts through all the other ridiculous criteria such as plot, character development, acting and direction commonly used by other critics in their evaluations, and judges movies based on three essential elements. These elements are: 1. Does the movie contain a character from \"Friends\"? 2. Does the movie contain a monkey? 3. Is the movie about baseball? As you probably realize, there is only one film in history that contains all these elements, and, therefore, it is the greatest movie ever made. \"Citizen Kane\" by comparison, the film often mislabeled as the greatest, contains none of the essential elements of greatness. Therefore, it is hardly worth mentioning. But a movie such as \"M.V.P.: Most Valuable Primate\", centers it's story around a chimpanzee that plays for a youth hockey team. This is one of those interesting films that strives for greatness, but lacks certain characteristics that would've put it over the top. One may ask what director Robert Vince was thinking when he cast Rick Ducommun in the role of Coach Marlow when he could certainly have had David Schwimmer. And instead of hockey, why not youth baseball? But decisions such as these have presented film buffs with interesting fodder for years, wondering what could have been if, say, O.J. Simpson had in fact played the title role in \"The Terminator\", or if instead of Leonardo DiCaprio, director James Cameron had cast Dustin Diamond, as he originally planned? But judging on it's finished product, \"MVP\" receives 1 1/2 bananas... one for containing a monkey, and 1/2 for being about a sport other than baseball. Not bad, judging against the current, deplorable standards of Hollywood. Based on it's greatness, it comes as a surprise to most that an \"Ed\" sequel has never been attempted. I have always assumed that the movie has become a victim of it's own greatness. Much like Roberto Clemente, who walked away during the apex of his career, knowing that he had reached a level of greatness that would doom his future endeavors to failure in the public eye by comparison, \"Ed\" director Bill Couturie knows that another installment would be severely overshadowed by it's predecessor. But taking matters into my own hands, I penned a letter to Mr. Couturie, outlining my ideas for a suitable sequel. The idea goes like this: Both LeBlanc's character and Ed the monkey are playing in the major leagues... one for a team in the National league, the other for a team in the American. By coincidence, the two teams meet in the World Series. Although LeBlanc is now recognized as one of the greatest pitchers of all time, he is no match for the hitting prowess of Ed the monkey. And when they square of, mano-e-monkeyo, Ed the monkey is forced to make a decision whether to allow his friend LeBlanc to strike him out, or propel his team to victory by hitting a home-run, which he can do at will. I argue that this will be the first film that allows it's viewers to really get inside the mind of the monkey... to see his thought process, to witness what makes the monkey tick. By the time the last pitch is thrown, there won't be a dry eye in the house... and those tears will be both tears of laughter and tears of empathy... a rare combination. Although I haven't heard back from Couturie as of yet, I expect a response before too long. Ideas like this don't come around everyday. If not Couturie, I imagine a Hollywood heavyweight director will jump on board. From what I understand, Kubrick was considering optioning my treatment before his untimely passing. Although the idea was intriguing, I thought that perhaps Kubrick would understate the levity in a project such as this... opting for lingering shots, subtle dialog, and a brooding score by Beethoven, instead of the sped up action scenes, screaming monkey dialog, and circus music score that I believe the film \"Ed II: Monkey in the Majors\" calls for.",
         "I was running a movie theater when this turkey came out. We got to have a special sneak preview of it, which was rare for my theater. (a two screen theater in a city of less than 15,000 people) I put the film together and decided to watch it to make sure all the splices were right. Fifteen minutes into it my four year old son was completely ignoring the film, and my father and I looked at each other and pondered how this was part of our life that we would never get back. If you think the kid had a short attention span, I would have to inform you that this is the same kid that watched Lion King from start to finish every night for a month two years before this. If your idea of entertainment is monkeys farting - this is your film. If you're looking for something slightly more entertaining with animals, go watch Babe instead.",
         "Jack Cooper is a pitcher on a minor league baseball team, hoping for a crack at the majors. Sadly his pitching, so perfect in practice, is way off in the games. Things get worse for him when the team drafts in a new mascot \u0096 a monkey, Ed, and Cooper is selected to room with him. However Ed turns out to much more valuable to both the team and Cooper. This film was shown in the UK at 11:30 at night! This was why I had taped it as I assumed it was more for adults than children, after all Clint Eastwood had done a couple of films with a monkey in it \u0096 so why not? Watching I was left baffled as to why it was on so late at night when clearly the only people who would want to see it are children who will laugh at the sight of a monkey eating ice cream and dressing up. The plot is pointless here and no child would care anyway \u0096 if you can't guess what will happen at the end then you are a fool! Will Cooper ever pitch again? What side will the coin fall on? Will Cooper and Ed bond? All these are givens and there is no enjoyment from watching the plot unfold exactly as you know it would. While we're talking about lazy writing, how about the fact that every scene is a cliché. We have the monkey dressing up and causing mayhem etc \u0096 every scene feels like it is a template to which a baseball film has been applied! None of it is funny (for adults anyway) and must of it is just puerile \u0096 I laughed once and half-laughed another time. The laugh was Cooper saying `oh, I'm gonna spank that monkey' and the half was Ed watching TV and seeing the episode of Friends with a monkey in it. Other than this there is nothing. Part of the film's problem is that Ed looks like two things \u0096 and neither of them is a likeable monkey. First he never for once looks or moves like anything other than a guy in a monkey suit. Secondly his face and his expressions make him look like a slightly crazy old man \u0096 I wondered if children would take to this character or be slightly freaked out by him. Matt LeBlanc plays a character in the mould of Joey \u0096 but without the good writers to support him. He plays second fiddle to a monkey and you can see that the confidence and comfort he enjoys in Friends, is absent here. How people like Cobb, Warden and Caviezel must feel watching this is anyone's guess \u0096 I suppose they were looking at it being a really big kids movie with the star of Friends, how could they lose? Overall I found this a rather dire experience. Ed has no personality and looks really creepy and the comedy and plot are both as unimaginative as you'd expect them to be. To be a good kids' film this needed to have a bit of spark to it \u0096 instead it brings to mind the fading embers on a dying fire.",
         "...but I gave this movie an EIGHT. Now, before you brand me an idiot, please hear me out... \"Ed\" is one of the worst written, worst made, worst acted movies that I've EVER SEEN. The film's knowledge of the game of baseball is terrible (\"Carlton Fisk couldn't buy a hit in Boston...\") and it's bizarre, ill-timed special effects sequences will leave you scratching your head. Not to mention the schizo storyline... BUT...and this is a big but...I watched this with a few friends of mine who are movie buffs like myself and we LAUGHED HYSTERICALLY AT HOW BAD IT WAS! It's the \"Plan Nine from Outer Space\" of the 90s!!!! Therefore, I stand by my 8 rating. Go check out this awful, awful movie and spend a night of laughing out loud at it's ridiculousness!",
         "Oh. My. God. Sitting through the first thirty minutes of this movie was like getting all of my teeth drilled... twice. Even little kids couldn't stand it. Honestly, the entire Air Bud series looks like the Godfather in comparison.",
         "I first saw this movie while I was living as an Italian immigrant in New Zeland at the age of 10 in 1998...it was a movie that sky cinema proposed,so as a child I couldn't miss the movie of a chimp that saved a Californian minor league team. Any of my future ambitions was so much disappointing. Here we are now in 2008,exactly 10 years after, while i'm searching strange movies on IMDb for a good laugh,that this ''movie'' appears to my memories again and a long chill goes through my spine. I had to write a comment at this awful movie. My mind goes to all the unfortunate people that payed the cinema ticket to watch this bad copy of a movie,and to all the producers that have the face to propose such a shameful movie.I remember that back in '96 this movie was publicized as much as ''Slepeers'' and Robin Williams ''Jack''int he TV movie trailers,just to make the point. If you find funny the idea of a chimpanzee that farts and makes the poor Leblache eat dog food this is the movie for you. I think that the vote up reported is very generous.",
         ".... On second thoughts don`t bother because this is ape sh*t . I can imagine the producers got together and said something like \" Monkeys . Everyone loves monkeys . Parents love monkeys , children love monkeys , Michael Jackson loves monkeys so lets make a family film about a monkey \" I know films with monkeys can be box office gold like PLANET OF THE APES ( The original one not the dumb remake ) but that`s because it had a great story , or the Clint Eastwood movies with Clyde but that`s because they were funny with great gags ( Many of which involved the hell`s angels ) but there`s nothing here that made me laugh probably because I hate slapstick . Strangely there isn`t even moments of mawkish sentiment either , though the producers do try this - And fail - with one scene with Ed in a hospital bed. You make a movie about a cheeky monkey and there`s no laughs or tears involved ! Now that`s amazing In the 1950s rocket scientists sent monkeys out into space . After seeing ED you`ll be disgusted that they don`t do it anymore",
         "Ed, what can you say about this movie that hasn't already been said? As the 3-bannanna reviewer stated, it contains all that is needed in a great movie. 1)Monkeys 2)Baseball 3)Someone from the show 'Friends.' If you pay to watch this movie you are a fool, luckily U-verse had it on for demand for free. Though on second thought, I remembered I did ask for my girlfriend to get it for me on Blu-ray if it ever came out; should a miracle like that ever happen. The reason people didn't find this movie funny, is because everyone thinks its a kid's movie. It's not. It's a movie for someone who just smoked a lot of bud. I laughed so hard at some points I was crying, and literally nothing would be happening except the Monkey farting or doing a flip while catching a ball. This movie would of been a complete disaster if they would have used a real monkey. It still is a disaster of sorts, but it is much funnier with a robotic monkey than the real thing. I have no idea how to even rate this movie, as it obviously is a horrible piece of cinema (OK that gives it too much credit, a horrible piece of film); but at the same time made me laugh more than any movie I can think of in recent history. I will meet in the middle and give it a 5.",
         "It looks like everyone here at IMDb is pretty unanimous about this film - it stinks! And, as a movie billed as \"family film,\" it's an insult and a bad joke. Yeah, there are some likable characters in here and I would be lying if I didn't admit I laughed at a number of gags but I (along with two parents) was embarrassed showing this advertised \"kids' film\" to their children, only to hear Jesus's name used in vain twice within six minutes and then hear all kinds of sexual innuendos by the little girl in the movie. A little girl once commenting about a guy having a \"great butt\" and another time asking another if he's gay. Come on! Also, you can tag on the normal amount of what it called \"bathroom humor.\" It's everywhere here. What the film is, basically, is garbage, despite the baseball angle. I usually enjoy baseball films, but I can't classify this as such. Parents: do your homework before watching some of these \"family\" films because some of them are the normal crude comedies of today's Hollywood.",
         "No baseball fan can like this movie. Watching bad effects of a monkey playing the game totally makes this film unwatchable. The person below me said it was a good film, so I took a double take only to find out they said it was so bad that it's hilarious. That could be true I guess. Another side \"plot\" is the monkey trying to help the bumbling Matt LeBlanc with a girl, which is even more nauseating than the scenes on the field. I think."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Longview Entertainment",
         "Universal Pictures"
      ],
      "summaries": ["A trained chimpanzee plays third base for a minor-league baseball team."],
      "budget": 0
   },
   "movielensId": 619,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-15",
      "dvdReleaseDate": "2003-07-01",
      "directors": ["Bill Couturié"],
      "runtime": 94,
      "movieId": 619,
      "title": "Ed",
      "mpaa": "PG",
      "actors": [
         "Matt LeBlanc",
         "Jack Warden",
         "Jayne Brook",
         "Bill Cobbs",
         "Jim Caviezel",
         "Gene Ross",
         "Paul Hewitt",
         "Troy Evans"
      ],
      "imdbMovieId": "0116165",
      "originalTitle": "Ed",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["InqDF8ImCgU"],
      "plotSummary": "Jack Cooper (Matt LeBlanc) could be a world-class baseball pitcher if he didn't keep buckling under the pressure. He tries to keep his spirits up after he's traded to a minor league team but loses all hope when he discovers that Ed, one of his teammates, is a chimp. Ed used to be the team mascot, but was promoted to third base when the owners realized he had a talent for baseball. As Jack struggles to get used to his new surroundings, Ed helps him regain his confidence on and off the field.",
      "tmdbMovieId": 32308,
      "avgRating": 2.61317,
      "releaseYear": "1996",
      "numRatings": 782,
      "posterPath": "/oSNX3zyTpRMN0ExtOobt7eaJfPD.jpg"
   }
}