{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "mountain",
            "id": 1262
         },
         {
            "name": "mountaineer",
            "id": 4560
         },
         {
            "name": "climbing",
            "id": 8624
         }
      ],
      "imdb_id": "tt0102855",
      "video": false,
      "title": "Scream of Stone",
      "recommendations": [16436],
      "backdrop_path": "/cpIFOrtUKnIfhhOhTrFx4EocCfO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ivan",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0cd9",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Fingerless",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0cf5",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Roccia",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0cf9",
               "name": "Vittorio Mezzogiorno",
               "profile_path": "/5UhQuc8E9tRWdvJSe3CqZTRqqJf.jpg",
               "id": 23734,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Katharina",
               "gender": 1,
               "credit_id": "52fe4a079251416c910c0cfd",
               "name": "Mathilda May",
               "profile_path": "/nNqf6LXM52lVKI7xFdynKorf1zH.jpg",
               "id": 44233,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Stephen",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0d01",
               "name": "Al Waxman",
               "profile_path": "/8bZfhAZbKTHt2qi5B86Q4WNAGRo.jpg",
               "id": 36172,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Carla",
               "gender": 0,
               "credit_id": "52fe4a079251416c910c0d05",
               "name": "Gunilla Karlzen",
               "profile_path": null,
               "id": 185422,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Indianerin",
               "gender": 0,
               "credit_id": "52fe4a079251416c910c0d09",
               "name": "Chavela Vargas",
               "profile_path": null,
               "id": 991503,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Werbeagent",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0d0d",
               "name": "Georg Marischka",
               "profile_path": "/6KHCLMcHleoeeOEDdtOiNNQDsq.jpg",
               "id": 23753,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Himalaja-Bezwinger",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0d11",
               "name": "Volker Prechtel",
               "profile_path": "/phEHxCDidfdrCWoZ7Cj8rxCiFVv.jpg",
               "id": 2370,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Bergsteiger",
               "gender": 0,
               "credit_id": "52fe4a079251416c910c0d15",
               "name": "Hans Kammerlander",
               "profile_path": null,
               "id": 1169099,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Estanciero",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0d19",
               "name": "Lautaro Murúa",
               "profile_path": null,
               "id": 105226,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "TV-Moderatorin",
               "gender": 0,
               "credit_id": "52fe4a079251416c910c0d1d",
               "name": "Amelie Fried",
               "profile_path": null,
               "id": 1169100,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "TV-Regisseur",
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0d21",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a079251416c910c0d25",
               "name": "Wolfgang Müller",
               "profile_path": "/nw3Z2PwZ8HcvEuopgMMb7hABt7Z.jpg",
               "id": 25673,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0cd5",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a079251416c910c0cdf",
               "name": "Hans-Ulrich Klenner",
               "profile_path": null,
               "id": 1081316,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a079251416c910c0ce5",
               "name": "Walter Saxer",
               "profile_path": null,
               "id": 49497,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0ceb",
               "name": "Robert Geoffrion",
               "profile_path": null,
               "id": 47106,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a079251416c910c0cf1",
               "name": "Reinhold Messner",
               "profile_path": "/qbugvvtuiO5yAi1cKW990j10VIU.jpg",
               "id": 1081317,
               "department": "Writing",
               "job": "Idea"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 1.154502,
      "production_countries": [],
      "id": 88893,
      "vote_count": 8,
      "budget": 0,
      "overview": "A meeting of two world famous climbers, one an experienced mountaineer the other a sport climber, and a journalist (Ivan) results in a bet on which of the two is the best climber. Roger (the mountaineering expert) states that Martin (the sport climber) wouldn't survive a day on a 'real' climbing expedition, although he is considered to be the world's best sport climber (having just won an indoor 'world championship,' an event depicted in the opening scene). They plan to climb 'Cerro Torre,' in the Patagonia region of South America, near the Argentinian/Chilean border, one of the world's most difficult mountains, especially considering the extreme weather conditions common to the area.",
      "similar": [
         253412,
         16436,
         21736,
         9350,
         44115,
         30329,
         5925,
         49051,
         11046,
         273248,
         281957,
         9392,
         120,
         668,
         699,
         15121,
         290512,
         395834,
         553,
         978
      ],
      "original_title": "Schrei aus Stein",
      "runtime": 105,
      "poster_path": "/459MeLTQMF9hlNvaHbUuBPIo5I6.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "1991-01-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "In this battle, there can be no winners",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "DEM ",
      "directors": ["Werner Herzog"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Hans-Ulrich Klenner",
         "Walter Saxer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102855/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjkwNDEyODY4OF5BMl5BanBnXkFtZTcwODQyNjUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Vittorio Mezzogiorno, Mathilda May, Stefan Glowacz | See full cast and crew »"],
      "reviews": [
         "Werner Herzog's Scream of Stone is a legend in film sales: a big-budget German-French-Canadian mountaineering drama that became a byword for how not to sell a movie to foreign distributors when they asked so much money that no-one could afford it and it went virtually unreleased before turning up a decade latter on budget DVD (the UK disc retails at £5.99, and this is its first release). It's actually not at all bad, although there's surprisingly little mountaineering in it: the main thrust of the film is the conflict between a legendary mountaineer who fails to climb an infamous Patagonian mountain and the exhibition climber who claims to have done so, with a restrained Donald Sutherland as the sports journalist caught in the middle and Mathilda May making a better job of the obligatory love interest than the script should let her. Brad Dourif turns up briefly as a fingerless climber infatuated with Mae West and seeming to channel the spirit of early Jack Nicholson (well, it is Herzog - you expected restraint?), but even he is less wild than expected. The least successful element is the comic relief introduction of Al Waxman's tiresome TV producer towards the end (as well as an actress who HAD to be sleeping with either the director or one of the producers), but it's not fatal. It's a minor film, but an engaging watch with some good photography (albeit the film was surprisingly not shot in widescreen, presumably to emphasise height over width) and a neat ending.",
         "Or maybe it is the best. Characters are 100% convincing, shooting on location is terrific and the story itself is absolutely thrilling. It is another exploration of human obsession undertaken by Herzog with brilliant (as usual) results. Of course, one may question the technical side of the two solo climbs but here we can completely rely on the expertise of Reinhold Meissner. Unfortunately, it is not likely that this film will be ever appreciated by the mainstream American audience.",
         "This is probably one of Herzog's least known films in States,but it's definitely worth seeking out.As always his visuals are stunning.Especially in the Climbing sequences.There is this really great shot of the younger climber hanging on the edge of the cliff ,and the way Herzog holds this shot and let's us absorb it .He always has things like that in his movies,that's one of the things that makes a Werner herzog much more than just another movie.A note to Herzog fans,you'll find all of his trademarks in this movie if you look close enough.",
         "This movie left me with mixed feelings. The filmography is beautiful but the acting not quite. The good thing is that it is really a climbing movie, not an action movie wrapped up into a mountain scenery (like Cliffhanger or Vertical Limit). Some of the actors are real (and good) climbers and one gets a glimpse of the climbing ethics (or lack thereof when sponsors come into the field). The scenario is very loosely based on the story of the first ascent of Cerro Torre, a hard Patagonian peak. Definitely worth seeing if you are into climbing.",
         "Im a mountain climber and love to watch movies about climbing, that stated most movies in this genre usually have really fake seaming climbing scene for example Cliff hanger with S Stalone climbing a huge wall in the Rockies(really Dolomites in Italy) with all the gear but using none of it or the bolt gun?(no such thing). Scream of Stone has plenty of fake stuff to stay in my contrived genre but is way more real, shot in Patigonia with a story by very famous climber (R Messner). There are some very real seaming climbing in this film. For a climbing film this is a ten as a real movie its really a five I gave it a eight as a compromise. All climbers will love this film enjoy",
         "Definitely one of the least interesting works of Werner Herzog but even so, as one fellow critic noted, even his failures are epic and he makes something good out of them. Once again he explores the conflict between man versus nature, the conflict of man against others and also against himself. While he treats the first in a good way, the second and the third are displeasing, flawed and lacking in depth which drags down most of the film almost downhill, or better saying down the mountain. Climbing the Cierro Torre, all the way up to the top they go. Who's they? One veteran climber (Vittorio Mezzogiorno), one acrobat/wall climber (Stefan Glowacz) trying the impossible for the first time going in one of the most difficult mountains of all, located in Patagonia (3000 meters, which is way shorter than the Everest but still a giant task), fighting against each other for the top of the mountain and for a woman's heart (she is played by Mathilda May). And their duel is followed by a sports reporter (Donald Sutherland) who thinks he's about to cover the event of the century. Plot twist: it looks like someone already had been there but can we trust this guy (Brad Dourif) who says he has left four fingers in there? Maybe... The problem with \"Scream of Stone\" is to be uninteresting and flat while dealing with themes that are better presented in other movies. The fight between fearless arrogance and defiance versus experience and talent is overdone, and it's not that brilliant in here. He doesn't bring profundity to any of those themes. The ethical aspect when it comes to present facts versus doubts, introduced when the younger guy claims to have been at the top of the Scream of Stone, was almost fascinating. He was questioned by the reporters and true professionals, and out of this moment of his being cornered, having nowhere to go, he accepts the challenge and goes again to the mountain. But even so, Herzog doesn't bring excitement neither to the story and neither to the climbing scenes, the adventure stays too much in the background while the characters are carelessly brought to the foreground but you can't relate with them for too long. The whole set up involving the female going from climber to the other doesn't convince, it's too simplistic and it's only used as a device for the upcoming third act (which works). I mean, she just happen to fall for the winners. You don't get the sense that she loves one or the other. It never reaches the splendorous, poetic and powerful images of \"Aguirre, the Wrath of God\" or \"Fitzcarraldo\" but there's beauty in some of them - the mountain has a gorgeous peak, magnificently visualized in the few aerial shots. The cast makes this worthwhile, specially the actor who plays the experienced alpinist. Overall, it's fine, Herzog is working with something he's very familiar with, to being aware of our ambitions and to conquer them regardless of consequences, living the dream even if they look like a nightmare. Just hoped this could be more impressive. 6/10",
         "I saw this at the Seattle International Film Festival in 1991 and was very impressed. I was so surprised that it wasn't in American cinemas soon after. I now have read about the huge price Werner & his people were asking for it. Sometimes distribution issues can kill a film from being seen, and it is us, the audience who gets cheated. Perhaps Werner could have toured the film in the same way that Warren Miller does his ski films. Warren never fails to get that $12 to $15 per ticket, and he doesn't have to worry about popcorn sales. I'd love to see a fresh print of this film released theatrically in 2007 and tour the country. Are you reading this Landmark Theaters?",
         "Brad Dourif (Billy in Cukoo's Nest, Hazel in Wise Blood and the voice of Chucky) is hilarious as Fingerless, the other characters are the usual pathetic humanoids struggling with their dreams and weaknesses. The mountain is the obstacle to life's fulfillment, people are dammed to pursue their dreams to their own destruction and only the old woman in the house at the base of the mountain knows what life is all about. Call it documentary fiction with a cameo by Donald Sutherland as the climber's agent. My favorite scene has \"Alpinists\" on a fake German TV show debating the climbers using some of Herzog's usual crew of character actors to give that Alpine authenticity. Boy am I glad Herzog finally found a vehicle to display his positive side.",
         "Herzog succeeds to show simultaneously several issues related to climbing. The issue of the spectator: he is rather driven by roman circus spirit than by olympic ideals. The issues of the media: if there is an audience, there is money. The issues of the climbers: they are described as a king of athlete driven by a competitive spirit which allow betting its own life to reach a summit. The outdoors views of the famous Cerro Torre are beautiful and rare. Some spectators might feel bored by the way the film is conducted. Actually, this conduction reminds some Nouvelle Vague issues and many spectators felt bored by films directed by monsters of the Nouvelle Vague like Antonioni, Goddard etc... C'est la vie. Yet, Cerro Torre: Schrei aus Stein deserves to be seen by those who appreciate Herzog cinema.",
         "\"Scream of Stone\" tells of a happenstance competition between a mountain climber and a rock climber to see who is first to the top of a foreboding 3000 ft needle of rock and ice in Patagonia, South America. As with most Herzog flicks, the film is rough hewn and one can imagine the filming crew is having more of an adventure than the characters. Plodding, dull at times, and subpar on most counts the film does feature some good climbing scenes. Pass on this one unless you're into climbing."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Sera Filmproduktion",
         "Molécule",
         "Films A2"
      ],
      "summaries": [
         "A meeting of two world famous climbers, one an experienced mountaineer the other a sport climber, and a journalist (Ivan) results in a bet on which of the two is the best climber. Roger (the mountaineering expert) states that Martin (the sport climber) wouldn't survive a day on a 'real' climbing expedition, although he is considered to be the world's best sport climber (having just won an indoor 'world championship,' an event depicted in the opening scene). They plan to climb 'Cerro Torre,' in the Patagonia region of South America, near the Argentinian/Chilean border, one of the world's most difficult mountains, especially considering the extreme weather conditions common to the area. The rivalry among the two men results eventually in the death of their common friend and the stealing of Roger's girlfriend (Katrina) by Martin. In the end the rivalry results in a 'climb against time' in which Martin and Roger each attempt different routes up the mountain in a race to the summit. But they're in for a surprise.",
         "Two famous competitive climbers make a bet on who can climb Cerro Torre, one of the most dangerous mountains in Argentina and the world, first. As the day of the climb approaches, their increasing competitiveness becomes destructive."
      ],
      "budget": 6340000
   },
   "movielensId": 620,
   "movielens": {
      "languages": [
         "Italiano",
         "English"
      ],
      "releaseDate": "1991-01-01",
      "dvdReleaseDate": null,
      "directors": ["Werner Herzog"],
      "runtime": 105,
      "movieId": 620,
      "title": "Scream of Stone",
      "mpaa": null,
      "actors": [
         "Donald Sutherland",
         "Brad Dourif",
         "Vittorio Mezzogiorno",
         "Mathilda May",
         "Al Waxman",
         "Gunilla Karlzen",
         "Chavela Vargas",
         "Georg Marischka",
         "Volker Prechtel",
         "Hans Kammerlander",
         "Lautaro Murúa",
         "Amelie Fried",
         "Werner Herzog",
         "Wolfgang Müller"
      ],
      "imdbMovieId": "0102855",
      "originalTitle": "Schrei aus Stein",
      "genres": [
         "Adventure",
         "Drama",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A meeting of two world famous climbers, one an experienced mountaineer the other a sport climber, and a journalist (Ivan) results in a bet on which of the two is the best climber. Roger (the mountaineering expert) states that Martin (the sport climber) wouldn't survive a day on a 'real' climbing expedition, although he is considered to be the world's best sport climber (having just won an indoor 'world championship,' an event depicted in the opening scene). They plan to climb 'Cerro Torre,' in the Patagonia region of South America, near the Argentinian/Chilean border, one of the world's most difficult mountains, especially considering the extreme weather conditions common to the area.",
      "tmdbMovieId": 88893,
      "avgRating": 3.29762,
      "releaseYear": "1991",
      "numRatings": 42,
      "posterPath": "/459MeLTQMF9hlNvaHbUuBPIo5I6.jpg"
   }
}