{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "reunion",
            "id": 9824
         },
         {
            "name": "memory",
            "id": 10937
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt0107471",
      "video": false,
      "title": "My Favorite Season",
      "recommendations": [],
      "backdrop_path": "/oYZsmHjm6GIRIIaJLfLlK7n5zWO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Antoine",
               "gender": 2,
               "credit_id": "52fe4848c3a36847f815f897",
               "name": "Daniel Auteuil",
               "profile_path": "/lWXsmJwL4H2RyJpC8p7hLFl27pZ.jpg",
               "id": 6012,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Berthe",
               "gender": 1,
               "credit_id": "52fe4848c3a36847f815f89b",
               "name": "Marthe Villalonga",
               "profile_path": "/uZNIlecwQKOq5RNoIJ9Sg8kT4oy.jpg",
               "id": 25181,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Emilie",
               "gender": 1,
               "credit_id": "52fe4848c3a36847f815f89f",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Bruno",
               "gender": 0,
               "credit_id": "52fe4848c3a36847f815f8a3",
               "name": "Jean-Pierre Bouvier",
               "profile_path": "/fJec2by3ObVd8Ay2ribEDYFxyNs.jpg",
               "id": 227933,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe4848c3a36847f815f8a7",
               "name": "Chiara Mastroianni",
               "profile_path": "/mBrsvkCKYEM2RAyDpLxx3Tdge1F.jpg",
               "id": 20710,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Khadija",
               "gender": 1,
               "credit_id": "52fe4848c3a36847f815f8ab",
               "name": "Carmen Chaplin",
               "profile_path": "/dfVkdRgFyJEsBYeGllw11q5yUPZ.jpg",
               "id": 76093,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lucien",
               "gender": 0,
               "credit_id": "52fe4848c3a36847f815f8bb",
               "name": "Anthony Prada",
               "profile_path": null,
               "id": 376886,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "la directrice",
               "gender": 1,
               "credit_id": "52fe4848c3a36847f815f8bf",
               "name": "Michèle Moretti",
               "profile_path": "/8Nw5bRGpITncsuryF6oYLD8sGHs.jpg",
               "id": 19936,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "l'homme au cimetière",
               "gender": 2,
               "credit_id": "52fe4848c3a36847f815f8c3",
               "name": "Jacques Nolot",
               "profile_path": "/xnbNdfSWDKBaYH1WJxSNkMd5m3B.jpg",
               "id": 40304,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "l'homme de l'hôpital",
               "gender": 2,
               "credit_id": "52fe4848c3a36847f815f8c7",
               "name": "Bruno Todeschini",
               "profile_path": "/pQTC4RrrEbshv5B5nDsykPQw1tq.jpg",
               "id": 56285,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "le père d'Emilie",
               "gender": 0,
               "credit_id": "52fe4848c3a36847f815f8cb",
               "name": "Jean Bousquet",
               "profile_path": null,
               "id": 244039,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Mehdi",
               "gender": 2,
               "credit_id": "52fe4848c3a36847f815f8cf",
               "name": "Roschdy Zem",
               "profile_path": "/d2589ZaPsk4mpxlUYxSaOvaZdo3.jpg",
               "id": 20442,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "La femme du bar",
               "gender": 1,
               "credit_id": "52fe4848c3a36847f815f8d3",
               "name": "Ingrid Caven",
               "profile_path": "/lTgtHMJoUVYd9zmak0WvhzeGHOE.jpg",
               "id": 45195,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4848c3a36847f815f8b1",
               "name": "Alain Sarde",
               "profile_path": "/95fgX9tAqahF98DG4FutHpLjbEi.jpg",
               "id": 3560,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4848c3a36847f815f8b7",
               "name": "André Téchiné",
               "profile_path": "/1briIztUPnyuSUwOWXaiFCpKOxV.jpg",
               "id": 96627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54733a58c3a36822ba00142f",
               "name": "Pascal Bonitzer",
               "profile_path": null,
               "id": 64750,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54733a63c3a36836910000c7",
               "name": "André Téchiné",
               "profile_path": "/1briIztUPnyuSUwOWXaiFCpKOxV.jpg",
               "id": 96627,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.926653,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 52873,
      "vote_count": 8,
      "budget": 0,
      "overview": "Old woman Berthe leaves her house to live in her daugter Emilie's one. Emilie and her brother Antoine have fallen out three years ago and have not seen each other since, but Emilie invites him for Christmas. Memories will come up, and will be depicted both Berthe's destiny and the strange relationship between Emilie and Antoine.",
      "similar": [
         11395,
         11881,
         1585,
         10147,
         9479,
         17979,
         51052,
         10719,
         634,
         338964,
         10510,
         13673,
         5375,
         1581,
         364,
         8871,
         772,
         5255,
         296100,
         25842
      ],
      "original_title": "Ma saison préférée",
      "runtime": 127,
      "poster_path": "/hmb9Iu6jzvV8jrIz4z73ZRWP91s.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TF1 Films Productions",
            "id": 356,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Alain Sarde",
            "id": 635,
            "origin_country": ""
         }
      ],
      "release_date": "1993-05-14",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["André Téchiné"],
      "runtime": 127,
      "synopsis": null,
      "writers": [
         "Pascal Bonitzer",
         "André Téchiné"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0107471/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTgxMzc3OTMzNF5BMl5BanBnXkFtZTcwNTUyNDMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Catherine Deneuve, Daniel Auteuil, Marthe Villalonga | See full cast and crew »"],
      "reviews": [
         "This is a film that centers around dysfunctional family life, however, it is not about incest as one viewer suggested. Catherine Deneuve plays Emilie, an emotionally detached middle-aged woman who feels like she losing her grip. She's a lawyer, as is her husband, Bruno, but there is no love left in their marriage and her two nearly grown up children are estranged from her. A crisis sets off a chain of events in her life. Her mother, Berthe, is having fainting spells and the doctors feels she shouldn't be alone at her country home, so Emilie invites her to stay with her family. No one is happy with the arrangement. Bruno resents her presence, and both he and his daughter think everyone in Emilie's family is crazy. Emilie's brother, Antoine, a fussy little brain surgeon played by Daniel Auteuil, is invited by Emilie for Christmas Eve dinner. He doesn't get along with her family and soon an argument breaks out when Berthe tries to get her children to sit still while she discusses her will. Antoine leaves with his mother, to take her back to her home, and Emilie leaves after a bitter argument with Bruno. The film follows the developing relationship among this circle of people. Everyone is wrapped up with their own lives and extremely possessive. No one really knows how to reach out to another human being. We learn that Berthe and her husband were simple country folk - she never learned how to read - who only wanted what was best for their children. Berthe tells them their father only wanted them to be \"modern.\" But modernity has its price. Both the children are too busy with their own lives to take her in when she suffers another fainting spell, so she is placed in a rest home and begins to deteriorate. Antoine doesn't recognize that she's suffered a brain lesion because of a stroke - this is supposed to be his specialty, but he can't see what's right in front of him. Emilie's law practice centers around personal estates, but she has a hard time connecting with her own mother. After the funeral, the whole family gets together at Emilie's old home and sits outside for a meal. They begin to talk and show more friendliness towards each other than in the past - Bruno even invites Antoine to sleep the night over. The title from the film comes from the last snippet of conversation when everyone confesses what their favorite season of the year is. This is a fine film that explores adult relationships. It's rather candid and not as histrionic as, say \"Ordinary People.\" The acting is well-done - Catherine Deneuve continues to age extraordinarily well - and the scenery of rural Southwest France is stunningly pastoral. Because of its drab subject matter, this one might not appeal to everyone, but it's a very good movie and I recommend it.",
         "The images from this movie lingered in my mind for a long time. Both Deneuve and Auteuil deliver magnificent performances for those who prefer their films subtle and their acting nuanced. Those with 5-second attention spans shouldn't bother.",
         "Once again I was watching a Téchiné film and found myself gaping with amazement at how terribly well the dialogues are written, and how incredibly well it is all acted (by Catherine Deneuve and Daniel Auteuil, which, I suppose, doesn't need any further explanation, but the others are also all excellent in their roles). Every single sentence is like a strike of the hammer on the consciousness of anyone who has experienced dysfunctional family life - and I think I'm not the only one. What is more, after I went to bed, the thoughts just kept coming, unfolding from one another, leading to interrelations between the people, the situations, the conversations and also to conclusions, some of which might not even have been intended, but still fit perfectly into the mosaic of the film, because the director had a perfect vision and created a world that functions on its own. It is a very atmospheric movie. It is artistic, but not in the abstract way - it's as down to earth as possible, as grounded in reality as it can be - and anyone who has been part of such a family will realise this instantly. It does suggest things, but then it also claims them, but in a language that puts into words the unsayable. Things get said out loud; still, it never sounds didactic or threadbare. It just portrays what IS; it never judges - as it is showing exactly how impossible it is to judge any human behaviour, when there are so many unseen forces in play behind it. And the real mystery is how on earth the film avoids being depressing... But it's Téchiné's secret, and I'm glad he has it. I have never seen the complexity of human feelings and family relationships told so realistically, yet so sublimely before. If you only like action-packed blockbuster movies, this is definitely not for you. Otherwise, I can only recommend it, and it's a perfectly round 10.",
         "I absolutely LOVED this movie! It is my all-time favorite Deneuve film. Great casting, great direction, and great writing. For anyone dealing with an aging parent or dysfunctional family, this is a movie for you! Deneuve is at her most vulnerable. Daniel Auteuil is fabulous as her dysfunctional, sister-idolizing brother, and the rest of the cast - including Deneuve's real-life daughter Chiara Mastrioanni, give truly wonderful performances. The chemistry with this cast is amazing, particularly the relationship between Deneuve and Auteuil. Andre Techine directs, what I feel is his most beautiful, sensitive, and character-driven movie to date. If you're a fan of foreign films, I strongly recommend \"Ma Saison Preferee\".",
         "I completely disagree with esh (previous review) for the simple reason that the script is excellent in its character development. By the end of the movie, you know the unique psychology and motivation of each member of the family. I am a big fan of Techine's (Thieves was also really really good). He's not big on blaringly obvious plots. Auteuil and Deveuve were excellent in their roles, subtle and convincing.",
         "I first saw this film in my mid 20's and realized in hindsight that is was probably the first \"adult\" film I'd ever seen. These were adults coping with the realities of life, kids, marriage, relationships, an aging mother, death, etc. and not living life in an artificial, adolescent way. The script is fascinating in that it contains so many wonderful, adult scenes. Some which come to mind immediately are: When the mother is talking to herself by the swimming pool, Deneuve comes in saying \"why didn't you turn on the light maman?\", \"Are you afraid I might break something\" the mother says \"No, it's just that you don't know the house and you may hurt yourself\", Deneuve answers. The dialogue is so strong in that you get a point of view from all characters, yet other characters see things in a totally different way and they are all valid. The conversation between Bruno and Emilie after his fight with Antoine about how she thinks Bruno's aged badly. How he sees their relationship and gone badly and in contrast how she sees it. the conversations between Antoine and Emilie about putting their mother in a nursing home, how she always has to find the solutions to things and when she tries, he criticizes and she breaks down crying. the point made by their mother at the nursing home regarding her children and modernity. How the children have grown up modern as they had wished but this curse of modernity has led them to put their aging mother into this home. The way the mother talks so frankly about the grandchildren,\"she taps on that damn piano all day, and the boy, a real half-wit.\" the close bond between her and Antoine \"you don't have to fake sleeping maman, it's only me\" I also love the piece of dialogue, after the mother's funeral, where Emilie has been separated from the family and you feel it's time she goes back home and instead of announcing anything, apologizing or trying to get back to the family's good graces, she turns to her husband Bruno as a matter of factly and says \"Do we have enough eggs at home?\" Brilliant writing, brilliant dialogue, superb acting. I highly recommend this truly adult movie. Wish they'd make more like this.",
         "Anybody who has a sister/brother will recognize oneself in one (or more) of the likeable characters. IMDB's keywords for the movie are \"brain\" and \"relationship.\" If you prefer not to bother with these notions, you might want to skip that movie indeed. But you will miss a very human piece of art.",
         "Did I see the same movie as the person who said not to bother? If American movies leave you yearning for more emotionally rich stories, rent this. It hinges on a very simple story that most people will relate to - the gradual decline of an aging parent. The son and daughter who come together to deal with their ailing mother are the characters that drive the plot. They were very close in childhood, but are estranged at the beginning of the movie. The need to deal with their mother's situation provokes some painful delving into their bond. Their characters are complex and fascinating. Deneuve and Auteuil were perfect actors for the sister and brother parts -- Deneuve for her ice-queen qualities and Auteuil for his gift for playing neurotic yet passionate losers -- yet both their performances transcend those descriptions. The character of the mother is terrific as well. There is a subplot involving a woman named Radish that is a little puzzling, and some details that are purposefully vague (china clock? hospital pervert?) But they don't detract from the movie - the ambiguities enhance it.",
         "Techine has made a beautiful film about lost childhood,the passing time and old age.Ma Saison preferee succeeds as it evokes situations which each one of us have experienced in our lives.It is primarily a film about the complex relationship a mother has with her children. Berthe does not want her children to worry about her as she is aware of the fact that no one cares about her.Her illness facilitates a true meeting between all family members.Berthe is resolute enough to realize that she has to get ahead in life on her own terms as no one is bothered about her welfare.Ma Saison preferee is a slice of life as witnessed in present day France.The film is divided into episodes each dealing with events related to the family.The film is about difficult life old people are forced to lead when their children start ignoring them.Ma Saison preferee is as simple and straightforward as flowing water.This has been Techine's most remarkable film about family life after Souvenirs d'en France.",
         "I must confess I have become a huge fan of both Techine and Daniel Auteuil after watching \"My Favourite Season\". Simply love it love it love it! Techine is the master in movie character developments and excellent at developing and embodies personal tensions and interactions between characters. In \"Wild Reeds\", it was among 4 teenagers and in \"My Favourite Season\", it's among family members and it was done superbly and extremely convincingly. The human emotions, conscience and tensions between siblings, between parents and children (both Berthe's and Emilie's children), between spouses, between a son-in-law and mother-in-law, between an uncle and his nieces were written and acted out extremely authentically and unpretentiously. It hits right at you and set you thinking about your own relatives and the corresponding tensions and relationships in your own life. This is so crude yet so real and audience are left to be awed at how genuine and honest this is especially for those who can feel connected to one of some of the characters. A few scenes were utterly moving and sweet to me. Antoine and Emilie singing in the car with Berthe listening and could not helping smiling from her heart in the backseat. The scene where Antoine rushed back to his flat to check on his ill and depressed sister fearing that she would plunge off the balcony. The scene where Antoine deliberately \"fell\" from the balcony just to attract attention from her angry sister. Not to mention the extremely beautiful and touching discussions about favourite seasons at the end which built up to an incredible climax at the end, so typically spectacularly done by Techine. I admire Daniel Auteuil who portrays Antonie very fittingly. Confidently, self-righteous yet passionate successful surgeon, Daniel was very convincing and makes Antonie a highly likable and romantic character throughout. Personally, I would rate \"My Favourite Season\" higher than \"Wild Reeds\", even though both are absolutely amazing and beautiful character studies. I wish this is not yet the best of Techine as I expect more of this good stuff from this truly wonderful and unique director. This is among my all time favourites, closely followed by \"Wild Reeds\" and \"You can count on me\" in this similar genre."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "D.A. Films",
         "Les Films Alain Sarde",
         "TF1 Films Production"
      ],
      "summaries": ["Old woman Berthe leaves her house to live in her daugter Emilie's one. Emilie and her brother Antoine have fallen out three years ago and have not seen each other since, but Emilie invites him for Christmas. Memories will come up, and will be depicted both Berthe's destiny and the strange relationship between Emilie and Antoine."],
      "budget": 0
   },
   "movielensId": 621,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1993-05-14",
      "dvdReleaseDate": "1998-01-14",
      "directors": ["André Téchiné"],
      "runtime": 127,
      "movieId": 621,
      "title": "My Favorite Season",
      "mpaa": null,
      "actors": [
         "Daniel Auteuil",
         "Marthe Villalonga",
         "Catherine Deneuve",
         "Jean-Pierre Bouvier",
         "Chiara Mastroianni",
         "Carmen Chaplin",
         "Anthony Prada",
         "Michèle Moretti",
         "Jacques Nolot",
         "Bruno Todeschini",
         "Jean Bousquet",
         "Roschdy Zem",
         "Ingrid Caven"
      ],
      "imdbMovieId": "0107471",
      "originalTitle": "Ma saison préférée",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["z7tbO3dwri0"],
      "plotSummary": "Old woman Berthe leaves her house to live in her daugter Emilie's one. Emilie and her brother Antoine have fallen out three years ago and have not seen each other since, but Emilie invites him for Christmas. Memories will come up, and will be depicted both Berthe's destiny and the strange relationship between Emilie and Antoine.",
      "tmdbMovieId": 52873,
      "avgRating": 3.59329,
      "releaseYear": "1993",
      "numRatings": 343,
      "posterPath": "/hmb9Iu6jzvV8jrIz4z73ZRWP91s.jpg"
   }
}