{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113839",
      "video": false,
      "title": "A Modern Affair",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Grace Rhodes",
               "gender": 1,
               "credit_id": "52fe4a97c3a368484e15c2f3",
               "name": "Lisa Eichhorn",
               "profile_path": "/1yvBmX8G8AX6pVIJvvzhfnqtwcm.jpg",
               "id": 28950,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Peter Kessler",
               "gender": 2,
               "credit_id": "52fe4a97c3a368484e15c2f7",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Elaine",
               "gender": 1,
               "credit_id": "52fe4a97c3a368484e15c2fb",
               "name": "Caroline Aaron",
               "profile_path": "/9v9h9bR4CX6MrpZFgEktTHFIlgT.jpg",
               "id": 1910,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lindsey",
               "gender": 0,
               "credit_id": "52fe4a97c3a368484e15c2ff",
               "name": "Mary Jo Salerno",
               "profile_path": null,
               "id": 1078331,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ernest Pohlsab",
               "gender": 2,
               "credit_id": "52fe4a97c3a368484e15c303",
               "name": "Robert Joy",
               "profile_path": "/xh5eb9p379k9w3NOGRjEyAw2yrP.jpg",
               "id": 19976,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ed Rhodes",
               "gender": 2,
               "credit_id": "52fe4a97c3a368484e15c307",
               "name": "Wesley Addy",
               "profile_path": "/qc8DGqS0pZJon3cVgDl3jVzW4SU.jpg",
               "id": 66712,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ben",
               "gender": 0,
               "credit_id": "52fe4a97c3a368484e15c30b",
               "name": "Robert LuPone",
               "profile_path": "/hIVQjz4iP4JJ5c8euwVjEsG9SiO.jpg",
               "id": 55496,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "52fe4a97c3a368484e15c30f",
               "name": "Cynthia Martells",
               "profile_path": "/tTXEfp2Co8vQlLefB1QGZeU3NlJ.jpg",
               "id": 151349,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Diane",
               "gender": 1,
               "credit_id": "52fe4a97c3a368484e15c313",
               "name": "J. Smith-Cameron",
               "profile_path": "/nlqKCF29YVHmn9w2IX9pMa5nMqe.jpg",
               "id": 52475,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe4a97c3a368484e15c317",
               "name": "Vincent Young",
               "profile_path": "/v6CDSz5OL4PZ4CbHgUQ722Cn91e.jpg",
               "id": 180150,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Dr. Gresham",
               "gender": 0,
               "credit_id": "52fe4a97c3a368484e15c31b",
               "name": "Tammy Grimes",
               "profile_path": "/bUWIHI7EqFXcnks9vtUwjqnbNuV.jpg",
               "id": 63998,
               "order": 10
            }
         ],
         "crew": []
      },
      "genres": [],
      "popularity": 0.080234,
      "production_countries": [],
      "id": 123505,
      "vote_count": 1,
      "budget": 0,
      "overview": "A Modern Affair is an independent feature directed by Vern Oakley and produced by Tribe Pictures. Starring Stanley Tucci and Lisa Eichhorn, the film's plot reverses the conventions of romantic comedies: instead of man meet woman - fall in love, marry and have baby, in this film the woman gets pregnant, then meets the father, then falls in love. Grace Rhodes (Lisa Eichhorn) is a lonely, successful executive whose biological clock is loudly ticking.",
      "similar": [
         49410,
         58623,
         110115,
         126926,
         66623,
         122394,
         113240
      ],
      "original_title": "A Modern Affair",
      "runtime": 90,
      "poster_path": "/7trUFphXilwxqbMmRd5q5TXrM3x.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-09-06",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "They met, fell in love, and had a baby. (Not necessarily in that order.)",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vern Oakley"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Vern Oakley",
         "Paul Zimmerman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113839/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5MDM4NzM2OV5BMl5BanBnXkFtZTcwODU2OTYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lisa Eichhorn, Stanley Tucci, Caroline Aaron | See full cast and crew »"],
      "reviews": [
         "This is a very strange and dark movie. Solely on the basis of Lisa Eichhorn's presence in it, I saw it (alone) in a New York theater the evening I read the newspaper review. In this sole N.Y. theater for its performance, on the night it opened, only one other person was in the theater at the 7:30 showing. I have loved Lisa Eichhorn since I first saw her in Yanks. If she's in a play, I attend the play. If she's in a TV program, I watch the TV program. I've never been like this about another actor or actress. She has qualities that are apparently unappreciated because she has not become a big star. Perhaps her most evident characteristic is a look of extraordinary intelligence and sensitivity. Although some other actresses share this (e.g., Mary Beth Hurt, Blair Brown, Lee Remick, Amy Irving, Meryl Streep), Eichhorn also has an other- worldly sort of presence. She is never really there - there are depths of feeling and perception and memory into which some random comment has thrust her. She is the most fascinating actress I've ever seen. Although meant to be a sort of comedy, the movie is in fact quite sad and dark. Fortunately, Miss Eichhorn is wonderful at \"sad and dark\"! There is a short but very moving scene with Wesley Addy (playing her quite old father) in which his life-long contempt for his daughter's competence is made clear without too much being said. The loneliness of a woman in a large city at the end of the century is what the movie is really about - and it makes one shiver. The niche of former times, places is gone - the preserving of jams and the quilting bee are gone, the organizing committee and the planned demonstrations are not for most, the spouse and hearth do not exist. What is left is an ageing woman, conscientious and longing for connection. It is Lisa Eichhorn's movie and she can be admired. (Although Mr. Tucci is fine, I think the character overreacts to the central turnign point in the movie and thus becamse unlikeable). On a rainy day or evening, when your husband calls to say he'll be late, but your sister is visiting and the baby quietly sleeps, see this movie, and you'll be moved.",
         "I think this is Stanley Tucci's first big film role, and you can really tell why his career took off after this. While his character (Peter) may not always be very likable at times in the film, he is a really dynamic character. The big scene where he fights with Lisa Eichhorn's character is absolutely heart- breaking and so powerful. I can't believe that he didn't win any Oscar for this role. I love watching him in this film. Lisa Eichhorn also plays an incredible role in this. She reminds me a bit of Meg Ryan and Meryl Streep. It's a great performance. I recommend this movie for anyone who loves film!",
         "I just watched \"A Modern Affair\" on Hulu, where they have the entire film online. I was absolutely blown away by Lisa Eichhorn's performance. She's realistic, relatable, and smart. As a successful career woman, Grace hasn't got time for men, nor does she feel like she can ever connect with one. Her best friend is constantly encouraging her to strike up a relationship, but Grace finds it too difficult. However, lacking any real meaning in her personal life, she does decide that she is determined to start a family. Her journey looking for love and happiness isn't a fairytale like you'd find in some movies, but it's like real life, which is probably why I like this movie so much. It's not an escapist film, it's something real women (and men) can identify with.",
         "I came across this movie on a small independent vendor website because I am a big fan of Stanley Tucci. I have to say, I was pleasantly surprised with this little known classic. Here is my synopsis: Grace Rhodes' biological clock is ticking and time is running out. As a middle aged woman in New York city, finding the perfect man is more of a crap shoot than a dance with cupid. With the prospects running thin and the need for something more fulfilling in her life, she finds the perfect solution, cashing out at the local sperm bank. But finding the right wiggly candidate for the job isn't enough, soon she can't resist the desire to meet her test tube lover in person. Stanley Tucci plays Peter Kessler, donor #247, an artist who just so happens to be on the market for a new lady when Grace Rhodes steps in. What follows is a contemporary love story that could only be told in an age of cryogenics and gene modification. A Modern Affair is a truly unique take on the traditional boy meets girl love story. Heartfelt, witty, and original, it will take all the inhuman discomforts that an age of cold scientific research creates and nestle you warmly back into the purity of love and destiny. Stanley Tucci and Lisa Eichhorn both deliver top notch performances in this film. However, I must say that my personal favorite was Grace's best friend, Elaine, played by Caroline Aaron. She is just the kind of spunky risk taking friend that everyone wants to have and makes stories like these possible. The dialogue is also not to be missed, like when Grace contemptuously envisions a young temp as \"engaging in the most photogenic sex that God or Calvin Klein ever devised.\" If your looking for a quiet night kind of movie that'll make you chuckle and just feel good, then A Modern Affair is a perfect match.",
         "While this is mostly categorized as a \"romantic comedy,\" I think this film is actually a great drama. It's so touching and heart-wrenching. Lisa Eichhorn's character (Grace) is a strong, career-driven woman who wants to have a child but has a problem relating with men. Instead of trying to meet a man in the conventional way, she takes herself to a sperm-donor bank. However, she gets nervous about the outcome of her procedure, and decides that she wants to meet the owner of the specimen she purchased. After a bit of detective work, she discovers Peter (played by Stanley Tucci) as the father of her unborn child. The romance that unfolds between the two of the is wonderful to watch\u0097it's exciting! I love this movie!",
         "At first, I was skeptical about the direction this movie was taken, but i was so pleasantly surprised by this movie. It was sweet and loving while also funny. the perfect movie for a first date or a committed relationship. Stanley Tucci is young. He is plays the perfect role of a smart, determined, sexy man. Despite his age, he exhibits acting abilities that are precocious. Lisa Eichhorn is gorgeous as ever. Although I think that she may have been the weakest role, that is only because every other character was so strong. Her pain and sadness in the movie is so heartfelt that it sucks the viewer in even further. I loved this movie and you will too.",
         "Lisa Eichhorn, Stanley Tucci, and Caroline Aaron are all at their best in this one. Being a Stanley Tucci fan, it was interesting to see him in his first big role, before any of his blockbuster movies. You can really see why his career took off after watching it. His performance as an edgy, carefree bachelor is really convincing, and extremely relate-able for men everywhere. The plot was compelling and surprisingly relevant for a film that's 20 years old; definitely ahead of it's time. The film is has it's funny moments, but in a dark humor type of way. It portrayed a lot of emotions; Passion, loneliness, fear, and introspection were all present and well done. The writers did a great job of adding dimension to each character by giving them familiar and redeeming qualities. Lisa Eichhorns performance as \"the middle aged bachelorette friend whose biological clock is running out of time\" is spot on. Elaine is the spunky, wild-card friend we all have; she reminds me of college. Peter is a mysterious bachelor; stereotypically afraid of commitment. I personally related to Peter on a psychological level, and would imagine many woman feel the same about Grace. Overall, I would definitely recommend watching \"A Modern Affair\" on a night at home for some quick laughs. It's sure to hold your attention, and is a perfect \"relax after work\" movie.",
         "A Modern Affair sets up an interesting premise for a romantic comedy. While it follows the standard beats of a RomCom, it's still an entertaining film. It works because the comedy is funny, but not overbearing, the characters seem like real people, and the dialogue is consistently realistic. At times the dialogue is absolutely spot on. The realism in the characters allows for a good look into relationships and (new) parenting. There is also a subplot of city living versus country living. While interesting, I think this could have been expanded even more. Grace and Peter are two different people in very different settings, yet we only get a little bit of the conflict between the places they live. Solid film that is worth the watch.",
         "I came across this film earlier in the year. I was looking to see what Ms. Eichhorn had acted in that I had not seen and there it was. She always appears to have a way to connect with her audience. He approach always appears realistic and on target, for me, anyway. I would suggest this film for anyone who enjoys a quality performance from a truly talented artist. I have always admired Ms. Eichhorn since the first time I viewed YANKS. I could never understand what it was about that film that never \"took off.\" Modern Affair is an equally, genuine performance. It captures humor, realism, and thought so often missing in todays fims.",
         "I found this simply by surfing through the IMDb randomly one day from Stanley Tucci's page and thought it looked interesting, so I watched it. I was so surprised to find such a gem of a film tucked away! He has always been one of my favorites. Tucci is, of course, great in this film and makes it worth watching on its own--but there are so many funny, cute moments in it that it really is a great film. I loved the whole scene in the gallery- the writing was spot on and really did make me laugh. I can see myself re-watching it if I'm looking for a feel- good pick me up sometime. I would highly recommend this to anyone looking for some good, solid entertainment."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Nick of Time Productions Inc."],
      "summaries": ["\"A Modern Affair\" is a romantic comedy about the strain of contemporary relationships, one woman's urgent desire for parenthood, and a solution to it all. Grace Rhodes is the perfect corporate executive -- bright, successful, attractive and with just professional touch. With her career in place, Grace feels she has everything she needs -- until she bumps into an ex-boyfriend bearing photos of his young kids. Feeling the irresistible urge to have a child, but not sure about waiting around for Mr. Right,\" Grace knows what she wants, but not how best to get it. Elaine, her wryly pragmatic best friend, suggests that Grace do the unthinkable and enlist the services of a sperm bank. After choosing a donor from the \"DNA menu,\" Grace becomes pregnant and deeply curious about the identity of the donor #247. Enter Peter Kessler, a handsome photographer who divides his time between his craft, his casual affair with a married woman, and his \"other job:\" depositing specimens as a sperm donor to earn a little extra cash. When Grace and Peter finally meet, they begin the journey down the rocky road to parenthood and possibly from there to love."],
      "budget": 0
   },
   "movielensId": 623,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-06",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 90,
      "movieId": 623,
      "title": "A Modern Affair",
      "mpaa": "R",
      "actors": [
         "Lisa Eichhorn",
         "Stanley Tucci",
         "Caroline Aaron",
         "Mary Jo Salerno",
         "Robert Joy",
         "Wesley Addy",
         "Robert LuPone",
         "Cynthia Martells",
         "J. Smith-Cameron",
         "Vincent Young",
         "Tammy Grimes"
      ],
      "imdbMovieId": "0113839",
      "originalTitle": "A Modern Affair",
      "genres": [""],
      "youtubeTrailerIds": ["yHuPzfTIFFU"],
      "plotSummary": "A Modern Affair is an independent feature directed by Vern Oakley and produced by Tribe Pictures. Starring Stanley Tucci and Lisa Eichhorn, the film's plot reverses the conventions of romantic comedies: instead of man meet woman - fall in love, marry and have baby, in this film the woman gets pregnant, then meets the father, then falls in love. Grace Rhodes (Lisa Eichhorn) is a lonely, successful executive whose biological clock is loudly ticking.",
      "tmdbMovieId": 123505,
      "avgRating": 3.26087,
      "releaseYear": "1996",
      "numRatings": 46,
      "posterPath": "/7trUFphXilwxqbMmRd5q5TXrM3x.jpg"
   }
}