{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "answering machine",
            "id": 1947
         },
         {
            "name": "telephone",
            "id": 6103
         },
         {
            "name": "masturbation",
            "id": 33451
         },
         {
            "name": "telephone sex",
            "id": 187551
         }
      ],
      "imdb_id": "tt0112844",
      "video": false,
      "title": "Denise Calls Up",
      "recommendations": [
         47046,
         55711,
         61475
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Frank Oliver",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128c7b",
               "name": "Tim Daly",
               "profile_path": "/eLBlqpzOv1F9oPcWSU76yiuXneU.jpg",
               "id": 68122,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Barbara Gorton",
               "gender": 1,
               "credit_id": "52fe4733c3a36847f8128c7f",
               "name": "Caroleen Feeney",
               "profile_path": null,
               "id": 535284,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Martin Weiner",
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128c83",
               "name": "Dan Gunther",
               "profile_path": null,
               "id": 154386,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gail Donelly",
               "gender": 1,
               "credit_id": "52fe4733c3a36847f8128c87",
               "name": "Dana Wheeler-Nicholson",
               "profile_path": "/xxeZ2ZVM3t9NWLLpu8qmzJesktz.jpg",
               "id": 58866,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jerry Heckerman",
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128c8b",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Linda",
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128c8f",
               "name": "Aida Turturro",
               "profile_path": "/hvQKy8ZdeWWVBgLbeczkm0kyAgU.jpg",
               "id": 106791,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Denise Devaro",
               "gender": 1,
               "credit_id": "52fe4734c3a36847f8128c93",
               "name": "Alanna Ubach",
               "profile_path": "/g0GOzbSDAzhMxoCBNofiMxHIJJj.jpg",
               "id": 10402,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sharon, Gail's Aunt",
               "gender": 1,
               "credit_id": "52fe4734c3a36847f8128c97",
               "name": "Sylvia Miles",
               "profile_path": "/osHOZQ4Mu9xyNDT79fgeSgJeLlH.jpg",
               "id": 19335,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4733c3a36847f8128c77",
               "name": "Hal Salwen",
               "profile_path": null,
               "id": 974388,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5463762a0e0a267803002410",
               "name": "Hal Salwen",
               "profile_path": null,
               "id": 974388,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56a2cfa79251417202000fce",
               "name": "Ray Fisher",
               "profile_path": null,
               "id": 1393558,
               "department": "Art",
               "job": "Leadman"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.537829,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47449,
      "vote_count": 6,
      "budget": 0,
      "overview": "A group of friends in New York, working away at their PCs and laptops, keep in touch exclusively by phone and fax. They are all too busy to meet face to face. Gale plays matchmaker, by phone, to Jerry and Barbara who, in turn, hit it off beautifully – via phone and fax. Martin gets a telephone call from someone he's never met. It's Denise, with some extraordinary news. Tapping away at his computer all the while, he develops a sort of friendship with Denise – via phone. And so it goes as the friends, tap, tap, tapping away, share news, hopes, and dreams – via phone and fax. Finally Gale has an unfortunate encounter with a phone, Denise has some more news for Martin, and Frank plans a gala New Year's Eve party, but will he answer the door?",
      "similar": [
         55580,
         81774,
         112160,
         401,
         71552,
         138697,
         8275,
         565,
         249397,
         398818,
         7512,
         1391,
         9759,
         338964,
         9549,
         11013,
         10707,
         9962,
         8617,
         12143
      ],
      "original_title": "Denise Calls Up",
      "runtime": 80,
      "poster_path": "/y3Jzrup1AARl8TBaQPbTR1FRnx8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/oyzh3Ax1DLJ5gbNRgD6JgMz9Uvd.png",
            "name": "Davis Entertainment",
            "id": 1302,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Skyline Entertainment Partners",
            "id": 38179,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dark Matter Productions",
            "id": 38180,
            "origin_country": ""
         }
      ],
      "release_date": "1995-05-17",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "A hilarious heart-ringing fable about life, love and hangups.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hal Salwen"],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Hal Salwen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112844/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5MTM1NjIxNV5BMl5BanBnXkFtZTcwMTc5OTkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tim Daly, Caroleen Feeney, Dan Gunther | See full cast and crew »"],
      "reviews": [
         "Just caught this movie on the Starz cable channel. Excellent, original movie. Great understated performances. Definitely ahead of its time. This movie was made in 1995, just as the Internet, email and wireless technology was coming to the fore. Five years on, this movie is even more relevant. I wonder how many people find themselves in the kind of relationships depicted. This movie is very European in outlook and sensibility. See it.",
         "This unusual (to say the least) comedy is well ahead of its time with a message for all of us, who are so wrapped up in our work, that we have completely \"un-learned\" how to enjoy life. -- A 90-minute string of phone conversations, telephone answering machine messages and e-mails ends in at least TWO PEOPLE re-connecting with life they once knew as worth living. A group of \"yuppie\" friends is in contact only through modern day communication systems. When a young woman (Denise) calls the sperm donor, whose child she is about to give birth to, the cyber-serene world of the clique begins to rock. The scene where one of the friends leaves a phone message to another clique member while getting into a fatal car wreck is morbitly funny. This movie resembles a very long joke that entertains you while you eventually reach the punch line. There are many laughs, but the seriousness of the message behind this comedy remains after viewing. Have we all turned into little cell-phone-toting robots? Released in 1995, this film is in tune with our changing times. This film will \"hit home\" with a lot of people. Recommended!",
         "A group of New Yorkers just have contact through telephone, fax and Internet. The conversation among them are only through telephone. The foods are ordered by telephone. Even sex is made by telephone. They are not able to go to the funeral of a common friend, or to join in a restaurant, or even to open the door for the others in a party. A creative critic to the individualism and solitude of the contemporary human beings. The difficulties of having a relationship and interact with another persons is presented in this acid comedy. A great work of edition, in a movie not indicated for all tastes. My vote is six. Title (Brazil): `Denise Está Chamando' (`Denise Is Calling')",
         "There are very good, specific comments on this film already, so I will limit mine to general, nearly abstract remarks. While some of the technology used in the film may become obsolete, the main theme is timeless. The paradox is this: as humans get more and more connected by phones, faxes, internet, and so on, they become more and more disconnected from each other. Virtual contact replaces physical contact. We are not the better for it. For raising a timeless question this movie will become a minor classic. The film has a great sense of humor. It may appeal to East Coasters, to Europeans, to fans of Woody Allen, and to lovers of independent New York comedies. Main target audience: you with the phone in the hand.",
         "Frank (Tim Daly) and his girlfriend, Gail, broke up five years ago but still stay in touch on the phone. It is Gail's idea to fix up her friend, Barbara with Frank's friend (Liev Schreiber). Yet, when Gail gives Barbara the man's telephone number, they get disconnected quite a few times. Once they start talking, however, their conversations definitely \"heat up\". Meanwhile, another friend gives a party for everyone but no one shows up. That's because everyone in this small circle of friends is agoraphobic! They work at their apartments, mostly, and they stay in touch via Ma Bell everyday. Another friend, Martin, gets a mysterious call one day from a lady named Denny. It seems she's pregnant with Martin's child, from a \"donation\" he gave to the local sperm bank. She calls quite often to give Martin an update. Meanwhile, one of the friends suffers a life-changing event because of a mobile phone. Will anyone of these folks ever see each other in real life? This is a highly unusual but very entertaining film. It is told almost exclusively in telephone conversations between the parties. If this sounds boring, I assure you, it is not! All of the actors are terrific and give their characters a nice depth, despite the film's premise. The usual amenities, the costumes, the sets, and the production values, are fine, also. But, most of all, the script is a winner, with great lines and originality. If you are a film fan who never plays it safe, you will thoroughly enjoy this movie. So, even if you are an agoraphobic yourself, don't miss out on this one! Send someone to the video store, if you have to, to get this film into your hands. You will be darn glad you did.",
         "(May contain spoilers!) I'd read the reviews when this came out in 1995, and had a positive Psychic Movie Reviewer Moment. Of course it was good. Certainly I would rent it someday. Suddenly, there I was at Blockbuster, with a copy of Denise Calls Up in my hands. Characters connected by friendship and technology somehow never manage to actually see one another in person. Contemporary society experiences life, birth, lust, death, via technology. Did these people ever leave their apartments, or what? An amusing statement upon relationships in the cyber age, Denise Calls Up has good performances by all. There were many realistic scenarios here, and great dialogue. I was hoping that this diverse group of characters would eventually meet in person. But the scenes were all the more effective because some of the characters would not end up doing so. Even a funeral did not bring them together, nor a much ballyhooed New Year's Eve party at the end of the film: well, Denise and Marty, who'd had a child together, finally did meet in person. One poignant and ironic scene involved two romantically involved characters who walk right past one another on the street, not knowing each other's physical identity. In their portrayal of phone sex, characters Jerry and Barbara were brilliant. Seemingly a realistic portrayal of such,the characters began their neophyte experience hesitantly, awkwardly,and unsure of how to proceed. Eventually Jerry becomes convinced that Barbara is faking orgasm over the telephone. What a concept. (Paraphrasing)\"I am soo upset. I just know that Barbara is faking it!... her choice of phraseology... her timing... her inflections! Damn! Who does she think she's fooling?\" Several of my favorite obscure actors starred. Alanna Uback was great as Denise. Also: See her hysterical performance as Marsha's sleepover friend in The Brady Bunch Movie. Liev Schreiber as Jerry was excellent. He has been on my radar for a few years now. He recently portrayed Orson Welles in RKO 281. Also see him in The Daytrippers. Rent Denise Calls Up today. See it again, or see it for the first time.",
         "Life, love, sex, birth, death...and all on the phone. This very hip comedy is all about a handful of New York guys and gals who tend to their relationships via telephone while busily hammering at computers or are otherwise indisposed with the necessities of living. Fresh, creative, and fun, \"DCU\" moves along quickly and runs a short 80 minutes all the while keeping the audience wondering if these people are ever going to get together. Only for those into droll, spoofy, fast talking, relationship-based, off-the-wall comtempo comedy.",
         "This movie is very good all around acting, writing, directing. . Everybody knows someone who you are keeping the relationship up only by talking on the phone. I think this movie came out when only a small group of hardcore computer freaks sent message over the phone lines; before everybody in the world could send e-mail anytime, anywhere of the day. This is up there with 2001: A Space Odyssey and Citizen Kane as of being before its time REALLY!! Rent it a see if watching this movie isn't like looking into a mirror.",
         "I just saw this movie on WE Network and felt compelled to comment. I mean it was just, like, totally delightful! Hal Salwen has the world we live in pegged perfectly! Schreiber is spot on as the repressed shut-in, and Ubach is a standout as the quirky Denise who's struggling to reach out from her own little enclosed space. Hooray for everyone, cast and Salwen, for just a wonderfully sly, bittersweet, but ultimately satisfying experience!",
         "My girlfriend, an aspiring movie critic (who told me about this internet site) just brought this flick home from the video store and said she heard good things (seems they study this movie in her film classes). I was dubious... and then I was bowled over. I mean are there any more movies out there (in english, and that aren't fifty years old) that I haven't heard of that are this good? The only problem is, too many movies like this might ruin me for the knuckle-brained stuff that's in the theaters (and that I must admit I do enjoy). Still, once and awhile it's good to sip a nice wine, after overloading on diet pepsi. Try it."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Dark Matter Productions",
         "Davis Entertainment",
         "Skyline Entertainment Partners"
      ],
      "summaries": ["A group of friends in New York, working away at their PCs and laptops, keep in touch exclusively by phone and fax. They are all too busy to meet face to face. Gale plays matchmaker, by phone, to Jerry and Barbara who, in turn, hit it off beautifully...via phone and fax. Martin gets a telephone call from someone he's never met. It's Denise, with some extraordinary news. Tapping away at his computer all the while, he develops a sort of friendship with Denise...via phone. And so it goes as the friends, tap, tap, tapping away, share news, hopes, and dreams...via phone and fax. Finally Gale has an unfortunate encounter with a phone, Denise has some more news for Martin, and Frank plans a gala New Year's Eve party, but will he answer the door?"],
      "budget": 0
   },
   "movielensId": 633,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-05-17",
      "dvdReleaseDate": null,
      "directors": ["Hal Salwen"],
      "runtime": 80,
      "movieId": 633,
      "title": "Denise Calls Up",
      "mpaa": null,
      "actors": [
         "Tim Daly",
         "Caroleen Feeney",
         "Dan Gunther",
         "Dana Wheeler-Nicholson",
         "Liev Schreiber",
         "Aida Turturro",
         "Alanna Ubach",
         "Sylvia Miles"
      ],
      "imdbMovieId": "0112844",
      "originalTitle": "Denise Calls Up",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["nMsQ2jWom_M"],
      "plotSummary": "A group of friends in New York, working away at their PCs and laptops, keep in touch exclusively by phone and fax. They are all too busy to meet face to face. Gale plays matchmaker, by phone, to Jerry and Barbara who, in turn, hit it off beautifully – via phone and fax. Martin gets a telephone call from someone he's never met. It's Denise, with some extraordinary news. Tapping away at his computer all the while, he develops a sort of friendship with Denise – via phone. And so it goes as the friends, tap, tap, tapping away, share news, hopes, and dreams – via phone and fax. Finally Gale has an unfortunate encounter with a phone, Denise has some more news for Martin, and Frank plans a gala New Year's Eve party, but will he answer the door?",
      "tmdbMovieId": 47449,
      "avgRating": 3.38571,
      "releaseYear": "1995",
      "numRatings": 350,
      "posterPath": "/y3Jzrup1AARl8TBaQPbTR1FRnx8.jpg"
   }
}