{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cop",
            "id": 8015
         },
         {
            "name": "dinosaur",
            "id": 12616
         }
      ],
      "imdb_id": "tt0114658",
      "video": false,
      "title": "Theodore Rex",
      "recommendations": [
         31393,
         35645,
         112666,
         20468,
         84626,
         34941,
         31118,
         9680,
         28340,
         7269,
         37536,
         112937,
         31131,
         14127,
         12759,
         27855,
         107438,
         39997,
         26626,
         19433
      ],
      "backdrop_path": "/7QWOQDhiJDdMe93C2CcqTBhq9Iq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Katie Coltrane",
               "gender": 1,
               "credit_id": "52fe45d89251416c9104070f",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Theodore Rex",
               "gender": 2,
               "credit_id": "53f628e80e0a267f80005909",
               "name": "George Newbern",
               "profile_path": "/kUFci5BzhMyx3ZNQEvpauRmpMyT.jpg",
               "id": 59222,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Commissioner Lynch",
               "gender": 2,
               "credit_id": "52fe45d89251416c91040725",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Molly Rex",
               "gender": 1,
               "credit_id": "52fe45d89251416c91040721",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Elizar Kane",
               "gender": 2,
               "credit_id": "52fe45d89251416c91040719",
               "name": "Armin Mueller-Stahl",
               "profile_path": "/cKdfUl7EuUpBncwvJo2t3hYJPNi.jpg",
               "id": 12647,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dr. Veronica Shade",
               "gender": 1,
               "credit_id": "53f6290a0e0a267f7d0059c8",
               "name": "Juliet Landau",
               "profile_path": "/dY8yp1pEQP9tGhQf0R2baPgCAeF.jpg",
               "id": 7137,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Spinner",
               "gender": 2,
               "credit_id": "52fe45d89251416c9104071d",
               "name": "Bud Cort",
               "profile_path": "/mwCVkL9BG1ZCF9icbcKjE8TCS7H.jpg",
               "id": 4971,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Rogan",
               "gender": 2,
               "credit_id": "52fe45d89251416c91040729",
               "name": "Joe Dallesandro",
               "profile_path": "/lxpfX2F8yBF8rsIGkmWwN04B4qJ.jpg",
               "id": 29915,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Edge",
               "gender": 2,
               "credit_id": "53f629490e0a267f890058cb",
               "name": "Stephen McHattie",
               "profile_path": "/vSssg0R2VJLBUF0tb2rA4Vhsc4j.jpg",
               "id": 230,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Alex Summers",
               "gender": 2,
               "credit_id": "53f6299b0e0a267f830057c3",
               "name": "Peter MacKenzie",
               "profile_path": "/cbQ7JkLgeN4bfvQ1y9Kohk1vkYx.jpg",
               "id": 62597,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Voice Performer (voice)",
               "gender": 0,
               "credit_id": "5aaf4f4cc3a36846d503109b",
               "name": "Mickie McGowan",
               "profile_path": "/k7TjJBfINsg8vLQxJwos6XObAD6.jpg",
               "id": 84493,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Voice Performer (voice)",
               "gender": 1,
               "credit_id": "5aaf59a70e0a267827034bc3",
               "name": "Sherry Lynn",
               "profile_path": "/kQDSC2z7sb6S5HcpOH6cmeJokKE.jpg",
               "id": 214701,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53f6462bc3a3683407003ebd",
               "name": "Jonathan R. Betuel",
               "profile_path": null,
               "id": 70835,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53f64614c3a368340b00415d",
               "name": "Jonathan R. Betuel",
               "profile_path": null,
               "id": 70835,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53f6463fc3a3683403003ffd",
               "name": "Jonathan R. Betuel",
               "profile_path": null,
               "id": 70835,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.601054,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36259,
      "vote_count": 26,
      "budget": 33500000,
      "overview": "In an alternate futuristic society, a tough female police detective is paired with a talking dinosaur to find the killer of dinosaurs and other prehistoric animals leading them to a mad scientist bent on creating a new Armageddon.",
      "similar": [
         329,
         88751,
         135397,
         351286,
         10567,
         18890,
         15997,
         425,
         105864,
         12144,
         8967,
         9659,
         8355,
         1593,
         18162,
         49519,
         124905,
         278154,
         4982,
         1573
      ],
      "original_title": "Theodore Rex",
      "runtime": 92,
      "poster_path": "/aQhmZkynXG7Gu3YGSmF9k2skL3W.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1995-12-14",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "The world's toughest cop is getting a brand new partner. And he's a real blast from the past!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jonathan R. Betuel"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Jonathan R. Betuel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114658/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3Mjk4MDgzMl5BMl5BanBnXkFtZTcwODE4MTYyMQ@@._V1_SY316_CR1,0,214,316_AL_.jpg",
      "actors": ["Stars: Whoopi Goldberg, Armin Mueller-Stahl, Juliet Landau | See full cast and crew »"],
      "reviews": [
         "Ever since I started visiting this site, and voting for movies, I have never given any movie a rating of 1. Even the disturbing \"Dance! Workout with Barbie\" got a 2. There is a reason for this. Any time I find myself watching what I think is a really bad movie, I have to stop and ask myself the following question: \"Is this movie really as bad as the horrific soul-sucking beast that is 'Theodore Rex'?\" And I've never been able to answer \"yes\". I would give anything within reason to know what crackhead said \"Hey! Let's remake 'Blade Runner' with Barney in the Harrison Ford Role!\" and decided it was a good idea to actually spend the time and money to commit it to film. Furthermore, I want to know what the hell kind of market they were going to sell this towards if it hadn't gone strait to video. This is that rare monster: a movie that is way too violent for kids and way too insanely stupid for adults. I'd ask \"what were they THINKING?\" but in this case, it might actually be redundant. Anyhow, all you need to know is that you should only expose yourself to this monstrosity if you're one of the five or six rabid fans of \"Howard the Duck\", or if you are curious to see the most Evil Insane movie of all time, or you want to REALLY punish yourself.",
         "Movies about dinosaurs can be entertaining. So can Whoopi Goldberg movies. But Whoopi AND dinosaurs? After the first 20 minutes of \"Theodore Rex\", I had come to one conclusion: this movie is evil. Evil, vile, wicked and reprehensible in its spite for the audience. Nothing this bad is made by accident; this is the visual equivalent of a torture chamber. First of all, Whoopi does not make good action movies (watch \"Fatal Beauty\" if you think I'm lying), but the film makers don't care - she's a tough cop here, yet again. Seen a million cop buddy flicks this week? Well, here's number one million and one, pal. Don't like cute, humanistic animated dinosaurs since that Spielberg TV show about them? Too bad, here's another one and he's a cop, too! You one of those people that hates car chases, shoot-outs, sloppy dialogue, boring futuristic FX and seeing talented people (Goldberg, Mueller-Stahl, Roundtree) stuck in a movie that looks like a tax write-off? A BIG tax write-off? And you read this review all the way to the end. You DESERVE a sequel. Seriously. No stars, not a one. And if they really make a sequel to \"Theodore Rex\", Hollywood deserves to be attacked a whole herd of wise-cracking foam rubber dinosaurs. Now, I'd pay to see that.",
         "Theodore Rex is possibly the greatest cinematic experience of all time, and is certainly a milestone in human culture, civilization and artistic expression!! In this compelling intellectual masterpiece, Jonathan R. Betuel aligns himself with the great film makers of the 20th century, such as Francis Ford Copola, Martin Scorcese, Orson Welles and Roman Polanski. The special effects are nothing less than breathtaking, and make any work by Spielberg look trite and elementary. At the time of it's release, Theodore Rex was such a revolutionary gem that it raised the bar of film-making to levels never anticipated by film makers. The concept of making not just a motion picture featuring a dinosaur, but adapting an action packed, thrilling detective novel, co-staring a \"talking\" dinosaur with a post-modern name such as \"Theodore\", and an existential female police officer changed humanity as we know it. The world could never be the same after experiencing such magnificent beauty. Watching Theodore Rex is much akin to looking into the face of God and hearing Him say \"you are my most beloved creation.\" This is one of the few films that is simply TO DIE FOR!!!",
         "This is, without a doubt, the single worst movie ever created. There's no arguing here. This is it. End of story. The story is juvenile and sub-moronic, looking like it was created by a three-year-old fascinated with dinosaurs. The entire concept is just plain dumb. It's inconceivable how someone could possibly come up with something so stupid and think it was entertaining. The jokes are also completely lame. If you haven't seen this movie yet, consider yourself lucky. If your morbidly curious as to how bad this movie is, please don't make me describe it. Words can't express how completely awful this movie is. This isn't just bad as in being a bad movie. Even those have cohesion, if not entertainment value. This. . . This is. . . Ugh! Think of the worst story ever told and multiply its badness level by 5,000, and you still haven't come close to how awful this movie is. After giving Pokemon the Movie one point, giving this movie one point seems like nothing short of charity. That's how bad it is. Did the producers and directors even take film classes? Because this is a perfect example of how not to make a film. It looks like some amateur high on paint thinner made this film. If you rented this, please take it back and ask for a refund. And don't even think about renting it again.",
         "I was babysitting a family of three small children for a night and their mother gave me this to show for them having just grabbed it at Wal-Mart earlier in the week. All three children actually got physically ill while watching it. I'm pretty sure it was the pizza they ate, or something they all had picked up from school, but really it could have been this film. Absolutely disgusting. How any one can produce this caliber of trash is beyond me. Fortunately, I turned off the film when I noticed the children were not responding and acting strangely. For any parents out there, I strongly advise you to refrain from letting young children view this movie.",
         "This movie was astonishing. It is beyond atrocious. I often get together with a group of friends and go to the movie store to find awful movies to watch for their comedic value. My friend suggested this one, but as we watched it, people began to leave. I really wanted to finish it, just so that I could say that I had, but I was unable to. It's that bad. Horrible running gags, lame acting. The main characters are an annoying dinosaur klutz and Whoopi Goldberg. I would rather watch Costener's The Postman twelve times in a row than see a fraction of this movie again. I think they try to deal with some dinosaur discrimination issues, but the part of the movie that really stands out is the dinosaur constantly knocking things over with his tail, and then guffawing about it. It hurts. Watch it if you're an aspiring masochist, otherwise, leave this one alone.",
         "No matter what anyone tells you, there is a mere fact to the word \"possession\" in film circles -- such as \"what possessed you to greenlight this film?\" Religion doesn't have anything to do with it, but common sense does. That is, if your head is clear and you are of sound mind to make a judgment. On many levels I tried to rationalize where this film would entertain....or even interest the average consumer. The star? The story? The unique idea? A buddy movie that kids would love with a dinosaur and a black woman? On, my goodness! I am sure when this was an \"idea\", it sounded good. But somewhere during the course of development...someone should have pointed out where the idea could not translate into a piece of entertainment anyone would wish to watch or pay for...unless they were very much deeply under the influence of alcohol or drugs and saw something the rest of us could not see. Regardless, this is a complete mess. Mess, mess - sin and a mess. Who cares about the plot (what plot?) et al. Whoopie got a paycheck, but I would have been embarrassed to take it. I sure hope she fired her agent/manager/publicist over this career move. Obviously not, she went on to make more bad films. And more bad films. Sad.",
         "Theodore Rex is apparently much hated; some people have given it a 10-star rating, but I'm going to go with sarcasm on their parts. However, over half the people who've rated this gave it a 1. I suspect this is as much an effort to put this movie into the bottom 100 as anything else. The movie is not that bad. It isn't wonderful either, but it isn't abominable. I liked it as a kid, and while it isn't a masterpiece, it is watchable as a kid at least. It was a mediocre movie, but I thought it was fun. That being said, don't think this is some amazing movie. It isn't. It is watchable and mediocre, but there are lots of better movies around. But it definitely doesn't deserve a 1. This movie may not be mind-blowing, but it isn't the Land Before Time XI or Plan 9 From Outer Space. It is better than a lot of the insipid romantic comedies starring Jennifer Lopez. But its below the level of high quality entertainment. I'd not recommend buying it, but watching it once isn't a loss.",
         "What a mess!! Why was this movie made? This, and other movies of its \"caliber\" should be teaching tools on how not to make a movie. Children may like it, but anyone over 10 may or will disapprove. To make matters worse was the fact that such great talent like Whoopi Goldberg and Armin Mueller Stahl were entirely wasted in a film unworthy of any notice.",
         "Poor Whoopi Goldberg. Imagine her at a friend's dinner party, and she adds a comment to the in-depth political discussion going on. People just look at her and say, \"Oh what would YOU know, you were the star of 'Theodore Rex'\". How could anyone take her seriously after she lowered herself to be the star of this appalling piece of crap? Even little kids would be cringing in horror at this Thing. It reminded me of a particularly bad episode of 'Sigmund And The Sea Monsters'. Actually, come to think of it, 'Sigmund' was vastly superior to this. And however did it get made? By plying the producer with an illegal substance before telling him about it? Watch this hideous abomination at your own peril."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "J&M Entertainment",
         "New Line Cinema",
         "Shooting Star Entertainment"
      ],
      "summaries": [
         "In a future town a female police detective (Whoopi Goldberg) has to colaborate with Theodore Rex, a genetically generated Tyrannosaurus Rex, in order to investigate the murder of another dinosaure.",
         "In an alternate futuristic society, a tough female police detective is paired with a talking dinosaur to find the killer of dinosaurs and other prehistoric animals leading them to a mad scientist bent on creating a new Armageddon."
      ],
      "budget": 33000000
   },
   "movielensId": 634,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-14",
      "dvdReleaseDate": "2003-07-08",
      "directors": ["Jonathan R. Betuel"],
      "runtime": 92,
      "movieId": 634,
      "title": "Theodore Rex",
      "mpaa": "PG",
      "actors": [
         "Whoopi Goldberg",
         "George Newbern",
         "Richard Roundtree",
         "Carol Kane",
         "Armin Mueller-Stahl",
         "Juliet Landau",
         "Bud Cort",
         "Joe Dallesandro",
         "Stephen McHattie",
         "Peter MacKenzie"
      ],
      "imdbMovieId": "0114658",
      "originalTitle": "Theodore Rex",
      "genres": [
         "Fantasy",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["dY7gsUL9Xkk"],
      "plotSummary": "In an alternate futuristic society, a tough female police detective is paired with a talking dinosaur to find the killer of dinosaurs and other prehistoric animals leading them to a mad scientist bent on creating a new Armageddon.",
      "tmdbMovieId": 36259,
      "avgRating": 2.27384,
      "releaseYear": "1995",
      "numRatings": 367,
      "posterPath": "/aQhmZkynXG7Gu3YGSmF9k2skL3W.jpg"
   }
}