{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "letter",
            "id": 3344
         },
         {
            "name": "arkansas",
            "id": 5521
         },
         {
            "name": "childbirth",
            "id": 163277
         },
         {
            "name": "biracial",
            "id": 168471
         },
         {
            "name": "matriarchy",
            "id": 200690
         }
      ],
      "imdb_id": "tt0116275",
      "video": false,
      "title": "A Family Thing",
      "recommendations": [
         107934,
         399786,
         25297,
         21887,
         20637,
         31692,
         56179,
         44630,
         59441,
         33545,
         9774,
         15669,
         56448,
         91767,
         50536,
         12633,
         31643,
         208377,
         22023,
         128270
      ],
      "backdrop_path": "/chmabCHFgJhbeJDtXDJtzYWsOwT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Earl Pilcher Jr.",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df8d7",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ray Murdock",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df8db",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Virgil",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df8df",
               "name": "Michael Beach",
               "profile_path": "/lOlWhURNKyZHn71dvq7qC7fiwN6.jpg",
               "id": 87118,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Aunt T.",
               "gender": 1,
               "credit_id": "5464ccbe0e0a262942001edc",
               "name": "Irma P. Hall",
               "profile_path": "/jotUUXdkfC7kdreWHSEVamz2mUy.jpg",
               "id": 43853,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ruby",
               "gender": 1,
               "credit_id": "5464cccbc3a36804a7001f6a",
               "name": "Grace Zabriskie",
               "profile_path": "/ibBabuSM1UyPYFFo0wBXhGbqElk.jpg",
               "id": 6465,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ann",
               "gender": 1,
               "credit_id": "5464ccd40e0a2635c3001cfe",
               "name": "Regina Taylor",
               "profile_path": "/9lydQYDtczgSqu80wlr8SbeZvVj.jpg",
               "id": 21848,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Sonny",
               "gender": 2,
               "credit_id": "5464cce20e0a262938002099",
               "name": "David Keith",
               "profile_path": "/v1b7NQqJifk7xgt9HOGh0lvfkbP.jpg",
               "id": 18181,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Woman at Hospital",
               "gender": 1,
               "credit_id": "59712a649251417fef0066fe",
               "name": "Jacqueline Williams",
               "profile_path": "/1AcxysNCkYYh1AfZSDYUnuB3xpM.jpg",
               "id": 1855240,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Rocky Balboa (uncredited)",
               "gender": 2,
               "credit_id": "590da331c3a36864c600cd6d",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df8d3",
               "name": "Richard Pearce",
               "profile_path": null,
               "id": 73496,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5464cd0b0e0a26767e000070",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5464cd160e0a26294600209e",
               "name": "Tom Epperson",
               "profile_path": null,
               "id": 21061,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.64744,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41852,
      "vote_count": 15,
      "budget": 0,
      "overview": "Earl Pilcher Jr., runs an equipment rental outfit in Arkansas, lives with his wife and kids and parents, and rarely takes off his gimme cap. His mother dies, leaving a letter explaining he's not her natural son, but the son of a Black woman who died in childbirth; plus, he has a half brother Ray, in Chicago, she wants him to visit. Earl makes the trip, initially receiving a cold welcome from Ray and Ray's son, Virgil. His birth mother's sister, Aunt T., an aged and blind matriarch, takes Earl in tow and insists that the family open up to him.",
      "similar": [
         873,
         4347,
         82693,
         44264,
         1895,
         1586,
         956,
         1541,
         43347,
         37257,
         6023,
         339397,
         521,
         11010,
         354285,
         19255,
         2977,
         103731,
         37056,
         8999
      ],
      "original_title": "A Family Thing",
      "runtime": 109,
      "poster_path": "/v6BAse5R1jaTgxXNKMpdphVFZTh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Artists",
         "id": 60,
         "origin_country": ""
      }],
      "release_date": "1996-03-29",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "With family, everything is relative.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Pearce"],
      "runtime": 109,
      "synopsis": "Fifty-something Arkansas redneck Earl Pilcher Jr., learning that his biological mother was black and that his half brother, Ray lives in Chicago, drives his pickup to the windy city to meet Ray. Ray, who knows something about Earl's birth and other family, is not pleased to see Earl. Ray blames Earl's white racist father for his mother's death, and he harbors the same hatred for Earl himself. After a brief and unpleasant encounter with Ray, Earl is about to head home when his pickup is carjacked and he gets a nasty head wound from the jackers. Ray, a Chicago cop, reluctantly brings Earl to his home from the hospital because the doctor says Earl needs to stay awake and be watched, and that he should not travel for several days. Ray makes up a story about Earl and he being Korean war comrades for his Auntie T., the sister of Earl's and Ray's mother, Willa Mae, who raised Ray after Willa Mae died giving birth to Earl. But Auntie T., who is blind, sees right through Ray's story and knows who Earl is. When Ray's son, Virgil, returns home from his job as a city transit bus driver and finds Earl sleeping on the couch where Virgil usually sleeps, he demands to know who this white man is and why he's there. Then Auntie T. intervenes and insists that Ray tell Virgil the truth. Overhearing the quarrel, Earl decides to leave and find a motel. Ray goes after him and the two argue, then wrestle and scuffle in a vacant lot. The tussle almost turns out all right until Earl says he's not afraid of tangling \"with you or any other nigger on the street.\" Although he makes a half-hearted, lame apology immediately after saying it, Ray is furious and drives away, telling Earl, \"If you need any more help, don't call me. I'm through helping you!\" That night Earl, after getting drunk and being thrown out of a bar, sleeps under a bridge where a bunch of homeless people are camped. Ray, regretting leaving Earl, and urged by Auntie T., goes looking for Earl but doesn't find him. He puts in a call to the police dispatcher asking that as a favor to him the cops keep an eye out for Earl. In the morning Virgil takes the call that Earl has been found. Virgil's ex-wife, Ann, brings Virgil's two daughters, Kindra and Danielle, over, and all seven members of the extended family go on a picnic. There Earl learns that Virgil, who had a promising future in football and started with Ohio State, in his freshman year destroyed his knee and the promise of the career he had longed for. Later Earl has a heart-to-heart talk with Virgil, telling him he needs to find something to look forward to, that he has an ex-wife who's a good woman and two beautiful daughters. At first resistant to even listening to Earl, Virgil takes what Earl says to heart. Back home, Auntie T. gives Earl a photo of his mama, and tells both Earl and Ray the story of what happened the night Earl was born. She tells Ray he took his newborn baby brother in his arms and said, \"This is my baby.\" The next day, after Ray takes Earl to the police-impound lot to get back his stolen truck (which has been recovered little damaged except for a few bullet holes resulting from a gun battle the thieves had with police while using the truck in a bank robbery) the two brothers drive to Arkansas together in Earl's truck to visit their mother's grave.",
      "writers": [
         "Billy Bob Thornton",
         "Tom Epperson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116275/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1MjI1MTkwNl5BMl5BanBnXkFtZTYwNjcwNDU5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Duvall, James Earl Jones, Michael Beach | See full cast and crew »"],
      "reviews": [
         "I saw this movie back when it first came to video. I didn't know anything about it, but I put it in anyway and sat back with an open mind. What followed for the next two hours was a fascinating story of a bigoted, Mississipi tractor salesman who finds out that he is half black. While this might not sound like a big deal, let me explain a bit. I grew up down in the delta, near the location that this movie was filmed. It is a big deal down there. Unfortunately, the majority isn't quite as color-blind as they are in other parts of the united states and bigotry is still a pretty common thing. I'm sad to say that there is still a little bit of a barrier there, and if more people were to see this movie, then I'm sure things would be a little bit different. You see, Robert Duvall plays a fellow (not the most open-minded of sorts) named Earl. In the opening, we get to see the events that make up a typical day for Earl (coffee drinking, shooting the breeze, and selling tractors). We also learn that Earl's Mom isn't in the best health as she passes away ten minutes into the film. She also leaves a note behind telling Earl that she isn't his real mother. His real mother was black and Earl is the result of an affair that costs his blood mother her life. Since Earl came out looking white, he was raised up like nothing ever happened. I can see it as a shock. One, Earl appears to be in his mid-fifties. (that's quite a big shock to a guy in the prime of his life) two, he discovers that not only is he a b**tard child to a mother he never knew, he also has an older half-brother. After all of this, Earl needs to take a road-trip to get himself together and maybe meet the brother he never knew. What follows next is a journey (both physical and spiritual) that will show ol'Earl a thing or two about life and love. Written by Tom Epperson and none other than Ol' Billy Bob Thornton himself, \"A Family Thing\" is one of the best feel good movies I have ever seen. I highly reccommend it. It's pretty rare that a movie comes along that is good enough to change one's life. This oughta be required viewing for high-school students. What a film. 10/10",
         "Everything about this movie touched my heart. Robert Duvall has to be the best actor who's ever tread the face of this earth. The way he 'sinks into' his character in this particular film is almost uncanny. The completely fresh and unexpected perspective from which the story is written took my breath away. I confess when I first saw this film I had no idea who Billy Bob Thorton(one of the co-writers) was - I just knew that this was one of the best movies I'd ever seen. Never at any time during this film do you get that feeling of 'I've seen this somewhere before' - and in this day and age that's almost unheard of. How come you haven't seen it yet?? Believe me it's worth the hunt.",
         "This is a movie that reminds one of the saying: \"Just when I thought I knew the answers, they changed the questions.\" A Caucasian man discovers late in life that his mother was actually Black, instead of the White woman who raised him. The history of slavery in the US, and the American version of apartheid in the south that followed the Civil War until the Civil Rights Act of 1964 and given the often \"strained\" relations that exist today; the subject matter is important and challenging. The result is that \"A Family Thing\" is a little gem. It speaks of bigotry, fear, the way things were and the way things are. Some White Americans will not be comfortable with this movie. This will be due to the bigoted nature of Mr. Duvall's character, metaphoric of White hatred towards Blacks. Then, his world crumbles when he discovers when all is not what it seems. Kudos to the producers(of whom Mr. Duvall was one) and the cast for a superb lesson in confronting hate, and how one special Aunt can heal wounds generations old.",
         "A Family Thing is a drama about a Southen man (Duvall) who's mother reveals on her deathbed that he was not her child. Rather he was the result of a forced encounter between his father and the black help. In order to keep a promise Duvall sets off to find his half-brother (Earl-Jones). Although the story seems to be about race - it's main theme is one of forgiveness and acceptance of others, with race being one of the barriers to break down. All the characters have their own barriers to overcome - Duvall has to confront the fact that he is not white, Earl-Jones has to deal with his hatred of past events and Michael Beach has to come to terms with missing out on pro-football and the breakup of his marriage. Only the sagely aunt T. (Irma P. Hall) has the ability to accept everyone for whom they are - partly due to being blind \"and not being able to judge folks on what they look like\". It's not an earth shattering piece of story telling and at times doesn't seem to have a consistent flow to it but it held my attention throughout and was actually quite rewarding. It's all a bit tidy (in real life, nothing gets sorted this easy), but it definately makes you think.",
         "Robert Duvall is great as the Southern man who is in for a surprise when his daddy dies. James Earl Jones matches him ever step of the way in magnificent interaction. But Irma P. Hall as the mother, really steals the film. If you haven't seen this, rent it. If it doesn't make you cry and laugh, you have no emotions.",
         "Irma P. Hall should have won the Oscar for this performance. I can't believe she wasn't even nominated. Duvall and Jones were also wonderful. An actor's treat!",
         "What a pleasant surprise this was. I caught this one day on Showtime and really didn't give it much of a chance. But I was so wrong!! Powerful performance by Irma P. Hall (as Aunt T.), and Robert Duvall is at his best as well. Wonderfully acted and written, this has to be the best movie I have seen in a long while. Sure, the same old southern stereotypes are portrayed as well as the same for the inner-city black culture, with many being quite accurate. Some parts were a little over the top, like the birthday party in the bar that Earl crashes as a total stranger. But that being said, not a lot of negatives I can say about this movie.",
         "Robert Duvall's father dies and he finds out that he has a long-lost brother - a black man (played by James Earl Jones). He treks to the big city in order to find his brother (against his wishes, as he's a prejudiced Southener) and soon finds himself stuck under the company of Jones and his rambunctious family. This story isn't always as realistic as reality but it draws good allusions and parallels - I watched it very late one night expecting to fall asleep and, much to my surprise, I was completely entertained (and even touched) by the film's sweetness. It's an incredibly easy viewing - it touches on some deep racial issues but is never disturbing. It is a good family film with some strong morals and a rewarding finale that is a bit too simplistic, perhaps, but nevertheless uplifting and a nice reminder of many values many of us forget. A worthwhile, extremely underrated experience - highly recommended. 4.5/5",
         "A moving portrayal of the problems of racism - from both sides. The central characters a portrayed with incredible depth. Aunt T (Irma P. Hall) sums up the futility of racism - the films central theme - with the line \"being blind does not give me the opportunity to judge a person by their color\" (paraphrased). That being said, the film gets it's message across without preaching. An excellent film.",
         "I feel some of the best movies are those that depict human drama... Movies that 'could really happen' and this is one of them. \"A Family Thing\" is a story about an aging southern white man who learns at his mother's deathbed that not only was he adopted, but that his birth mother was black. This Robert Duvall / James Earl Jones pairing is superb! Aunt T (Irma P Hall) ties the movie together with her love for a dead sister's child deep enough to bridge any racial barrier. Her character uses homespun wisdom to enlighten 'the boys' with heartwarming honesty. Scenes include arguments/wrestling matches just like two natural siblings would participate in.. and of course there are moments when Aunt T's wisdom coaxes two half brothers into being whole ones... All in all A Good Watch...."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Butcher's Run Films"],
      "summaries": ["Earl Pilcher Jr., runs an equipment rental outfit in Arkansas, lives with his wife and kids and parents, and rarely takes off his gimme cap. His mother dies, leaving a letter explaining he's not her natural son, but the son of a Black woman who died in childbirth; plus, he has a half brother Ray, in Chicago, she wants him to visit. Earl makes the trip, initially receiving a cold welcome from Ray and Ray's son, Virgil. His birth mother's sister, Aunt T., an aged and blind matriarch, takes Earl in tow and insists that the family open up to him."],
      "budget": 0
   },
   "movielensId": 635,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-29",
      "dvdReleaseDate": "2001-05-08",
      "directors": ["Richard Pearce"],
      "runtime": 109,
      "movieId": 635,
      "title": "A Family Thing",
      "mpaa": "PG-13",
      "actors": [
         "Robert Duvall",
         "James Earl Jones",
         "Michael Beach",
         "Irma P. Hall",
         "Grace Zabriskie",
         "Regina Taylor",
         "David Keith",
         "Jacqueline Williams",
         "Sylvester Stallone"
      ],
      "imdbMovieId": "0116275",
      "originalTitle": "A Family Thing",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["65tMREjQXAQ"],
      "plotSummary": "Earl Pilcher Jr., runs an equipment rental outfit in Arkansas, lives with his wife and kids and parents, and rarely takes off his gimme cap. His mother dies, leaving a letter explaining he's not her natural son, but the son of a Black woman who died in childbirth; plus, he has a half brother Ray, in Chicago, she wants him to visit. Earl makes the trip, initially receiving a cold welcome from Ray and Ray's son, Virgil. His birth mother's sister, Aunt T., an aged and blind matriarch, takes Earl in tow and insists that the family open up to him.",
      "tmdbMovieId": 41852,
      "avgRating": 3.64138,
      "releaseYear": "1996",
      "numRatings": 1160,
      "posterPath": "/1FUTcckvJqdjAZkewfIYYj7fmOu.jpg"
   }
}