{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113122",
      "video": false,
      "title": "Frisk",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dennis",
               "gender": 0,
               "credit_id": "52fe45abc3a36847f80d3e51",
               "name": "Michael Gunther",
               "profile_path": null,
               "id": 1290416,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe45abc3a36847f80d3e55",
               "name": "Craig Chester",
               "profile_path": "/FqvLDDJo596DbjngCOEMCDPOb7.jpg",
               "id": 82769,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Uhrs",
               "gender": 0,
               "credit_id": "52fe45abc3a36847f80d3e59",
               "name": "Michael Stock",
               "profile_path": null,
               "id": 1190456,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kevin",
               "gender": 0,
               "credit_id": "52fe45abc3a36847f80d3e5d",
               "name": "Raoul O'Connell",
               "profile_path": null,
               "id": 1087439,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Julian",
               "gender": 0,
               "credit_id": "52fe45abc3a36847f80d3e61",
               "name": "Jaie Laplante",
               "profile_path": null,
               "id": 1071626,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ferguson",
               "gender": 1,
               "credit_id": "52fe45abc3a36847f80d3e65",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Punk",
               "gender": 1,
               "credit_id": "52fe45abc3a36847f80d3e69",
               "name": "Alexis Arquette",
               "profile_path": "/jNRBwGKXOZFWLI2ceff1sMUdxcE.jpg",
               "id": 19578,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45abc3a36847f80d3e7b",
               "name": "Jim Dwyer",
               "profile_path": null,
               "id": 230330,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45abc3a36847f80d3e81",
               "name": "George LaVoo",
               "profile_path": null,
               "id": 126707,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "551107f8c3a3683f39006ce4",
               "name": "Todd Verow",
               "profile_path": null,
               "id": 230320,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "551107ff9251415c96000ce6",
               "name": "Todd Verow",
               "profile_path": null,
               "id": 230320,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.565536,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40926,
      "vote_count": 3,
      "budget": 0,
      "overview": "A first person narrative of a gay serial killer explores violence, sexuality, and imagination.",
      "similar": [],
      "original_title": "Frisk",
      "runtime": 88,
      "poster_path": "/q1qI7bxOUMUPxUUALkTjXa1EiCP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-03-22",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Todd Verow"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Dennis Cooper",
         "Jim Dwyer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113122/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMjQzMzMxN15BMl5BanBnXkFtZTcwODc0OTgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Gunther, Craig Chester, Michael Stock | See full cast and crew »"],
      "reviews": [
         "This is a very difficult film to review. First of all, if you are not a gay man then you might as well not bother with this film. Even if you are a gay man, it is still important to note that it is *supposed* to be a revolting and disgusting film. I read the book first, and let me tell you -- it messes with your mind. What disturbs the s**t out of you when seeing the movie is also what is so \"awful\" about the book: if you stop to think about what the central character's thought process is, then you see certain basic pieces of it that actually make some sense. THAT is what stayed with me and actually gave me a nightmare. Unfortunately, this is where the film is lacking. In the book, we get into the head of the central character, and we hear his thoughts. In the film, Dennis's thought process is implied but not stated sufficiently. The result is a muddled film that just gets more and more violent as it goes on. The men in this film are VERY attractive, and this of course makes it all the more disturbing -- everyone wants to see killers be like Charles Manson -- it's scarier when they look like the boy next door, and they get off on disemboweling other boys next door. I would say that the high point of the film is probably Parker Posey. Lordy lordy, that woman... Tales of the City to Scream 3, with a stop in the middle in Frisk. She brought her usual perkiness to a role that is, well, murderous. To sum up: definitely made for a queer male audience. Far too disturbing for the average sensitive gayboy. Hard to follow if you haven't read the book. A few moments of brilliance, but overall it's muddled. Worth seeing if you have nothing else to do and have a strong constitution and a sick mind. Otherwise, don't bother.",
         "Frisk is one of a number of films by new film-makers (such as Todd Solondz, Tom Kalin, John Hewitt) who are for no-one. I love this disturbing new genre. Neither guided by morality nor restricted by the reality/fantasy divide, these films don't seek a wide audience. Instead, these films explore the underground, less explored territories of desire in its darker manifestations. This film isn't simply about sex and power, it concerns being gay in the era of AIDS and the insistency of desire. Frisk plays into the gay=death equation but this is only natural when being gay still remains for some blind people a lifestyle choice if not an aberration. Its a film about killing lovers, put blankly, and about experiencing the forbidden reaches of passion and obsession. Its a cold film and relentlessly reminiscent of De Sade's writing. Transgression and shock rule here but there's no easy comfort zones. A film of lust, decadence, cruelty and annihilation. Be warned.",
         "The flip side to optimistic, hopelessly naive, queer-positive films like \"Beautiful Thing\", in fact this movie could be called \"ugly thing\". This movie shows the dark side of human sexuality in all people, not just gay ones. With a great book as source material, an awesome cast, and a terrific score by Coil (the greatest), this movie has everything going for it, even if those uptight queens at the SF gay and lesbian film festival booed it off the screen. Anyway, this isn't a movie for mainstream audiences, whether they be homophobic heteros or gay yuppies. There is a plot to this movie but it doesn't seem to be that important, taking a back seat to the striking visuals and twisted eroticism on the screen. Snuff films, bondage, violent sexual mutilation, and brother-to-brother incest are just a few of the trangressive delights in this film. Performances of note include Parker Posey who makes an extended cameo as a wild-eyed serial killer and Raoul O'Connell who is notable only because he is hot, hot, hot!",
         "I make it a general rule to dismiss any comment by someone using \"trangressive\" somewhere in the review. Folks I braced myself for a horrible, bloody, unredeeming movie and came away underwhelmed. Frankly, there is no gore and there is less blood in the entire movie than one sees in the first 3 minutes of any slasher film. The only reason to rate this movie low is because it is a B-movie with cheap production values and some wooden acting. Other than that, it managed to keep my interest throughout the entire film. I cannot believe people would boo this film. That is absurd. If the characters were straight, no one would have a problem. But the main characters are gay and all of a sudden, we now have \"social commentary\" instead of just mindless entertainment. Except for some male frontal nudity, this movie could be shown on network TV, although late-night. For those that believe all gay movies should be affirming, this movie is not for you. For those that are looking for yet another gay romantic comedy with lots of eye candy and bad acting, well there is some eye candy and bad acting, but not much romance or humor. It's not the greatest movie, it has flaws, but I didn't come away feeling as if I totally wasted my time watching it. Ignore the prudes. See the movie. Make up your own mind. You will be shocked at how mild this movie is given the strange plot and subject matter.",
         "Being an avid fan of Cooper's novels, I purchased this film hoping that it would capture the truly disturbing yet poetic quality of his books. This film succeeds in being disturbing but falls short of being poetic. Although at times certain scenes or frames of the film border on indie film brilliance, unless you have read the book, it's certainly hard to follow--as it probably was intended to be. Parker Posey is the redeeming quality in this film--a strange quirkiness to a murderous she-devil who shows no remorse and offers no motive. It's a shame she was not introduced until much later in the film. Some other thoughts: The odd underground electronic soundtrack compliments the film well. The foreign porn star is incredibly eerie. The lead is not terribly convincing as a murderer. And...the most disturbing scene is the duct tape and broom scene.",
         "This is another of those art films that goes nowhere but gets there in style. This film is gritty and fascinating in a sick, can't help but look at the car wreck on the highway sort of way. It's not bad enough to turn off so you keep watching hoping that sanity will be restored. It won't be but you watch nonetheless.",
         "Incomprehensible. It's something about a gay guy who may (or may not) be a serial killer. The film jumps all over the place--there are flash backs, flash forwards, dream sequences all mashed together. Supposedly if you read the book you'll understand the movie. Well--I haven't read the book and I don't think I should have to read it to make heads or tails out of the movie. A movie should stand on its own and this one certainly doesn't. It looks grimy (but I heard that was on purpose); the acting is truly abominable (some of the guys are cute but that's about it); the same actors play multiple roles (which is confusing), and the dialogue read during the killings is just so matter of fact I didn't know HOW to take it! And I didn't find it disturbing or confusing--just dull and irritating. The only saving grace is Parker Posey--she manages to take a nothing role and actually make something of it. She has lousy dialogue too but she makes it work. So--aside from Posey and some cute guys there's nothing to recommend this. I give it a 1.",
         "I really don't see how anyone that hasn't read the book could possibly really understand what this film is supposed to be about. The character development was pretty weak, making me constantly wonder *why* the characters were doing what they were doing... and never getting an answer. And the acting really didn't help either. It was just... well, bad. It made the characters look cheap and one dimensional. Dialogue was spoken as if it was the actors' first times going over the script. You know, porn-like. I really don't get why people act like this was such a disturbing movie... I was bored throughout mostly the entire thing. If the characters had been straight, it may very well have been just another late night HBO erotic thriller. If I had to guess, I'd say this film was made solely to shock, not to actually tell a really quite interesting story written by a brilliant author.",
         "Tired of coming out movies? Jeffrey and the Birdcage say nothing about your life? Fall asleep during Celluloid Closet? Then rent Frisk- refreshingly grotesque and lands all the right satirical punches on late 20th century gay culture. A litmus test for the politically correct.",
         "I watched this movie on a bet. I hated every minute of it. Why? 1. Bad acting (except for Parker Posey, who can make a telephone book seem interesting...and should have done so instead of taking this trash on). 2. Insipid script filled with self-important dialog and voice-over that sounded like fake high-school ennui laced with a dash of faux philosophy 101. 3. A-B-C directing. 4. Pseudo-stylish editing flashes that even MTV would find silly. 5. Nothing sets. 6. 1-2-3 style lighting. 7. A loathing of all things homosexual and the fag-hags who adore them. Not one normal person was allowed to counterpoint the non-stop anti-gay depiction of gay men as self-mutilating drug abusers into kinky anything so long as it winds up with them ejaculating at the end. 8. The wimpy non-stop suggestion that it's all in Dennis' mind. Maybe. Except it might not be. Or might be. Maybe. Sort of. Except it isn't. Or is it? And on and on and on, ad nauseum. Edgy? Avant guarde? A whole new genre of in your face \"I don't care about anybody\" sort of movies, with this being a prime piece? Give me a break. At best, this is limp- wiener porn gussied up with occasional flashes of male genitalia and a low-rent idea that self-destruction and serial murder are part of the queer gene. That this homophobic piece of trash was (supposedly) shown at Sundance and the Berlin Film Festival only shows how second rate those venues have become. You want to see a real serial killer movie full of \"I don't care about anybody\" done right? Rent \"Henry, Portrait Of A Serial Killer\" or \"Monster\" or even \"Citizen X\". Anything but this garbage."
      ],
      "genres": ["Drama"],
      "productionCompanies": [],
      "summaries": ["A first person narrative of the exploits of a gay serial killer in deeply disturbing, controversial drama about violence, sexuality, and the imagination. Dennis, the main character, whose lead we follow on this path between what is real and what we can only hope is surreal. His friends attempt to determine if he's truly a psychopath. The story, is told in the form of a succession of ritual-like murders, comes to life through the letters he writes to his sometime lover and best friend Julian and the object of his desire, Julian's younger brother, Kevin. The film is set in an erotic world of sado-masochism and portrays the sexual appetites of a young man for whom killing and engorging the victim become the ultimate thrill."],
      "budget": 0
   },
   "movielensId": 636,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-22",
      "dvdReleaseDate": "2003-09-16",
      "directors": ["Todd Verow"],
      "runtime": 88,
      "movieId": 636,
      "title": "Frisk",
      "mpaa": "",
      "actors": [
         "Michael Gunther",
         "Craig Chester",
         "Michael Stock",
         "Raoul O'Connell",
         "Jaie Laplante",
         "Parker Posey",
         "Alexis Arquette"
      ],
      "imdbMovieId": "0113122",
      "originalTitle": "Frisk",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A first person narrative of a gay serial killer explores violence, sexuality, and imagination.",
      "tmdbMovieId": 40926,
      "avgRating": 2.9375,
      "releaseYear": "1996",
      "numRatings": 40,
      "posterPath": "/q1qI7bxOUMUPxUUALkTjXa1EiCP.jpg"
   }
}