{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gulf war",
            "id": 2952
         },
         {
            "name": "u.s. army",
            "id": 4595
         },
         {
            "name": "based on tv series",
            "id": 10988
         },
         {
            "name": "military spoof",
            "id": 11138
         }
      ],
      "imdb_id": "tt0117608",
      "video": false,
      "title": "Sgt. Bilko",
      "recommendations": [
         11353,
         11520,
         12277,
         17795,
         9101,
         15602,
         10723,
         9409,
         9304,
         9644,
         20759,
         10478,
         23719,
         10141,
         2620,
         12772,
         10694,
         16384,
         11384,
         14342
      ],
      "backdrop_path": "/dbxJcl4FmoIyMVB1oL293kzorow.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Master Sergeant Ernest G. Bilko",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae3e7",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Colonel John T. Hall",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae3eb",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Major Colin Thorn",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae3ef",
               "name": "Phil Hartman",
               "profile_path": "/rf62sAab9vOjm9x7ZA0VBWDkHvD.jpg",
               "id": 14104,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Rita Robbins",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae3f3",
               "name": "Glenne Headly",
               "profile_path": "/a90ZslKOvecuy7doMWXsFc1Aoc4.jpg",
               "id": 21104,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Pfc. Wally Holbrook",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae3f7",
               "name": "Daryl Mitchell",
               "profile_path": "/mSrPd1XH1akZtDXsBXN8m0wvluG.jpg",
               "id": 15028,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "1st Lt. Oster",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae401",
               "name": "Chris Rock",
               "profile_path": "/5JCYKerIL0SdiqygtLUpG9Sw37P.jpg",
               "id": 2632,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Pfc. Mickey Zimmerman",
               "gender": 2,
               "credit_id": "55874eb6c3a3682746006770",
               "name": "Mitchell Whitfield",
               "profile_path": "/xvLWnBsTbUmW9KcDkH7pvi5W6v0.jpg",
               "id": 19505,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Pvt. Duane Doberman",
               "gender": 0,
               "credit_id": "55874eeb92514155b7000165",
               "name": "Eric Edwards",
               "profile_path": "/cQx8WFY1Uzsz22MtLGriftLZ5Cn.jpg",
               "id": 115786,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Maj. Ebersole",
               "gender": 2,
               "credit_id": "5587552fc3a368273500636d",
               "name": "Austin Pendleton",
               "profile_path": "/pxcdhd4oAsnhvUg0BalmiiKJyXg.jpg",
               "id": 6168,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Mrs. Hall",
               "gender": 1,
               "credit_id": "558761709251416b000012f4",
               "name": "Debra Jo Rupp",
               "profile_path": "/awbfUc1ABlAunl06r8CY7RwQCW6.jpg",
               "id": 15453,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Spc. Dino Paparelli",
               "gender": 2,
               "credit_id": "55876350c3a368273b00660d",
               "name": "Max Casella",
               "profile_path": "/5CNTDSCBhWPclTLTyTBy8oHUkzb.jpg",
               "id": 7133,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Gen. Tennyson",
               "gender": 2,
               "credit_id": "5587660392514179f6002ed8",
               "name": "Richard Herd",
               "profile_path": "/1wsn9V7kkrvD2Qr3bD1vSH2OjpK.jpg",
               "id": 13732,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Spc. Tony Morales",
               "gender": 2,
               "credit_id": "56b23e1a92514103420003d7",
               "name": "Dan Ferro",
               "profile_path": "/fsoBer43z0W0GNk3KPSvjtfIWQr.jpg",
               "id": 34841,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Pfc. Sam Fender",
               "gender": 2,
               "credit_id": "579127079251416ba10011eb",
               "name": "Brian Leckner",
               "profile_path": "/beXhkO2heP1HycpM0D8SE3BenBn.jpg",
               "id": 154838,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae3cb",
               "name": "Andy Breckman",
               "profile_path": null,
               "id": 55373,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae3d1",
               "name": "Brian Grazer",
               "profile_path": "/yqiKX3auDuorea0BOtuB6Ifhyp6.jpg",
               "id": 339,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae3d7",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae3dd",
               "name": "Peter Sova",
               "profile_path": null,
               "id": 11958,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae3e3",
               "name": "Tony Lombardo",
               "profile_path": null,
               "id": 56972,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae3fd",
               "name": "Jonathan Lynn",
               "profile_path": "/nvMGnGbGdXrRvGAjulNqhJWUB9c.jpg",
               "id": 21217,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.98329,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9099,
      "vote_count": 117,
      "budget": 0,
      "overview": "The army is known for churning out lean mean fighting machines intent on protecting our great nation. Martin is the inexplicable the incorrigible the invicible sgt. Ernie bilko leader of a ragtag group of the sorriest soldiers ever to enlist in the armed forces.",
      "similar": [
         10890,
         8741,
         16442,
         6415,
         12162,
         1369,
         600,
         929,
         10684,
         9331,
         586,
         10304,
         9567,
         43407,
         1654,
         2275,
         11411,
         14462,
         651,
         11589
      ],
      "original_title": "Sgt. Bilko",
      "runtime": 90,
      "poster_path": "/lP9i3lzCwz8mu8ynuzJJBu4Sa9u.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4PR5ZyqlDrMqx1h5PyOL4VRL70z.png",
            "name": "Imagine Entertainment",
            "id": 23,
            "origin_country": "US"
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-03-29",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "All he ever wanted was an honest week's pay for an honest day's work.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jonathan Lynn"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Nat Hiken",
         "Andy Breckman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117608/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzMjMxOTA1OF5BMl5BanBnXkFtZTcwNTk5MzAzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Martin, Dan Aykroyd, Phil Hartman | See full cast and crew »"],
      "reviews": [
         "This is actually a very funny movie, one of Steve's funniest movies - up there with Father of the Bride. All the characters, Dan Akroyd, Phil Hartman, even an appearance by Chris Rock make this an extremely enjoyable movie. The Hover Tank was hands down the funniest part. Steve is full of laughs in this movie and acts out the character of Sergeant Bilko superbly. I have watched this movie at least four times and I was still laughing all the way through. This is in fact one of my all time favourite comedies. I have never seen the original and perhaps my judgement of this movie is therefore altered. Yet if you have never seen or even heard of the original and you like Steve's work then you will surely like this. Don't look at the votes rating I'll give this 8/10.",
         "This movie was under-appreciated in its theatrical release. In fact, it's a rarity these days.....a lightweight comedy that doesn't insult your intelligence. Some critics carped because it wasn't like the classic TV show, but it would have been hard (and foolish) to try and duplicate the genius of Phil Silvers. Steve Martin does a fine job of putting his own unique stamp on the character of Ernie Bilko and he's surrounded by a good supporting cast with many familiar faces. The story isn't the most intricately plotted in the world, but it doesn't have to be. The gags and one-liners come fast and furious and there are plenty of laughs. A pleasant comedy that's good for all ages.",
         "I also cant believe the movie is so poorly rated. Whats wrong? So many toilette-humour-pictures got much better rating. And this movie which is really full of fine humour is rated so bad. Steve Martin is awesome here as well as all other actors. The movie IS funny, the situations are funny, the plot deserves to be rewarded. It's one of my all time favorites - i do laugh every time i watch it. Bilko is an incredibly charming foxy Sgt. For me it's one of Steve Martin's best roles. I cant but smile seeing his every face expression, gesture or action. Just super! And all the actors were at their best. Just on their places. I rate it \"excellent\"",
         "Seems to me like most of the negative votes come from fans of the original show. I am glad I never saw it, because I think this is one of the funniest movies I have ever seen. I love Bilko's character. Martin plays a charismatic, scheming yet kind hearted con artist. I love his comic timing in this movie. It's definitely my favorite Steve Martin role. I think part of the reason I like Martin, is for the same reason I like characters like Bugs Bunny. He always comes out on top, and is usually in complete control of a situation. I love that type of role - who does not want to be more like a Sgt Bilko? I thought almost every scene was funny. I liked pretty much every actor in it. It's not for serious people. I sometimes wonder why serious people bother to rate comedies at all - some people were born with no sense of humor, from what I can tell. For those people who dislike (or are bored of) put down humor, sex humor, or gross out humor, this is none of those (Not that I don't mind some of that, but a change of pace is always welcome.) It's a politer, lighter, silly humor almost cartoonish, in a good way. I have seen this movie at least three times, and still laugh at it. So if you are not a fan of the TV show, I think you will like this in spite of the shockingly low review of this movie.",
         "I thought that this movie was very funny, though somewhat on the pointless side. Good choice of actors, and the music was fairly good, and i'm not sure why i didn't hear about it until last year. The acting was exceptional, and the plot also exceptional, and i say that overall i think that it was a good movie, worthy of being watched more then once.",
         "Sgt Bilko delivers countless laughs, mostly from Steve Martin, Dan Akroyd and Phil Hartman. The rest of the cast are a joke. There are so many gags, slapstick, and one-liners you have to enjoy it. There is no strong story line which is unfortunate, but Bilko gets away with it. The constant parody of the united states army is much more relaxed than the Korean setting of MASH. Do not watch this film with any predispositions or expectations of what you are going to see, and you will enjoy it so much more. I recommend it to anyone who just wants a quick two hour getaway from reality, and a chance to let yourself go and have some fun.",
         "As a movie based on a popular TV series, this movie is nothing like the series. Phil Silvers played Bilko as a master con artist; the one man who could con a con. Martin plays Bilko as an underhanded brown nose who has some deceitful ideas, a good bead on making an extra buck, and an even edge on the con game. I thoroughly enjoy this rendition of an old favorite. I loved this movie because Martin did not come along and attempt to imitate Silvers' style. He played it straight from the vest, as himself. If you aren't a Martin fan, but instead, a fan of the TV series, you probably won't find the humor in this endeavor. But if you are a Martin fan, sit back and enjoy. I loved this movie, even though I loved the original series, but I'm a huge fan of Martin's work since his earlier days in stand-up. \"It is my understanding you can no longer ask me these questions, sir.\" Chris Rock, Dan Aykroyd, Phil Hartman, and Glenne Headley also star. This production was quality work by all involved, and a fun way to spend 90 minutes. I was thoroughly entertained. It rates an 8.2/10.0 from... the Fiend :.",
         "Finally, a movie that really has \"comedy\" stamped all over it! SGT. BILKO is one of the better comedy films I've seen, thanks to veteran Steve Martin who provided every bit of sense in his humor and personality. A tank that flies above ground level! How innovative! Although the same substances are present like other modern-day comedies, it embraces a more likeable feeling. That means you won't have to put up with disgrace over excessive flatulence discovered in thousands of other movies in the genre. Only on occasion does this matter exist, and we all know Hollywood can't help it these days. But it's better than some, right?",
         "Yeah, I'm old enough to remember the TV show, and the Bilko character that endeared itself to TV fans, shines through one of the best comedians of this generation. Nicely done, Steve! The plot? I read some comments criticizing the plot! Huh? This is COMEDY....it's meant to be fun, and in this case, to reminisce a bit. That's all this movie set out to do, and it accomplished it. 10 !",
         "I missed this when it came out, and just caught it after one of those free weekends for premium channels. As a long-time fan of Phil Silvers' fabulous series of the 1950s, I was skeptical about this movie, although I usually like Steve Martin's films--especially Planes, Trains, and Automobiles. I thought it was quite true to the spirit of the TV show. I was pleased that it was PG and not full of foul language and other things not fit for children. They didn't try to duplicate everything in the original, merely to present a similar group of characters, with the same names. The plot was not unlike one in the series, but was not a remake of any episode from the series. They had some lines that sounded like they could have come from the series. They had a way to signal \"brass coming\" so Bilko's men could quickly put away all their gambling devices and make the motor pool look like one--just as the series did, only more elaborate. Col. Hall in the film, just like on TV, acknowledged that Bilko knew more about what was going on, and, in effect, ran the post. Other reviewers have detailed the plot. One highlight for me was the clever way Bilko arranged for his adversary to give himself away after ruining the test of the hover tank, not knowing the machine was not going to work in the first place. That was thinking like the Phil Silvers' version would have done. I agree that Silvers, and Nat Hiken, would be proud that their series was re-created as a feature film 40 years later. It wasn't the funniest movie ever, but it was surely no worse than a \"very funny\" film."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Imagine Entertainment",
         "Universal Pictures"
      ],
      "summaries": [
         "This movie is a remake of the hit series which starred, Phil Silvers as Sgt. Bilko. In this movie, Bilko runs the motor pool and has all sorts of scams going on like gambling, renting out military vehicles, and so on, which are all violations. However, his commanding officer, Colonel Hall overlooks them, cause he is more concerned about his future, cause a lot of bases are being closed, and the inspector, Major Thorn was on the verge of doing that. But when he heard that Bilko was on the base, he turned into a mad dog. It seems that Thorn was a \"thorn\" in Bilko's side many years ago but through a series of misunderstandings, Thorn was accused of carrying out or being the brains behind one of Bilko's schemes, he would be sent to Greenland and his career has not gone as he hoped it would and now wants revenge on Bilko.",
         "Sgt. Bilko is in charge of the Motor Pool at an Army base. He's also a good-natured con man, providing gambling facilities for the soldiers on base. When an old enemy from his past shows up to inspect his records and steal away his fianceé, Sgt. Bilko has to put his skills to creative use..."
      ],
      "budget": 39000000
   },
   "movielensId": 637,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-29",
      "dvdReleaseDate": "1998-06-30",
      "directors": ["Jonathan Lynn"],
      "runtime": 90,
      "movieId": 637,
      "title": "Sgt. Bilko",
      "mpaa": "PG",
      "actors": [
         "Steve Martin",
         "Dan Aykroyd",
         "Phil Hartman",
         "Glenne Headly",
         "Daryl Mitchell",
         "Chris Rock",
         "Mitchell Whitfield",
         "Eric Edwards",
         "Austin Pendleton",
         "Debra Jo Rupp",
         "Max Casella",
         "Richard Herd",
         "Dan Ferro",
         "Brian Leckner"
      ],
      "imdbMovieId": "0117608",
      "originalTitle": "Sgt. Bilko",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["lnymWvGgVUw"],
      "plotSummary": "The army is known for churning out lean mean fighting machines intent on protecting our great nation. Martin is the inexplicable the incorrigible the invicible sgt. Ernie bilko leader of a ragtag group of the sorriest soldiers ever to enlist in the armed forces.",
      "tmdbMovieId": 9099,
      "avgRating": 2.84734,
      "releaseYear": "1996",
      "numRatings": 6937,
      "posterPath": "/lP9i3lzCwz8mu8ynuzJJBu4Sa9u.jpg"
   }
}