{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "painting",
            "id": 5918
         },
         {
            "name": "thief",
            "id": 9727
         },
         {
            "name": "seasickness",
            "id": 167868
         }
      ],
      "imdb_id": "tt0118002",
      "video": false,
      "title": "Two If by Sea",
      "recommendations": [
         40480,
         80346,
         77530,
         68773,
         33657,
         25269,
         48609,
         70180,
         66599,
         8744,
         12628,
         20759,
         45390,
         102947,
         36278,
         22318,
         15170,
         18658,
         56087,
         39128
      ],
      "backdrop_path": "/fbQFAziY814Xhk0KPVfy9VL4396.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Roz",
               "gender": 1,
               "credit_id": "52fe47ef9251416c750aa5a7",
               "name": "Sandra Bullock",
               "profile_path": "/1Im0NV6nVaKyXMpYjGOfWaj5khS.jpg",
               "id": 18277,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Francis 'Frank' O'Brien",
               "gender": 2,
               "credit_id": "52fe47ef9251416c750aa5ab",
               "name": "Denis Leary",
               "profile_path": "/lnk4HjUeqDlT6Kg9PaQsVIDpl56.jpg",
               "id": 5724,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "FBI Agent O'Malley",
               "gender": 0,
               "credit_id": "52fe47ef9251416c750aa5b5",
               "name": "Yaphet Kotto",
               "profile_path": "/qsaWzjzI41EXMldEn6sSp5fnsQ0.jpg",
               "id": 5050,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Evan Marsh",
               "gender": 2,
               "credit_id": "52fe47ef9251416c750aa5b9",
               "name": "Stephen Dillane",
               "profile_path": "/x86B8ZaOKrYJM0pUYtzKTlEn7SS.jpg",
               "id": 8435,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Cop",
               "gender": 1,
               "credit_id": "56d646f7c3a36870ac005139",
               "name": "Tracey Cherelle Jones",
               "profile_path": "/2e28ZU2nQEaxOu1js0DUiAhkS3u.jpg",
               "id": 66131,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Beautiful Woman",
               "gender": 1,
               "credit_id": "56d64723c3a3681e4a017e55",
               "name": "Julia Montgomery Brown",
               "profile_path": "/8Oe5fqtyQTRVqSHwW3EoDBWt90w.jpg",
               "id": 191140,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Reporter",
               "gender": 0,
               "credit_id": "56d6475fc3a3681e4401ab7d",
               "name": "Claire Rankin",
               "profile_path": "/bZsI5OKqp3mBNewMRgWQ0kc173H.jpg",
               "id": 1183958,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Marcy Kellerher",
               "gender": 1,
               "credit_id": "56d64772c3a3681e4401ab83",
               "name": "Jane Moffat",
               "profile_path": "/x8hRTny8olUJYGyH7K3zDUUHIqk.jpg",
               "id": 1362948,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Fitzie",
               "gender": 2,
               "credit_id": "56d64791c3a3681e4401ab8b",
               "name": "Mike Starr",
               "profile_path": "/9JrAo8iPqaLk4SrxMNq1sKHeKaK.jpg",
               "id": 5170,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Todd",
               "gender": 2,
               "credit_id": "56d647a79251413402014e4c",
               "name": "Jonathan Tucker",
               "profile_path": "/jvJpYDbwmUTACw7Yn7PKOP6CdlJ.jpg",
               "id": 17243,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Beano Callahan",
               "gender": 2,
               "credit_id": "56d647bd92514162b7000b95",
               "name": "Wayne Robson",
               "profile_path": "/x1nuwmSBx49UXYxrVYyr8sZi12t.jpg",
               "id": 5897,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Quinn",
               "gender": 2,
               "credit_id": "56d6482b9251413402014e62",
               "name": "Michael Badalucco",
               "profile_path": "/oK2pSu2FWyrwiPEch7Tux2GSMbK.jpg",
               "id": 1010,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47ef9251416c750aa5b1",
               "name": "Bill Bennett",
               "profile_path": null,
               "id": 49361,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47ef9251416c750aa5bf",
               "name": "Denis Leary",
               "profile_path": "/lnk4HjUeqDlT6Kg9PaQsVIDpl56.jpg",
               "id": 5724,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47ef9251416c750aa5c5",
               "name": "Mike Armstrong",
               "profile_path": null,
               "id": 87137,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5ab418940e0a265f360122e2",
               "name": "Tom Cooper",
               "profile_path": null,
               "id": 1085871,
               "department": "Crew",
               "job": "Carpenter"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.997732,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19760,
      "vote_count": 23,
      "budget": 0,
      "overview": "Frank O'Brien, a petty thief, and his 7-year-long girlfriend Roz want to put an end to their unsteady lifestyle and just do that last job, which involves stealing a valuable painting. Frank takes Roz to an island on the coast of New England, where he wants to sell the painting and also hopes that their sagging relationship will get a positive push back up. Not everything goes as planned.",
      "similar": [
         27902,
         810,
         1844,
         35056,
         9292,
         426,
         12159,
         5236,
         152742,
         1281,
         597,
         120467,
         345915,
         399174,
         526,
         210860,
         3176,
         11324,
         85,
         87
      ],
      "original_title": "Two If by Sea",
      "runtime": 96,
      "poster_path": "/e0iwJJiLjk8Z6A9TuL3neX504H3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-01-12",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "A new comedy about love, laughter, and larceny",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill Bennett"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Denis Leary",
         "Mike Armstrong"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118002/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MDcxNjY5MV5BMl5BanBnXkFtZTYwNDMxMTk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sandra Bullock, Denis Leary, Stephen Dillane | See full cast and crew »"],
      "reviews": [
         "The story is nothing new, the acting ain't that great, but \"Two if by Sea\" has its moments. It's an entertaining little movie, and Sandra Bullock's mixture of charm, sarcasm, and innocence play out well. The movie knows it's not too sophisticated or shrewd (even the cop says of his own investigation, \"this is too easy\") and it's a great film to watch on an afternoon or just to be entertained. If you're a Sandra fan, you'll like it no matter what. :)",
         "I am a big fan of Denis Leary, and I thought this was a damn funny movie. The plot is cut-and-dry (the little plot that exists), but it works out nicely as a comedy, mostly due to Leary's funny dialogue and humorous arguments between him and Bullock. I think Bullock was miscast, though. She did an OK job, but her accent drifted many times. If you like Leary, you'll probably have a great time. I especially loved the scene where Leary was going fishing and he shoots one of the fish. Then he cooks it up, serves it up to Bullock and she spits out a bullet. That was classic. But for non-Leary fans...you might not enjoy it as much. I don't consider him an acquired taste, but his foul-mouthed banter doesn't appeal to everyone.",
         "Roz [Sandra Bullock] Has hooked up with Frank [Dennis Leary, a small time crook who is always looking for that big job to retire on] who is fed up with him not treating her as a lady, she reluctantly ends up in this little coastal town to do a deal with the stolen painting on their last job, where they try to fit in among the residents living there, when Roz finds how the other half live and likes it, she also finds a love. A very funny romantic comedy, look out for the scene Sandra's getting changed, and on the bed with Dennis.",
         "This movie is best explained by the staff at IMdb.I thought it was funnier than s**t.The plot wasn't really important for this movie to be worth watching.I haven't seen Leary ever play a bad role or stand up & I guess one would have to understand his humor,and if you do you will enjoy \"Two if by Sea\".If you don't like a movie,one can criticize,without such an outrage of anger.Come on!It's just the movies on a friendly database.Lighten up Mr. Wright.",
         "A blonde Sandra B. and her beau of longstanding, played by the equally blond Dennis Leary, romp their way through a romantic comedy having to do with a bunch of small-time crooks and a very valuable stolen painting. Shot in scenic Nova Scotia, the backgrounds are absolutely gorgeous, and Bullock and Leary have great rapport that makes their rocky relationship very believable. FBI agent Yaphet Koto is along for the ride in a role similar to the one he essayed in MIDNIGHT RUN. Leary co-wrote this, In a manner reminiscent of Donald Westlake -- which is a very good thing, if you know who Westlake is. If not, look him up. Leary is consistently Leary (maybe he was born a fully developed adult), while Bullock in 1996 is growing into the superstar that we know today. She's playing a role that might have been Julia Roberts' a few years before, as she did in several other pictures prior to SPEED and MISS CONGENIALITY, which she made her own.",
         "Two if by sea never received the great reviews it really deserved. Maybe its because i´m a big fan of Sandra Bullock and an even bigger fan of Denis Leary this movie is so good to me, but a lot of my friends really like it too. Its a lovely story which in the end really comes down to one thing, Love!. I have seen this movie 10 times and it never gets me bored. its full of funny lines and romantic/sad scenes. Denis Leary proves that besides being a great stand up comedian he is also one great actor. Two if by sea is not the best movie ever made but it sure is one of them. Go rent it, be open minded about it, and the honest acting really gets to you.",
         "Maybe there's a reason people who live in provinces are called provincial. Perhaps they expect a \"Citizen Kane\" or a \"Godfather\" every time they step into a theater. Great movies are few and far between, and about the best you can usually hope for is a coherent tale told in an entertaining way. And that \"Two If By Sea\" certainly is. I give it 9 out of 10 for its hilarity, subtle performances, niceness, great scenery, and overall execution. It's a warm movie filled with lots of really zingy little funnies. It never strays far from its agreeable theme of true love, and when it does it takes delightful tangents into: pure slapstick goofiness, devastatingly piercing pricking of the neuveau riche, adolescence, and even the plight of the city dweller who thinks he's \"out in the country\" (as when a terrified Leary draws a .38 on a tame deer). You have to admire a director who can take as many potshots at life as \"Airplane!\" does, and still stay within the context of a story as cohesive as this one is. Actually this is one of Denis Leary's finest hours. He portrays a guy who gets along in life by being tough and irascible, although at heart he's hard pressed to cope with the world in general and completely confused by love. Sure his character comes across as grating -- it's supposed to. But if you can't see past the facade to the nice guy underneath, you're not much of a moviegoer. To his excellent work the director adds Sandra Bullock's character, who is just enough not satisfied with a simple, linear life to throw Leary into one tailspin after another. Their chemistry is often prickly, but always centered around the movie's core theme. And it takes real talent to portray her part with the touch of frustration she has, without coming across as a bitch. Bullock impressed me by achieving just the right tone. And in the end, what more could you want? The good guys all find ways to win and the bad guy loses his claim to fame and goes down in flame, blame and shame. Whoooeee!",
         "TWO IF BY SEA, in my opinion, is a charming romantic comedy about two lovers on the lam that'll make you laugh and smile from start to finish. If you ask me, Frank (Denis Leary) and Roz (Sandra Bullock) made an absolutely cute couple. I just don't understand why Frank felt he had to pull off that one last job before making amends with Roz. However, when she impersonated Homer Simpson, I laughed really hard. Someday, I'd like to go to somewhere in New England for a vacation. Before I wrap this up, I'd like to say that the production design was nice, the costumes were perfectly designed, and the performances were great. Now, in conclusion, I highly recommend this romantic comedy about two lovers on the lam that'll make you laugh and smile from start to finish to any Denis Leary or Sandra Bullock fan who hasn't seen it.",
         "I avoided watching this for quite a while because I had heard it wasn't too good. But actually, I enjoyed it...enough that I have watched it twice now. I have a question the the data base cannot answer for me, though. The actor who plays the lacky to FBI agent O'Malley...he's not listed, but he has to be Dave Coulier from Full House. If anyone knows could they email me, please. Thanks",
         "It hit me while watching this that the movie would have been better if Sandra Bullock and Dennis Leary were not criminals. I know, strange, as that is the whole basis for plot, but the two of them were such fun when they were bantering that I thought the plot just got in the way. If it would have been about the two of them sneaking up to Martha's Vineyard to rekindle their romance, this would have been a truly great film."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": ["Frank O'Brien, a petty thief, and his 7-year-long girlfriend Roz want to put an end to their unsteady lifestyle and just do that _last_ job, which involves stealing a valuable painting. Frank takes Roz to an island on the coast of New England, where he wants to sell the painting and also hopes that their sagging relationship will get a positive push back up. Not everything goes as planned, as some thugs and the FBI try to recover the painting and Roz gets attracted not only to the landscape..."],
      "budget": 0
   },
   "movielensId": 64,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-12",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["Bill Bennett"],
      "runtime": 96,
      "movieId": 64,
      "title": "Two If by Sea",
      "mpaa": "R",
      "actors": [
         "Sandra Bullock",
         "Denis Leary",
         "Yaphet Kotto",
         "Stephen Dillane",
         "Tracey Cherelle Jones",
         "Julia Montgomery Brown",
         "Claire Rankin",
         "Jane Moffat",
         "Mike Starr",
         "Jonathan Tucker",
         "Wayne Robson",
         "Michael Badalucco"
      ],
      "imdbMovieId": "0118002",
      "originalTitle": "Two If by Sea",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["Psql1jhaIiA"],
      "plotSummary": "Frank O'Brien, a petty thief, and his 7-year-long girlfriend Roz want to put an end to their unsteady lifestyle and just do that last job, which involves stealing a valuable painting. Frank takes Roz to an island on the coast of New England, where he wants to sell the painting and also hopes that their sagging relationship will get a positive push back up. Not everything goes as planned.",
      "tmdbMovieId": 19760,
      "avgRating": 2.83767,
      "releaseYear": "1996",
      "numRatings": 2190,
      "posterPath": "/e0iwJJiLjk8Z6A9TuL3neX504H3.jpg"
   }
}