{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "violent husband",
            "id": 2320
         },
         {
            "name": "planned murder",
            "id": 3152
         },
         {
            "name": "romantic rivalry",
            "id": 4516
         },
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "missing body",
            "id": 207390
         }
      ],
      "imdb_id": "tt0116095",
      "video": false,
      "title": "Diabolique",
      "recommendations": [
         37718,
         867,
         2149,
         1049,
         10395,
         2246,
         46063,
         46717,
         28902,
         9095,
         48781,
         10383,
         178,
         9409,
         8984,
         9586,
         2625,
         2087,
         10685,
         29143
      ],
      "backdrop_path": "/xe3l0BfhHFk4tIB7DpxLwFbFV9b.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nicole Horner",
               "gender": 1,
               "credit_id": "52fe43dd9251416c75021263",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mia Baran",
               "gender": 1,
               "credit_id": "52fe43dd9251416c75021267",
               "name": "Isabelle Adjani",
               "profile_path": "/oeFrxb7LxYaeLLmI3Zydfi1ewWn.jpg",
               "id": 6553,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Guy Baran",
               "gender": 2,
               "credit_id": "52fe43dd9251416c7502126b",
               "name": "Chazz Palminteri",
               "profile_path": "/d9VkmkEO50zP0kww6aLLFpu5Ovh.jpg",
               "id": 9046,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Det. Shirley Vogel",
               "gender": 1,
               "credit_id": "52fe43dd9251416c7502126f",
               "name": "Kathy Bates",
               "profile_path": "/pwHCkfIBeDdz93RlcmDWqXefozi.jpg",
               "id": 8534,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Simon Veatch",
               "gender": 2,
               "credit_id": "52fe43dd9251416c75021291",
               "name": "Spalding Gray",
               "profile_path": "/xXUGK1bQRi6vBT8Xu0NsShIEKRe.jpg",
               "id": 8978,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Edie Danziger",
               "gender": 1,
               "credit_id": "52fe43dd9251416c75021295",
               "name": "Shirley Knight",
               "profile_path": "/ehtTPcvqq91Dxl7mtlzi0xJI6KP.jpg",
               "id": 28778,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Leo Katzman",
               "gender": 2,
               "credit_id": "52fe43dd9251416c75021299",
               "name": "Allen Garfield",
               "profile_path": "/ayvlc1cfZXF4j9ik4QUmKHJ5mC6.jpg",
               "id": 922,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Erik Pretzer",
               "gender": 0,
               "credit_id": "52fe43dd9251416c7502129d",
               "name": "Adam Hann-Byrd",
               "profile_path": "/hEoqDqtMO91hYWD5iDrDesnLDlt.jpg",
               "id": 46530,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Video Photographer #1",
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212a1",
               "name": "Donal Logue",
               "profile_path": "/h0JZ8Hyc9p6sY2jQeJkDcax6UY3.jpg",
               "id": 10825,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Ms. Vawze",
               "gender": 1,
               "credit_id": "52fe43dd9251416c750212a5",
               "name": "Diana Bellamy",
               "profile_path": "/3Kh5XkSp2dPB5YdVbYWmLVOA2PF.jpg",
               "id": 157986,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Video Photographer #2",
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212ad",
               "name": "J.J. Abrams",
               "profile_path": "/uiEVOx3QclxnN76t8PU6v5IcUUP.jpg",
               "id": 15344,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Irv Danziger",
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212b1",
               "name": "O'Neal Compton",
               "profile_path": null,
               "id": 20165,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Gannon",
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212b5",
               "name": "Bingo O'Malley",
               "profile_path": "/2eE39LkBD08ky1DaHh0EjpY3j0F.jpg",
               "id": 104046,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "PHP Officer",
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212b9",
               "name": "Stephen Liska",
               "profile_path": "/aMpEuoFVA5xd3Pbqs97SkFpJjhe.jpg",
               "id": 58559,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Lisa Campos",
               "gender": 1,
               "credit_id": "57bc9b79c3a3682eac00b2b3",
               "name": "Clea Lewis",
               "profile_path": "/xg0epjCQSeEv6DviXfnYSryPCWn.jpg",
               "id": 1215072,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c75021275",
               "name": "Jeremiah S. Chechik",
               "profile_path": "/avEcJTGsWFEzxpSOutwhkP3adQ8.jpg",
               "id": 34682,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dd9251416c7502127b",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c75021281",
               "name": "James G. Robinson",
               "profile_path": null,
               "id": 4700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dd9251416c75021287",
               "name": "Carol Littleton",
               "profile_path": "/wsQP1noRhkMRujRJ3uVntLXSFLf.jpg",
               "id": 9966,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c7502128d",
               "name": "Peter James",
               "profile_path": null,
               "id": 5708,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212bf",
               "name": "Pierre Boileau",
               "profile_path": "/rQ7QQlqVRCfCTRZbDzM5r9tlS4p.jpg",
               "id": 5733,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212c5",
               "name": "Thomas Narcejac",
               "profile_path": "/aONgsd4HsW4lT7IUs0wukpz9Wa5.jpg",
               "id": 5734,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212cb",
               "name": "Henri-Georges Clouzot",
               "profile_path": "/nhwGnyQSoC3HhCM6SSACdZnysAK.jpg",
               "id": 2559,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c750212d1",
               "name": "Don Roos",
               "profile_path": "/xPnPpnylece1hzz2uUPbvbEHXZV.jpg",
               "id": 57579,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.825537,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10988,
      "vote_count": 99,
      "budget": 0,
      "overview": "The wife and mistress of a cruel school master collaborate in a carefully planned and executed attempt to murder him. The plan goes well until the body, which has been strategically dumped, disappears. The strain starts to tell on the two women as a retired police investigator who is looking into the disappearance on a whim begins to think that they know more than they are telling, and their mental state is not helped when their victim is seen, apparently alive and well by one of the pupils.",
      "similar": [
         884,
         843,
         36630,
         21484,
         247,
         28468,
         10998,
         1957,
         11368,
         27066,
         283227,
         244772,
         2539,
         638,
         37265,
         1965,
         993,
         688,
         1494,
         24016
      ],
      "original_title": "Diabolique",
      "runtime": 107,
      "poster_path": "/woBHA1Obn53zziO6h0N9340SGMv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Marvin Worth Productions",
            "id": 976,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "ABC Productions",
            "id": 3668,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-03-22",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Two women. One man. The combination can be murder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeremiah S. Chechik"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Pierre Boileau",
         "Thomas Narcejac"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTg1Mjk0OTYxNF5BMl5BanBnXkFtZTcwNTg3ODIyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Sharon Stone, Isabelle Adjani, Chazz Palminteri | See full cast and crew »"],
      "reviews": [
         "To venture a remake of Clouzot's \"Les Diaboliques\" (1955) -- a film that needed no remake in the first place -- only one thing was crucial: a very creative filmmaker with a very personal style, so as to put away comparisons with the classic French film. Someone like Kubrick, Von Trier, Amenábar, Chabrol, Jeunet... Instead we have Chechik's ludicrous, inept direction, making the experienced crew's efforts simply bomb: the cinematography is flat, the music is predictable, the script is stale, the pace is sloooow, and he manages to withdraw bad performances from EVERYONE in the cast, including the usually reliable Kathy Bates, besides achieving the incredible feat of making Isabelle Adjani look like she's just escaped from Madame Tussaud's, and cruelly exposing the unmistakably limited talents of Sharon Stone (who manages to look like a dominatrix in the role of a Catholic school teacher!!) and Chazz Palminteri. When a film is THIS bad, considering the names involved and the amount of money spent, it's really an insult to everyone, most of all to the audience (of course). After this bomb, you'd think Hollywood directors would just leave classic thrillers alone -- but Gus Van Sant went on to commit the catastrophic remake of \"Psycho\".... Don't waste your time - just don't watch it, especially if you are a fan of the original film or of the stars!!! My vote: since IMDb doesn't allow zeroes, 1/10 is more than it deserves.",
         "Oscar Wilde was one of the great wits of his age, but he was allegedly not averse to appropriating other people's bons mots. It is said that after his friend and rival James Whistler had made a particularly apposite remark, Wilde sighed and said \"I wish I had said that!\". Whistler's reply was \"You will, Oscar, you will\". The American film industry has a similar attitude to other people's films to the one that Wilde had to other people's conversation. When the European- particularly the British or French- film industry comes up with a particularly admired film, Hollywood gives a collective sigh and says \"We wish we had made that!\" You will, Hollywood, you will! Recent years have seen a glut of remakes of European films, but, admittedly, the results of this creative plagiarism are by no means always bad. The plot of \"Sommersby\" may have been blatantly lifted from \"Le Retour de Martin Guerre\", but it is still a good film in its own right. Moreover, I was one of those who thought that Luc Besson's \"Nikita\" did not lose much in translation when it was remade as the Bridget Fonda vehicle \"The Assassin\". Sometimes, however, Hollywood manages to come up with a remake that is so inferior to its original model that the two films do not deserve to be mentioned in the same breath. \"Diabolique\" is a case in point. Henri-Georges Clouzot's \"Les Diaboliques\" was one of the classic thrillers of the fifties, as good as the best of Hitchcock's work. Jeremiah Chechik's remake borrows the same basic plot of the original, but transfers it from 1950s France to 1990s America. At the centre is the sadistic headmaster of a private school, a man who brutally mistreats not only the boys in his care but also his wife and even his beautiful mistress. The wife and mistress,tired of his mistreatment, plot together to murder him and to dispose of his body in the filthy school swimming pool, but when the pool is later drained the body has disappeared. As in the original, there is a sudden, surprise twist at the end. Chechik also, however,introduces elements that were not in Clouzot's film. The wife, Mia, here becomes a former nun, who has renounced her vows after losing her faith, but is still haunted by guilt. There is a suggestion of a lesbian relationship between Mia and the mistress, Nicole. Chechik also introduces a major character, in the form of a female detective, with no equivalent in the original film. \"Diabolique\" has come in for some sharp criticism, largely because it is a remake of a classic. It is a mediocre film rather than a horrendously bad one, and if we did not have its famous predecessor to compare it with, it would doubtless be seen as just another banal and unsuccessful crime thriller. Nevertheless, I think that the criticism it has attracted is justified. Chechik must have known that one of the perils of remaking a film is that your work will be weighed in the balance against the original, and woe betide you if it is found wanting. And, compared with Clouzot's, Chechik's film is wanting indeed. He lacks the French director's sense of pacing and ability to convey suspense, with the result that his film is slow-moving where the original was brisk and flabby where the original was taut. I was also disappointed by the acting. Isabelle Adjani can be a fine actress in her own language, as she showed in \"La Reine Margot\", but I have not been impressed with her in English-language films, and here her character never came to life. Sharon Stone was slightly better as the hard-bitten, sluttish Nicole, but this was not really one of her better performances and did nothing to alter my view that she has not always chosen the best vehicles in which to show off her talents. Chazz Palminteri's headmaster was almost too unpleasant to be believable, and Kathy Bates seemed wasted as the detective. Watching Clouzot's film I was glued to the screen with anticipation as I wondered how the film would end; watching Chechik's, my attention was rather glued to my watch as I wondered when it would end. 4/10",
         "Poor Isabelle Adjani. She is one of the most beautiful women in the world and one of the finest actresses alive.(See \"The Story of Adele H\" for proof of both of these claims.) Yet somehow her agent (or whoever is responsible for these horrible decisions) keeps casting her in the worst American films he can possibly find. Did somebody say \"Ishtar?\" The American version of \"Diabolique\" is a perfect example of how Hollywood can ruin a classic film. The original 1955 French film is a subtle, fun, nail-biting mystery that builds to a wonderful ending. In this silly remake, director Jeremiah Chechik takes out the fun and subtlety, throws in some nudity, then \"builds\" to that same, tired \"bad guy trying to kill the good guy\" ending we have seen a million times before. Please! If and when Isabelle Adjani is cast in a decent American movie, she will become the biggest star in the world. Until then, our loss is France's gain.",
         "This movie is worse than bad. The credits do not include the fact that it is based on the wonderful earlier version, from 1954, or the book it was based on- and maybe it's just for the best. A terrible movie; the most unsubtle movie I ever saw. And somehow, the beautiful Isabel Adjani doesn't look so good in English. The plot in this version isn't realistic, the ending is pathetic, the twists are shallow. This movie deserves all the bad words in the English language. I gave it a 1, which it deserves only for Adjani's clothes. One of the worst movies of 1996, perhaps of all time.",
         "Known primarily for light Comedy Features Jeremiah Chechik thought of a change-of-pace and adapted for his third entry into directing the famous novel \"Celle Qui N'etait Pas\" by Pierre Boileau and Thomas Narcejac, which also served as model for the French Crime-Classic LES DIABOLIQUES from 1955 by Henri-Georges Clouzot. With an interesting cast of four fine character actors in the leading roles and a budget of 30 million dollars in his hands Chechik came up with a uneven, slow-moving, pale and glossy Thriller about a tyrannical school-master who is drowned by his long-suffering wife and mistress and thrown into the School Pool, but strangely disappears. Before the film's release there were much rumours about creative differences between the director and Miss Sharon Stone, the latter one aiming for a black comedy and Chechik shaping a crime movie on his own. Well, both failed. You can hardly judge a movie by its trailer, because sometimes the latter one can be much better than the movie it is promoting. Take for example DIABOLIQUE: The first moving pictures I saw from it were very stylish and appealing, like the drunken Palminteri, the Whiskey-Glass falling down in slow-motion, the out-of-the-water-perspective-shot of Palminteri looking at the two women who pull his head into the water etc. etc. etc. But finally watching the film was hugely disappointing. I think I wouldn't have been that dissatisfied hadn't I seen the perfectly structured original just a couple of months ago on TV. Jeremiah Chechik & Co. turned the brilliantly structured and genuinely haunting thriller into a stupid, below-average Hollywood thriller that relies too much on its star power. Hey, our teacher is lying naked on the floor! The film begins with a little boy (Adam Hann-Byrd) looking one rainy night through his bedroom window into the opposite bathroom window of his naked teacher Miss Mia (Isabelle Adjani) who suddenly has a heart attack and fells on the floor. Shocked he runs out of his accommodation into the other to save her (or maybe to see the chick naked... yeah!). Meanwhile Mias husband Guy (Chazz Palminteri), the principal of the boarding-school, comes into the bathroom looking at her without any reaction. Then his mistress and her colleague Nicole (Sharon Stone) shows off and gives her the medicaments to stop the pains. Okay, that's the situation. Guy is an emotionless, sadistic bad guy of the highest order, who to the viewer's surprise can keep his wife and mistress under control. But the sensible, heart-troubled Mia is fed up with him and so is her cool, cynical friend, colleague and rival in one named Nicole. They both decide to kill him and make it appear like he drowned himself. Hey, our teacher is killing her husband! Mia and Nicole leave for the school holidays and move into a apartment, where Guy shows off depressed about Mias decision of getting divorced. She gives him something to drink with narcotics in it. After Guy is drowned by both women they put the dead body into a big case, drive it back to school and throw it into the school pool. But the next day, when the pool is cleaned the body's missing... Jeremiah's Genre Vacation. Chechik was already a acclaimed and award-winning director of commercials and music clips when he entered the film business making his way through the Chevy-Chase-Comedy NATIONAL LAMPOON'S CHRISTMAS VACATION (1989), the audience-friendly Romantic Comedy BENNY & JOON (1993) starring Johnny Depp and Mary Stuart Masterson and the Fantasy-Comedy TALL TALE (1995) with Patrick Swayze. So far, so... acceptable, but how could he think of helming the US remake of a French classic that was almost perfect in its own rights and couldn't be topped or even reached. So the comparison between Clouzots and Chechiks interpretations of the same story is inevitable. Chechik focuses very much on the stylish visuals and atmosphere of his film pushing it sometimes to a kind of gothic nightmare placed in a old, shadow-filled, dark boarding-school, cool-as-ice-light filter on the actors, especially dead-cold Sharon Stone, and good art direction, made even more accessible by unsubtle slow-motion scenes and unusual camera angles. But these things don't make the already highly suspenseful story any better or worse. Surprisingly Clouzots tight creation of the not-so-wealthy-boarding-school with its dark gaits is far more effective. Clouzots visuals don't harm the story nor the excellent cast, so that every detail of the clever plot and the intriguing characters could be fleshed out. That's focused storytelling at its best with every single frame fitting into the story. But Chechik doesn't seem do care about pacing or character development and focuses on stupid plot details to make it logical for \"stupid\" American audiences, which weighs down the whole film, especially in the unbelievably bad third act. Add to that a mediocre mystery-score by Edelman and you will fall asleep halfway through. In the end Chechik is in the wrong genre, whether it is a black comedy or a thriller. Catherine Tramell without a ice-pick and Queen Margot without a crone. The teaming of Sex symbol Sharon Stone, who just had turned through her excellent work in Martin Scorseses epic gangster movie CASINO into a Oscar-nominated, serious actress, and internationally popular Isabelle Adjani, a versatile and talented performer, looks attracting on the paper, but not onscreen. Miss Stone does her Catherine-Tramell-routine from her most famous film BASIC INSTINCT (1991) in the role of Nicole, who in the original was played by the beautiful Simone Signoret. Stone is cool, cynical, calculating, clever and bitchy, but doesn't appear nude. So Isabelle Adjani has to do that job. While Stone's performance as bitch dressed in tasteless clothes and smoking lady-like is so broad that it's almost great fun, Adjani is a huge disappointment looking as ugly as she never looked before with her black hair hanging down in front of her face like big curtains and her face incredibly pale and in terms of acting disastrous. What a waste of beauty and talent! But she should be used to this kind of treatment by Hollywood after forget-about-appearances in Walter Hills THE DRIVER (1978) and Elaine Mays flop ISHTAR (1987). In the original Clouzots real-life-wife Vera excels as sensible beauty who slowly gets crazy and frightened. Add to this unhappy pairing of good actresses some other wasted performers like Chazz Palminteri, who after doing the intense-as-usual a**hole-routine turns into a stupid Michael-Myers-copy, and Kathy Bates, who is to a certain degree solid fun, and useless appearances by Adam Hann-Byrd (LITTLE MAN TATE, 1991), Spading Gray (SWIMMING TO CAMBODIA, 1987) and Allen Garfield (THE STATE OF THE THINGS, 1982). Adaptation equals creative death. Don Roos who scripted the race-relation-drama LOVE FIELD (1992) starring Michelle Pfeiffer and the sexy thriller SINGLE WHITE FEMALE (1992) took on the task of updating Clouzots flawless and tight script. The best thing he could have done was to note some costume, setting and dialect changes into the original script and hand it over to the director, but that - sadly - isn't the way Hollywood does its adaptations of European movies. So what we get here are too many subplots weighing down the actual plot, like for example a filmmaker-couple who are ordered to make a commercial for the school, some fine ideas like turning the Columbo-lookalike-detective from the original into a clever, ironical heavy-set Ex-Detective suffering from breast cancer, and finally one of the worst finales to be found in any film of the decade. It's neither thrilling nor funny, just increasingly stupid.",
         "A tyrannical school principal terrorizes his fragile wife with heart disease and his cynical mistress as well (both are teachers in the couple's private school). The two women plot to kill him, but after the murder their plan starts to fall through. The body disappears, then more and more signs become apparent to prove: he is alive. The real mystery is why anyone had to remake a classic French thriller that was imitated so many times before, why it had to be done so terribly, cast so wrongly and acted in such unsubtle way - and why anyone on earth should care the whole stuff.",
         "I saw that 'Diabolique' was showing on a cable movie channel, and I had heard great things about it, and so I was prepared to be impressed and intrigued, and to improve my 'cultural literacy' in the process. Instead, what I got was a draggy, lifeless 'film noir' remake with Sharon Stone and Chazz Palmintieri. The frustrating thing about the movie was that it was JUST GOOD ENOUGH and kept JUST ENOUGH of the elements of the original plot to make me hope that things would improve somehow. So I kept watching it. But it never did. I am not Sharon Stone's biggest fan, but I acknowledge that she gave a compelling performance in \"Casino\", and that very few actresses past or present could have played her role better. (Joan Crawford or Betty Davis, maybe). And she's a black hole of bitterness and anger here -somehow sexually inviting and repellent at the same time. That doesn't make for comfortable viewing. There's the same problem with the lesbian undercurrents between the wife and the mistress - it ought to be titillating or erotic, but it's just stale and nasty. And Chazz Palmintieri is a great character actor( see 'The Usual Suspects' or \"Bullets Over Broadway\"), but the character he plays is such a flat-out son-of-a-bitch that you really don't want to watch him. But the real the problem with the film is that they were going for dread and suspense, but the pacing and rhythms of each of the individual scenes was way off - empty and interminable. So the viewer wound up feeling dread and BOREDOM instead. That doesn't make for 'recommended film viewing'. I still hope to seek out the original one of these days, so at least the remake didn't spoil anything. And some one else might like this version just fine on its own merits, depending on how big a Stone fan they are (it is really her movie - her character drives the events in the plot).",
         "Diabolique (1996) Sharon Stone, Isabelle Adjani, Chazz Palminteri, Kathy Bates, Spalding Gray, Shirley Knight, D: Jeremiah S. Chechik. Revamped version of the 1955 French thriller, with Palimenteri as a tyrannical boys-school headmaster done in by the joined forces of his mousy wife (Adjani) and icy blonde mistress (Stone) in a murder plot they wrongfully assume is foolproof. First-rate performers can't serve justice to this diabolical debacle, which doesn't start off too bad, then goes astray. This unspeakably bad rip-off trashes the classic original with too many `oh, come on' moments, ridiculous red herrings and twists of its own, and a finale right out of a slasher flick. Bates is even gone to waste as a retired detective who's investigating the case `for something to do'. Running Time: 107 minutes and rated R for nudity and sexual content, violence, and some language. * ½",
         "The classic French thriller Diabolique has a sturdy story, which is one reason why it is a target for remakes. The film was remade for American television twice - first as Reflections of Murder (featuring Tuesday Weld, Joan Hackett and Sam Waterston) and later as House of Secrets (with Melissa Gilbert and Bruce Boxleitner). To be honest, both of those remakes are certainly interesting to watch, if lacking in the suspense and novelty of the original. Reflections is fairly faithful to its parent, while House of Secrets maintains the bare bones of the storyline and throws in a different setting and some elements of voodoo. If you have not seen the original, the enjoyment level of both those films will be elevated. The same cannot be said for the first dunderheaded attempt to cinematically remake the French classic for American audiences. Keeping the original name, story and setting would seem a step in the right direction, but the film fails due to some incredibly foolish choices. The action takes place at a private boys prep school overseen by the hateful Chazz Palminteri. In between stealing funds from the school, Palminteri enjoys subjecting wife Isabelle Adjani - who suffers from a weak heart - to assorted cruelties. In his spare time, he engages in S&M with ice queen blond teacher Sharon Stone. The two women - tired of his abuse - decide to murder him, drop his body in the disgustingly filthy school pool and make it appear that he drowned in a drunken accident. Naturally, nothing goes according to plan. The best thing about this film is probably the casting of Sharon Stone in the role made famous by French actress Simone Signoret. If anyone embodies some of the same cunning and sensuality of Signoret from the original in a modern actress, it would be Stone. Unfortunately, the screenplay and everything around her fails to support her in any way. The changes made to the screenplay are not improvements. While a remake need not be slavishly faithful to the original, it should not completely go off the beaten path the way that this film does, particularly in its finale. The shock twist ending of the original may no longer be fresh, but the shaggy dog pseudo-feminist tilt tacked on to this latest effort seems to come completely from left field and is a blatant misfire. If Stone was an inspired choice, the remainder of the cast is less so. Isabelle Adjani, looking puffy and listless, is completely underwhelming as the abused wife. At no point does she engage our sympathy and she often seems entirely too lacking in energy to be remotely terrified. This may well be the most laid-back \"frightened\" performance one has ever seen on celluloid. Kathy Bates shows up as a detective investigating Palmineri's disappearance and driving the women to distraction. Her performance is immensely enjoyable and she seems to be having a good time. As a cancer survivor, she gets to crack completely inappropriate jokes and attempts to lay the groundwork for the \"we're all sisters under the skin\" meme that creeps into the film's finale. Unfortunately, her character and performance belongs in a completely different (and one would argue better) film. And the casting of Chazz Palminteri as the abusive schoolmaster is a disaster. Palminteri, providing the same performance here as he does in his guise of the reliable Mafia hit man roles in which he specializes, is laughably miscast. As tough as he comes off, Adjani could arguably physically match him and Stone could step on him without blinking twice. Not only that, but we have to believe that there was something that attracted these two attractive women to him and kept them in his orbit when they could easily have moved on. Palminteri, resembling a large trout, and playing a man with the charisma of a barracuda, seems an impossible prospect for these women. We have to believe that one lovely woman would fall for him (much less two) and no gigantic leap of faith can make this happen. Director Jeremiah Chechik has absolutely no idea how to maintain suspense or an atmosphere of foreboding. The scene shifts are klutzy and obvious. The pacing is often laborious, which allows the viewer time to mull over the complexities of the plots and double-crosses played out before us and realize how absurd the entire scenario truly is - something that the original (as well as its TV remakes) never allowed the viewer time to contemplate. This material needs a skilled hand, but what is provided is a clumsy sledgehammer. The original is noted especially for its shock ending. This remake seems initially to be going for the same thing and then suddenly backtracks - with remorseless characters suddenly developing consciences and people conducting themselves in ways not previously indicated in their respective behavior. By the time all of the leads end up in a watery fight, one realizes what a foolish level to which the film has sunk. One is sternly advised to locate either the original French classic or one of its TV counterparts before descending to this entry.",
         "With some of Hollywood's worst trash on his resume, Director Jeremiah Chechik gives us something slightly better than his worst (\"The Avengers\") and much worse than his best (\"Benny and Joon\"). This oddly unsatisfying 1996 remake of the classic 1955 French thriller illustrates Hollywood's ham handed ability to turn a classic suspense tale into a weak atmosphere piece. I say oddly because Isabelle Adjani and Sharon Stone are together on the screen for almost the entire film and the two actresses truly bring out the best in each other. So you have a long series of well-played scenes by fine actresses, but they are strung together into a slow paced story line that lacks unity and consistent motivation. Which could be caused by a lot of things but is most likely the result of trimming in post-production, in which important unifying elements were left on the cutting room floor. Or it could be that the director and production designer just failed to translate the writer's vision onto the screen. Since this ultimately this is a story about an evil character who develops a sentimental side, it is absolutely critical that this process is communicated to the audience. The audience should not just be surprised by the ending but should be able to think back and see all the motivational pieces click into place. In this regard the movie is a complete failure. Then there is the issue of cheating. Because we only know what he wants to tell us, a director has a variety of legit ways to introduce misdirection and surprise into a film. But occasionally a director lacks the integrity and vision to play by the rules. Such is the case here as only the audience sees the underwater shot of a clearly drowned Guy (Chazz Palminteri). It is shown to convince us that he is dead but this then makes his reanimation impossible. Plus it is fairly useless because you know that he has to come back for there to be much of a story. That is cheating and there is more cheating in the unintentionally comical climatic scene. The beauty of the original movie was the absence of cheating and the macabre irony of the ending. All that is missing. Whatever, it means that the only reason to watch this version of \"Diabolique\" is for the acting of Adjani and Stone. Although Adjani was 40-41 years old when she made this film, she has lost little of her beauty. While she was probably the world's most beautiful actress in her twenties, there is simply no debate that she was the most beautiful 40 year-old in cinema history. Stone pretty much plays her hard-as-nails self but she is given some great lines and her character is a great contrast to the ethereal take Adjani gives to her own character. If you are looking for a better but less obvious remake of the original \"Diabolique\", track down 1971's \"Let's Scare Jessica To Death\". This almost forgotten horror classic is truly scary. It has much better production design than 1996's \"Diabolique\", with creepy whispering and images that stay with you and creep you out even weeks later. Jessica is a woman recently released from a mental \"institution\" who goes to a farm in a quiet rural area. The odd locals and their local legends begin to mess with Jessica's head as her husband and his secret girlfriend attempt to scare her to death."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": [
         "ABC Productions",
         "Marvin Worth Productions",
         "Morgan Creek Productions"
      ],
      "summaries": [
         "The wife and mistress of a cruel school master collaborate in a carefully planned and executed attempt to murder him. The plan goes well until the body, which has been strategically dumped, disappears. The strain starts to tell on the two women as a retired police investigator who is looking into the disappearance on a whim begins to think that they know more than they are telling, and their mental state is not helped when their victim is seen, apparently alive and well by one of the pupils.",
         "The wife and mistress of the sadistic dean of an exclusive prep school conspire to murder him."
      ],
      "budget": 0
   },
   "movielensId": 640,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-22",
      "dvdReleaseDate": "2000-07-18",
      "directors": ["Jeremiah S. Chechik"],
      "runtime": 107,
      "movieId": 640,
      "title": "Diabolique",
      "mpaa": "",
      "actors": [
         "Sharon Stone",
         "Isabelle Adjani",
         "Chazz Palminteri",
         "Kathy Bates",
         "Spalding Gray",
         "Shirley Knight",
         "Allen Garfield",
         "Adam Hann-Byrd",
         "Donal Logue",
         "Diana Bellamy",
         "J.J. Abrams",
         "O'Neal Compton",
         "Bingo O'Malley",
         "Stephen Liska",
         "Clea Lewis"
      ],
      "imdbMovieId": "0116095",
      "originalTitle": "Diabolique",
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["QyQZHWC83GA"],
      "plotSummary": "The wife and mistress of a cruel school master collaborate in a carefully planned and executed attempt to murder him. The plan goes well until the body, which has been strategically dumped, disappears. The strain starts to tell on the two women as a retired police investigator who is looking into the disappearance on a whim begins to think that they know more than they are telling, and their mental state is not helped when their victim is seen, apparently alive and well by one of the pupils.",
      "tmdbMovieId": 10988,
      "avgRating": 2.97979,
      "releaseYear": "1996",
      "numRatings": 3390,
      "posterPath": "/woBHA1Obn53zziO6h0N9340SGMv.jpg"
   }
}