{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "age difference",
            "id": 965
         },
         {
            "name": "retiree",
            "id": 4193
         }
      ],
      "imdb_id": "tt0113947",
      "video": false,
      "title": "Nelly and Monsieur Arnaud",
      "recommendations": [
         6320,
         64559,
         86727,
         66957,
         64983,
         48778,
         8425,
         31300,
         64968,
         69978,
         71125,
         4702,
         63691,
         12513,
         67385,
         43101,
         169780,
         42463,
         38695,
         49693
      ],
      "backdrop_path": "/uZJaDZ57wGa3XVrodqslaUxMl0s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Nelly",
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a563",
               "name": "Emmanuelle Béart",
               "profile_path": "/dICNGDe2Sgz73Febl0TJZpEKO9f.jpg",
               "id": 4885,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "M. Pierre Arnaud",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a557",
               "name": "Michel Serrault",
               "profile_path": "/pm3TvMrWMwU7TvVfiR7zPBAFwEp.jpg",
               "id": 12270,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Vincent Granec",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a55b",
               "name": "Jean-Hugues Anglade",
               "profile_path": "/iy8Tfcb3Zq1INu1kGm069wccRev.jpg",
               "id": 7037,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Jacqueline",
               "gender": 1,
               "credit_id": "52fe450f9251416c7504a55f",
               "name": "Claire Nadeau",
               "profile_path": "/8q9hBmHYdUhhoYeFRLzjg17d8kr.jpg",
               "id": 73264,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Dollabella",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a59d",
               "name": "Michael Lonsdale",
               "profile_path": "/pEF7YiXY9yMKUVX5n2Ly7OYH5Op.jpg",
               "id": 2369,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Lucie",
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a5a1",
               "name": "Françoise Brion",
               "profile_path": "/7ZQMbJE4hW5gJAQN4h5EGX9Y9n4.jpg",
               "id": 20118,
               "order": 5
            },
            {
               "cast_id": 26,
               "character": "Isabelle",
               "gender": 1,
               "credit_id": "52fe450f9251416c7504a5c1",
               "name": "Michèle Laroque",
               "profile_path": "/c8wqWIidSYbU5opaxGFwjaaPPyC.jpg",
               "id": 35962,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Christophe",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a5a5",
               "name": "Jean-Pierre Lorit",
               "profile_path": "/5GeQllohEVRvLhYFuowJHCW9tAf.jpg",
               "id": 1356,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Taieb",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a5a9",
               "name": "Michel Albertini",
               "profile_path": "/1tolmrmOSZ5ecKrfDMGz25HyU3J.jpg",
               "id": 38891,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Marianne",
               "gender": 1,
               "credit_id": "52fe450f9251416c7504a5ad",
               "name": "Coraly Zahonero",
               "profile_path": null,
               "id": 268997,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Laurence",
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a5b1",
               "name": "Graziella Delerm",
               "profile_path": null,
               "id": 66031,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Jean-Marc",
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a5b5",
               "name": "Olivier Pajot",
               "profile_path": "/5ZKHDEruX9p9fe3M8nU2rM9W26D.jpg",
               "id": 267603,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Luc",
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a5b9",
               "name": "Alexandre Chappuis",
               "profile_path": null,
               "id": 578100,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Jérôme",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a5bd",
               "name": "Charles Berling",
               "profile_path": "/5W9uDe33eFYFNOW5lqJVvlzHkzb.jpg",
               "id": 48576,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a569",
               "name": "Claude Sautet",
               "profile_path": null,
               "id": 20789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a56f",
               "name": "Claude Sautet",
               "profile_path": null,
               "id": 20789,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a575",
               "name": "Jacques Fieschi",
               "profile_path": null,
               "id": 23506,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a57b",
               "name": "Yves Ulmann",
               "profile_path": null,
               "id": 73266,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a581",
               "name": "Antoine Gannagé",
               "profile_path": null,
               "id": 73267,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a587",
               "name": "Alain Sarde",
               "profile_path": "/95fgX9tAqahF98DG4FutHpLjbEi.jpg",
               "id": 3560,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a58d",
               "name": "Philippe Sarde",
               "profile_path": null,
               "id": 20075,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a593",
               "name": "Jacqueline Thiédot",
               "profile_path": null,
               "id": 20792,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe450f9251416c7504a599",
               "name": "Jean-François Robin",
               "profile_path": null,
               "id": 20791,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.870109,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 12652,
      "vote_count": 23,
      "budget": 0,
      "overview": "Nelly leaves her lazy, unemployed husband to work for retired judge Mr Arnaud, forty years her senior, after he offers to clear her bills for her. While she types his memoirs the two develop a close friendship, but Arnaud becomes jealous when Nelly begins dating his good-looking young publisher.",
      "similar": [
         284,
         153,
         164,
         2652,
         258480,
         19265,
         353070,
         2196,
         223,
         4808,
         10995,
         2313,
         261470,
         24684,
         14160,
         4520,
         343,
         381,
         287,
         1999
      ],
      "original_title": "Nelly & Monsieur Arnaud",
      "runtime": 106,
      "poster_path": "/vtQl8XRlR0YRAHSZvBweMeePrVu.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1996-04-12",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Sautet"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Jacques Fieschi",
         "Claude Sautet"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0113947/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1NjU3MjUxMV5BMl5BanBnXkFtZTcwMjc1MzQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Emmanuelle Béart, Michel Serrault, Jean-Hugues Anglade | See full cast and crew »"],
      "reviews": [
         "In the 1995 film, Nelly and Monsieur Arnaud, director Claude Sautet depicts the relationship between an attractive young woman of 25 (Emmanuelle Beart) and wealthy retired judge (Michel Serrault). The setting is in upper middle-class Paris, replete with cognac, 1961 Chateau d\"Yquem, stacks of books on the shelf and comfortable looking apartments. As in another Sautet film, Un Coeur en Hiver, the subject is the fear of being involved. \"We all want love, but when we find it, we pull back. It scares us,\" states Monsieur Arnaud. At the opening, Nelly is having marital problems with her husband Jerome (Charles Berling) who has not worked in a year. At a café one afternoon she is introduced by a friend to M. Arnaud and, after only a brief conversation about the state of her affairs, he surprisingly offers to give her 30,000 francs to help her get out of debt. She first refuses, then later agrees and also accepts his offer to type his memoirs on his computer. As she transcribes his verbally-dictated notes several hours a day, it becomes clear that he is paying her to be not only his assistant but his companion and personal confidant as well. The talk starts out with book-related matters but soon veers off into the personal. Though there is an unspoken yearning for closeness, their relationship develops into a power struggle over who can get the other to reveal their secrets. Arnaud is attracted to the younger woman but does not pursue it for fear of rejection. He is reluctant to take risks and is content with the companionship he looks forward to every few days. Neither is comfortable with fully expressing their feelings. Nelly holds people at a distance, seeming to notice their needs but ultimately rejecting their advances with small but hurtful lies. She begins a relationship with M. Arnaud's book publisher Vincent (Jean-Hugues Anglade) but when she suspects that Arnaud is becoming possessive, she lies and tells him that she has slept with Vincent. Having made Arnaud jealous, she then callously dismisses Vincent when he asks her to move in with him. Some changes do seem to open up, however. Nelly leaves her husband and rents a studio apartment. Arnaud opens up and begins to share more of his life. There is a gallantry about the older man as he begins to communicate the pain of his divorce, his estranged relationship with his son, his financial dealings that turned bad, and his unfulfilled longings. Nelly and Monsieur Arnaud is the type of film that comes to mind when we think of French cinema: thoughtful, restrained, and sensitive; a delicately nuanced character study performed by accomplished actors. The film is \"talky\" but the conversation is so thoughtful and civilized that we can just sit back and drink it up like a glass of vintage Sauterne. While the characters are not without flaws, they are nonetheless very human and Sautet makes us care about them, revealing their subtleties to us in a way that evokes our compassion. The film conveys the characters' deep longing for connection but, like many of us, they are more comfortable with maintaining the status quo. At the end, nothing much seems to have changed but when Arnaud's ex-wife (Francoise Brion) comes to visit, a hint that passion may have entered the picture in an unforeseen manner is unmistakable.",
         "What a beautiful, tender film...melancholy in tone, with an underlying sense of passion! I was so moved by it I was inspired to write a poem . There might be those (militant feminists, perhaps) who would object to the theme of an older man yearning (but discreetly) for a beautiful much younger woman...but I found it not only true to life, but humanly evocative. What a genius for film-making...Claude Sautet..(\"Un Coeur En Hiver\" his masterpiece, in my opinion). He will be sadly missed. Thank you and farewell, M.Sautet.",
         "I came across this film, purely by chance, when it was shown on terrestrial TV a couple of years ago. It's a beautiful study of a complex relationship between an older man - the urbane, world-weary Monsieur Arnaud (Michel Serrault) - and the beautiful young woman (Emmanuelle Béart) he hires to assist him in the writing of his memoirs. Initially, they are dependent on each other for different reasons - Nelly financially and Arnaud on the direction Nelly brings to his work - but as the film progresses they become more emotionally attached and the implications of this is the film's main theme. The depth of feeling that develops between the two characters comes across very strongly, thanks mainly to the quality of the two lead performances, while the sexual aspect is merely hinted at and is all the more erotic for it. If subtlety and suggestion are what you look for in a film, \"Nelly and Monsieur Arnaud\" should be high on your list of 'must see' movies.",
         "How many film-makers make their greatest masterpiece as their last film? Not many, but to that select list, add Claude Sautet. Nelly & M. Arnaud is exquisite. It is cinema. This is to say that, in common with most truly and unquestionably great films, it could not exist with such power in any other art. The most difficult and also the most wonderful films are the films that take place, primarily in their character's hearts. It was not important what Charles Foster Kane *did*, but what he felt. In this film too, we experience the primacy of human feelings. We do this through two luminous performances that reveal just how coarse is the acting that we habitually see in block-buster movies. One of the many deep emotions that overcame me when I first saw this film was that sheer privilege to see such acting. To see the very gradual, subtle and beautiful love that develops between the two central characters is to get a glimpse of heaven. A film, then, not of love, but the possibility of love, and a warning without didacticism that we all should grasp love if we are given the opportunity. Perhaps the greatest joy of cinema is its ability to allow us to experience rare emotion. This wonderful, wonderful film does that in an effortless way, without sentimentality, and for that we should be eternally grateful. Thank you M. Sautet, wherever you may be.",
         "This is a wonderful film. The two leads are extraordinary. They express so much emotion with a slight movement in their eyes. It's about two lonely people. Their friendship seems to fill an unspoken void in their lives. The director is able to show so much emotion by merely showing the audience the little things, instead of exploding the screen with mawkishness. Every time I see this film, I find something else to savor in it.",
         "Emmanuelle Beart and the movie itself are simply beautiful, gentle and breathtaking. So-French -totally in a good way; the movie has its own pace and tone. Everything is beyond excellency: acting, cinematography, direction and first of all (it all starts with) the perfect original script. They don't make these kind of movies often (and so well-done). If you like heart and truth you have to see this quiet modern masterpiece (and Un Coeur en Hiver, also with the dazzling Emmanuelle Beart).",
         "I guess the main reason for \"Nelly\" to be one of the most popular Eruopean movies of the last years is the presence of the Goddess Beart in each and every one of the sequences: her eyes, her mouth, her perfection. Without any make-up, without wonderful dresses... she does not need anything but her natural beauty to make Mr. Arnaud to fall in love her. He hires her as a personal assistant while he's writing his memoirs, but she'll end up being his closest confident. The connection between both of them is neither sexual nor platonic... it's something else. Maybe they're just kindred spirits that meet each other at the wrong time: he knows she's too young and beautiful to stay with him. It doesn't matter if she'd be willing to begin a relationship with Arnaud, 'cause the truth is that he won't let her beauty to fade in the company of an old man which has anything but memories. This is a sober and reflexive movie, that doesn't live up to its world wide fame (in my opinion); but, as I said before, the presence of Emmanuelle Beart worth watching it. *My rate: 7/10",
         "This comment, in the form of a poem, is dedicated to the late Claude Sautet, one of France's premier directors... NELLY ET M. ARNAUD Empty shelves: his library divested. Nothing written, except memory, invests this moment, this immediacy. In the dim light his worn hand almost caresses her young body, but we, in the dark, must estimate the camera's intent. What he had held in abeyance too long shadows his face. And the rain, the hard Parisian rain. Cognac at tables for two. Another man, a younger man. These scenes will lead us to believe in temporary convenience... the \"stolen moments.\" Vivid beauty flashed on the computer screen, four centuries preserved. Manipulated, changed, \"seared with trade.\" What remains, embraced, has no passport, has no traveling bags. . . . . . . . . . . . . . . . . . . . Thank you and farewell, M. Sautet",
         "Exquisite movie. Sautet's a director who builds up his films moment by moment without you realizing the full extent of the feelings involved, usually until the very end. And he doesn't do it with the typical Hollywood flash. He allows you to realize things yourself. This movie of his is no exception. Sautet, through his characters and his directorial realization of the scripted story, is someone who sees above the pettiness of the everyday world. If you haven't genuine love and understanding in your life, you have something considerably less. Late in his life, Monsieur Arnaud, one of the title characters, finally gets it and through his relationship with Nelly (and others) allow us, the audience, to do so also, definitely by the end of this story. 4 aces, five stars, 10 votes, whatever, this is a must-see, especially for Sautet fans who've seen and like his other works.",
         "When you gotta go you gotta go and if Claude Sautet had to go he certainly went in style. He gave us some of the finest and most durable films in late 20th century French cinema - Vincent, Francois, Paul et les Autres, En Cour en Hiver and so many more, films we can watch again and again with renewed pleasure and he signed off with a doozy. It is, of course, a cliché that only the French know how to handle the man-woman relationship in all its nuances, unorthodoxy, etc, but one worth repeating. Its all too easy to imagine the clumsiness with which modern English/US directors would have handled the older man/younger woman situation that lies at the heart of this story but I'm ready to bet plenty of twelve-to-seven that none would have brought the delicacy of touch, subtlety that is synonymous with Sautet. When we talk of a 'mood' piece we think of Chekhov and Sautet invokes the Russian master in spinning out of thin air a fragile, gossamer-thin tacit understanding between his two leads. Beart is almost too impossibly beautiful to be true and she needs to be the fine actress she is to get past the handicap of classical features while Serrault is a consummate actor still turning out great performances. A word too about the support, Michele Laroque, a stand-up comedienne in her spare time, brings the same solid support here as she did later in Francis Veber's 'Le Placard'. I can pay this movie no higher compliment than to bracket it with 'Brief Encounter', another masterpiece of unconsummated love that is still enchanting audiences fifty years on, as Nelly and Mr. Arnaud surely will be."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Cecchi Gori Group Tiger Cinematografica",
         "Les Films Alain Sarde",
         "Prokino Filmproduktion"
      ],
      "summaries": [
         "When Nelly, a woman being just divorced, meets by chance M. Arnaud, a mature salesman just retired, begins a strange and special relationship between the two personalities.",
         "Nelly is underemployed, in debt, and married to a slacker. She meets Arnaud, a wealthy retired magistrate and businessman whose wife lives in Geneve with another man and whose children hardly speak to him. He offers to pay her debts, no strings attached. She leaves her husband and accepts Arnaud's gift. He then offers a job typing and editing his memoirs, which she takes. She is beautiful, amused, detached; he is observant and probing. She meets his youthful publisher, they begin a love affair. When that ends and it is also clear that her husband and she are irreconcilable, Nelly's delicate friendship with Arnaud is her refuge. Then his wife returns and things must change."
      ],
      "budget": 0
   },
   "movielensId": 645,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-04-12",
      "dvdReleaseDate": "2001-09-18",
      "directors": ["Claude Sautet"],
      "runtime": 106,
      "movieId": 645,
      "title": "Nelly and Monsieur Arnaud",
      "mpaa": "",
      "actors": [
         "Emmanuelle Béart",
         "Michel Serrault",
         "Jean-Hugues Anglade",
         "Claire Nadeau",
         "Michael Lonsdale",
         "Françoise Brion",
         "Michèle Laroque",
         "Jean-Pierre Lorit",
         "Michel Albertini",
         "Coraly Zahonero",
         "Graziella Delerm",
         "Olivier Pajot",
         "Alexandre Chappuis",
         "Charles Berling"
      ],
      "imdbMovieId": "0113947",
      "originalTitle": "Nelly & Monsieur Arnaud",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Nelly leaves her lazy, unemployed husband to work for retired judge Mr Arnaud, forty years her senior, after he offers to clear her bills for her. While she types his memoirs the two develop a close friendship, but Arnaud becomes jealous when Nelly begins dating his good-looking young publisher.",
      "tmdbMovieId": 12652,
      "avgRating": 3.64486,
      "releaseYear": "1996",
      "numRatings": 321,
      "posterPath": "/vtQl8XRlR0YRAHSZvBweMeePrVu.jpg"
   }
}