{
   "tmdb": {
      "original_language": "de",
      "keywords": [{
         "name": "road movie",
         "id": 167043
      }],
      "imdb_id": "tt0109028",
      "video": false,
      "title": "Cold Fever",
      "recommendations": [
         38181,
         256106
      ],
      "backdrop_path": "/wRRmofdqMOBOQIHriubG6Gkymq7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Hirata",
               "gender": 2,
               "credit_id": "52fe4793c3a368484e0ce7eb",
               "name": "Masatoshi Nagase",
               "profile_path": "/tfLSQKMo7ocCGbzFWJeQvjqF93l.jpg",
               "id": 68973,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Jill",
               "gender": 1,
               "credit_id": "52fe4793c3a368484e0ce7ef",
               "name": "Lili Taylor",
               "profile_path": "/pIJ4Enx6kIC9srLkDfGpEzfNlDZ.jpg",
               "id": 3127,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe4793c3a368484e0ce7f3",
               "name": "Fisher Stevens",
               "profile_path": "/TutpOyw0A6FF5hEoFDYseI2EVN.jpg",
               "id": 26473,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Siggi",
               "gender": 0,
               "credit_id": "52fe4793c3a368484e0ce7f7",
               "name": "Gísli Halldórsson",
               "profile_path": null,
               "id": 96523,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Laura",
               "gender": 1,
               "credit_id": "52fe4793c3a368484e0ce7fb",
               "name": "Laura Hughes",
               "profile_path": null,
               "id": 187708,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Hirata's Grandfather",
               "gender": 2,
               "credit_id": "52fe4793c3a368484e0ce7ff",
               "name": "Seijun Suzuki",
               "profile_path": "/fGZPvvEYaO1RLdW4PEcYp3IJcOW.jpg",
               "id": 82461,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Suzuki",
               "gender": 0,
               "credit_id": "52fe4793c3a368484e0ce803",
               "name": "Hiromasa Shimada",
               "profile_path": null,
               "id": 552032,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Higashino",
               "gender": 0,
               "credit_id": "52fe4793c3a368484e0ce807",
               "name": "Masayuki Sasaki",
               "profile_path": null,
               "id": 552033,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4793c3a368484e0ce7cf",
               "name": "Friðrik Þór Friðriksson",
               "profile_path": null,
               "id": 6759,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4793c3a368484e0ce7d5",
               "name": "Friðrik Þór Friðriksson",
               "profile_path": null,
               "id": 6759,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4793c3a368484e0ce7db",
               "name": "Jim Stark",
               "profile_path": null,
               "id": 4834,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4793c3a368484e0ce7e1",
               "name": "Hilmar Örn Hilmarsson",
               "profile_path": null,
               "id": 43528,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4793c3a368484e0ce7e7",
               "name": "Ari Kristinsson",
               "profile_path": null,
               "id": 224832,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.517063,
      "production_countries": [
         {
            "iso_3166_1": "IS",
            "name": "Iceland"
         },
         {
            "iso_3166_1": "DK",
            "name": "Denmark"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 68445,
      "vote_count": 6,
      "budget": 0,
      "overview": "A Japanese businessman travels to Iceland and has a series of misadventures while venturing to a remote area to perform a traditional burial ritual where his parents died several years back.",
      "similar": [
         773,
         920,
         296099,
         340485,
         83770,
         1696,
         10746,
         19621,
         309242,
         19908,
         158,
         2898,
         4147,
         11282,
         100042,
         138832,
         291870,
         212778,
         277216,
         8275
      ],
      "original_title": "Á köldum klaka",
      "runtime": 85,
      "poster_path": "/4aytLuIicECojFIJCqaLk1fj1rf.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Íslenska",
            "iso_639_1": "is"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Icicle",
            "id": 7325,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Fonds",
            "id": 7326,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pandora Filmproduktion (",
            "id": 7327,
            "origin_country": ""
         }
      ],
      "release_date": "1995-02-10",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "ISK ",
      "directors": ["Friðrik Þór Friðriksson"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Friðrik Þór Friðriksson",
         "Jim Stark"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109028/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNTk1NTEwMF5BMl5BanBnXkFtZTcwNzg4ODUyMQ@@._V1_SY317_CR22,0,214,317_AL_.jpg",
      "actors": ["Stars: Masatoshi Nagase, Lili Taylor, Fisher Stevens | See full cast and crew »"],
      "reviews": [
         "Ten years later this very compact film still works its magic. Much has been said by many of the other contributors with one exception. It is not a film to be rushed. Rather you need to view at the speed the film dictates - not unlike \"Paris, Texas. Like the swirling mists and snow it slowly envelops you. No frame is wasted. Even a casual remark in the aeroplane en-route to Iceland gives a link for the future. Many different cultures have their cultural layers peeled back; American, Japanese, Icelandic and Norse mythology. It's up to the viewer to see what he or she sees. I think the most telling scene in the film is the Icelander who befriends Hirata. Although he does not want to accompany Hirata to the ritual grave scene because of a 'spirit dream', he nonetheless is there to show him the way home. In so doing, he witnesses a universal value with Hirate - the passing of life. There's much to be said for good small budget films. The story and direction have to be tightly constrained.",
         "The first time I saw Cold Fever was May of last year. It was in a time when I was lost in life. That's when Cold Fever was coming on HBO. I sat there for 90 mins and I found the film very funny and quite moving. The way everyone keeps asking Atsushi, \"So how do you like Iceland?\" or the characters he runs into. Some of them include Laura, a woman who likes to \"collect\" funerals or American tourists Jack and Jill, who bicker all the time because they disagree on taking a vacation to Iceland. Atsushi first finds this trip as a burden because he was looking forward to going to Hawaii to play golf. Instead, he has to go to Iceland to perform a ritual by the river where his parents drowned. Then, throughout this journey he learns more about himself. He finds some of the strangest people you will meet...a cab driver performing a strange ritual, a girl who restarts his car with a sonic scream, and my favorites, the Islandic Cowboys. When he finally gets his mission accomplished of performing the ritual, he learns that sometimes a journey can take you places that aren't on any map. That is so true. I wanted this movie so bad that I finally received it from Amazon today. It is still as great as when I saw it a year ago. Check this out because it is brilliant.",
         "Cold fever is a very deceptive movie. Not much happens, and what does happens slowly, but it stays with you. Days later I found my mind wandering back to the many characters that go out of their way to assist the hapless Hirata. I've heard that Icelanders really are that helpful, no doubt because the argumentative ones didn't last long in a landscape as hospitable as the surface of Mars. The plot is simple: Hirata travels to the furthermost reaches of Iceland to perform a ceremony honoring his parents, who died in this most improbable location. Basically, if you find this stark implausibility charming instead of annoying, you'll like Cold Fever. It manages to pull off the staggeringly difficult task of being whimsical without being sappy. I love how Hirata is constantly reassured that everyone speaks English but almost nobody does. When he meets new characters on his journey you perk up out of interest because most of them are genuinely interesting. If they're not, well, at least they're dispatched quickly. If a character sticks around for longer than you might like, relax - just enjoy the scenery in the meantime (I suspect the Icelandic Tourism Board had a hand in the script). Definitely worth a look, if only for the unique landscapes.",
         "This film is indeed a beautiful film showing Iceland's many attractions as the previous reviewer mentioned, but it also draws very interesting parallels between the native beliefs of Icelanders, which in fact are quite similar to what prevailed across Europe before Christianity came(Iceland was settled by Vikings and was among the last places Europeans held to their pagan religion), and the Shinto practices in Japan. One accompanies the main character, a shallow, immature corporate executive from his comfortable Tokyo life to Iceland: where layer by layer he is stripped of comfort, certainty, even rationality, until he is brought to a place where he realizes a simple and profound humanity. This film is funny, the cinematography is amazing, and it is spiritually enriching. How many films can you say all that about?",
         "Something about this film has kept me thinking about it since I saw it in 2001. I had the fortunate opportunity to see it because, at that time, Des Moines (Iowa) had one of the best indie-movie rental places (Oddities), ever. Oddities just stocked walls of foreign films and rows of independent films. Cold fever had the intriguing elements of a young Japenese businessman reluctantly, and by family obligation, traveling around Iceland. That was enough for us to want to check it out. The story is tremendous. I love the style and the performances give by the actors. Friðrik Þór Friðriksson really captures the feeling of the main character on film. It is almost haunting how Hirata operates... how he meanders through the vastness of the landscape. Great film, great ending. I wish they would get it on DVD along with other works by the director",
         "Cold Fever is one of those rare films where the hero is on a serious and deeply spiritual quest, yet the drama and the philosophy never overshadows the humor. Within the first 15 minutes of the film's depiction of Hirata's trip through Iceland, he is seen standing in the back of a (very large) truck, riding into Reykjavik with numerous other men - all of which are singing (beautifully) in deep baritone voices, the entire way home. One of the men on the truck turns to Hirata and says: \"How do you like Iceland?\" \"Very strange country.\" Hirata replies, and the actor's expression and tone of voice made it a perfect bit of foreshadowing for everything that lies ahead. This is a story about a man's journey across Iceland to fulfill a family obligation. His parents drowned in a mountain river, and Hirata must go there to free their spirits from the place. However, while the weight of family obligation is what gets him started, and is the goal that keeps him going - the journey, with it's many colorful characters and strange adventures (many of which seem to be born of either luck or a very powerful spiritual guardian seeing this man to his final destination) are what affect and change the man who is on this journey. Yet, despite it's fantastical quality, the film never seems to loose it's suspension of disbelief. In other words, I found myself in awe of the adventure without becoming annoyed by the impossibility of it. My only complaint would be the number of times Hirata decides to just walk away from a cab or a broken down car. 90% of the movie is filmed in Iceland, in the middle of winter, and the reality of walking around in a business suit (with a suitcase, briefcase, and poor walking shoes) wasn't (in my opinion) properly displayed. Anyone who has experienced sheer white snow-blind cold depicted in this movie would be tapping their fingers, wondering why this man isn't dead from exposure. However, I must stress that my single complain is actually a minor one, because it actually enhances the mystical and magical quality of this film. Like I said, Hirata's comment (\"Very strange country\") is a wonderful bit of foreshadowing. Highly recommended.",
         "A friend of mine gave me this video about a year ago. It never took me long to get round to watching it as he told me what a great film it was. The night in question me and my then girlfriend sat in front of the television and nothing was said until an hour and half later. Engrossing, exhausting and enlightening are all words which I would assiocate with this film. It is a great journey of a film starting in Japan and working its way to the empty expance of Iceland the pace is subdued though relentless. It is cultural and mystical, saddening and humorous. It is also one of the best films I've ever seen. It reminds me of a mixture of directors from its style, Jim Jarmusch, David Lynch and Gus Van Sant have all created films in which the same kind of atmosphere can be felt of crowded iscolation. p.s. watch for the gnome in the backround as he walks from the car to the farm.",
         "I saw Cold Fever when it was first released in the U.S. and have been (unsuccessfully so far) looking for it for about 5 years to see it again. Some of the other comments have pointed to the way the Japanese and Icelandic elements--of folklore and spirituality, principally--weave together. I have always thought it was a beautiful homage to Kurosawa and perhaps other Japanese filmmakers, not just in the plot (which others have correctly seen as a \"road movie\") but in the whole pacing and look of the film--the colors, the composition of scenes, the attention to the characters. It's really too bad more people haven't seen it. Hirata's enlightenment through his contacts with other characters who may be real, delusional (he is, in fact, fevered), or actual ghosts or spirits is compelling and thought-provoking for the viewer, who must also question what is \"real,\" as well as what it means.",
         "Masatoshi Nagase (best known for his role in Jarmusch's Mystery Train, and also the Japanese films Suicide Club, The Hidden Blade and Electric Dragon 80.000V) stars as a Japanese man whose grandfather (cult director Seijun Suzuki, who appears for a couple of minutes) insists he spend his vacation performing traditional burial rites of his parents, who died while living in Iceland. Nagase flies to Reykjavik and proceeds to drive across the country in the middle of the winter to the remote spot where they passed. Though they don't go into any details on his parents' death, Iceland seems like a very likely place to die, since it's full of dangerous, unpopulated terrain. This is basically a road movie, where Nagase meets various odd people along his way. It's maybe a bit weirder than most - I'd say it's kind of one of those weird-for-the-sake-of-weird type movies. But Fridriksson does a great job of making his home country look like a world of wonder. \"Iceland is very strange country\" Nagase always says when someone asks him what he thinks of it, in English of course, since it's the common language between him and most Icelanders (I'd say about 80% of the dialogue is in English). The film doesn't really go anywhere plot-wise, and some of the episodes are more successful than others. The most notable flop is the long sequence where Nagase picks up a couple of stranded American tourists, Fisher Stevens and Lili Taylor. Those two are painfully annoying, especially when they talk to each other via their sock puppets. That's really some needless quirk. Overall, though, I was intrigued.",
         "This is really a wonderful film! I might be a little influenced by the fact that I've been to Iceland twice and I loved it (and still do, and pretty surely there's going to be a third time), but I really did feel this movie. The storyline is quite simple and has been well described by other reviewers, so straight to what this movie contains. Well, anybody who's been to Iceland will realize immediately the high grade of realism, both in the landscapes and in the people the main man meets on his way, their attitudes, mentality, way of talking and all the rest. Icelanders really ARE the way you see them in this movie! Also the atmosphere of the country in the winter is perfect, deeply charming in its desolation. But whats gets the most in this film is the humanity of the various characters. The main man is a likable guy, a little stiff in his behaving with the rest of the world, but that might be part of the Japanese culture as far as I know. Completely unlikable the two Americans, who are indeed negative characters, while I loved the old man who befriends the protagonist in the last part of the movie. The deepest humanity is to be found in him. This is a movie that will get stuck into your mind for a very long time, don't miss it!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Icicle",
         "Altar Productions",
         "Film Fonds"
      ],
      "summaries": [
         "Hirata finds himself canceling his vacation plans to Hawaii when his grandfather reminds him of his duty to his parents. Seven years earlier, Hirata's parents had been killed in an accident in Iceland and Japanese tradition holds that their souls will not be at ease until the proper ceremonies have been performed. Thus, Hirata sets out on a journey, a quest to the river where his parents perished. Along the way, in this Icelandic-Japanese road movie, he encounters many difficulties, tough situations, and odd people in the land of fire and ice. Fridrik Thor Fridriksson's vision infuses Iceland's stark and beautiful landscape with a haunting spirituality.",
         "A Japanese businessman travels to Iceland and has a series of misadventures while venturing to a remote area to perform a traditional burial ritual where his parents died several years back."
      ],
      "budget": 130000000
   },
   "movielensId": 649,
   "movielens": {
      "languages": [
         "Deutsch",
         "Íslenska",
         "日本語",
         "English"
      ],
      "releaseDate": "1995-02-10",
      "dvdReleaseDate": null,
      "directors": ["Friðrik Þór Friðriksson"],
      "runtime": 85,
      "movieId": 649,
      "title": "Cold Fever",
      "mpaa": null,
      "actors": [
         "Masatoshi Nagase",
         "Lili Taylor",
         "Fisher Stevens",
         "Gísli Halldórsson",
         "Laura Hughes",
         "Seijun Suzuki",
         "Hiromasa Shimada",
         "Masayuki Sasaki"
      ],
      "imdbMovieId": "0109028",
      "originalTitle": "Á köldum klaka",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["a5l6MbXu6AQ"],
      "plotSummary": "A Japanese businessman travels to Iceland and has a series of misadventures while venturing to a remote area to perform a traditional burial ritual where his parents died several years back.",
      "tmdbMovieId": 68445,
      "avgRating": 3.72603,
      "releaseYear": "1995",
      "numRatings": 146,
      "posterPath": "/4aytLuIicECojFIJCqaLk1fj1rf.jpg"
   }
}