{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "biotope",
            "id": 4166
         },
         {
            "name": "vegetarian",
            "id": 4459
         },
         {
            "name": "pollution",
            "id": 6305
         }
      ],
      "imdb_id": "tt0115683",
      "video": false,
      "title": "Bio-Dome",
      "recommendations": [
         13203,
         10406,
         13595,
         20009,
         12475,
         13997,
         19326,
         14342,
         9429,
         16300,
         13166,
         9612,
         10878,
         9308,
         15413,
         14577,
         14013,
         17745,
         3179,
         10956
      ],
      "backdrop_path": "/qgGwZFb5Vwua90TgJI03Dvwgd7a.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Bud Macintosh",
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d1b",
               "name": "Pauly Shore",
               "profile_path": "/rCoEeH3jmwpNjMHAVv9SchtnNJh.jpg",
               "id": 64998,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Doyle Johnson",
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d1f",
               "name": "Stephen Baldwin",
               "profile_path": "/w2nZjBsEsjboQDZJXEkysuGgue4.jpg",
               "id": 9045,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Monique (as Joey Adams)",
               "gender": 1,
               "credit_id": "52fe4506c3a36847f80b7d23",
               "name": "Joey Lauren Adams",
               "profile_path": "/hQqqcyUvLQwnqBYCdpGZIfKOpmO.jpg",
               "id": 16484,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Jen",
               "gender": 1,
               "credit_id": "52fe4506c3a36847f80b7d27",
               "name": "Teresa Hill",
               "profile_path": "/lUCwVSoh1ETkvNGEiJzgmYYLD4C.jpg",
               "id": 43433,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "Dr. Noah Faulkner",
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7cd5",
               "name": "William Atherton",
               "profile_path": "/ulUP6CRnC3F6XmD3NH0AMJpVmln.jpg",
               "id": 7676,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Mimi Simkins",
               "gender": 1,
               "credit_id": "52fe4506c3a36847f80b7cdd",
               "name": "Dara Tomanovich",
               "profile_path": "/a7o1G7HScIdv2qhVNfUtdpBZChj.jpg",
               "id": 57868,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "T.C. Romulus",
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7ce1",
               "name": "Kevin West",
               "profile_path": "/xkgRvORUYLButBebCpbd09Qg10H.jpg",
               "id": 57869,
               "order": 6
            },
            {
               "cast_id": 2,
               "character": "Olivia Biggs",
               "gender": 1,
               "credit_id": "52fe4506c3a36847f80b7cd9",
               "name": "Denise Dowse",
               "profile_path": "/tZyRCcBphvpg4AjIWD33j4hVBKy.jpg",
               "id": 23970,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Dr. Petra von Kant",
               "gender": 1,
               "credit_id": "52fe4506c3a36847f80b7d2b",
               "name": "Kylie Minogue",
               "profile_path": "/8vOTxDParoNySQrUI2OM9zQkVPu.jpg",
               "id": 12207,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Tenacious D",
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d2f",
               "name": "Kyle Gass",
               "profile_path": "/jSo0tKozbudF78NaR6DCNSXKSP9.jpg",
               "id": 22297,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Tenacious D",
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d33",
               "name": "Jack Black",
               "profile_path": "/vMXgtzMdt2jSAjOECFQ5F53blbr.jpg",
               "id": 70851,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Denise",
               "gender": 1,
               "credit_id": "562cfdbdc3a3681b52007cfd",
               "name": "Rose McGowan",
               "profile_path": "/llI2Fc6G0wqZlASpIEGWnLViZxD.jpg",
               "id": 16850,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Partier",
               "gender": 2,
               "credit_id": "5aaf117cc3a36846bd02d5e5",
               "name": "Christopher Dye",
               "profile_path": null,
               "id": 2001832,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7ce7",
               "name": "Bradley Jenkel",
               "profile_path": null,
               "id": 57871,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7ced",
               "name": "Brad Krevoy",
               "profile_path": null,
               "id": 51702,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7cf3",
               "name": "Steven Stabler",
               "profile_path": null,
               "id": 51703,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4506c3a36847f80b7cf9",
               "name": "Adam Leff",
               "profile_path": null,
               "id": 57872,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4506c3a36847f80b7cff",
               "name": "Mitchell Peck",
               "profile_path": null,
               "id": 57873,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d05",
               "name": "Andrew Gross",
               "profile_path": null,
               "id": 57874,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d0b",
               "name": "Phedon Papamichael",
               "profile_path": "/vsALQXJ7XDO3VPwS4kEYtqqLkeV.jpg",
               "id": 432,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d11",
               "name": "Christopher Greenbury",
               "profile_path": null,
               "id": 7414,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4506c3a36847f80b7d17",
               "name": "Jason Bloom",
               "profile_path": "/fvQhQqGnf4cBq60FiLjeKWvvAqD.jpg",
               "id": 57870,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.954345,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9536,
      "vote_count": 139,
      "budget": 15000000,
      "overview": "Bud and Doyle are two losers who are doing nothing with their lives. Both of their girlfriends are actively involved in saving the environment, but the two friends couldn't care less about saving the Earth. One day, when a group of scientists begin a mission to live inside a \"Bio-Dome\" for a year without outside contact, Bud and Doyle mistakenly become part of the project themselves.",
      "similar": [
         35,
         22538,
         462,
         393519,
         14536,
         11321,
         29343,
         10185,
         415086,
         892,
         62320,
         44113,
         811,
         8989,
         1255,
         39283,
         282297,
         40663,
         16081,
         32646
      ],
      "original_title": "Bio-Dome",
      "runtime": 88,
      "poster_path": "/1bAUaipv3gDU1pATGwziyq1VTwZ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Motion Picture Corporation of America (MPCA)",
            "id": 11061,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Weasel Productions",
            "id": 38003,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "3 Arts Entertainment",
            "id": 787,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-01-12",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "Bud and Doyle are here to save the world. But who's gonna save the world from Bud and Doyle?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jason Bloom"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Adam Leff",
         "Mitchell Peck"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115683/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4NDg0ODQ4Ml5BMl5BanBnXkFtZTcwNDM4MDUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Pauly Shore, Stephen Baldwin, William Atherton | See full cast and crew »"],
      "reviews": [
         "This is a 50/50 movie, you either love it or you hate it. Funny lines are few and far between, but do exist. The rest of the film is just mindless humor that wasn't funny even for mindless humor. Great for Pauly Shore fans and for those who enjoy slapstick comedy. Otherwise the other 99.9% of the population will probably tire quickly of the lame jokes and one dimensional, almost cartoon like characters. You have to wonder why anyone thought it was a good idea to go ahead and make it. The movie ensnares the viewer by opening with a promising start. The movie quickly deteriorates from there. Stephen Baldwin only adds to the overall idiocy. As if one bad actor wasn't enough.",
         "Bio-Dome is an all out failed attempt to make another classic Dumb and Dumber (1994) film. The story is stupid, the acting pitiful, and the comedy, not even present. The story is simple and tries to be a crusade for world ecological preservation but does nothing for the message. The story is terrible. Bud (pauly Shore) and Doyle (Stephen Baldwin) are to morons who have just been ditched by there girl friends and are down on there luck. They take a drive out to a dump to find the girls not cleaning there. On the way back home Doyle has to go to the bathroom so they pull over at what looks like to be a new mall. Instead it is Bio-Dome, an ecological preservation center and now Bud and Doyle are locked inside with four scientists. They cause chaos and homeostasis drops until somehow the idiots realize what they're doing and are able to become top scientists over night. I wanted to to throw up after seeing this. Pauly Shore is annoying beyond belief and Baldwin should really think twice about being an actor or working at a gas station. The film fails on all levels of comedy and acting and should be avoided by everyone. Bio-Dome. Starring: Pauly Shore, Stephen Baldwin, William Atherton, Kylie Minogue, and Denise Dowse. 1/2 out of 5 Stars.",
         "Oh, my mind, my mind, 2+2=4, wait, does it? I think it equals 19? I'm not sure, I've lost so many brain cells while watching this movie. One of my friends had mentioned this movie to me, we were talking about how some stoner flicks are fun, he mentioned Biodome. I had never heard of it, but he said that he saw it once in junior high and it was hilarious, so I was kind of curious to see it. Pauly Shore, the guy is annoying but can sometimes be funny, so I figured I would have an open mind to it. Now here's the thing about this movie that I'm still trying to figure out, I did not laugh once, I didn't even laugh at the sheer stupidity of this film, is that even possible? I just ended up crying so hard after this movie, I couldn't believe how stupid this movie was. When I called my friend, he said that it was funny in junior high at least, I don't know, maybe I did give the film too much credit from the get go, but judging from the rating on IMDb, I don't think I'm alone on how stupid this movie is. Doyle and Bud are best friends who pull a stunt to get out of Earth Day activities with their Earth conscious girlfriends, Monique and Jen. When the girls find out about it, they decide to get even by pretending to have met two men at the event and gave Bud and Doyle a red herring location. The two leave to go after them but soon realize they were fooled. On the way home, they pull off the road at the Bio-Dome, which they mistake for a mall, and are turned away by a security guard at the entrance. They get around this by using firecrackers as a distraction and by the time they are ready to leave, they find they have been sealed inside.The scientists, and chief investor Mr. Dick Leaky, discuss what to do about the situation. Mr. Leaky wants the two out immediately. The scientist in chief, Dr. Noah Faulkner, decides since the experiment depends on the time of one year, they must stay and the system will have to adapt to 7, not 5, people. This soon proves to be a mistake as Bud and Doyle aren't the most environmentally friendly guests. I just will never get how anyone could ever find this movie funny, Stephen Baldwin and Pauly Shore have no chemistry what so ever and their stupidity is more annoying rather than funny. Every scene where they're screwing up something for these scientists made me want to punch them and the fact that the girl scientists(that are Victoria Secret rejects) find them hot is just\u0085 I can't even come up with a word, forgive my low IQ on this one, this is what Bio-Dome has done to me. I really tried to give this movie a chance, I accepted this absurd plot and tried to go with everything, but it's just impossible when the two main characters have no chemistry. At a time when Beavis and Butt-Head were really popular, I think people were trying to cash in on the stoner audience, but while Beavis and Butt-Head were clever and was a stupid funny situation with them, Pauly and Stephen just don't work well together. Just to think of the money spent on this film that could have gone to starving children, the sick, the poor, the homeless, the abused, education\u0085 well, if I continue on what else the money budget could have been spent on, I'm wasting time when I could be reading a novel trying to get my brain cells back. As you can tell, I'm not going to be kind with this rating, believe me, this movie wasted my time and if I ever see the director, I am going to take the DVD case and beat him to death with this movie. 1/10",
         "Sure, the basic premise for this film was absolutely ludicrous, it was still good for a few laughs (and I mean a few). Based on the failed and flawed experiment of Biosphere 2 (which I have been to twice, and even got to look inside), this film proves to be the hard- hitting expose of an experiment which was flawed to begin with. Follow Pauley Shore and Stephen Baldwin as they unearth the cruel and meaningless system set inside the confines of the dark and steely Bio-Dome. What a documentary to watch! Sometimes funny, most of the time stupid, this proved to be one of the last stands for Pauley Shore.",
         "After watching the film \"Bio-Dome\" you feel much better about your intelligence. The major flaws with the film including the fact that the two main characters* never become serious. The film's jokes were corny and overused, and nearly every thing the characters would do were just eye-rollers rather than laughs. The dialogue was rather corny and I did manage to chuckle when one of the characters said \"we need to save the bio-dome\". I recommend after watching this movie, to watch an Oscar-winning movie so this garbage can be cleared from your mind. I give this movie a 2.4, because in order to receive a 1, the film must have horrible editing or be a disgusting porno. (Side notes:) *I have no desire to respect this film and it's character's names.",
         "One of the few movies I couldn't even watch in one sitting, I had to split it up into two. I always despised Pauly Shore, but now I really really can't stand him. There are a few moments where the jokes are relatively funny, but they are few and far between. The only neat thing about it was the overwhelming mid-90's pop culture melting pot, which appealed to my nostalgic side, but even that was squashed by the overpowering obnoxiousness of Pauly Shore. Stephen Baldwin is slightly less annoying than Shore, but not by much, and its sad, because I've seen him in other roles which he played incredibly well. I usually find at least some redeeming features in 'stoner' movies, or even like them-- (the Clerks series, Bill and Ted, etc.)-- but this movie is just really bad. The supposed protagonists are so idiotic and obnoxious that its painful to watch.",
         "I used to love this movie as a kid, and now I have no idea why. Maybe it's because, at the age of 10, I enjoyed watching grown men act younger than me. Look back on your own childhood and you likely enjoyed a few movies with that quality for that very reason. There is not one funny part in this movie. Seriously, not one. I've even re-watched it stoned (let's be honest, it was probably made to be viewed that way) just to see if the altered perception would make it any better, and it actually killed my buzz. Pauly Shore and one of the Baldwins that's not Alec seem to be in a pissing contest to see who can come off as more talentless. In the end, it's too close to call, so they both win (or lose, however you wanna look at it). The only reason I gave this movie 2 stars is because I tend to throw in an extra star if there is nostalgia associated with it. If you're in the mood for this kind of movie, you'd be better off watching Encino Man, even if you've seen it already.",
         "I love film and I love comedy when it is done right. When I watched Bio-Dome, I wasn't expecting a masterpiece. Just a fun film, or a film that was kind of bad but it was a kind of guilty pleasure. Instead, Bio-Dome is excruciatingly awful with little redeeming values. The acting is terrible. Pauly Shore is a real problem with this movie, I never liked his acting style and this movie has done nothing for me to say otherwise. He is annoying to the point that I wanted to reach into the television and put a hand over his mouth. Stephen Baldwin fares no better, all he does is act gormless, clueless and annoying and the shtick dies fast. What's even worse is that the chemistry between the two men is non-existent. Joey Lauren Adams is the sole bright spot. Another major failing is the humour. The humour just ruins Bio-Dome just on its own. It isn't just the diabolical script but also the unfunny jokes and slip-shod, juvenile physical comedy. The pace is often too rushed, the direction is awful and the story is incredibly predictable and made of a series of disconnected sequences. The characters are badly written and very clichéd and one-dimensional, and emotionally I couldn't engage with them on any conceivable level. The film looks cheap as well, and musically the movie is very forgettable. In conclusion, a real mess of a comedy and of a film that fails in every asset. While not the worst movie I've seen, it is certainly one of the most annoying. 1/10 Bethany Cox",
         "There are worse things to do with your time then watch this movie, but unfortunately i don't know what those things are. Because committing yourself to ninety minutes of this crap is enough to go on a maniac killing spree. Now its no \"Batman and Robin\". But its so bad its terrible and that takes much, well maybe just Pauly Shore and a low rung Baldwin. I was really impressed looking on here that there are so many people involved with this movie, i mean its got the supporting cast equivalent to a \"Cop Land\". I just hope these \"actors\" if you want to consider them professionals got paid millions to do this so they could disappear but it doesn't seem likely cause i still see their dirty faces in other movies and t.v. shows. Now we all have low points, and people need to eat and pay bills i guess so projects like this start rolling. I actually saw this in the theaters when it came out. I was in middle school and on a double date with my friend. The whole place was empty so me and the girl were off somewhere trying to make out when ten \"dudes\" sit in the row behind us. God i hate this movie, kill the weez, he must not sip the juice! One frikken stah, awful, just terrible.",
         "One of the most God awful movies I've ever seen . It's about frickin' time Pauly Shore was kept from making cinematic crap after this turd ball. When this movie came out to theaters and not even seeing any previews I sensed it was going to be a stinker, since I saw most of Pauly Shore's previous movies and had yet to utter even a single laugh or chuckle. Jury Duty was only mildly amusing, Son In Law sucked,In The Army Now sucked. I enjoy stupid humor but stupid with no humor is just plain annoying, and that's what you get with a Pauly Shore movie. Now if we can just get Adam Sandler to follow suit. Stay away from this movie unless you have a death wish."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Motion Picture Corporation of America (MPCA)",
         "Weasel Productions",
         "3 Arts Entertainment"
      ],
      "summaries": [
         "Bud and Doyle are two losers who are doing nothing with their lives. Both of their girlfriends are actively involved in saving the environment, but the two friends could care less about saving the Earth. One day, when a group of scientists begin a mission to live inside a \"Bio-Dome\" for a year without outside contact, Bud and Doyle mistakingly become part of the project themselves. The two must then learn how to protect the Earth and help the scientists complete their mission.",
         "Moronic best friends get themselves locked inside the Bio-Dome, a science experiment, along with a group of environmental scientists for one year."
      ],
      "budget": 15000000
   },
   "movielensId": 65,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "1996-01-12",
      "dvdReleaseDate": "2002-04-16",
      "directors": ["Jason Bloom"],
      "runtime": 88,
      "movieId": 65,
      "title": "Bio-Dome",
      "mpaa": "PG-13",
      "actors": [
         "Pauly Shore",
         "Stephen Baldwin",
         "Joey Lauren Adams",
         "Teresa Hill",
         "William Atherton",
         "Dara Tomanovich",
         "Kevin West",
         "Denise Dowse",
         "Kylie Minogue",
         "Kyle Gass",
         "Jack Black",
         "Rose McGowan"
      ],
      "imdbMovieId": "0115683",
      "originalTitle": "Bio-Dome",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["9J6qOSUJXy0"],
      "plotSummary": "Bud and Doyle are two losers who are doing nothing with their lives. Both of their girlfriends are actively involved in saving the environment, but the two friends couldn't care less about saving the Earth. One day, when a group of scientists begin a mission to live inside a \"Bio-Dome\" for a year without outside contact, Bud and Doyle mistakenly become part of the project themselves.",
      "tmdbMovieId": 9536,
      "avgRating": 2.4005,
      "releaseYear": "1996",
      "numRatings": 5814,
      "posterPath": "/1bAUaipv3gDU1pATGwziyq1VTwZ.jpg"
   }
}