{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shipwreck",
            "id": 2580
         },
         {
            "name": "reunion",
            "id": 9824
         },
         {
            "name": "death of husband",
            "id": 175421
         },
         {
            "name": "evil priest",
            "id": 208555
         },
         {
            "name": "mother daughter reunion",
            "id": 208556
         }
      ],
      "imdb_id": "tt0117071",
      "video": false,
      "title": "Moll Flanders",
      "recommendations": [
         53063,
         46301,
         36290,
         56087,
         24585,
         102059,
         56920,
         32855
      ],
      "backdrop_path": "/xR2pjNUV83ha3x7AN9ksvMDjY1f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Moll Flanders",
               "gender": 1,
               "credit_id": "52fe47b19251416c750a241d",
               "name": "Robin Wright",
               "profile_path": "/tXfQTgcIEPP7gtVdJ44ZxZPhacn.jpg",
               "id": 32,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Hibble",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2415",
               "name": "Morgan Freeman",
               "profile_path": "/oGJQhOpT8S1M56tvSsbEBePV5O1.jpg",
               "id": 192,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mrs. Allworthy",
               "gender": 1,
               "credit_id": "52fe47b19251416c750a2419",
               "name": "Stockard Channing",
               "profile_path": "/5UFMOfbzod42UiPUna59Ch1e37a.jpg",
               "id": 8893,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Fielding",
               "gender": 2,
               "credit_id": "542de63bc3a36859e2000a95",
               "name": "John Lynch",
               "profile_path": "/2OHQ4Hck4QlCqDjQ4mK6OMW65n3.jpg",
               "id": 28743,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "madame Mazzawatty",
               "gender": 1,
               "credit_id": "542de648c3a36859d0000a5f",
               "name": "Brenda Fricker",
               "profile_path": "/z2ARJBvxE1mCwQ6XARTKvvPQySu.jpg",
               "id": 18345,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Edna",
               "gender": 1,
               "credit_id": "542de6540e0a261fd5000ace",
               "name": "Geraldine James",
               "profile_path": "/uRapxZIWwfcmOl2rzlz77oCC1e4.jpg",
               "id": 11855,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "le prêtre",
               "gender": 2,
               "credit_id": "542de6b90e0a261fe5000ad6",
               "name": "Jim Sheridan",
               "profile_path": "/mfukw1JcUsXmUzt6IoaayMaescv.jpg",
               "id": 53334,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Flora",
               "gender": 0,
               "credit_id": "54637581c3a36812590022dd",
               "name": "Aisling Corcoran",
               "profile_path": null,
               "id": 1384850,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2411",
               "name": "Pen Densham",
               "profile_path": null,
               "id": 2182,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5463752bc3a36812590022d1",
               "name": "Daniel Defoe",
               "profile_path": null,
               "id": 52588,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "54637539c3a368125c002345",
               "name": "Pen Densham",
               "profile_path": null,
               "id": 2182,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5463753e0e0a2677fd0023c4",
               "name": "Pen Densham",
               "profile_path": null,
               "id": 2182,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.684811,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18989,
      "vote_count": 25,
      "budget": 0,
      "overview": "The daughter of a thief, young Moll is placed in the care of a nunnery after the execution of her mother. However, the actions of an abusive priest lead Moll to rebel as a teenager, escaping to the dangerous streets of London. Further misfortunes drive her to accept a job as a prostitute from the conniving Mrs. Allworthy. It is there that Moll first meets Hibble, who is working as Allworthy's servant but takes a special interest in the young woman's well-being. With his help, she retains hope for the future, ultimately falling in love with an unconventional artist who promises the possibility of romantic happiness.",
      "similar": [
         597,
         205775,
         87827,
         244772,
         8358,
         82702,
         285,
         578,
         810,
         5689,
         3580,
         347031,
         421044,
         10488,
         11968,
         84174,
         10022,
         27902,
         1273,
         3989
      ],
      "original_title": "Moll Flanders",
      "runtime": 123,
      "poster_path": "/xR1Whba2hyUpKCa0FE18hVCG9jb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Trilogy Entertainment Group",
            "id": 2231,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Spelling Films",
            "id": 10355,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-06-14",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "The remarkable story of one woman's unbreakable spirit.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pen Densham"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Daniel Defoe",
         "Pen Densham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117071/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNzA0NDU3OV5BMl5BanBnXkFtZTYwMDExODg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robin Wright, Morgan Freeman, Stockard Channing | See full cast and crew »"],
      "reviews": [
         "This film, though nothing like the Daniel Defoe novel, was remarkably good. The tale begins with Flora, an orphan removed from her home in a convent in Europe, who is told that she is being taken to the Americas to become the ward of one Mrs. Allworthy, who is credited to have been the woman her mother served. Mrs. Allworthy's manservant and confidant, Hibble, is the one who is to both bear her to his employer, and also to read to Flora the diary of her mother, Moll Flanders, to explain her life to her. Robin Wright shines as the lost and ever soul-searching innocent Moll Flanders, who despite making many wrong choices in life seems to find her way to kind places again and again. Her unconditionally loving future husband, credited \"The Artist\" on screen but listed as John Fielding on this site, is played by John Lynch. Stockard Channing is Mrs. Allworthy, who we come to discover is the owner of a Bordello and is a manipulative woman who can sway any man into her power. Lastly, Morgan Freeman plays the part of gentle and world-wisened Hibble, and I think this is one of his best roles, as he interacts so swimmingly with Robin on camera. The movie is rated PG-13 for sexual situations, nudity and some violence. Despite the subject matter, the film charms the soul. I recommend lovers of Gothic literature to read it, and for people who love the book to give this story a chance as a separate entity.",
         "Morgan Freeman uses his immense talent to give varied facets to Mr. Hibble, Stockard Channing is deliciously evil as Mrs. Allworthy, and Robin Wright Penn shines like a diamond in the role of Moll Flanders. Even the child playing Flora does a charming job with her limited part. Some viewers complained that the film was slow moving, but i felt the transitions from \"modern day\" to \"flashbacks\" from the memoir written by the title character kept things moving along quite nicely. Having not read Defoe's book, I cannot compare it to this version, but members here seem about equally divided between hating the movie for not being true to the book, and feeling that the changes made are an improvement on the original. Personally, I'd recommend this movie highly to anyone who has time to watch it.",
         "The performances in this film are, for the most part, worthwhile. Robin Wright is radiant, Morgan Freeman solid, and Stockard Channing makes the most of her role, to the point that I think it was worthy of an Oscar nomination. (Why is this woman's craftsmanship so underrated? I'd like to know...) And I liked John Lynch as the artist. But there are some really dull stretches here that might have been helped with more secure, tighter writing. This was a colorful era -- and the costumes and settings in the film seem appropriate -- but the story is so bland that I found myself nodding off from time to time. -- The biggest puzzle to me is : Why call it \"Moll Flanders\" after Daniel Defoe's book/heroine, when the story is ABSOLUTELY NOTHING LIKE the book? Overall, a disappointment. There's some good meat in this stew, but, in the end, it makes for only so-so movie-watching...",
         "The plot of this film has nearly nothing whatsoever to do with Daniel Defoe's novel; in place of Defoe's brilliant and compelling heroine it substitutes bushels full of ersatz-18th century drivel, pretentious neo-Irish music, and annoying children. Nunneries in England? An unexplained Afro-British man sent on a mission to read a book to an annoying child across the sea? A charitable organization which adopts adult women only if they are virgins? I am certain that if one made a film of \"A Christmas Carol\" with no Scrooge, no Tiny Tim, and Bob Cratchit as an alcoholic schoolmaster with an illegitimate one-legged daughter living in Sweden, viewers would complain that the story had gone missing -- why not here? It's a shame, as Morgan Freeman gives a memorable performance even in a role which seems dislocated from history, novelistic and actual.",
         "A tale of one woman's journey through her own life of desperation and consequence. This film follows the heroine, Moll Flanders, through her diary left to her daughter via its caretaker Hibble played masterfully by Morgan Freeman. A true testament to the indomitable spirit of mankind, or in this case womankind. I highly recommend this film.",
         "Yet again Hollywood takes a literary classic and entirely reworks it. \"The daughter of a thief, young Moll is placed in the care of a nunnery after the execution of her mother. However, the actions of an abusive priest lead Moll to rebel as a teenager, escaping to the dangerous streets of London.\" No, this doesn't happen at all. The novel she is handed off to family when her mother is sent to plantations a much more common sentence for criminals at that time when their crime was petty. Further when she was given to family of her mother she then made her way in to the hands of gypsies before being found in Colchester having run off and being taken in by the local Parish. Not \"the streets of London\" right off the bat. Completely different tone, I understand the need to revise a work for the screen as it may be unworkable from it's original form but this is just an example of another movie where they've reworked the material needlessly and changed the subject matter much to the detriment of the work making the character much more sympathetic. Sad thing is it's a habit of Hollywood that will surely not change.",
         "This movie is very special. Congratulation to everyone who was involved ! Most of the credit is due to Robin Wright in the title role of Moll Flanders. She gives one of the most memorable performances in movie history. So please sit back and enjoy the godsend on-screen-presence of Miss Robin Wright. Her talent and beauty is a gift to the movies and should be honored with more than just the Golden Satellite Award nomination she received for playing this challenging and complex part with such a brilliance. The movie owes its authenticity to her excellent acting abilities. The part of Hibble is played by the gorgeous Morgan Freeman. He is not only very believable but also very strong and equivalent to the remarkable Wright. To give you an impression of the richness and elegance this film contains, I will describe some of the most poignant moments of this masterpiece: -When Morgan Freeman reads the memories of Moll to her daughter, his voice suddenly changes into Robin Wright telling her story from her birth to running away from the convent. When she escapes this prison you live to see one of the most illustrious scenes in movie history crowning in her fountain-bathing (movie cover). -Another very special moment is when the artist (John Lynch in a wonderful performance) asks Moll what she expects from life and she answers : \"Nothing any more\". When she tells him that, Robin Wright is both breathtaking and lovely. Expressing a feeling was never more credible before. -Robin Wright also copes superbly with whe difficult situation when Morgan Freeman tells her that he didn't find her baby. This is a very emotional and toughing scene. -the thunder-storm-sequence is full of tension and very realistic -Robin Wright dancing in front of her adoptive family is a gift from director Pen Densham to his viewers. His ability of both giving Robin Wright enough room to develop her character and never losing track of his own ideas is unique. Would have deserved at least a best director nomination... -One of Robin Wright's most enjoyable scenes is the one where she refuses a piece of jewellery to confirm her love for John Lynch. \"All my life I dreamed about this moment...but no one can separate me from this man, unless he wants me to leave him. I love him enough to do that. But you can't buy me...\" This is one magical moment in movie history. -When Stockard Channing's Mrs. Allworthy (she is unique, too) and Robin Wright's Moll Flanders meet for the first time, you are part of a magic moment, too. It's both funny and heart rending to see Moll netted by the villain. Although the movie is a false interpretation of Daniel Dafoe's classic book, it tells a timeless and classic story about one woman's unbreakable spirit (that's what the cover tells you and that is true), so don't miss the opportunity to see this irresistible and convincing film and enjoy the full cast: Robin Wright in a performance awards are made for, Stockard Channing and Morgan Freeman. 10 out of 10",
         "The main problem with this film is that it calls itself \"Moll Flanders.\" It has very little to do with the Defoe novel. Moll Flanders, who in the novel appears as a resourceful, intelligent, fun-loving and talented woman is transformed here into a helpless fallen angel who has little control over her own fate. There is no mention in this film of her many husbands (as well as the clever ways she obtained them), her thieving career, her other children, her mother and brother, and generally everything else in the novel that was entertaining and meaningful. Robin Wright Penn is boring and anemic in a role that demands the opposite. Sentimental Hollywood has never before ruined a good story with such skill. If you want to get the full flavor of this great novel, do yourself a favor and watch instead the British adaptation with Alex Kingston, also from 1996.",
         "Daniel Defoe would be mortified if he knew that his delightful novel, full of energy and wisdom, was the basis for this plodding, sentimental film. Stockard Channing is delightful to watch in her role... if you mute the sound, so that you aren't forced to endure the dialogue. Other fine actors are wasted also, including Morgan Freeman looking like he's costarring in Battlefield Earth and knows it. Use this film only as a cure for insomnia. Watch the 1995 British made-for-tv adaptation instead; it does everything right that this film does wrong.",
         "When I watched \"Moll Flanders\", it was impossible not to cry... it's just one of those movies. A sweet and sad film, the title character was excellently played by Robin Wright. Some might find it overly emotional, but I found it very enjoyable in its tenderness. My only displeasure with this movie is that it is not true to the story in Defoe's wonderful novel \"Moll Flanders\"; it is true to the novel only in the spirit of the character Moll Flanders. To say the movie was a loose interpretation is not adequate; it's much more of a new story using the old character of Moll Flanders. Defoe's work has a different (and I find, more entertaining) style as well as a richer plot line. Mobil Masterpiece's presentation of \"Moll Flanders\" (with Alex Kingston in the title role) is much truer to the novel. I found it much more entertaining and much less sentimental. However, it doesn't have the gut-wrenching emotion of this \"Moll Flanders\". Each viewer will have to pick their own favorite."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Spelling Films",
         "Trilogy Entertainment Group"
      ],
      "summaries": ["The daughter of a thief, young Moll is placed in the care of a nunnery after the execution of her mother. However, the actions of an abusive priest lead Moll to rebel as a teenager, escaping to the dangerous streets of London. Further misfortunes drive her to accept a job as a prostitute from the conniving Mrs. Allworthy. It is there that Moll first meets Hibble, who is working as Allworthy's servant but takes a special interest in the young woman's well-being. With his help, she retains hope for the future, ultimately falling in love with an unconventional artist who promises the possibility of romantic happiness."],
      "budget": 0
   },
   "movielensId": 650,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-06-14",
      "dvdReleaseDate": "2001-10-02",
      "directors": ["Pen Densham"],
      "runtime": 123,
      "movieId": 650,
      "title": "Moll Flanders",
      "mpaa": "PG-13",
      "actors": [
         "Robin Wright",
         "Morgan Freeman",
         "Stockard Channing",
         "John Lynch",
         "Brenda Fricker",
         "Geraldine James",
         "Jim Sheridan",
         "Aisling Corcoran"
      ],
      "imdbMovieId": "0117071",
      "originalTitle": "Moll Flanders",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Ac1GR0lO3hg"],
      "plotSummary": "The daughter of a thief, young Moll is placed in the care of a nunnery after the execution of her mother. However, the actions of an abusive priest lead Moll to rebel as a teenager, escaping to the dangerous streets of London. Further misfortunes drive her to accept a job as a prostitute from the conniving Mrs. Allworthy. It is there that Moll first meets Hibble, who is working as Allworthy's servant but takes a special interest in the young woman's well-being. With his help, she retains hope for the future, ultimately falling in love with an unconventional artist who promises the possibility of romantic happiness.",
      "tmdbMovieId": 18989,
      "avgRating": 3.46205,
      "releaseYear": "1996",
      "numRatings": 1489,
      "posterPath": "/xR1Whba2hyUpKCa0FE18hVCG9jb.jpg"
   }
}