{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "slapstick",
            "id": 9253
         },
         {
            "name": "mischief",
            "id": 15075
         },
         {
            "name": "disguise",
            "id": 18118
         },
         {
            "name": "old friends",
            "id": 163180
         },
         {
            "name": "prize money",
            "id": 163223
         },
         {
            "name": "interracial friendship",
            "id": 165583
         }
      ],
      "imdb_id": "tt0111787",
      "video": false,
      "title": "Yankee Zulu",
      "recommendations": [],
      "backdrop_path": "/b49RSa8bVobFEQPyqBjrC01X7gD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Rhino Labuschagne",
               "gender": 0,
               "credit_id": "52fe46d29251416c75084a11",
               "name": "Leon Schuster",
               "profile_path": "/304Fh3xKuHZ2Lg08qAMmoF3syki.jpg",
               "id": 80524,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Zulu Mashabela",
               "gender": 2,
               "credit_id": "52fe46d29251416c75084a15",
               "name": "John Matshikiza",
               "profile_path": "/7XYFWU0NaoZLelQrPBxiJ1xOAbQ.jpg",
               "id": 77681,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Captain Diehard",
               "gender": 2,
               "credit_id": "52fe46d29251416c75084a1d",
               "name": "Wilson Dunster",
               "profile_path": "/wzKX4uV3qUc8bQsAsL12ogCk0fg.jpg",
               "id": 147823,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rowena Labuschagne",
               "gender": 1,
               "credit_id": "52fe46d29251416c75084a21",
               "name": "Terri Treas",
               "profile_path": "/4wIZe29qcOruk0sktvvGIhL56LX.jpg",
               "id": 103582,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Tienkie Labuschagne",
               "gender": 0,
               "credit_id": "52fe46d29251416c75084a19",
               "name": "Michelle Bowes",
               "profile_path": null,
               "id": 80530,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Uncle Bok",
               "gender": 0,
               "credit_id": "52fe46d29251416c75084a25",
               "name": "Tolla Van Der Merwe",
               "profile_path": "/coG1NZB15xVYgbqCQmZPRdO2GRO.jpg",
               "id": 80525,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Prince Charles",
               "gender": 0,
               "credit_id": "537713db0e0a26142800176d",
               "name": "Peter Hugo",
               "profile_path": null,
               "id": 1267471,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Prince William",
               "gender": 0,
               "credit_id": "537713f70e0a261428001772",
               "name": "Skye Svorinic",
               "profile_path": null,
               "id": 1320521,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Young Rhino",
               "gender": 0,
               "credit_id": "537714130e0a26141c00185b",
               "name": "Ruan Mandelstam",
               "profile_path": null,
               "id": 1320522,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Young Zulu",
               "gender": 0,
               "credit_id": "537714250e0a26141600184f",
               "name": "Bobo Seritsani",
               "profile_path": null,
               "id": 1320523,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Young Rowena",
               "gender": 0,
               "credit_id": "5377143e0e0a26141c001861",
               "name": "Marie Van Deventer",
               "profile_path": null,
               "id": 1320524,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46d29251416c75084a0d",
               "name": "Gray Hofmeyr",
               "profile_path": null,
               "id": 80526,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "537712ef0e0a26141600182c",
               "name": "Leon Schuster",
               "profile_path": "/304Fh3xKuHZ2Lg08qAMmoF3syki.jpg",
               "id": 80524,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5377133c0e0a261416001832",
               "name": "Edgar Bold",
               "profile_path": null,
               "id": 1158708,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "537713540e0a261416001836",
               "name": "Andre Scholtz",
               "profile_path": null,
               "id": 383819,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53e54fb3c3a368443c000106",
               "name": "James Robb",
               "profile_path": null,
               "id": 1273378,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5838bfcfc3a36872c100068c",
               "name": "Leon Schuster",
               "profile_path": "/304Fh3xKuHZ2Lg08qAMmoF3syki.jpg",
               "id": 80524,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5838bfeec3a36872bb00069e",
               "name": "Craig Gardner",
               "profile_path": null,
               "id": 83460,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56cf7a5fc3a3681e39003629",
               "name": "Stanislas Syrewicz",
               "profile_path": null,
               "id": 69101,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "56cf7a689251413e620039d5",
               "name": "Zane Cronjé",
               "profile_path": null,
               "id": 1320525,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5838bfa9c3a36872b4000641",
               "name": "Gray Hofmeyr",
               "profile_path": null,
               "id": 80526,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.501868,
      "production_countries": [{
         "iso_3166_1": "ZA",
         "name": "South Africa"
      }],
      "id": 16417,
      "vote_count": 5,
      "budget": 0,
      "overview": "Two South African boys, one white, Rhino, and one black, Zulu, go their separate ways after an incident. Many years later, they meet up again as adults, when one, after living for years in the United States, is now a wanted criminal. The two end up being a part of a madcap chase involving a check for a large amount of lottery money, pursued by Gen. Diehard and Rhino's ex-wife Rowena, who was the cause of the rift between the two protagonists.",
      "similar": [
         19698,
         10246,
         23919,
         28333,
         19133,
         15788,
         47508,
         115029,
         115805,
         137421,
         115781,
         115801,
         191926,
         115771,
         115804,
         513937,
         138919,
         267151,
         263493,
         266587
      ],
      "original_title": "Yankee Zulu",
      "runtime": 100,
      "poster_path": "/jO8pKUjBMqkaoBHY0EXLYWSmvth.jpg",
      "spoken_languages": [
         {
            "name": "Afrikaans",
            "iso_639_1": "af"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Koukus Troika",
            "id": 38208,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Distant Horizons",
            "id": 1066,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Toron Screen Corporation",
            "id": 38209,
            "origin_country": ""
         }
      ],
      "release_date": "1993-12-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "If the gods were crazy... now they're berserk.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Africa",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gray Hofmeyr"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Leon Schuster",
         "Leon Schuster"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111787/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2MDUyNDc4MV5BMl5BanBnXkFtZTYwNjU3MDg4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leon Schuster, John Matshikiza, Wilson Dunster | See full cast and crew »"],
      "reviews": [
         "When the movie first started with a shot soon after of the butts of 2 friends, a white and black boy running into the water naked I knew it would be an \"unusal\" movie. And then we see a scene of a fat man taking a shat in the field... and the kids sneaking up with a shovel, relocating it somewhere else. He gets up, looks down and its not there! He looks around stunned, checks his clothes. The kids laugh out loud, he notices them. \"Hey you little rascals! I'm gonna murder you, come here!\" When I first saw what he was doing as the kids did I thought it was disgusting. But then it was absolutely hilarious! Especially the way its acted out and with the music. He raves his experience to a fat woman. \"I stood up, there was nothing! I looked around... nothing! Then I had realized what had happened...\" All while the kids watch in continuing laughter and enjoyment from a distance. The fat lady gets mad, steals a bike and chases after them. The black boy whips a piece of something in her face. She hits a rock and falls into the pond. Next scene we see her furiously spanking the kids in the butt with a wipe. Even thats funny! And these are the first few minutes. The whole movie is like that. I knew I was in for a unique ride. The movie is a collection/collaboration of so many outrageously funny, original, witty, creative, and entertaining scenes, shots, moments, and predicaments (all ingeniously intertwined together) that I can not even begin to tell you about all of them. I will not spoil it. The only thing you must do is see it from beginning to end, all 90 minutes, over and over again. It is overwhelming. But in a good way. A real treat. You will see things you have never seen before. Or could ever imagine. The funniest of things. It will surprise you... pleasantly. This is the comedy/adventure you've been waiting for. The comedy to end all comedies. With a script achieving no less than brilliance. The conversation about the conception that everything black is bad is brilliant. The German \"Die Hard\" guy was hilarious. All the characters, their interaction, and roll in the plot are amazingly well done. With a grand, grand final. They threw everything in but the sink. Yankee Zulu... nothing short of a masterpiece. And nothing else like it. After watching it I know now that Leon Schuster is THE funniest and most underrated man in the business. He bares an striking resemblance to Marius Weyers, the star of The Gods Must Be Crazy. The film which he was definitely influenced by. Maybe even out-does it here! Ignore anything they say about it on IMDb. Actually they have some funny reviews denouncing it. Why? I don't know. Funny on another level. It's not like they have much on it anyways on there. It's an upside down market where the good films are not seen, and the bad films are. Well at least not in my case. There is nothing more preposterous and shocking than the poor treatment/attention this film has received. I paid 5 dollars for this, I would have easily paid 100. I hit upon the DVD at the grocery store. I have to admit, I almost didn't buy it. I looked at it and was afraid it might be shat. It was a miracle I ended up walking away with it. Not knowing I was walking away with so much. An instant top fave that will stay close to me till I die. You don't know what you are missing. I am now Yankee Zulu CRAZY. Forever Yankee Zulu.",
         "I agree with many of the people who posted comments here that are from SA. This movie is based on South African Humour, the acting isn't as bad as most people say, many people just doesn't understand this type of humour. The movie was released in 1993, people must understand this was a really volatile difficult time in SA, and to have such a movie released, that clearly stretches racial barriers was a great risk, but it was worth it. Both Black and White South Africans found this extremely funny, and in a way it was able to overcome most racial barriers of the time. I have asked many of my black friends if they weren't offended when they watched it the first time and most said that they weren't, simply because it poked fun at all races. It was hilarious, and I have to agree, the best work of both actors' careers. I can't see many people in other countries truly enjoying this if they don't understand South African Culture, but if you did enjoy it I'm really glad! Again, this was made for a South African Audience on a small budget, that said, it still stays one of my favourite movies!",
         "this movie is a hilarious and side splitting humorous comedy that our whole family has enjoyed for many years. we have seen this spectacular movie time and time again and seem to cant get enough of yankee zulu. my all time favourite scene in yankee zulu is when the poacher is buried to his knees and wakes up to find a lion eating, a gazelle leg which he thought was his own leg because of the blood spread on his knees. this is such a spectacular master piece and a must to everyone who enjoys a good side splitting comedy. it is a very immature movie but it brings out the child in everyone. if u disagree with this comment you have lost your inner child. from the pryor family",
         "Although I'm not South African I found this movie very funny.This is based on real facts in South Africa.This is black people come from poor backgrounds and white people come from much richer background.This has got African humour that mostly I don't think Americans and British people will understand it.But overall it was a great movie.Its a classic African comedy movie.Although a lot of people complained about the acting skills, I disagree.I thought they were great because this was like the actors first official movie.The ones before were made from a very low budget.This was Leon Schuster and John Matshikiza at their best.",
         "Everything is relative. This film may not be a million-dollar budget blockbuster, but it is still very funny. Former reviews say that you need to live in South Africa to understand the movie. I say that it not needed. I live in Sweden, and I still laughed until my stomach ached! However, this is not really a family movie. Younger kids may not understand the racism-related jokes... I say that it's worth checking out. It's one and a half hour of cheap entertainment. Give it a shot. You might actually like it... =)",
         "For those North Americans interested in watching this movie please be aware that South Africa is not North America and therefore the humour is suited to a SOUTH African audience, so if you are offended by South African crudeness then this movie may not be for you. Typical of any Leon Schuster movie, there will be crudeness, some innuendos, and also some silly pranks. It does poke fun at the situation in apartheid era South Africa without any racist sentiment (for those who fear that it may contain some). For those interested in a true slapstick comedy who have an open mind then this movie's well worth a try. Along with Leon's others its a true South African classic.",
         "This is a very typical South African slapstick comedy. There will be people turned off by it, and others who think it's great. As for me, I rank it pretty good. The plot is pretty simple, The good guys, one white and the other black have stolen a winning lottery ticket from the leader of a Neo-Nazi group (Terri Treas, better known as Cathy Frankel in the TV series Alien Nation, is the Neo Nazi's wife and co-leader of the group) who want it back. As part of their escape plans they use makeup to change their race. (In South Africa, this was a big deal.) The humor is coarse and somewhat racially based, but I laughed a lot as did the friends also watching. The version of the movie I have claims that this is Part IV of The Gods Must be Crazy. I'm not sure just why as there is another completely different movie that also claims to be Part IV. Then again, when the Gods are really crazy....",
         "...especially comparing to other modern (same genre) movies. The jokes may not always be funny, but they are far from being vulgar as in many others (mainstream, Hollywood) comedies which use far more body function jokes. The acting doesn't have many highlights, but if you're prepared that you won't see Jack Lemmon or Cary Grant you won't be disappointed. And, considering when the movie was made, racial relations humor is quite good balanced. Obviously political correctness (thank God) was not necessary to release it. However, the whole construction is much worse balanced. It looks as if at least four writers and four directors made short movies and then just leaned (not even connected) them to release it as one single film. In the beginning we have an almost romantic coming-to-age part made in European (French or Swedish) style. When characters become adults we get a story with well included jokes made as USA authors were doing when average target audience was still older then 12, and for me this is the best part. Third quarter becomes a slapstick comedy, but if the authors came quite close to the best in the first half, they are far far behind trying to look like Mel Brooks or Peter Sellers. And, who knows why, finally we get a cartoon comedy, a copy of 'Home Alone'. Suddenly a male and female clone of Culkin, barely seen before, become main stars of the final quarter and finish movie with all lack of logic and reality (already damaged in slapstick part in neonazi house) that Home-alone-type of movies suffers from. And that's probably when your kids will enjoy more than you. But I don't understand why some comments suggest that this movie might not be appropriate for children. If you let them see 'Home Alone'... (not to mention all those, mostly Japanese cartoons). At least you can watch it with them (maybe explain something if you live in a different culture) without feeling a long tail and long ears growing on you, the feeling so often appearing during many block-buster (teen) comedies.",
         "I personally don't agree to some of the reviews I have read about \"Yankee Zulu\" or There's A Zulu on my Stoep (as I know it!). Set and made in South Africa, it is clearly targeted at a South African audience. Being South African myself, I really liked the movie, and would encourage anyone to see it, but I do warn that like any culture, we have our own sense of humor, and people might find it to be \"dreck\", as said by a reviewer here on IMDB, but for some people it is funny and they are surely allowed to have movies to watch too, aren't they? The probable reason why it was released in countries like the USA and Britain is probably so that South Africans there can see it too, I don't know, but I just think it has to be considered that people find different things funny, and personally I find it to be very good, but see it for yourself, see what you think.",
         "I couldn't disagree more with many reviewers who say that you have to be South African to understand or enjoy this movie. I'm a Brit who's just watched this movie with my Zimbabwean wife, and i fell about laughing almost the whole way through. It's just so funny and pokes fun at just about everyone, i mean there's the potential to offend several races or colours in this film, but if you have a sense of humour you'll understand it's actually a clever movie that blends satire,slapstick,gross out,political,culture and gender based jokes into one great big funny melting pot. But it almost feels affectionately insulting and i for one am fed up with Political correctness anyway,the Prince Charles and Camilla sequences were funny despite the sensitivity of that story. But the last half hour is pure classic slapstick physical comedy, its like watching a blend of Laurel and Hardy meets Home Alone in the African bush. I can't say a bad word about this movie, it's one of the funniest i've seen in years. I will watch this again and again...treat yourself and buy it and prepare to be all laughed out afterwards !!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Distant Horizon",
         "Toron Screen Corporation",
         "Koukus Troika"
      ],
      "summaries": [
         "As children, Rhino and Zulu were best friends, until an incident causes them to go their separate ways. They meet up again as adults when Zulu, who has spent years in the United States, has become a wanted criminal. They get involved in a madcap chase involving a great deal of money and the inept members of a racist group called T.U.R.D.",
         "Two South African boys, one white, one black, go their separate ways. Years later, they meet up again as adults, when one, after living for years in the United States, is now a wanted criminal. The two end up being a part of a madcap chase involving a check for a large amount of money."
      ],
      "budget": 0
   },
   "movielensId": 657,
   "movielens": {
      "languages": [
         "Afrikaans",
         "English"
      ],
      "releaseDate": "1993-12-01",
      "dvdReleaseDate": null,
      "directors": ["Gray Hofmeyr"],
      "runtime": 100,
      "movieId": 657,
      "title": "Yankee Zulu",
      "mpaa": "",
      "actors": [
         "Leon Schuster",
         "John Matshikiza",
         "Wilson Dunster",
         "Terri Treas",
         "Michelle Bowes",
         "Tolla Van Der Merwe",
         "Peter Hugo",
         "Skye Svorinic",
         "Ruan Mandelstam",
         "Bobo Seritsani",
         "Marie Van Deventer"
      ],
      "imdbMovieId": "0111787",
      "originalTitle": "Yankee Zulu",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["saLrn1DR3jk"],
      "plotSummary": "Two South African boys, one white, Rhino, and one black, Zulu, go their separate ways after an incident. Many years later, they meet up again as adults, when one, after living for years in the United States, is now a wanted criminal. The two end up being a part of a madcap chase involving a check for a large amount of lottery money, pursued by Gen. Diehard and Rhino's ex-wife Rowena, who was the cause of the rift between the two protagonists.",
      "tmdbMovieId": 16417,
      "avgRating": 2.55952,
      "releaseYear": "1993",
      "numRatings": 42,
      "posterPath": "/jO8pKUjBMqkaoBHY0EXLYWSmvth.jpg"
   }
}