{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0112509",
      "video": false,
      "title": "Billy's Holiday",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Billy Apples",
               "gender": 2,
               "credit_id": "52fe481ac3a368484e0e96e1",
               "name": "Max Cullen",
               "profile_path": "/ceHlZnHwEDyMZWNT5PhuJJVPZPZ.jpg",
               "id": 38665,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Kate Hammond",
               "gender": 1,
               "credit_id": "52fe481ac3a368484e0e96e5",
               "name": "Kris McQuade",
               "profile_path": "/xnQUeq0PxWHiDy9CKpByclEIt0Q.jpg",
               "id": 110008,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Louise",
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e96e9",
               "name": "Tina Bursill",
               "profile_path": "/4CkMvxXPNhmuOazoFeJv6G3Hiaw.jpg",
               "id": 152485,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Sid Banks",
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e96ed",
               "name": "Drew Forsythe",
               "profile_path": "/z8295bQqwwOwA6fI3uf8PWYSlCy.jpg",
               "id": 559922,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Julie",
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e96f1",
               "name": "Genevieve Lemon",
               "profile_path": "/fgpd0MzMdvbnLOLWRROoBMGZLdp.jpg",
               "id": 10760,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Rob McSpedden",
               "gender": 2,
               "credit_id": "52fe481ac3a368484e0e96f5",
               "name": "Richard Roxburgh",
               "profile_path": "/hN1bWQ0Qe0DrA33Ch6TLKuIWs0.jpg",
               "id": 12206,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Casey Appleby",
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e96f9",
               "name": "Rachel Coopes",
               "profile_path": null,
               "id": 559923,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "Anna",
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e96fd",
               "name": "Arianthe Galani",
               "profile_path": null,
               "id": 559924,
               "order": 7
            },
            {
               "cast_id": 1010,
               "character": "Reg Conroy",
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e9701",
               "name": "Garry Scale",
               "profile_path": null,
               "id": 559925,
               "order": 8
            },
            {
               "cast_id": 1011,
               "character": "Mack",
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e9705",
               "name": "Dylan Walters",
               "profile_path": null,
               "id": 559926,
               "order": 9
            },
            {
               "cast_id": 1012,
               "character": "Jack",
               "gender": 0,
               "credit_id": "52fe481bc3a368484e0e9709",
               "name": "Laurence Clifford",
               "profile_path": null,
               "id": 559927,
               "order": 10
            },
            {
               "cast_id": 1013,
               "character": "Maureen O'Hara",
               "gender": 0,
               "credit_id": "52fe481bc3a368484e0e970d",
               "name": "Maggie Kirkpatrick",
               "profile_path": "/rZCKxCcSCHe20NCj69daq1NMsRy.jpg",
               "id": 94289,
               "order": 11
            },
            {
               "cast_id": 1014,
               "character": "Kristin",
               "gender": 0,
               "credit_id": "52fe481bc3a368484e0e9711",
               "name": "Sacha Horler",
               "profile_path": "/eebI8i2mJqXvI9ay2kbJGneeW5E.jpg",
               "id": 79713,
               "order": 12
            },
            {
               "cast_id": 1015,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe481bc3a368484e0e9715",
               "name": "Jade Gatt",
               "profile_path": null,
               "id": 559928,
               "order": 13
            },
            {
               "cast_id": 1016,
               "character": "Melody",
               "gender": 0,
               "credit_id": "52fe481bc3a368484e0e9719",
               "name": "Maryanne Puntoriero",
               "profile_path": null,
               "id": 559929,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e96d7",
               "name": "Richard Wherrett",
               "profile_path": null,
               "id": 559920,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe481ac3a368484e0e96dd",
               "name": "Denis Whitburn",
               "profile_path": null,
               "id": 559921,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.004108,
      "production_countries": [],
      "id": 70934,
      "vote_count": 0,
      "budget": 0,
      "overview": "This movie is all about a normal guy called Billy Apples. He is a social drinker and sometimes lead singer of a band. While he is doing all of this, he still manages to bring up his teenage daughter. One night while sitting at home Billy finds that he has a talent! He finds that he is able to sing like his idol, 50's singer Billie Holiday. From there he is going places, from huge live performances to even cutting a hit record, but in the end he must make a choice between the life he has, and the life he once knew. Written by Graham Wilson Jr",
      "similar": [],
      "original_title": "Billy's Holiday",
      "runtime": 92,
      "poster_path": "/hzfHtsJrzoqwdEPooW1pqjBbRFU.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-07-26",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "As of today, he's not the man he used to be!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Wherrett"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Denis Whitburn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112509/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMjIzNzYyOF5BMl5BanBnXkFtZTcwMzg5NTAyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Max Cullen, Kris McQuade, Tina Bursill | See full cast and crew »"],
      "reviews": [
         "A movie made by Australians for Australians in Australia makes it's way to the CINEMAX cable channel! However, as I finally got into the movie, I found many pleasing aspects. First, as I have never been to Australia, the on-location settings in the Sydney streets was interesting to observe as well as the assumed daily activities of the \"normal\" Australian society. There were a few early parts where I could not understand the local intent due to the accent barrier. However, once the music started, the story plot of a middle-aged small club singer became apparent. Max Cullen is portrayed as Billy Apples. He's divorced from his also singer-mother of his teenage daughter. Billy is raising his high school daughter, Casey Appleby, played by the cute as a button Rachel Coopes. Billy dreams of his never found musical fame, while his ex-wife is still out there in music land pursuing hers. Billy has a \"girlfriend-lover\" (Kris McQuade) who is a beauty salon operator. She and her friends show up at the walk-down bar, O'Hara's, and sits around admiring Billy as he sings on stage and plays the trombone. Well, Billy's idol is the swing-era singer, Billie Holliday, played by Briget Glover in a non-speaking cameo role. Through kismet Billy received a magical voice -- the ability to sing in falsetto exactly like Billie Holliday. He becomes famous signing her swing-ballot songs. The rest of the story is like you would expect. How does fame affect Billy Apples and his friendship with his former band members and his relationship between his teenage daughter and ex-wife (Tina Bursill) whom pops up on the scene just as Billy signs a record contract and wants to get back into the act. It's refreshing to see the major players whom are between 50 - 60 years old starring in this film. It proves that a good writer can find a vehicle for actors spanning all age groups. Get that Hollywood? Every leading star does not have to be \"exceptionally beautiful and under 30\" and they don't always have to be \"clone babes.\" It's a shame that it had to take Australia to \"jump the gun\" and do \"one-up-manship\" on Hollywood. Maybe if I saw more Australian films I could come to understand the local lingo and accents. The musical numbers were all well done as was the dancing and costumes. They made for a believable fantasy which helped to tell the story. Although this film was made in 1995, the major actors are all seasoned veterans. Mr. Cullen has 50 film and TV projects under his matured belt. His adult supporting cast have upwards of 25+ completed acting projects, themselves. So, these actors are not -- unknowns! Maybe to U.S. audiences. But, I imagine the \"Aussies\" love them all! Bless their hearts. Thanks for this glimpse of \"down under.\"",
         "This movie is an Australian musical, and as far as I know, Its meant to be played in cinemas. Although it never rises above a \"Hallmark Channel\" quality at no point. The story goes like this: Our hero, Billy is an ordinary guy between 50 and 60. He works at a shop (or wherever he works), and has a daughter. He's divorced, and her daughter hates her, for being a major embarrassment. But billy has a secret talent. He can imitate the voice of Billie Holiday (well, not exactly, but some old woman voice)! On the top of that, he sings quite well, so when people find out his ability, there's no stop till Broadway! Yes, it is a stupid plot. What else could make a movie good? Breathtaking visuals. Nope, you wont find any here. The music parts look like they're from a music-video from the 80's. What else? Grabbing acts. Well, you might not share my opinion, but I find Max Cullen the most annoying actor, I've ever seen on screen. Imagine this guy. This old and chubby guy. He looks a bit like and old lady too (maybe just because those really big eyes of his)! And he's acting through the whole movie with that \"oh, I'm just a miserable little old dick, please shoot me in the head, for I don't have the balls doing it myself!\" look of his face. When happy, he looks like a Pedophile on a playground. Really a guy, you just want to ignore. And THEN, he starts singing in a female tone. In the end, the film is painfully kitchy, and it's totally tasteless. One of the most forgettable musicals I ever seen.",
         "I watched it on TV out of curiosity. How (and why?) could anybody make a movie about a white, paunchy, middle-aged, heterosexual, father named Billy in Australia who suddenly gains the ability to sing in the same high pitched voice and style as Billie Holiday from old Harlem, USA on the other side of the earth? Truly antipodal! The movie contains several entertaining musical numbers in swing style with dancing. The female characters seem more masculine than the men and the story seems to be about Billy becoming a better, happier person by accessing his \"feminine side\". I'm still not sure whose voice was used for the singing. I'm guessing it was, in fact, the lead actor's, Max Cullen which would be astonishing.",
         "... unfortunately, there is little else for which to make this film a truly worthwhile expenditure of 92 minutes of your life, let alone a worthwhile cinematic experience. I suppose that Max Cullen's talent for jazz diva vocal mimicry is somewhat noteworthy. After all, it was by most accounts the reason this film was even made. However, when you throw in a rather haphazardly scripted story about an incredibly improbable scenario, all the vocal mimic heroics, big band swing numbers, and slick choreography can't transform the sideshow into the musical that it endeavors to be. I give this movie 2 stars, one for the excellent swing music that prevails throughout the motion picture and one for Max Cullen's freaky vocals.",
         "This musical is lots of fun. The plot line is just sufficient to sustain the increasingly entertaining musical numbers. I doubt that any US troupe would ever do \"Is you is or is you ain't my baby?\"; think of the politically correct howling. This movie has the potential to be a cult classic, similar to \"Rocky Horror Picture Show.\" Enjoy it; don't think about it.",
         "It IS true: the voice heard on screen IS that of Max Cullen. The whole point to making this film is genuinely, that the producers found out that middle aged Australian koala Max Cullen could actually sing exactly like Billie Holiday. Therein lies the problem. How do you prove this? because, as other overseas comments on this site ask, is it really him singing; well it is....but so what? it it might just as well not be; it might just as well actually be Billie Holiday recordings all mimed. But it isn't. As a result there is now this curious movie that lacks the wow factor of seeing Max sing live in Billie's voice. It just doesn't make sense to make a film where the really really special thing about an actor's singing performance is not able to be convincing to a movie audience. BILLY'S HOLIDAY came out after Strictly Ballroom and Priscilla and Muriel's Wedding so I guess one musical too many and hence a flop. It really did not do any business...then LITTLE VOICE came along and managed to successfully do the same thing for Jane Horrocks, who like Max can sing in the identical voice to a famous diva like Garland and Dietrich, but in that film, was completely convincing. The BILLY musical numbers really harked back to STARSTRUCK from 1982 which was a big musical film hit. Sadly BILLY didn't advance the medium or the style and died the death of Billie herself at the box office.",
         "This rancid bit of Australian gristle rode the wave of comedy-musicals like Muriel's Wedding, Priscilla, Queen of the Desert and Strictly Ballroom, but it reveled in all of the worst aspects of Australian comedy and none of the good aspects. At least in the films that made it to the US, Australian comedies seemed to pump up the whimsy, throw in some vulgarity and crassness, and obsess about old pop culture icons (ABBA, Gloria Gaynor, etc). They also enjoyed being campy and wild, with a gay sensibility that made them hits over here, where comedy was fairly tame and predictable at the time (1995). Billy's Holiday made my teeth ache from all the forced whimsy and self-indulgence, not to mention having a \"plot twist\" (Old geezer can sing like Billie Holiday) that's totally irrelevant in a film. Yes, it's amazing that Max Cullen could sing just like Billie Holiday, but anyone can in the movies, where they loop in singing and dialog. Whenever I want to torment friends, I repeat the horrible line, \"He's not gone, he's dooooooooozing!\" and hilarity ensues. Do your brain a favor--Skip Billy's Holiday!"
      ],
      "genres": ["Musical"],
      "productionCompanies": ["Beyond Films"],
      "summaries": ["This movie is all about a normal guy called Billy Apples. He is a social drinker and sometimes lead singer of a band. While he is doing all of this, he still manages to bring up his teenage daughter. One night while sitting at home Billy finds that he has a talent! He finds that he is able to sing like his idol, 50's singer Billie Holiday. From there he is going places, from huge live performances to even cutting a hit record, but in the end he must make a choice between the life he has, and the life he once knew."],
      "budget": 0
   },
   "movielensId": 658,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-07-26",
      "dvdReleaseDate": null,
      "directors": ["Richard Wherrett"],
      "runtime": 92,
      "movieId": 658,
      "title": "Billy's Holiday",
      "mpaa": "R",
      "actors": [
         "Max Cullen",
         "Kris McQuade",
         "Tina Bursill",
         "Drew Forsythe",
         "Genevieve Lemon",
         "Richard Roxburgh",
         "Rachel Coopes",
         "Arianthe Galani",
         "Garry Scale",
         "Dylan Walters",
         "Laurence Clifford",
         "Maggie Kirkpatrick",
         "Sacha Horler",
         "Jade Gatt",
         "Maryanne Puntoriero"
      ],
      "imdbMovieId": "0112509",
      "originalTitle": "Billy's Holiday",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "This movie is all about a normal guy called Billy Apples. He is a social drinker and sometimes lead singer of a band. While he is doing all of this, he still manages to bring up his teenage daughter. One night while sitting at home Billy finds that he has a talent! He finds that he is able to sing like his idol, 50's singer Billie Holiday. From there he is going places, from huge live performances to even cutting a hit record, but in the end he must make a choice between the life he has, and the life he once knew. Written by Graham Wilson Jr",
      "tmdbMovieId": 70934,
      "avgRating": 3.05455,
      "releaseYear": "1995",
      "numRatings": 55,
      "posterPath": "/hzfHtsJrzoqwdEPooW1pqjBbRFU.jpg"
   }
}