{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wales",
            "id": 1209
         },
         {
            "name": "rural setting",
            "id": 11004
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         }
      ],
      "imdb_id": "tt0115591",
      "video": false,
      "title": "August",
      "recommendations": [],
      "backdrop_path": "/zlK7RiOPWCXkzFcmqjFwVda3gqn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ieuan Davies",
               "gender": 2,
               "credit_id": "52fe4c3dc3a36847f82247df",
               "name": "Anthony Hopkins",
               "profile_path": "/btweZvSRBiE6jaMME93BSXeTQN6.jpg",
               "id": 4173,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Professor Alexander Blathwaite",
               "gender": 2,
               "credit_id": "52fe4c3dc3a36847f82247e3",
               "name": "Leslie Phillips",
               "profile_path": "/A1vO83wMO5eG0AxRvBwwQwu5NCg.jpg",
               "id": 10655,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Helen Blathwaite",
               "gender": 1,
               "credit_id": "52fe4c3dc3a36847f82247e7",
               "name": "Kate Burton",
               "profile_path": "/6xfvY8epNXBLXIKOK3mdyC5q5ra.jpg",
               "id": 20879,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dr. Michael Lloyd",
               "gender": 2,
               "credit_id": "52fe4c3dc3a36847f82247eb",
               "name": "Gawn Grainger",
               "profile_path": "/bcQy1lg4RGPamA6EGULQy20rXDR.jpg",
               "id": 189427,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sian Blathwaite",
               "gender": 1,
               "credit_id": "52fe4c3dc3a36847f82247ef",
               "name": "Rhian Morgan",
               "profile_path": "/6IEi37TM7ZHcxFs4qp098isFv3u.jpg",
               "id": 185826,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Gwen",
               "gender": 0,
               "credit_id": "5463737f0e0a2678000023e4",
               "name": "Menna Trussler",
               "profile_path": null,
               "id": 134892,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Griffiths",
               "gender": 2,
               "credit_id": "5463738c0e0a267815002391",
               "name": "Rhys Ifans",
               "profile_path": "/p0rbwzc4Yj2oHW0iiln0X0Wx9EK.jpg",
               "id": 7026,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c3dc3a36847f82247f5",
               "name": "Anthony Hopkins",
               "profile_path": "/btweZvSRBiE6jaMME93BSXeTQN6.jpg",
               "id": 4173,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546373640e0a2678030023bb",
               "name": "Julian Mitchell",
               "profile_path": null,
               "id": 69295,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5463736f0e0a26781000241f",
               "name": "Anton Chekhov",
               "profile_path": null,
               "id": 109469,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.287401,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 161070,
      "vote_count": 4,
      "budget": 0,
      "overview": "Set in 1890s North Wales over a long, hot August weekend, the Victorian calm of a household is suddenly upset with the arrival of a London couple who impose their city ways and thoughts on the more rurally based family. An adaptation of Anton Chekhov's play, \"Uncle Vanya.\"",
      "similar": [
         2675,
         994,
         143800,
         4584,
         281007,
         9609,
         37247,
         146233,
         6947,
         8055,
         920,
         631,
         1368,
         298312,
         128,
         938,
         9598,
         509885,
         241848,
         9362
      ],
      "original_title": "August",
      "runtime": 94,
      "poster_path": "/lyLhUHsiZedxjQnjR41afnGBIGj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Newcomm",
            "id": 38178,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Granada Film Productions",
            "id": 247,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Majestic Films International",
            "id": 20928,
            "origin_country": ""
         }
      ],
      "release_date": "1996-08-08",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "It's really how life can appear with desillusions, good and funny moments, peace, love and hate.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Hopkins"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Anton Chekhov",
         "Julian Mitchell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115591/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5MDM3Njg3M15BMl5BanBnXkFtZTcwNTMzNDQzMQ@@._V1_.jpg",
      "actors": ["Stars: Anthony Hopkins, Leslie Phillips, Kate Burton | See full cast and crew »"],
      "reviews": [
         "Anton Chekhov's play 'Uncle Vanya' has been re-written and transplanted to turn of the century South Wales in this production, which is directed by Anthony Hopkins. For all of the many translations and rebirths of this 'comedy' by the great Chekhov, this one seems to work best. There really is very little linear storyline, but it is filled with the author's recurring themes of unfulfilled dreams, boredom, longing for an elusive future. The plot (!) is really a discourse among the players: Ieuan Davies (Anthony Hopkins) is a bored older man who spends his days drinking and talking with his small family and servants on the country estate owned by Professor Alexander Blathwaite (Leslie Phillips) who comes for a stay with his beautiful wife Helen (Kate Burton) for whom Davies lusts and pines. A doctor (Gawn Grainger) visits, stirs discontent while mixing in family gossip and caring for the victim of a mine explosion. The bulk of the dialogue is centered on some fine expositions about women's rights, class inequality, and Davies' boredom with life, his aborted chances on having a significant life, and his longing for a future that seems as elusive as the summer breeze that fans the tea garden in this wistful, atmospheric setting. To enjoy 'August' the viewer must be in the mood for conversation, wit, banter, and ensemble acting, and given those prerequisites, this film is a joy. Hopkins gives a magnificent performance, loathable and lovable, and the entire cast is so polished that the play becomes chamber music. Hopkins not only stars but also directs (not always successfully attending to the small details of action), and also provides the musical score - no mean feat! Not a film of action this, but rather a summer reverie piqued by subtle comedy. Grady Harp",
         "Having seen A Country Life, another film based on Chekhov's Uncle Vanya, I have to say I preferred August. While both of them have taken the story to another setting and another time, I was swayed by the compelling performance of Anthony Hopkins (and perhaps his direction, too). Kate Burton was beautiful and enigmatic, and I couldn't help but see glimpses of her famous father slipping through, after just viewing Becket the night before. August had all the elements of Chekhovian drama: unfulfilled dreams, boredom, longing for an elusive future. The entire cast was magnificent, and Hopkins was amazing as usual. He brought so much to the role -the finest actor today!",
         "An accomplished major film directorial debut for Anthony Hopkins, a beautiful piece of work, accompanied by a wonderful score, also composed by Hopkins. But one must wonder, as with the adaptation of any great work of art, why it was necessary. \"Uncle Vanya\" has been masterfully translated, it seems superfluous at best to rewrite it. As with Shakespeare, the transposition into a new landscape need not be accomplished through a completely new script. This being said, however, it is always pleasing to see a project so close to a person's heart as this obviously was to Hopkins' come to such beautiful fruition.",
         "I had never heard of this film about a year ago, which I feel quite ashamed about. It was directed by Anthony Hopkins and also starred the great man himself. The largely Welsh cast act well and couldn't be replaced by anything better. The plot focuses on the life of Hopkin's character, his small family (mother and niece), his boredom with life, his missed chances and his undying love for a visitors wife. This film has many fine moments which can invoke thought in you, especially when Hopkin's breaks down in tears at the end. I would recommend this film to anyone if not only for Hopkins but for the story itself.",
         "This is a lovely, well considered and well paced version of Chekhov's famous play. It is both amusing and sad, really a perfect balance. The title is a little misleading because this is actually UNCLE VANYA, not an adaptation. The characters' names have been altered and a brief mining accident has been added, but it is otherwise nearly a word-for-word translation, well worth watching. Hopkins is a wonderful Vanya (Ieuan), shifting moods rapidly from farce to frenzy. Kate Burton is a fine Yelena (Helen), not surprising because she worked for many years at the Williamstown Festival under Nikos Psacharopoulos, a director renowned for his Chekhov productions.",
         "Gracious! What a depressing film this was. I love Hopkins. I always have, but why this dark, depressing film that was ridiculously over-acted? I have loved every film Anthony has ever made, but this one, even though I understand a person's struggle with life, friendship, love, and the disappointments of not having true love or a fulfilling life, why should we be subjected to such absurd screaming and desperate actions? The musical score was the only thing I value about this film other than when Anthony's character is CALM. Anthony and I have the same birthday, and so I've always identified with him. He is an accomplished actor and now, as I've learned, a wonderful composer as well, but I just would rather die than to watch this movie again. Sorry, Anthony, I will still love you the rest of my life, but why...oh why did you agree to do this horrible film? Have a great birthday when I do...December 31!!!",
         "Must say I really enjoyed this Wish they'd make more original remakes and bringing older scripts back to life Wales always makes a fascinating back drop and with Hopkins involved his sheer quality brings every above the ordinary in beautiful settings such as this in wales or train spotting in Scotland or Commitments in Ireland or Amelie or Ronin in France and the Holiday in the peak districts. Check out other British and welsh classics like; Twin Town, last Days of Dolwyn, Zulu, Saturday Night Sunday Morning, Sporting Life, Run for Your money. Sadly it's all middle class rubbish since then like Love ACtually and posh controlled grim up north dramas. Why do the elite try and write working class plays? Get the working class to write about it. Because they know the truth is the poor have way more laughs and less obsession with power and greed. It just adds so much and shows the world is far far richer than just shiny old Hollwood, London and the big apple (much as I love New York mind) Great stuff keep making them tony",
         "What a shame to see the excellent actor, Anthony Hopkins, make such an inept effort at directing. This movie is about a group of miserable Welsh gentry who have nothing better to do than make each other as unhappy as they know how. This is a sort of childish attempt to imitate \"Who's Afraid of Virginia Wolfe\" with a larger cast. There is no character that seems like a real person (other than in an institution) and will bore most anyone to sleep. I watched to the end just to see if Hopkins would improve with experience. He didn't."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Granada Film Productions",
         "Majestic Films International",
         "Newcomm"
      ],
      "summaries": ["Chekovs Uncle Vanya, transposed to turn-of-the-century North Wales, where the peace and tranquillity of a country house is disturbed by the arrival of the estates tyrannical owner and his American wife."],
      "budget": 0
   },
   "movielensId": 660,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-08",
      "dvdReleaseDate": "2001-04-06",
      "directors": ["Anthony Hopkins"],
      "runtime": 94,
      "movieId": 660,
      "title": "August",
      "mpaa": "PG-13",
      "actors": [
         "Anthony Hopkins",
         "Leslie Phillips",
         "Kate Burton",
         "Gawn Grainger",
         "Rhian Morgan",
         "Menna Trussler",
         "Rhys Ifans"
      ],
      "imdbMovieId": "0115591",
      "originalTitle": "August",
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["67QgTJDbYO4"],
      "plotSummary": "Set in 1890s North Wales over a long, hot August weekend, the Victorian calm of a household is suddenly upset with the arrival of a London couple who impose their city ways and thoughts on the more rurally based family. An adaptation of Anton Chekhov's play, \"Uncle Vanya.\"",
      "tmdbMovieId": 161070,
      "avgRating": 2.99254,
      "releaseYear": "1996",
      "numRatings": 134,
      "posterPath": "/lyLhUHsiZedxjQnjR41afnGBIGj.jpg"
   }
}