{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "older woman seduces younger guy",
            "id": 7476
         },
         {
            "name": "cheat on husband",
            "id": 10337
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         },
         {
            "name": "teachers and students",
            "id": 193547
         },
         {
            "name": "1940s",
            "id": 207883
         }
      ],
      "imdb_id": "tt0113720",
      "video": false,
      "title": "All Things Fair",
      "recommendations": [
         20372,
         25228,
         72465,
         172469,
         76268,
         90949,
         11174,
         25544,
         36709,
         26964,
         142106,
         174314,
         106254,
         4839,
         42147,
         37994,
         83295,
         45219,
         24276,
         70447
      ],
      "backdrop_path": "/l1ulbjfMODxJyW4L2EfO7BzqydO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stig",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c8b3",
               "name": "Johan Widerberg",
               "profile_path": "/vzD8l02LjcF3AleiUNhtogOvHE9.jpg",
               "id": 96935,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Viola",
               "gender": 1,
               "credit_id": "52fe452dc3a368484e04c8b7",
               "name": "Marika Lagercrantz",
               "profile_path": "/qYcYhw5yArwRe5dcUukt0ddkp5P.jpg",
               "id": 87724,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kjell",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c8bb",
               "name": "Tomas von Brömssen",
               "profile_path": "/23iqpFqIMaU1A4Mzxod8y7hL9LN.jpg",
               "id": 56392,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lisbet",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c8bf",
               "name": "Karin Huldt",
               "profile_path": null,
               "id": 96936,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Stig's Mother",
               "gender": 1,
               "credit_id": "52fe452dc3a368484e04c8c3",
               "name": "Nina Gunke",
               "profile_path": "/eX2lViajgj6MdQM8CeKJpSdd9AQ.jpg",
               "id": 96937,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sigge",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c8c7",
               "name": "Björn Kjellman",
               "profile_path": "/yO5JagzQLjtXtgECVSs3Sep1XEX.jpg",
               "id": 6001,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Stig's Father",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c8cb",
               "name": "Kenneth Milldoff",
               "profile_path": null,
               "id": 96938,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Olga",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c8cf",
               "name": "Frida Lindholm",
               "profile_path": null,
               "id": 96939,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Biografmaskinisten",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c8d3",
               "name": "Sigge Cederlund",
               "profile_path": null,
               "id": 96940,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c8af",
               "name": "Bo Widerberg",
               "profile_path": "/2jJ2ZziKMSgMF4QbvdorCwVVeOL.jpg",
               "id": 96934,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c8d9",
               "name": "Bo Widerberg",
               "profile_path": "/2jJ2ZziKMSgMF4QbvdorCwVVeOL.jpg",
               "id": 96934,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5841cf2ac3a36865b600ae38",
               "name": "Morten Bruus",
               "profile_path": null,
               "id": 1150820,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5841cf3f9251417d5000a5e1",
               "name": "Per Holst",
               "profile_path": null,
               "id": 56877,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5841cf659251417d5900a811",
               "name": "Bo Widerberg",
               "profile_path": "/2jJ2ZziKMSgMF4QbvdorCwVVeOL.jpg",
               "id": 96934,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5841cf759251417d6200a76d",
               "name": "Palle Arestrup",
               "profile_path": null,
               "id": 1156397,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5841d064c3a36865af00bd4f",
               "name": "Anna Idman",
               "profile_path": null,
               "id": 557760,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5841d080c3a36865b600af24",
               "name": "Anne Ingvar",
               "profile_path": null,
               "id": 1036870,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "5841d0939251417d4d00a559",
               "name": "Rolf Konow",
               "profile_path": null,
               "id": 1434166,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "5841d6249251417d5300aa2e",
               "name": "Owe Svensson",
               "profile_path": null,
               "id": 1332141,
               "department": "Sound",
               "job": "Sound Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 5.829393,
      "production_countries": [
         {
            "iso_3166_1": "SE",
            "name": "Sweden"
         },
         {
            "iso_3166_1": "DK",
            "name": "Denmark"
         }
      ],
      "id": 27098,
      "vote_count": 29,
      "budget": 0,
      "overview": "This film is set in 1943 when the whole of Europe was embroiled in WWII. It deals with attraction of a 15 year old boy Stig to his teacher Viola. The whole movie revolves around the sexual encounters between Stig and Viola and how he eventually grows out of it.",
      "similar": [
         369885,
         746,
         8457,
         16869,
         2253,
         5925,
         853,
         857,
         424,
         14574,
         228150,
         637,
         423,
         613,
         339259,
         289222,
         1251,
         7508,
         351339,
         7214
      ],
      "original_title": "Lust och fägring stor",
      "runtime": 130,
      "poster_path": "/uJD0PvYGAa1IoZBsX4E6GQ4K2In.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "svenska",
            "iso_639_1": "sv"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Per Holst Filmproduktion",
         "id": 17666,
         "origin_country": ""
      }],
      "release_date": "1995-03-08",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "He was a student. She was his teacher. Their love was forbidden.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bo Widerberg"],
      "runtime": 130,
      "synopsis": null,
      "writers": ["Bo Widerberg"],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0113720/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MTYyMjIzOF5BMl5BanBnXkFtZTYwNDgzMzk4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Johan Widerberg, Marika Lagercrantz, Tomas von Brömssen | See full cast and crew »"],
      "reviews": [
         "How much I regret the passing of director Bo Widerberg who can create a film such as this one with its dramatic portrayal of human problems, human relationships and human emotions. It was not so much the dialogue but more the unspoken words that grabbed my attention and held me to the end. A long silence can be filled with meaning....a stolen look, a fleeting glance, a flicker of a smile, a movement of the eye....all these subtle messages electrify the air between Viola the teacher and Stig the student in the class room. We know at once that in some magical way their lives have been drawn together and as we are caught up in the drama we seem to know that eventually the ending will not be a happy one. Under the guise of having special coaching lessons, Stig gains entrance into his married teacher's household after his evening cinema job. Shy at first he soon experiences the delights of a continuing relationship with Viola who is a very competent teacher in all respects. Perhaps we can pardon Viola for her \"cradle snatching\" when we find out that her husband has taken to drink and seems almost permanently drunk. The love scenes are sensitively handled and the remarkable changes which develop in the characters create an imposing piece of cinema. Stig seems to take on a degree of security in a scene where he accuses the husband of the impossible situation. But who is really to blame? That is the intriguing part of the film. There are some aspects that are not explained thus the viewer becomes involved. As for the stolen encyclopaedia, why would Stig carry them off. Is he just in a vindictive mood and does it just to annoy Viola or have those volumes become special to him because they belonged to Viola.",
         "Bo Widerberg was honored in February 1997 at the Miami Film Festival with a retrospective (ELVIRA MADIGAN), and his latest (last?) film, the Oscar nominated ALL THINGS FAIR. I then saw ALL THINGS FAIR for the second time, and despite its length, enjoyed it as much or more than the first time I saw it in an arthouse theatre in Toronto. I think ALL THINGS FAIR is the great Swedish director's best, most personal film. You can't help but notice it must be autobiographical by the passion and the vivid recreation of WW II Sweden, as it was when Mr. Wideberg himself was the lead character's age. Speaking of him, the lead is the director's own 17 year old son, Johan Widerberg, who will undoubtedly carry on the family tradition in Swedish cinema history. Mr. Widerberg (Sr.) passed away last year, and among his legacy, this film stands out. It is a rare coming of age story in a setting seldom depicted on screen. Mr. Wideberg's screenplay, and direction, plus excellent performances by his son and two of Sweden's greats, Marika Lagerkrantz and Tomas van Bromssen make this a movie every European film buff should watch. It's now available on video. Check it out.",
         "ALL THINGS FAIR (Lust och fägring stor) turned out to be brilliant Swedish writer/director Bo Widerberg's elegy: after a long history of successful and emotionally captivating films, this film was his last. Watching again some twelve years later gives an entirely different level of appreciation for Widerberg's work. This is a little jewel of a film explores human sexuality at the time of puberty and the enormous impact on the way relationships are viewed, while at the same time it presents a keen insight to the world at war and the equally monstrous side effects in myriad ways. Malmö, Sweden, 1943. A highschool class of boys is discovering the mysteries of body changes and all-consuming effects puberty has one young teenage men. Outside the classroom World War II threatens and inside the classroom puberty threatens. 15 year old Stig (Johan Widerberg) is a handsome, curious lad from a poor family who discovers his first female attraction in the form of his new 37 year old teacher Viola (Marika Lagercrantz), who, despite the impropriety of the situation added to the fact that she is married to a traveling salesman Kjell (Tomas von Brömssen) who spends his idle hours drinking and listening to classical music in the kitchen, returns the seductive dance and soon the two are in a physically involved affair. The beauty and fresh novelty of their feelings is captured in the most magical way with little dialog, many embarrassed glances, and significant risks that eventually include Kjell's discovery of their trysts. But as the two are discovered many changes occur: Stig's beloved soldier brother Sigge (Björn Kjellman) finally goes off to submarine warfare, Viola becomes less involved and senses the problem she has created, Stig falls under the spell of the tragic Kjell learning music and more from this pathetic man, and Stig finally must face the realities of more proper attraction to Lisbet (Karin Huldt) a girl his own age. The actors are superb, the settings are atmospheric, and the era of the 1940s Sweden is perfectly represented. Part of the joy of the film is the musical score that varies from a Handel aria during moments love making, to Brahms' 'Ein Deutsches Requiem', to Mahler's 5th Symphony 'Adagietto', to Beethoven's 'Grosse Fugue.' Widerberg makes it all work in a misty yet sensuous manner. It is a film to own and one to watch often. In Swedish with English subtitles. Grady Harp",
         "\"All Things Fair\" is a strange kind of film because it is always transforming itself. While it always remains a coming-of-age film it ranges in its focus, touching on many different expressions. Obviously this makes it hard to categorise, hard to follow, hard to analyse, and all this seems to add up to a good thing. It starts out so luridly that I thought I was in for a Swedish version of \"Private Lessons\" but somehow it manages to continually evolve into something quite else. The changes in pace and locus give the narrative a certain elliptical feel which consolidate the nostalgic representation. Pretty good performances all round and some unexpected twists in the tale make it well worthwhile.",
         "I touches you, moves you and the imagery and music is fantastic. even though it could be perceived as risqué in America, Europe raises no eyebrows of the imagery or hinted developments. The eyebrows are raised by the deeper thread and cross-human references. Who has not been attracted to someone they shouldn't - an authority. And what has this brought along with it? Will the authority fall or will your image and strength of life expand building upon newer degrees of intensity? I realise that it can be difficult to follow the film, if you do not speak Swedish (or any Scandinavian language), but this should not deter you from seeing this film.",
         "This was to be director Widerberg's last movie. A sweet family farewell, since his son played the lead in it. What his last words may be, as expressed in this movie, though, is hard to say. There is no clear moral in it, for which I am thankful, but a somewhat distressing observation about love: it is a close neighbor to hate, and it will not leave without vengeance. The love affair between the school teacher and the teenage student is interesting when it starts to break up, but its beginning is too swiftly dealt with to make any sense, and its joyous, lustful phase is without depth. Only when things go awry, does the story get interesting, and the actors get to excel in their art. The title is from a psalm, which is traditionally sung by students when they leave school for the summer break - or for good. It's a hymn to the summer and its luscious splendor - therefore, a lust of another kind, than the carnal one the movie deals with. Some Widerberg irony, no doubt. Using his son as the student in the movie, was not that good an idea, although Johan Widerberg has a rare charisma on screen, and his own odd talent in acting. His father seems not to have been able to treat his son with the same merciless exploitation, as he was quite apt to do with other actors. So, the student is left hanging in a kind of vacuum, as if empty of his own intentions and conflicts. Things happen to him, as if he had nothing to do with them. In this type of drama, it is important that the characters are stripped naked - well, mainly their souls, but bodies too, if need be. Widerberg manages the latter with his son, briefly, but not at all the former. When wanting to protect his son, he actually abandons him - for no other reason than the inhibitions in his own fatherhood. Johan, on the other hand, seems to be prepared to do any sacrifice necessary, to make the movie work. I could be wrong. But the impression remains: the student's story never really gets to be told, because he is not allowed to be present, completely.",
         "I watched this movie on the Canadian Broadcasting Company network last night. I liked it a lot, but thought the ending was weak. I wonder if that was because I don't understand Swedish? It was not clear to me why Stig thought Viola was a liar. I also did not see why he would take the set of dictionaries from the classroom right at the end. If it was an act of rebellion, it was not a very powerful one. However, that being said, I thought it was a beautifully crafted movie, well acted and otherwise convincing. I thought Kjell was excellently developed as a character, giving a realistic portrayal of a frustrated and lonely salesman, turning to drink in an effort to forget his inner demons. I would recommend this movie to anyone who thought that Summer of 42 was good. This movie is better - and I loved Summer of 42.",
         "I caught this film on Canadian television, and I was startled by the risque content being broadcast on a non-pay station. This is a story of a growing adolescent boy in a war-torn Europe. The focus of the movie is in the complex relationships he holds with the people in his life. The controversial nature may deter the more conservative American; however, the characters are well-rounded and acted and the cinematography is superb. I have a feeling this director may be famous in his home country, there is a touch of epic brilliance in the movement of the scenes.",
         "Watching \"All Things Fair\" as it showed on TV here in Canada on CBC public network last night, was a treat. Only my sensible, nagging partner coaxing me to get to bed on a work night persuaded me we could trust the VCR to tape the last hour or so. Fortunately for his neck, the tape ran out during the closing credits and not before! What I liked most about the film (with English subtitles) was the complexity of Sig's world and his relationships. It's a very real world feeling on screen, full of quirky believability, despite Sig's unusual arrangement with his teacher. Though I know of a real life story resembling Sig's relationship with his teacher that went very differently for the teacher--ending in her virtual ruin--the behaviour of these film characters, the outcome and the aftermath, rings true nonetheless. No character is one-dimensional, even though the film schools us to sympathize with the choices of some and to repudiate others. It's delightful to find in the credits that the director gave the plum lead role to his son. It takes an admirable trust, I think, to turn over a role like this to one's own young kin, complete with whatever there is in the script that MIGHT be autobiographical. The female solo vocals in the soundtrack were wonderful. Now, I just need to found out who was singing like a bell whenever love or pain swelled in the story.",
         "Bo Widerbergs last movie All Things fair, the male lead is the directors son. It is the love fall between Stig, 15 and his teacher, Viola 37. 1942 in the Swedish town Malmö. The 1955-movie with the same theme is based on a true story ... while in the shadow of the moralizing the love affair between a students with the principals wife develops: \"Så tuktas kärleken\" with the yesterday-famous (even A Hitchcock heard of) the blonde Karin Ekelund. Significant for Bo Widerbergs movie is the students search for knowledge. He is in the classroom, searching for a word in the schools dictionaries. Enters the teacher, asking what he does and telling him the meaning of the word he looks for: middling/mediocre. He reads: \"Latin, mediocre, person of moderate ability, work of no particular value.\" It is the beginning of their relationship: working class boy vs middle class woman. Primary not a love affair between them but she as the door to knowledge the working class is forbidden to have. The teachers guiding part, as member of the upper class, owns the power of knowledge. The end of their love story is not that her husband discovers their affair (he accepts what is going on) but the friendship between her husband and her lover that triggers her jealousy and ends the affair between upper and working class: doomed from its start. Who was used and who ...? She uses her power against the powerless. She tells the schools principal that Stig has to repeat his year and the principal tells Stig after the decision: \"we are all in agreement that you should repeat the third year next term.\" The celebration in church of the schools years with the distribution of the certificates. The teacher in the place of the priest in front of the altar, calling the name/s of the pupil/s. Stig in his weekdays outfit enters, approaching her. We see only parts of his obscene gestures in front of his paralyzed teacher, Viola. He leaves the church, heading for the school. The doors are locked, entering as the working class boy he is by the cellar. He forces the classrooms door and takes the books. The books, the symbol for knowledge that always belonged to the ruling class. The last scene: above the schools entrance are carved in stone the sentence: Fear of the Lord is the Beginning of Wisdom. In two bags he carries the books: the wisdom that now belongs even to him, the working class Their relation was a wisdom-encounter and a time limited human encounter. It ended when Stig befriended with her husband. Stig is played by the editors/directors son. Some parts are autobiographic."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Per Holst Filmproduktion",
         "Det Danske Filminstitut",
         "Nordisk Film- & TV-Fond"
      ],
      "summaries": [
         "Malmö, Sweden during the Second World War. Stig is a 15 year old pupil on the verge of adulthood. Viola is 37 years old and his teacher. He is attracted by her beauty and maturity. She is drawn to him by his youth and innocence, a god-sent relief from her drunk and miserable husband. They start a passionate and forbidden relationship - but it has consequences they never could have expected.",
         "All things fair takes place in 1943. Stig meets his teacher, Viola. His life changes forever. They start an affair. She is 37, and he is 15, but that makes no difference to them. Viola's husband is always drunk and unfaithful, so she thinks her own affair is therefore justified. The girl next door, however, also shares love for Stig and is disappointed he never notices her. The affair grows dangerous, and Viola is risking everything. Then one day Stig realizes love does exist with someone his own age, and Viola lets him pay dearly for his realization...."
      ],
      "budget": 0
   },
   "movielensId": 666,
   "movielens": {
      "languages": [
         "Deutsch",
         "svenska",
         "English"
      ],
      "releaseDate": "1995-03-08",
      "dvdReleaseDate": "2004-04-27",
      "directors": ["Bo Widerberg"],
      "runtime": 130,
      "movieId": 666,
      "title": "All Things Fair",
      "mpaa": "",
      "actors": [
         "Johan Widerberg",
         "Marika Lagercrantz",
         "Tomas von Brömssen",
         "Karin Huldt",
         "Nina Gunke",
         "Björn Kjellman",
         "Kenneth Milldoff",
         "Frida Lindholm",
         "Sigge Cederlund"
      ],
      "imdbMovieId": "0113720",
      "originalTitle": "Lust och fägring stor",
      "genres": [
         "War",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "This film is set in 1943 when the whole of Europe was embroiled in WWII. It deals with attraction of a 15 year old boy Stig to his teacher Viola. The whole movie revolves around the sexual encounters between Stig and Viola and how he eventually grows out of it.",
      "tmdbMovieId": 27098,
      "avgRating": 3.46237,
      "releaseYear": "1995",
      "numRatings": 186,
      "posterPath": "/uJD0PvYGAa1IoZBsX4E6GQ4K2In.jpg"
   }
}