{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "mixed martial arts",
            "id": 9917
         },
         {
            "name": "kumite",
            "id": 12379
         },
         {
            "name": "chop socky",
            "id": 14961
         }
      ],
      "imdb_id": "tt0112536",
      "video": false,
      "title": "Bloodsport II",
      "recommendations": [
         36693,
         36692,
         36859,
         64170,
         36934,
         29901,
         26340,
         25684,
         48302,
         61418,
         42552,
         70024,
         26626,
         53830,
         157036,
         25576,
         2199,
         25391,
         46924,
         34309
      ],
      "backdrop_path": "/vlB1zk0bvRBm15tDzkfI5CR8osR.jpg",
      "revenue": 684351,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alex Cardo",
               "gender": 0,
               "credit_id": "52fe44b7c3a368484e032f7d",
               "name": "Daniel Bernhardt",
               "profile_path": "/xu8MSrkaP5PH2VlkOAfdRYF8wnB.jpg",
               "id": 9452,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "David Leung",
               "gender": 2,
               "credit_id": "52fe44b7c3a368484e032f81",
               "name": "Pat Morita",
               "profile_path": "/eMLWaQ2uQIpiyVeaU7xl0ozs2B7.jpg",
               "id": 23915,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ray 'Tiny' Jackson",
               "gender": 2,
               "credit_id": "52fe44b7c3a368484e032f85",
               "name": "Donald Gibb",
               "profile_path": "/drLNhfpcY1A8WxTVUE05ja47K9q.jpg",
               "id": 70254,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sun",
               "gender": 2,
               "credit_id": "52fe44b7c3a368484e032f89",
               "name": "James Hong",
               "profile_path": "/8k4RrDRsqkvJDePU8ciMOOx5Zso.jpg",
               "id": 20904,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Janine Elson",
               "gender": 0,
               "credit_id": "5462a2050e0a2678150007f7",
               "name": "Lori Lynn Dickerson",
               "profile_path": null,
               "id": 1384703,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "John",
               "gender": 2,
               "credit_id": "5462a2190e0a26780a0007ae",
               "name": "Philip Tan",
               "profile_path": "/1FhKJFikrUKvpNoYbf5wsmmYo4y.jpg",
               "id": 702,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Demon",
               "gender": 2,
               "credit_id": "55a9d81dc3a3682ff90047b3",
               "name": "Ong Soo Han",
               "profile_path": null,
               "id": 118263,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b7c3a368484e032f79",
               "name": "Alan Mehrez",
               "profile_path": null,
               "id": 115983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5462a1f30e0a267806000817",
               "name": "Jeff Schechter",
               "profile_path": "/16tfypSSvLUoJgl0vk2JJRIwyLx.jpg",
               "id": 238824,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.936541,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25087,
      "vote_count": 28,
      "budget": 0,
      "overview": "After thief Alex Cardo gets caught while stealing an ancient katana in East Asia, he soon finds himself imprisoned and beaten up by the crowd there. One of the guards, Demon, feels upset by Alex appearance and tortures him as often as he gets the opportunity. Alex finds a friend and mentor in the jailhouse, Master Sun, who teaches him a superior fighting style called Iron Hand. When a 'best of the best kumite' is to take place, Demon gets an invitation. Now Master Sun and Alex need to find a way to let Alex take part in the kumite too.",
      "similar": [
         55292,
         11841,
         9053,
         9461,
         146,
         605,
         24,
         604,
         682,
         140300,
         11770,
         9502,
         7549,
         2024,
         9335,
         9947,
         8456,
         603,
         16320,
         272
      ],
      "original_title": "Bloodsport II",
      "runtime": 90,
      "poster_path": "/4jrgoLBgQgzeMZUCzSgy6SRWmf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "FM Entertainment International N.V.",
         "id": 10354,
         "origin_country": ""
      }],
      "release_date": "1996-03-01",
      "vote_average": 5.1,
      "belongs_to_collection": {
         "backdrop_path": "/1DXtjAAaK7597GV5MSZH6nn0uqS.jpg",
         "name": "Bloodsport Collection",
         "id": 36694,
         "poster_path": "/sTqv7FQalXNVGSpfSJaWek077w9.jpg"
      },
      "tagline": "Caught between honor and revenge, how far will one man go...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Mehrez"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Jeff Schechter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112536/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2Mzc4NzQxN15BMl5BanBnXkFtZTcwMDcxNjYyMQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Daniel Bernhardt, James Hong, Pat Morita | See full cast and crew »"],
      "reviews": [
         "I can say this Bloodsport is as good as the first one but this has better fighting scenes. This has better fighting than 1 and 3. I haven't seen the fourth one though. Well all I can say is it's very good. Watch this movie because in my view it's worth watching.",
         "Obviously, you will not like this movie if you did not like 1988's Bloodsport (though there ARE some cases where the sequel is better than the original). This review is thus addressed to those who liked Bloodsport and are wondering whether they should bother to watch Bloodsport II: The Next Kumite. My answer would be yes. Sure, Jean-Claude Van Damme isn't here (Donald Gibb serves as the link between the two movies), but Daniel Bernhardt, as petty thief Alex Cardo who discovers the meaning of honor, makes for a likable, charismatic lead, who also bears somewhat of a resemblance with Jean-Claude. Also interesting is the narration, told in flash-back by Alex Cardo's trainer, Master Sun (played by James Hong) to a throng of young disciples. In these moments in particular, Bloodsport II shows that it is completely aware of what kind of movie it is, that it does not aspire to be anything more, and even pokes fun at itself (see the excellent ending, for example). In short, Bloodsport II: The Next Kumite is not as awesome as it's predecessor, but it does what it aspires to do: it gets the job done. The cinematography isn't as good here as the first time, making the fights less impressive, but they're good enough. The story and the fact that the movie changes location (from Hong Kong to Thailand), contribute to not make it a rehash of the original. The actors, from Daniel Bernhardt to Donald Gibb, passing by James Hong and Pat Morita, are just right. And just like in the first one, you may know exactly how it's going to end, but it's still a joy to watch.",
         "After watching \"Bloodsport\" and enjoying that movie to the fullest, I just had to watch the sequels too even though van Damme has nothing to do with them. Instead, Swiss Daniel Bernhardt takes the role of our fighting hero. In my opinion, he makes a really good replacement for van Damme. The fight scenes are really great in this movie too, and there are lots of it to make every martial arts fan out there satisfied. The villain in this movie, 'Demon', is unfortunately not nearly as interesting as Bolo Yeung's 'Chong-Li' was in the first. But that's a minor detail. But seriously, this \"Iron-hand\"-stuff should have been removed from the script. It was just too ridiculous in a movie that tries to be a bit realistic. On the upside: It was really cool to see that Donald Gibb returned as 'Jackson'.",
         "This is surprisingly a very good film, with some excellent fighting scenes. It's not really a sequel to Bloodsport, and by no means does it come close to matching it, however, it's highly enjoyable, with an excellent lead performance by Dainel Bernhardt. However, i found the main villain kinda weak, and he is no Bolo Yeung that's for sure, however he looked big, and was pretty menacing at times. The story is interesting, but the last fight, sucked!, and was way too short. The Directing, is good. Alan Mehrez, does a fairly good job here, with some neat shots here and there, and some cool shots during the fighting scenes, he did a decent job overall. The Acting is actually excellent. Dainel Bernhardt is AWESOME here!, he was great in the acting department!, in fact, he reminds me of Van Damme in a lot of ways!, he is also awesome in martial arts!, however the chemistry between him and Lori Lynn Dickerson was off!, but overall his performance was awesome! (Bernhardt Rules!). James Hong, is fabulous here, as Alex's Mentor and trainer!, and was really likable, he rocked!. Donald Gibb, is awesome here as Ray once again and he cracked me up. however he has a lot less to do this time. Lori Lynn Dickerson, is terrible as the love interest, and had no chemistry with Dainel what so ever!. Pat Morita, is great here with what he has to do. Ong Soo Han, is very good as the main villain, however his fighting skills did not impress me, and he just seemed like a big strong military guard!, that being said he did kick a lot of ass, and looked intense!. Ron Hall and Nicholas Hill are both very likable. Overall, i highly recommend this give it a shot!, just don't expect the greatness of Bloodsport. ***1/2 out of 5",
         "There are some movies that you actually are supposed to hate. Kind of like a dish that isn't good for you or doing a small bit of gambling, you know you aren't supposed to enjoy it because it's wrong. But hey, we all have vices, right? Bloodsport 2 is one of those movies for me. The premise of the movie is pretty simple. An arrogant thief named Alex Cardo, played by Daniel Bernhardt, gets caught by the police after being setup by his partner. It turns out that Cardo is already a good martial artist, but when he goes to jail, he meets a person with even \"stronger kung fu\", named Sun (James Hong). The rest is pretty straight forward from there. A reformed criminal seeks redemption, a student learns the Ultimate Technique from his master. Said reformed jailbird/student enters to the Ultimate Death Match tournament to honor his master and gain back his honor. Along the way, we get a lot of new faces (and some old ones as well if you've seen the first movie), a ton of fights, some big bad evil former student, and some pathetic facsimile of a romance happen. Probably the strongest point of this film is the fight choreography and action sequences. I actually believe that when they were brainstorming this film, they decided to make a tournament fighter featuring different styles of martial arts. But they needed something to try and ensure some modicum of notoriety, so they tied it into the languishing franchise of \"Bloodsport\" (thanks for Dux getting tacitly outed as a fraud), picked up the services of Pat Murita, and called it good. But back to the point, you see a ton of different styles in this film and nearly all the fights are very well done. Bernhardt does a reasonable job as a Van Damme-clone (despite being his first film) and special mention go to Ron Hall and Ong Soo Han for their roles in this film as well. Gibb reprises his role as Ray Jackson as well, but it's more for comedic effect. That said, he does a fine job hamming it up. Otherwise, there isn't anything wrong with the technical aspects of production. The story has a ton of clichés, some of the dialogue is downright awful (\"You are a true warrior, Alex\" is one of the single most out of place lines of all time. It's the Bloodrayne sex scene of dialogue, but without Loken's umm... assets). The romance sub-plot is outright horrible and seemed like it was forced in as an afterthought for the purposes of trying to mirror the success of the original film as much as possible. The musical score isn't anything fantastic, but they at least made the pieces \"fit\" as best as possible and a few of the tunes are catchy. Some of the segments of the film are legitimately funny (as intended) and provide a welcome relief from the boring secondary plot elements. On the whole, there isn't much to the film other than the fight sequences. It does take some time to get to what we all want to see. It's worth the wait (or just the use of the fast forward feature on your DVD or other methods of delivery). If you enjoyed the first film, are a fan of tournament fighting movies, or are a fan of Bernhardt or Donald Gibb, you'll enjoy it. Otherwise, you might be best passing on this.",
         "Sequels are usually bad... Indeed, but this one... still passable. Of course, this film does not hold the good old magic and atmosphere of the 80s and it doesn't have Van Damme or Bolo Yeung, well you can't have it all. 90s were not that bad for this one. Daniel Bernhardt was not a bad replacement for Van Damme, but the problem is that he is constantly copying him! Especially in face expressions! But, OK, we are not here to compare these two guys, yes I know Van Damme is a real life champion and fighter, while Daniel is a model, but OK his fighting style and skills are good, he is good. Now, for the main stuff, this Kumite tournament was good! I like the fights, there is some karate, kung fu, judo, Brazilian jujitsu, tae kwon do... fine choreography... other things that are good are special appearances by Pat Morita and James Hong... the leading lady Lori Lynn Dickerson, very lovely, and to mention Philip Tan, well, at least we have Donald Gibb again as Ray \"Tiny\", as a main guard on kumite and promoter, still in his own comic relief... but he was used to look more like the first film. The story is rather different that from the first film, it is a classic low budget marital art movie. Alex Cardo (Bernhardt) get imprisoned after trying to steal a valuable sword from Pat Morita. During his time in prison, he learned so called \"Iron Fist\" from master Sun (James Hong). And after that he enters the Kumite tournament where he faces a fighter, former prison guard Demon, here played by Ong Soo Han, the guy's cube hair and acting makes his character look laughable, trying to be new Bolo Yeung aka Chong Li... but he still looks tough... OK, I say watch this film, but only if you are a fan of the franchise and martial arts fan.",
         "Bloodsport was absolutely brilliant. The fight scenes were coordinated very well. If you've seen the first Bloodsport you must see this one. The story was even good. I have seen the first three Bloodsport's and this one is definitely the best. What can I say? I loved it.",
         "The first 30 minutes of \"Bloodsport II\" are just plain ridiculous: a sort of \"Karate Kid (or is it Karate Grownup?) In Prison\", with a cut-rate Olivier Gruner (who is, in turn, a cut-rate Van Damme!) as the student and a cut-rate Miyagi as his teacher (actually, the real Miyagi, Pat Morita, is also in the cast!). Daniel Bernhardt shows little screen presence here, but it's his acting debut, so I guess he can be forgiven. But when the movie starts concentrating on the fighting it becomes quite good, with enough variety of styles among the different tournament participants to keep things interesting (there are even some submission victories, somewhat rare for this type of movie). Fighting female fans should note the presence of Lisa McCullough as the only woman fighter on board; she definitely knows her stuff. (**1/2)",
         "Bloodsport was absolutely brilliant. The fight scenes were coordinated very well. If you've seen the first Bloodsport you must see this one. The story was even good. I have seen the first three Bloodsport's and this one is definitely the best. What can I say? I loved it.",
         "This is a film with more of the same, the story seems to be used for many other films of this kind. The fighting scenes are not bad, on a scale from 1 to 10, I rate it a 5."
      ],
      "genres": [
         "Action",
         "Sport"
      ],
      "productionCompanies": ["FM Entertainment International N.V."],
      "summaries": [
         "After thief Alex Cardo gets caught while stealing an ancient katana in East Asia, he soon finds himself imprisoned and beaten up by the crowd there. Especially one of the guards, Demien, feels upset by Alex appearance and tortures him as often as he gets the opportunity. Alex finds one friend and mentor in the jailhouse, Master Sun, who teaches him a superior fighting style called Iron Hand. When a 'best of the best kumite' is to take place, Demien gets an invitation. Now Master Sun and Alex need to find a way to let Alex take part in the kumite too.",
         "Street fighter and thief, Alex Cardo (Daniel Bernhardt), steals an ancient sword from a wealthy business man, David Leung (Pat Morita). After being betrayed by his crime partners, Alex is sent to a brutal prison where violence is continuous. There, he meets Master Sun (James Hong) who teaches Alex honour and discipline, changing Alex's self. He also teaches Alex \"The Iron Hand,\" the deadliest of all fight disciplines. When Sun mentions the greatest fight tournament, the Kumite, Alex vows that he will win the tournament upon his release to honour Sun. His release comes quick, courtesy of Leung who makes a deal with Alex to retrieve the sword from his former friend, for that sword will be awarded to the Kumite's winner. As Alex battles through some of the toughest fighters in the world and is encouraged by his new friends (led by Donald Gibb), Alex bears a slim chance of defeating the greatest fighter the Kumite has ever seen: Demon, who was also the most brutal guard in Alex's prison days."
      ],
      "budget": 0
   },
   "movielensId": 667,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-01",
      "dvdReleaseDate": "2001-06-22",
      "directors": ["Alan Mehrez"],
      "runtime": 90,
      "movieId": 667,
      "title": "Bloodsport II",
      "mpaa": "R",
      "actors": [
         "Daniel Bernhardt",
         "Pat Morita",
         "Donald Gibb",
         "James Hong",
         "Lori Lynn Dickerson",
         "Philip Tan",
         "Ong Soo Han"
      ],
      "imdbMovieId": "0112536",
      "originalTitle": "Bloodsport II",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["0taW8Kejy2c"],
      "plotSummary": "After thief Alex Cardo gets caught while stealing an ancient katana in East Asia, he soon finds himself imprisoned and beaten up by the crowd there. One of the guards, Demon, feels upset by Alex appearance and tortures him as often as he gets the opportunity. Alex finds a friend and mentor in the jailhouse, Master Sun, who teaches him a superior fighting style called Iron Hand. When a 'best of the best kumite' is to take place, Demon gets an invitation. Now Master Sun and Alex need to find a way to let Alex take part in the kumite too.",
      "tmdbMovieId": 25087,
      "avgRating": 2.56678,
      "releaseYear": "1996",
      "numRatings": 1168,
      "posterPath": "/4jrgoLBgQgzeMZUCzSgy6SRWmf.jpg"
   }
}