{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114753",
      "video": false,
      "title": "Two Bits",
      "recommendations": [
         50441,
         55306,
         56087,
         87358,
         40800,
         53027,
         15059,
         32075,
         197583,
         45215,
         28313,
         43148,
         48958,
         43345,
         31955,
         96087,
         41807,
         58434,
         27594,
         17821
      ],
      "backdrop_path": "/m8PJ4fjK8PmwLFzWVxnDk4OGfFA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gennaro Spirito",
               "gender": 0,
               "credit_id": "52fe459ac3a36847f80d0759",
               "name": "Jerry Barone",
               "profile_path": null,
               "id": 124150,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Gitano Sabatoni",
               "gender": 2,
               "credit_id": "52fe459ac3a36847f80d0763",
               "name": "Al Pacino",
               "profile_path": "/f9tBVwcNHnawvMoyuuzmKvEhBsb.jpg",
               "id": 1158,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Luisa Spirito",
               "gender": 1,
               "credit_id": "52fe459ac3a36847f80d076d",
               "name": "Mary Elizabeth Mastrantonio",
               "profile_path": "/jNIGODCEy216bbPnj28ky5E4L3Q.jpg",
               "id": 1161,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Uncle Joe",
               "gender": 2,
               "credit_id": "52fe459ac3a36847f80d0771",
               "name": "Joe Grifasi",
               "profile_path": "/cesXbWZaKHeOhsSdfbF9mB9750w.jpg",
               "id": 4887,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Dr. Wilson",
               "gender": 2,
               "credit_id": "52fe459ac3a36847f80d0775",
               "name": "Geoff Pierson",
               "profile_path": "/vhLTZ86i4fa5NbhpHoORIe0pKIl.jpg",
               "id": 25879,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe459ac3a36847f80d075f",
               "name": "Joseph Stefano",
               "profile_path": null,
               "id": 7300,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe459ac3a36847f80d0769",
               "name": "James Foley",
               "profile_path": "/ujAhQvNNnBqa6ZP2C46DMdAp09w.jpg",
               "id": 15890,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.343577,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40628,
      "vote_count": 14,
      "budget": 0,
      "overview": "It's a hot summer day in 1933 in South Philly, where 12-year old Gennaro lives with his widowed mom and his ailing grandpa, who sits outside holding tight to his last quarter, which he's promised to Gennaro and which Gennaro would like to have to buy a ticket to the plush new movie theater. But grandpa's not ready to pass on the quarter or pass on to his final reward: he has some unfinished business with a woman from his past, and he enlists Gennaro to act as his emissary.",
      "similar": [],
      "original_title": "Two Bits",
      "runtime": 85,
      "poster_path": "/k4jOFtt7NqEtLnoI2Rs3BqKNHtI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1995-10-22",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "You're never too old to believe in a dream. Or too young to make one come true!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Foley"],
      "runtime": 85,
      "synopsis": "A hot summer day in South Philadelphia, 1933, the Great Depression at its worst. Gennaro remembers this day when he was 12, because he was excited about the opening of a new movie theater in town called La Paloma. He chats with his Grandpa in the backyard, who has promised him a certain quarter if he dies. Gennaro meets his pal Tullio, and the two of them discuss what to do that day. They go to a church where they luck into a dramatic fracas of a funeral interrupting a wedding. Gennaro returns home where he wakes up his sleeping Grandpa. Gennaro says he feels bad waiting for him to die just for the quarter, and they talk more about what death must be like. Grandpa tells him that God is building a house in heaven for him. Gennaro leaves, determined to find another way to get a quarter and go to La Paloma. Gennaro tries singing on a street corner, until his aunt comes along and takes the only 3 cents he's earned. Gennaro goes by a dry goods store to see if he can work there. A desperate woman comes in and steals a bag of potatoes for her kids. The storeowner gives Gennaro a nickel for trying to help. Gennaro comes home to find a doctor tending to Grandpa, who has injured himself in a fall. Grandpa tells him when he was unconscious, he saw a vision of heaven, and it looked like La Paloma. The doctor tells Gennaro's mother that Grandpa should be kept in bed. Gennaro later encounters the doctor, who offers him a dime to clean the ashes out of his basement furnace. Gennaro goes to his house and has a strange encounter with the doctor's wife, who reveals that she and the doctor are sexually frustrated. She offers him a dime to come upstairs with her, but he runs away. Gennaro tells Tullio about the incident, and they agree to go back to her house together. There they find the doctor's dead wife hanging from a rope. Gennaro tells Grandpa what happened, and he reassures him he was not at fault. Gennaro's mother first shows sympathy, then gets mad at him for still thinking about money for the movies. She then tells him of her recurring dream that his father had not died, but she came to accept that was impossible. Gennaro is captivated by Grandpa's tale of how he resisted having sex with his first girlfriend before he got married to her, but he had sex with another girl instead, leaving him feeling guilty ever since. Grandpa asks Gennaro to find the woman and apologize for him, because she was later beaten and shamed for losing her virginity to him. Gennaro goes to the elderly woman's house and tells her that Grandpa is sorry, asking her to forgive him. She asks him to kiss her and she will forgive him, which Gennaro does. Gennaro runs home to tell Grandpa this news, and his mother gives him a dime for his service, so he runs to La Paloma... where he finds they are charging 50¢ for the evening. He walks around the neighborhood until night falls, then goes home to find relatives gathered and his mother crying. Gennaro walks around his grandfather's bedroom, thinking he has died, but Grandpa is being attended to by a new doctor in the backyard. Grandpa tells Gennaro that he still might be able to get to a late show at the movies. The relatives gather around Grandpa and badger the doctor for not helping him more. Gennaro goes out and sees people dancing in the streets, wondering how they can be so happy. He goes to a church to pray. Gennaro goes home to find Grandpa lying on the ground with relatives watching him. Grandpa tells Gennaro to not let him fall asleep, while he tells him to promise to always want. Having said this, he dies. A moment later, the Standing Liberty quarter rolls out of Grandpa's hand, and Gennaro picks it up. Gennaro goes to La Paloma, where he can now buy a movie ticket with his 50¢. As he enters the theater, he hears Grandpa's voice from heaven, saying it looks like La Paloma.",
      "writers": ["Joseph Stefano"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114753/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NjA1Mzc2N15BMl5BanBnXkFtZTcwODI2NjYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Al Pacino, Mary Elizabeth Mastrantonio, Jerry Barone | See full cast and crew »"],
      "reviews": [
         "This movie reminded me of some foreign films I own, low-key films which feature nice storytelling. There are no good guys vs. bad guys, no action, no blood, no sex: just a story of a day back in the Depression era in South Philadelphia. The story centers around a young boy \"Gennero\" (Jerry Barone) trying to raise \"two bits\" (25 cents) to see a movie. It features his dying grandfather, played nicely by Al Pacino. Along the way the 12-year-old encounters interesting people and events. Pacino dishes out the usual grandfatherly advice and well meaning-but-on-Biblical theology (\"God puts a brick on your house in heaven every time you do a good deed and he takes one away when you are bad.\") Some have criticized Pacino for taking this role. I guess they want him to be a cop in every film. Well, he's a great actor and shows his diversified talents well in here. Whatever.....this film is loaded with charm and a nice story that's like a good book: hard to put down once you start. At 84 minutes, it doesn't overstay its welcome, either. Even though there is little profanity, I would not recommend this as family fare because the film touches on a disturbing doctor and his wife. Overall, I really enjoyed this movie and glad to see it's out on DVD now, too.",
         "If you have experienced loss of someone close this movie will surely have an effect on you. It's a wonderful look at a relationship between a boy and his grandfather in the depression era. As always Al Pacino (the best actor who ever lived) is brilliant and heartwarming in this sincere yet all together different role for him. A short but bittersweet film that will take you on a sad but very personal journey. I've seen this film about 10 times and have never made it all the way through without crying. This is a beautiful film in todays blockbuster big movie era. No special effects just emotions. Definitely better than 5.8 out of 10 I would say more like 8 out of 10. Mary Elizabeth and Al are magnificent-",
         "I tend to be a sucker for coming-of-age dramas like these, and this is one of the good ones. The premise of a boy wanting to accumulate 25 cents to go to the movies is simple but engaging and effective. Modern day viewers might look at his quest as stupid and redundant, but that's easy to say when you have enough money to go the movies every weekend. To this little boy, it's his dream to go to the new local cinema on opening day. Plus, in the days of the depression, the cinema meant much more than it does now. Nowadays, people don't respect the institution. You see people put their feet up on the chairs in front of them, throw popcorn at the screen, shamelessly talk amongst themselves and to give a thoroughly modern example, let their cell phones ring. I think it was Gene Siskel, who said the most beautiful sight is seeing a movie audience as the screen shines over them and their eyes are glued to the screen. Cinema just had that magical feeling to people. So though I was born five decades later, I was still able to put myself in the main character's shoes. Joseph Stefano, known mostly for his screenplay for \"Psycho,\" wrote this nice character-driven drama that took me on a journey. Of course, that's also thanks to the child actor who played the main character. He has a certain authenticity to him that not all child actors have. If a child actor can say his lines like he means them and deliver emotions without dialogue, he's doing a good-enough job. Not only that, but he holds his own opposite the brilliant Al Pacino. Like always, Pacino gives a powerful performance, and I felt the character he played was different and unique. This time he's not a gangster or a cop. Though he has a supporting role, he makes his screen time memorable. Mary Elizabeth (I'm not gonna attempt to say her last name) is great as well. The situations our protagonist gets into are sometimes funny, sometimes sad. As trivial as his quest to get 25 cents may seem, I wanted him to accomplish it. The ending is sad, though not unexpected. Mainly, it's the richly developed characters and their interactions that make this a solid film. My score: 8 (out of 10)",
         "In my life I only had two real soul-stirring moments. One of those two was due to this film. I believe if you ever lost a person real close to you this is an absolute must see. I very very rarely cry with a movie but Two bits (especially the last phrase) cut right trough me. An amazing performance by Al Pacino but the whole tone was right on the spot. It's done in a way with knowledge of the medium and respect to the delicateness of telling a story, the right way. I don't think after seeing this movie i will ever want to see another James Foley film. Not that i didn't like the experience. But because of the fact that i liked it too much. And every other film by this director could only be worse. Hats of to the writer: Joseph Stefano. Because beside the fact that the film itself has a decent plot, the final sentence as i said before really blew me away. This movie is readable in different ways so everybody can enjoy it. Only thing is everybody will read different things in it. A must see...",
         "\"Two Bits\" was a noticeable change for Al Pacino, casting him as a man getting his grandson (Jerry Barone) to rectify an age-old matter in 1933 Philadelphia in exchange for a chance to go to the movies. Watching the movie, one gets a sense of the poverty characteristic of the Great Depression, but also how people understood that they had to try and go on no matter what. I realize that some people may consider it bad taste - if not unethical - to use the Great Depression for the setting of a nearly magical story, but I wish to assert that the movie did a very impressive job portraying the setting without getting sappy; then again, how could an Al Pacino movie be sappy? I recommend it. Also starring Mary Elizabeth Mastrantonio.",
         "Director James Foley knows how to get attention of the audience. His films are often emotional, but never overly sentimental. In my opinion Glengarry Glen Ross is still Folley's best work ever. But Two Bits comes very close. It is a magical film about making dreams come true. Breathtaking cinematography, touching story, great acting by Al Pacino and a score with a \"wow\" factor makes this a little masterpiece. The beautiful Mary Elizabeth Mastrantonio is very convincing as the widowed mom and the talented young actor Jerry Barone (very strange that this is his first and last role) is awesome. Don't miss this one. RATING: 8,5/10",
         "Lack of action makes the audience pay attention to the characters, their thoughts, their needs and wants -- but especially their relationships with each other. This cast is outstanding in conveying the thoughts and feelings of persons experiencing the pain and suffering of the depression, yet ever remindful of each others' wants and needs. I loved every minute of it!! The second time through -- and I want to buy it to be able to experience it as often as I need this kind of reminder . . . and to share with my family, especially my grandkids.",
         "This film is really good. If you like Italian, if you have a touch of sentimentalism in you, if you like Pacino (who doesn't)& if you're nostalgic for films about yesteryear (1930's, The Great Depression), then this one'll be a treat for you. Twelve year old Gennaro wants to go to the \"air-cooled\" La Paloma Movie House. He needs 25 cents but money is hard to come by at this time. The kid is resourceful though. He's willing to work for his goal. Jobs are scarce & people are dying from lack of food & things they cannot afford like medicine. \"Grampa Pacino\" is on his death-bed out in the back yard but he 'can't die' until he gets forgiven for something he did decades ago. He gets his grandson to ask the person for forgiveness - THEN he can have the 25 cents. I really like the closeness of these two characters. I don't know where this young Jerry Barone (Gennaro) came from but he's a good actor & he's handsome. (He could probably play Hispanic, too.) So enjoy a bit of the old country with Two Bits. You'll be surprised. There's nothing' sappy about it. It's for everyone...",
         "This movie is beautifully done. It is one of my favorites. It is a glimpse at another time. It is a movie about values. The whole movie is about one big day in the life of a boy growing up in the depression in Philadelphia and the wisdom his grandfather passes on. It is a touching and rewarding movie. The hopelessness of the depression comes out effectively in the movie. Gennaro and Tullio are just ordinary kids that aren't perfect. There is an interesting interplay between a child's honest selfishness and the relationship between wanting and needing. Pacino: \"Your heart wants, your belly needs.\" Wanting is good because it requires hope. Many touching lines between Pacino (grandfather) and Barone (Gennaro). There is some humor also. Favorite line: Gennaro- \"There's no milk!\" See it and find out why I liked that line!",
         "You never get tiered from watching this movie. first this movie succeeds to touch your heart and make it wonder with the little boy Gennaro \"Jerry Barone\" He did his part very well, with his pure wondering face and great acting managed to make this movie one of the best drama screen ever. The story carry a pain of a widow wife, mistakes of an ill old man and a hope of a little child. Manage to present the different classes among people 'How can this people have money while we are poor, and how can they celebrate while my grandpa. is sick' Genaro said this movie rates 9/10"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Arthur Cohn Productions",
         "Capella Films",
         "Connexion Film Productions"
      ],
      "summaries": ["It's a hot summer day in 1933 in South Philly, where 12-year old Gennaro lives with his widowed mom and his ailing grandpa, who sits outside holding tight to his last quarter, which he's promised to Gennaro and which Gennaro would like to have to buy a ticket to the plush new movie theater. But grandpa's not ready to pass on the quarter or pass on to his final reward: he has some unfinished business with a woman from his past, and he enlists Gennaro to act as his emissary."],
      "budget": 0
   },
   "movielensId": 67,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-22",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["James Foley"],
      "runtime": 85,
      "movieId": 67,
      "title": "Two Bits",
      "mpaa": "",
      "actors": [
         "Jerry Barone",
         "Al Pacino",
         "Mary Elizabeth Mastrantonio",
         "Joe Grifasi",
         "Geoff Pierson"
      ],
      "imdbMovieId": "0114753",
      "originalTitle": "Two Bits",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "It's a hot summer day in 1933 in South Philly, where 12-year old Gennaro lives with his widowed mom and his ailing grandpa, who sits outside holding tight to his last quarter, which he's promised to Gennaro and which Gennaro would like to have to buy a ticket to the plush new movie theater. But grandpa's not ready to pass on the quarter or pass on to his final reward: he has some unfinished business with a woman from his past, and he enlists Gennaro to act as his emissary.",
      "tmdbMovieId": 40628,
      "avgRating": 3.35227,
      "releaseYear": "1995",
      "numRatings": 176,
      "posterPath": "/k4jOFtt7NqEtLnoI2Rs3BqKNHtI.jpg"
   }
}