{
   "tmdb": {
      "original_language": "bn",
      "keywords": [
         {
            "name": "broken engagement",
            "id": 978
         },
         {
            "name": "arranged marriage",
            "id": 2692
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "calcutta",
            "id": 33485
         }
      ],
      "imdb_id": "tt0052572",
      "video": false,
      "title": "The World of Apu",
      "recommendations": [
         897,
         5801,
         20108,
         248935,
         112698,
         148050,
         499,
         15804,
         37230,
         48035,
         70580,
         91094,
         34528,
         43976,
         44065,
         216,
         34181,
         147553,
         31217,
         43878
      ],
      "backdrop_path": "/4I8yyzb6i2gS0Zmhde9k7iE76dD.jpg",
      "revenue": 16000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Apurba Roy",
               "gender": 2,
               "credit_id": "52fe4289c3a36847f80268cb",
               "name": "Soumitra Chatterjee",
               "profile_path": "/dUTWBl9fgzi2RuTNRYqImCUOf36.jpg",
               "id": 13752,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Aparna",
               "gender": 1,
               "credit_id": "52fe4289c3a36847f80268cf",
               "name": "Sharmila Tagore",
               "profile_path": "/vb9LSAVPvn0WJsPTwb6um9YrrTy.jpg",
               "id": 13753,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kajal",
               "gender": 0,
               "credit_id": "52fe4289c3a36847f80268d3",
               "name": "Alok Chakravarty",
               "profile_path": null,
               "id": 13755,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Pulu",
               "gender": 0,
               "credit_id": "52fe4289c3a36847f80268d7",
               "name": "Swapan Mukherjee",
               "profile_path": null,
               "id": 13756,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Shashinarayan",
               "gender": 0,
               "credit_id": "52fe4289c3a36847f80268db",
               "name": "Dhiresh Majumdar",
               "profile_path": null,
               "id": 13757,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Shashinarayan's wife",
               "gender": 0,
               "credit_id": "52fe4289c3a36847f80268df",
               "name": "Sefalika Devi",
               "profile_path": null,
               "id": 13759,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Landlord",
               "gender": 0,
               "credit_id": "52fe4289c3a36847f80268e3",
               "name": "Dhiren Ghosh",
               "profile_path": null,
               "id": 13760,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4289c3a36847f80268c1",
               "name": "Bibhutibhushan Bandyopadhyay",
               "profile_path": null,
               "id": 13744,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4289c3a36847f80268c7",
               "name": "Ravi Shankar",
               "profile_path": "/jruqRUiLeYXxEx1bs6xnfBHro6h.jpg",
               "id": 13745,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4289c3a36847f80268e9",
               "name": "Satyajit Ray",
               "profile_path": "/5OwiMtEHZGaTEnxr3lz9sNkHKro.jpg",
               "id": 12160,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4289c3a36847f80268ef",
               "name": "Satyajit Ray",
               "profile_path": "/5OwiMtEHZGaTEnxr3lz9sNkHKro.jpg",
               "id": 12160,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4289c3a36847f80268f5",
               "name": "Satyajit Ray",
               "profile_path": "/5OwiMtEHZGaTEnxr3lz9sNkHKro.jpg",
               "id": 12160,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4289c3a36847f80268fb",
               "name": "Dulal Dutta",
               "profile_path": null,
               "id": 12167,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4289c3a36847f8026901",
               "name": "Durgadas Mitra",
               "profile_path": null,
               "id": 12169,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4289c3a36847f8026907",
               "name": "Bansi Chandragupta",
               "profile_path": null,
               "id": 12168,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4289c3a36847f802690d",
               "name": "Subrata Mitra",
               "profile_path": null,
               "id": 12166,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "568d7d53c3a36858ea000403",
               "name": "Aminyanath Mukherji",
               "profile_path": null,
               "id": 1559098,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "568d7d5dc3a3685906000450",
               "name": "Bansi Chandragupta",
               "profile_path": null,
               "id": 12168,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "568d7d66c3a36858ec0003df",
               "name": "Subodh Das",
               "profile_path": null,
               "id": 1174268,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "568d7d6d9251416b4500040a",
               "name": "Chhedilal Sharma",
               "profile_path": null,
               "id": 1174277,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "568d7d75c3a36858ea00040c",
               "name": "Sakti Sen",
               "profile_path": null,
               "id": 1559099,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "568d7d7ec3a36858fc0003d7",
               "name": "Anil Choudhury",
               "profile_path": null,
               "id": 1559024,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "568d7d869251416b4e0003e8",
               "name": "Nityananda Datta",
               "profile_path": null,
               "id": 1305288,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "568d7d90c3a36858f40003c0",
               "name": "Shailen Dutta",
               "profile_path": null,
               "id": 1559069,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "568d7d98c3a36858f90003f0",
               "name": "Tapeshwar Prasad",
               "profile_path": null,
               "id": 1559100,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "568d7da29251416b400003f7",
               "name": "Amiya Sanyal",
               "profile_path": null,
               "id": 1559101,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "568d7db89251416b470003df",
               "name": "Prabhas Bhattacharya",
               "profile_path": null,
               "id": 1174281,
               "department": "Lighting",
               "job": "Lighting Technician"
            },
            {
               "gender": 0,
               "credit_id": "568d7dc2c3a36858ec0003f3",
               "name": "Krishna Das",
               "profile_path": null,
               "id": 1168086,
               "department": "Lighting",
               "job": "Lighting Technician"
            },
            {
               "gender": 0,
               "credit_id": "568d7dcac3a3685902000432",
               "name": "Anil Pal",
               "profile_path": null,
               "id": 1559102,
               "department": "Lighting",
               "job": "Lighting Technician"
            },
            {
               "gender": 0,
               "credit_id": "568d7dd3c3a36858f40003c7",
               "name": "Bhabaranjan Roy",
               "profile_path": null,
               "id": 1559103,
               "department": "Lighting",
               "job": "Lighting Technician"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.422352,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 896,
      "vote_count": 50,
      "budget": 0,
      "overview": "Apu is a jobless ex-student dreaming vaguely of a future as a writer. An old college friend talks him into a visit up-country to a village wedding....",
      "similar": [
         334,
         1562,
         858,
         1374,
         637,
         164,
         745,
         401,
         439,
         343,
         335,
         675,
         744,
         425,
         10795,
         1579,
         881,
         1381,
         2024,
         3170
      ],
      "original_title": "অপুর সংসার",
      "runtime": 117,
      "poster_path": "/6Tz1Q69o2n3Zwb0ZffzPL0nFt2T.jpg",
      "spoken_languages": [{
         "name": "বাংলা",
         "iso_639_1": "bn"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Satyajit Ray Productions",
         "id": 26424,
         "origin_country": ""
      }],
      "release_date": "1959-05-01",
      "vote_average": 8.3,
      "belongs_to_collection": {
         "backdrop_path": "/b5zCX85EvJpizJzA2WaQmkd6DN6.jpg",
         "name": "The Apu Collection",
         "id": 158391,
         "poster_path": "/kDZJiqL5bCWsbdw2WFqwQoYLUhj.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Satyajit Ray"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Bibhutibhushan Bandyopadhyay",
         "Satyajit Ray"
      ],
      "originalLanguage": "Bengali",
      "imdbLink": "http://www.imdb.com/title/tt0052572/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNzgwMzMwOV5BMl5BanBnXkFtZTcwOTQwMzQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Soumitra Chatterjee, Sharmila Tagore, Alok Chakravarty | See full cast and crew »"],
      "reviews": [
         "This movie is Ray at his best. Its sublime. Its distilled to perfection. You need not hear the dialogs or read the subtitles to follow and appreciate it. The visuals and background score tell the store more eloquently. The movie has a soul which will get destroyed if you make even the slightest change to the story, acting, cinematography, music etc. Ray has brought out the best in his actors. They are not experienced actors though both of the leading pair later go on achieve mega success as movie stars. If you blink an eye, you will miss out on the emotions captured. For example, when Aparna is brought to her new home, there is moment in which she matures \u0096 from a girl to a woman \u0096 while gazing out of the torn curtain. There are several such brief moments. The dialog is minimalist but enchanting. The letter from Aparna to Apu captures love in all its glory \u0096 longing, desire, concern and trust. Its movie-making at its best.",
         "Apur Sansar (The World of Apu) is the stunning final chapter of Satyajit Ray's Apu Trilogy, one of the most widely acclaimed series in film. While Pather Panchali and Aparajito, the trilogy's first two, are extremely well crafted, the lack the heart-wrenching beauty of this installment. These three films revolve around tragedy, and it has an almost predestined quality to it, which reminded me somewhat of Stanley Kubrick's excellent, \"Barry Lyndon.\" That's where the similarities end of course, as this film is warm and radiates humanity, and Lyndon (as well as all of Kubrick's work) is cold and icy. Ray's rich lyrical realism breathes beauty in the mundane acts of his characters. The film opens as Apu, now a young man, attempts to eek out a living. He searches relentlessly for work, most of which is monotonous and doesn't pay well. However his pudgy friend Pulu invites him to a wedding, and Apu obliges, hoping maybe this display of love will help inspire him and the novel he is writing. In a fascinating turn of events (which I won't spoil,) Apu finds himself coming back to Calcutta married. Aparna, his new bride, is used to a life of luxury outside of the big city` but she is prepared for a life of poverty with her new husband. In one of the most beautiful sequences in film, Apu and his bride slowly begin to love and care for one another. The beauty of this is that we never see them embrace, or kiss or make love. Instead we see it in gestures, in window curtains, in little notes Aparna puts in Apu's cigarettes reminding him only to have one after every meal. Their love is like a dream of love we've had, one that's so innocent and wonderful we want to dream forever. But like all dreams, Apu must wake up. Happiness is just a fleeting emotion for Apu, one that enters his life at random points and then dissapears. Apu wanders bitterly through the Indian landscape, searching for solace and peace. The end moments cannot be explained in words, and simply must be experienced. One of the greatest films of all time. 10/10",
         "The final episode of the Trilogy takes us to a young adult Apu. Received the British Film Award which Sathyajits' other two episodes (Song of the Road, Unvanquished) also received. This movie together with the other two movies are a monumental work in movie making. The way the story is portrayed, and the use of many details, enrich the emotional experience it provides. One can recall the way the screen of the movie theatre fades into the window of the horse carriage, or the way the hole on the window curtain reverberates with the spotted decorations on the actress face and etc. This a \"must see\" movie for all, in the different ways emotions are expressed and the way it takes the audience in a roller coater ride of emotions. It is an enriching and a moving experience. It reinforces and reinvigorates the humanity within each of us. To enjoy the movie most, viewers should see the first two episodes in sequence before viewing \"Apur Sangsar.\"",
         "The first time I saw this movie was just after it was released in the United States. Ravi Shankar was becoming popular and the fact he did the score added to the movie's interest. But Satyajit Ray is really in a class by himself. The movies -- there are three in the series, this one being the last, are mostly acted by amateurs. The trilogy starts with Pather Panchali, with Apu being a child. Next, Aparajito shows Apu growing up, going to school and learning English because that was the only way to get ahead in the grinding poverty of Bengal. The last of the trilogy, the World of Apu shows Apu marrying, his wife dying, his leaving his son with his wife's parents and then going away to find himself. How the movie ends is your task. But each time I see it, tears cloud my eyes and my stomach turns over in joy and \u0085\u0085 Let's just say the Academy gave Ray a long overdue Oscar for his films which are universal in appeal.",
         "\"The World of Apu\" is a tale joy of and tragedy, unmatched in its beauty and profound emotion. Satyajit Ray's final film in the Apu trilogy ranks with King Vidor's \"The Crowd\" and Carl Theodor Dreyer's \"Ordet\" as a cinema landmark of family life. But it far exceeds those films in its visual poetry. Apu's journey with a friend and his unplanned marriage sets the stage for a story of domestic life in all its simple joy and awful despair. The serene, contented beauty of the girl is a soaring vision, matched in its humanity only by the broken heart of Apu when she dies. The pages of an unfinished novel, a life's work floating in the mountain air like the seeds of a dandelion, become the symbol of Apu's devastation. The rebirth of life and hope realized in the child illustrates a fundamental belief of Hinduism. Beautifully photographed and edited, \"The World of Apu\" is a masterpiece of film as narrative storytelling. It is the most \"Indian\" of all Indian films.",
         "I found Apur Sansar, the final part of the Apu Trilogy, every bit as superb as its prequels. I liked the pacing even better than its predecessors, as there was not a single moment that didn't keep me interested. Although the ending wasn't as powerful as its prequels, I thought it was a more hopeful and fitting ending for the saga. However, it did give me the feeling that I didn't want the story to end at all. Soumitra Chatterjee's debut performance as the adult Apu was truly Oscar-worthy (like Karuna Bannerjee who played his mother in the first two films) and a young Sharmila Tagore was also convincing in her debut performance as his wife. Overall, I'd say Apur Sansar is my second favourite in the Apu Trilogy, after Aparajito. Now that I've finally finished watching the Apu Trilogy, I must say this is probably the greatest film trilogy I've ever seen. Although it's a simple story about a country boy's growth to adulthood, it felt like I was watching a truly epic saga. Satyajit Ray really is one of the greatest filmmakers of the 20th century in my opinion. 10/10",
         "The final episode of the Trilogy takes us to a young adult Apu. IMdb seems to have missed the British Film Award that this and Sathyajits' other two episodes (Song of the Road, Unvanquished) received. This movie together with the other two movies are a monumental work in movie making. The way the story is portrayed, and the use of many details, enrich the emotional experience it provides. One can recall the way the screen of the movie theatre fades into the window of the horse carriage, or the way the hole on the window curtain reverberates with the spotted decorations on the actress face and etc. This a \"must see\" movie for all, in the different ways emotions are expressed and the way it takes the audience in a roller coater ride of emotions. It is an enriching and a moving experience. It reinforces and reinvigorates the humanity within each of us. To enjoy the movie most, viewers should see the first two episodes in sequence before viewing \"Apur Sangsar.\"",
         "About midway through Apur Sansar there is an interjection of a film in the style of typical Indian cinema. The contrast in Ray's approach with his classic trilogy is astonishing, considering the mileau in which it emerged. Filmmaking in the 1950's in Hollywood as well as India was studio-driven with light-weight stories having little connection with reality. As another commentator pointed out, this film is closer to the Italian realism films such as \"The Bicycle Thief\". Every shot is a masterpiece of composition and lighting. It does not intrude on the story, but advances it. Likewise, the music composed by Ray, is natural and integral to the scene. This ranks with the all-time greatest watershed movies.",
         "\"Apur Sansar\" is the greatest film ever made. Ray handles every aspect of storytelling on film with so much grace that it's impossible to resist his masterwork. Soumitra Chatterjee's performances is easily the greatest ever put on film. His work is heart-wrenching and haunting, going from a boyish innocence to a matured, cynical bitterness about life and the world. Ray's movie if full of loneliness and heartbreak. It makes you realize just how fragile human relationships are, how easily people die, grieve and yearn for love and redemption. The music is incredible. The combination of the movie's score and Ray's images is magical. You'll never forget it.",
         "*SPOILER ALERT* WORLD OF APU (APUR SANSAR) only suffers in comparison with its' predecessors - it isn't the masterpiece that PATHER PANCHALI is, but it's still a GREAT film. Ray - early in his career - was already a master at balancing human drama and unforgettable visual stylishness, and - perhaps because of this visual sense of style - I didn't mind the slightly elevated level of melodrama seen here. The final scenes of the three films are similar - with one difference here - in WORLD OF APU, Apu is walking into the unknown, with a sense of optimism and hope (compared with the grief in the first two installments), curious as to what life will next bring, and confident that the knowledge he will gain will only make him a richer person. This film, and the entire trilogy, easily stands alongside BICYCLE THIEF or SANSHO THE BAILIFF as one of the greatest human dramas to have ever been made. There are few films that I think everyone should see at least once - the APU trilogy is near the top of my list."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Satyajit Ray Productions"],
      "summaries": ["Apu is a jobless former student dreaming vaguely of a future as a writer. An old college friend talks him into a visit up-country to a village wedding. This changes his life, for when the bridegroom turns out to be mad, Apu's friend asks him to become the husband. After initial revulsion at the idea, Apu agrees. Apu takes his exquisite bride, Aparna, back to Calcutta. But Aparna dies while giving birth, Apu leaves Calcutta, crazy with grief, and his son Kajal is left abandoned with his wife's parents. Only after a long period of total indifference to worldly responsibilities, does Apu become capable of returning to the world."],
      "budget": 0
   },
   "movielensId": 670,
   "movielens": {
      "languages": ["বাংলা"],
      "releaseDate": "1959-05-01",
      "dvdReleaseDate": "2003-10-28",
      "directors": ["Satyajit Ray"],
      "runtime": 117,
      "movieId": 670,
      "title": "The World of Apu",
      "mpaa": "PG-13",
      "actors": [
         "Soumitra Chatterjee",
         "Sharmila Tagore",
         "Alok Chakravarty",
         "Swapan Mukherjee",
         "Dhiresh Majumdar",
         "Sefalika Devi",
         "Dhiren Ghosh"
      ],
      "imdbMovieId": "0052572",
      "originalTitle": "অপুর সংসার",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["mgv68E_o6VM"],
      "plotSummary": "Apu is a jobless ex-student dreaming vaguely of a future as a writer. An old college friend talks him into a visit up-country to a village wedding....",
      "tmdbMovieId": 896,
      "avgRating": 4.11772,
      "releaseYear": "1959",
      "numRatings": 824,
      "posterPath": "/6Tz1Q69o2n3Zwb0ZffzPL0nFt2T.jpg"
   }
}