{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tastelessness",
            "id": 3926
         },
         {
            "name": "film and cinema",
            "id": 6026
         },
         {
            "name": "based on tv series",
            "id": 10988
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "scientist",
            "id": 14760
         }
      ],
      "imdb_id": "tt0117128",
      "video": false,
      "title": "Mystery Science Theater 3000: The Movie",
      "recommendations": [
         28820,
         831,
         18116,
         16806,
         31393,
         48815,
         28743,
         193611,
         39411,
         11959,
         36759,
         39043,
         2193,
         27070,
         44895,
         38295,
         28117,
         31385,
         15581,
         51321
      ],
      "backdrop_path": "/JsXy2Gnq5zpbUwezEDkIR1wVcN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Mike Nelson",
               "gender": 2,
               "credit_id": "52fe4381c3a36847f80594f7",
               "name": "Michael J. Nelson",
               "profile_path": "/yjr6QUxPxStansoq1HGVa5bcg4X.jpg",
               "id": 30020,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Dr. Clayton Forrester / Crow T. Robot",
               "gender": 0,
               "credit_id": "52fe4381c3a36847f80594ef",
               "name": "Trace Beaulieu",
               "profile_path": "/68NCNTfAtIMrcElESagXhmRXUHY.jpg",
               "id": 30019,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gypsy",
               "gender": 2,
               "credit_id": "52fe4381c3a36847f80594fb",
               "name": "Jim Mallon",
               "profile_path": null,
               "id": 30021,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tom Servo",
               "gender": 2,
               "credit_id": "52fe4381c3a36847f80594ff",
               "name": "Kevin Murphy",
               "profile_path": "/bieKRPNDn4GGDEmYZazWHJi7sVI.jpg",
               "id": 30022,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Benkitnorf",
               "gender": 2,
               "credit_id": "52fe4381c3a36847f8059503",
               "name": "John Brady",
               "profile_path": null,
               "id": 30023,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4381c3a36847f8059509",
               "name": "Jim Mallon",
               "profile_path": null,
               "id": 30021,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56f8787ac3a3686a5e008b1c",
               "name": "Bill Johnson",
               "profile_path": "/rHvFtMDqxsZfqqWth4FQIPFBIsO.jpg",
               "id": 41563,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54a4d1899251411d5300deee",
               "name": "Michael J. Nelson",
               "profile_path": "/yjr6QUxPxStansoq1HGVa5bcg4X.jpg",
               "id": 30020,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54a4d19b925141212700a159",
               "name": "Trace Beaulieu",
               "profile_path": "/68NCNTfAtIMrcElESagXhmRXUHY.jpg",
               "id": 30019,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54a4d1afc3a3684d8f00652c",
               "name": "Jim Mallon",
               "profile_path": null,
               "id": 30021,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54a4d1bf9251411f90000a6b",
               "name": "Kevin Murphy",
               "profile_path": "/bieKRPNDn4GGDEmYZazWHJi7sVI.jpg",
               "id": 30022,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54a4d1cdc3a3685542010ea8",
               "name": "Mary Jo Pehl",
               "profile_path": "/fjGlh6boLpA4rCGmbsTIz70LnXT.jpg",
               "id": 117650,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54a4d1e29251414e2800e2e9",
               "name": "Paul Chaplin",
               "profile_path": null,
               "id": 1228357,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "54a4d1f69251414d2700dd7e",
               "name": "Bridget Jones Nelson",
               "profile_path": "/oGsUfUShFsF4DgBFjZsyfztR4Xc.jpg",
               "id": 1228337,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54a4d206c3a3686428004686",
               "name": "Jim Mallon",
               "profile_path": null,
               "id": 30021,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "551d7fd4c3a3683a0d0007bc",
               "name": "Jeff Stonehouse",
               "profile_path": null,
               "id": 1380199,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "551d7fe59251413741000799",
               "name": "Trace Beaulieu",
               "profile_path": "/68NCNTfAtIMrcElESagXhmRXUHY.jpg",
               "id": 30019,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "551d7ff5c3a3683a0d0007bf",
               "name": "Kevin Murphy",
               "profile_path": "/bieKRPNDn4GGDEmYZazWHJi7sVI.jpg",
               "id": 30022,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "551d800c92514137430007cb",
               "name": "Joel Hodgson",
               "profile_path": "/cb5qvZwICn0kKOhzTB1i5rCKSgb.jpg",
               "id": 30024,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "551d801fc3a3683a180007ae",
               "name": "Billy Barber",
               "profile_path": null,
               "id": 89006,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "551d8060c3a3683a25000750",
               "name": "Jef Maynard",
               "profile_path": null,
               "id": 1448827,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "551d8071c3a3683a20000806",
               "name": "Rando Schmook",
               "profile_path": null,
               "id": 1448828,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "551d807ec3a3683a0d0007d1",
               "name": "Blakesley Clapp",
               "profile_path": null,
               "id": 1448829,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.029348,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 3065,
      "vote_count": 79,
      "budget": 0,
      "overview": "The mad and evil scientist, Dr. Clayton Forrester, has created an evil little scheme that is bound to give him world global domination but first things first. He plans to torment Mike Nelson and the robots by sending them a real stinker of a film to watch called, \"This Island Earth.\" He is convinced that this movie will drive them insane. Will this be the ultimate cheese that breaks the boys' spirits?",
      "similar": [
         157336,
         126889,
         198184,
         8078,
         2048,
         2277,
         9738,
         605,
         19,
         1927,
         19959,
         262543,
         39254,
         644,
         87101,
         264660,
         365942,
         3034,
         7453,
         274870
      ],
      "original_title": "Mystery Science Theater 3000: The Movie",
      "runtime": 73,
      "poster_path": "/kBI3kM9kB5E97I7iwsG0z0WAQhb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/nlG4JEjJ7SAFDehgIVvHFBPW23y.png",
            "name": "Gramercy Pictures",
            "id": 37,
            "origin_country": "US"
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Best Brains",
            "id": 1310,
            "origin_country": ""
         }
      ],
      "release_date": "1996-04-19",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Every year Hollywood makes hundreds of movies. This is one of them.",
      "adult": false,
      "homepage": "http://www.mst3k.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jim Mallon"],
      "runtime": 73,
      "synopsis": "The film, based on the hit television series, opens inside the lab of the evil Dr. Clayton Forrester (Trace Bellieu), a mad scientist residing in the depths of Deep 13. He explains to the audience that because of our curiousness, we have become part of his evil experiment. His experiment involves his captive Mike Nelson (himself) being forced to watch terrible and awful movies released in the past few decades. In this film, Dr. Forrester explains that we are to endure the 1955 Universal sci-fi film \"This Island Earth\". On the Satellite of Love, Mike Nelson is doing his morning workout and is greeted by the feminine robot Gypsy (Jim Mallon) and Tom Servo. After hearing a suspicious banging noise, Mike and Tom discover that the wise-cracking Crow T. Robot is attempting to tunnel his way down to Earth with a pickaxe, breaking the hull of the satellite. After fixing the hull by placing a bowl on the hole, Dr. Forrester calls Mike and explains what his experiment is. He also mentions that he hasn't bowed down to him in the past few weeks. Therefore, using a questionable force, he makes MIke and the robots bow down to him. He then proceeds to start the experiment after asking them if they needed to use the restroom. He pulls the lever, the movie sign alarm sounds off, and Mike and the robots proceed to the theater to endure the cheesiness of the 1955 film \"This Island Earth\".",
      "writers": [
         "Joel Hodgson",
         "Michael J. Nelson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117128/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1OTA2NzAyNV5BMl5BanBnXkFtZTcwMDI1MTYyMQ@@._V1_SY311_CR1,0,214,311_AL_.jpg",
      "actors": ["Stars: Trace Beaulieu, Michael J. Nelson, Jim Mallon | See full cast and crew »"],
      "reviews": [
         "Funny funny movie, although this is my favorite tv show, so I'm biased. It's always nice to see Trace (Crow/Dr. Forrester), who left the show soon after this movie was released. It's nice to see the guys at all, since Sci Fi took the show off the air. But I digress. The movie is almost exactly like the show, except shot on better film and with better effects. Jokes abound, and the victim is fairly awful. I thought they would have picked a worse movie to mock, though, as This Island Earth was a relatively harmless piece of 50's sci fi fluff. They have dealt with much more dangerous and evil pieces of celluloid than this one. But a good introduction for the novice Mystie. They can always find out about the horror that is Mandos later. The humor has recently been called juvenile and aimed at teenage boys, but I must disagree, as I am a 25 year old woman with a Master's degree in English and still find the show hilarious. The movie is only a taste of the overall genius that is (or was) MST, and if you at all liked the film, immediately go out and get what DVDs of the show are available. It's worth it.",
         "Mystery Science Theater 3000, anyone who is a fan of this show is a friend of mine, it's a great show for any movie buff. The reason why the show is so loved is because it does what we always want to do or say during a really bad movie. So naturally the successful show that was created on Comedy Central wanted to do a movie about our favorite sarcastic robots. Was the movie a success? Not so much, but doesn't mean that this movie is bad at all, in fact, it's a great one to watch. My only disappointment? I think was just the fact that this was just like any other episode, there was nothing really too special about it to make it stand out as a movie. Secondly, I've seen funnier episodes than this movie. I'm not dissing the movie, because this is still completely worth the watch. Mike, Tom and Gypsy are startled to find Crow deep in the lower sections of the Satellite of Love, pounding at the hull with various digging instruments. He has convinced himself that he can tunnel back to Earth, he tells them. Checking his digging calculations, Crow discovers that he already knew this was inevitable: Look at that, Breach Hull, All Die. Even had it underlined! They return to the Bridge, as Dr. Forrester announces that he is about to make them watch the 1955 classic sci-fi thriller This Island Earth in an attempt to break their wills. In Mystery Science Theater 3000 tradition, we are in for a good ride as they mock this silly clichéd 50's sci fi film with no mercy. I do love the film that they picked This Island Earth, while in some sense it is a fun little sci fi classic, probably the first movie that I saw before I ever saw it on Mystery Science Theater 3000, it still is really cheesy and fun to make fun of. I just love at the end where the alien is trying to protect our two main characters away from the monster and for some odd reason he just lightly blocks the two people away from the monster as Mike points out \"ACTING!\", lol! Obviously fans of the show are going to see this movie, it's a little girt to the fans I think in some sense, I wish they had a few more cameos and could've gone a little bigger, but it's all good. For those who don't know the premise of the show, this is a funny movie, the people that I've introduced the show too have mixed reviews, a few loved it a few didn't really like it, so it's one of those movies you'll have to decide for yourself. 9/10",
         "My opinion: The TV series was usually pretty funny, but had its ups and downs. The movie is just hilarious. They must have been saving this movie for a special occasion and they've honed their timing and jokes to perfection. The first time I saw this with some friends, we had no idea what it was. (It had been recommended by another friend.) From the opening credits to the end we were in stitches. I've never laughed so hard in my life. At a few points we almost had to pause the movie to catch our breath. I should note that for the first ten minutes, we were watching the movie in a state of disbelief. We were all thinking \"What the devil is this? This is stupid!\" For us, this quickly passed and we had a great time. This movie's not for everyone: If you're the type who likes to get weird, funny movies and hang out until 4:00 am acting goofy your friends, you'll enjoy this movie. If you're looking for a standard comedy, look elsewhere. If you won't take it seriously and just want to have some laughs, you'll enjoy it. If you have ever been referred to as a movie snob, please avoid this movie at all costs.",
         "Do you find a really bad movie more amusing than annoying? Have you ever watched a lousy flick with friends and improvised dialogue for the actors or make remarks in jest about how stupid the film is? Have you ever wondered what happens to the other sock? If you answered yes, you will enjoy \"Mystery Science Theater 3000: The Movie\". The premise is that the evil Dr. Forrester is subjecting Mike Nelson and his robot companions Tom Servo and Crow to some of the worst films of all time, as part of a plot to beat the world into submission. Yeah, this premise is pretty weak in itself, but the commentary from these three is what you'll be hooked by. What this intrepid trio does best is make fun of stinky celluloid for the audience's amusement. They do the unimaginable; they make an utter piece of trash not only watchable, but hilarious. It's open season on ridiculous movies, and the film is merely a showcase of their regular television program of the same name. The film has been my first exposure to the show, which has selected episodes available on tape. Sadly, the show is not broadcast in my area, and sadder still is the news that the series will conclude this year. The unfortunate aspect of this is that I do have a sense of what I'm missing. It's a great concept, and has proven to be popular with many viewers. The film for the mocking is \"This Island Earth\". A particularly cheesy selection that can actually be found on DVD in its original format without the hilarious commentary. Some people regard it as a sci-fi classic, but it's essentially been brought to better light with the help of the MST3K team. No one is safe. They even mock their own credits. Watch this one with friends if you can; it's really well done.",
         "Mike and the bots finally get their own movie, and it's a scream! They tackle 'This Island Earth', wreck the Hubble, and use an interociter to talk with some guy in the shower! Some people were upset that they used what is considered a 'classic' sci-fi movie, but fans of the film should give it a try. Fans of the show need no encouragement, and will recognise several elements from the show thrown into the movie (like the Torgo theme in one scene).",
         "Let's get things straight right off the bat: I LOVE Mystery Science Theater 3000! It was, is, and forever will be my favorite television show of all time, in all its incarnations. And the movie is very funny and good and you should see it. That said... Mystery Science Theater 3000: The Movie (hereafter called MST3K:TM for time-saving purposes) could of been a LOT better than it was, and it's NOT the fault of the folks at Best Brains, Inc. (The production company that made the TV show, hereafter called BBI). I place the blame entirely on the fine (HA!) folks at Universal, who forced several changes to the movie and it's wonderful riffing, forcing the folks at BBI to \"dumb down\" their product, mess with their tried-and-true break format, and shoot an entirely different (and stupid, compared to the original) ending, as well as trimming it down to 74 minutes (because at 88, it was TOO LONG! As Servo would say \"...the HELL?) When you come right down to it, BBI makes MST3K one way, and the studio told them to do it a different way. And ANY other way is the WRONG way! I really wish that BBI had held out for an offer with more creative control, but if ifs and buts were candy and nuts, etc. I don't blame BBI for taking the offer, but the selfish part of me would of rather the film never got made than compromised so radically. Then the realist in me tells me to be grateful that it DID get made, and succeeds (somewhat) in spite of (and believe me, not BECAUSE of) the restrictions placed on it. 4 stars to the fine folks at BBI, -1,000 stars to Universal, 2 1/2 stars to the movie itself. It hurts me to say that about the movie, but it's true.",
         "It was a really boring night and me and my sisters came across this movie. At first I didn't notice the silhouettes at the bottom of the screen. WE had missed the first half unfortunately. Anyway, it was the best laugh i've had for ages. I just can't describe how blooming funny this film is but we were giggling just about the whole way through! It's such a clever idea and so well done. I have bought a box set and hope it will be as good. We had never even heard of the tv series and are not sci-fi fans, but still enjoyed the film very much. I give it 9 1/2 out of 10, because nothing is perfect!",
         "It was a blast! If you, the viewer, are not familiar with Mystery Science Theater 3000, better known as MST3K, I recommend that you rent/buy/borrow, beg, or steal tapes to become a tad familiar with the concept. The concept is: riffing a B-or-worse-scifi-movie; the victim, er-- subject, in this case, is \"This Island Earth\", a classic from the 50's. There's this guy (Mike) who's been shot up to an orbiting space station (the Satellite of Love, or SOL) by a Mad Scientist (Dr. Clayton Forrester). Mike is a replacement test subject (Joel, who made the robots for companionship, escaped), and he and Joel's 'bots (short for ro-bots) ease the stress of being test subjects by making wise@$$ remarks while the movie is running. Then there are little interval segments that attempt to tell a coherent narrative. The catch is that the bots are actually only puppets made from a gumball machine head, salad bowl, Tupperware interlocking set of flower vases, and armatures from folding adjustable desk lamps. The original actor who voices Crow T. Robot is Trace Beaulieu, who also plays Dr. Forrester (ah, the magic of motion pictures!). The guy who voices Tom Servo is Kevin Murphy-- well, if you really want to see him, you'll have to find the episodes on tape and go looking for his appearances as other characters. This movie is much better than the episodes that have appeared either on Comedy Central or the Sci-Fi Channel, primarily because Best Brains, the production company, had more money to make better sets, props, and better staging of gags. The Hubble was great, as was the amusing and embarrassing segment where Dr. Forrester ends up in the Metalunan guy's shower. [aaagghhh!!!] The only two things I miss are Joel Hodgson, who was the original host, and Frank Conniff, who played Dr. Forrester's assistant, \"TV's Frank\". Joel was a much different \"test subject\" than Mike-- Joel was more introspective, did many more musical bits on the show, was more creative [\"Invention Exchange\" was Joel's idea; as a comic/magician, he made most of the bizarre and funny inventions on the show.] I feel that Joel's presence, as writer and actor, would have given a tighter, more coherent slant to the experiment (but then, again, I could be biased!). Frank Conniff, as TV's Frank, was the best inept sidekick an inept Mad Scientist could have, and Frank was the perfect foil for Forrester. Their gags tended to be more physical, slapstick comedy. But MST3K: The Movie is, I hope, the first in a long line of franchise movies (like Star Trek: The Motion Picture!). I hope that Best Brains, Inc. does another MST3K movie--it's like no-calorie chocolate!!!",
         "The evil scientist Dr. Clayton Forrester (Trace Beaulieu) locks Mike Nelson (Michael J. Nelson) and two robots in a spacecraft to watch terrible low-budget movies as part of his scheme to conquer the world. He projects 1954 \"This Island Earth\" (Title (Brazil): \"Guerra Entre Planetas\") with the intention of driving them crazy. However, the trio laughs and makes funny comments in every scene and dialogs, having good-time instead, and Dr. Forrester's ambitious plan does not work. The first time I saw \"Mystery Science Theater 3000: The Movie\" on 01 February 2000 I loved it a lot and I gave a nine. I had watched the cheese \"This Island Earth\" a few months ago and the comments of Mike Nelson and the two robots made me laugh a lot. Today I have just watched this film again and it is still hilarious, but my rating is lower this time. \"Mystery Science Theater 3000: The Movie\" was released in Brazil on VHS by CIC-Universal Distributor. My vote is seven. Title (Brazil): \"O Filme Mais Idiota do Mundo\" (\"The Most Idiot Movie of the World\")",
         "\"Mystery Science Theater 3000\"(MST3K)is an American program which features Mike Nelson and two funny robots(Tom Servo and Crow T.Robot)seen in silhouette,making fun of some trashy movie playing on the screen before them.This time Mike and the robots settle in to watch truly awful science-fiction film \"This Island Earth\"(1955,Joseph M.Newman).The wisecracks are clever and really amusing-I laughed a lot during the film.Some of my favourite lines are: Crow T.Robot \"The secret government Eggo Project!\",\"Eat my photons,punyheads!\" etc. My rating:8 out of 10.Highly recommended."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Best Brains",
         "Universal Pictures"
      ],
      "summaries": [
         "The mad and evil scientist, Dr. Clayton Forrester, has created an evil little scheme that is bound to give him world global domination but first thing's first. He plans to torment Mike Nelson and the robots by sending them a real stinker of a film to watch called, \"This Island Earth.\" He is convinced that this movie will drive them insane. And since the guys cannot control when the movie begins or ends, they are forced to witness the true horror that is this awful movie that has a lobster creature dressed in slacks. But will this be the ultimate cheese that breaks the boys' spirits? It's up to one test subject's quick wit, sharp sense of humor, and utter intolerance for cinematic garbage to foil the plans of the scientist and to save the Earth.",
         "The evil scientist Dr. Clayton Forrester locks Mike Nelson and two robots in a spacecraft to watch terrible low-budget movies as part of his scheme to conquer the world. He projects 1954 \"This Island Earth\" (Title (Brazil): \"Guerra Entre Planetas\") with the intention of driving them crazy. However, the trio laughs and makes funny comments in every scene and dialogs, having good-time instead, and Dr. Forrester's ambitious plan does not work.",
         "This movie is basically a deluxe version of the popular cult-TV favorite 'Mystery Science Theater 3000.' In the movie, as in the TV-series, Dr. Clayton Forrester forces Mike Nelson and his two robots to watch bad B-Movies. As these movies are screened for them (and us), we see the theater seats and them silhouetted against the bottom of the screen. Their running commentary riffs off of the film and each other and their sophomoric jabs at humor form a continuous patter not unlike what might be heard among the audience, if these films were to be shown at a frat party. This particular episode features 'This Island Earth' (1954).",
         "Mike Nelson and his robot companions watch and give their comments about \"This Island Earth\"."
      ],
      "budget": 0
   },
   "movielensId": 671,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-04-19",
      "dvdReleaseDate": "1998-05-27",
      "directors": ["Jim Mallon"],
      "runtime": 73,
      "movieId": 671,
      "title": "Mystery Science Theater 3000: The Movie",
      "mpaa": "PG-13",
      "actors": [
         "Michael J. Nelson",
         "Trace Beaulieu",
         "Jim Mallon",
         "Kevin Murphy",
         "John Brady"
      ],
      "imdbMovieId": "0117128",
      "originalTitle": "Mystery Science Theater 3000: The Movie",
      "genres": [
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "do_9g3isO0c",
         "Gc2KS2s07J8"
      ],
      "plotSummary": "The mad and evil scientist, Dr. Clayton Forrester, has created an evil little scheme that is bound to give him world global domination but first things first. He plans to torment Mike Nelson and the robots by sending them a real stinker of a film to watch called, \"This Island Earth.\" He is convinced that this movie will drive them insane. Will this be the ultimate cheese that breaks the boys' spirits?",
      "tmdbMovieId": 3065,
      "avgRating": 3.65637,
      "releaseYear": "1996",
      "numRatings": 7348,
      "posterPath": "/kBI3kM9kB5E97I7iwsG0z0WAQhb.jpg"
   }
}