{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0140614",
      "video": false,
      "title": "They Bite",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Melody Duncan",
               "gender": 0,
               "credit_id": "57e054b39251413d74014e03",
               "name": "Donna Frotscher",
               "profile_path": null,
               "id": 1682222,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Director Mel Duncan",
               "gender": 0,
               "credit_id": "57e054bec3a36808ec0153ae",
               "name": "Nick Baldasare",
               "profile_path": null,
               "id": 929393,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tammy",
               "gender": 0,
               "credit_id": "57e054c9c3a3681da000d119",
               "name": "Christina Veronica",
               "profile_path": "/npq8ambyy8BvldZNARgD3gCKF9u.jpg",
               "id": 103856,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Larry",
               "gender": 0,
               "credit_id": "57e054f19251415968000921",
               "name": "Charlie Barnett",
               "profile_path": null,
               "id": 1682226,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Darryl",
               "gender": 2,
               "credit_id": "57e054fa925141592f0008fa",
               "name": "Ron Jeremy",
               "profile_path": "/l4aDQlLafsG3N4pJ3W6YjpMXWI3.jpg",
               "id": 42545,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Sam Nicholhoff",
               "gender": 0,
               "credit_id": "57e05506c3a3680c1f005f9a",
               "name": "George Mazzone",
               "profile_path": null,
               "id": 1682227,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Rev. Rex Stoner",
               "gender": 0,
               "credit_id": "57e0550f9251416c1f00c303",
               "name": "Alex Pirnie",
               "profile_path": null,
               "id": 222904,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Katie",
               "gender": 0,
               "credit_id": "57e05519c3a36808ec0153e8",
               "name": "Susie Owens",
               "profile_path": null,
               "id": 1681006,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Model",
               "gender": 0,
               "credit_id": "57e05522c3a3680c1f005faa",
               "name": "Blake Pickett",
               "profile_path": "/foSrdhvx11w2UnBmWGPNG4OgqNL.jpg",
               "id": 99229,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4d279251416c75131c8f",
            "name": "Brett Piper",
            "profile_path": null,
            "id": 98094,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.78904,
      "production_countries": [],
      "id": 187851,
      "vote_count": 2,
      "budget": 130000,
      "overview": "Aliens who've come to earth to spawn deep beneath the ocean begin terrorizing a Florida beach community. An ichthyologist and a young filmmaker team up to uncover the mystery of these monsters from the deep--before they strike again.",
      "similar": [],
      "original_title": "They Bite",
      "runtime": 98,
      "poster_path": "/2r3ST0wtPkAPSeFBA0gJ0Fed1ST.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-01-01",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "They live ... They suck ... They Bite",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brett Piper"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Brett Piper"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140614/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NzA4MjczOF5BMl5BanBnXkFtZTcwNDAxNzgzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Donna Frotscher, Nick Baldasare, Christina Veronica | See full cast and crew »"],
      "reviews": [
         "If you go into a movie called THEY BITE expecting a life-changing experience, then you've got yourself mopped into a corner for big disappointments. Understanding that this is a juvenile monster movie with no artistic ambitions is step one for a positive viewing experience...this is strictly \"brains on pause\" entertainment, and as such, it works quite nicely(and, naturally, anything featuring porn legend Ron Jeremy outside his...erm...natural habitat...is always interesting to see). An uncomplicated aliens-on-Earth-eating-people item which has a good sense of humor about itself, and features some very inventive monsters and a goodly amount of ribald chuckles. Production values and acting are mostly above the equator for this type of fare, and some of the special effects moments demonstrate surprising ingenuity and aptitude. You could do far worse than this...just work with it instead of against it, and you'll probably have a fun time. 5.5/10.",
         "I found this one in the loser bin for $1.00 on VHS. It looked bad but I figured, what the hell, my collection is full of bad, one time viewing, crap. All I can say is, this movie has it all! Yes, the production starts off pretty low quality but is pretty impressive by the end, what really surprised me about this one was the plot. It was well written and actually has some depth and twists to it. Also, the characters are very likable and even somewhat believable. Every time the film comes back to the film crew their dialog had me laughing my ass off, and not because it was bad. This is rare in the genre. They reminded me of the group of friends in \"40 year old virgin\". This movie really delivers in the breast department. Very few movies have so many boobs. I'm not sure what else to say. I've watched it about 8 times now and it keeps getting better. All my friends agree. Its a perfect movie to sit around and drink beer to. \"They Bite\" is the kind of film \"Slither\" was aspiring to be. Watch it if you can find it. Pure classic horror from an era that is long gone.",
         "Ambitious far beyond expectations, \"They Bite\" succeeds in spoofing not one, but two movie genres. The first half has at least a bunch of chuckles, squarely aimed at the adult film industry. The actors are likable, the acting is acceptable for this type production, and the nudity is not totally gratuitous. The second half is all about the fish monsters, with the sci-fi elements, and special effects surprisingly effective considering the minuscule budget. Just when you thought things couldn't get more outrageous, they do. The closest porno parody flick I could compare this to would be \"The First Nudie Musical\", which is a spoof of Broadway shows, and contains lots of nudity. In fact they both have the identical line spoken by their leading nude lady, \"I am an actress\" - MERK",
         "This movie is obviously somewhat derivative of the 80's Roger Corman classic \"Humanoids from the Deep\". But then that movie back in its day was excoriated for being a derivative, sexed-up version of \"Creature from the Black Lagoon\". I kind of liked this just because it was a fun movie with a genuinely independent feel to it, not just another cynical effort to make an intentional \"cult\" movie (the 90's were lousy with such efforts by hacks like Jim Wynorski and David DeCouteau). The movie also anticipates the kind of 90's reflexive filmmaking represented by \"Scream\" in that the characters in the movie have themselves watched horror movies. A porn filmmaking crew in the movie become aware of an invasion of humanoid fish monsters (after their mail gets mixed up with that of a female marine biologist) and decide to take advantage of it by making an XXX movie-within-the-movie called \"Invasion of the Fish F**kers\". This movie kinda reminds of another pre-\"Scream\" 90's independent film called \"There's Nothing Out There\", and like that one it remains relegated to out-of-print VHS while any number of much lesser 90's Wynorski/DeCouteau-type crap flicks are available on DVD and Blu-Ray today. Brett Piper is an interesting filmmaker. He's decidedly \"b-movie\" with a long string of credits like \"Draniac\" or \"The Screaming Dead\", but he seems to have a genuine love of \"b-movie\" filmmaking rather than a cynical attitude of \"let's make a cheap-ass 'cult' film with as little money as possible while laughing all the way to the bank.\" Obviously, there is a lot of nudity here by 90's softcore actresses, Cristina Veronica and Blake Pickett, and Playboy Playmate Susie Owens (who has an infamous vagina dentata scene, which was completely edited out of the \"R-rated\" version, but was actually completely irrelevant to the plot anyway, and was only grafted on at the behest of the producers). But this is the rare 90's exploitation movie that might actually be entertaining even WITHOUT the gratuitous female nudity. Interestingly, most recognizable \"star\" here is no doubt XXX actor Ron Jeremy (before he was regularly being cast in low-budget mainstream films). Thank god he keeps HIS clothes on though--I'd rather watch the girls being assaulted by scaly fish monsters!",
         "After the first five minutes you're probably thinking this is nothing but cheap smut and violent filth.You're basically right. but if you can handle this kind of movie then you should probably see it(although it is hard to find).Also anyone who is a fan of the old beach monster movies shown at drive ins in the 50's-60's will probably like this seeing as how it pays homage to movies of that sub genre like 'The Horror of Party Beach'.This is not a movie to take seriously, you should just have fun with it.",
         "A Z-movie that tries to homage the past winners of this kind of cheap movie, They bite was a little less than I hope for. Sure, there is a lot of skin showed by several different nice looking actresses, a really ridicolous monster fish (as it should be), better acting than you may think in such a production, a couple of really good ideas (like the vagina dentata of Susie Owens and the black and white trailer for Invasion of the Fish F****rs), Ron Jeremy making a porn movie, but perhaps not enough gore and sex to totally satisfy the viewer of such a crap movie. So, in the end, this is a not compeltely convincing parodia of a Z-movie from the Fifties, made to look one of those movies, that it could has been better"
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Trio Entertainment"],
      "summaries": ["Sea creatures come to shore and attack and mate with humans."],
      "budget": 130000
   },
   "movielensId": 676,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": null,
      "directors": ["Brett Piper"],
      "runtime": 98,
      "movieId": 676,
      "title": "They Bite",
      "mpaa": "R",
      "actors": [
         "Donna Frotscher",
         "Nick Baldasare",
         "Christina Veronica",
         "Charlie Barnett",
         "Ron Jeremy",
         "George Mazzone",
         "Alex Pirnie",
         "Susie Owens",
         "Blake Pickett"
      ],
      "imdbMovieId": "0140614",
      "originalTitle": "They Bite",
      "genres": [
         "Comedy",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Aliens who've come to earth to spawn deep beneath the ocean begin terrorizing a Florida beach community. An ichthyologist and a young filmmaker team up to uncover the mystery of these monsters from the deep--before they strike again.",
      "tmdbMovieId": 187851,
      "avgRating": 2.51667,
      "releaseYear": "1996",
      "numRatings": 30,
      "posterPath": "/2r3ST0wtPkAPSeFBA0gJ0Fed1ST.jpg"
   }
}