{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0108181",
      "video": false,
      "title": "Some Folks Call It a Sling Blade",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Karl Childers",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057edb",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Teresa Tatum",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e057edf",
               "name": "Molly Ringwald",
               "profile_path": "/y8RQwpSQaRfWK70fR9LUT8Fql64.jpg",
               "id": 21625,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Charles Bushman",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ee3",
               "name": "J.T. Walsh",
               "profile_path": "/39KZjhJSyDjvBhKGj0IbGVteFAm.jpg",
               "id": 22131,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057ee9",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4565c3a368484e057eef",
               "name": "George Hickenlooper",
               "profile_path": "/t7R8Lecq6HR0N9CIwiuiPEPt2N0.jpg",
               "id": 37852,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.847573,
      "production_countries": [],
      "id": 27768,
      "vote_count": 10,
      "budget": 0,
      "overview": "25 years after committing a double murder, Karl Childers is going to be released from an institution for the criminally insane. A local reporter comes to talk to him, and listens in horror about his life leading up to the crime. This is the short film that inspired the full-length \"Sling Blade\"",
      "similar": [
         3134,
         11564,
         298312,
         8810,
         281,
         948,
         133805,
         2142,
         22323,
         294963,
         14433,
         12162,
         1359,
         4771,
         431,
         8923,
         97630,
         101,
         205,
         141
      ],
      "original_title": "Some Folks Call It a Sling Blade",
      "runtime": 25,
      "poster_path": "/xUegt6UYUtE8OIfl504pSammNMm.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1994-03-26",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["George Hickenlooper"],
      "runtime": 25,
      "synopsis": null,
      "writers": ["Billy Bob Thornton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108181/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNzU2MDY5N15BMl5BanBnXkFtZTcwODU1MTUxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Billy Bob Thornton, Molly Ringwald, J.T. Walsh | See full cast and crew »"],
      "reviews": [
         "I have mixed feelings about this short. Sling Blade is my all time favorite movie. I absolutely fell in love with it the first time I saw it and I still never tire of watching it. This, on the other hand, is an entirely different take on the Karl Childers character. While he is likeable and friendly in Sling Blade, he is intimidating and scary in \"Some Folks Call it a Sling Blade\". Also, I could not stand Molly Ringwold's version of the reporter. She was bitter, hateful, and downright cold while the reporter in Sling Blade has a timid, sweet manner and is kind to Karl. The ending left you with an odd feeling (yes, I know all of this was intentional) and made you wonder just WHY they were letting this menacing person out of the \"nervous hospital\". This is a very well done short. The mood is dark, the setting is perfect, and Hickenlooper really seems to know what he is doing. I just wasn't too crazy about his interpretation of the story. Had I seen this before I saw the full-length version, I'm sure I would have enjoyed it a lot more. The video has a really cool \"behind the scenes\" featurette that is a must for fans of Sling Blade. Oh, and thank you Billy Bob, for giving us YOUR interpretation of the story and telling it the way it was meant to be told.",
         "Pretty much everything has been said by previous reviewers here. It is probably pertinent to add that but for the success of this little independent number, the full length SLING BLADE most probably would never have gotten made three years later. Obviously a labor of love for creator Billy Bob Thornton. He presents a markedly different Karl Childers here. As retardedly backward but infinitely more menacing. It was probably on reflection that the character was made more \"marketable\" and sympathetic the second time around. Both films are such an absorbing focus on what is essentially a simple man turned (by dint of social expectation) feral by circumstances totally outside his control. The villain of the piece of course was Karl's father, played in a marvellous one-off cameo by Robert Duvall in the feature-length film. In SOME FOLKS CALL IT A SLING BLADE, the reporter is played by Molly Ringwald. Many seem not to have approved of her interpretation of the part, preferring the cutesy high-school reporter in the 1996 release. I thought she handled it well, after all she was dealing with a quite different \"Karl Childers.' Either way, this makes for a fascinating back-up to SLING BLADE. If anything, it adds to one's understanding of the man himself.",
         "Previous reviewers have commented (negatively) on Molly Ringwald's interpretation of the reporter. I have to disagree. I enjoyed it much more than the reporter in the full-length version (which is one of the greatest films of all times.) I didn't realize that the reporter was so weak in \"Sling Blade\" until I saw \"Some Folk....\". By the end of the interview with Karl, she (Ringwald) 'gets it' - she understands the horrific conditions that Karl endured, and why he did what he did, and she shows it, simply by the expressions on her face. I did not find this Karl any more menacing than the Karl of \"Sling Blade\" - I think it does show more the fear he has of leaving the safety and relative comfort of the hospital. Imagine how it would be if being in a hospital is a better situation than your only memories of life \"outside\". Long time prison inmates describe it all the time. This is a magnificent piece - where less is definitely more. I loved it.",
         "[CONTAINS SPOILERS] This feature opens in a Northern California sanitarium where the criminally insane live. I love the opening scene where a patient runs down the corridor bare-butt naked and an orderly races after him. Charles Bushman always sat down beside Karl Childers and told him tales of his run-ins with cross-dressers and prostitutes; two female journalists, Teresa Tatum and Frances, were coming to conduct an interview on Karl, because after 25 years he was being released. They had mixed feelings about the whole thing. At the sanitatium, they meet Gerry Woolridge, the cureator of the place. He tells them a little back history on Karl, like how his parents believed deeply in the Bible and that they sinned when they had Karl. They even told him that! Karl comes in and talks about why he's in the sanitarium and how he had murdered Jesse Dixon for manhandling his mother, then murdered his mother for, well, not showing proper gratitude when her son came to her aide. That's basically about it. Three years later, Billy Bob Thornton directed the motion picture based on this short, Sling Blade, which starts out exactly like this, and features Karl's further travels and people he interacts with. And the character of Gerry Woolridge changes from a skinny, balding four-eyes into an older man. So what can I say about Some Folks Call It a Sling Blade? I'm used to Sling Blade, but the information in this explains more in Sling Blade, which I think is a great movie! So, in conclusion, check them both out! -",
         "All else aside I found her more credible as a journalist (the actress in the feature was more the \"schoolgirl\", which may have been intentional); Ringwald's performance did more to make me wonder at the end of the film just what she would write for her paper. Would that have been a distraction as we watched Carl's re-entry? I don't recall any followup to that in the feature. Altogether this was fascinating, not to be compared head-to-head with the full-length film which has justly become an American classic. Films like \"Sling Blade\" can stand with the best of what is often considered superior European cinema.",
         "I saw this movie when I rented a DVD that came with a lot of brief \"movies\" such as this. I wonder if it was done to show the head of a studio what a great feature length movie this would make. I enjoyed the short story format and was impressed with Molly Ringwold's acting.",
         "Billy Bob Thornton's screenplay manages admirably to catch the inevitability of violence in impossible family situations. The question one might ask is: who has been wronged most? You simply can not lock up a child in a shed for years and expect it to act rationally. George Hickenlooper does well to restrict his staging to a cool minimum. The actors get more space that way. Molly Ringwald, J.T.Walsh and Billy Bob Thornton are equally good in this gripping short. Although I'm not certain whether I agree with Hickenlooper's choice of two-shot for the interview scene -B.B.Thornton shot the same scene almost completely in close up for his SLING BLADE; and to good effect- his decision to use black and white photography was a wise one. This kind of film is not a dime a dozen, it should be treasured.",
         "Billy Bob Thornton proves himself to be great in this short independent picture about a killer who is released after 25 years in a mental home. This later was transformed into a longer version called Sling Blade which was released in 1993 to world-wide acclaim, but this is much better. Why, because technically, this is the beginning of the feature Sling Blade, and the beginning is the best part. Kudos to Thornton and director George Hickenlooper for creating a original short film that is as good as the hype. A+",
         "The nice thing about Netflix streaming movies is you can find such a great and extensive assortment of titles, and I found this one, the film short Billy Bob Thornton wrote, and which later became the theme for the full-length, award-winning movie 'Sling Blade.' Billy Bob Thornton is Karl Childers who as a teenager had been convicted of murder. Now, after about 25 years in prison, this is the day of his release. Karl seems to have a mind that works well, but his viewpoints often seem odd. If you live long enough and observe carefully, there really are people like Karl. His story and impending release from prison have stirred up local interest, and local reporter, Molly Ringwald as Teresa Tatum, has asked if she can interview him. She is cautioned, he isn't comfortable with women, he doesn't like to have questions asked, and the fluorescent light bother him. So Karl and Teresa are in a darkened room, on opposite sides, and he begins to speak, telling his story in his own odd delivery and choice of words. This is a very short film, B & W and just under 25 minutes, but what we see supports the story exactly. Particularly good is the lighting. Now it makes me want to see 'Sling Blade' again.",
         "I guess that if you are watching this, that means that you've already watched more known movie Sling Blade. Sling Blade is actually an extended version of this short, including the life of Karl after leaving a psychiatric institution. This short movie will leave you speechless. It's dark atmosphere, dark subject that it's dealing with, together with great performances from everyone, especially Billy Bob Thornton and Molly Ringwald, makes this an unforgettable experience. If you haven't seen Sling Blade yet, I suggest you to see it first, and then to see this movie. Overall 9/10"
      ],
      "genres": [
         "Short",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [],
      "summaries": ["Twenty-five years after commiting a double murder, Karl Childers is going to be released from an institution for the criminally insane. A local reporter comes to talk to him, and after some fussing about her gender, the institution's director lets her talk to Karl (after all, he'll have to talk to women after his release). Karl talks about his life leading up to the crime, and the reporter listens in horror."],
      "budget": 0
   },
   "movielensId": 678,
   "movielens": {
      "languages": [""],
      "releaseDate": "1994-03-26",
      "dvdReleaseDate": "2002-03-19",
      "directors": ["George Hickenlooper"],
      "runtime": 25,
      "movieId": 678,
      "title": "Some Folks Call It a Sling Blade",
      "mpaa": "",
      "actors": [
         "Billy Bob Thornton",
         "Molly Ringwald",
         "J.T. Walsh"
      ],
      "imdbMovieId": "0108181",
      "originalTitle": "Some Folks Call It a Sling Blade",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "25 years after committing a double murder, Karl Childers is going to be released from an institution for the criminally insane. A local reporter comes to talk to him, and listens in horror about his life leading up to the crime. This is the short film that inspired the full-length \"Sling Blade\"",
      "tmdbMovieId": 27768,
      "avgRating": 4.07082,
      "releaseYear": "1994",
      "numRatings": 2824,
      "posterPath": "/xUegt6UYUtE8OIfl504pSammNMm.jpg"
   }
}