{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ireland",
            "id": 14985
         },
         {
            "name": "strained relationship",
            "id": 194000
         }
      ],
      "imdb_id": "tt0114307",
      "video": false,
      "title": "The Run of the Country",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Danny's Father",
               "gender": 0,
               "credit_id": "52fe4dd89251416c75142d41",
               "name": "Albert Finney",
               "profile_path": "/2BTzSQUa3RXPqeeNjbJqnyIBePE.jpg",
               "id": 3926,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Danny",
               "gender": 0,
               "credit_id": "52fe4dd89251416c75142d45",
               "name": "Matt Keeslar",
               "profile_path": "/grucMGE9xHQ4uoE0QSD0dZVQTKe.jpg",
               "id": 35598,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Annagh",
               "gender": 1,
               "credit_id": "52fe4dd89251416c75142d49",
               "name": "Victoria Smurfit",
               "profile_path": "/aNPzf4S9WNIF60HTkTuGHvE8JqO.jpg",
               "id": 3315,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Prunty",
               "gender": 2,
               "credit_id": "52fe4dd89251416c75142d4d",
               "name": "Anthony Brophy",
               "profile_path": "/5XMQXJhDtdaqhJW7Buna1stkmZY.jpg",
               "id": 120006,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Father Gaynor",
               "gender": 2,
               "credit_id": "52fe4dd89251416c75142d51",
               "name": "David Kelly",
               "profile_path": "/jxPBAzbia65yJAsNxoyGQri5Bah.jpg",
               "id": 1282,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Danny's Mother",
               "gender": 1,
               "credit_id": "52fe4dd89251416c75142d55",
               "name": "Dearbhla Molloy",
               "profile_path": "/dNZmbBwRnEh2aym3989TJTu9LtX.jpg",
               "id": 33395,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4dd89251416c75142d31",
               "name": "Peter Yates",
               "profile_path": "/skBRJxvtvkylZXk6zjNPvwytr5S.jpg",
               "id": 12804,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd89251416c75142d37",
               "name": "Shane Connaughton",
               "profile_path": null,
               "id": 33388,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd89251416c75142d3d",
               "name": "Shane Connaughton",
               "profile_path": null,
               "id": 33388,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.760598,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 221917,
      "vote_count": 2,
      "budget": 0,
      "overview": "An Irish lad (Matt Keeslar) who fled from his oppressive, widowed father (Albert Finney) falls for a girl (Victoria Smurfit) from an affluent family.",
      "similar": [
         252178,
         369557,
         5723,
         1116,
         167073,
         25195,
         22821,
         6023,
         223485,
         3175,
         10360,
         205220,
         340442,
         2977,
         3109,
         157832,
         178,
         73873,
         283591,
         11141
      ],
      "original_title": "The Run of the Country",
      "runtime": null,
      "poster_path": "/ngOBDDwr5CpzFx9IJljq1CfOGt3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "129 Productions",
            "id": 16832,
            "origin_country": ""
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-09-22",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "An unforgettable romance",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Yates"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Shane Connaughton",
         "Shane Connaughton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114307/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTY1MTk2MjIxOV5BMl5BanBnXkFtZTcwNjI2MzMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Albert Finney, Matt Keeslar, Victoria Smurfit | See full cast and crew »"],
      "reviews": [
         "This is both a coming-of-age movie and a fine picture of how the border between the Irish Republic and the Six Counties, and the ancient animosities of the place, become part of the landscape. There are no green plastic derbies or fuzzy pipecleaner shamrocks in this funny, touching and gritty portrait of a family, a young couple and a nation each torn in two. Finney's police officer is a man who believes in the system even when it clearly doesn't work, not an unknown type on that island, while the quirky, iconoclastic young farmer who takes our lad in hand shows much better than \"Sins of the Father\" how clever young men with good hearts find places a better world would keep them out of. As for the romance, well, watch the movie. It's very much well worth it. But it's a real world you'll find here, not \"Finian's Rainbow,\" so don't expect to walk away with a cheerful Irish song on your lips.",
         "\"The Run of the Country\" fulfills the early-to-mid-20th Century rural mannerism of class, character, and personal struggle after a series of dashed hopes during a passage of life. Disney's old hero worship lingers well in this flick, which in turns hits that image with reality. How a young man becomes a man happens in many ways and this film portrays the farm lad derivative. Boy lives a sad reality, boy thinks he has found solace from sad reality, sad reality returns the rebuff, boy returns to sad reality, and boy pursues new venture despite the sting of sad reality. I liked the mode and standing of the storyline to this film, reading like an old novel one would read from the archives or see in a soap opera drama/adventure. I watched the film like I would any paperback-novel-turned-film but when Victoria Smurfit popped up, I took better notice because I had the sensual hot spot for her since \"Ballykissangel\" when she replaced my previous interest Dervla Kerwin. The unsung natural beauty was the right filler for Annagh...and call me a pervert for this but to finally see Victoria Smurfit nude after imagining it from only two provocative scenes from \"Ballykissangel\" fulfilled an old dream, the fulfillment of which gave me reason to pursue viewing the rest of the movie. Much like \"Little House on the Prairie\" was in the 70's, this Irish variation of a \"Little House\" 2-part episode is specifically meant for those with the soft heart for country life and times, good and bad, with the specter of then-modern Ireland working into the fabric of the story.",
         "Charming, almost innocently told tale. Lovely Irish scenery and gentle, calmly-paced acting. Finney's strong presence does not detract, but rather melds into the story well. I found Keesler just right for the \"wide-eyed\" role he plays as hero of this yarn. The other supporting players also add much flavor to the rustic backdrop. And the movie has some mild controversy. None of which has to do with cock-fighting or the IRA. It lies within the fiber of the telling. Some have said: formulaic. Some have said: episodic. Some have said: plotless. Well, then...which is it? Strictly speaking, \"formulaic\" movies should have a plot, and plotless movies cannot be \"formulaic\". Formulaic cannot be \"episodic\"... I say: the movie goes about just as life does - haphazardly, full of turns expected and not. Each random event, another one of life's lessons which add to one's strength or weakness. I recommend this movie to those whose view of life is not an exercise in the breaking the speed of light - but instead of a \"taking in\" of that light and welcoming the ensuing darkness as a natural flow and balance of all things.",
         "Peter Yates' \"Run of the Country\" (1995) is a pretty obscure picture and only available on VHS. I was able to secure a brand-new copy recently for only 25 cents. But maybe it's not so obscure since a poster for it can be seen at a cinema in a 1995 episode of Seinfeld, \"The Pool Guy\" (season 7, episode 8). THE PLOT: Near the border of Northern Ireland an 18 year-old named Danny (Matt Keeslar) leaves home after the death of his mother due to serious friction with his gruff father (Albert Finney), a local cop. Danny moves in with his free-spirited friend, Cocoa (Anthony Brophy), and learns the ropes of manhood, including an intimate relationship with a girl across the border, Annagh (Victoria Smurfit). When crises strike he finally comes to understand his... (watch the film and find out). Shot in the Redhills, County Cavan, area of Ireland, near the border, \"Run of the Country\" is a realistic coming-of-age drama. The acting is great across the board, especially Finney as the father and Brophy as Danny's wild friend. Simply put, this is quality drama with laughs, romance, conflict, action and gorgeous photography of rural Ireland. GRADE: B",
         "The movie was powerful enough to help me realize I was in love. It defined the boundaries between romance, lust, affection, and love. Placed in the heart of the Irish countryside, \"Run of the Country\" explored the clash between a tradition-based generation and its modern offspring on subjects as delicate as love, sex, marriage, and family. Ultimately, if you're lucky enough to be in love with an Irish, you'll know exactly why.",
         "Director Peter Yates and actor Albert Finney the team of \"The Dresser\" back again in a different movie, the nice and cruel \"The Run of the Country\" an history set in Ireland. Nice film because of the scenery, the cast, the story although it's nothing new and some other things. Cruel film because of the way some things, necessary or not, were told but first let me introduce the story. Danny (Matt Keeslar) is an very innocent teenage who recently lost his mother and has to live with his tough father (Albert Finney) a police inspector who's main interest is to make his son move with a aunt in America where he could study in a good college. Danny is kind of lost in what to do with his life, and tired of deal with the father he moves to the house of his friend Prunty (Anthony Brophy) a very pleasant and funny lad. The rest of the movie is a cliché after a cliché: Danny falls in love for the first time after meeting Annagh (Victoria Smurfit) a rich girl, she got pregnant, they don't know what to do, Danny's father thinks he ruined his life with that and all kinds of things. Now here comes some unusual and unnecessary things. What bothered me in this story about growing up is the way Yates dealt with the subject or perhaps the way writer Shane Connaughton wrote was cruel and excessive to with own material (he wrote the novel and the film). In this drama there's too much deaths (more deaths than in \"Goodfellas\") and there's nothing in it that explain to us what's the point of all that. 8 funerals: Danny's mother, Danny and Annagh's son, a mouse, a pig recently blessed by Danny in a prank, two Biritsh pilots, a drunk man who was decapitated while sleeping in the forest (it isn't showed but it's actually scary) and Prunty (who has the weirdest death scene in the movie). I mean the story moves well but these things almost made me think that it was a ridiculous and pessimistic film. Very downer. Another unusual scene was when Annagh's parents punished Danny for get involved with her. Sometimes adapt your own novel to the screen needs a better development and some liberties must be taken otherwise it becomes a excessive freak show. Finney's performance was okay, he's always a great actor and let's face it, the 1990's wasn't a memorable decade to him in films. The real good thing here was Matt Keeslar, good actor who haven't got any major role after this (except for \"Splendor\"). His manners and looks were very believable in his portrayal of a shattered young man trying to find his own way in the world after many bad things happened. Not the best work of Peter Yates but not his worst also (I haven't seen his worst yet, he's a great director). 6/10",
         "This was a disappointment. There's no point in repeating the comments others have made about the dodgy acting. As an Irish person, I can also add that the accents were highly questionable and in some cases just plain wrong. Rites of passage films tend to be pretty formulaic and this one broke no moulds. Nor did it ever intend to.",
         "Truly hilarious, although this is meant to be a serious drama. I shun Albert Finney for taking such a part and Vicki Smurfitt is as usual her ugly, wooden self. There is no time suggested as to when the movie is meant to be set, its not the nineties or eighties more like the fifties but in that case why are people driving nineties car models? And since when did people in the border area of Ireland go to watch birds fighting?? Mostlikely you will find them shopping or surfing the net. This movie should have never been made, written or even considered. Badly acted the aforementioned Vicki Smufitt is like Keanu Reeves only not a pretty. Sad but true",
         "There is no need to warn people away from \"The Run of the Country\" because at this point you are not exactly deluged with viewing opportunities. That said there is little reason to track down this film unless you yearn for some nice Irish scenery (including a fair red-haired Irish lass-Victoria Smurfit of \"Berkeley Square\" fame). Although directed by Peter Yates, do not expect anything on the level of his \"Breaking Away\" masterpiece. Shane Connaughton adapted his own novel about characters living near the \"artificial\" border between the two Irelands. His characters are all contradictions. Teenage Danny (Matt Keeslar) is cold and reserved but given to moments of extreme impulse and passion. His father (Albert Finney) fluctuates between a wise caring philosopher and a nasty frustrated bully. His wild friend Prunty (Anthony Brophy) is a fun-loving free spirit who is secretly a very active member of the IRA. His red-haired Irish girl is the product of a mixed (Catholic-Protestant) marriage and fluctuates between a mature self-possessed young woman and a weak little girl who inexplicably fails to do and say very obvious things that would improve the situation. These contradictions might be effective allegorical elements in the novel but do not translate to believable characters in the context of a film, where there is not adequate time to explore their motivations and complexities. The production is technically solid and the supporting cast is excellent. Brophy is the best of the leads and Keeslar is worst. If there was a box office reason for casting a handsome American actor as Danny (who was not a pretty boy in the novel), it did not serve them well and it totally alters the basic charm of the core romance. The scenery is nice, David Kelly (the Irish builder O'Reilly in \"Fawlty Towers) is excellent as the local priest, Carole Nimmons is very entertaining as Mrs. Prunty, and there are some funny lines. The weakest parts of the film are the closing scenes, which are soap opera melodrama. Up to this point the film has maintained a generally realistic tone and the resolution comes across as contrived and unlikely (insert disappointing here).",
         "\"Run of the Country\" tells of the coming of age of a young Irish man, recently bereaved of his mother, living with his martinet father, and falling in love with a girl from the other Ireland. A solid production on most counts, the film delivers too little too late in story making for a meandering watch lacking cohesion. Okay fodder for sentimentalists best saved for tv. (C-)"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "129 Productions",
         "Castle Rock Entertainment",
         "Columbia Pictures Corporation"
      ],
      "summaries": ["In a small village on the border of Northern Ireland and The Republic of Ireland, the relationship between a short tempered policeman and his rebellious son becomes even more strenuous when the young man falls for a \"wrong\" girl."],
      "budget": 0
   },
   "movielensId": 679,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-22",
      "dvdReleaseDate": null,
      "directors": ["Peter Yates"],
      "runtime": 0,
      "movieId": 679,
      "title": "The Run of the Country",
      "mpaa": "",
      "actors": [
         "Albert Finney",
         "Matt Keeslar",
         "Victoria Smurfit",
         "Anthony Brophy",
         "David Kelly",
         "Dearbhla Molloy"
      ],
      "imdbMovieId": "0114307",
      "originalTitle": "The Run of the Country",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["--GgszWGqIw"],
      "plotSummary": "An Irish lad (Matt Keeslar) who fled from his oppressive, widowed father (Albert Finney) falls for a girl (Victoria Smurfit) from an affluent family.",
      "tmdbMovieId": 221917,
      "avgRating": 3.37374,
      "releaseYear": "1995",
      "numRatings": 99,
      "posterPath": "/ngOBDDwr5CpzFx9IJljq1CfOGt3.jpg"
   }
}