{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "southern france",
            "id": 2335
         },
         {
            "name": "estate agent",
            "id": 2918
         },
         {
            "name": "menage a trois",
            "id": 3190
         },
         {
            "name": "van",
            "id": 4580
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0113149",
      "video": false,
      "title": "French Twist",
      "recommendations": [
         37652,
         40413,
         39385,
         31789,
         77673,
         86727,
         55976,
         64567,
         10260,
         71055,
         50213,
         31340,
         164126,
         51191,
         19955,
         64983,
         6444,
         64357,
         44706,
         22240
      ],
      "backdrop_path": "/8M1725YmmdYRnzj1E81rk0o68Pe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Loli",
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e5bf",
               "name": "Victoria Abril",
               "profile_path": "/qVszystVNlXomQQrhM9u3joaw9P.jpg",
               "id": 25256,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Marijo",
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e5c3",
               "name": "Josiane Balasko",
               "profile_path": "/eDAW4L3nNpx0sfhh5nMix4KdjfM.jpg",
               "id": 35137,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Laurent Lafaye",
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e5c7",
               "name": "Alain Chabat",
               "profile_path": "/zR39m8iQ2OWn753WLwQ3oiH1qRc.jpg",
               "id": 4275,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Antoine",
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e5cb",
               "name": "Ticky Holgado",
               "profile_path": "/2G0LmyNhNWlR55Zm5nlY6S79rPN.jpg",
               "id": 13689,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Dany",
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e5cf",
               "name": "Catherine Hiegel",
               "profile_path": "/y3vJ3bVR0Bnic0onWEGP89a9g0i.jpg",
               "id": 35908,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Emily Crumble",
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e5d3",
               "name": "Katrine Boorman",
               "profile_path": "/cIxijBUAvwg0QQ7nGKGIltjnCDY.jpg",
               "id": 38402,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dorothy Crumble",
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e5d7",
               "name": "Telsche Boorman",
               "profile_path": null,
               "id": 38403,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Vero",
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e5db",
               "name": "Véronique Barrault",
               "profile_path": "/pTGKdtNZBjinhGa6ZyHjNArmpCs.jpg",
               "id": 38404,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e5af",
               "name": "Josiane Balasko",
               "profile_path": "/eDAW4L3nNpx0sfhh5nMix4KdjfM.jpg",
               "id": 35137,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e5b5",
               "name": "Patrick Aubrée",
               "profile_path": null,
               "id": 38401,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e5bb",
               "name": "Josiane Balasko",
               "profile_path": "/eDAW4L3nNpx0sfhh5nMix4KdjfM.jpg",
               "id": 35137,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe43c5c3a36847f806e5e1",
               "name": "Telsche Boorman",
               "profile_path": null,
               "id": 38403,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e5e7",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e5ed",
               "name": "Gérard de Battista",
               "profile_path": null,
               "id": 38492,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c5c3a36847f806e5f3",
               "name": "Carlos Conti",
               "profile_path": null,
               "id": 18496,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c5c3a36847f806e5f9",
               "name": "Fabienne Katany",
               "profile_path": null,
               "id": 38493,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.045395,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 4482,
      "vote_count": 64,
      "budget": 0,
      "overview": "After learning of her husband's infidelities, a housewife invites an itinerant lesbian to move in with them. None of their lives will ever be the same again.",
      "similar": [
         112160,
         858,
         634,
         437557,
         258480,
         43923,
         97630,
         141,
         297762,
         242224,
         95610,
         2255,
         713,
         2771,
         9587,
         3134,
         340485,
         10735,
         12793,
         5781
      ],
      "original_title": "Gazon maudit",
      "runtime": 95,
      "poster_path": "/dDB8mMKRL28gHsRcGPoMQYrzaXg.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Les Films Flam",
            "id": 1614,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Renn Productions",
            "id": 82,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TF1 Films Production",
            "id": 3823,
            "origin_country": ""
         }
      ],
      "release_date": "1995-02-08",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Josiane Balasko"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Patrick Aubrée",
         "Josiane Balasko"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0113149/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NjczMTU1OF5BMl5BanBnXkFtZTcwOTAzNTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Victoria Abril, Josiane Balasko, Alain Chabat | See full cast and crew »"],
      "reviews": [
         "Here's a film which is definitely outside the box for American audiences. French films are usually an acquired taste and this one is no exception. This is a delightful light comedy about a married couple whose life change upon the arrival of a butch lesbian to their lives. You don't have to be a genius to guess what's coming. Nevertheless, the movie is funny, it's done with great taste and sensibility, and even though the characters are not 100% belivable, they are not stereotypical. Victoria Abril is delicious, playing the wife whose disenchantment of the married life leads her to explore a lesbian affair. What I liked in particular about this comedy, is that sexual orientation never becomes the main issue in the movie, and it's really secondary to the human relationships that develop in this bizarre triangle. The script could have been a little less linear, but the characters are well developed and well played. Overall, French twist is a fun light comedy which probably wouldn't raise an eyebrow in Europe but will need a very open minded audience in the US. Unfortunately we're not ready yet.",
         "Loli, played by Victoria Abril, has given up a promising career as a dancer to become the wife of a womanising estate agent; and though she knows of one woman he has had an affair with and has forgiven him, she knows nothing about any of the others - not even her own baby-sitter! No. Her main complaint against him is not his promiscuity but that he takes her for granted and shows her little affection. So, when a butch lesbian, played by Josiane Balasko, appears on the scene, stopping at the house to ask for water for her van's radiator, she is a ripe fruit waiting to be picked. And this kind, mature, worldly-wise lesbian is an expert in the art of seduction. On an evening out together, the husband, played by Alain Chabat, already annoyed at the lesbian's intrusion into his home with his wife's encouragement, is driven into a blind fury when he discovers the lesbian's hand half way up his wife's thigh and sees them dancing together in a way that is very intimate. From this follow many scenes of shouting and screaming, jealousy and rage. You feel for the husband's usurpation and his humiliation at being rejected for a lesbian - though you rejoice at his come-uppance - and you feel for the wife who deserves the affection she has been so long denied, and you feel for the lesbian with a loving heart who wants only to make the wife happy - though others may condemn her for destroying a relatively happy marriage. The husband hates her so much and is so desperate to get rid of her that he is willing to do anything to get her to leave. But despite all the passion and jealousy this is a light comedy and not a heavy drama, and you have the feeling all along that everything will work out well in the end. And it does. The moral of the story, affirmed at the end, is that the only things that matter are love, tenderness and affection and if we get those the source's sexual gender is immaterial; we are all bisexual. This is a bright, witty and observant comedy, well-acted, particularly by Victoria Abril,",
         "The premise of this film may appear ridiculous. How could a straight woman suddenly hesitate on her sexuality when a very butch woman turns up one fine day and fall in love with her? But the premise is but an excuse for an interesting comedy, based on a classic menage a trois, but with a twist. Characters are interesting. Victoria Abril as the neglected housewife is very good. Alain Chabat as the Casanova, sleeping with anybody (at least with any woman) is superb. The scene in which his daughter visits him in his office is funny then poignant. The last scene of the film (cut from the American and British version) is unexpected. The regretted Ticky Holgado is perfect in his role as Alain Chabat colleague. As far as Josiane Balasko, who wrote the film as well as starred in it, she may not be the most convincing Butch lesbian you will find, but she wrote a good film, funny, bitter sweet, which won't leave you indifferent.",
         "I read the user comment for this film, my point of view is quite different : 1. I am surprised to see that Gazon Maudit was rated R and 18 in most countries. I saw this movie at 20:30 PM, on Sunday evening, on the main TV french channel, and I don't remember any scandal for this (and we have our share of intolerant bigots in France too...). OK, this picture is about sex, lesbians, homosexuality and triolism, we can see a few times Victoria Abril half or totally naked and Josiane Balasko smokes a lot of pot, but it is basically a comedy with no real provocation. I find much more vulgarity in, mmmh, let's say, the \"American Pie\" pictures - even if they don't show nudity - than in Gazon Maudit. 2. This movie is funny. No big laughs, but a good story and brilliant acting. We know that the situations are implausible (a nice married woman falls in love at first glance with a butch-lesbian-truck-driver, who will have a baby with her husband) but the characters are funny enough to forget minor errors in the script and you will enjoy the way of cross that the unfaithful husband (Alain Chabat) will have to go through. 3. I gave a rating of 6 because it's not a masterpiece. But if you find the plot outline attracting, if you ever wonder \"What would I do if my wife leaves me for another woman ?\", or if you want to see an uncommon film about relationships, you will not be disappointed !",
         "I know many people have a mental block about foreign-language films, but this is an excellent taster for the nervous. No portentous symbolism or moody gazes into the middle-distance - just a witty, sexy comedy of errors, where the audience's sympathies bounce back and forth between the three principal characters. Instantly accessible to monolinguists - and yet its panache and pace could only be French (yeah, I know Abril is Spanish). Incidentally, I know we're not really supposed to respond to other comments from IMDb users, but it's interesting to note that the movie-loving community displays just as much intolerance and uptightness about sexuality as any other disparate group of people.",
         "This is one of those films where you can see each plot twist coming before the last is finished. The writers probably sat around saying \"...and wouldn't it be funny if ...\" and then just added another episode in this episodic picture. But it is fun, light, and doesn't try to press an ideology about human relationships on the viewer. What a relief! And the ending leaves a nice gap which the viewer can fill for himself. Perfect, to my mind. Fun fluff.",
         "This film is typical of films made outside of mainstream Hollywood studios; it takes some old themes and treats them with an attention-grabbing freshness. Playing Loli, a young housewife living in the south of France, Victoria Abril is as delightful as a spring breeze in Provence. Her husband is an incorrigible infidel; we've seen many of those in films. However, when the masculine Marijo, played poignantly by Josiane Balasko, enters their lives, the story takes many unexpected and entertaining turns which render a fairly common theme completely unpredictable. Everyone to whom I recommend this film ends up watching it numerous times and recommending it to others. The soundtrack is now one of my most-played CD's.",
         "wisp of a romantic comedy. Abril's character charms both a lesbian and her inattentive husband who soon regrets his lack of regard for his live-wire wife. Her sexuality is fluid---not really gay or straight but reponsive to genuine love and affection. If this film were about exclusively hetero characters it would probably not engender most of the outrage and invectives hurled at it. At its essence, it's a light, well-acted film with decent writing and, frothy sexual politics typical of romantic comedies. It's no more offensive than, say, \"10\" or \"When Harry Met Sally\". The fact that the same-sex element seems to send some viewers into paroxyms of homophobic outrage says more about the viewer than anything terribly offensive or subversive about this movie. That it looks at the characters with some open-mindedness and wit makes it worthy of a look.",
         "This movie starts of with a seemingly normal 'man cheats on woman-woman gets back at man' story. But as I kept watching it, this movie kept getting crazier and crazier. I am not sure if it is supposed to be a comedy, a tragedy, or just a drama. But I decided if I take it as a dark-ish comedy it will be better received. All and all Miss Abril did very well, as well as Mr. Chabat. The only loss in skill was from Miss Balasko, who was not very believable. But it was crazy and funny in a weird way. It was nice that it was only just over an hour and a half, cause the madness probably could not have gone on too much more. It is a decent way to spend an hour and a half, but once is enough.",
         "Knowing, charming, funny and well-cast French comedy about a betrayed woman (deliciously sexy and amusing: Victoria Abril) falling for another female, which drives her husband mad. Starts out great, but looses steam halfway through and ends rather disappointingly. Still, the characters are well-drawn and the direction is on-target. A great showcase for Abril's talents."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Canal+",
         "Les Films Flam",
         "Renn Productions"
      ],
      "summaries": [
         "Laurent is the local estate agent, a job that offers easy opportunties for his womanising. His wife beautiful wife Loli looks after his home and two children unaware of his many affairs. However, their world is turned upside down by the arrival of Marijo, an itinerant lesbian whose minivan breaks down nearby. The neglected Loli is drawn to the sensitive Marijo and when she learns of Laurent's infidelities, invites Marijo to move in with them. The arrangement takes an emotional toll on each of them, exacerbated by the arrival of a figure from Marijo's past. As they struggle with the situation and each other, all of their lives are changed forever.",
         "After learning of her husband's infidelities, a housewife invites an itinerant lesbian to move in with them. None of their lives will ever be the same again."
      ],
      "budget": 0
   },
   "movielensId": 68,
   "movielens": {
      "languages": [
         "Français",
         "Español"
      ],
      "releaseDate": "1995-02-08",
      "dvdReleaseDate": "2003-08-05",
      "directors": ["Josiane Balasko"],
      "runtime": 95,
      "movieId": 68,
      "title": "French Twist",
      "mpaa": "R",
      "actors": [
         "Victoria Abril",
         "Josiane Balasko",
         "Alain Chabat",
         "Ticky Holgado",
         "Catherine Hiegel",
         "Katrine Boorman",
         "Telsche Boorman",
         "Véronique Barrault"
      ],
      "imdbMovieId": "0113149",
      "originalTitle": "Gazon maudit",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["Qd_88LUuHGU"],
      "plotSummary": "After learning of her husband's infidelities, a housewife invites an itinerant lesbian to move in with them. None of their lives will ever be the same again.",
      "tmdbMovieId": 4482,
      "avgRating": 3.4552,
      "releaseYear": "1995",
      "numRatings": 1317,
      "posterPath": "/dDB8mMKRL28gHsRcGPoMQYrzaXg.jpg"
   }
}