{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "telescope",
            "id": 6293
         },
         {
            "name": "lesbian",
            "id": 10768
         }
      ],
      "imdb_id": "tt0081759",
      "video": false,
      "title": "Windows",
      "recommendations": [
         168315,
         38662,
         390991,
         55078,
         26483,
         70259,
         87704,
         39564,
         107321,
         55863,
         449751,
         112687,
         293536,
         40797,
         89139,
         107096,
         36567,
         143901,
         46695,
         385371
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Emily Hollander",
               "gender": 1,
               "credit_id": "52fe48c59251416c91097c0d",
               "name": "Talia Shire",
               "profile_path": "/liNfrVB3eZFBOjcUGltISCucews.jpg",
               "id": 3094,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Andrea Glassen",
               "gender": 1,
               "credit_id": "52fe48c59251416c91097c11",
               "name": "Elizabeth Ashley",
               "profile_path": "/zN6fHWl2NHiMHY741YIxbtRRFoj.jpg",
               "id": 44845,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Bob Luffrono",
               "gender": 2,
               "credit_id": "52fe48c59251416c91097c15",
               "name": "Joe Cortese",
               "profile_path": "/Ac7sqrV5RQLHR98dyOgTur8q8SJ.jpg",
               "id": 830,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Ida Marx",
               "gender": 1,
               "credit_id": "5545fac3c3a3680cdb0065ba",
               "name": "Kay Medford",
               "profile_path": "/sh2CoB2DmM8vGwSRtWar0aUmTjl.jpg",
               "id": 89841,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sam Marx",
               "gender": 0,
               "credit_id": "5545fad29251414c92003cea",
               "name": "Michael Gorrin",
               "profile_path": null,
               "id": 557998,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Steven Hollander",
               "gender": 0,
               "credit_id": "5545fadc925141586500653d",
               "name": "Russell Horton",
               "profile_path": null,
               "id": 1462345,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Dr. Marin",
               "gender": 0,
               "credit_id": "5545fae8925141499f002886",
               "name": "Michael Lipton",
               "profile_path": null,
               "id": 1462346,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Obecny",
               "gender": 0,
               "credit_id": "5545faf192514137d300161a",
               "name": "Rick Petrucelli",
               "profile_path": null,
               "id": 1290895,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Detective Swid",
               "gender": 0,
               "credit_id": "5545fafbc3a3680cd7006721",
               "name": "Ron Ryan",
               "profile_path": null,
               "id": 1462347,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Police Woman",
               "gender": 1,
               "credit_id": "5545fb05c3a3680ce80063d6",
               "name": "Linda Gillen",
               "profile_path": "/eBKGY0I86SlTpdpD7FLVezUSkfz.jpg",
               "id": 198980,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Nick",
               "gender": 2,
               "credit_id": "5545fb11c3a36856e50036e1",
               "name": "Tony DiBenedetto",
               "profile_path": null,
               "id": 138116,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48c59251416c91097c09",
               "name": "Gordon Willis",
               "profile_path": "/6gOmfatlF7UdhaHi2tPsZMb5vmz.jpg",
               "id": 3097,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5545faacc3a3680ce80063cb",
               "name": "Barry Siegel",
               "profile_path": null,
               "id": 1462344,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5545fb2992514137d3001623",
               "name": "Mike Lobell",
               "profile_path": null,
               "id": 31143,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5545fb36c3a3680cd90063ac",
               "name": "Ennio Morricone",
               "profile_path": "/tlntfyflyEHgJTFjqIgg8P8UIx9.jpg",
               "id": 1259,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5545fb4ac3a3680cd7006731",
               "name": "Barry Malkin",
               "profile_path": null,
               "id": 2988,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56468ac49251413adb001241",
               "name": "Gordon Willis",
               "profile_path": "/6gOmfatlF7UdhaHi2tPsZMb5vmz.jpg",
               "id": 3097,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56468ae29251413e7f001141",
               "name": "John Nicolella",
               "profile_path": null,
               "id": 70765,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 1,
               "credit_id": "56468af2c3a368260c0011f7",
               "name": "Sylvia Fay",
               "profile_path": null,
               "id": 1113357,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56468afbc3a36826140013cb",
               "name": "Mel Bourne",
               "profile_path": null,
               "id": 10441,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56468b059251413e7f001154",
               "name": "Mel Bourne",
               "profile_path": null,
               "id": 10441,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56468b0dc3a368261a0012a2",
               "name": "Richard Fuhrman",
               "profile_path": null,
               "id": 1535823,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56468b16c3a3682620001209",
               "name": "Leslie Bloom",
               "profile_path": null,
               "id": 4188,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56468b1f9251413ad5001239",
               "name": "Clifford Capone",
               "profile_path": null,
               "id": 91852,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.384533,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 83857,
      "vote_count": 10,
      "budget": 0,
      "overview": "Shire is the subject of a perverse obsession by a Lesbian neighbor, Andrea, who not only is in lust with her but hires a rapist in order to get audio tapes of her moaning. Ashley turns pepping tom and watches Shire with a telescope as she begins an affair with Det. Cortese.",
      "similar": [
         370663,
         258480,
         401898,
         4995,
         376867,
         449176,
         244772,
         249397,
         513,
         333344,
         11634,
         1544,
         1391,
         1991,
         1278,
         1690,
         88,
         1018,
         979,
         28468
      ],
      "original_title": "Windows",
      "runtime": 96,
      "poster_path": "/1JaMXfXuVfkt3QMATaZE1jblaKk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mike Lobell Productions",
         "id": 52599,
         "origin_country": ""
      }],
      "release_date": "1980-01-18",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gordon Willis"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Barry Siegel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081759/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMDk2OTY1Nl5BMl5BanBnXkFtZTYwNzY1MTk5._V1_.jpg",
      "actors": ["Stars: Talia Shire, Joe Cortese, Elizabeth Ashley | See full cast and crew »"],
      "reviews": [
         "\"Windows\", a dreadful thriller about a lesbian psychotic and her straight-laced target, might have at least left us with some campy giggles, but alas--it is far too distasteful to laugh at. The opening scene, with Talia Shire attacked by a perv in her apartment, just goes on...and on...and on. What was director Gordon Willis thinking by allowing this ugly sequence to take up so much time? After this unfortunate encounter, our heroine turns inward and goes all quiet. Is there anything more deadly for a thriller then having a somnambulist leading character? She practically sleepwalks through the rest of the picture. The film has that dated, early-'80s look to it (brackish, shabby and \"gritty\", with thin neon lights snaking into shapes). I waited this thing out to see where the hell it was going. It goes nowhere...slowly. *1/2 from ****",
         "WINDOWS (1980) */**** One of the all-time worst films I've ever seen. It's been 25 years since I saw this in a tiny theatre and simultaneously watched it vanish from history without a trace. This recent second viewing via a VHS dupe from some unknown source did not improve things much, but I've got a story to tell about this movie and how it's eluded me for such a very long time. This has become almost a \"lost\" film, and I'll have a theory later as to why nobody's seeing it anymore, aside from the basic fact that it simply stinks. In 1980 I was 17 and went to see WINDOWS at the movies with my kid sister. It was only one of the two times in my life I ever recall going to a theatre with her, and we were both in shock at just how abysmal the feature before our eyes was. It was boring, badly acted, and by the final act, completely laughable. The whole theatre was in hysterics. It's not the kind of experience you forget when you're a movie fan, even 25 years after the fact. The movie starts in its New York City setting with lousy actress Talia Shire (who apparently thinks she's still playing the timid Adrian from the first ROCKY film) being assaulted and raped in her own apartment, getting forced at knifepoint to moan and groan into the attacker's tape recorder. We later discover (and since it's not presented as any kind of mystery I'm not ruining anything that hasn't already been ruined) that Shire's got a psychotic and horny lesbian neighbor (Elizabeth Ashley) across the hall who's so in love with her that Ashley actually hired this rapist/goon to pull off the crime - so she can play the tape over and over and get off on it to her heart's content. When Talia decides to move to a nicer apartment to start anew, Elizabeth and her loose screws aren't very far behind. She'll do anything to make Talia love her, as her ineffective psychiatrist seems to be aware. Enter vapid policeman Joseph Cortese (who's about as interesting as a door stop) to romance Shire (what the hell do Ashley and Cortese see in her insipid character anyway?) and \"help\" her ... in an unbelievable sequence, Shire is in a cab with a driver whom she recognizes as the rapist; she asks to be let off at a phone booth, calls the police, but is instructed to get back in the car with her attacker till the cops can get to them! Besides being ineptly acted, WINDOWS is also dull and boring, but there's something curiously watchable about it for fans of bad movies only, for all its incompetence. It was the first and only film (no wonder) to be directed by cinematographer Gordon Willis; it was his photography that graced THE GODFATHER and some of Woody Allen's picturesque movies, so his shots of New York may be the one thing to watch for here, aside from getting a load of Elizabeth Ashley's embarrassing climax with Talia Shire. This film is also notorious as being the very FIRST film to be released in the entire decade of the 1980's, and of course as of this writing it's a movie that is virtually impossible to locate, as it was never released on home video except in France (I believe). It was through the wonders of the Internet that I was able to hunt this thing down and see how bad it still is. So why has this film been so hard to track down? Well, for starters, it's got to be a humiliation to everyone involved. I'm fairly positive it's owned by Warner Brothers, and my personal opinion is that, in this Politically Correct world of today, we just cannot have a film available that depicts a homicidal maniac when she also happens to be a lesbian. But that in itself has made the movie all the more desirable for a viewing, and it's at the very least a reminder of the type of movies filmmakers used to be allowed to make. Proceed at your own risk -- if you can ever find a copy, that is.",
         "**SPOILERS**Ridiculous movie about a crazed lesbian Andrea, Liz Ashley, who is so obsessed with Emily, Talia Shire, that she gets some degenerate taxi driver Lawrence don't call me Larry, Rick Petrucelli, to break into Emily's apartment and force her to sob and shriek into a tape recorder so Andrea can later listen to it to her hearts desire. With Lawrence so stupid that one afternoon when he picks up Emily, what a coincidence in his cab he blows his cover by insisting that he knows her from somewhere; yeah jerk you know her from assaulting her a few days ago. Which has Emily take notice of him and call the police to have him arrested. With Andrea so jealous of anyone that she suspects of standing in the way between her and Emily that she slashes them to death including Emily's 70 year old neighbor Mr. Marx ,Michael Gorrin, and even Emily's cat Jennie. \"Windows\" has the heaviest breathing that I ever herd in a movie! Breathing that would rival any porno film and even make the most obscene phone callers blush. Talia Shire comes across very unconvincing as the damsel in distress from the big bad Liz who seems to have trouble trying to look terrified or even scared of her. There's also an interesting side note to the movie: Emily's male love interest Joseph Cortese, Det. Bob Luffrono, looks so much like Salvestor Stallone that for a moment I thought that I was watching \"Rocky II\". \"Windows\" is only good for some unintentional laughs which you get a lot of in it.",
         "I had totally forgotten this crap until I was watching \"Rocky\" last night. After seeing Talia Shire this all came back to me. Talia Shire is raped by a (literally) slobbering man. He was hired by her neighbor (Elizabeth Ashley!), a psychotic lesbian (sigh), to drive Shire into her arms. Offensive, homophobic, sick, dull when not offensive. Shire has never mentioned this movie (I wonder why) and Ashley herself said she took it because her agent was getting sick of her turning down offer after offer. She also said it should play the third movie in a triple bill at the drive-in. Director Gordon Willis (a talented cinematographer) never directed another movie. This was a box office disaster. What does all this tell you? Also it contains one of the stupidest sequence EVER put on film. Shire is in a cab and quickly realizes the cab driver is the one who raped her. She has him stop the cab, she gets out and calls the police and then is told to get BACK in the cab till the police arrive!!! I'm no police officer but I don't think that would ever happen in real life. Other comments here have said there was laughter in theatres playing this back in 1980--probably this scene set people off. Still, I think this is too disturbing to be even good for laughs. It was never even released on video. I would like to hear what Shire and Willis (if he's still with us) think of this now. Avoid.",
         "I don't know much about the history of this movie which nevertheless seems to be interesting. I've read nearly all the comments on IMDb about it (on a rainy Sunday) which, with a few exceptions, sound all alike. I'm 37, so I didn't have the chance to watch it in a theater. I'm unfortunately not able to find out anything about the original aspect ratio of it. A video (VHS) (with aspect ratio 1.33 : 1) edition came out in Germany in 1987 and it's not hard to track down these days. I bought it a week ago together with Friedkin's 'Cruising' from that same year and watched them as double features with friends (all around my age). First I have to say (for both movies): Neither my friends nor me (all being not 'politically correct' but very sensitive about offensive perspectives, words or actions going out from filmmakers concerning their attitude about the subject of the particular movie) found anything projectedly homophobic in those movies! Talking about 'Windows' I'm not quite sure that Elisabeth Ashley's character is a lesbian at all. She seems to be more like a split personality with psychotic parts. There may be lesbian undertones but the topic in itself is not exploited (negatively or machoesque or in any other way) here! I'm sure there were no 'bad' intentions (not from Gordon Willis and not from Mister Friedkin, concerning the other 'case')even if considering that times were pretty different in 1979/1980. As you can see from the title windows are used as key visuals in this movie. Much of it is seen (in both directions) through them, very often the city and the (then intact) skyline of New York (which is photographed so hauntingly beautiful that sometimes it seems to stand in the middle of the room with the actors). So naturally a voyeur's view is achieved, which stresses the (as I see it) purpose of the movie: A comment about dysfunctional social life in modern big cities used as background for a moody thriller. Talia Shire (as Emily Hollander) is stuttering and having a divorce, everybody seems to have an analyst and even Elisabeth Ashly's character is almost painfully lonely and more of a victim than anything else. Being a very important and successful director of photography Gordon Willis nonetheless relies a bit too much on his strong, dark and sometimes (seen from today) beautifully old-fashioned photography and his obvious love for New York. The script is not the strongest, at least seen in a badly dubbed German version. 'Windows' is not a classic, but I'd recommend it if todays films sometimes appear to be a bit too hasty and fast-cut to some of you. I don't really understand the negative fuss, even when it came from a young and perhaps a bit too careful (again seen from today) gay movement, that's been made around it for the last 27 years and that even killed the career of Mr. Willis as a director. He was hassled so much by the reactions on the movie that he said a couple of years ago that 'Windows' would be the biggest mistake in his entire life! As one conclusion I think especially the people at Warner's should take all this into consideration (rewatch and rethink!), give absolution and perhaps a 'sorry' to Mr. Willis (he's not the youngest anymore!!!) and put it out on DVD.",
         "I found this film the other day at a market stall; quite an obscure film. The film appears to be quite good when you read the back of the box, but when you watch it...really awful. The only thing Gordon Willis seemed to care about was the photography. In a film like this you need great acting. We don't get great acting however and you cannot take the film seriously. It just gets ludicrous at times, especially the psycho-lesbian lover storyline. It is disgracefully misogynistic, which is another reason not to watch the film. I will say that the film's photography is stunning though (similar to woody allen's 'interiors') but that is the only reason to watch this garbage.",
         "This is one of those flicks I've wanted to see since it came out (I was underage at the time). The plot just sounded very freaky and bizarre. Regardless, it is one of the THE most impossible films to find since I don't believe it got a video release (except overseas) and I don't even think it played on cable in the '80s. It is however on YouTube now :-). This film gets trashed by a lot of people immediately as being non-PC and homophobic. I think that's more a signpost of when the film was released, when attitudes toward people with other orientations weren't so enlightened. No, the core problem behind this picture is that it's just a raving, stinking mess, and it really is virtually all Willis' fault. When you read the opening credits, your jaw drops...they read like an A-list of movie greats: Morricone, Bourne, Willis as DP. How could they screw this up? Easy. A) Don't build any suspense; B) Don't establish any characters or motivations; C) Allow the writer to write any damn thing he wants to, no matter how stupid or no matter what expense to the actors; D) Resort to constant dissolves when you don't know what else to do, especially since there is virtually no coherent action; E) Don't direct your actors...after all they're pros, they know exactly what to do. The list goes on.... This is a stalker movie....it should be about stalking. There is absolutely no fear built, no tension. It's a real master class in wasted celluloid. Still, part of me has to admire this in a way you sometimes admire any bad movie. It sure didn't have any self-censoring going on. it did what it wanted to do and took no prisoners. One of the many things that makes it a museum piece today, even if that museum is a wax one.",
         "WINDOWS reminds me of REFLECTIONS IN A GOLDEN EYE. When REFLECTIONS came out in 1967, it had the book thrown at it for being deviant, sick, perverse, reactionary, offensive, pretentious (which is such a mouthful that it makes one believe that the hater(s)doth protest too much). On top of these epithets, was the final body blow, and \"just plain boring.\" It's difficult to be all of the above and be \"just plain boring\" to boot which is the reason I was compelled to check out both movies. I'm glad I did. WINDOWS is not the outright triumph REFLECTIONS IN A GOLDEN EYE is, but it's thoughtful and original about something that shouldn't be dismissed by film lovers out of court. It's not sleazy or exploitative; as a matter of fact, that's a major problem with it. It refuses to further sensationalize its wildly lurid \"givens.\" It's artful enough in its intentions to try to suggest that the tragedy of urban life is not the violence of melodramatic evil, but the glass cubicles people live in that link and separate them in devastatingly emotional ways. Gordon Willis' direction is typical of a first time director. It suffers from being too studied but it's far from daft or moronic; visually, it's as thought through as REAR WINDOW, its obvious predecessor in voyeurism. But there's nothing in REAR WINDOW, as seriously naked and exposed as Elizabeth Ashley's performance. It's interesting that when great actors like Brando (in REFLECTIONS IN A GOLDEN EYE), and Ashley in WINDOWS attempt something that goes beyond the average viewer's opinion of how a homosexual SHOULD be portrayed, there's is an automatic reflex action on the part of said viewer to distance themselves from the performance, to laugh at it or automatically dismiss it as being \"over the top.\" This response is, in fact, more reactionary than the sins that have been dumped in the picture's lap. WINDOWS is not as dumb or insensitive as the knee jerk response it provokes in most people who feign an interest in the dark side until it becomes too real.",
         "After hearing all the bad things that has been said about this movie, I didn't care I still wanted to see it. But they were right the bad things that have been said about this movie are actually true, This has one of the most boring-est movies I have ever seen. \"Windows\" is about a shy recently divorced woman named Emily (Talia Shire) living alone in a New York apartment with her cat. When one night she is attacked in her apartment and raped and is forced to moan into a portable tape player while the rapist forces a blade into her mouth. The next morning she reports the attack to the police. Whilst they are interviewing her, Emily's neighbour, Andrea (Elizabeth Ashley), comes by to comfort her. Emily is so upset by the attack that she decides to move to a new apartment, but whilst moving out the mysterious man tries to attack her again \u0096 only, Andrea manages to stop him entering the apartment. However, Andrea is not all she seems. She has the tape recording of Emily's attack. It becomes apparent that she is in love with her \u0096 and had hired a violent rapist to make the recording; to turn her on and turn Emily against men, and into her arms. Unaware, Emily continues to see Andrea as a friend, and starts a relationship with the cop investigating her attack (Joseph Cortese). Andrea becomes increasingly unhinged, and takes to spying on Emily through a telescope ... This movie was apparently infamous as it was criticised for portraying gay people as psychotic and disturbed. But I didn't find that aspect to be true in this movie's case because anyone can be psychotic gay or straight people. But it's none of these reasons why I dislike this movie so much, I dislike this movie simply because it was dull, to be honest I'm surprised Talia Shire even had a career after this mess, talk about a bad choice. This movie was just distasteful through and through, I mean even the final showdown was incredibly dull and pointless. (All we get is a slap across the face), talk about exciting and that copper he was dull as dishwater and him and Talia Shire had no chemistry between them, and lastly Elizabeth Ashley I just found her laughable in this and not convincing at all. All in all it's understandable why this movie is so hard to find is because it's just bad and should stay locked away forever.",
         "By 1980, New York City, universally known as \"the Big Apple,\" had become the incarnation of a paranoiac's nightmare. Movies like Michael Winner's revenge thriller \"Death Wish,\" Walter Hill's gang epic \"The Warriors,\" and William Friedkin's homosexual murder mystery \"Cruising\" had spawned this unsavory image and lenser turned director Gordon Willis' \"Windows,\" an excellently made but egriegously scripted sizzler, starring Talia Shire and Elizabeth Ashley, appropriates this negativity for maximum impact. Clearly, at 96 minutes, the R-rated \"Windows\" exemplifies the theme of women versus women. The voyeurish plot involves a mousey Emily Hollander (Talia Shire of the \"Rocky\" franchise), who is at the mercy of lesbian stalker Andrea Glassen (Elizabeth Ashley of \"The Carpetbaggers\"). Ashley pays a cretinous cabbie to rape Emily and tape record the performance. Later, after Emily has moved out of the apartment where she was raped and into a security apartment complex, Glassen has Emily's tabby cat killed and frozen. Glissen sets up a telescope and then watches Emily constantly before she confronts her with the truth that she must possess her! Along the way, Emily becomes involved with an N.Y.P.D. detective (Joseph Cortese). Ace lenser Gordon Willis, who photographed Woody Allen's \"Manhattan\" and Francis Ford Coppola's \"The Godfather, Part II,\" makes his directorial debut. Not surprisingly, Willis also doubles as his own cameraman. The technical credits are great, especially Willis' striking photography, two-time Oscar nominated Barry Malkin's suspenseful editing, and Ennio Morricone's atmospheric orchestral score. Talia Shire as victim and Elizabeth Ashley as predator deliver emotionally taut performances. However, the Razzie nominated Barry Siegel screenplay is as sordid as it is stupid. Logic and motivation must have been thrown out the window. Happily, Siegel never wrote another screenplay. We are never told what it is that attracts Ashley to Shire. Presumably, only lesbians will know, but may hate this movie, too, for its phobic attitude. Similarly, Willis never called the shots on another movie, though he continued to lens them. My advice, unless you are written a term paper about \"Windows,\" avoid it."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Mike Lobell Productions"],
      "summaries": ["Shire is the subject of a perverse obsession by a Lesbian neighbor, Andrea, who not only is in lust with her but hires a rapist in order to get audio tapes of her moaning. Ashley turns pepping tom and watches Shire with a telescope as she begins an affair with Det. Cortese."],
      "budget": 0
   },
   "movielensId": 684,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-01-18",
      "dvdReleaseDate": null,
      "directors": ["Gordon Willis"],
      "runtime": 96,
      "movieId": 684,
      "title": "Windows",
      "mpaa": "R",
      "actors": [
         "Talia Shire",
         "Elizabeth Ashley",
         "Joe Cortese",
         "Kay Medford",
         "Michael Gorrin",
         "Russell Horton",
         "Michael Lipton",
         "Rick Petrucelli",
         "Ron Ryan",
         "Linda Gillen",
         "Tony DiBenedetto"
      ],
      "imdbMovieId": "0081759",
      "originalTitle": "Windows",
      "genres": [
         "Horror",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["rqRhLINegcY"],
      "plotSummary": "Shire is the subject of a perverse obsession by a Lesbian neighbor, Andrea, who not only is in lust with her but hires a rapist in order to get audio tapes of her moaning. Ashley turns pepping tom and watches Shire with a telescope as she begins an affair with Det. Cortese.",
      "tmdbMovieId": 83857,
      "avgRating": 2.47826,
      "releaseYear": "1980",
      "numRatings": 23,
      "posterPath": "/1JaMXfXuVfkt3QMATaZE1jblaKk.jpg"
   }
}