{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "terminal illness",
            "id": 6564
         },
         {
            "name": "hiv",
            "id": 9766
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "lgbt history",
            "id": 173504
         }
      ],
      "imdb_id": "tt0113443",
      "video": false,
      "title": "It's My Party",
      "recommendations": [
         43097,
         43047,
         21001,
         52772,
         28567,
         55177,
         19094,
         27440,
         34424,
         21055,
         39072
      ],
      "backdrop_path": "/zyosKP054UwZbfcr8qsHP49fiSP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Nick Stark",
               "gender": 2,
               "credit_id": "52fe45069251416c91024ef9",
               "name": "Eric Roberts",
               "profile_path": "/45i6fsxBwH1UyA74tWQ6am0DntC.jpg",
               "id": 21315,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Brandon Theis",
               "gender": 2,
               "credit_id": "56e61eab9251416d40008a33",
               "name": "Gregory Harrison",
               "profile_path": "/luFhYgGEm2vLXQkplRHm88trg48.jpg",
               "id": 29370,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Amalia Stark",
               "gender": 1,
               "credit_id": "56e61f01c3a3685aa40082d5",
               "name": "Lee Grant",
               "profile_path": "/t59I45kO8VxH57gg6hGE5UyC0f7.jpg",
               "id": 30123,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lina Bingham",
               "gender": 1,
               "credit_id": "52fe45069251416c91024f01",
               "name": "Olivia Newton-John",
               "profile_path": "/aBaCMaR0dC6moLW2zkZ6B2uBJVn.jpg",
               "id": 8892,
               "order": 3
            },
            {
               "cast_id": 2,
               "character": "Charlene Lee",
               "gender": 1,
               "credit_id": "52fe45069251416c91024ef5",
               "name": "Margaret Cho",
               "profile_path": "/3DUdtidVGm8FFfknl6HfBMBf366.jpg",
               "id": 11152,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Fanny Kondos",
               "gender": 1,
               "credit_id": "56e62052c3a3685a9a008330",
               "name": "Dimitra Arliss",
               "profile_path": "/DlT0DvQ2pe1O0i2iQHBsnsL8GX.jpg",
               "id": 1220923,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Paul Stark",
               "gender": 2,
               "credit_id": "56e61f40c3a36807b2001bbb",
               "name": "George Segal",
               "profile_path": "/oUUcGtlQYC0HMI3yMmO713kDdGT.jpg",
               "id": 18364,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Rodney Bingham",
               "gender": 2,
               "credit_id": "56e61ed5c3a3685a92008896",
               "name": "Bruce Davison",
               "profile_path": "/kYFBIffblcsbLMITDZYHhVf5c9f.jpg",
               "id": 52374,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Daphne Stark",
               "gender": 1,
               "credit_id": "56e61f20c3a3685a90009215",
               "name": "Marlee Matlin",
               "profile_path": "/jqu19nl2p46GE6UAkfztD7jpKOv.jpg",
               "id": 19797,
               "order": 8
            },
            {
               "cast_id": 1,
               "character": "Monty Tipton",
               "gender": 2,
               "credit_id": "52fe45069251416c91024ef1",
               "name": "Bronson Pinchot",
               "profile_path": "/hGaFZsohQbRIskmkLtNbwJNgLPN.jpg",
               "id": 4689,
               "order": 9
            },
            {
               "cast_id": 4,
               "character": "Damian Knowles",
               "gender": 2,
               "credit_id": "52fe45069251416c91024efd",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Jack Allen",
               "gender": 2,
               "credit_id": "56e61fcac3a3685aa0008bcf",
               "name": "Christopher Atkins",
               "profile_path": "/epuXlJ2np6Zp0WIiyo56XHFwevz.jpg",
               "id": 42740,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sara Hart",
               "gender": 1,
               "credit_id": "56e61fe4c3a3685a920088d8",
               "name": "Sally Kellerman",
               "profile_path": "/5MeWRlE2F8S6tGiPx3hZHdDGVml.jpg",
               "id": 9805,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Brandon's mother",
               "gender": 1,
               "credit_id": "56e62000c3a3685aa4008327",
               "name": "Nina Foch",
               "profile_path": "/jd5qWtnZdEvfwuo57CpJVzazYc0.jpg",
               "id": 13026,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Dan Zuma",
               "gender": 2,
               "credit_id": "56e6201fc3a3685a9000924e",
               "name": "Greg Louganis",
               "profile_path": "/aNr8CKrthOU9A2799rHwsBnj1rS.jpg",
               "id": 987030,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Andrew Bingham",
               "gender": 2,
               "credit_id": "58f6b1929251415df8004b3d",
               "name": "Devon Gummersall",
               "profile_path": "/9mw9fqm1dtxObQbG6lUGvlvXvt7.jpg",
               "id": 54455,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Zack Phillips",
               "gender": 2,
               "credit_id": "58f6b1c49251415e1d004b5a",
               "name": "Steve Antin",
               "profile_path": "/3GVyNtFWsPz2nCxSgCo6WN6H0UN.jpg",
               "id": 42745,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Party Guest",
               "gender": 1,
               "credit_id": "58f6c04b9251415e0200540f",
               "name": "Cassandra Peterson",
               "profile_path": "/aQs8AG7k9kCSet39AxMkv76P04a.jpg",
               "id": 44810,
               "order": 18
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45069251416c91024f07",
            "name": "Randal Kleiser",
            "profile_path": "/dtSwBcwtYZL9ir9zfKZaTdwdiSm.jpg",
            "id": 8876,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.357596,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33245,
      "vote_count": 10,
      "budget": 0,
      "overview": "A gathering of friends. A gift of love. A celebration of life.",
      "similar": [
         449176,
         184352,
         26280,
         338189,
         26371,
         9800,
         376867,
         428493,
         152532,
         52799,
         413666,
         380874,
         10938,
         47643,
         1213,
         1966,
         398818,
         277216,
         322127,
         261776
      ],
      "original_title": "It's My Party",
      "runtime": 110,
      "poster_path": "/xoWV9Mv0dKV0h0AuIdGKHRvOk9Z.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Opala Productions",
         "id": 5270,
         "origin_country": ""
      }],
      "release_date": "1996-03-22",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Randal Kleiser"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Randal Kleiser"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113443/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTExNzA0MzAwMTdeQTJeQWpwZ15BbWU2MDE0OTU5OQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Eric Roberts, Gregory Harrison, Margaret Cho | See full cast and crew »"],
      "reviews": [
         "Brandon Theis (Gregory Harrison) and Nick Stark (Eric Roberts) have been lovers for years. Then Nick is diagnosed with HIV. Brandon promises to not leave him---but eventually does. He can't handle The HIV. A year later Nick is told he will die very soon of lesions in the brain. Rather than slowly become a vegetable and wither away, Nick decides to commit suicide. He invites all of his friends to a 2 day party--at the end, he'll take the pills and die. Brandon finds out and attends the party. But does Nick want him there and will Nick be able to forgive him before he goes? Strong, powerful movie. I saw it in a theatre in 1996 and cried my eyes out. I saw it 2 years later with a friend and we BOTH cried our eyes out! Saw it again tonight--cried again. This drama is harrowing at times and brings about questions about love, death with dignity, suicide, HIV...etc etc. But it never gets too maudlin and is always fascinating. Roberts is just superb as Nick. Strong, handsome, refusing to wither away. He also approaches his HIV condition with strength and humor--as he should. Lee Grant is (sadly) wasted as his mother. Harrison is so-so as his boyfriend. Usually he's sort of stone-faced but there were a few moments that the looks on his face made me break down. There's one scene of him and Roberts just looking at each other across the room--you can see the love, fear and hatred in their faces--it's just great. And Harrison really delivers during the last 30 minutes of the movie. There's a huge cast in this movie--Margaret Cho (hilarious); Marlee Matlin (wasted); Olivia Newton-John (just great); Bronson Pinchot (overdoing the bitchiness a bit); Bruce Davison; Roddy McDowall. There's the problem--there are too MANY characters! I'm still not sure who McDowell was and Sally Kellerman shows up looking great but--who is she? We're never told. Also, the party scenes are scattershot--the camera seems to linger around catching certain characters and snatches of their conversations. I also have a hard time believing that anyone has this many friends and they all keep quiet about him committing suicide. Still--problems aside this works. I think this film hit too close for director/writer Randal Kleiser. Supposedly he went through the same things with his lover. When this movie was released he couldn't promote it. It came (and went) very quickly. That's really a shame. It's a strong, powerful movie that should be seen by everybody. And Roberts gives out one of his best performances. The scene when him and Harrison kiss is heart-breaking. Well worth catching--an excellent drama. Just bring plenty of tissues--you'll need them!",
         ". . .and even heaving sobs. When I saw this in 1996 at the theater, I started crying about 15 minutes in and never stopped. I haven't been able to watch it since then. I decided to buy the DVD and see if I coudl get through it without so much crying. ..well, almost. For me, the emotions start pouring over me when I empathize with all of Nick's loving friends, including his former lover Brandon, who are somewhat supportive of his decision, yet really not ready to let him go quite yet. As someone else mentioned, the wink that Nick gives Brandon, signalling his forgiveness of Brandon for his selfishness and lack of understanding, just does me in. From that moment on, and up until the end, the tears keep running down my face. By the way, what a great cast for such a moving film! Eric Roberts and Gregory Harrison are exceptional, and they get great support from Lee Grant, Bronson Pinchot, Margaret Cho, Erich Segal, the late Roddy McDowell, and the rest. I think I'll watch this DVD whenever I'm feelig cynical and weary of the events taking place in this world of bigotry, hatred and war. At least then I can have a good cry about something that really matters: love and affection from one's nearest and dearest.",
         "Please keep your Kleenex close!I think the part where my eyes started getting watery was when Brandon(Gregory Harrison) and Nick (Eric Roberts) kissed. I was yelling and screaming, \"Greg!Why?????NOOO!!\" Yes I am a big fan of the man and I found it very surprising that he took the part as Brandon. After being lovers for 8 years Brandon and Nick are the complete opposite of each other yet they have so much to teach and learn from each other. When Nick gets tested positive Brandon gets scared and after trying his hardest to cope with Nick's illness he backs away from him in fear...maybe even a slight hatred that he is going to die. So they break up, Brandon finds someone else, who is very young and Nick just pretends he doesn't care. 1 year later Nick finds out he has only a few days to live after he discovers he has a brain tumour. He holds a party gathering friends and family. When Brandon turns up out of the blue everyone hates the idea of him being there, even Nick, but Brandon too needs to say goodbye. The actual part that was the saddest is when Brandon discovers that Nick wants his ashes scattered around they place where they first met, as Nick has now planned to kill himself and basically everyone wants to stop him, but know they can't. This was a terrific movie, there wasn't a dull moment, a lot of flashbacks were shown of the relationship Brandon and Nick shared and I think everyone can relate to that it is never easy to lose someone you love especially to death, but it also shows a side of reality that we all have to go sometime and we might as well make the most of life. Eric was terrific as Nick and the way he was trying to avoid Brandon. Gregory was great as Brandon, the emotions of seeing his loved one die slowly and yet still being strong about it for his sake even sitting by his bedside when he dies I think we all want that, to at least have a person by our side so we don't die alone.",
         "This movie has to be one of the saddest films ever made. It's right up there along side \"Steel Magnolias\". I myself cried 30 minutes into the movie. Eric Roberts gives an all out performance as a gay male who decides to end his own life after he realizes he is losing his battle against AIDS. His character decides to have one last big party surrounding himself with family and friends. His ex-lover returns for this one last party to try and make amends. With the constant playing of Dolly Parton's \"I Will Always Love You\" you watch as this man says his last goodbye's and readies himself for his departure. Even though surrounded by friends and family it gives you a strong sense that in the end we still all die alone. Truly a masterpiece and a must see! Just make sure to keep the tissues close by.",
         "I can't believe this movie was made 10 years ago and I never even heard of it before the other day. I was out of town on business, and the hotel I stayed in had Showtime. I fell asleep with the TV on one night, and woke up around 1:30 a.m. This movie was just coming on and it grabbed me immediately. I stayed up and watched the whole thing! I thought it was very well acted and was surprised at the cast of characters. It certainly was a tearjerker, but there were lots of laughs thrown in. I've not seen a lot of movies featuring homosexual relationships, much less ones that were more than a source of a lot of jokes. This one was very touching and I found myself rooting for the characters to work things out. I would totally recommend this movie for anyone looking to see something a little out of the ordinary.",
         "I watched this movie alone one morning on video, expecting it to be a cool ensemble cast movie. It ended up pulling me in so completely that I ignored the phone and never once touched the pause button. It is another of those Hollywood films that may be technically or structurally lacking in the minds of critics...but in my heart and mind it was powerful and effective. By casting known names in many of the subliminal roles...we had a built-in sympathy for them in this situation. The comedy, although sometimes very macabre was believable. I also found the situation believable based on the type of character played by Eric Roberts...the farewell party seemed to fit his personality. I recommend this film to people willing to open their hearts and who don't mind a good cry...",
         "Not only am I stoked that this is coming out on DVD in 2 days, but whenever I need a good cry, I put this movie on. Dealing with everything from relationships to parents to unfortunately, death, this movie is the best written, directed and casted movies i have seen in a very long time.",
         "I'm not a weeper. This is the only movie out of hundreds that I've ever cried watching. It is a simple movie, with many powerful actors giving their most poignant performances. What gets to me most is putting myself in Eric Roberts' place. The image of saying goodbye to everyone I've ever loved before I euthanise myself... ungh... if ever I need to bring tears to my eyes, that would do it.",
         "IT'S MY PARTY Aspect ratio: 1.85:1 Sound format: DTS In the last few days before an AIDS-related brain tumor renders him insensible, a young LA designer (Eric Roberts) decides to end his own life, and throws a final joyous bash for family and loved ones. However, the occasion is strained by the arrival of Roberts' former lover (Gregory Harrison), seeking reconciliation at the eleventh hour... Randal Kleiser's powerful film - inspired by actual events - feels more like a reunion of showbiz friends than a structured narrative, though the results are often deeply moving. Kleiser's defiant screenplay gives short shrift to the suicide debate (Roddy McDowall's character acts as the Voice of Conscience), and he employs mordant humor to keep mawkishness at bay (at one point, Roberts and best friend Bronson Pinchot launch into a rousing rendition of \"It's my party / And I'll DIE if I want to\"!). As you might expect, however, the final twenty minutes are relentlessly, heartbreakingly sad. Amongst the notable supporting players, look fast for Nina Foch, Sally Kellerman, Greg Louganis, Steve Antin and a virtually unrecognizable Dennis Christopher and Christopher Atkins.",
         "This was a very good tearjerker movie. Everybody in this movie gives an oscar calibre performance. I think that Eric Roberts, Gregory Harrison, and Lee Grant derserved an oscar nomination for this movie. Eric Roberts gives a performance of a lifetime. This is his best movie in his career. I cry everytime I watch this movie. This was better than beaches. This is the movie that deserve alot of oscar nominations."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Opala Productions"],
      "summaries": ["\"You won't leave me, will you?\" Nick asks Brandon shortly after revealing to him the results of his last blood test for HIV. \"I don't want to die alone.\" In spite of Brandon's protestations, the two soon find the love they had shared for many years in ruins. One year after their breakup, Nick is confronted with a ravaged immune system and a CT Scan and lab values which, along with his worsening forgetfulness, clenches the diagnosis of Progressive Multifocal Leukoencephalopathy (PML) -- a condition he has seen claim his friends and one which he vows will not take him. Due to the aggressive nature of the disease, he has only a few days of conscious life remaining. His plan, he announces to family and \"extended family,\" is to voluntarily end his life himself before the disease renders him unrecognizable to those he loves and he, in turn, is unable to recognize them. Uninvited to the farewell party, Brandon's presence is greeted with jeers from those who see him as having abandoned Nick is his time of greatest need."],
      "budget": 0
   },
   "movielensId": 685,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "1996-03-22",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Randal Kleiser"],
      "runtime": 110,
      "movieId": 685,
      "title": "It's My Party",
      "mpaa": "",
      "actors": [
         "Eric Roberts",
         "Gregory Harrison",
         "Lee Grant",
         "Olivia Newton-John",
         "Margaret Cho",
         "Dimitra Arliss",
         "George Segal",
         "Bruce Davison",
         "Marlee Matlin",
         "Bronson Pinchot",
         "Roddy McDowall",
         "Christopher Atkins",
         "Sally Kellerman",
         "Nina Foch",
         "Greg Louganis",
         "Devon Gummersall",
         "Steve Antin",
         "Cassandra Peterson"
      ],
      "imdbMovieId": "0113443",
      "originalTitle": "It's My Party",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["fc57UJcDxDM"],
      "plotSummary": "A gathering of friends. A gift of love. A celebration of life.",
      "tmdbMovieId": 33245,
      "avgRating": 3.51681,
      "releaseYear": "1996",
      "numRatings": 565,
      "posterPath": "/xoWV9Mv0dKV0h0AuIdGKHRvOk9Z.jpg"
   }
}