{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rap music",
            "id": 897
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "rapper",
            "id": 4562
         },
         {
            "name": "job",
            "id": 8438
         }
      ],
      "imdb_id": "tt0113118",
      "video": false,
      "title": "Friday",
      "recommendations": [
         10471,
         10426,
         650,
         9490,
         16136,
         39939,
         9516,
         11017,
         10952,
         10611,
         10607,
         10956,
         10218,
         11381,
         2294,
         11635,
         11153,
         10663,
         11977,
         9571
      ],
      "backdrop_path": "/isWyP4jWmcCHjUcanVwGBDwVSsA.jpg",
      "revenue": 28215918,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Craig Jones",
               "gender": 2,
               "credit_id": "52fe43999251416c75016ac3",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Smokey",
               "gender": 2,
               "credit_id": "52fe43999251416c75016ac7",
               "name": "Chris Tucker",
               "profile_path": "/9RQvgEi1GnPK4QzqOGHL3jP3VZr.jpg",
               "id": 66,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe43999251416c75016acb",
               "name": "Nia Long",
               "profile_path": "/q01J3WgNd96GR7CcSxx56N8qwSZ.jpg",
               "id": 9781,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Deebo",
               "gender": 2,
               "credit_id": "52fe43999251416c75016acf",
               "name": "Tom Lister Jr.",
               "profile_path": "/UY4xouwBs8p9QmcXbnP8iy2uYp.jpg",
               "id": 8396,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Mr. Jones",
               "gender": 2,
               "credit_id": "52fe43999251416c75016af1",
               "name": "John Witherspoon",
               "profile_path": "/mlrxal9uTk2h6i0suarNOyYGiTN.jpg",
               "id": 56902,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mrs. Jones",
               "gender": 1,
               "credit_id": "52fe43999251416c75016af5",
               "name": "Anna Maria Horsford",
               "profile_path": "/aHGNsdQyfYiMsclGTlEPvvmZw3a.jpg",
               "id": 54800,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Dana Jones",
               "gender": 1,
               "credit_id": "52fe43999251416c75016af9",
               "name": "Regina King",
               "profile_path": "/qLPsh6SLw0DSi526g8abEqGJbo3.jpg",
               "id": 9788,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Joi",
               "gender": 1,
               "credit_id": "52fe43999251416c75016afd",
               "name": "Paula Jai Parker",
               "profile_path": "/hCFVh90DDs7bhv6qEhepXeJvFtY.jpg",
               "id": 45245,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Big Worm",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b01",
               "name": "Faizon Love",
               "profile_path": "/tKz3IMO2jT8NdoDXOlKmcw4wLXf.jpg",
               "id": 62066,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Red",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b05",
               "name": "DJ Pooh",
               "profile_path": "/rdhmGM82GL5er2N2YmwRPVQxD9U.jpg",
               "id": 65134,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Mr. Parker",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b09",
               "name": "Tony Cox",
               "profile_path": "/5b7fTm33ZblMhMhnwK8KqTJ3nry.jpg",
               "id": 19754,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Ezal",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b0d",
               "name": "Anthony Johnson",
               "profile_path": null,
               "id": 83101,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Pastor Clever",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b11",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Kid #2",
               "gender": 1,
               "credit_id": "52fe43999251416c75016b15",
               "name": "Meagan Good",
               "profile_path": "/rijAxPPt2ecneJE5z4uDZbdNivQ.jpg",
               "id": 22122,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "China",
               "gender": 1,
               "credit_id": "52fe43999251416c75016b19",
               "name": "Terri J. Vaughn",
               "profile_path": "/l3KPUkz0LtwFEHV73MnYWZ0YOTG.jpg",
               "id": 74613,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Black Man at Store",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b1d",
               "name": "F. Gary Gray",
               "profile_path": "/hjMfkAyz5ECn0svAzrkG3YsEaEW.jpg",
               "id": 37932,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Red's Father",
               "gender": 0,
               "credit_id": "52fe43999251416c75016b21",
               "name": "Reynaldo Rey",
               "profile_path": "/t6A6xsI7A1Kk9MeXkqkC2pdhnH4.jpg",
               "id": 97781,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Craps Player",
               "gender": 2,
               "credit_id": "52fe43999251416c75016b25",
               "name": "Michael Clarke Duncan",
               "profile_path": "/A0fXStrmFubDRFS8UeRW7xvcf6S.jpg",
               "id": 61981,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016ad5",
               "name": "F. Gary Gray",
               "profile_path": "/hjMfkAyz5ECn0svAzrkG3YsEaEW.jpg",
               "id": 37932,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016adb",
               "name": "DJ Pooh",
               "profile_path": "/rdhmGM82GL5er2N2YmwRPVQxD9U.jpg",
               "id": 65134,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016ae1",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe43999251416c75016ae7",
               "name": "Frank Fitzpatrick",
               "profile_path": null,
               "id": 61654,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43999251416c75016aed",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 10.623624,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10634,
      "vote_count": 630,
      "budget": 3500000,
      "overview": "Craig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and drinking, looking for something to do.",
      "similar": [
         277216,
         11631,
         2539,
         10054,
         245,
         65,
         401,
         425,
         858,
         1547,
         10330,
         433,
         392,
         8967,
         2288,
         4347,
         69,
         319,
         393,
         745
      ],
      "original_title": "Friday",
      "runtime": 91,
      "poster_path": "/z76scMklBnEC91CFqHcvqrS5coO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1995-04-26",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": "/pXszT8ZWGj3fohU9FY0niA0IDEw.jpg",
         "name": "Friday Collection",
         "id": 43563,
         "poster_path": "/cJUiqO2Z0PDL6cZ2Ic04F1i4gnb.jpg"
      },
      "tagline": "A lot can go down between thursday and saturday...",
      "adult": false,
      "homepage": "http://www.newline.com/properties/friday.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["F. Gary Gray"],
      "runtime": 91,
      "synopsis": "An African-American Family wake up one Friday morning and get ready for an average Friday of work and school. Craig (Ice Cube) gets a call, from his former girlfriend, abusing him and accusing him of going out with another woman. He gets out of his bed, angry and frustrated, and goes and gets cereal, then his dad says the all famous line: Every time I come in the kitchen, you in the kitchen. In the goddamn refrigerator. Eatin' up all the food. All the chitlins... All the pig's feet... All the collard greens... All the hog maws. I wanna eat them chitlins... I like pigs feet. He then proceeds and then his friend Smokey (Chris Tucker) knocks on the door and then they sit on the front porch and start making conversation. They Perve on the local mothers and neighbours. They then see the local bully and hide all their valuables. He talks Smokey into helping him break into his next door neighbours house. After that the boys get high. They then get shot at by some people that Smokey owed money to. Then they finally leave and they see the girl that Craig wants getting hit by the bully. So he pulls a gun out on the bully to scare him, this doesnt work, so hit hits him over the head with a brick and then he gets knocked out, the movie then ends, then they proceed with a sequal.",
      "writers": [
         "Ice Cube",
         "DJ Pooh"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113118/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NzE3MzY0NV5BMl5BanBnXkFtZTYwNTM2MzE5._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Ice Cube, Chris Tucker, Nia Long | See full cast and crew »"],
      "reviews": [
         "When someone asks me which movie i have seen the most times, i have to answer Friday. I know the movie pretty much verbatim, and have seen it well over 30 times. Chris Tucker is one of the funniest people ever. This is his best performance, followed closely by Rush Hour. There are so many funny moments in this movie it would be impossible to name them all here. My favorites would have to be when Smokey meets his blind date, who turns out to be fat and bald, and the scenes where Deebo confronts Smokey and Craig, played by Ice Cube. The movie has a hilarious supporting cast, including John Witherspoon, Tiny Lister, and Bernie Mac. Critics don't know anything. If you ever have a chance to see this and enjoy urban comedy and Chris Tucker, don't even hesitate to watch. 10/10",
         "This is probably one of the best modern comedies. Chris Tucker is great as Smokey, and Ice Cube is great as Craig. The movie starts off perfectly, and ends the same way. It's a very believable film, and is definitely worth a watch.",
         "When I was 14, I first saw Friday and almost choked from laughter. The script by Ice Cube and DJ Pooh is right on target with it's ghetto humor. Another plus point for the film is it doesn't stereotype. But it's Chris Tucker as Smokey who makes this film. His high pitched voice and mannerisms are classic.Hard-core rapper Ice Cube, after appearing in such hard-hitting films as Boyz 'N the Hood and Higher Learning, played his first comic role in this picture he co-wrote with frequent musical collaborator DJ Pooh. Craig (Ice Cube) manages to get fired on his day off (though he claims it's through no fault of his own) and spends the day hanging out with his buddy Smokey (Chris Tucker) and trying to avoid his father (John Witherspoon), who wants him to find another job immediately. Smokey (whose name might have something to do with his tremendous fondness for marijuana) has even more serious problems; he was given $200 worth of weed to sell by Big Worm (Faizon Love), but he ended up smoking it instead, and if he can't come up with the money by the end of the day, he'll be in a world of hurt (and will put Craig in the same place just for being his friend). And Deebo (Tom \"Tiny\" Lister, Jr.), a gargantuan bully who roams the neighborhood on his bicycle, has it in for Craig, while Craig tries his best just to stay out of his way. As one would expect, Friday features a strong hip-hop soundtrack, featuring tracks by such artists as Dr. Dre, Cypress Hill, Mack 10, and Funkdoobiest, as well as old-school R&B selections from The Isley Brothers, Roger, and Rose Royce",
         "Eleven years ago (one year before this movie debuted), if you'd have told me you can get an entire movie from two guys sitting on their porch on a hot Friday afternoon, I'd have said you were nuts. I first saw this movie on a date with my girlfriend as a teenager way back in 1995 (it's hard to believe that was 10 years ago, I laughed through it then and I laugh through it now. It's also the movie that made me a Chris Tucker mark. I see everything that guy is in. The same goes for Cube. I love this movie's ability to show that ghettos aren't all like the 'Good Times' TV series. This movie keeps it's lightheartedness throughout especially with funny characters to support Cube and Tucker like DJ Pooh, A.J. Johnson and Tiny Lister. It also doesn't hurt to have Nia Long with her fine self in it either. But as I stated this movie is very lighthearted and doesn't begin to get serious at all until the end where Craig tears Smokey a new one for getting him involved in the mess, Big Worm's assassination attempt on Craig and Smokey and Craig coming to the aid of Debbie (Nia) when D-bo (Lister) is beating her up. It's at those two points you almost forget this is supposed to be a comedy movie. The most important message in this movie actually came from Johnny Witherspoon who portrayed Craig's father. He gave his son some very fatherly advise...which I hope to follow with my own son one day. Although I can't say I'd have been that calm if I walked into my son's room and saw him holding a semi-aotumatic 9mm pistol. But I did like his advice....as I believe it was meant to be a message to the audience. \"You kids today are nothing but punks, so quick to pick up a gun. You scared to take an ass-whipping!\" (referring to his fists) \"These are all the protection you need. You win some, you lose some, but you live!\"",
         "Believe me, If you could relate to SMOKEY and CRAIG, then you would see why this flick is so funny! While Dumb & Dumber and Austin Powers:The Spy Who Shagged Me, had me rollin' at times, it didn't do enough to throw me at that front porch where our two main characters sit and do nothing but get high and jive! Yeah I can understand those critics who say \"what's the point\"? But in this flick, You don't need a point! Just plain and simple laughs! This is already a camp classic in case y'all don\"t know! Please give it a look.",
         "This movie is hilarious! As far as comedies go about the hood, this one is hands down the best. Chris Tucker and Ice Cube really mix up nicely in this one. This is a feel good movie and doesn't glorify the gritty hard reality violence of the inner city at all, but rather focuses on strugglin to make it with good humor and staying positive. Sure they smoke weed all up and down side to side through this movie, but you have to remember that brings a certain audience and humor to it that wasn't present before. This movie is downright laugh out loud caliber. The situations this odd couple is forced into are interesting and very funny. The re-watch value for Friday is tremendous and the characters are beautifully developed. There are some true memorable moments in Friday, and even more memorable characters. This is just a fun movie from start to finish and never tries to be perfect. Thank you for keeping it light, and to the point. All we wanted was some fun and it was delivered with Friday.",
         "After listening to Ice Cube's song \"Friday\", I was very curious to know how good the actual movie was. Then when I finally bought the DVD of the film, I was very pleased. The movie was a great comedy, filled with laughs and an interesting story. The whole movie's story takes place on a Friday. It's about two friends (played by Ice Cube and Chris Tucker) who try to get through a regular Friday in their urban neighborhood. Little do these two fellows know, this Friday will be anything but regular. This Friday will be the most different Friday they will ever experience. The best thing about the movie is Chris Tucker. He gives a very comical and humorous performance as Smokey, the weed-addicted home boy. I've heard that Chris Tucker didn't star in the sequels to this film, so I refuse to watch the sequels. Ice Cube was pretty good in the movie too, but I wish he didn't have to star in the Tucker-less sequels, since Cube & Tucker go well together as buddies. The soundtrack of the movie is great as well. There are lots of hip hop songs played in various parts of the film. I particularly like the songs from Dr. Dre, Cypress Hill, and Ice Cube himself. The bad part about the movie is that the story itself seems to be over-simplistic. I think a way to improve the movie would have been to add more sub-plots, therefore making the movie contain many funny twists. But still, the movie is pretty good as it is. To sum up, this is a great movie to watch on a day when you're in need of some good comedy. I'd recommend watching the movie on a good ol' Friday night! I give this movie a 7/10.",
         "Friday is a movie that is a different look at life in the hood. Mainly a look at what can go down between Thursday and Saturday with an ensemble of characters that are as funny as you can get with so much marijuana. It is mainly thanks to the breakthrough performance by Chris Tucker as Smokee; the paranoid, conieving and hilarious friend of Craig (played by Ice Cube) which brings this movie to its great lengths. Along with a great back plot, a great cast and funny scenes, this film deserves a place in the movie history for the 90's.",
         "Chris Tucker and Ice Cube what more do you want for a Movie like this!? This movie was funny, bright and original. theirs not a point in the movie where it goes dull or boring. Its starts off when Craig (Cube) wakes up on a Friday morning with his friend Smokey (Tucker) outside of his house for only Smokey to find out Craig got fired on his day off, Smokey tries helping Craig feel better by Rolling him Joints and drinking beer, Craig doesn't touch weed, until Smokey forces him to, they both end up getting high, Along comes Big Worm, the man that gives Smokey the weed to sell, only for Smokey to smoke, later on Big Worm finds out Smokey doesn't have the cash to cough up so Big Worm gives Smokey a deadline warning, or a drive-by. Craig has nothing to do with it, but nothing matters no more. Through out the movie comes local bully's, Stupid Neighbours, dumb friends, Early 90's rap music, drive-by's, Horney midgets, fights and Craig & Smokey. A lot can go down between Thursday and Saturday! 10/10",
         "Friday. This is a film about life in the hood from a comedian's point of view, you watch Craig (Ice Cube) and Smokey (Chris Tucker) tackle drug dealers the local bully and some fine women in this hilarious comedy, Craig is a troubled young man who doesn't no what he want's in life and Smokey is a pot head with very little worry's apart from weed and going to the toilet. I highly recommend this to anyone with nothing to do. This is one of Chris Tuckers best performances. This is Ice Cubes best performance. Look out for Next Friday and The Friday After Next. A lot can go down between Friday and Saturday."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Priority Films (I)"
      ],
      "summaries": [
         "Craig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and looking for something to do. Encounters with neighbors and other friends over the course of the day and night, and their ensuing antics, make up the rest of the movie.",
         "Two homies, Smokey &Craig, smoke up a dope dealer's weed and try to figure a way to get the $200 they owe the dope dealer by 10:00pm that night. In that time they smoke weed, get jacked, and they get shot at in a drive-by.",
         "Having just been canned from his job on his day off, Craig and his best friend Smokey spend the day smoking up in their South Central neighborhood while dealing with a neighborhood bully, relationship troubles, an angry drug dealer, and a lot of other odd characters."
      ],
      "budget": 3500000
   },
   "movielensId": 69,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-26",
      "dvdReleaseDate": "1999-03-22",
      "directors": ["F. Gary Gray"],
      "runtime": 91,
      "movieId": 69,
      "title": "Friday",
      "mpaa": "R",
      "actors": [
         "Ice Cube",
         "Chris Tucker",
         "Nia Long",
         "Tom Lister Jr.",
         "John Witherspoon",
         "Anna Maria Horsford",
         "Regina King",
         "Paula Jai Parker",
         "Faizon Love",
         "DJ Pooh",
         "Tony Cox",
         "Anthony Johnson",
         "Bernie Mac",
         "Meagan Good",
         "Terri J. Vaughn",
         "F. Gary Gray",
         "Reynaldo Rey",
         "Michael Clarke Duncan"
      ],
      "imdbMovieId": "0113118",
      "originalTitle": "Friday",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["dxduMVVnrvU"],
      "plotSummary": "Craig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and drinking, looking for something to do.",
      "tmdbMovieId": 10634,
      "avgRating": 3.55222,
      "releaseYear": "1995",
      "numRatings": 5180,
      "posterPath": "/kkoGT4bnK5oGiNbzGGcXzrXMSxn.jpg"
   }
}