{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "role reversal",
            "id": 5629
         },
         {
            "name": "mistaken identity",
            "id": 10325
         },
         {
            "name": "train wreck",
            "id": 180828
         }
      ],
      "imdb_id": "tt0117104",
      "video": false,
      "title": "Mrs. Winterbourne",
      "recommendations": [
         30500,
         43079,
         24073,
         64523,
         31083,
         36290,
         39233,
         53882,
         144060,
         73336,
         31923,
         18451,
         69719,
         79783,
         18074,
         31342,
         14868,
         12187,
         9302,
         38222
      ],
      "backdrop_path": "/7V6HZvRINYvFO44oiE4l4iiJxQu.jpg",
      "revenue": 10070000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Grace Winterbourne",
               "gender": 1,
               "credit_id": "52fe457ac3a36847f80c9ac5",
               "name": "Shirley MacLaine",
               "profile_path": "/faG5S4EOVaGHNf1CwZryGcHCE4e.jpg",
               "id": 4090,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Connie Doyle/\"Patricia Winterbourne\"",
               "gender": 1,
               "credit_id": "52fe457ac3a36847f80c9ac9",
               "name": "Ricki Lake",
               "profile_path": "/y0nbFpKzWKLkziM9rZYYRUqciyn.jpg",
               "id": 70233,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bill/Hugh Winterbourne",
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9acd",
               "name": "Brendan Fraser",
               "profile_path": "/n8VOWXp94nhIEo5nS9o6bOpUHiN.jpg",
               "id": 18269,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Christine",
               "gender": 1,
               "credit_id": "52fe457ac3a36847f80c9ad1",
               "name": "Jane Krakowski",
               "profile_path": "/sOeuLd0MLBk3M6P0nyvZ8TCDUeK.jpg",
               "id": 13636,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Steve DeCunzo",
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9adb",
               "name": "Loren Dean",
               "profile_path": "/7qYin1jdiWuuFobjlacatyojqds.jpg",
               "id": 11628,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Paco",
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9adf",
               "name": "Miguel Sandoval",
               "profile_path": "/x0mn76606kpJtzzl0B2nfJlZXkE.jpg",
               "id": 30488,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Patricia Winterbourne",
               "gender": 1,
               "credit_id": "52fe457ac3a36847f80c9ae3",
               "name": "Susan Haskell",
               "profile_path": "/o3Q1SwTofUuLhvwnlZFcisP2H9.jpg",
               "id": 114029,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lieutenant Ambrose",
               "gender": 1,
               "credit_id": "52fe457ac3a36847f80c9ae7",
               "name": "Debra Monk",
               "profile_path": "/ufZO6Uo9cy4ayM6jJfHfnqL5Elt.jpg",
               "id": 10386,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Renee",
               "gender": 0,
               "credit_id": "52fe457ac3a36847f80c9aeb",
               "name": "Cathryn de Prume",
               "profile_path": "/lMmyGDWy6FntWTLc5aQp3jWDQRW.jpg",
               "id": 163013,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Father Brian Kilraine",
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9aef",
               "name": "Peter Gerety",
               "profile_path": "/4P7v9Tx7pNkfLGhwDwsP8oBytbt.jpg",
               "id": 1986,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "52fe457ac3a36847f80c9af3",
               "name": "Kate Hennig",
               "profile_path": "/gIZBiesxlZwVOtj5Tp8H5PFULci.jpg",
               "id": 201812,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Dr. Hopley",
               "gender": 0,
               "credit_id": "52fe457ac3a36847f80c9b21",
               "name": "Victor A. Young",
               "profile_path": "/1zBPxaO34RLoN2Tj5OFGuJKOl51.jpg",
               "id": 1212933,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9ad7",
               "name": "Richard Benjamin",
               "profile_path": "/9BQ5QcoCA7sfQzPvBpX8U4zDXqn.jpg",
               "id": 24318,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9af9",
               "name": "Patrick Doyle",
               "profile_path": "/mo87kZiHO5gsoax80Us0S2CPmS.jpg",
               "id": 9152,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9aff",
               "name": "Oren Koules",
               "profile_path": null,
               "id": 2147,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ac3a36847f80c9b05",
               "name": "Dale Pollock",
               "profile_path": null,
               "id": 57680,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457ac3a36847f80c9b0b",
               "name": "Ross Canter",
               "profile_path": null,
               "id": 206366,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe457ac3a36847f80c9b17",
               "name": "Jacqueline Cambas",
               "profile_path": null,
               "id": 33830,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ac3a36847f80c9b1d",
               "name": "William Fletcher",
               "profile_path": null,
               "id": 933105,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53fdab3b0e0a262de50016c5",
               "name": "Alex Nepomniaschy",
               "profile_path": null,
               "id": 59443,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "546378a1c3a368124d0023a0",
               "name": "Cornell Woolrich",
               "profile_path": "/rsiAv7XyWhQrpQecLDzsYfB1teu.jpg",
               "id": 7748,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "546378ab0e0a26780300246b",
               "name": "Phoef Sutton",
               "profile_path": "/4F1uvWAqzDIOfC7OTwTAyf1BkwG.jpg",
               "id": 57986,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "546378b40e0a267800002476",
               "name": "Lisa-Maria Radano",
               "profile_path": null,
               "id": 1384855,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5735235ec3a368025100060a",
               "name": "Nancy Foy",
               "profile_path": "/blCkmS4dqNsbPGuQfozHE6wgWBw.jpg",
               "id": 4952,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.643602,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40001,
      "vote_count": 31,
      "budget": 25000000,
      "overview": "Connie Doyle is eighteen and pregnant her boyfriend has kicked her out. She accidentaly ends up on a train where she meets Hugh Winterbourne and his wife Patricia who is pregnant. The train wrecks and she wakes up in the hosptial to find out that it's been assumed that she's Patricia. Hugh's mother takes her in and she falls in love with Hugh's brother Bill. Just when she thinks everything is going her way, her ex-boyfriend shows up.",
      "similar": [
         26603,
         36914,
         10330,
         35056,
         9655,
         10096,
         59,
         372058,
         238615,
         213,
         49520,
         10261,
         11384,
         15709,
         11829,
         3132,
         322240,
         10631,
         37725,
         7303
      ],
      "original_title": "Mrs. Winterbourne",
      "runtime": 105,
      "poster_path": "/2JlRKnF6qQdCRKRWgXcgPUHMPGv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1996-04-19",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "The story of a girl who is going from filthy to rich",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Richard Benjamin"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Cornell Woolrich",
         "Phoef Sutton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117104/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NzQ5MjIxNl5BMl5BanBnXkFtZTcwNTQ1MzIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Shirley MacLaine, Ricki Lake, Brendan Fraser | See full cast and crew »"],
      "reviews": [
         "'Mrs. Winterbourne' is a highly improbable take on the Cinderella \"rags to riches\" story about 18 year-old Connie Doyle (Ricki Lake), who finds herself enceinte, unmarried, and homeless. Her criminal rat of a boyfriend, Steve DeCunzo (Loren Dean), wants nothing to do with her or the baby. But fate has a better future in store for Connie, and the heavily pregnant girl finds herself, almost miraculously, on a train bound for Boston from New York. There she shares a compartment with a young married couple, Hugh and Patricia Winterbourne (Susan Haskell and Brendan Fraser), who are also expecting a little bundle of joy. But one little innocent action, followed by one horrifying accident, lands Connie in the hospital, mistaken for Patricia Winterbourne. She and her baby, who survived, are both whisked off to the massive Winterbourne estate in Boston. Connie decides to carry on the charade (it's almost ironic that her her name is Connie, since she's \"conning\" everyone) even after coming face to face with her coddling \"mother-in-law\" (Shirley MacLaine) and Hugh's twin brother, the cold and unfriendly Bill Winterbourne (also Brendan Fraser). For a fluff film like this, the cast is surprisingly good. Loren Dean is convincing enough and makes you want to jump into your TV and strangle the jerk. The Winterbourne butler, Paco (Miguel Sandoval), is a delight to watch, especially when he's drunk. But Fraser and MacLaine really make the film worthwhile to see. Why either talented actor would want to participate in a film like this is a mystery to me, but maybe it's for the best. Fraser especially plays twins very well, and his transition from part antagonist to full protagonist is believable. But I have a difficult time understanding why Ricki Lake was cast as Connie. She has a tendency to overact in many scenes, she doesn't make a convincing 18 year-old at all (she was 28 when cast), and her transition from sharp-tongued teenager to polite young socialite bride-to-be is too fast and unbelievable. Overall, 'Mrs. Winterbourne' is a good film for a boring Friday night. This is definitely a chick flick. It's heartwarming and the cast is a joy to watch. Just don't expect anymore than that.",
         "This may only be good if you're expecting it to be very terrible. I was. The beginning wasn't promising. But as soon as Ricki Lake gets on the train, this movie starts to get watchable, and as soon as she moves in with the Winterbournes, it starts to get honestly funny. Brendan Fraser is really a great actor, isn't he? He's too good looking to be as talented as he is. Some fairly hackneyed scenes in this film are made compelling and realistic because Fraser's so good. But there are lots of genuine laugh out loud moments in this sweet, gentle comedy. If the end is too long, too complicated and too stupid, by that time you'll like it too much to care.",
         "This was a great film. Just because Ricki Lake stars in this movie doesn't automatically make it bad. It's a sweet story about a girl who had a rough life and accidentally finds herself with a ton of possibilities just unfortunately, as someone else. Ricki Lakes character has a lot of integrity and is truly a good mom along with all the chaos. Brendan Fraser is very lovable and Shirley Mclain was fabulous as only she could be. This is a definite rental if you haven't seen it and are looking for a sweet romantic comedy. You won't be disappointed.",
         "So Ricky Lake is not the world's greatest actress, but she does well enough. The romance is reasonably believable. The story is friendly. And you get to watch Brendan Fraser for a long while - who is actually even more dishy as Hugh than as Bill, so do pay attention during the act in the train. I watched it twice on television. I could easily bear watching it a third time. Believe me- that's high praise.",
         "I've always wanted to see this movie but I have to admit it was disappointing. It's just so completely implausible and without logic that it's difficult to enjoy. Yeah, I know that fluffy romantic comedies aren't supposed to be realistic, but this one just stretches credulity too much. The worst deficiency is Brendan Frasier's chilly WASP suddenly and inexplicably melting into a nice guy. He not only changes his opinion about Ricki Lake but seems to completely change personality as well. One moment he's rudely questioning her every move and investigating her and virtually the next he's romancing her, tangoing her around the room and kissing her, and then proposing marriage! He goes from aloof to gooey in 6 seconds flat. It's just too much to swallow. What was it exactly that caused him to fall in love - her charming use of the words \"tits\" and \"ass\" at the dinner table? The haircut? (Actually, I liked her hair better long and curly). Don't get me wrong, I love Ricki Lake, and I don't think she was bad here, she just wasn't given anything to do, and we were never given any reason why Frasier should experience such a dramatic sea-change. If perhaps they'd shown that a few months had passed, or something to explain the abrupt turnaround. Frankly, everyone in this movie goes around like their brains are made of mush. I suppose Maclaine's alcoholic character has an excuse, but really, the extremely simplistic and downright stereotypical characterizations of everyone involved (rich people, poor people, gay latino butlers) were insulting. Maclaine, Frasier and Sandoval are excellent comedic actors, and do the best with what they can here, but the characters are not even close to real people. The only real thing I got out of it was drooling over Brendan Frasier, and frankly there are many other superior movies that can be used for that purpose.",
         "Mrs. Winterbourne is perhaps the epitome of romantic comedies, in the requirement that you suspend disbelief. It almost commands that you not think about the plot too much, because if you do, the entire movie falls apart. The plot is simple. Connie Doyle is thrown out by her boyfriend when she becomes pregnant, and she ends up on a train with the Winterbournes, a wealthy young couple on their way to Boston. The train derails, and both Winterbournes are killed. However, as Connie was trying on Mrs. Winterbourne's ring at the time of the accident, she is mistaken for her, and her baby for the Winterbourne grandchild. What follows is what always happens in romantic comedies, Connie is taken in by the Winterbourne family and falls in love with the dead Winterbourne's twin brother, who is initially suspicious of her, but then grows to love her. Complications arise, but everything works out in the end. Shirley MacLaine is quite winning at Grace Winterbourne, and Miguel Sandoval steals most of his scenes. The problem is that neither Ricki Lake or Brendan Fraser have much chemistry with each other, and Ricki Lake seems miscast in general. Of course, there are also massive plot holes here, and even in the end, no one really seems to care that the real Mrs. Winterbourne and the real Winterbourne grandchild are off buried somewhere under someone else's name. This is not a bad movie, it's perfectly pleasant, but you really are required to not think about the plot at all to really enjoy it.",
         "Connie (Ricki Lake) lost her mother at twelve in Hoboken, New Jersey. Because she did not get along with her father, Connie left NJ at 18 and went to NYC. Unfortunately, she immediately hooked up with a low-life named Steve and became pregnant. Steve was less than thrilled with the news and threw Connie out of the house. Although she works as a waitress for awhile, when her delivery date draws near, she finds herself broke and homeless. The next day , Connie boards a train she thinks is the subway but which turns out to be a railway to Boston. There, she is befriended by handsome, rich Hugh and his new and very pregnant wife Patricia. The train derails. Hugh and Patricia are killed. But, by a twist of fate, Connie is mistaken for Patricia and finds herself and her new baby in a private hospital, as befitting the wife of a member of the rich Winterbourne family. She meets her new mother-in-law (Shirley MacLaine) and her \"husband's\" twin brother, Bill (Brendan Fraser) and goes home to a posh, Boston mansion, complete with servants. Just how long will she be able to fool everyone into thinking she really is a part of the family? This is a nice little film for the proverbial romcom fan. MacLaine is wonderful as the matriarch of the wealthy family and Fraser is his usual handsome, quirky, affable self. Lake seems a bit miscast as the girl with a big secret but fulfills her role adequately. The sets, costumes, and production values are very high. Do you love improbable plots and unexpected, humorous romance? Make a date to see Mrs. W. and you will be in your element, absolutely.",
         "I watched this for the first time after I bought it at my video store. I'm a fan of Brendan Fraser and usually enjoy his films. Shirley McLaine and Fraser shine in this movie. I loved both their characters and of course Paco, he was just too funny. I think all the characters fit the actors except Ricki Lake. I feel they could have cast, not necessarily a better actress, but just one who fit into this role more properly. I just can't seem to take Lake as a serious actress. Plus I'm used to her John Waters' film roles. She portrays wacky weirdo characters alot better than a single, pregnant, pennyless outsider. This, in my opinion, is a great feel good flick, perfect for those who crave silly romance comedies. I know my mother couldn't stop talking about it and loves the movie, as do I. All in all... the storyline was cliche - but I tend to like simple movies. Lake's acting could have been better - she did alright considering the films she's appeared in in the past. Simply put, this is a must see for any fans of Fraser or McLaine, who deliver wonderful performances. I give it an 8/10.",
         "First off, if you want to enjoy this one, be prepared to suspend disbelief. The plot hinges on a number of incredibly unlikely coincidences, in the manner of '30's screwball comedies. It doesn't always work, but parts of it are so hysterically funny I'd definitely recommend seeing it. The script is uneven, with the first 20 minutes slow and somewhat depressing. But with the introduction of Fraser and MacLaine it perks up a whole lot. The central problem of this movie is that Ricki Lake simply isn't a strong enough actress to carry a lead role. Her Connie comes across as merely dumb, rather than vulnerable, and she's just not all that funny. To see how Connie should have been played, watch Sandra Bullock in \"While You Were Sleeping\", playing a very similar role infinitely better. MacLaine is terrific as the iron-willed, acid-tongued Winterbourne matriarch, but Fraser steals the show! He has a deadpan delivery that enhances the good lines he's given, but even when he's silent, he's funny. He has terrifically versatile facial expressions that can push a scene from amusing to hilarious. Also, Miguel Sandoval is great as the bossy, flamboyant butler. There is some great side-business between MacLaine, Fraser and Sandoval as the two men conspire to try and keep her healthy, and she sneaks around smoking and drinking. It's fluffy stuff, but these 3 experienced comic performers milk it for everything it's worth. That could pretty much sum up the whole movie: light on plot, light on plausibility, but very very funny. With a different actress exploiting Connie's comic potential this one could have been a gem. As it is, it's flawed but definitely worth seeing. The \"tango\" scene alone is worth the price of the video.",
         "Because Brendan Fraser and Shirley Maclaine make it surprisingly bearable. Ricki Lake, God bless her, was, in a word, miscast; without the strength of Fraser and Maclaine, this movie is a two, at best a three. She's brings no life to the role, no reality. At best, she was an over-actor. At worst... well, she was a bad over-actor. A really, really bad over-actor. Still, for a movie that had so much potential (if not for the sometimes unbelievable -yet entertaining- storyline, then definitely for the two aforementioned lead actors) that was lost beneath the looming shadow that is Lake, I'd watch it again. If it were on cable TV... and if nothing else is on."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "A&M Films"
      ],
      "summaries": [
         "Connie Doyle is eighteen and pregnant when her boyfriend kicks her out. She accidentally ends up on a train where she meets Hugh Winterbourne and his wife Patricia who is pregnant. The train wrecks and she wakes up in the hospital to find out that it's been assumed that she's Patricia. Hugh's mother takes her in and she falls in love with Hugh's brother Bill. Just when she thinks everything is going her way, her ex-boyfriend shows up.",
         "A woman gets pregnant by her boyfriend, who then leaves her. She boards a train, which crashes and she ends up in a hospital, mistakenly identified as Patricia Winterbourne, a widow who's husband died in the train crash. She comes to live with the rich family of her deceased \"husband.\" Her new life is ruined when the real father of her baby comes back."
      ],
      "budget": 25000000
   },
   "movielensId": 691,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-04-19",
      "dvdReleaseDate": "2002-02-12",
      "directors": ["Richard Benjamin"],
      "runtime": 105,
      "movieId": 691,
      "title": "Mrs. Winterbourne",
      "mpaa": "PG-13",
      "actors": [
         "Shirley MacLaine",
         "Ricki Lake",
         "Brendan Fraser",
         "Jane Krakowski",
         "Loren Dean",
         "Miguel Sandoval",
         "Susan Haskell",
         "Debra Monk",
         "Cathryn de Prume",
         "Peter Gerety",
         "Kate Hennig",
         "Victor A. Young"
      ],
      "imdbMovieId": "0117104",
      "originalTitle": "Mrs. Winterbourne",
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["hFHYI9wndWU"],
      "plotSummary": "Connie Doyle is eighteen and pregnant her boyfriend has kicked her out. She accidentaly ends up on a train where she meets Hugh Winterbourne and his wife Patricia who is pregnant. The train wrecks and she wakes up in the hosptial to find out that it's been assumed that she's Patricia. Hugh's mother takes her in and she falls in love with Hugh's brother Bill. Just when she thinks everything is going her way, her ex-boyfriend shows up.",
      "tmdbMovieId": 40001,
      "avgRating": 3.05114,
      "releaseYear": "1996",
      "numRatings": 1271,
      "posterPath": "/4XNWsXCv7vY04RzxyUrN7zWHlxU.jpg"
   }
}