{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117774",
      "video": false,
      "title": "The Substitute",
      "recommendations": [
         10081,
         19371,
         29812,
         9625,
         10173,
         15983,
         40480,
         9057,
         2620,
         42012,
         2163,
         14289,
         25528,
         9545,
         24993,
         11037,
         6,
         10879,
         18856,
         34309
      ],
      "backdrop_path": "/oQnqRpDp61BiiT2F2EVy4FCfumD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jonathan Shale",
               "gender": 2,
               "credit_id": "52fe43f8c3a368484e008865",
               "name": "Tom Berenger",
               "profile_path": "/gueEBgqv1sWFemMXyI4TJ2peuMA.jpg",
               "id": 13022,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joey Six",
               "gender": 2,
               "credit_id": "52fe43f8c3a368484e008869",
               "name": "Raymond Cruz",
               "profile_path": "/4k0r3xJjgTac5GiJoHDDBVAFYcj.jpg",
               "id": 58650,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Juan Lacas",
               "gender": 2,
               "credit_id": "52fe43f8c3a368484e00886d",
               "name": "Marc Anthony",
               "profile_path": "/b6E5BCQkOXlxT1E4nHRyOpehuYU.jpg",
               "id": 47775,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hollan",
               "gender": 2,
               "credit_id": "53563781c3a36841c80021be",
               "name": "William Forsythe",
               "profile_path": "/3oaz2y7hIm3r3OyDKvQ1i2D8cLR.jpg",
               "id": 4520,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rem",
               "gender": 2,
               "credit_id": "5356378cc3a36841fe002203",
               "name": "Luis Guzmán",
               "profile_path": "/e6mIeGBDkNFZwFDoskcetgkU5oH.jpg",
               "id": 40481,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jane Hetzko",
               "gender": 1,
               "credit_id": "544d69cc0e0a2608d4002c8a",
               "name": "Diane Venora",
               "profile_path": "/3k7w5Y7gTAxN1JML7jhN8F8rVrS.jpg",
               "id": 6200,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Claude Rolle",
               "gender": 2,
               "credit_id": "544d69fa0e0a2608cd002ca1",
               "name": "Ernie Hudson",
               "profile_path": "/h6hSUIuvJEjUih3wgMqYOZhNe57.jpg",
               "id": 8874,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Wellman",
               "gender": 2,
               "credit_id": "544d6a160e0a2608c8002eb1",
               "name": "Richard Brooks",
               "profile_path": "/8Jr4ySYA2UNkAOnKRwJTHFSfk5l.jpg",
               "id": 106753,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Darrell Sherman",
               "gender": 2,
               "credit_id": "544d6a29c3a36872cc0028be",
               "name": "Glenn Plummer",
               "profile_path": "/esZnjqw2WRA7zaX8SbJKGMp1xBg.jpg",
               "id": 2683,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Matt Wolfson",
               "gender": 2,
               "credit_id": "544d6a44c3a36872d8002f02",
               "name": "Cliff De Young",
               "profile_path": "/iJvJBQ5PBP5CXGEhznwB7M5JTRD.jpg",
               "id": 1272612,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Hannah Dillon",
               "gender": 0,
               "credit_id": "544d6a56c3a36872cc0028c2",
               "name": "Peggy Pope",
               "profile_path": "/twgdC0ZMQDZl5oqf0rTzcnGRcCs.jpg",
               "id": 92558,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "John Janus",
               "gender": 0,
               "credit_id": "544d6a6b0e0a2608c5002cbd",
               "name": "Willis Sparks",
               "profile_path": null,
               "id": 1378014,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe43f8c3a368484e008873",
            "name": "Robert Mandel",
            "profile_path": null,
            "id": 43786,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.500806,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20762,
      "vote_count": 79,
      "budget": 0,
      "overview": "After he did some jobs for CIA, ex-marine John Shale is visiting his high school love Jane. She's now a teacher in Columbus High School in Miami. Soon after his arriving Jane has her knee cap broken while jogging. After that, John decides to go undercover as her substitute in high school. Very soon he finds out that gang named Kings of Destruction is terrorizing the school.",
      "similar": [],
      "original_title": "The Substitute",
      "runtime": 114,
      "poster_path": "/jlhe2SKWqW3F7BEQl3sOkgXLtkW.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Live Entertainment",
         "id": 285,
         "origin_country": ""
      }],
      "release_date": "1996-04-19",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Substitute Collection",
         "id": 143766,
         "poster_path": "/hImw5aICI3kqEFARKVBzHkehVWb.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Mandel"],
      "runtime": 114,
      "synopsis": "The plot revolves around Shale (Berenger), a mercenary and a Vietnam veteran who goes undercover as a high school teacher in Miami to combat a gang. In the beginning of the film Shale comes home from a disastrous mission where three of his men were killed in an operation in Cuba. He arrives in Miami to find out that a knee-cap attack has left his girlfriend Jane Hetzko with a broken leg. Shale decides to play the part of a Harvard-educated substitute teacher and recruit his former soldiers (Raymond Cruz, Luis Guzmán, Richard Brooks, and William Forsythe) in order to find the culprits. While teaching history, Shale crosses paths with \"Kings of Destruction\" (KOD) gang leader Juan Lacas (Marc Anthony). Shale realizes that Lacas is responsible for Jane's attack, but that is just the tip of the iceberg of his nefarious activities. Shale's team infiltrates the school and sets up military surveillance gear throughout the bathrooms and corridors which lead to the discovery that Lacas is in cahoots with principal Rolle (Ernie Hudson) to use the school buses and their secret storage compartments as conduits for a heroin distribution ring in the greater Miami area.",
      "writers": [
         "Roy Frumkes",
         "Rocco Simonelli"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117774/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1MTczNzUzOF5BMl5BanBnXkFtZTcwODg4NzcxMQ@@._V1_SY317_CR13,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Berenger, Raymond Cruz, William Forsythe | See full cast and crew »"],
      "reviews": [
         "Even though it was kind of a low-class type of story and movie with mostly bad, profane people tossing the f-word around like it was candy, it still was an enjoyable movie in a lot of parts and certainly had a satisfying ending. Perhaps that's why it was successful enough to spurn a sequel (albeit, a weak one.) Tom Berenger is good to watch. He's convincing as a tough guy substitute teacher \"Jonathan Shale\" who won't put up with the punks in the classroom. And, boy, you see the worst group of high school students I've ever seen on film. Tough to imagine kids harder to encounter than these slime-balls but satisfying to see them dealt with accordingly. You have to love it.",
         "\"The Substitute\" is not high art. Ebert reviewed it as a serious film and gave it a very negative review. But as a B-movie where the teachers get revenge, the bad guy dope-peddling punks and principal get their due, it is a virtual \"The Patriot\" for the high school system. You can't help but smile and root and rejoice when punk after punk gets thrown out the upper floor window by Beringer while the principal relaxes in his office, assuming the punks will prevail. Beringer plays a mercenary who becomes the substitute when the real teacher is injured by the punks. With his background in covert operations, and his support network, the punks are no match for him. I've seen it several times on network TV, its one of those films I just can't stop watching. Roy Frumkes, who wrote each of the \"Substitute\" movies wasn't trying to create a classic, just fun entertainment. In a personal communication he said, \" Not only did that film surprise everyone by doing as well as it did, but when it came time for the three sequels, my contract was worded so that they couldn't get rid of me!\" Thus providing his retirement fund. Hey! some people win the lottery. His was a different kind of lottery. I like \"The Substitute\" a lot. I think Roy Frumkes is a classy guy. It is destined to be one of those cult films that lasts much longer than logic says it should.",
         "These no-nonsense action films that try to convey some social statements have a soft spot in my books and therefore I sometimes rate these movies higher than they actually deserve. The Substitute is a late bloomer in this department since it actually received a theatrical release and did fairly well. Nowadays films like these go directly to video or television and the ambition that was invested in these films is today nonexistent. The terribly underrated Tom Berenger plays a mercenary whose girlfriend is a teacher at a lower class high school. When she's attacked by a thug Berenger creates his own resumé and teacher credentials and assumes her position at the school and becomes the substitute teacher. Once there he discovers the school is run by a corrupt drug dealing principal who's using some students there to help him run his operation. Naturally Berenger, along with some of his mercenary friends, take action and attempt to stop this operation which culminates in a massive shoot out on school grounds. While this is an action movie at heart, it also tries to relate some well meaning messages about today's youth. The way lower class kids are living, which is dangerously on the edge, their way of thinking and looking at the world around them. In a particularly nice scene, one character doesn't admit to being ashamed of how her life is but when asked if she wanted her child to replicate her life, well, that's another matter indeed. That one scene explains a lot and it's moments like these that actually make The Substitute a little bit more interesting than many other films of similar nature. But the film doesn't go too far into social matters and quickly gets down and dirty with the action, which is well served and the film never slows down too much. All the cast are willing and able to entertain, some real quality actors here and they all fare well. The Substitute in many ways represents a dying breed of movie-making and it will probably give movie fanatics a feeling of nostalgia in years to come.",
         "No matter how many times this movie is shown on cable, I still have to pause for at least a few minutes and watch portions of it. This is one of those action films that will entertain you as long as you don't try to apply logic to it or take it seriously. The story has a professional mercenary (Berenger) and his army pals looking for work after they are cut loose from active duty following a botched mission in Cuba. Berenger doesn't want the group to get involved in running drugs for anyone, but that seems to be the only work that mercs can get these days in Florida. After Berenger's girlfriend is attacked by a ruthless street gang (led by Latin heart-throb Marc Anthony, no less) he and his pals end up trying to weed them out of the high school where she teaches. Berenger poses as her substitute teacher, and once he gets an inside look at the problems at the school, he realizes there may be more than just a gang of punks causing the trouble. It's up to Berenger and his merc pals to try and rid the school of its criminal element, and make things safer for the kids. You cannot deny the good intentions of the plot, even if it is a bit preposterous. The acting is a little wooden in places, and the soundtrak (particularly the rap song in during the final credits) is laughable. The script has some questionable dialogue, and sometimes it can be downright amatuerish. There are plenty of shoot-outs and explosions to get the viewer's blood pumping, and it's nice to see someone make a stand in a tough environment like an inner-city high school. This movie has spawned a few sequels which I won't comment on since I have only seen one of them, and they have no connection to the original. Overall, this film is definitely worth watching if you are into action and revenge type themes. If you are looking for anything deep and insightful about the problems of the inner-cities, you may want to look elsewhere. So sayeth the Hound.",
         "This movie, set in South Florida, incorporates history and realistic action to weave an entertaining story of South Florida crime. Tom Berringer is believable as a mercenary who seeks to find out why his girlfriend is attacked by a high school gang by becoming a substitute teacher. The acting, across the board, is excellent. The school principal, Glenn Plummer, provides a believable ringleader of the school gang with a powerful acting role. Mark Anthony is outstanding as his top henchman and provides one of the best acting jobs of any singing entertainer since Mark Walberg. MA is a natural! The action is never static, the fights are believable in comparison to standard Hollywood fare, the locations are real and the overall dialog and cinematography is outstanding. No cheap tricks like unnecessary explosions or animation matting needed to cement this action in reality. I highly recommend this movie (even on standard TV having to wait through the ads is not a problem). It is entertaining, credible and keeps you hooked to see how they wrap it up. If you like gritty, real, down-to-earth action with high school kids who are more than cardboard characters, this is a movie you'll love. If you're from South Florida, it is a major bonus seeing SF locations although jumping from Fort Lauderdale to Miami stretches the reality of living in this area. Rent it, buy it, love it.",
         "Maybe, maybe not. But as far as the action flick genre is concerned this might just rank up there as at least one of the best. Sorry FT. Berenger gives the performance of his life here as a mercenary who goes undercover as a teacher at a school run by drug dealing thugs. Additional kudos go to Ernie Hudson who gives a riveting performance as the high school principal on the brink. Even J Lo's present squeeze Marc Anthony gets into the act as the surly gang leading nemisis to Berenger's good guy portrayal. Director Robert Mandel of School Ties fame does a phenomenal job tying up all the loose ends presented throughout Roy Frumkes and Rocco Simonelli's brilliant screenplay and treating the viewer to a climax that is both intensely shocking as well as entertaining. The beach scene where Berenger's girlfriend played by the lovely Diane Verona a perfect example of why this movie is a real standout. Verona is first seen jogging along the beach while the viewer is treated to the soundtrack's Mongo Jerry's \"In the Summertime\". Then out of the blue, in broad daylight, in front of dozen's of onlookers, a thug runs up and whacks her knee with a lead pipe ala Nancy Kerigan's Olympic ordeal. Tom Berenger then comes (out of the blue) to her aid and carries her off to the hospital. My only complaint was that were not more scenes in the movie like this one.",
         "****SPOILERS**** \"The Substitute\" starts off like a solid inner city drama about violence in a high school in Miami with teacher Jane Hetzko, Diane Venora, after being threatened by one of the schools violent thugs Juan Laucas, Marc Anthony, goes to the schools principal Claude Rolle, Ernie Hudson, for help. Only to be told that there's nothing that he can do, how many times have we heard that before. After having it out again with the same Laucas and his gang as she was going home Jane is later attacked while she was jogging by the beach and was crippled with a smashed kneecap. Jane's boyfriend Shale, Tom Berenger, who happened to be an unemployed mercenary looking for work got a job at the school, in fact the very same class, that Jane worked at as a substitute teacher after a friend of his working in the Miami record office falsified a background check for Shale as a licensed teacher. Shale, calling himself Mr. James Smith, after breaking a number of fingers and wrists got the disruptive students in line in no time at all. The movie starts to take a turn when Shale/Mr.Smith notices that something just isn't right about the school with students driving around with $50,000.00 BMW's and wearing as much as $100,000.00 gold watches, including principal Rolle. That it's obvious to Shale/Mr.Smith that there's more going on in the school then just readin' ritin' and rithmetic. Implausible action drama that does have it's moments as Tom Berenger battles school thugs and drugs pushers. With the high school principal Rolle being the #1 drug dealer getting his drug supply from a brutal Indian drug gang, The Glades mob. With the drugs being distributed by Rolle's personal \"Deans List\" the gang that runs and terrorizes the school, Columbia High, the \"Kings of Destruction\" or K.O.D. Tom Berenger is quite good as the Soldier of Fortune, Shale, turned concerned citizen and high school teacher, Mr. Smith, who with the help of his mercenary friends cleans up the school and smashes the K.O.D gang and Glades drug mob in the process just for good measures. Action-packed movie that looks more like a Steven Seagel or Burce Willis slam-bang action flick then a film about school violence like \"Blackboard Jungle\". Unlike in most of these type of action movies with Seagal & Willis, especially Seagal, where the hero completely overpowers his opposition with very little or almost no damage to himself the hero in \"the Substitute\", Mr.Smith/Shale, takes a lot more then he dishes out from his opponents. Which makes him more human and sympathetic to the movies audience who can easily identify with him. Shale/Smith is also very sweet with his girlfriend Jane and does show genuine concern for his students as well as his co-workers in the school so that even with the somewhat unbelievable plot Tom Berenger's acting does make you forget just how ridicules the movie really is. Diane Venora is effective as Berenger's girlfriend as well as Marc Anthony as Juan Laucas the K.O.D gang leader. Ernie Hudson as the corrupt school principal and former corrupt cop Rolle played it a little to much and it made you wonder how he's been getting away with his drug dealing operations. Rolle doesn't seem to be too concerned if anyone knows about them to the point where he has over a hundred kilos of coke hidden in the schools boiler room. He also uses the K.O.D to knock off anyone who's a threat to his drug operation in his high school like when he tried to knock off Shale/Mr.Smith, without success, without any fear of the local police. In regards to his drug dealing Rolle doesn't at all seem to care or be afraid of an FBI or federal investigation. The final shot-out in the school with Shale and his mercenary friends with the Glade mob & K.O.D gang was as good as anything that you would see in this type of movie. With Shale's on and off again mercenary friend and buddy Hollan, William Forsythe, as a stand out as he more then makes up for all the trouble that he caused Shale all throughout the movie.",
         "On a Friday, some weeks ago: the so-called television highlight for this evening was the \"The Substitute\", a film that got nothing but bad reviews by the TV guides. Nevertheless I decided to watch this flick - and after all it was really better than I had expected, because this movie contains enough action and suspense to keep you awake! The story is quite far-fetched but interesting in any case and actors like Tom Berenger, Diane Venora or Ernie Hudson do a solid job. Not as demanding as the brilliant \"One Eight Seven\" starring Samuel L. Jackson but definitely good entertainment! 6/10",
         "There are alot of different movies based upon school disruption, but the best ones I've seen thus far are The Substitute and 187. 187 has a bit more meaning to it, but a little less action. Tom Berenger has always made a believable tough guy (just look at Platoon) I recommend this movie to anyone who enjoys action flicks. *** 1/2 out of *****",
         "Here's one of those immensely satisfying albeit somewhat unlikely flicks in which the scumbags really get their just deserts. Think Dangerous Minds crossed with Death Wish and you'll have a pretty good gist of things here. The ever excellent Tom Berenger stars as a tough as nails mercenary who seeks retribution after his teacher girlfriend is viciously assaulted on the orders of a high school gang calling themselves the Kings Of Destruction. And what better way for our hero to get up close and personal with his quarry than to take the now vacant teaching position his girl friend has left at school and to pose as a substitute. In this assumed role our man quickly weeds out the problem students with some no nonsense discipline which will be sure to raise a smile on most viewers faces. Matters turn out to be a bit more complex however when it is revealed that the school principle is not quite such a genial chap as he at first appears.....in fact far from it as he is orchestrating the gang within his school and trafficking drugs via them. Subsequently our hero enlists the aid of his mercenary buddies to lend a hand and all merry hell subsequently breaks out including in one hilarious scene, one of our boys firing off a rocket launcher down a school corridor(!!!!!) Yes, whilst realism this may be woefully lacking, in fun it more than makes up for! Go on, treat yourself to this wonderful slice of carefree and highly satisfying escapism - you know you want to."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Dinamo Entertainment",
         "H2 Productions",
         "Live Entertainment"
      ],
      "summaries": [
         "After a botched mission in Cuba, professional mercenary Shale and his crew Joey Six, Hollan, Rem, and Wellman head home to Miami, Florida, where Shale is reunited with his fiance Jane Hetzko, who is a history teacher at Columbus High School in Miami. Some of Jane's students happen to be members of a street gang known as the \"Kings of Destruction\" (KOD), led by Juan Lacas, who has been terrorizing Jane. After Jane's kneecap is broken by a big seminole named Bull, she tells Shale that she believes Lacas ordered the attack, so Shale goes undercover as Jane's substitute, and initially, Jane has no idea that Shale is doing this. At the school, Shale meets principal Claude Rolle, librarian Hannah Dillon, and english and drama teacher Darrell Sherman. It turns out that Lacas is one of Jane's students. As Shale investigates the attack on Jane, he discovers that drugs are being circulated into the school. Shale even investigates local drug kingpin Johnny Glades, who may or may not have someone inside the school distributing the drugs for him. Lives are threatened as Shale investigates and sets out to clean up the crime infested school.",
         "After he did some jobs for CIA, ex-marine John Shale is visiting his high school love Jane. She's now a teacher in Columbus High School in Miami. Soon after his arriving Jane has her knee cap broken while jogging. After that, John decides to go undercover as her substitute in high school. Very soon he finds out that gang named Kings of Destruction is terrorizing the school. Shale is going to give everything to stop them, even his own life."
      ],
      "budget": 0
   },
   "movielensId": 694,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1996-04-19",
      "dvdReleaseDate": "1997-06-17",
      "directors": ["Robert Mandel"],
      "runtime": 114,
      "movieId": 694,
      "title": "The Substitute",
      "mpaa": "R",
      "actors": [
         "Tom Berenger",
         "Raymond Cruz",
         "Marc Anthony",
         "William Forsythe",
         "Luis Guzmán",
         "Diane Venora",
         "Ernie Hudson",
         "Richard Brooks",
         "Glenn Plummer",
         "Cliff De Young",
         "Peggy Pope",
         "Willis Sparks"
      ],
      "imdbMovieId": "0117774",
      "originalTitle": "The Substitute",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["vsaUp6_jcJY"],
      "plotSummary": "After he did some jobs for CIA, ex-marine John Shale is visiting his high school love Jane. She's now a teacher in Columbus High School in Miami. Soon after his arriving Jane has her knee cap broken while jogging. After that, John decides to go undercover as her substitute in high school. Very soon he finds out that gang named Kings of Destruction is terrorizing the school.",
      "tmdbMovieId": 20762,
      "avgRating": 3.01575,
      "releaseYear": "1996",
      "numRatings": 2920,
      "posterPath": "/jlhe2SKWqW3F7BEQl3sOkgXLtkW.jpg"
   }
}