{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "police corruption",
            "id": 11734
         },
         {
            "name": "female detective",
            "id": 160342
         },
         {
            "name": "murder investigation",
            "id": 161982
         },
         {
            "name": "child murder",
            "id": 166109
         }
      ],
      "imdb_id": "tt0114736",
      "video": false,
      "title": "True Crime",
      "recommendations": [
         73846,
         51986,
         20224
      ],
      "backdrop_path": "/n9H0tyKZdmQxm4E8zI012kCI3lb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mary Giordano",
               "gender": 0,
               "credit_id": "5541ad729251414ae6003224",
               "name": "Alicia Silverstone",
               "profile_path": "/12OZNUQRfloOCJ7Q4JQneojSyQ4.jpg",
               "id": 5588,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tony Campbell",
               "gender": 2,
               "credit_id": "5541ad7fc3a3681da0002fa8",
               "name": "Kevin Dillon",
               "profile_path": "/uAJsJxnbTWOpkBjRRBNtyRDt8qW.jpg",
               "id": 6863,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Detective Jerry Guinn",
               "gender": 2,
               "credit_id": "5541ad8e9251414aee0030d2",
               "name": "Bill Nunn",
               "profile_path": "/dcZWC2iGjHasKwdYSwpHcWFQX5a.jpg",
               "id": 5502,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Liz McConnell",
               "gender": 1,
               "credit_id": "563407a29251414ad8013f65",
               "name": "Tara Subkoff",
               "profile_path": "/qBbSymmytAOqgAGlll3sN5LXih3.jpg",
               "id": 61111,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Earl Parkins",
               "gender": 2,
               "credit_id": "57786611c3a3685fbb000527",
               "name": "Michael Bowen",
               "profile_path": "/xGNcy5uCe0Ke5vqC7oZlOV3GGDx.jpg",
               "id": 2234,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Vicki Giordano",
               "gender": 1,
               "credit_id": "5778664ac3a3686539000368",
               "name": "Marla Sokoloff",
               "profile_path": "/qNyn2sQpvMxmZjaEVXElUYb9IRl.jpg",
               "id": 80109,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Celia Giordano",
               "gender": 1,
               "credit_id": "577866659251411cd40002bc",
               "name": "Jennifer Savidge",
               "profile_path": "/1Scq2I6HmCpJUpKgAEJL2y16n6O.jpg",
               "id": 28165,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe462d9251416c9104bcb5",
               "name": "Pat Verducci",
               "profile_path": null,
               "id": 1046169,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5541adb1c3a36877ee002a3f",
               "name": "Pat Verducci",
               "profile_path": null,
               "id": 1046169,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.484149,
      "production_countries": [],
      "id": 37144,
      "vote_count": 10,
      "budget": 0,
      "overview": "Mary Giordano is a bright, intelligent student who goes to a catholic school. She also has a addiction to mystery novels and detective magazines (hence the title of the movie), which inspire her to do her own detective work. When she starts snooping around on the case of a murderer of teenage girls, it gets her in hot water with her mentor Detective Jerry Gunn. But it also starts a team up with police cadet Tony Campbell. The two work together to find the murderer. But the closer Mary gets to solving the murder, the more danger she puts herself in of being the next victim.",
      "similar": [
         984,
         357096,
         15069,
         8090,
         123109,
         26390,
         12150,
         2832,
         4771,
         96,
         75780,
         807,
         238636,
         276488,
         1939,
         445954,
         2142,
         1923,
         21484,
         9411
      ],
      "original_title": "True Crime",
      "runtime": 94,
      "poster_path": "/5lxz78SFABXeT89Wcr7MHJXBDB5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-03-12",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Trust no one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pat Verducci"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Pat Verducci"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114736/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMTQ0NTg3OV5BMl5BanBnXkFtZTcwNzYxNTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alicia Silverstone, Kevin Dillon, Bill Nunn | See full cast and crew »"],
      "reviews": [
         "Alicia Silverstone is looking for a killer. The sick twisted type. See she's a big fan of those 'True Crime' magazines hence the title. Now I've never been able to grasp the interest of these magazines, but that's of no consequence here. It seems very likely a murder is going to happen and she'll naturally investigate. Along the way hooking up with a police cadet (Kevin Dillon) who's off doing his own investigation. They form an unofficial partnership and from there things proceed pretty much how you expect in these sorts of movies. More bodies show up, as do many suspects, including the police cadet, cue the sexual tension. Can you say predictable yet? The problem with True Crime like many movies is it has nothing new to say. It's watchable, but you've seen it all done before and to better effect. The premise could be decent, but there is no follow through. It's just another cookie-cutter thriller with way too many red herrings thrown at you and a scene that happens early in the middle half of the movie just ruins it all. I call it the \"point of no return\". Without giving away too much I'll say this: She ends up investigating a house and finds hard incriminating evidence in and outside the place. Then she gradually seems to forget about it. Time passes and attention shifts to other suspects but why!? Eventually we end up back at square one and yup you guessed it. The person's house which she found all that evidence at turns out to be the killer. Laughable. True Crime is just below average in the end. The cast is passable, there's a creepy moment or two, but the end of the movie is a joke. Unless you're a big fan of Alicia Silverstone or have lowered expectations for thrillers you should pass. Especially with the blunder the movie makes that means you can easily predict who the killer is going to be. Nevermind the fact that a 16 year old girl is smarter than all the police officers in town put together. True Crime this is not.",
         "I saw True Crime when it was first released back in the mid-nineties and I have watched it many times since. It is a great mystery about Mary (played by Alicia Silverstone), a high school senior in a California town who's classmate's younger sister was tortured and killed by an unknown murderer. Mary meets Tony (played by Kevin Dillon), a police cadet who sees how bright she is and they decide to work together to try to find the killer. Many suspects in this one. True Crime feels very \"true\" or real to me. I read a newsgroup review where someone wrote that total suspension of disbelief is present here and it is so true. Alicia Silverstone is perfect in this role and Kevin Dillon and Bill Nunn do a great job, as do the other actors. The locations are right on and the writer/director, Pat Verducci, really captures some of the realities of teenage life and of Mary's loneliness (see the scene where Mary awakens from the dream sequence after having viewed the photos she took of Tony). I wish Verducci would make more movies. I have not seen any other movie quite like True Crime. 10/10",
         "I searched out this one after seeing the hilarious and linguistically challenging \"Clueless\" (1995), perhaps Alicia Silverstone's best known effort from early in her film career. \"True Crime\" has Kevin Dillon, which should be helpful in improving most film projects. In fact everyone in the cast does a good job . The only disappointment I think the movie has for me is an awkward \"feel\" to some of the scenes, coming from the need to run a quite uncompromising, grown up theme as part of what in tone starts out as a schoolgirl adventure. Alicia Silverstone is pretty good in this one. She carries off well the naive enthusiasm and growing unease that affects Mary Giordano as she manoeuvres towards the truth behind the serial murders. I reckon her characterization of MG has some mileage in it too. The inference of the story line is that she goes on to a career in law enforcement. It could be really interesting for an older Silverstone to revisit Giordano at a time of crisis later in the officer's life. Just a thought! \"True Crime\" shows its director in a good light. Pat Verducci also has the writing credit. I don't know of any other film work PV has done. I can only wonder what happened after such a promising start. Like most productions, this one has a largely unknown supporting cast, although Bill Nunn (Detective Jerry Guinn) is hardly that. Over the past decade he seems to have been able to secure an impressive number of screen appearances. I recall seeing him recently in \"Carriers\" (1998), a made for TV presentation with a military theme. Bill Nunn played \"Captain Arends\". Fans of the classic US TV comedy show \"Who's the Boss\" may also have an interest in \"Carriers\" because the leading player is Judith Light, remembered with affection by many because of her lengthy involvement with the show. \"True Crime\" could easily not have worked, but it does OK. I think it is an entertaining story worth seeing.",
         "i got to see the whole movie last night and i found it very exciting.it was at least,not like the teen-slasher movies that pop out every now and then.the search for the killer and the 'partner' relationship between the hero&the so-called bad guy was parts i liked about the movie.also,i remember once being on the edge of my seat during a specific scene in the movie.i mean it's exciting.maybe some time later,i might watch the movie again...",
         "i thought this movie was wonderfully plotted it made me confused and my cousin who watched it with me.to tell the truth i think that the younger kevin dillon was hot.hahahaha...but i also thought the girl was stupid to go along with the cop and that was wrong what he said to her before his death\"i was inside you\".i think that's what she gets for doing what she did with him and how is he going to tell her that she's too young when he never cared how old the other girls were.?now i don't think i myself could ever trust a cop like that.but to tell the truth it was pretty obvious it was him even if he was wanting to become a cop i would still be suspicious of him either way.and that was funny when she sprayed him in the eye in the store.hahahahaha.she was still stupid for going into the warehouse again by herself and so was the cop who died HELLO!! it's called back-up.sometimes these movies make me mad when people act stupid and do stupid things.but that's what i think an thought about the movie.",
         "I try to be very objective when I view a low budget movie. I also apply a lower weight to independent and low budget productions versus the big budget productions. I expect near flawlessness from big budget productions and their studios. Therefore I apply tougher criteria to the major studio releases. But this movie was just a dud. Period. The premise was terrible. The main character, Mary Gordano (Alicia Silverstone), was unbelievable as a high school senior with an unquenchable desire to solve crimes. There was not enough depth in her character or her acting that pulled you into her world. Also, to make this movie more mysterious, the lighting in certain scenes did not set the mood, especially in the warehouse. Once again another disappointing movie that I could only give three points to.",
         "Alicia Silverstone (pre-\"Clueless\") plays a modern-day crime-obsessed teenager attempting to solve the brutal slaying of a local girl. Pat Verducci wrote and directed this B-flick, which isn't especially well-made but is however surprisingly serious-minded in regards to its leading character. Silverstone is appealing and successful in carving out an interesting young woman here, despite the picture's kitschy undermining. The supporting cast (including Kevin Dillon and Michael Bowen) isn't bad, though the violence in the last act goes overboard. Not a cheesy camp-fest, but nothing exceptionally memorable either. *1/2 from ****",
         "I have seen this movie and even though I kind of knew who the killer was from the beginning I still liked watching it. I would recommend it to other people. It comes on Lifetime movie network quite a lot. And I am thinking since it's close to Halloween they might play it more. So please be on the look out for it if you are interested in watching it. I believe that Alicia Silverstone played her part very well. I really like her as an actress and person. She seems so nice and down to earth. Kevin Dillon he's performance was so so for me. I am not trying to knock him or anything but I believe that his brother Matt would have been able to pull this bad evil serial killer persona better. Kevin just seems too sweet for me. But I think he did okay.",
         "This film was so predictable, that during the entire time you're hoping that the obvious suspect is innocent, and there's some other big twist still coming. However... it doesn't. He just continues to act creepy, and she continues to ignore it. Mary found very incriminating evidence at his place, and she still trusted him? And what was that \"baiting the trap\"? There was no trap. She confronted him, he said \"excuse me. I have to go kill someone\" He left, and that was the end of it. They make attempts to use other suspects, (like that one older carnival girl at the end) but they're completely underdeveloped. Actually, all the characters are underdeveloped. They have no depth, and the setting is just plain strange... who hangs out in a recycling factory?? Its choppy and nothing is well developed. For example: When she leaves his place after having the beer, and he finds the pics and she runs out and he catches her and they end up having sex in that car... what was that? Her reactions weren't portrayed. In the car she acted scared like it could have been practically rape- but then all we see is her showering the next morning. booooooooo It could have been so much better.. sooo much better.",
         "This is a nice piece of work. Very sexy and engaging enough plot to keep my interest throughout. Its main disadvantage is that it seems like it was made-for-TV: Full screen, and though there were several sex scenes, there was absolutely no nudity (but boy did it come close!). Strange, too, since Netflix shows that it was rated R. Nonetheless, very titillating, and I wish Alicia Silverstone made more movies like this. One Netflix reviewer stated that it was part of a series, but I have been unable to find out what series that is. I'd like to find out, though, because this movie was THAT good. Walt D in LV. 8/23/2005"
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Trimark Pictures"],
      "summaries": ["Mary Giordano is a bright, intelligent student who goes to a catholic school. She also has a addiction to mystery novels and detective magazines (hence the title of the movie), which inspire her to do her own detective work. When she starts snooping around on the case of a murderer of teenage girls, it gets her in hot water with her mentor Detective Jerry Gunn. But it also starts a team up with police cadet Tony Campbell. The two work together to find the murderer. But the closer Mary gets to solving the murder, the more danger she puts herself in of being the next victim."],
      "budget": 0
   },
   "movielensId": 695,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-12",
      "dvdReleaseDate": "1999-05-25",
      "directors": ["Pat Verducci"],
      "runtime": 94,
      "movieId": 695,
      "title": "True Crime",
      "mpaa": "R",
      "actors": [
         "Alicia Silverstone",
         "Kevin Dillon",
         "Bill Nunn",
         "Tara Subkoff",
         "Michael Bowen",
         "Marla Sokoloff",
         "Jennifer Savidge"
      ],
      "imdbMovieId": "0114736",
      "originalTitle": "True Crime",
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["t76Rn-TGUL8"],
      "plotSummary": "Mary Giordano is a bright, intelligent student who goes to a catholic school. She also has a addiction to mystery novels and detective magazines (hence the title of the movie), which inspire her to do her own detective work. When she starts snooping around on the case of a murderer of teenage girls, it gets her in hot water with her mentor Detective Jerry Gunn. But it also starts a team up with police cadet Tony Campbell. The two work together to find the murderer. But the closer Mary gets to solving the murder, the more danger she puts herself in of being the next victim.",
      "tmdbMovieId": 37144,
      "avgRating": 3.18095,
      "releaseYear": "1996",
      "numRatings": 887,
      "posterPath": "/5lxz78SFABXeT89Wcr7MHJXBDB5.jpg"
   }
}