{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "corruption",
            "id": 417
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "wedding",
            "id": 13027
         }
      ],
      "imdb_id": "tt0116289",
      "video": false,
      "title": "Feeling Minnesota",
      "recommendations": [
         149553,
         63437,
         38554,
         117553,
         32911,
         157036,
         42158,
         61418,
         20096,
         26176,
         78406,
         45225,
         41240,
         46924,
         40506,
         38132,
         35810,
         60504,
         106038,
         116008
      ],
      "backdrop_path": "/vWhL1RFZrV7ejqGPjPuTYwPLkf9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jjaks Clayton",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a6e1",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Freddie Clayton",
               "gender": 1,
               "credit_id": "52fe450f9251416c7504a6e5",
               "name": "Cameron Diaz",
               "profile_path": "/ahFkUN9Sm8oF1txUHE5JcJ95Ere.jpg",
               "id": 6941,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sam Clayton",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a6e9",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Red",
               "gender": 2,
               "credit_id": "52fe450f9251416c7504a6ed",
               "name": "Delroy Lindo",
               "profile_path": "/uhjdTemc2kYbQj47bVqRb7OdVjH.jpg",
               "id": 18792,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Det. Ben Costikyan",
               "gender": 2,
               "credit_id": "52fe45109251416c7504a6f1",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Rhonda the Waitress",
               "gender": 1,
               "credit_id": "52fe45109251416c7504a6f5",
               "name": "Courtney Love",
               "profile_path": "/6AUeDL2aDErq4Kx33uIAP2KyHHi.jpg",
               "id": 7621,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Nora Clayton",
               "gender": 1,
               "credit_id": "52fe45109251416c7504a6f9",
               "name": "Tuesday Weld",
               "profile_path": "/wLVlljfTvppkfdQz9fNDizNpSuK.jpg",
               "id": 4514,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Young Sam Clayton",
               "gender": 2,
               "credit_id": "53256f439251411f8500740e",
               "name": "Aaron Michael Metchik",
               "profile_path": null,
               "id": 166565,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Young Jjaks Clayton",
               "gender": 0,
               "credit_id": "53256f689251411544001920",
               "name": "Drew Desmarais",
               "profile_path": null,
               "id": 1301279,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Joseph",
               "gender": 0,
               "credit_id": "53256f8692514114390018b7",
               "name": "Russell Konstans",
               "profile_path": null,
               "id": 1301280,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Bob, at Gas Station",
               "gender": 2,
               "credit_id": "593dd1d89251410593024c75",
               "name": "Jack Walsh",
               "profile_path": "/3zQboyL6xA1U6MIOGdaUhLTZjbi.jpg",
               "id": 1832086,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a6ff",
               "name": "Steven Baigelman",
               "profile_path": null,
               "id": 73838,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a705",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a70b",
               "name": "Michael Shamberg",
               "profile_path": "/tjqSWmFb0OCjnTwDISwR8Kl94af.jpg",
               "id": 5381,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45109251416c7504a711",
               "name": "Stacey Sher",
               "profile_path": "/fFvKIC38R9Q34VhTQ8BGfqorK8E.jpg",
               "id": 5382,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a717",
               "name": "Erwin Stoff",
               "profile_path": null,
               "id": 10950,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45109251416c7504a71d",
               "name": "Los Lobos",
               "profile_path": "/yzT9tyh0VrZiEISruh0L8b5Ts8x.jpg",
               "id": 53910,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a723",
               "name": "Walt Lloyd",
               "profile_path": "/7jVPvsnbqRvHRCn4SW3IV3Z3KOr.jpg",
               "id": 10418,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45109251416c7504a729",
               "name": "Kristen Helsing",
               "profile_path": null,
               "id": 73840,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a72f",
               "name": "Martin Walsh",
               "profile_path": "/eFdV5n5GV01fwNRzrJn299aFUsq.jpg",
               "id": 9154,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a735",
               "name": "Thom Noble",
               "profile_path": "/pl35WClWJFiuBao1dTMoV4PaxOj.jpg",
               "id": 17399,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45109251416c7504a73b",
               "name": "Steven Baigelman",
               "profile_path": null,
               "id": 73838,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.233658,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12656,
      "vote_count": 39,
      "budget": 0,
      "overview": "Sam Clayton's (Vincent D'Onofrio) marriage to ex-stripper Freddie (Cameron Diaz) comes about when she's strong-armed into the match by Red (Delroy Lindo), a club proprietor who once did her a favor. But Freddie falls in love with Jiaks (Keanu Reeves), Sam's brother, and the pair tries to escape the situation together. It isn't long before both Sam and Red catch up with them, resulting in threats against the two of them -- although tension also starts to build between Sam and Red.",
      "similar": [
         479,
         26390,
         979,
         445954,
         2142,
         9873,
         1266,
         4771,
         10651,
         11423,
         2749,
         7007,
         15069,
         9679,
         96,
         101,
         1572,
         75780,
         156022,
         281
      ],
      "original_title": "Feeling Minnesota",
      "runtime": 99,
      "poster_path": "/t7s9kxuSXnf3GwpK2dMzwv4Xcnn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jersey Films",
            "id": 216,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-13",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Just when she met the man of her dreams, along came her husband to ruin everything.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Baigelman"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Steven Baigelman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116289/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzOTk0ODgxNl5BMl5BanBnXkFtZTcwNzg5NDMyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Keanu Reeves, Vincent D'Onofrio, Cameron Diaz | See full cast and crew »"],
      "reviews": [
         "Most films starring Keanu Reeves or Cameron Diaz are a safe bet for a big Hollywood blockbuster. This one stars both, yet is a rather low-profile affair which many poeple won't have heard of. Ironically, Reeves gives one of the best performances of his career because he isn't asked to play a one-dimensional man of action. Diaz is eye-opening too, as a foul-mouthed girl trapped in a dead-end existence. The story tells of a young, aimless ex-con named Jacks Clayton (Reeves) who returns to the uninviting Minnesota town of his birth at the request of his mother (Tuesday Weld). She wants him there for the wedding of his elder brother Sam (Vincent D'Onofrio). However, when Jacks arrives he realises straight away that there's something rather fishy about the wedding. It turns out that Sam's bride Freddy (Diaz) has no desire to get married at all (she's only doing it because a nasty local gangster has bullied her into it). Before the wedding party is even over, Jacks has had sex with Freddy in the toilets; before the week is out, the pair have eloped intending to start over in Las Vegas. Suffice to say, Sam is pretty annoyed by what young Jacks has done.... Feeling Minnesota is a gritty, occasionally funny drama which benefits from its unfamiliar setting. Within its own admittedly twisted logic, the film's odd narrative works reasonably well. However, the characters are so amoral that it becomes hard to care what happens to any of them - including the supposed hero Jacks (who would make a fitting bad guy in most other pictures). The amount of coarse language is rather jarring too. You don't need to find swearing offensive to notice it, but if coarse language does bother you then it's safe to say that you'll be offended by the quantity of it in this film. The plot twists and turns in a very unpredictable manner, and makes for an interesting - if not entirely believable - experience.",
         "Watching this movie on running trait in all the characters stood out, their quirkiness. The strange slightly surreal and offbeat tone of the film was quite reminiscent of Tarantino's work. I loved this film, and thought the little laughs hidden in the film made me like it. I watched this with a couple of friends, they too liked it, but we each noticed and laughed at different things. I also loved the constant twists and turns and changes to the dynamic of the story. It starts out as Freddy paying back a debt but changes into an affair on the road, then finding some stashed money, hiding from the cops, then hiding a murder and so on. Oddly despite all of these twists and turns I never got lost but was glued to my screen figuring out who's with who and who's looking out for who. The fights between the two brothers, Sam (Vince D'Onofrio) and Jjax(Keanu Reeves) are some of the funniest things i have ever seen on screen. Reeves put in a good performance as a bumbling crook and D'Onofrio carries himself well as his childish brother. The ever angelic Diaz puts in a good show too. Lindo and Akroyd raised a few smiles too. Don't pay any attention to the bad reviews here. They were just people looking for a ho-hum romantic comedy when instead they got a witty dark comedy.(My kind of film) 3.75/5",
         "This film suffers from being a hybrid between the Coen brothers and Quentin Tarantino in part. It's not violent or ironic enough to be a Joel Coen creation and not obscenity-laden or gory enough to be a Tarantino product. There is humor, however, in the bumbling of Vinny D'Onofrio's character and in Reeve's typically understated role. You get the idea the real \"bad guy\" in the film is the neglectful, dope-smoking mother who allows the older brother to brutalize and bully the younger. It's topped off with more goofiness with Aykroyd's Krazy Kop and Delroy Lindo's Gangsta role (I particularly liked the red hair gimmick). I missed this one when it came out and rented the video because I found the name, Feeling Minnesota, remindful of the Coen Brother's Raising Arizona. I found it very watchable and rather liked the ridiculous situations very dysfunctional people get themselves into. The only glitch seemed to be Cameron Diaz who at times seemed unsure what her character was all about. Still, there is much in this film to recommend it. I would ignore the more negative reviews found here: I've no idea what these people were expecting or wanting. Check this movie out for yourself and you decide.",
         "This is a piece that almost everyone can identify themselves with,in one way or another.Everyone that has been hurt early on in his life,someway.And not given a chance to hit a better road. Keanu portrays a lost young man who has been mistreated in his childhood mostly by his brother,but also by his mother who decided to get rid of him while he was still a kid.Cameron Diaz is a tough girl with no future who gets caught up in trouble which ends up having to marry Keanu's brother,played excellently by Vince D'Onofrio.Whole establishment of the town is rotten.Specially the police officer played by Dan Aykroyd and a stripjoint shark played by Delroy Lindo.Keanu meets Cameron on his brother's wedding and love blossoms. Watching this movie is quite enjoyable and i easily fall for these stories,of paradise lost and love happening on the worst place possible.I dont know why,but i kind of felt like it was me on the screen,or a part of me playing the part of Jjaks.Iam sure many more felt the same. Whats so great with this film is that it makes us feel so many different emotions at the same time,and the moods change incredibly fast.First,everything is dark and then hope starts to come and we feel like Jjaks and Freddie might make it,before our hopes come crashing down again and in the end come true.Its the main accomplishment of this film.Creating so many intense and dramatic situations.Contrasts are strong here. This is one of Reeves' best roles in my opinion.Same goes for Cameron and D'Onofrio.Dont believe the poor reviews of this film.Watch it.",
         "I saw this movie on TV once...the last half hour or so. I enjoyed it very much so I bought the DVD. Its turned into one of my favorite films. I agree with the previous post about the quirky characters. Indeed that is what makes it lovable. I felt that the plot was good. I always like a story that is not common or at least has some twists in it. Black comedy it is, I never thought I would enjoy that genre but apparently I do. Its an entertaining movie, I highly suggest it for anyone that enjoys a twisty plot.... Wils",
         "Feeling Minnesota is not really a road movie, but that's still the best categorization I can generate. A road movie does not primarily depend on a great story line, and since the plot of this movie is truly pathetic, it does fulfil that description. To be interesting, such a movie must rely entirely on moving and intriguing characters, and on the chemistry between them. Unfortunately the staff of Feeling Minnesota fails utterly in producing this excitement. The initializing presentation of the characters is unsatisfying and confusing; I can, for example, not figure out whether Jjaks (Keanu Reeves) did grow up in the house of his mother and brother or not. It is said, by his mother (Tuesday Weld), that he must live with his father, but nothing in the film suggests that it ever happens. The same goes for the rest of the characters - I never get to know them. They appear irrational, and no real explanation is given to why they do so. The bottom line is that I leave the movie without any feelings for the characters, except dullness and perhaps a tiny kick of attraction for the cute Cameron Diaz.",
         "Steven Baigelman wrote and directed this uncertain comedy-drama concerning estranged brothers (Keanu Reeves and Vincent D'Onofrio) battling over embezzled cash as well as the affections of a pretty blonde (Cameron Diaz). The gritty ambiance inherent in Walt Lloyd's incredibly vivid cinematography is the most memorable aspect of the picture; capturing a blue-collar realism with such clarity, however, tends to emphasize the unreality of these dunderhead characters, and the movie's look and its story fail to cohere. Baigelman does get things off to a promising start, and he has an attentive eye for what to capture, but these petty people merit little interest. Danny DeVito was one of the many producers (all, presumably, with their own idea of how to film Baigelman's unremarkable script). *1/2 from ****",
         "J.J. Jameson (from Spiderman 2) Quote ... Crap, Crap, ... Mega-Crap It pretends to be an homage (un/intentional) to the Coen Brothers ... done poorly. There is no real mystery to the plot. Diaz's performance is totally uninspired. The quirky characters don't really work. There are a lot of \"duh\" moments. I love black comedy, but this film isn't funny. In my view, it wasn't worth the electricity. There are many films in this genre which are much more entertaining. I hope you find this review helpful.",
         "During a lifetime of seeing and enjoying thousands of films, Feeling Minnesota is absolutely the worst (**major film with A-list stars) that I have ever seen. Bar none. This movie totally fails on every level. It's poorly photographed and edited. There's uninspired acting, the kind where the actors appear bored out of their minds. Just collecting paychecks, perhaps? And worst of all, the sludgy script appears to have been written under the influence of some unpleasant substance found only in sewers. I can't even begin to comprehend how the writer/director could ever have found anyone to finance this project, let alone attract any of the stars that it did. I truly wish I could get back the time that I wasted watching this piece of garbage. If possible, I would have given this film a grade of zero. Better yet, a negative number.",
         "I first saw Feeling MInnesota on a Saturday morning. And if it didn't have Keanu Reeves and Cameron Diaz, I wouldn't have watched the whole thing. Reeves plays Jjaks, a man who lives his life on the road, because his mother threw him out when he was only 8. Jjaks has an older brother, Sam who works at a nightclub. The owner of the nightclub found that someone stole his money. He figure that it was Freddie, an ordinary woman played by Cameron Diaz. The nightclub owner is making Freddie pay off the money by marrying Sam. At the wedding, Freddie meets Jjaks and falls in love with him. They run off together and things turn into a disaster. If you enjoy movies with 2 men fighting over the same woman, then I would recommend Feeling Minnesota to you."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Fine Line Features",
         "Jersey Films",
         "Minnesota U.S.A."
      ],
      "summaries": [
         "Freddie is a former stripper marrying Sam to repay a debt owed to nightclub owner Red. But Freddie is in love with Jjaks, Sam's brother. Jjaks and Freddie run off together, and Sam finds where they have been hiding and calls the cops. Meanwhile someone calls to blackmail Sam and Jjaks. In the end will it all work out?",
         "An ex-convict and his bumbling crook brother fight for the same woman."
      ],
      "budget": 0
   },
   "movielensId": 697,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-13",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Steven Baigelman"],
      "runtime": 99,
      "movieId": 697,
      "title": "Feeling Minnesota",
      "mpaa": "R",
      "actors": [
         "Keanu Reeves",
         "Cameron Diaz",
         "Vincent D'Onofrio",
         "Delroy Lindo",
         "Dan Aykroyd",
         "Courtney Love",
         "Tuesday Weld",
         "Aaron Michael Metchik",
         "Drew Desmarais",
         "Russell Konstans",
         "Jack Walsh"
      ],
      "imdbMovieId": "0116289",
      "originalTitle": "Feeling Minnesota",
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["LoVRGgufV2w"],
      "plotSummary": "Sam Clayton's (Vincent D'Onofrio) marriage to ex-stripper Freddie (Cameron Diaz) comes about when she's strong-armed into the match by Red (Delroy Lindo), a club proprietor who once did her a favor. But Freddie falls in love with Jiaks (Keanu Reeves), Sam's brother, and the pair tries to escape the situation together. It isn't long before both Sam and Red catch up with them, resulting in threats against the two of them -- although tension also starts to build between Sam and Red.",
      "tmdbMovieId": 12656,
      "avgRating": 2.78775,
      "releaseYear": "1996",
      "numRatings": 1192,
      "posterPath": "/t7s9kxuSXnf3GwpK2dMzwv4Xcnn.jpg"
   }
}