{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0109593",
      "video": false,
      "title": "Delta of Venus",
      "recommendations": [],
      "backdrop_path": "/nnAu82OrkswP23jpO8loFCDcOGR.jpg",
      "revenue": 62949,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Elena Martin",
               "gender": 0,
               "credit_id": "52fe46e79251416c91063905",
               "name": "Audie England",
               "profile_path": "/wnZ2VRuSQH7eFWyd467bpE3lfT7.jpg",
               "id": 42325,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Lawrence Walters",
               "gender": 2,
               "credit_id": "52fe46e79251416c91063919",
               "name": "Costas Mandylor",
               "profile_path": "/5mk5ArXCnsDIq2BTj1XbVpjLhie.jpg",
               "id": 36055,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Donald",
               "gender": 0,
               "credit_id": "52fe46e79251416c91063909",
               "name": "Bernard Zette",
               "profile_path": null,
               "id": 1048569,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Marcel",
               "gender": 0,
               "credit_id": "52fe46e79251416c9106390d",
               "name": "Eric Da Silva",
               "profile_path": null,
               "id": 1048570,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Miguel",
               "gender": 2,
               "credit_id": "52fe46e79251416c91063911",
               "name": "Rory Campbell",
               "profile_path": "/enmnLoZYqmTljytZurxJ5973iHw.jpg",
               "id": 1048571,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Leila",
               "gender": 0,
               "credit_id": "52fe46e79251416c91063915",
               "name": "Raven Snow",
               "profile_path": null,
               "id": 1048572,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "The Clairvoyant",
               "gender": 2,
               "credit_id": "5976e1d69251414d1500373e",
               "name": "Adewale Akinnuoye-Agbaje",
               "profile_path": "/lnFcwjgNDNRzQ8yC1HPDIBRBwBh.jpg",
               "id": 31164,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46e79251416c910638f5",
               "name": "Zalman King",
               "profile_path": "/clzECAkYw1DKbAQTNoTBKjmpUZb.jpg",
               "id": 42113,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e79251416c910638fb",
               "name": "Elisa M Rothstein",
               "profile_path": null,
               "id": 1004726,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "5731c27992514112ab0023aa",
               "name": "Anaïs Nin",
               "profile_path": "/aKoyItQVNxoATBIValcLP162AfS.jpg",
               "id": 985119,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.843289,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38867,
      "vote_count": 6,
      "budget": 0,
      "overview": "A struggling American writer and a fellow American expatriate begin a sordid affair among the chaos and discord of 1940 Paris, France on the brink of World War II.",
      "similar": [
         28468,
         27066,
         283227,
         1259,
         16869,
         979,
         263472,
         1643,
         316021,
         20024,
         23949,
         9093,
         2253,
         2503,
         634,
         12162,
         1278,
         329103,
         381283,
         374720
      ],
      "original_title": "Delta of Venus",
      "runtime": 99,
      "poster_path": "/tV3GHas7BjqjNB6ta4SvL4TS6fv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Alliance Communications Corporation",
            "id": 2480,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Evzen Kolar Productions",
            "id": 26109,
            "origin_country": ""
         }
      ],
      "release_date": "1995-06-09",
      "vote_average": 3.4,
      "belongs_to_collection": null,
      "tagline": "In 1939, Elena went to Paris searching for her voice as a writer. What she found was her voice as a woman.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Zalman King"],
      "runtime": 102,
      "synopsis": "Delta of Venus is the sultry adventure of Elena Martin (Audie England), a young female American writer in Paris during the dawn of WWII. All of the stories Elena writes involves her as the star of her own erotic adventures which are secretly contracted by her lover, Lawrence Walters (Costas Mandylor) from a distance. Once this truth is revealed to Elena, her reaction is strong and she transforms from a sexually innocent and unfeeling girl, to a woman who feels everything. She rejects her lover as she leaves Paris to return to America once France is invaded.",
      "writers": [
         "Anaïs Nin",
         "Elisa M. Rothstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109593/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzNjg0MTI2MF5BMl5BanBnXkFtZTcwODM0OTYyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Audie England, Costas Mandylor, Eric Da Silva | See full cast and crew »"],
      "reviews": [
         "\"Delta of Venus\", director Zalman King's erotic adaptation of praised writer Anais Nin's book, is a lush, sexy, dramatic film. It's 1940 Paris and young aspiring writer Elena Martin begins a hot affair with smut author Lawrence. One night Elena catches Lawrence in the arms of another and leaves him, then she supports herself as a nude model and begins writing erotica for a wealthy male patron. But she can't write about it until she experiences it first. I highly recommend both the book \"Delta of Venus\" and the movie version as well. \"Delta of Venus\" is UNRATED for strong sexual sequences, graphic nudity, and for some language. NOTE: \"Delta of Venus\" is available in a slightly cut R Rated version that omits one minute of sexual footage, and an UNRATED version that restores the cut minute.",
         "I don't think you can pack more into a hour and a half movie, without it exploding. This film has politics, romance, sexual awakening, war, art, anti-semitism and lots of sexy gorgeous nude woman (especially, if you like red heads) in a wonderfully photographed \"epic\". The only thing wrong was that Audie England should have kept her mouth shut. Her face and body are sheer cinematic poetry, but she just did not seem to be able to say any words with any conviction. If you prefer your sex during the rise of fascism in a romance country, this film is a must have! Of course, you must see the un-rated version. The sex does really contribute to the plot. P.S. Don't waste your time on Titanic! This movie is light-years ahead of it.",
         "Okay, folks, let's take a test. what do you expect when you rent a movie with the name \"Zalman King\" on the box? Anywhere on the box? You expect soft-core porn with pretentions of greatness and lensed in a slow-moving style, color-saturated, and all with Playboy-flair. This one delivers. Not only is it packed with wall to wall sex, but the lead actress, Audie England, is a good actress in serious need of better material. The setting is inspired and if you go in not expecting too much, you'll get your fill.",
         "One of the best films I have recently seen. The main heroes pass through a lot of temptations, agonizing situations and still the magnitude of their love stays above all. The director uses a lot of shocking scenes to describe the passion they felt for each other in the best way. It's the antithesis of this passion and the dramatic way war alienates people from each other that makes this film excellent,the quickly alternating emotions and the performance of the main actors in showing these emotions making it one of the kind.",
         "Delta of Venus, a collection of short stories by Anias Nin, was one of the first popular works in female erotica. The film is loosely based on the story behind the collection. It fails in trying to incorporate other stories from the collection. The film doesn't fail to be interesting, however. It may drag in the middle, and the dialogue may be a little on the obnoxious side, but it succeeds in being one of the most erotic films I've seen to date. The actors/actresses are simply gorgeous, and the sex scenes are among the hottest and most tasteful. If you're a fan of erotica in general, I suggest you check this one out. If you're looking for a good transition from literature to film, however; you may be looking in the wrong place.",
         "Some of the plot elements of this film were vaguely familiar to me, and I don't know if it is from reading \"Delta of Venus\" lo, those many years ago, or maybe from \"Henry and June\" the film about Nin and Henry Miller, from 10 years ago or so. Anyway, this is an exceptional film for its genre, with good acting, direction, and pretty decent other assorted production values. I had never seen or heard of Audie England, and her beauty just floored me. Wow! Anyway, if you can at all tolerate soft-core erotica, this film is recommended. Grade: B+",
         "I thought this was one of the best erotic films I've seen. The cinematography was wonderful and really caught the mood of WWII Paris. I was deeply involved in the story not just witnessing it. The trouble with most films that center around sex is that that is all there is. I found that the emotions surrounding the characters just made the love scenes that much more real and intense. It is a drama, though. Touching and deep.",
         "This film has everything...beautiful lovemaking, a redhead, and the opium dens of Paris. It's a slow moving plot that's intended to exhibit a series of different fantasy scenarios lived out by the main character, as she writes them down into a private collection for an anonymous client, with some good plot twisting towards the end. The cinematography, costuming and makeup are exquisite, making this film pure eye candy. Enjoy.",
         "I found this movie to be one of Zalman King's best! I haven't seen a Zalman King movie I haven't liked, but I'd definitely have to say that, so far, this one takes the cake! I've read the book...the anthology of short stories from which King melded and formed the single story that was to become \"Delta of Venus\" the movie. He did an absolutely wonderful job! Set in Paris during a turbulent time, decadence was at one of it's finest points. We have Audie Englund, beautiful and charming and shy all at once. Her character is a writer at a time when women writers were starting to be more open and who were keeping their own names. She wants to write, and indeed NEEDS to write for money. She feels she is passionate and only when her lover is \"away\" does she begin to learn what passion is and how to write about it. Her \"employer\" whom she never meets, only writes for, makes demands on her writing. She is to go farther and farther into the world of erotica. She is told to go beyond the idea of \"love\" and romance, but to strive for decadence and the bizarre. She goes to the very edges of sexuality to write the perfect erotic story to please the person paying her bills. And it is while she is on the edge of decadence that she discovers her own sexuality and how far she can go herself towards pleasure and testing the limits. The whole movie is beautiful from beginning to end. It is always erotic and never tasteless or meaningless. It offers insight into a time when open sexuality was beginning to flourish again. It shows us a world where sexuality was encouraged, not frowned upon. I was on the edge of my seat the whole time, yearning to feel what the characters did. Yearning to have the feelings that the characters did. In a society as prudish as this one, it is but a dream to think that I could ever live in a world as portrayed in this movie. The actors and actresses all played their parts well and with a passion and dedication that makes you believe that they are indeed the people they are pretending to be. I never once said, \"Oh, Julia Roberts could have done a better job\" or \"Leonardo di Caprio is much sexier than him.\" On the contrary, these other actors would have made the movie seem to be a movie rather than a snippet of real life with real people. Don't get me wrong; the two I mentioned are very accomplished actors. But you know when they are acting, and in many other of their movies, you could say that they are \"real\" in the parts they play as I've said about the ones in \"Delta of Venus\"...but Zalman King could not have picked a finer cast for these characters. If and when my own erotic stories get published, should the desire for them to be made into movies ever arise, then I only hope that it will be Zalman King behind the camera. I only hope that what I've written will be turned into a wonderful movie that only the magic of this director can create.",
         "Although certainly not the greatest movie ever made, Delta of Venus manages to convince with it's Parisian setting and a feeling of revelry in the face of stark reality. Audie England is rather fetching as the ingenue American writer becoming embroiled in the Parisian milieu of sex, drugs and personal drama, played with almost frantic intensity before the creeping tide of Nazism. Based on the writings of Anais Nin, Delta of Venus contains some extremely erotic scenes and is well worth a look."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Alliance Communications Corporation",
         "Evzen Kolar Productions",
         "New Line Cinema"
      ],
      "summaries": [
         "An American writer in Paris starts writing erotic fiction. From encouragement from her friends, her lover, and her publisher she gets involved in nude modeling and progresses onward through many other forms of voyeuristic and participatory sexual adventures. Contains full frontal nudity and simulated sex, lots of sexual dialogue and profanity.",
         "A struggling American writer (England) and a fellow American expatriate (Mandylor) begin a sordid affair among the chaos and discord of 1940 Paris, France on the brink of World War II."
      ],
      "budget": 0
   },
   "movielensId": 698,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-06-09",
      "dvdReleaseDate": "2003-11-04",
      "directors": ["Zalman King"],
      "runtime": 99,
      "movieId": 698,
      "title": "Delta of Venus",
      "mpaa": "NC-17",
      "actors": [
         "Audie England",
         "Costas Mandylor",
         "Bernard Zette",
         "Eric Da Silva",
         "Rory Campbell",
         "Raven Snow",
         "Adewale Akinnuoye-Agbaje"
      ],
      "imdbMovieId": "0109593",
      "originalTitle": "Delta of Venus",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "n1haG6CTEgo",
         "Gg9c-WnK6sM"
      ],
      "plotSummary": "A struggling American writer and a fellow American expatriate begin a sordid affair among the chaos and discord of 1940 Paris, France on the brink of World War II.",
      "tmdbMovieId": 38867,
      "avgRating": 2.83125,
      "releaseYear": "1995",
      "numRatings": 160,
      "posterPath": "/tV3GHas7BjqjNB6ta4SvL4TS6fv.jpg"
   }
}