{
   "tmdb": {
      "original_language": "nl",
      "keywords": [{
         "name": "industrial revolution",
         "id": 7025
      }],
      "imdb_id": "tt0104046",
      "video": false,
      "title": "Priest Daens",
      "recommendations": [
         13646,
         35016,
         22034,
         6511,
         40071,
         24860,
         333,
         80469,
         214139,
         94532,
         56835,
         63784,
         145464,
         44417,
         202573,
         15669,
         29602,
         19398,
         83278,
         43938
      ],
      "backdrop_path": "/xNtTxpuvHEOGodNS9wpquaJwJe5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Adolf Daens",
               "gender": 2,
               "credit_id": "52fe4677c3a36847f81008fd",
               "name": "Jan Decleir",
               "profile_path": "/BXOa9XkagvzafGgdmq0kshR0uG.jpg",
               "id": 13514,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Charles Woeste",
               "gender": 0,
               "credit_id": "52fe4677c3a36847f8100909",
               "name": "Gérard Desarthe",
               "profile_path": "/iIgkWA1jsMGWUvQw7Oortu9qT6v.jpg",
               "id": 23565,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nette Scholliers",
               "gender": 0,
               "credit_id": "52fe4677c3a36847f8100901",
               "name": "Antje De Boeck",
               "profile_path": "/k2OOlGF4bS8ojgDLneQQJh1F4WT.jpg",
               "id": 140492,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jan De Meeter",
               "gender": 2,
               "credit_id": "52fe4677c3a36847f810090d",
               "name": "Michael Pas",
               "profile_path": "/tSzIvBM6JVfPGpHDO9iVApirETd.jpg",
               "id": 140493,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jefke",
               "gender": 0,
               "credit_id": "52fe4677c3a36847f8100911",
               "name": "Karel Baetens",
               "profile_path": null,
               "id": 140494,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Bisschop Stillemans",
               "gender": 0,
               "credit_id": "52fe4677c3a36847f8100915",
               "name": "Julien Schoenaerts",
               "profile_path": "/7tD7epnGU0HSfvw5WTgXhpHd3Be.jpg",
               "id": 140495,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Pieter Daens",
               "gender": 0,
               "credit_id": "52fe4677c3a36847f8100919",
               "name": "Wim Meuwissen",
               "profile_path": null,
               "id": 140496,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Louise Daens",
               "gender": 0,
               "credit_id": "567bb9acc3a3684be90021d8",
               "name": "Brit Alen",
               "profile_path": null,
               "id": 1521229,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Schmitt",
               "gender": 2,
               "credit_id": "567bb9d2c3a3684bd00021c2",
               "name": "Johan Leysen",
               "profile_path": "/cjLEEzFfEGoEEpHnNxjfso04Dd0.jpg",
               "id": 53904,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Elizabeth Borremans",
               "gender": 1,
               "credit_id": "567bba73c3a3684bdc002446",
               "name": "Linda van Dyck",
               "profile_path": "/yQ6GCzujEbLjSPbTSn3sHfisFbK.jpg",
               "id": 114385,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Eugene Borremans",
               "gender": 0,
               "credit_id": "567bbac2c3a3684be30023dc",
               "name": "Idwig Stephane",
               "profile_path": null,
               "id": 38453,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Ponnet",
               "gender": 2,
               "credit_id": "567bbb16c3a3684bcc0025e7",
               "name": "Jappe Claes",
               "profile_path": "/mCaA1RTvoXFRisiUgMYdBfVxwLZ.jpg",
               "id": 553352,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Marie",
               "gender": 0,
               "credit_id": "567bbb669251417def0024c6",
               "name": "Brenda Bertin",
               "profile_path": null,
               "id": 1553142,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Monsignor Goossens",
               "gender": 0,
               "credit_id": "567bbc099251417dda00242b",
               "name": "Alex Wilequet",
               "profile_path": "/nzeoVTF9hwKwIFVSKqv9xoUVQ7O.jpg",
               "id": 237840,
               "order": 13
            },
            {
               "cast_id": 10,
               "character": "Burgemeester Van Wambeke",
               "gender": 0,
               "credit_id": "52fe4677c3a36847f810091d",
               "name": "Fred Van Kuyk",
               "profile_path": "/q5VuVzlUG4Jw1iEa5aPic26MBK9.jpg",
               "id": 133913,
               "order": 14
            },
            {
               "cast_id": 4,
               "character": "Van Langenhove (Liberaal)",
               "gender": 2,
               "credit_id": "52fe4677c3a36847f8100905",
               "name": "Herbert Flack",
               "profile_path": "/jIOPfpEGxfHMqZUxROcSrKAc1Qx.jpg",
               "id": 113590,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Nuncio",
               "gender": 0,
               "credit_id": "567bbef09251417de5002527",
               "name": "Rik Hancké",
               "profile_path": null,
               "id": 1553143,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Wannes Scholliers",
               "gender": 2,
               "credit_id": "57cbd86e92514141db001e93",
               "name": "Matthias Schoenaerts",
               "profile_path": "/ts1OM0hD0n5E9CellezLQNO5ziq.jpg",
               "id": 73381,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4677c3a36847f81008f9",
               "name": "Stijn Coninx",
               "profile_path": null,
               "id": 81964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5909af2b9251411ce400bf22",
               "name": "Louis Paul Boon",
               "profile_path": null,
               "id": 1284527,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5909af389251411ce400bf28",
               "name": "François Chevallier",
               "profile_path": null,
               "id": 31816,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5909af43c3a36835ee00c1d9",
               "name": "Stijn Coninx",
               "profile_path": null,
               "id": 81964,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5909af4ec3a36835fc00aede",
               "name": "Addy Weijers",
               "profile_path": null,
               "id": 1260473,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.478404,
      "production_countries": [{
         "iso_3166_1": "BE",
         "name": "Belgium"
      }],
      "id": 44103,
      "vote_count": 17,
      "budget": 0,
      "overview": "In the 1890s, Father Adolf Daens goes to Aalst, a textile town where child labor is rife, pay and working conditions are horrible, the poor have no vote, and the Catholic church backs the petite bourgeoisie in oppressing workers. He writes a few columns for the Catholic paper, and soon workers are listening and the powerful are in an uproar. He's expelled from the Catholic party, so he starts the Christian Democrats and is elected to Parliament. After Rome disciplines him, he must choose between two callings, as priest and as champion of workers. In subplots, a courageous young woman falls in love with a socialist and survives a shop foreman's rape; children die; prelates play billiards.",
      "similar": [
         3082,
         51980,
         8953,
         116369,
         515374
      ],
      "original_title": "Daens",
      "runtime": 138,
      "poster_path": "/4fS6fxlj8drUKI17eBsDIm9mfF8.jpg",
      "spoken_languages": [
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Favorite Films",
         "id": 4655,
         "origin_country": ""
      }],
      "release_date": "1992-09-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stijn Coninx"],
      "runtime": 138,
      "synopsis": null,
      "writers": [
         "Louis Paul Boon",
         "François Chevallier"
      ],
      "originalLanguage": "Flemish",
      "imdbLink": "http://www.imdb.com/title/tt0104046/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxNTgzOTE1OV5BMl5BanBnXkFtZTcwNDI3MzIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jan Decleir, Gérard Desarthe, Antje de Boeck | See full cast and crew »"],
      "reviews": [
         "I am writing this review during the Papal interregnum following the death of Pope John Paul II. Most appropriate. There is intense speculation about whether the Catholic Church needs a Third World pope to better represent the needs of the impoverished masses who inhabit areas of the world where the faith is still growing. The Church in Europe has been in long-term decline and Catholic priests today face similar choices and dilemmas to those faced by Daens a century ago. The film 'Daens' portrays the struggle of a courageous man to spread the gospel of Christ to impoverished and exploited textile workers in late 19th Century Belgium. His main enemies are the 'Godless' socialists who offer his flock a more earthly paradise and also his own Church hierarchy who stand fast with the capitalist class in opposing all attempts at social reform. Daens follows the dictates of conscience, founds his own Catholic People's Party and becomes a charismatic leader of the Flemish-speaking poor whose interests are largely ignored by the French-speaking Christian Democrats. This official Church-backed Catholic Party is dominated by capitalists who see religion as a means of social control and property-protection. The scene is set for conflicts of conscience, class and language. How should the Church respond to the new evils of capitalism? Daens, of course, is only trying to follow the spirit of the Holy Father's encyclical 'Rerum Novarum' (1891) which endorsed state regulation to curb the worst abuses of industrialism. Complaints from the Belgian hierarchy result in Daens being summoned to Rome to explain himself. He never gets to meet the Pope and is eventually excommunicated for his disobedience to his local hierarchy. Echoes here of 'Liberation theology' and Pope John Paul II publicly rebuking a Sandinista priest in Nicaragua for his political activities. Echoes also of Martin Luther's stand against different abuses 400 years earlier. There is a great deal going on in this film and its subject matter is difficult and obscure. Nevertheless 'Daens' successfully portrays the man and his milieu in an entertaining way. The film held my interest throughout and it spurred me to research the topic further. Its depiction of living and working conditions is exemplary and the industrial accident scene is harrowing. The subplot focusing on a working girl's attraction to both the Church and to a young socialist radical encapsulates the wider struggle being played out on the political stage. The inferior position of Flemish in Belgian society at that time is shown by the mainly Flemish dialogue used between Daens and his flock and the mainly French dialogue used between Daens and his Church and social superiors and within the Belgian parliament. The parliamentary Commission of Enquiry into working conditions is unable to question the Aalst workers properly because of this language barrier. Sexual harassment of women in the workplace which used to be so commonplace is shown by a particularly strong rape scene.The fact that the perpetrator is a factory foreman underlines both 'capitalist lackey' and 'corruption of power' themes. The film gives some insight into the tremendous hostility which developed between the European Left and the Catholic Church from the French Revolution onwards. The Church under the recently sanctified Pius IX (1846-1878) turned its back on everything modern. The Left turned its back on a Christian religion whose main institution resisted all the new ideas thrown up by tremendous social change. These are the big themes against which the Daens drama is acted out. And acted out well it certainly is. Jan Decleir gives a powerful performance as the eponymous hero. The reverence of simple Catholic workers for their Church, their suspicion of socialism but desire for better conditions together provide the springboard for the short-lived Daens success story. This complex social dynamic is beautifully depicted in intimate scenes in which individual relationships are used to explain the wider picture. The film is always in danger of collapsing under the weight of the historical events it depicts. This never quite happens and it is hard to envisage a better screenplay for a film of this length and difficulty of subject. The Daens theme is with us still. Archbishop Romero was killed by right-wing gunmen for supporting the poor. The Catholic archbishop of Recife in Brazil famously said, \"When I say, 'Feed the poor' they call me a saint. When I ask, 'Why are they poor?' they call me a Communist.\" Having consigned Communism to the dustbin of History (at least temporarily?), Pope John Paul II spent his last years railing against capitalist materialism and economic inequality. In my opinion, Catholics will only solve this dilemma when they are able to reconcile Scripture with the Enlightenment and absorb Marxist and other secularist critiques of global capitalism into their faith. Unfortunately their Church over the last two centuries has usually backed the powerful against the weak, the rich against the poor. Daens is an example of thousands of individual Catholics world-wide who have taken simple Christian teachings at their face value to follow their own conscience. Equally, there is no compelling reason for the Left to maintain its historic antipathy towards religion. Christianity and Socialism are natural bedfellows. For a non-Belgian audience with a poor knowledge of history 'Daens' could be a difficult film to enjoy. I hope that this review will help more people to access it and understand the powerful light it throws on much wider religious and political issues. A Daens website in Belgium shows that this man still has his local fans but it would be too much to expect the Church to lift its ban of excommunication, let alone consider him as a candidate for beatification. The Church has recently apologised for the way it treated Galileo, so who knows? That is entirely a matter for the Church but I would urge anyone interested in religion, history and politics to watch this film. I eagerly await its DVD format.",
         "This is considered as undoubtedly the most important Belgian film ever made, a cinematic event in its home country when it came out. People flocked to see it, awards were bestowed on it, students wrote term papers about it, everybody talked about it, every school showed it to its students (and they still do, more than ten years later), and its director, Stijn Coninx, even got made a baron on the strength of it. Even so, Coninx was never really able to live down the reputation of \"director of Daens\". In a country with basically no film tradition to speak of, a movie like Daens is a once-in-a-lifetime achievement, if only because they'll never allow you to spend that much money again, even if it did earn it back. One cannot help but feel that had he made the equivalent of this one in America, he'd be one the biggest directors around today. The story is about a courageous, socially feeling priest who went against church authorities and the political powers that be (heavily interlinked at the end of the 19th century) to help the impoverished workers of Aalst, Belgium. Although romanticised somewhat, and even with the addition of certain characters to strengthen the dramatic arc of the movie, this is based on a true story. Coninx did absolutely amazing things with a limited budget to bring the era back to life, and his camera lingers tellingly in the dirty, narrow little streets where the workers were packed together, entire families with hordes of children living in one room. We also get to see the factories, dangerous places, where people spend twelve or more hours a day for scraps off the tables of the wealthy factory owners. All of this is brought to life in a completely convincing way, immersing you in the period. Coninx' control as a director here is remarkable. Without any real money (certainly by US standards), he manages to pull off a story of epic scope that looks and feels exactly as it should. Consider a scene set in the palace of the king, where an opulent dinner is going on, served by black people brought over from what was then Belgian Congo. \"Are they dangerous?,\" one of the women asks. Lesser directors might have hammered the point home by going on about it, but Coninx doesn't. He lets this one simple line stand, lets it speak for itself and moves on. This way, he's able to pack in a surprising amount of stuff in the 135 minutes running time, and it doesn't feel rushed or hurried, but on the other hand, very natural. Visually too, this scene is as striking as any, showcasing the luxury of the wealthy as opposed to the squalor of the poor. And again Coninx doesn't make a point of it, he doesn't give in to the temptation of making self-conscious cuts or moving the camera that way. He just lets it be, keeps things simple. Jan Decleir gives a powerful performance as Adolf Daens, who comes off as a brilliant orator, an almost saintly figure who heeds no warnings and goes on in the face of public humiliation, ex-communication and even physical violence. This is probably a simplification of the truth (it's hard to believe anyone is THAT perfect), but the power Decleir brings to the role makes it work. There are some minor problems, however. The screenwriters and directors seem to have a somewhat naive belief in the socialist party of the time, as a well-meaning boys' club that basically says the same things Daens says throughout the movie. And there are some scenes that feel phony, such as an unbelievably corny moment in a field, when one the characters rides along on a bike, yelling extacically that Daens has just been elected to parliament. Cut to a shot of an old man falling to his knees with pure joy, as the triumphant music swells. Sorry, but that's just a bit too much. All in all this is a movie deserving of its status as classic in Belgium, and very much worth seeing where ever you're from. Back here, we've been beaten over the head with this movie so many times that a lot of people must almost know it by heart, but then that's not the movies fault.",
         "Jan Decleir stars as the real-life populist preacher Father Daens, who helped textile workers in Europe struggle for justice in the late 19th century. This is a very moving and powerful film which squarely takes on many problems which our modern industrial societies have inherited from the Industrial Revolution. Especially heartbreaking and infuriating are the scenes which juxtapose young factory children being overworked, abused and mangled by the textile machines with rich and powerful nobles around their sumptuous dinner tables. The emotional high point of the film, for me, came when Daens gives an impromptu speech in a church, shouting out, \"People scream, 'we are hungry!' Loud and clear!\" It is difficult not to be emotionally caught by such a scene. Father Daens ultimately shows in this film what Gandhi told someone: that one's religion is in one's actions, not in one's words, clothes or wealth.",
         "This is definitely the best movie ever made by a Belgian director, Stijn Coninx. Nominated for best foreign movie but alas no Oscar. During the film you will see children working on weaving machines. Children had their hands cut and young girls were brutalized or raped. Some died. This is no fiction. Coninx had to go to Poland to film where he found the exact machines still in use there which where employed 50 or 100 years ago in Belgium; on this point I'm not sure. While filming in Poland, children were still abused in long working hours,(1992)and begging for food from the crew. In comparison to Schindler's list I gave Daens 9 points versus 1 for Schindler. I saw this movie at least 7 times. To tell you the truth I dragged all my friends to see this movie on full screen. They were all in awe, nobody complained, on each occasion we needed a brandy to recuperate :-) This is the first movie I saw men weep.",
         "This is the best Belgian film I've ever seen. And since I am Belgian, I've seen a lot of them. Antje De Boeck is such a wonderful actress and Jan Declair is absolutely our best actor. You could recently see him in \"De zaak Alzheimer\" as Ledda. The story is as realistic as possible, but luckily there is that little romance to bring happiness in the rather depressing story. To understand the full beauty of the movie you should have to understand Dutch, or even both French and Dutch (as most Flemish people do (=inhabitants of the northern half of Belgium)), because even the accents have been adapted to the right time span. Just a note to the Flemish: (Ik zal het in het Engels moeten doen, want deze site accepteert niet veel in het Nederlands) If you haven't seen this movie yet, you should do it right away! You can learn more from it than from all history classes at school! Because in my opinion, history is still about people, not about facts.",
         "\"Daens\" is a film about a priest, Adolf Daens, in Flanders in the 19th century. He feels pity for the workers, the terrible conditions they have to work and live in. The work they do in the factories is dangerous and their salaries low. Daens tries to help the workers but the mighty director of the factory and the church officials try to stop him. With an alliance of socialists, liberals and Roman catholics, Daens succeeds in becoming elected for the Belgian parliament. He continues his fight against the injustice in Flanders but the pressure on him accumulates...",
         "The priest Daens (Jan Decleir) and his political master Charles Woeste (Gérard Desarthe) are opposing each other in this historical movie. Daens is a strong priest, convinced of his rightfulness to protect the workers. In the movie everything is worked out in detail and you can easily identify with the characters. The music is not so good and a little bit soft but the dramatic script keeps our attention until the end.",
         "Socialism and the social-democracy originate from Europe, where the industrial revolution began. It became the ideology of the workers, who were cruelly exploited and suppressed by the capitalists. The social problem created political controversies. It all started with the textile production, which was concentrated in England and Belgium. In the beginning the new capitalist system was pretty disgusting. Often the situation of the industrial workers worsened in comparison with the preceding feudalism. The film Daens narrates this not very nice episode of our history for the Belgian case. At the time Belgium was still under the influence of the catholic church. The Pope had proclaimed the encyclical letter Rerum Novarum, which stressed the rights of the workers. However, the capitalists were not impressed. And since eventually the church follows the money (for someone has to pay the bills), there was little real improvement for the workers. Daens is a priest, who sides with them. The capitalists don't like this, and exert pressure on the church. Spoiler! Daens is expelled from priesthood, and continues as a politician. Fortunately decency still exists. The film is based on a book by Louis Paul Boon (Opus magnum: De kapellekensbaan). Boon has a surrealistic and dejected style of writing, which focuses on the human shortcomings. This is noticeable in the film plot, so prepare yourself for some degenerate behavior, rapes, children freezing to death or being crushed by weaving-looms etcetera. However Boon never creates a sensation, and mentions these disasters more or less in passing (which makes it so surrealistic). In fact the heroic Daens is a bit atypical, and may be a deviation from Boons book (which I have not read). If you believe that the history of capitalism is a success story, than this film will surprise you. If you like persiflages, this film will please you. If you are interested in history, this film will educate you. What more can I say? By the way, you will find many similar films in my list of reviews. Take for instance \"Subterra\", or more timely \"Norma Rae\". There may well be many recent South-American films about the same theme. If so, tell me. Oh, and don't forget to check off the \"useful: yes\" ballot. I love comments.",
         "This is an excellent movie that has very believable characters. The mixture of French, Flemmish/Dutch, and Latin make this a very interesting movie. The cinematography is also wonderful. Like many movies where French is spoken there is a sad undertone. In many ways it reminds me of Jean de Floret, another wonderful epic. Americans who like foreign films should watch this movie. I hope you like it!",
         "Beautiful depiction of the workers' fate during the first half of the 20th century. Priests and church are supposed to play their role of keeping the workers at peace. When father Daens resists he gains such a response that the powers have to bend. True story! Went up for an Oscar but due to the fact that the French had a lot more money to support their film it fell short. Brilliant role for Jan Decleir, mostly known for his one-man plays, adaptations of Dario Fo. Proof you do not need violence or sex to make a movie exciting. What is needed is a strong story (very much so in this case) and a couple of great actors. If you have the chance to watch it, do so, it will alter your view on the world, there are not enough (nice) movies of this kind around. Again: it all happened as it is depicted here."
      ],
      "genres": [
         "Biography",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Dérives Productions",
         "Favourite Films",
         "Shooting Star Filmcompany BV"
      ],
      "summaries": ["In the 1890s, Father Adolf Daens goes to Aalst, a textile town where child labor is rife, pay and working conditions are horrible, the poor have no vote, and the Catholic church backs the petite bourgeoisie in oppressing workers. He writes a few columns for the Catholic paper, and soon workers are listening and the powerful are in an uproar. He's expelled from the Catholic party, so he starts the Christian Democrats and is elected to Parliament. After Rome disciplines him, he must choose between two callings, as priest and as champion of workers. In subplots, a courageous young woman falls in love with a socialist and survives a shop foreman's rape; children die; prelates play billiards."],
      "budget": 0
   },
   "movielensId": 701,
   "movielens": {
      "languages": [
         "Nederlands",
         "Français",
         "Latin",
         "Español"
      ],
      "releaseDate": "1992-09-01",
      "dvdReleaseDate": null,
      "directors": ["Stijn Coninx"],
      "runtime": 138,
      "movieId": 701,
      "title": "Priest Daens",
      "mpaa": "",
      "actors": [
         "Jan Decleir",
         "Gérard Desarthe",
         "Antje De Boeck",
         "Michael Pas",
         "Karel Baetens",
         "Julien Schoenaerts",
         "Wim Meuwissen",
         "Brit Alen",
         "Johan Leysen",
         "Linda van Dyck",
         "Idwig Stephane",
         "Jappe Claes",
         "Brenda Bertin",
         "Alex Wilequet",
         "Fred Van Kuyk",
         "Herbert Flack",
         "Rik Hancké",
         "Matthias Schoenaerts"
      ],
      "imdbMovieId": "0104046",
      "originalTitle": "Daens",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In the 1890s, Father Adolf Daens goes to Aalst, a textile town where child labor is rife, pay and working conditions are horrible, the poor have no vote, and the Catholic church backs the petite bourgeoisie in oppressing workers. He writes a few columns for the Catholic paper, and soon workers are listening and the powerful are in an uproar. He's expelled from the Catholic party, so he starts the Christian Democrats and is elected to Parliament. After Rome disciplines him, he must choose between two callings, as priest and as champion of workers. In subplots, a courageous young woman falls in love with a socialist and survives a shop foreman's rape; children die; prelates play billiards.",
      "tmdbMovieId": 44103,
      "avgRating": 3.19643,
      "releaseYear": "1992",
      "numRatings": 112,
      "posterPath": "/4fS6fxlj8drUKI17eBsDIm9mfF8.jpg"
   }
}