{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "marriage crisis",
            "id": 5809
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "divorce",
            "id": 15160
         }
      ],
      "imdb_id": "tt0062952",
      "video": false,
      "title": "Faces",
      "recommendations": [
         33665,
         15484,
         43878,
         52105,
         27030,
         34181,
         32040,
         2748,
         29845,
         97513,
         125602,
         44065,
         26782,
         946,
         45218,
         216,
         43904,
         8074,
         27019,
         36226
      ],
      "backdrop_path": "/tRM28E53dEBxBMPCx7RykDab5wx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeannie Rapp",
               "gender": 1,
               "credit_id": "52fe4271c3a36847f801f031",
               "name": "Gena Rowlands",
               "profile_path": "/kRHNvkcJlwBr1Xb9XREiZob29NX.jpg",
               "id": 4800,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Richard Forst",
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f035",
               "name": "John Marley",
               "profile_path": "/8XhyUzSWIhcHQSBURSCjydRe2Fx.jpg",
               "id": 3142,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maria Forst",
               "gender": 1,
               "credit_id": "52fe4271c3a36847f801f039",
               "name": "Lynn Carlin",
               "profile_path": "/5MefaWZKNlBN5wKg7BPdDQua6JK.jpg",
               "id": 11140,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Chet",
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f03d",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Freddie Draper",
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f041",
               "name": "Fred Draper",
               "profile_path": null,
               "id": 11141,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jim McCarthy",
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f045",
               "name": "Val Avery",
               "profile_path": "/jIBEZ5xoM7I5PxG3pW62VeWwYih.jpg",
               "id": 3014,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Florence",
               "gender": 1,
               "credit_id": "52fe4271c3a36847f801f049",
               "name": "Dorothy Gulliver",
               "profile_path": "/up7NF9BpRm3BRbs6SlTnhe1wOpB.jpg",
               "id": 11142,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Louise Draper",
               "gender": 0,
               "credit_id": "52fe4271c3a36847f801f04d",
               "name": "Joanne Moore Jordan",
               "profile_path": null,
               "id": 11143,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Billy Mae",
               "gender": 1,
               "credit_id": "52fe4271c3a36847f801f051",
               "name": "Darlene Conley",
               "profile_path": null,
               "id": 11144,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Joe Jackson",
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f055",
               "name": "Gene Darfler",
               "profile_path": null,
               "id": 11145,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Stella",
               "gender": 1,
               "credit_id": "52fe4271c3a36847f801f059",
               "name": "Elizabeth Deering",
               "profile_path": null,
               "id": 11146,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Barmaid",
               "gender": 1,
               "credit_id": "589e7b46c3a3684bb7004569",
               "name": "Laurie Mock",
               "profile_path": "/v9Hx223A6gBd6wGGHnaeyLrhSPZ.jpg",
               "id": 179149,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f05f",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f065",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f06b",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f071",
               "name": "Maurice McEndree",
               "profile_path": null,
               "id": 11414,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f077",
               "name": "Al Ruban",
               "profile_path": null,
               "id": 11415,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4271c3a36847f801f07d",
               "name": "Jack Ackerman",
               "profile_path": null,
               "id": 11416,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f083",
               "name": "Al Ruban",
               "profile_path": null,
               "id": 11415,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f089",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4271c3a36847f801f095",
               "name": "Maurice McEndree",
               "profile_path": null,
               "id": 11414,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56792c77c3a36847470023dd",
               "name": "Phedon Papamichael",
               "profile_path": null,
               "id": 1552352,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56805cb4c3a3684be300e732",
               "name": "Haskell Wexler",
               "profile_path": "/k3JSEg2tildKuFl6F6T1gLQSwgf.jpg",
               "id": 7067,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.419885,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 753,
      "vote_count": 47,
      "budget": 275000,
      "overview": "An old married man leaves his wife for a younger woman. Shortly after, his ex-wife also begins a relationship with a younger partner.",
      "similar": [
         32868,
         1259,
         1628,
         24420,
         27066,
         22152,
         258,
         4148,
         979,
         1903,
         38,
         28468,
         36630,
         696,
         1643,
         316021,
         283227,
         4507,
         44564,
         1024
      ],
      "original_title": "Faces",
      "runtime": 130,
      "poster_path": "/ufORkC9NfixbUxqQXI2VcNVKRZi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Maurice McEndree Productions",
            "id": 452,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Walter Reade Organization Inc.",
            "id": 453,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Faces International Films",
            "id": 454,
            "origin_country": ""
         }
      ],
      "release_date": "1968-11-24",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["John Cassavetes"],
      "runtime": 130,
      "synopsis": null,
      "writers": ["John Cassavetes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062952/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1OTA1MjAwM15BMl5BanBnXkFtZTcwNzI5MTkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: John Marley, Gena Rowlands, Lynn Carlin | See full cast and crew »"],
      "reviews": [
         "Faces is one of the first American films to reach to the >core of people's relationships. It provides wonderful insight into a lifestyle that is distinctly American. The detached way that the characters interact most of the time is only a logical conclusion of the commerce-driven world we live in. The film is personal in a way that many European films of the 1950's and 1960's were. Even the title suggests the intimacy of the film and its treatment of its characters. Cassavettes must have been repulsed by the insincerity of the people who were surrounding him when he wrote Faces. Few films have so many moments where characters are together but not talking to each other. They are merely talking, or laughing, or singing, doing anything they can to avoid having to confront the other person. Only once, when the young lover boy talks about the mechanical nature of people in America, do we even get any hint that the filmmaker is put off by the behavior of his characters. The rest of the time he merely films them and shows us what they do. This unsentimental approach can leave the viewer feeling a bit odd, but it works very well in the end. By seeing these character's shortcomings without any hint of disapproval from the filmmaker, the viewer is forced to consider their own lives and the people around them. It allows for an honesty not found in any, I repeat ANY other American film of the 1960's. Even Who's Afraid of Virginia Woolf has some indications of Nichols' attitude towards the material. Faces is just the facts. I can only imagine the excitement that people interested in film must have felt upon the release of this film. Here was a personal, Bergman-esque film made about American people living American lives. (Note: Bergman is referenced during the film.) The quiet desperation of the housewife, the empty feeling inside the businessman, the false nature of each and every relationship speak volumes about the reality of American family life. How refreshing it must have been to see these topics approached in an American film. The film's style is notable as well. It is independent in every sense of the word. It uses a fluid camera, freeform acting, and natural lighting. In many ways, it paved the way for a lot of the young filmmakers of the 1970's by providing them with a stylistic freedom that Hollywood had previously ignored. Today, it appears as a fairly standard film in terms of style, but at the time it was groundbreaking and exciting. In fact, it retains that excitement today, although the real revelation is how much has been taken from the film and used by others. Faces is a great movie experience. Anyone frustrated with the lack of real connection in their lives should see it, if only to realize that many others are suffering from the same fate.",
         "This film is one of the supreme masterworks of all of American cinema. It is absolutely essential. Yes, it is \"difficult.\" Yes, it is \"slow.\" But those standards are for enterainment. Cassavetes wants to take us out of our ordinary ways of viewing. He wants to deny us the escapism of \"entertainment.\" That's the point. If you have trouble with this film--good! If you find it infuriating--good! If you find it not entertaining--good! It wants to get under your skin. It wants to shake you up. It is a deep exploration of manhood in America, of the power games that men play with women, and of the other kinds of games women victimize themselves with. Deeper than Citizen Kane, more abrasive than Magnolia or American Beauty, Faces turns the camera on the ordinary, everyday ways men and women treat each other. It wants to get under your skin, and if you allow it to, without giving up or shutting your mind to it, it will profoundly enlighten you. I also want to highly recommend a stunning book about Cassavetes that makes a nice companion piece to a viewing of the film. Ray Carney's Cassavetes on Cassavetes book (or his web site devoted to Cassavetes) has almost 100 pages about the making of this film. Both throw more light on how Cassavetes got the amazingly intimate and exposed performances he did. But trust me, this film can change your life. It is one of the greatest works of art in all of film. And the resistance it meets with is proof of it",
         "John Marley plays a fatted-calf spawn of affluent suburbia, who is tired of his wife (Lyn Carlin) JUST BECAUSE!!..He goes off with Gena Rowlands, who condones infidelity if it is conditionally based on a bond between two people, and not just for purposes of sordid sex..The common ground all of the characters in the movie share is not love nor understanding, but as is often the case... ALCOHOL!!!.. The director, John Cassevetes, is once again superb in his character portrayal of morally inept people who rely on their misguided self-serving interests and callous logic to carry them through their meaningless pursuits.. Before we do anything, let's pour another drink...We act the way the alcohol tells us to act, the convoluted line of logic being \" I can't help what I did and said, the highly toxic cocktails made me act that way\".... These antics are more adolescent than anyone could possibly imagine, yet they go under the guise of sophisticated fun!! Such charades fall into the category of extremely dangerous thrills..both emotionally and physically as well!! A precariously select set of upscale Los Angeles clicks have unearthed an onslaught of social misgivings about themselves which have plummeted them down to a pathetically denigrating conscious pitfall level!! These fragile and ominous emotions inevitably become purulent once these individuals' drunken stupors have punctured them open!! SO NOW!! HUSBAND AND WIFE HAVE PLAYED SWITCHIES!!.. What's next?..For starters, they've been painfully reminded that their lives have been obviated from happiness and even contentment!!.. Self destruction is so ugly it just cannot be ignored!! Nothing works for me, nothing works for my spouse, nothing works for my mistress, nothing works for anybody!!!...Their ultimate undoing is not necessarily the marital infidelity on it's own right, but rather, emotions that are predicated on unscrupulous gratification, and a volatile unwillingness to empathize with anyone or anything!!! John Cassevetes evokes a cynicism in this film that touches the core of non-productive selfishness.. Itemization of the character's unchanging flaws is an aspect of behavior that Cassevetes implements in virtually every one of his films... Cassevetes articulates an introverted disarray with his characters in \"Faces\" by way of manufacturing a set of prevailing circumstances being such whereby the most felonious afflictions with all of the people in the movie are directly attributed to an affluent monotony, as well as an executive class alienation!! The end result of such a fate has fatalistic repercussions!! Cassevetes did not consult with the actors and actresses in this movie, once he assigned them their character roles, he then told them that they now owned these roles and they should treat them accordingly!! The camera angles in \"Faces\" are spectacular as they illustrate the pejorative reactions of perplexing curiosity with virtually everyone in the film!! Cassevetes is brilliant...Usually the debate is how brilliant...I say EXTREMELY BRILLIANT!!!... However!! I am not a professional movie critic!! SORRY ABOUT THAT JOHN!!! A great director does not even consider himself a director, rather, someone who just understands people... This is what I heard anyway!!!... John Cassevetes goes out on a limb by being so overtly non-conventional.. Guess what?...It definitely works!!!! AN UTTERLY OUTSTANDING MOVIE!!",
         "This movie is the epitome of brilliantly dramatic character study: It's so phenomenal, watching it is excruciating. Cassavetes takes us deep inside the lives of a bored, shallow upper-middle-class couple, and as his skilled actors improvise remarkably realistic scenes, down to the smallest mannerism of their characters, Cassavetes forces us to watch every knife-twisting second. It's difficult: Rather than watching an unpleasant situation, then getting pulled away by an editor's cut, we have to sit through all 20 or 25 minutes of a scene that makes us squirm, whether it's a middle-aged man making an ass of himself to impress a young prostitute or his wife feigning laughter to make a young man think she's having fun with him. While not the best movie I've ever seen, it's unique: A great work to whose style nothing else compares.",
         "When I began watching Faces, I realized that I never knew just when the present scene was going to end. I then realized that I wished that it would last forever. I found myself so engrossed in the scene that I was fascinated with it by itself. Then the next scene began, and the next scene, and within each one, there is a whole single movie with characters and a story arch. Faces is a film that does not allow any given scene to simply be a communication of plot information. Cassavetes created an entire universe for his actors in every scene. Each scene is a million years of passion spliced together, each demonstrating brazenly his brilliant recognition of human exchange and in conversation and conflict what is exchanged and what is left to be desired. The film has moments of great pain because miniature struggles are so real and they tend to be vocalizations of a person's deeper fears in social interactions and in the structure of life. The film has scenes of furious drama because characters will experience blind unleashing of their ids as middle-aged people. Faces also delivers highly during moments of happiness and fun because, the situation's comfort level gracefully allowing, the characters will show the fieriest, grandiose, extroverted parts of themselves. The movie's message, ironically, is not about the inner self and the unleashing of it but about the naiveté with which people carry out their normal married lives and don't care to face their flaws and problems and, though they gradually strip their personalities down bare throughout interactions, they continue not knowing themselves or each other. Faces is now among my favorite films of all time and places John Cassavetes on a pedestal as an idol of mine. The movie is a supreme demonstration of powerhouse acting, wherein each performance can be cherished by the performer with a feeling of ownership. There is a bit of real actor in each character played, and that can be seen in each and every powerhouse scene in a row.",
         "Faces is a torrid story of what people do when they're in fractured relationships, and, really, what a lot of lives are really like out there. What Faces offers just on its own as a character based drama is almost enough to see what the director is all about. No big budget, no fake sets, just people on the screen who have real personalities and histories with each other, and conflicts that are given enough light to get an idea of what they're about. But what is given, shot in a grainy 16mm feel by Cassavetes, using mostly theater actors (and Cassavetes's wonderful wife Gena Rowlands), are compelling enough to stay with them, through their flaws and difficulties with one another, and through this we get a look into their small world. Film-making like this is rare, where the director- also as writer- can work with so little to provide so much emotionally for a viewer. It's definitely a certain kind of world shown, of New Yorkers with relationship crises and psychological complexes that may go a bit beyond some viewer's expectations. That how they communicate is so raw is also a little unnerving at times, and some scenes deserve to be seen twice to grasp everything that's going on. But Faces, for all its moments of improvisation, is a work that is alive, because it has characters who question their own excesses and escapes while not being able to really escape them. There's adultery, alcohol, an overdose, and lots of talking at times. But there's also moments of true compassion, and reality that likely could be found in few exceptions of films at the time it was made (especially about the middle class). And at times what the filmmaker gets us to feel for these completely imperfect and almost damaged people (underneath their middle class side) is a bit shattering. Take the scenes involving Seymour Cassel and the woman he's found in the morning unable to really wake up. This whole set of events as he tries to wake her up is a true knockout kind of cinema, where there's no pretense between what is being shown on the screen and what the audience is receiving. Arguably, there are at times scenes that feel nearly too theater-based, as if we might as well see this on an off-Broadway production. But in this kind of independent film, where there really aren't limits, Cassavetes is interested in characters and situations that Hollywood would just take as stereotypes or more conventional forms. And with the professionals like John Marley, Rowlands, Cassel, and especially Lynn Carlin (who along with Cassel got richly deserved Oscar nominations), Cassavetes at times just lets his script go with them and the conviction they bring is, at times, shocking. This is the sort of film that influenced Scorsese, though his style has also influenced a good chunk of what are American independent films, where the limits of budget, time, and Hollywood perks like staged sets and special effects, can sometimes be used for an advantage with a good enough script and cast. To put it mildly, I can't wait to see this film again.",
         "John Cassavetes had impressed me with Shadows, charmed me with Minnie and Moskowitz, and disturbed me with Husbands and The Killing of A Chinese Bookie, but Faces evoked all of these reactions simultaneously. The film balances the spontaneous vision and participation of the camera as it dances around the characters with the relentless exploration of awkward human contact. After watching Faces, it is difficult to return to some of the French New Wave films, with which Cassavetes' early work holds much in common. He simply embraced an akin visual style without diminishing psychological facets of his characters' abandon. Faces is truly Cassavetes' masterpiece and a work that brings to light all of his talents and contributions in the cinematic medium.",
         "This was a marvelous movie to watch. It is so intelligent and informed most of the time, it is hard to believe there were improvisations by Cassevetes and company. Although themes such as those which the movie revolves around were already then considered Bergmanesque, the movie evokes the spirit of other great non-Hollywood directors of the era: Fellini and Antoninoni. Still it retains its integrity and is rather unique. I think that it is a very impressive film even today. Puts many to shame. NSFC did the right thing in awarding the film with Screenplay and Supporting Actor honors. Oscars on the other hands were not so generous. It did not get a nod for best picture nor did Cassevetes for best directors. What a shame! Since Stanley KUbrick's 2001 A Space Odyssey was snubbed the same year, making it a double debacle.",
         "In reviewing writer-director John Cassavetes' cinema verite-styled \"Faces\" for the New Yorker, film critic Pauline Kael was more interested in the theater audience's reaction to the picture than the picture itself. She noted that everyone in the crowd seemed to accept this \"bad office party\" with the utmost seriousness, as if what they were witnessing was extremely personal and important. \"Faces\" is probably still quite important to revolutionary filmmakers, but it doesn't feel very personal. Cassavetes views a sad, crumbling, upper-class marriage between a businessman and a housewife in Los Angeles with blank eyes. The conversation between the two is vapid and disconnected--and later, when the couple separates and he finds company with a prostitute while she brings home a gigolo, the dialogue remains flat and monotonous. Is Cassavetes trying to say that some marriages become zombie-fied to the point where no amount of conversation breaks through? The wife overdoses on pills and is rescued by the stud, but when the husband comes back and sees the bottle and the mess in the bathroom, he doesn't even ask her about it. The film is stultified by its need to be raw and uncompromising in an arty fashion (with Mount Rushmore-like close-ups of the four principals, a gambit which gets tiresome). Flickers of truth permeate the production, though it isn't very well-shot or lighted, and the editing (purposefully) allows scenes to ramble on passed their emotional peak. ** from ****",
         "I see movies hoping that they're different. I've seen so many films that were exactly the same and that's really just a waste of time. Well, Faces is certainly different. It's hard to get through. It actually took me a week. That's because there is little action and it is hard to get interested in it. The reason why it's so original is because it is practcially a documentary on social life in this time period. It's as low budget as you get. Characters just hang around houses drinking and enjoying themselves. So I guess there isn't much of a plot, but on the good side this might be the most realistic movie I've ever seen. I really felt like nothing was unrealistic, not even a single one of the conversations. That's different. Most movies try to impress, but Faces tries to be natural. That doesn't make much sense because \"natural\" means you're not trying to do anything, you're just existing as you always do. Maybe that was how Faces was filmed. It definately feels natural and that's a big achievment."
      ],
      "genres": ["Drama"],
      "productionCompanies": [],
      "summaries": [
         "Richard Forst has grown old. One night, he leaves his wife for Jeannie Rapp, a young woman who does not like friendship. Meanwhile, Richard's wife, Maria, is seduced by Chet, a kind young man from Detroit... A film about the meaningless of life for a certain kind of wealthy middle-aged people.",
         "An old married man leaves his wife for a younger woman. Shortly after, his ex-wife also begins a relationship with a younger partner. The film follows their struggles to find love amongst each other."
      ],
      "budget": 275000
   },
   "movielensId": 702,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-11-24",
      "dvdReleaseDate": "1999-04-06",
      "directors": ["John Cassavetes"],
      "runtime": 130,
      "movieId": 702,
      "title": "Faces",
      "mpaa": "PG-13",
      "actors": [
         "Gena Rowlands",
         "John Marley",
         "Lynn Carlin",
         "Seymour Cassel",
         "Fred Draper",
         "Val Avery",
         "Dorothy Gulliver",
         "Joanne Moore Jordan",
         "Darlene Conley",
         "Gene Darfler",
         "Elizabeth Deering",
         "Laurie Mock"
      ],
      "imdbMovieId": "0062952",
      "originalTitle": "Faces",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "OUrzJ60EdjA&feature=related",
         "pKqNO0gVdUI",
         "7BsmWI2cPdw",
         "OUrzJ60EdjA",
         "l_53iJ6JF68",
         "pHwdOU-wruc"
      ],
      "plotSummary": "An old married man leaves his wife for a younger woman. Shortly after, his ex-wife also begins a relationship with a younger partner.",
      "tmdbMovieId": 753,
      "avgRating": 3.76389,
      "releaseYear": "1968",
      "numRatings": 432,
      "posterPath": "/ufORkC9NfixbUxqQXI2VcNVKRZi.jpg"
   }
}