{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "boarding school",
            "id": 6271
         },
         {
            "name": "flashback",
            "id": 187844
         }
      ],
      "imdb_id": "tt0115742",
      "video": false,
      "title": "Boys",
      "recommendations": [
         44895,
         31941,
         69266,
         22100,
         40876,
         51321,
         45069,
         27141,
         26156,
         19381,
         23312,
         12793,
         14630,
         7269,
         39411,
         8008,
         31535,
         19425,
         16151,
         58467
      ],
      "backdrop_path": "/4PqaQ7JKW5gH7Hk8k5WobPaZk1I.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Patty Vare",
               "gender": 1,
               "credit_id": "52fe4656c3a36847f80f9761",
               "name": "Winona Ryder",
               "profile_path": "/gUyEOZpZlGBUkUxCxyoLEc9WejR.jpg",
               "id": 1920,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "John Baker Jr.",
               "gender": 2,
               "credit_id": "52fe4656c3a36847f80f9765",
               "name": "Lukas Haas",
               "profile_path": "/1n1CTF6fi52BF407iQU6aMMKWFU.jpg",
               "id": 526,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Officer Kellogg Curry",
               "gender": 2,
               "credit_id": "52fe4656c3a36847f80f9769",
               "name": "John C. Reilly",
               "profile_path": "/3LpfXon9xQZc1M2AFvfXyLeICbg.jpg",
               "id": 4764,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Fenton Ray",
               "gender": 2,
               "credit_id": "52fe4656c3a36847f80f976d",
               "name": "James Le Gros",
               "profile_path": "/rqBjmSkcRGwtwpb2tTjGcqLtKyG.jpg",
               "id": 6474,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Bud Valentine",
               "gender": 2,
               "credit_id": "5738e9d39251414b03000360",
               "name": "Skeet Ulrich",
               "profile_path": "/id0y6bKmNSpr2pYU2Qkiv11EyvR.jpg",
               "id": 22108,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "John Phillips",
               "gender": 1,
               "credit_id": "5738e9e492514120700008d2",
               "name": "Wiley Wiggins",
               "profile_path": null,
               "id": 56934,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Jilly",
               "gender": 1,
               "credit_id": "5a67c8489251411bb50006e1",
               "name": "Catherine Keener",
               "profile_path": "/tEBdqBUduF3dBcJcBeY5ffZ9MMu.jpg",
               "id": 2229,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Mrs. John Baker",
               "gender": 1,
               "credit_id": "5a67c87dc3a36844c100074f",
               "name": "Jessica Harper",
               "profile_path": "/4W74yGyRKJJfMolXwCOlR4kUBBs.jpg",
               "id": 69055,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Mr. John Baker",
               "gender": 2,
               "credit_id": "5a67c89ac3a36844c100075e",
               "name": "Chris Cooper",
               "profile_path": "/ytZY7YofdiAZyiyr4NyiB77lwwQ.jpg",
               "id": 2955,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4656c3a36847f80f9757",
               "name": "Stacy Cochran",
               "profile_path": null,
               "id": 129708,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4656c3a36847f80f975d",
               "name": "James Salter",
               "profile_path": null,
               "id": 129710,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4656c3a36847f80f9773",
               "name": "Stacy Cochran",
               "profile_path": null,
               "id": 129708,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a67c7bf0e0a2653af000702",
               "name": "Robert Elswit",
               "profile_path": null,
               "id": 2950,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.529707,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43634,
      "vote_count": 16,
      "budget": 0,
      "overview": "Fed up with boarding school and frustrated with the way others have planned his life, John Baker Jr. wants a change -- anything to shake up his staid routine. The moment arrives when he stumbles upon a woman, Patty Vare, unconscious in a field. Deciding to risk it, John takes her to his dorm to look after her, much to the disapproval of his friends. John's decision proves fateful as he and Patty grow close to one another. However, she may be keeping secrets from him.",
      "similar": [
         2503,
         1903,
         77,
         346685,
         8413,
         9946,
         8834,
         133805,
         2320,
         14869,
         1572,
         562,
         101299,
         2501,
         2502,
         5503,
         431,
         38,
         205,
         769
      ],
      "original_title": "Boys",
      "runtime": 86,
      "poster_path": "/6VvXOemt5jSrwnH1aUmgKR5q7Rn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Interscope Communications",
            "id": 10201,
            "origin_country": ""
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "1996-05-10",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "No one stays innocent forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stacy Cochran"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Stacy Cochran",
         "James Salter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115742/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MzE3NTg1OF5BMl5BanBnXkFtZTcwOTg3ODUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Winona Ryder, Lukas Haas, John C. Reilly | See full cast and crew »"],
      "reviews": [
         "I was skeptical, as many others may have been, before I saw this movie. The idea of a teenager finding a damsel in distress did seem a little immature. However, the simple plot is mapped out very well. The events in this film occur in a logical manner, and as always Lukas and Winona's acting is superb. I even found the secondary characters realistic. This is really one of those movies that keeps on giving. I have seen it about four times over the years, and each time I have caught another subtle detail that made me realize how well this was made. I would not, however, recommend this movie to anyone who must see high action to enjoy a movie. There is quite a bit of dialogue, and you won't hear much noise in the background. And I must comment on the soundtrack, lighting, and clothing of this movie, which really add to the mood. The main characters in this movie both want to escape from their current situations, and I found myself wanting to escape with them. You should definitely catch this one.",
         "I do not care what other users say, this was a good movie. The acting was superb, the directing was on target, and the photography was absolutely beautiful. A fitting soundtrack, a very sufficient cast, and quality transition between short-story and screen. Winona Ryder and Lukas Haas give a chemistry that you cannot find in many movies these days, especially with youth actors. Ok, Granted- that the story builds up and then lets you off to a bad explanation and dull outcome, the ride up to the climax was marvelous. I voted this movie an 8, and anyone who devoutly disagrees can go take a film making course and actually learn to critique.",
         "I liked this movie. Imagine a teenager, named John, the typical guy who goes to the last year of high school and doesn't quite know what to do with his life. Then, one day, he finds a beautiful woman lying on the floor in a field who, apparently, is on the run for something she did and takes her to his room. It's a boarding school, he might get kicked out, but he doesn't care; he just wants to help her. The look on his face when the woman first wakes up and the teenager walks towards her, is the first sign of a magical performance by Lukas Hass; it's a look that combines the excitement of having this woman in his bed and the curiosity of wanting to know what she might have done. The woman is called Patty Vare, played by the wonderful Winona Ryder in the kind of role she knows by heart but never forgets to add new elements to. Here, besides appearing to be somewhere other than the real world (she fell off a horse before John found her and doesn't remember much), she masters the 'look'; that seductive look only she can achieve and makes anyone go crazy to the point that they would do anything for her. Well, at least that's the effect it had on John in the movie\u0085And on me, of course. But don't get things wrong. I personally don't think \"Boys\" is a romantic movie, even if it was writer/director Stacy Cochran's intention. I would call it some kind of an 'age analysis'. Yes, there are romance related moments that make you smile because Winona is an expert on the subject, but this time her character Patty is an expert too: on men. So the study the film tries to make is what can happen when a woman of Patty's experience meets a kid like John in an extreme situation. That's why Cochran shows us flashbacks of what happened to Patty before meeting John; they're necessary for us to know the kind of woman she is. On the other hand, we don't know anything about John but the fact that he has a bad relationship with his father (a respectable Chris Cooper). But we don't need to know, because we realize when he is with Patty; when we hear what he says and see what he does. There's a scene in the town fair, where Patty and John are together in the merry-go-round. The final moment of that scene explains why I liked this movie, and those are the scenes in the movie that work. Not the police sub-plot (led by a convincing John C. Reilly), not John's relationship with his friends at school (although some scenes are good to watch more of Hass' perfect work), not even the conflict with his father. There's another scene really worth paying attention too: a chat in a table where a beautiful light from the window makes Patty seem so vulnerable. Luckily for us, this is a movie where we have the final world; about whether we believe the characters or not and about the inconclusive and far-fetched ending. Yes, it may not honor reality itself, but \"Boys\" honors its title; and I liked that. I liked this movie.",
         "I liked this movie a lot. Visually, it is just so appealing in a very mystical sort of way. I don't get why nobody gets this movie. While the story doesn't quite hold up as well as the photography and the ending is way eighties, if you are a poetic person, you will get into this. In a weird sort of way it has a bit of the Love Story appeal. There is just something about it that can't be explained. A lot of the appeal has to do with winona ryder, she has never looked more magnetic...trust me. She actually does a very good acting job with this, in fact she probably saves the movie with her appeal and acting skills. There are certain scenes in this flick that will just float you away...like the one where the two main characters make love in the woods behind the carnival...classic. The first fifteen minutes are very interesting also. To sum up a rambling review just let me say this is one for are searching for something poetic and different in a movie. This is one for the fans of beautiful, sensitive people, falling leaves, and cobblestone paths.",
         "This flawed film came out of nowhere the other night. We don't know if it ever was released commercially, but it appears to have gone straight to video. As much as we wanted it to be better, \"Boys\" suffers from a screen play that doesn't fully expand on its characters and leaves us wishing and waiting for more. Stacy Cochran, who adapted the short story by James Salter, sets her story in what appears to be a prep school in New England. This is a school for privileged kids sent by their families to get an education. By having attended this institution will probably ensure the rich boys access to prestige colleges and universities later on. Into this quiet background another darker story happens involving the rich, careless and perhaps promiscuous Patty Vare, who has had a terrible experience when a baseball player takes her on a night ride that is leading to sex, when the car plunges into a river. Patty, who is questioned by the police, is seen riding her horse as the memory of the previous night comes haunting her memory. In attempting a jump over a fence, she and the horse fall and she is hurt. Enter John Baker, a student from the school, who is alerted by another student about the young woman he has found in a field nearby. John decides to take her into his dorm against house rules. They end up going away, ending in the county fair in a night that ends up in a romantic note, but Patty. realizing she wants not to implicate John, disappears. John's parents come to the school and they are helpless to put any sense into his head. That morning Patty and John meet again in the police station. It's clear they have found one another and no one will separate them. The two main roles, Patty and John, are given excellent readings by Winona Ryder and Lukas Haas. Both show great chemistry in their scenes together. Unfortunately, other characters don't fare that well. There is Fenton, who helps Patty escape, whose presence is never justified well. As played by James LeGros, he is an enigma. His girlfriend, Jilly, is acted by Catherine Keener in a role where she is totally wasted. Chris Cooper and Jessica Harper play John's angry parents. The film is not a total failure because of our interest in Patty and John. Perhaps with another director, and a better screen play a better film would have resulted, although Ms. Cochran, and her cinematographer, Robert Elswith, give the production a lovely sheen with the local color of the country in autumn, the county fair seen from a distance, and the staid prep school.",
         "I watched this at 4 am and I really liked it. It has a certain taboo-younger boy older woman type appeal to it. It was very surreal in content. Which was perfect for my sleep-deprived brain cells. I am a long time fan of lukas haas. I am not a fan of winona. Even she couldn't mess up this role of confused ditsy rich girl who is running from trouble(sic). I would recommend this movie if asked. I would not pay to see it. I thought the story was very far-fetched, but like I said it was surreal and I did get into the movie. It had a very indie-film type feel to it. I was reminded of the movie Girlfriends. Another surreal movie which totally engrossed me around 4 am.",
         "Let me begin by saying, I love Winona. I think she's great. This movie is just terrible though. It's boring, slow and forgettable. Her performance is really bad. She looks tired, bored, fed up - her heart just wasn't in this one. Compared to her *fantastic* efforts in Heathers, Mermaids, Reality Bites, Little Women et al, this is just tripe. The \"romance\" between her and Lukas Haas is unbelievable and awkward and there's zero chemistry, the scenes in the dormitory are boring, I just can't name any redeeming features except for the beautiful Maryland scenery. And there's a scene where there's all this Spanish being spoken and NO sub-titles. Ridiculous. I know some people enjoyed this movie and I respect that, but if you decided to see this thinking it'd be another Winona classic, forget it. Oh, and as for the \"mystery\" of \"What's up with Patty?\", well, by the time we find out, I really didn't care anymore. Sorry Winona, you CAN and HAVE done MUCH better than this. 1.5 stars (for the scenery). May be of interest to some to see Christopher Pettiet in one of his final roles before his untimely death.",
         "I gave Boys (1996) a solid eight out of ten --- until the credits rolled. This movie is a superficial script (based on a short story by Stacy Cochran, who also directed), has excellent direction & cinematography and superb acting by such a young cast, and Winona Ryder is brilliant as always. Boys seems to pass in an awe-inspiring, action-packed 5 minutes and as the cast just get their troubles behind them and you start expecting the action to pick up and really 'get in to it' the movie ends and the credits roll, leaving the audience with a very unsatisfying, empty and unfullfilled feeling. I found myself immediately wanting to watch 'next week's episode' or the sequel or _something_. I think it is always possible for this to happen when a movie is based on the few pages of a short story, but at least Boys doesn't suffer the abridgement many novels do when they are transferred to the silver screen. This is a light-hearted, comical glimpse into the interesting lives of a few, I just can't believe it finished, leaving me wondering _so_ much, too much, about the characters and where they go from here. Altogether, it's great film, even if somewhat unsatisfying. In any case, I highly recommend it --- especially for Winona Ryder fans. (7/10 - generously)",
         "\"Boys\" is proof positive that two young, attractive leads, Wynona Ryder and Lukas Haas, can't always compensate for a complex, uninvolving plot. Make no mistake, Ryder and Haas are both as good as they can be, given the material, and their love scenes, particularly at the carnival, do generate a goodly ammount of heat. But, on the whole, the story is far too complex and uninvolving. By the time the central mystery is unraveled, you find yourself asking what all the fuss was about. In short, a dynamic team wasted on a trite picture.",
         "\"Boys\" tells a flimsy story to which Cochran tries to add mystery by keeping information from the audience and revealing it piecemeal via flashback. Cheap shot. Ryder is found unconscious, after being thrown from horseback, by a boarding school student (Haas) who takes her to his room (yeah, right), instead of the obvious choice, the hospital. You know, HOSPITAL...where you take injured people for professional medical care. Duh. Anyway, this dumbassed flick has a list of negatives too long to go into here. File \"Boys\" in the boys room and don't forget to flush. (D)"
      ],
      "genres": [
         "Mystery",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Interscope Communications",
         "Polygram Filmed Entertainment",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Patty Vare falls off a horse and is found unconscious by prep school student John Baker. He takes her to his dorm. As he quickly discovers, she is hiding from something. For John this becomes a road to maturity and for Patty it's a way back to love and tenderness.",
         "Patty Vare has a secret she is hiding. And after the police come to her door asking her questions, she tries to leave the area on her horse. But she falls off her horse and is knocked unconscious. She is later found by John Baker and two other boys that go to the nearby prep school. John and Patty develop a relationship, and in this relationship John finds a way to leave his verbally abusive father and the school that he hates."
      ],
      "budget": 0
   },
   "movielensId": 703,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1996-05-10",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Stacy Cochran"],
      "runtime": 86,
      "movieId": 703,
      "title": "Boys",
      "mpaa": "PG-13",
      "actors": [
         "Winona Ryder",
         "Lukas Haas",
         "John C. Reilly",
         "James Le Gros",
         "Skeet Ulrich",
         "Wiley Wiggins",
         "Catherine Keener",
         "Jessica Harper",
         "Chris Cooper"
      ],
      "imdbMovieId": "0115742",
      "originalTitle": "Boys",
      "genres": [
         "Romance",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Fed up with boarding school and frustrated with the way others have planned his life, John Baker Jr. wants a change -- anything to shake up his staid routine. The moment arrives when he stumbles upon a woman, Patty Vare, unconscious in a field. Deciding to risk it, John takes her to his dorm to look after her, much to the disapproval of his friends. John's decision proves fateful as he and Patty grow close to one another. However, she may be keeping secrets from him.",
      "tmdbMovieId": 43634,
      "avgRating": 2.88642,
      "releaseYear": "1996",
      "numRatings": 383,
      "posterPath": "/6VvXOemt5jSrwnH1aUmgKR5q7Rn.jpg"
   }
}