{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "bare knuckle boxing",
            "id": 397
         },
         {
            "name": "himalaya",
            "id": 486
         },
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "street artist",
            "id": 8406
         },
         {
            "name": "muay thai",
            "id": 10514
         },
         {
            "name": "kick boxing",
            "id": 10515
         }
      ],
      "imdb_id": "tt0117420",
      "video": false,
      "title": "The Quest",
      "recommendations": [
         10413,
         10861,
         9091,
         3513,
         9405,
         17466,
         9594,
         10596,
         37498,
         9399,
         2019,
         10908,
         37632,
         10134,
         19277,
         10222,
         10366,
         11667,
         9924,
         8831
      ],
      "backdrop_path": "/m4YwE8eChe6X57VgFmVFKCu5ObZ.jpg",
      "revenue": 57400547,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Christopher Dubois",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5c1",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lord Edgar Dobbs",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5c5",
               "name": "Roger Moore",
               "profile_path": "/8tnAaHY6cehjC9B6mIvxaFPewbh.jpg",
               "id": 10222,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maxie Devine",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5c9",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Harry Smythe",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5f3",
               "name": "Jack McGee",
               "profile_path": "/jSl2RKRaJvtRoS3T5HSw4xeNdwy.jpg",
               "id": 10489,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Riggi",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5fb",
               "name": "Louis Mandylor",
               "profile_path": "/4DCfloJ8CDsvchaKE0KdYW07obz.jpg",
               "id": 54649,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Officer O'Keefe",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5ff",
               "name": "Ryan Cutrona",
               "profile_path": "/b2DueYTc1uInvmyl56XMWsmswyO.jpg",
               "id": 93345,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Turk Captain",
               "gender": 0,
               "credit_id": "52fe44dcc3a36847f80ae603",
               "name": "Ze'ev Revach",
               "profile_path": "/mlHruR6bAIkdOkovWrayAeAvzSu.jpg",
               "id": 74604,
               "order": 6
            },
            {
               "cast_id": 4,
               "character": "Carrie Newton",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae5cd",
               "name": "Janet Gunn",
               "profile_path": null,
               "id": 56984,
               "order": 7
            },
            {
               "cast_id": 5,
               "character": "Khao",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5d1",
               "name": "Aki Aleong",
               "profile_path": "/r4rurhm8zIXrfrJmi84nDHZKgIR.jpg",
               "id": 41757,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Khan (Mongolian Fighter)",
               "gender": 0,
               "credit_id": "52fe44dcc3a36847f80ae5f7",
               "name": "Abdel Qissi",
               "profile_path": null,
               "id": 947361,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Red",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae607",
               "name": "Shane Meier",
               "profile_path": "/dyCdl0VQS6zU3I0D5sda6jVXuai.jpg",
               "id": 130935,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Spanish Fighter",
               "gender": 2,
               "credit_id": "59354b23c3a36859de033557",
               "name": "Peter Malota",
               "profile_path": "/9Yh6HFHHc0KhBeVu3hQuijq2xfS.jpg",
               "id": 1785844,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5d7",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dcc3a36847f80ae5dd",
               "name": "Frank Dux",
               "profile_path": null,
               "id": 56985,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dcc3a36847f80ae5e3",
               "name": "Steve Klein",
               "profile_path": null,
               "id": 56986,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dcc3a36847f80ae5e9",
               "name": "Paul Mones",
               "profile_path": "/1qGLKfuj55YRA4W2989JPYtPjUo.jpg",
               "id": 56987,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae5ef",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59354c0c9251417dd8034921",
               "name": "Peter Malota",
               "profile_path": "/9Yh6HFHHc0KhBeVu3hQuijq2xfS.jpg",
               "id": 1785844,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 6.986714,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9103,
      "vote_count": 162,
      "budget": 30000000,
      "overview": "Ghang-gheng, the ancient winner-take-all competition in which the deadliest fighters from around the world employ the most spectacular feats of martial arts skills ever displayed in order to win the prized Golden Dragon. But fighting prowess alone will not be enough for Chris to triumph over such daunting foes.",
      "similar": [
         10222,
         682,
         27902,
         13888,
         13184,
         327833,
         3173,
         428497,
         26946,
         6414,
         32677,
         353732,
         351155,
         71520,
         277765,
         423033,
         297497,
         333968,
         104281,
         142208
      ],
      "original_title": "The Quest",
      "runtime": 95,
      "poster_path": "/z05SPecyjaryEedxX9noKQdqIFH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Signature Pictures",
            "id": 2982,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MDP Worldwide",
            "id": 10828,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Selima Films AVV",
            "id": 38114,
            "origin_country": ""
         }
      ],
      "release_date": "1996-04-19",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Go the distance",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jean-Claude Van Damme"],
      "runtime": 95,
      "synopsis": "Comments by Actor / Writer Roy C. Peterson This a very good movie with Jean Claude Van Damme as the hero triumphing against all odds. Van Damme also directed and did a very fine job. It's like a synthesis of Indiana Jones with Bloodsport. The story is set in the 1920s and the tournament is not the Kumite, but an equivalent called the Ghang-gheng. The script is actually based upon an amended version of the Bloodsport story which never got produced. The pageantry here is greater. Really exotic settings with a more spectacular tournament venue. More diverse ethnicity via costume. I don't know enough about any of this to comment upon authenticity. For some reason I enjoyed this movie much more the second time I saw it.",
      "writers": [
         "Frank Dux",
         "Jean-Claude Van Damme"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117420/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTEzMDAwNjA2OV5BMl5BanBnXkFtZTcwMTU4MDEyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Claude Van Damme, Roger Moore, James Remar | See full cast and crew »"],
      "reviews": [
         "Although it took four viewings before I finally lowered my rating of this from \"9\" to \"8,\", I suspect I will still watch this lame-brain action flick a few more times and enjoy it. That's because it offers a great mixture of fascinating fighters in the tournament that covers most of the final 40 minutes of the movie; is a modern-day martial-arts action film with almost no swearing and no sex; and offer some tremendous scenery in the first half of the film as Jean Claude Van Damme and company travel to the Far East for this \"World's Greatest Fighter\" tourney. That tourney is a lot of fun to watch except that it got carried away in the final bout, of course, that went on almost as long as all the preliminary bouts! However, the filmmakers were smart to make all the contestants totally different with different styles, making each one fun to watch. You didn't see the same thing each fight. There was everything from a huge Sumo-type wrestler to a little guy who imitated a monkey and a snake jumping and slithering around the ring. By the way, these were real guys, not actors imitating fighters. The photography is magnificent, far better than you would except. The colors are beautiful and the Thailand scenery spectacular. The movie benefits from a classy actor like Roger Moore joining the cast, too. Yeah, it's stupid in parts, but it's fun and highly recommended for first-time viewers who don't know the outcome of the bouts.",
         "This film is Van Damme's first effort as director, and he is surprisingly good in his task!The Quest is, of course, a simple action film, but it has a lot of good intentions and the story, written by Van Damme, is good-hearted. The star plays Chris Dubois, a man who is saved by a group of mercenaries led by a smooth and charming thief (Roger Moore, who brings a little bit of comedy and softness to the story), and this guy takes Chris to the Lost City to fight in a highly dangerous tournament. The winner takes home a beautiful, enormous golden dragon. This isn't the best film of Van Damme's career, his best phase was with the Chinese directors (Hard Target, The Colony), but The Quest isn't a good film for those who want to see explosions, Van Damme blowing people's heads off and those kinds of thing. This is an adventure, the type of film that, if we were now ten years old, would love!you don't have violence, shootings and explosions, if you want to watch something like that rent Hellbound Hellraiser 2, this is a Raiders-of-the-Lost-Ark kind of film. If you want to give the movie a shot, try to forget your grown-up side and watch it as if you were ten years old again. Then you will love it!it's a simple, entertaining and very good movie!",
         "I am a Jean-Claude Van Damme Fan and have to say this is a 'Damme' good film. Doesn't the film remind you of 'Bloodsport'? Well this has a good story about Chris who wants to get the golden dragon and ends up in a tournament for the dragon. The fight scenes aren't that violent as most people would want to see. But it is an Epic, with a dramatic story. Roger Moore even acts in it gives a 'Bond' type entrance to his name. Overall this is a great film which shall not be missed by all fans. Van Damme is the man!",
         "This film is a lot better than I expected, and much better than the other imdb comments would imply. You can essentially split this movie in half, with the first half being an adventure movie and the second half being a fight competition. I actually liked the adventure portion a lot more than the fight competition, which is surprising since I like stuff like Bloodsport (the fight part of The Quest is essentially a higher-budget version of Bloodsport). At any rate, this movie is great visually -- it's filmed in a lot of exotic locations. I also thought the direction was great...there were some interesting shots that really impressed me for Van Damme's first directorial effort. The story kinda moves along too quickly and there are a couple parts where this strains the believability of the story (such as how easy it is for Van Damme to get the fight invitation/map from the boxer), but these are easily overlooked and don't really detract much. I went into this expecting it to be low-budget and fairly dumb, but I was surprised at the lavish production and the fact that it has an actual story which I find more interesting than the fighting.",
         "The Quest is a surprisingly decent Jean Claude Van-Damme movie. Quest is a period piece, and a pretty well-done one at that. Taking place shortly after World War I, Van Damme plays Chris Dubois, a humble indentured servant figure with Rocky-like ambitions to become a big fighting champion. Dubois has set his sights on some very elite and secret tournament in some mystical forbidden city, to which only the best fighter in every country of the world gets an invitation. To get into the tournament, Dubois enlists the help of a mischievous figure, Lord Dobbs. In one of the many parts of the plot I was unable to follow, Lord Dobbs owes him some unknown favor so he buys his freedom and makes arrangements to get the kid to Beijing, with the aide of an attractive blonde newspaper editor, Carrie Newton (Gunn). Dobbs is played by seven-time James Bond alumni Roger Moore, who I'm so used to seeing as Bond that I half-expected him to, at a crucial point in the movie, bag the attractive news lady, beat someone up, or use some cool gadget. Sadly, Moore only accomplishes one of these three things (uses a cool gadget) and fails miserably at it. However, Moore does carry one James Bond-like trait to this part which is being a smooth talker which gets Dubois in trouble in the first place. Apparently, Dubois was never really entered into the tournament, so he must win over the guy who's slated to fight for the U.S. and get his invitation, which raises the question, isn't Dubois French? Anyway, there's no reason to fret over little things like that, because considering the plot is secondary to the action, it's pretty well-thought out, and besides the action doesn't disappoint. The tournament where most of the actions scenes come from is probably my favorite thing about the movie because the single elimination bracketed format has the same thrill as watching something like NCAA's March Madness. The only difference is that except for rooting for your favorite colleges, you root for Industrial Era superpowers. The other plus of this was that the clashing of such a diverse array of fighting styles (sumo wrestling, Scottish fist fighting, Brazillian street fighting, and the like) led to some great action scenes. My main complaint about the action is that Van Damme's fight scenes attempt to create suspense by him being knocked down and then supposedly against our expectations, getting back up and winning. This just becomes predictable, and besides, because the Master of Ceremonies usually hits the gong after a guy gets knocked down, Dubois would have realistically been out in the second round after getting the crap beat out of him by the Spaniard. Even if he did get back up, he wouldn't have been able to overpower the other guy after having taken so many hits. If he is such a skillful fighter, why doesn't he just win the fight efficiently without all the drama? He reminds me of the present-day LA Lakers who slack off the entire regular season, knowing that they only really have to work during the playoffs. This gag would have been an effective if it was restricted to only happening in the film's climatic finale. Instead, to top the earlier fights, the tournament's final match really got to be a disappointment. The master of ceremonies was incredibly generous with the gong, deciding to let the fight continue even after Dubois got knocked down twice and kicked out of the ring, where he is beaten up some more and magically throws in a couple kicks at the right moment and walks away with the medallion. Anyway, the film is a decently played out story that has its moments.",
         "The Quest is an odd mix of martial arts and epic adventure. Its running time is too short for it to be deemed a true epic, but the panoramic worldwide locations hint that Van Damme was trying to give it the flavour of an epic. It's a painfully simplistic story. Young American pickpocket Chris (Van Damme) has to flee from New York in the 1920s after a botched robbery. He ends up on a pirate ship headed for the Orient. Soon, he is rescued by another ship (another pirate vessel, this time captained by gentleman buccaneer Roger Moore). Moore drops him off on a Thai island where young men are trained as fighters, and before long young Chris is a very handy fighter indeed, with aspirations to win an ancient golden dragon in a fighting competition. The final third of the film is comprised entirely of fight sequences in which competitors from various nations combat each other in an effort to take the ultimate prize. The film marked Van Damme's directorial debut, and he gives it a lovely sense of scale and period but can't wring much out of the thin and obvious story. The backdrops pictured in the film are beautiful. Some of the martial arts moments are well choreographed. Roger Moore gives a surprisingly thoughtful and moving performance. Beyond that, it's very childish and simple-minded and doesn't contain enough memorable moments to be anything other than a passable time filler.",
         "It really get son my nerves when people criticize some films that are actually good. This film was great. It is in my opinion the best Vand Damme film ever. It has story/action/heart and mystery and the highlight of the film were the last battles which showed different fighters from the whole world (ala streetfighter 2) all showing off their capabilities. this movie also has an EPIC feel to it and I don't know what people mean by 'poor' movie cause this looked pretty expensive to me. Roger Moore was cool here too. SO was the babe. Give this a chance people.",
         "The Quest is certainly one of JCVD's best. It has a quite good epic story and style which generally you cannot see in a martial arts movie. Come on people, this is action and so evaluate it in its genre. Emancipate yourselves from \"film d'art\" complexes. Give its right, this is an exquisite \"film d'martial arts\"..",
         "For a Jean Claude Van Damme movie, then \"The Quest\" is a fairly standard one. And if you have seen the 1988 \"Bloodsport\" movie, then you have essentially also seen \"The Quest\". And I don't think that it is a mere coincidence, especially since the story was written by Frank Dux and Jean Claude Van Damme. The story is about Christopher Dubois (played by Jean-Claude Van Damme) who is living on the streets, when he is forced to run for his life and ending up as a stowaway on a ship. When he comes to his senses, he is put into slavery, working on the ship. By sheer luck he is rescued by Lord Edgar Dobbs (played by Roger Moore) and Harry Smythe (played by Jack McGee), two thieves and con artists. Setting out to steal a massive golden dragon in a reclusive and secret fighting tournament, Christoper Dubois finds himself fighting on behalf of the boxer Maxie Devine (played by James Remar). Storywise, then \"The Quest\" focused more on the fights and action. And as in \"Bloodsport\", then there is lots of it, and the fight sequences are nicely executed and brought to the screen. The movie itself is as predictable as they come - but then again, aren't most of Jean Claude Van Damme's movies? There are so many similarities between \"Bloodsport\" and \"The Quest\", that you just sit there wondering why \"The Quest\" was actually ever put on film. Wasn't it enough with this story being told in 1988 back when \"Bloodsport\" came out? But as with virtually all of Jean Claude Van Damme's movies, the main focus is the action and fighting, and whatever story or resemblance of a story there is becomes secondary. Obviously you have the fighting tournament held in an exotic location, there was the bested friend of whom Van Damme takes a headband, there was a woman reporter, there was a massive and seemingly invincible opponent, and of course there is Jean Claude Van Damme as the underdog who swoops in and wins it all against all odds. That being said, then \"The Quest\" is good entertainment where you don't have to use your brain at all. Funny, how I remembered this movie being much better back in the late 90's, when I remember my brother getting it on VHS. And after having obtained the DVD in 2013 and watched it again, it wasn't as cool as I remembered it to be. But still, fun and action-packed, a fairly standard Jean Claude Van Damme movie to be honest.",
         "Set in the 1920's, Chris Dubois (Van Damme) is a street performer who wears clown makeup, a funny hat, and walks on stilts for a living. Adventure finds him when he ends up a stowaway on a boat heading to mysterious Muay Thai Island. There he learns martial arts, and, later in Tibet, meets the charming Lord Dobbs (Moore) and his assistant Smythe (McGee). It is around this time that Chris seeks to be involved in Ghan Geng, a secret underground fighting tournament. The winner gets a huge golden dragon, so Dobbs has a stake in Chris winning, as he wants the Dragon. Fighters are invited from all over the world , and America is represented by boxer Maxie Devine (Remar). Chris must take his place in the tournament and defeat the sinister Khan (Quissi) to win it all. Also, there's some mild romance with the prerequisite female reporter Carrie Newton (Gunn). Van Damme does a solid , professional job with his directional debut. Having co-written the film with Bloodsport (1988) dude Frank Dux, you pretty much know what to expect- but this movie is rated PG-13, so it was clearly trying to bring the Punchfighting genre some mainstream acceptance. With its slick Hollywood look and booming, sweeping score by Randy Edelman, the final product is perfect for 13-year olds, presumably its target demographic. Interestingly, the movie is a period piece, and plays like a prequel to Bloodsport. Instead of The Kumite, It's Ghan Geng. Van Damme tries on a number of personas from \"Old Man Van Damme\" to \"Van Damme The Clown\" and many things in between. The presence of Roger Moore adds class and respectability to the proceedings, and James Remar of Quiet Cool (1986) fame stands out as Devine. He's always worth seeing. Janet Gunn from Night Of The Running Man (1995) and The Sweeper (1996) is the eye candy but not much else. It's important to remember this was when video games like Mortal Kombat and Street Fighter were at the peak of their popularity. So when the Ghan Geng section of the movie begins (pretty much the last half)- the plot just STOPS. It's just one fighter from one country facing off against another fighter from another country. It gets repetitive and pretty numbing after awhile. Other Punchfighters don't do this. They vary the Punchfighting scenes with other plot-based stuff. Not so here. Plus the fact the movie is kind of on the long side doesn't help matters. What The Quest should have been is an 80 minute R-rated Punchfighter. Simply cutting the length but adding more violence would have helped immensely. But they weren't going for that audience, unfortunately. The Quest is more of a big \"adventure\" film where characters are seeking a \"lost city\" and many countries and time periods are represented. This might be a good way to start younger viewers on a career of watching Van Damme movies\\action movies\\Punchfighters but for adults. Only Van Damme or perhaps Roger Moore completists need apply. For more insanity, please visit: comeuppancereviews.com"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Thriller"
      ],
      "productionCompanies": [
         "MDP Worldwide",
         "Selima Films AVV",
         "Signature Pictures"
      ],
      "summaries": ["Chris embarks on an odyssey of self-discovery that spans the globe. Kidnapped and enslaved by gun smugglers, sold by pirates and thrust into the murky underworld of gambling and kickboxing, Chris' journey takes him to forbidding Muay Thai Island where deadly martial arts are taught, the colonial splendor of British East Asia, the dank back alleys of Bangkok, desolate deserts once trod by the warriors of Genghis Khan and finally, the ancient Lost City. There he must face the ultimate test of his manhood in the fabled Ghang-gheng, the ancient winner-take-all competition in which the deadliest fighters from around the world employ the most spectacular feats of martial arts skills ever displayed in order to win the prized Golden Dragon. But fighting prowess alone will not be enough for Chris to triumph over such daunting foes. He must reach deep inside and access all of the determination, strength of character and sense of selfless honor within in order to triumph over this final obstacle on his long trek home."],
      "budget": 30000000
   },
   "movielensId": 704,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-04-19",
      "dvdReleaseDate": "1998-04-28",
      "directors": ["Jean-Claude Van Damme"],
      "runtime": 95,
      "movieId": 704,
      "title": "The Quest",
      "mpaa": "PG-13",
      "actors": [
         "Jean-Claude Van Damme",
         "Roger Moore",
         "James Remar",
         "Jack McGee",
         "Louis Mandylor",
         "Ryan Cutrona",
         "Ze'ev Revach",
         "Janet Gunn",
         "Aki Aleong",
         "Abdel Qissi",
         "Shane Meier",
         "Peter Malota"
      ],
      "imdbMovieId": "0117420",
      "originalTitle": "The Quest",
      "genres": [
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["EaCbSlAsQoE"],
      "plotSummary": "Ghang-gheng, the ancient winner-take-all competition in which the deadliest fighters from around the world employ the most spectacular feats of martial arts skills ever displayed in order to win the prized Golden Dragon. But fighting prowess alone will not be enough for Chris to triumph over such daunting foes.",
      "tmdbMovieId": 9103,
      "avgRating": 2.84004,
      "releaseYear": "1996",
      "numRatings": 1938,
      "posterPath": "/z05SPecyjaryEedxX9noKQdqIFH.jpg"
   }
}