{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0115951",
      "video": false,
      "title": "Cosi",
      "recommendations": [
         16151,
         9977,
         42593,
         14066,
         20351,
         9648,
         35992,
         22625
      ],
      "backdrop_path": "/fJO7WxWzi2h4Z3TvvSvKeBHUo8P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lewis",
               "gender": 2,
               "credit_id": "52fe48a19251416c750ae37f",
               "name": "Ben Mendelsohn",
               "profile_path": "/nAeZkSUXh9CUAUq1cFAg77rZLIS.jpg",
               "id": 77335,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Roy",
               "gender": 2,
               "credit_id": "52fe48a19251416c750ae383",
               "name": "Barry Otto",
               "profile_path": "/v1bnBHE9RYdTNtFw3N2fHfh9du3.jpg",
               "id": 150536,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Julie",
               "gender": 1,
               "credit_id": "52fe48a19251416c750ae387",
               "name": "Toni Collette",
               "profile_path": "/oMps1ZPH3dHmqZmrpZcRiyUBgA.jpg",
               "id": 3051,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe48a19251416c750ae38b",
               "name": "Rachel Griffiths",
               "profile_path": "/eufpAqIIViSBe0ZpMRs47drKiQw.jpg",
               "id": 3052,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe48a19251416c750ae38f",
               "name": "Aden Young",
               "profile_path": "/iox7pYeOOg1c3z7Z8EgAJkpxbE.jpg",
               "id": 144081,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Errol",
               "gender": 2,
               "credit_id": "52fe48a19251416c750ae393",
               "name": "Colin Friels",
               "profile_path": "/tXKCpTwCs4TZYdQ6p5Kch7sRkkS.jpg",
               "id": 27753,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Cherry",
               "gender": 1,
               "credit_id": "52fe48a29251416c750ae397",
               "name": "Jacki Weaver",
               "profile_path": "/8VCKF5s8BFeVhEUjv5qZaZ3B8O9.jpg",
               "id": 67837,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Doug",
               "gender": 2,
               "credit_id": "5982952e92514143300020e6",
               "name": "David Wenham",
               "profile_path": "/xDUXLTF5i2fYx7eSEAR3IdaUb9y.jpg",
               "id": 1371,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48a29251416c750ae39d",
               "name": "Mark Joffe",
               "profile_path": null,
               "id": 59438,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48a29251416c750ae3a3",
               "name": "Louis Nowra",
               "profile_path": null,
               "id": 55597,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.227544,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 90214,
      "vote_count": 11,
      "budget": 0,
      "overview": "Lewis a young director get his first job directing a play at a mental hospital with the patients as the cast.  The play that is decided on is Cosi fan tutte an opera by Mozart.",
      "similar": [],
      "original_title": "Cosi",
      "runtime": 102,
      "poster_path": "/uQWBJJZGXnaHJ0wLZwGnXlt1rAJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-03-04",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Joffe"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Louis Nowra",
         "Louis Nowra"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115951/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzMjY0MzQ5NF5BMl5BanBnXkFtZTcwNzQ1MjAyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Mendelsohn, Barry Otto, Toni Collette | See full cast and crew »"],
      "reviews": [
         "Mark Joffe is a not so known director but the kind of director who happens to make movies you can't help falling in love with. Forget all the sentimentality that is given by Oscarblockbusters or the usual crap with Hugh Grant as this is where the heart beats. It's a simple human story in where there is place for tears and laughter, it's about some psychiatric patients who have decided to make their own operaversion of Mozart's \"Cosi\". It are the little things in life that deserve attention and that's what Joffe is showing us, and the real star in \"Cosi\" is as said before Toni Collette, simply wonderful what the star of \"Muriel's wedding\" is doing here.",
         "The basic premise of staging Mozart's comic opera `Cosi Fan Tutte' in a mental institution would seem like a recipe for disaster, but here it is also used as an opportunity to lightly explore some aspects of the human condition. An inexperienced but aspirational, if not exactly talented, director (Lewis) is given the task of putting on a variety show for the hospital's aloof administrator (Tony Llewellyn-Jones; Picnic at Hanging Rock), his like-wise \u0091caring' colleagues (excepting Colin Friels as the compassionate Errol) and the minister for health. Ben Mendelsohn (The Year My Voice Broke) in his mainly low-key performance as Lewis is a superb foil to the rest of the manic protagonists. An overwrought Barry Otto (Strictly Ballroom & Lilian's Story) is Roy with his rather grandiose visions who commandeers this project and coerces Lewis into rebelling against his directive, to stage the opera instead. Mark Joffe's Australian bawdy and riotous romp is played unashamedly for laughs, very much in the style of `Strictly Ballroom' and `Adventures of Priscilla, Queen of the Desert', rather than `One Flew Over the Cuckoos Nest', the benchmark for films of psychiatric patients finding themselves, lacking its depths of pathos and tragedy. In fact all the various psychoses are portrayed for their potential humour and the extremeness of the asylum residents' conditions are somehow subdued, presumably by medication, to enable them to work together. The `clients' backgrounds are sketchily drawn and we are not allowed to dwell for too long on how damaged so many people become by the behaviour of others towards them. An offensive pyromaniac (David Wenham) tells us how he tortured cats and in a rare serious moment, suicidally depressed Ruth (Pamela Rabe; Sirens) is seen toying with slashing her wrists (we are told the difference between the cry for help and the sure-fire method), but the film swiftly diverts our attention. The central issue of the opera regarding double standards by men towards women's fidelity is touched upon, but not developed satisfyingly, with the examination of Lewis' own relationship and his attraction to the talented member of his cast, Julie, a recovering junkie. Meanwhile Lewis' parasitic `mate', Nick (Aden Young), his ill-advised inspiration as a director, is seen to be a pretentious buffoon with half-baked theories such as `the crucial key is to find out what sort of animal the actor is', and unsuccessfully tries to make a cuckold of him. This production is graced by the talents of two rising Hollywood stars both from Muriel's Wedding: Rachel Griffiths (Hilary and Jackie) as Lewis' girlfriend Lucy; and a reincarnated slender siren Toni Collette as Julie (who played the plump maiden Harriet Smith in the 1996 version of Jane Austen's `Emma', as well as the more dramatically challenging role of the younger Lilian in `Lilian's Story'). Her singing voice is also a revelation when she saves the show from complete collapse with her rendition of `Stand By Me', and covers the closing credits with Neil Finn's `Don't Dream It's Over'. Jacki Weaver (Picnic at Hanging Rock & Caddie) as Cherry, who has an unwelcome crush on Lewis, crosses the line from bubbly blonde to be so scarily aggressive that one wonders if she ever succeeded with her apparent nymphomania, and she also provides the vocals for some of the film's songs. Ellery Ryan's efficient cinematography can currently be seen on the small screen in the UK in the entertaining Australian adult soap `The Secret Life of Us'. Despite any reservations there might be about the suitability of the subject matter for comedy the actors eventually infuse their characters with some warmth and optimism. I found myself laughing almost inspite of myself due to the quality of the performances and some stagy comic moments that were plain silly and at times ridiculously over the top but still involuntarily forced me to smile. For instance, as things on the stage go increasingly wrong Roy and Lewis are electrocuted, Cherry is hoisted on a hook and flies over the audience's heads like some grotesque banshee, whilst Zac (Colin Hay), the off-the-wall musical accompanist, is abruptly halted in his obsessive desire to play Wagner's `Ride of the Valkyries' on an accordion, when he falls through a trap door. Some members of the cast from `Babe' also seem to have inadvertently wandered onto the wrong set, as piglets surreally crop up in various scenes. Even the disturbing comment on the automatic heavy sedation of a struggling patient (in this case the hapless Lewis mistaken for the escaped pyromaniac) is given a comic turn. Other reviewers have suggested that Louis Nowra's original stage play was more spontaneous and uproariously funny but this version, for which he wrote the screenplay, still worked for me. Balance in life is always needed and in our intolerant world where the ephemeral nature of life was brought harshly home to us all with last week's atrocities in the USA, this was a welcome tonic. If you are able to ignore the implausibility of it all, and to see a group of socially challenged individuals overcoming some of their problems to step out of themselves, if only for a brief moment on the stage, then you may still find your spirit uplifted and enjoy this as I did. I obtained a VHS (PAL) copy from The Video Shift as this is no longer available from the ScreenSound Shop.",
         "When it comes down to it, Così is a film about the right to dream and the tragedy of dreams being lost. The characters outside the institution, Lewis included, are a pragmatic lot. They have pragmatic views on life, pragmatic humor, and are cynically short of ideals. Nick, in particular, suggests that doing away with loyalty in a relationship is a valid concept, not because of any devotion to an ideal of 'free love' but simply because it does away with all the complications over infidelity. The actors, however, are far less restrained in their grips on reality, (however clichéd that may sound, trust me, these characters are not) and thus are allowed to dream. It isn't so much that they are delusional, (none really are) it's simply that they don't seem to have been indoctrinated with a grim view of reality. Roy doesn't just lie about his childhood to others, he allows himself to dream that he really did have a childhood that was remarkable and marvelous. More subtly, Henry is permitted to idolize his father in a way Nick never could. And sure enough, when the two's views on life collide, there are sparks, with Henry delivering most. Lewis, of course, must gradually progress from one to the other, but this is done in a way which is subtle and beautiful. His dream is the play itself, and he progresses from dreading his own misfortune in getting the job of making these nutcases perform a play successfully; to dreaming of making a perfect play with beautiful costumes and wonderful responses. What matters is that they dreamt of it and had the lack of sense to follow that dream. The film has a sterling wit and proceeds nicely, following the course of the patient's dreams and the friend's pragmatism and lack of dreams. (For a good contrast showing this message, check out the overdone, amazingly clichéd and unimaginative performance by Nick, and compare it to the dream laden performance of the patients.) In the end, the film is delightfully unrealistic in its applications. Plot devices do appear to be coming out of left field. But in a film about dreaming, surely that can be excused?",
         "A well-written, uniquely Australian film. Skillfully handles an ensemble cast, and has many touching moments, while avoiding over-sentimentality. While the film is a light comedy, there are tragic elements in some of the more disturbed mental patients. You come to care about each of them, but thankfully, the film doesn't try to give any simplistic \"answers\" to mental illness. Ben, Toni & Rachel all give good performances. Toni also sings a nice version of a Crowded House song over the end credits. A small film that deserves a big audience. Worth ten Hollywood blockbusters.",
         "This movie is really awesome. Someone recommended it to me since she knew I loved Muriel's Wedding and Strictly Ballroom, and I was dubious at first, then the first scene where Barry Otto acts so crazy was so funny! Toni Collette is rather dark in this movie, but eventually she shines through. I have to admit I was pulling for the characters which Toni and Ben Mendelsohn plays to get together, but I am glad that Lewis' girlfriend (played by Rachel Griffiths, another wonderful actress) finally got some sense into her head. Wonderful ending, and very hilarious at the play itself!!! Recommended.",
         "I agree with most of the reviews already posted, but would like to add that I found the characterizations to be what endeared me most to this production. I'm a recent explorer of opera and have seen movie versions of some of them. This can stand toe to toe with any movie version of an opera in terms of its ability to reach gut level. I cried when the house lights went down and the curtain up as the six on stage were transformed into something bigger than themselves and so participated in the healing mystery that mankind has been experiencing since the first dramatizations and plays were enacted.",
         "I found this film by accident the other night, occupying the late-night slot on terrestrial. I'd never heard of it, but from the first few moments of watching it - it was already 20 minutes in - I was rolling with laughter, and completely keyed-in to the fine display of ensemble acting, occasional surreal moments, lovely characterisations and brilliant humour. The film was touching too without ever being mawkish. A real treat.",
         "I caught up with this movie ten years late because I'm working my way slowly through the seminal works of David Wenham, but I'm sorry I didn't catch it sooner, as it's a very entertaining means of whiling away a couple of hours when you have the 'flu (as I did when I watched it). Quite cheered me up. Australian films often seem to be able to do that, offering as they do a slightly skewed and non-PC perspective on life. California sunshine with a British sense of humour? Sounds like paradise to me. The story is, of course, quite ridiculous, but the performances from a good ensemble cast are so engaging that the unlikely plot can be excused, especially if you have taken enough 'flu meds to knock out a cart-horse. Lewis \u0096 rather blandly played perhaps by Ben Mendlesohn \u0096 is drifting between jobs and college and obviously irritating his highly focused and perky girlfriend, Lucy (gorgeous, leggy, Rachel Griffiths) He accepts a job at the local psychiatric hospital to provide drama therapy to a group of inmates, led by opera fan Roy (the marvelous Barry Otto). Now what the hospital authorities and Lewis are envisioning is an unambitious variety show. But what Roy has in mind is no less than a production of Mozart's Cosi Fan Tutte, and he's nothing if not determined. No one can sing a note or speak Italian, but by a combination of bravado and insult, Roy talks Lewis into it and the patients start auditioning. Badly. Really badly. For those of you not familiar with Cosi Fan Tutte, basically it's Mozart's take on the perceived perverseness of the female character (it translates as \"It's like that\" or \"Woman are like that\" or something similar. You get the idea?) and it explores the idea that when let off the leash of fidelity by the absence of their lovers, women are straight after the nearest thing in trousers like a rat up the proverbial drainpipe. Alongside the main story of Mozart's opera, and the inmates' \"let's put the show on in the barn\" attitude, there runs a sub plot of whether or not Lucy can be faithful to Lewis, which is not terribly subtle, and given that the temptation on offer is the total plonker Nick (Aden Young - don't take it personally Aden), the outcome is not a complete surprise. The movie explores the themes you might expect from a film centered around a psychiatric institution; are the inmates any madder than the people outside, how do we deal with people who don't fit into our neat patterns of what is and isn't normal, how much liberty can you allow people who might be a danger too themselves as well as to others etc ? But the reason to watch this movie is to see the characterization of the patients. I'm not going to get into the ethics of whether it's moral to use psychiatric patients as fodder for humour in a movie, let's just accept that it is, and take it from there. Pamela Rabe is utterly moving as depressive Ruth, Jacki Weaver is wonderful as Cherry, a very anorexic and yobbish looking David Wenham is priceless as the pyromaniac cat burner Doug, and Paul Chubb grabbed my attention as mild mannered Henry. But the total stand out for my money was Toni Collette. I had no idea she could sing like that! She gives a marvelous performance as Julie, who is almost, but not quite, ready to leave the institution and face life and its temptations outside. Every performance I see of Toni Collette just reinforces how wonderful she is. I thoroughly enjoyed this movie. Not great, but well worth a couple of hours of anyone's time. Especially if you have 'flu.",
         "\"Cosi\" is not a comedy. It has funny moments, amusing moments, wry moments, and even one or two belly-laughs, but it is not a comedy. Just ask the pigs - and there is one of the pointers to the fact that this movie is not about being funny. This is a film about being human, and the limitations of being human; most of all, it is about transcending those limitations. The fact that the focus is on the distressed and distressing inhabitants of a nut-house (I'm not much of one for being politically correct) is to emphasize that there is no human being who is incapable of transcending their handicaps. There is romance, and awkwardness; misunderstandings abound. This film about an opera staged by the incapable is itself grand opera. Viewers, however, who are too attached to their personal world-view and their personal values, and therefore are unwilling to have their assumptions challenged, will find one or another part of this film uncomfortable. I guess that's why, overall, it doesn't seem to rate so highly. For my part, I gave it a 9/10.",
         "An interesting film that tends to slow a bit in the middle. It highlights the trivial way authorities can treat people with mental illness. Good performances from Ben Mendelsohn, Toni Collette and Colin Friels. Barry Otto keeps the viewer on their toes with his character's insistent and unpredictable nature. 80's band, Men at Work's Colin Hay gives a notable performance as the pill-popping piano player and his accordion rendition of 'Ride of the Valkyries' adds a spark to the sober humour in this film. It is a good story and worth a look."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Australian Film Finance Corporation (AFFC)",
         "Meridian Films",
         "Miramax"
      ],
      "summaries": ["Lewis is a young Sydney amateur theater director at his first experience: he is offered a job with a Governmental program for the rehabilitation of mentally ill patients in a Sydney institution for mentally ill. His project is overrun by one of the patients Roy who wants to put on stage Cosi Fan Tutte (Mozart). None of the patients in the cast is able to sing and none of them knows Italian which is the language of the libretto. Through a lot of difficulties Lewis and his cast develop a deep understanding. The play smartly adapted for the unusual cast is finally produced: lots of unforeseen situations solved 'a la crazy way'but indeed brilliantly. Great success and sad farewell of the director from his cast."],
      "budget": 0
   },
   "movielensId": 705,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-04",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Mark Joffe"],
      "runtime": 102,
      "movieId": 705,
      "title": "Cosi",
      "mpaa": "R",
      "actors": [
         "Ben Mendelsohn",
         "Barry Otto",
         "Toni Collette",
         "Rachel Griffiths",
         "Aden Young",
         "Colin Friels",
         "Jacki Weaver",
         "David Wenham"
      ],
      "imdbMovieId": "0115951",
      "originalTitle": "Cosi",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Lewis a young director get his first job directing a play at a mental hospital with the patients as the cast.  The play that is decided on is Cosi fan tutte an opera by Mozart.",
      "tmdbMovieId": 90214,
      "avgRating": 3.5,
      "releaseYear": "1996",
      "numRatings": 451,
      "posterPath": "/uQWBJJZGXnaHJ0wLZwGnXlt1rAJ.jpg"
   }
}