{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dolphin",
            "id": 630
         },
         {
            "name": "florida",
            "id": 1196
         },
         {
            "name": "florida keys",
            "id": 3546
         },
         {
            "name": "summer",
            "id": 13088
         }
      ],
      "imdb_id": "tt0116322",
      "video": false,
      "title": "Flipper",
      "recommendations": [
         9446,
         9073,
         35645,
         17414,
         13962,
         16300,
         34723,
         76171,
         20066,
         41579,
         76297,
         9263,
         7269,
         25973,
         59883,
         15028,
         1634,
         61968,
         31586,
         20551
      ],
      "backdrop_path": "/noCT2Ht5GrXAhYF41zPAj1QTEDn.jpg",
      "revenue": 20080020,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sandy Ricks",
               "gender": 2,
               "credit_id": "52fe45e19251416c91041a6b",
               "name": "Elijah Wood",
               "profile_path": "/hHzLAVspGGuPg1KW5JAEsyRvnUT.jpg",
               "id": 109,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Porter Ricks",
               "gender": 2,
               "credit_id": "52fe45e19251416c91041a6f",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dirk Moran",
               "gender": 2,
               "credit_id": "52fe45e19251416c91041a79",
               "name": "Jonathan Banks",
               "profile_path": "/s6K0lromCtmSTzuX9hig8OPiRsC.jpg",
               "id": 783,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Marvin",
               "gender": 2,
               "credit_id": "52fe45e19251416c91041a7d",
               "name": "Jason Fuchs",
               "profile_path": "/3N0WVhp5knzY6QaNKgDc2X54E1E.jpg",
               "id": 131947,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bounty Fisherman #1",
               "gender": 0,
               "credit_id": "52fe45e19251416c91041a81",
               "name": "Robert Deacon",
               "profile_path": null,
               "id": 135571,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Bounty Fisherman #3",
               "gender": 2,
               "credit_id": "52fe45e19251416c91041a85",
               "name": "Luke Halpin",
               "profile_path": "/2odOtf5dBpWloBbzoAoXSl2ZThP.jpg",
               "id": 70118,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Cathy",
               "gender": 1,
               "credit_id": "52fe45e19251416c91041a89",
               "name": "Chelsea Field",
               "profile_path": "/9NnerSpNB4Ro3f3iMRorv1uvYlA.jpg",
               "id": 27008,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e19251416c91041a75",
               "name": "Alan Shapiro",
               "profile_path": null,
               "id": 129941,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546379a80e0a2678100024c1",
               "name": "Alan Shapiro",
               "profile_path": null,
               "id": 129941,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.208149,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36355,
      "vote_count": 99,
      "budget": 25530000,
      "overview": "Sandy Ricks is sent by his mom to Coral Key, a rustic island in the Florida keys, to spend the summer with his uncle Porter Ricks. Sandy dislikes everything about his new environment until a new friend comes into his life, a dolphin named Flipper, that brings uncle and nephew together and leads Sandy on the summer adventure of a lifetime.",
      "similar": [
         36955,
         17692,
         394117,
         709,
         1907,
         660,
         578,
         82650,
         3049,
         2770,
         568,
         50546,
         15,
         122081,
         19913,
         314365,
         693,
         769,
         4347,
         332567
      ],
      "original_title": "Flipper",
      "runtime": 95,
      "poster_path": "/eq1JsckI4W8m0ozFglRLPkoopkZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Bubble Factory",
            "id": 27128,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "American Films",
            "id": 38181,
            "origin_country": ""
         }
      ],
      "release_date": "1996-05-17",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "This summer it's finally safe to go back in the water.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alan Shapiro"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Ricou Browning",
         "Jack Cowden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116322/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MTMzOTg4Nl5BMl5BanBnXkFtZTcwMDEzNDQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Hogan, Elijah Wood, Jonathan Banks | See full cast and crew »"],
      "reviews": [
         "Dolphin - cute Elijah Wood - very very cute, especially when wet and partially nekkid Paul Hogan - strangely attractive, must have been the leather bondage cuff he wore through the whole movie Plot - very silly Cute blonde - romance sub-plot highly unconvincing, clearly no girl can come between a boy and his dolphin and Elijah doesn't even make a vague attempt at kissing her, instead choosing to spend all his time fondling Flipper Ending - strangely similar to Casablanca, as Elijah says farewell to the finned love of his life... Lij: Last night we said a great many things. You said I was to do the thinking for both of us. Well, I've done a lot of it since then, and it all adds up to one thing. You're going out into that sea with your family where you belong. Flipper: eee eee eee Lij: Now you've got to listen to me! Do you have any idea what you'd have to look forward to if you stayed here? Nine chances out of ten we'd both wind up in SeaWorld. Isn't that true, Paul Hogan? Paul: I'm afraid the kid is right Flipper: eee eee eee Lij: I'm saying it because it's true. Inside of us, we both know you belong with your family. You're part of their life - the thing that keeps them going. If that pod leaves here and you're not with them, you'll regret it. Maybe not today, maybe not tomorrow, but soon. And for the rest of your life. Flipper: eee eee eee Lij: We'll always have that time under the pier. We didn't have - we lost it until you found the poison barrels. We got it back last night. Flipper: eee eee eee Lij: And you never will. But I've got a job to do, too. And where I'm going you can't follow. What I've got to do, you can't be any part of. Flipper, I'm no good at being noble, but it doesn't take much to see that the problems of one little boy and his dolphin don't amount to a hill of beans in this crazy world. Some day you'll understand that. Here's looking at you, kid. I'm so moved I may weep. In summary, approximately 5000 times better than Queen of the Damned, not quite as good as Lord of the Rings.",
         "Flipper is a good movie that you can just sit down and watch with the little ones without having to worry about shielding their eyes at any point during it. Sure it's a bit cheesey at times and the writing is not on scale with an actor of Elijah Wood's caliber, but it is an entertaining film to watch and it's nice to see him playing a somewhat normal teenager. His character Sandy does lean towards the overly obnoxious side of things in the beginning though. So much so that you know if you were in the uncle's place, you'd take him out for a midnight ocean ride and not return with him.",
         "Flipper is a nice heartwarming movie for whole family. It's obviously not a great movie, Free Willy looks much better almost in every component of film making. Possibly, at times it becomes a bit naive , and the writing and the script are not the best part of the movie, but it's a entertaining film with very good cinematography (including underwater shots) and some important moral messages. Elijah Wood proves himself one more time as an incredibly talented and underrated actor. He can make bad movie watchable, okay movie - good, good - great and great movie becomes all time classic. Paul Hogan performance also was very good and he is completely fit to his role. As I already say above, whole cinematography was very good. But underwater shots definitely is the best parts. So Flipper is a perfect way if you want to see nice, sweet and entertaining movie. If you like me become sick and tired of modern Hollywood trash, filled with sex, violence, vulgarity and profanity you most likely would like this movie. My rating: 7,7 out of 10. Feel free for mailing me about any of my comments and posts here. Sorry for my bad English.",
         "I was rather appalled to see the low rating this movie received here, personally considering it fun family fare. It revolves around a young teenager, Sandy Ricks, who is sent by his mom to Coral Key to spend the summer with his Uncle Porter. While there he befriends a dolphin named Flipper. Lots of adventures ensue amid the predictable nephew / uncle bonding as well as a little romance for Sandy with a local girl. I'm a great Crocodile Dundee fan myself so absolutely loved Paul Hogan in his role as crusty and comical Uncle Porter. For starters, he keeps an endless stock of Spaghetti-O's in his house to serve as his usual meal, heated with a blowtorch! Elija Wood, Frodo from The Lord of the Rings, appeared quite competent playing the young Sandy, a boy at first none too fond of his forced summer vacation locale. Of course the dolphin is magnificent and there are some wonderful underwater scenes. Set in the Florida Keys, it was apparently filmed in the Bahamas. This adaptation of Flipper makes great family entertainment, a sweet, sentimental, and fun movie that is infinitely superior to many of the cinematic offerings for youngsters nowadays.",
         "The 1996 take on Flipper has Paul Hogan as the nominal male lead, but the main character is actually Elijah Wood, at the exact moment between child and adult actor. The story won't surprise too many people - boy befriends dolphin, they solve the problem of missing fish and poorly dolphins by finding illegal toxic waste dumping - but it is colourful, moral, and entertaining, with lots of underwater photography and, of course, dolphins. Which is not to say that it doesn't have the odd moment which makes you roll your eyes - the hammerhead shark groaning was my favourite - but it is still a pretty good Sunday afternoon family film. Joel McNeely's music is lovely.",
         "The 1996 movie \"Flipper\" is a Hollywood remake of a popular cult television series and a few mostly forgotten films from the 1960s. My personal experience with the latter is very limited. I've only seen one complete episode from the TV show, part of an older Flipper movie, and clips of others in the saga about a kid named Sandy and his best buddy, an unnaturally intelligent (even for his species) and charming dolphin. But my experiences are enough to tell you that the core elements and spirit of the show are incorporated into this big-screen version. It's another story about a boy and his (insert animal species). And although the movie's adult star Paul Hogan commands the most interesting character, the dolphin is charming enough to recommend the movie. In this picture, Sandy (Elijah Wood) is Porter Ricks's nephew (not son as in the show) and is reluctantly sent to his uncle's seaside home for a summer after a (what else?) divorce. Sandy is all but willing to accept his three months living by the ocean until a dolphin separated from its clan following a trigger-happy boater's tirade decides to stop by his favorite pier. Sandy, of course, forms a friendship with the dolphin, whom he names Flipper. And in the end, just like with \"Free Willy,\" the plot leads up to a struggle to reunite Flipper with his kin. This big-screen version of \"Flipper\" is a little flimsy and it's more whimsical than it is consistent. And just like with Free Willy, Lassie, Old Yeller, and every other cute critter in these kind of stories, Flipper has the ability to read minds, understand English, and run an underwater bank all without any training (Confused? See the movie). But honestly, I think that is part of the appeal that the TV show had for children and that's why I think that appeal will remain for this movie. Even for this adult, these whimsical and rather implausible adventures and tactics were packed with charm and the nostalgia they stirred up was rather enamoring. Yes, a better movie would be made if they tried to make a more realistic boy-and-dolphin story. How woul a *real* dolphin from the wild react to such a situation and how would an ordinary kid not under the control of movie conventions respond? And of course it'd be better if we didn't have a hokey backstory of toxic waste and an evil hammerhead shark named Scar? Wait? Scar? A shark named Scar? Okay now, Scar is a compelling name for an evil lion or even a Comanche war chief, but a hammerhead shark? The shark is not a good villain here. It's mouth is way too small to communicate menace, the moaning sounds it makes (an impossibility for real sharks) is phony, and the special effects used to simulate it are not sufficient. But who cares? What do we expect in a \"Flipper\" movie? A cute dolphin, a simple story, and a lot of whimsical under and out-of-water adventures. We get 'em. And there are some more magical moments, such as a very splendid little sequence where Flipper swims through the depths and explores the marvels of underwater life. The underwater nature photography is quite pleasing. And although Flipper does not do anything that we haven't seen him (or Free Willy, for that matter) do before, he is quite a good-looking and charming character on the screen. But ironically, it is Paul Hogan who carries the movie along when Flipper is not on-camera. Because even though the star, Elijah Wood, is as fine an actor for this part as anyone, he doesn't have anything to do that makes him stand out as a character. His change of mood over the course of the picture, dialogue, and attitude all are familiar. So when he starts to lose our interest, it is Paul Hogan who saves the day. He just has an enormous amount of on-screen charm and charisma with all of his costars. Even the movie's most ardent detractors will agree with that. Bottom line, even though I had a lot of mixed reactions, I did modestly enjoy this \"Flipper\" movie. It's not, I say, on par with \"Free Willy\" but as far as movies about a young, troubled kid and his cetacean best friend go, this one does alright. Paul Hogan is the best element in the picture, but the dolphin is charming enough to make it worth recommending. It is best seen with young children, for it will engage them (as it did me when I was younger) and charm parents as well. And adults who grew up with the TV show will be pleased at the same time.",
         "This is loosely based on the 1960's TV series of the same name, of which I know I watched a few episodes but really have no memory of. So the movie stands alone for me. It isn't great in all honesty. It's strongest point is that it's completely family-friendly. There's nothing here that would make you hesitant about letting your kids watch this, and younger kids will especially enjoy the story of the friendly dolphin as he interacts with his human friends. That may also be the biggest weakness of the movie, mind you. It's yet another cutesy animal story that makes wild animals seem - well - less than wild, and in that sense perhaps dishonours the wild animals in the process. I'm not an animal rights fanatic, but I do think it's better for kids to see wild animals as they really are as opposed to these manufactured \"wild\" scenes. The story isn't particularly strong, with the relationship between Flipper the dolphin and Sandy (Elijah Wood) being the backdrop to a larger environmental story revolving around the illegal dumping of toxic waste. Paul Hogan appears as Sandy's uncle Porter, a fisherman in Coral Key, Florida who takes Sandy in for the summer. Jonathon Banks plays another take on the caricature of the requisite evil character - in this case, the one who kills Flipper's dolphin companion at the beginning of the movie, tries to do away with Flipper himself, tries to kill Sandy in the open ocean and is ultimately revealed to be the evil toxic waste dumper. An unbelievably evil character in other words. So, the story is lacking, although the underwater photography featuring dolphins and also at least one hammerhead shark is pretty well done, and - to reiterate the strongest part of this movie - you have to like the family-friendliness of it.",
         "Universal Studios version of \"Flipper\" (1996) is a great heartwarming film for the entire family with good values and sentimentality. It is the story of Sandy Ricks, a teenager from Chicago who reluctantly spends his vacation with his Uncle Porter Ricks in the Bahamas. This ultimately changes the teenagers life and he grows up in the process. He learns to appreciate nature and to have a respect for the environment. I grew up in the 1960's and the NBC television show \"Flipper\" was my favorite childhood show. Elijah Wood is perfectly cast as a 1990's Sandy Ricks and gives an excellent performance. As much as I liked the NBC television show and MGM theatrical feature films with Luke Halpin as Sandy in the 1960's I liked this feature the best! I feel Elijah Wood is the best Sandy Ricks. With respect to Luke Halpin I feel Elijah Wood has more of a range of acting talent and emotes more as an actor which makes his performance excellent and more believable. I think Elijah Wood is the best young actor working today in films. Director Alan Shapiro also wrote the screenplay and has done an excellent job as both writer and director of this film. Paul Hogan gives a comical and likable performance as Sandy's Uncle Porter Ricks. Mr. Hogan's performance perfectly offsets Elijah's role as Sandy. I am a big fan of underwater films. This film was beautifully shot in the Bahamas like \"Thunderball\" (1965 UA) was. The director of photography was Bill Butler A.S.C. who lensed the film \"Jaws\" in 1975. Mr. Butler is a very talented cinematographer. The underwater director of photography was Pete Romano. He did a superb job with the underwater cinematography. I enjoyed the film score by Joel McNeely. This good film score featured Crosby, Stills and Nash among other talented artists. This motion picture was shot in Panavision like \"Thunderball\" in the aspect ratio of 2.35:1 If possible try to see this film in a scope version as originally framed and visioned by Alan Shapiro and Bill Butler. Another very nice thing is that Mr. Shapiro gave the \"original\" Sandy Ricks (Luke Halpin) a small part in this remake. He portrayed Bounty Fisherman #3 in this film. This was a very kind gesture on Mr. Shapiro's part! As you can tell I am a real true fan of this film. Sadly this beautiful film was met with harsh words by the majority of movie critics. I originally saw this movie on my birthday, May 31st of 1996 in a movie theater. It meant a lot to me. I have it on numerous video versions. The VHS versions are in \"pan and scan\". The laserdisc version is \"letterboxed\" 2.35:1! I even have a VCD in 2.35:1 from Hong Kong which is \"letterboxed\". But my most prized possession is an \"original\" 16mm theatrical feature print which I will treasure for the rest of my life! Thank you Mr. Shapiro, Elijah Wood, Paul Hogan and everyone involved for making this a memorable movie for me to enjoy! P.S. I must add that the quality of the Universal DVD is superb! It is the best DVD as far as quality I have ever seen. The color and resolution is spectacular. The soundtrack is great. I think Universal must have used the same transfer for the DVD that they did for the laserdisc version. The 35mm scope print is \"mint\" and Alan's film really has a wonderful look to it. A great tribute to a wonderful film! The DVD's resolution is even superior to the laserdisc quality! It's just spectacular! Thank you Universal Home Video for the great quality control and transfer. Many thank's for doing a superb job on this wonderful family film. Also many thank's to you Alan for all your extreme kindness to me!!! It's a real honor to know you!!! (Review Revised/Updated June 27, 2005)",
         "This is a feel-good family film that very much follows the heart-warming and fun adventure elements of the 1960s Flipper TV-series. It involves teenager Sandy Ricks (Elijah Wood), who is sent by his mom to live in the Coral Key with his Uncle Porter Ricks (Paul Hogan). At first, Sandy wasn't too keen on his new home, but that soon changes when meets a dolphin named Flipper. This friendship leads to a stronger relationship between uncle and nephew fascinating adventures for Sandy. As Paul Hogan hasn't done much films since his Crocodile Dundee days, it was great seeing him in the Porter Ticks role, in which I think he gave a comical yet touching performance. Elijah Wood did a nice job portraying Sandy Ricks, and he has a touching on-screen chemistry with the wonderful dolphin. Luke Halpin, the original Sandy Ricks from the TV-series, plays one of the bounty fisherman in the movie. The story is a little slow at times, but the fun dolphin adventures make up for it. The oceanside scenery is breath-taking and beautiful, reminding you of a care-free, relaxing and therapeutic atmosphere. Overall, it is a heart-warming and innocent film that is great for the entire family and a great substitute to many of the over-the-top action and teen-flick nonsense youngsters endure. Grade B",
         "1996's remake of \"Flipper\" may not go down in history as the greatest family film of all time; however, for what it is, \"Flipper\" is still a pretty good, clean film for the whole family. It all starts when Sandy Ricks (a young Elijah Woods) is forced to spend his summer vacation with his Uncle Rick, (played by Crocodile Dundee himself, Paul Hogan) in the Flordia Keys, since his parents have recently divorced. Unhappy and resentful at first, things change for Sandy when he comes across that lovable and friendly dolphin, Flipper. But its not all fun, as we soon find out there are villains at work, in the form of shady fishermen and toxic waste dumper Dick Moran (played to slimy effect by Jonathan Banks) and by a particularly hungry hammerhead shark, nick named Scar. The story is told with very solid production, in the form of Elijah Woods and Paul Hogan, who make a great pair together, as two characters who come from different worlds but ultimately become close, beautiful underwater photography of the Florida Keys, amazing dolphin choreography, and decent writing. Now, a number of people have said that this was Hollywood's attempt to cash in on the \"Free Willy\" craze that was happening at the time and I'll admit, there may very well be some truth to that. However, \"Flipper\" is easily able to stand on it's own flipper (couldn't resist) without any mention of \"Free Willy\", which is remarkable considering that it is a remake. The film also features a good supporting cast, with Chelsea Field as the local scientist and love interest of Rick, Jessica Wesson as local girl, Kim, Jason Fuchs as Marvin, a shy genius, and in small role, Isaac Hayes as the town sheriff. It may not be \"Free Willy\", but that doesn't mean \"Flipper\" isn't worth watching. 8 out of 10."
      ],
      "genres": [
         "Family",
         "Adventure"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "American Films",
         "Bubble Factory, The"
      ],
      "summaries": ["Sandy Ricks is sent by his mom to Coral Key, a rustic island in the Florida keys, to spend the summer with his uncle Porter Ricks. Sandy dislikes everything about his new environment until a new friend comes into his life, a dolphin named Flipper, that brings uncle and nephew together and leads Sandy on the summer adventure of a lifetime."],
      "budget": 25530000
   },
   "movielensId": 711,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-17",
      "dvdReleaseDate": "2004-01-20",
      "directors": ["Alan Shapiro"],
      "runtime": 95,
      "movieId": 711,
      "title": "Flipper",
      "mpaa": "PG",
      "actors": [
         "Elijah Wood",
         "Paul Hogan",
         "Jonathan Banks",
         "Jason Fuchs",
         "Robert Deacon",
         "Luke Halpin",
         "Chelsea Field"
      ],
      "imdbMovieId": "0116322",
      "originalTitle": "Flipper",
      "genres": [
         "Adventure",
         "Family"
      ],
      "youtubeTrailerIds": ["YQRbTNN-jNE"],
      "plotSummary": "Sandy Ricks is sent by his mom to Coral Key, a rustic island in the Florida keys, to spend the summer with his uncle Porter Ricks. Sandy dislikes everything about his new environment until a new friend comes into his life, a dolphin named Flipper, that brings uncle and nephew together and leads Sandy on the summer adventure of a lifetime.",
      "tmdbMovieId": 36355,
      "avgRating": 2.67027,
      "releaseYear": "1996",
      "numRatings": 2543,
      "posterPath": "/eq1JsckI4W8m0ozFglRLPkoopkZ.jpg"
   }
}