{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dictatorship",
            "id": 7606
         },
         {
            "name": "woman reporter",
            "id": 11289
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0110712",
      "video": false,
      "title": "Of Love and Shadows",
      "recommendations": [
         43777,
         128149,
         80540,
         56742,
         193523,
         8772,
         58156,
         2002,
         8443,
         120194,
         17286,
         44772,
         84308,
         46226,
         32720,
         170767,
         25563,
         128215
      ],
      "backdrop_path": "/gIpDbIYiF7BVmVuuvG4rhUyLgs4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Irene",
               "gender": 1,
               "credit_id": "52fe48a09251416c750adfa5",
               "name": "Jennifer Connelly",
               "profile_path": "/xTpRRy9hwk4E2uypuQ30iqt2W2W.jpg",
               "id": 6161,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Francisco",
               "gender": 2,
               "credit_id": "52fe48a09251416c750adfa9",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Beatriz",
               "gender": 1,
               "credit_id": "5397f4540e0a266dbb00c024",
               "name": "Stefania Sandrelli",
               "profile_path": "/8KHaSvJ1mwBFMQ4J6r9h3FC4dSU.jpg",
               "id": 34027,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jose",
               "gender": 2,
               "credit_id": "5397f46e0e0a266dbb00c02f",
               "name": "Diego Wallraff",
               "profile_path": "/iXR5WZ4FslX7IsfmV5g9orWEZTA.jpg",
               "id": 24609,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Gustavo",
               "gender": 0,
               "credit_id": "5397f4940e0a266dce00bf3a",
               "name": "Camilo Gallardo",
               "profile_path": null,
               "id": 1012974,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mario",
               "gender": 0,
               "credit_id": "5397f4b90e0a2642a8000a51",
               "name": "Patricio Contreras",
               "profile_path": "/aV4YFi2uogQD1bRAxzzxvThtxy8.jpg",
               "id": 71408,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Professor Leal",
               "gender": 0,
               "credit_id": "5397f4d50e0a266dce00bf43",
               "name": "Jorge Rivera López",
               "profile_path": null,
               "id": 99115,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Hilda Leal",
               "gender": 0,
               "credit_id": "5397f4e90e0a266dce00bf4e",
               "name": "Angela Ragno",
               "profile_path": null,
               "id": 1084293,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "56d777afc3a3681e3901aed9",
               "name": "Betty Kaplan",
               "profile_path": "/3eiaVTXHzHggD8OA8qzR4Gsigfj.jpg",
               "id": 1585647,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "53f5a7880e0a267f890047e0",
               "name": "Isabel Allende",
               "profile_path": "/6RQfmb1BXptwovUA5uFO7c6y8S.jpg",
               "id": 23330,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53f5a7970e0a267f8d0048a4",
               "name": "Donald Freed",
               "profile_path": null,
               "id": 1355204,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.18597,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 90148,
      "vote_count": 13,
      "budget": 0,
      "overview": "Irene is a magazine editor living under the shadow of the Pinochet dictatorship in Chile. Francisco is a handsome photographer and he comes to Irene for a job. As a sympathizer with the underground resistance movement, Francisco opens her eyes and her heart to the atrocities being committed by the state.",
      "similar": [
         258480,
         112160,
         858,
         141,
         244772,
         634,
         401898,
         242224,
         370663,
         43923,
         437557,
         297762,
         27586,
         2255,
         11216,
         1523,
         12162,
         1359,
         9741,
         9762
      ],
      "original_title": "Of Love and Shadows",
      "runtime": 103,
      "poster_path": "/uM64Zehu9W5Ix237Hz3WEl9a6i5.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1994-05-10",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "Surrounded by danger, they'll risk everything for freedom!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Betty Kaplan"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Isabel Allende",
         "Donald Freed"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110712/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwOTMxMjk4OV5BMl5BanBnXkFtZTcwMzUzODkyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Antonio Banderas, Jennifer Connelly, Stefania Sandrelli | See full cast and crew »"],
      "reviews": [
         "The previous comment sounded to me like they weren't criticizing the movie. Sounded more like they were bashing the Country and the author...I found it was a good movie. I've seen better, but it's not at the bottom of my list, and neither is The House Of The Spirits. Of Love and Shadows is a book that explains in the background what was going on politically in Chile and it was a way to kind of get it out in the open - I don't know...create an awareness. I admit, it must be difficult to translate an amazing novel into a movie and have it come out the same. I find that Isabel Allende's books are absolutely fabulous!! She is a great story teller. And for this particular one, I also think you may need to have a bit more knowledge of what had happened in Chile to have a better understanding of what the story is about. The Movie - I enjoyed it...it deserves to be seen at least once, but...maybe..to get a better sense of what it's all about, it's best to read the book first! Maybe if this film was shot in Chile it would have been different using Chilean Actors that do an amazing job anyway. The movie may have been better. But I am glad that Antonio Banderas and Jennifer Connelly decided to be a part of this movie. Both are great actors that tried to give the movie feeling...",
         "Irene (Jennifer Connelly) is a daughter of privilege in 1970's Chile. It is a time of government repression and citizens of Chile are turning up missing, never to be found. Working as a magazine writer, Irene meets photographer Francisco (Antonio Banderas). Francisco is a passionate young man with a dangerous secret: he is working for an underground movement investigating the government's actions. Although Irene is engaged to a man in the military, she falls in love with Francisco and joins him in his underground activities. Will they be able to expose the misdeeds of the government and remain alive? This movie is based on a novel by Chilean-born author Isabel Allende. Her political views are to the left; yet, this film is not totally biased. Real events occured under Chilean leader Pinochet, who eventually was deposed. This movie, therefore, offers a glimpse into the horrific tortures and deaths at the hands of the Chilean government in the seventies. Not as exciting as it could be, the film nevertheless provides enough drama and pathos to touch the hearts of its viewers. Connelly and Banderas give fine performances that resonate. Recommended for fans of the two leads as well as those who admire films with a political agenda.",
         "But not much else. As a story, it is something of a docudrama -- part history and part love story. The historical part must be taken for granted, as the author maintains high credentials as a witness. The love story is just so-so, however -- predictable and depending for its attractiveness on a good deal of gratuitous nudity. We see here rather more of Antonio Banderas than is probably necessary. Ditto the Chilean army officer. The main weakness of the film is that it is not presented in Spanish with English subtitles. To have Spanish-speaking actors mouthing English is extremely distracting, and to my mind unforgivable in view of the locale and the facts of its production. Jennifer could surely have been taught to fake a little Español with some artful dubbing later on. Still, one has to appreciate the scenery and the score, played apparently by a full symphony orchestra somewhere in Bratislava or the like. As a travelogue it succeeds admirably, even if it is on the sunrise side of the Andes and not the other way round.",
         "The subject matter of this movie couldn't be anymore serious. This movie failed because the studio advertised this as a passionate movie between Antonio and Jennifer. The poster and box cover for the movie shows them engaged, half naked in the middle of an act of love. In the first 10 minutes of the movie, we see some kind of a foreplay situation between Jennifer and her cousin / lover. Then, the climax of the movie has nothing to do with the investigation they had been on. The movie peeks when both Antonio and Jennifer make love. While the one scene has been said to be the only good part of the movie, I must agree that the studios allowed the audience to believe that this movie was going to be packed with sex, sex, nudity, and more sex. You can't sell a box of cereal with a naked woman on the cover and then have the cereal filled with little marsh mellow religious figures of Christ and Saint Peter and Paul. Much like the cereal, the movie has its moments but fails to hold an audience because everybody is waiting for the sex scene. The movie tries to get serious but we are overwhelmed by the eye candy that is Jennifer and Antonio that we can't wait for the passion to take over.",
         "If you don't go by the poster of the movie(which portrayed it to be a passionate love story), you'd enjoy the movie. I haven't read the novel and I was engrossed very quickly with what was shown in the movie. The year is 1973 and Chile has been taken over by military coup. An woman talks to Francesco(a phychiatrist) about the nightmares she is having after military has tortured her and her husband. Her voice breaks as she says \"one after another..again and again\" Irene (Connelly) belongs to the upper class, she is innocent, engaged to her cousin, a military captain since childhood. She also publishes a magazine. She employed Francesco(Banderas) who is now out of job as the photographer. Francesco and his family are totally against the human rights violation that occurs. His brother is a priest in church who tries to prevent things. When the magazine crew went to interview Evangelina, a magical woman, military comes and interferes. Evangelina with superhuman strength picks up military commander Ramirez and throws him away. They left. Shortly after, Evangelina is taken by military and she has disappeared. Irene and Francesco tried to find out where Evangelina is. In the process, their lives and others take a complete turn-oil. And expectedly they fall in love. The scenes of military regime is very well depicted. The arrogance of their police, the fear among civilians are very real and touching. Of memorable scenes are Evangelina's friend in military who is torn between his job needs and the human ways.",
         "This was a great film! Granted, the acting may not be tip-top and the casting may have its flaws, but I thought that this was a great film, and it's about time we have more films bring to life the atrocities that occurred in Chile. By acquiring more knowledge about the world around us, we can try to ensure that we don't repeat the same mistakes over and over. I really thought the film was great!",
         "Isabel Allende is not the greatest writer of all time, still she has a magic touch, of that there is no doubt..A woman that has fought all of her life, gives us the pleasure to enjoy her experience in this beautiful story (as are all of her stories), that brings together two great actors (Antonio and Jennifer), and almost makes us want to be part of it,despite the danger..these were the true heroes of our time, i think that's what she's really stating, by using simplicity as a way of being, a way of life, and showing us that it can also be beautiful.. A true love story.",
         "You'd think that a rich subject such as a nation suffering under the military dictatorship of General Augusto Pinochet would have inspired the film makers to do much more than this. But the film chose some of the worst angles to treat; a lady with magical powers, the discrimination against homosexuals and an unbelievable love story between the beautiful reporter and her asexual photographer. The characters are daft and uninteresting with some of the weirdest unexplained 180 degrees turns you could imagine. By the end of the film all the bad guys have turned into good ones and the evil just jumps out of nowhere at perfect moments to catch the goodies doing their deeds and wreak havoc on them! The entire thing looked cheap, especially with the sound mixing that brings to mind those dubbed Mexican soup operas. As for the acting, well, you have to see to believe. The dumb lines were a perfect match for those exaggerated facial expressions and sudden outbursts that make you want to slap the actors senseless out of frustration. Special slapping is needed for Bandiras who put another one of his admirably bad performances in here. If there is any reason to watch the film, it would be the magnificent Jennifer Connelly. She was lost in a sea of stupid lines and stupid actors around her but still she managed to salvage some of it with her excellent acting abilities and expressive face. Her heavenly beautiful breasts is exposed in a love making scene and a quick shot in the hospital while being revived. It is silly to watch a movie just because a gorgeous actress is nude in it, but this is the only thing worth watching in it. Come to think about it, even the makers knew this and put the lovemaking scene with much of Jenny's exposed body on the poster and DVD cover! Very bad.",
         "In this movie a young (24) Jennifer Connelly plays a Spanish speaking lady, Irene, in Chile, working as a magazine reporter, during the time when the country was being ruled by a military dictatorship. A perpetual \"state of emergency\" has been declared, and opposition are hunted down, killed, and the bodies hidden. Irene has been engaged since they were children to her cousin, Gustavo. While they carry on erotically like young lovers anywhere, there does not appear to be the mystery and passion of \"discovered\" love. Along comes Irene's discovery, Francisco (Antonio Banderas, 34), trained as a Psychologist but now trying to get a legitimate job as a photographer. Irene hires him. Francisco and his family, which includes a priest, are out to expose the crimes of the military regime, and is able to get Irene involved in an investigation. Breaking out of her thus-far sheltered life, she is anxious to help get to the bottom of all this, while she is realizing that she doesn't love Gustavo. SPOILERS. As crimes are being exposed and it becomes known that Irene is involved, she is gunned down in the street, but manages to survive. Military is watching the hospital, but after she has shown some improvement she is sneaked out, she and Francisco manage to stay for 10 days at a spa in the mountains where she can gain strength, and they leave on horseback as the military show up looking for them. They eventually get to Spain, where they live for 15 years, and are able to return to Chile in 1989, after a democracy is restored.",
         "This is very good film, accurate depiction of historical events of this South American country. A must see. Writer Isabel Allende has done a fantastic recount of many facts and events of the Dictatorship that plagued this country. Jennifer's part is played in a very natural, and sexy portrait, of the fresh, sexy, and Latin American spirit of people, with ideals, and lust for life and freedom. Antonio Banderas, still not a superstar, plays the Dr, and new photographer, with convictions. He does a great job on this film, and is nice to see a still not Hollywood viced acting, and superstar status actor, doing a pretty good job. The director of photography captures the spirit of a time and era, where the air was thick, and people were afraid. The \"ejercito\" was omnipresent at every moment, in and out of people's life's. A must see film, for lovers of foreign films, and to followers of Latin American History."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Aleph Producciones S.A.",
         "Argentina Espanola",
         "Miramax"
      ],
      "summaries": ["Irene is a magazine editor living under the shadow of the Pinochet dictatorship in Chile. Francisco is a handsome photographer and he comes to Irene for a job. As a sympathizer with the underground resistance movement, Francisco opens her eyes and her heart to the atrocities being committed by the state."],
      "budget": 0
   },
   "movielensId": 713,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1994-05-10",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["Betty Kaplan"],
      "runtime": 103,
      "movieId": 713,
      "title": "Of Love and Shadows",
      "mpaa": "R",
      "actors": [
         "Jennifer Connelly",
         "Antonio Banderas",
         "Stefania Sandrelli",
         "Diego Wallraff",
         "Camilo Gallardo",
         "Patricio Contreras",
         "Jorge Rivera López",
         "Angela Ragno"
      ],
      "imdbMovieId": "0110712",
      "originalTitle": "Of Love and Shadows",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["0uijz9WWE3Q"],
      "plotSummary": "Irene is a magazine editor living under the shadow of the Pinochet dictatorship in Chile. Francisco is a handsome photographer and he comes to Irene for a job. As a sympathizer with the underground resistance movement, Francisco opens her eyes and her heart to the atrocities being committed by the state.",
      "tmdbMovieId": 90148,
      "avgRating": 3.45238,
      "releaseYear": "1994",
      "numRatings": 147,
      "posterPath": "/uM64Zehu9W5Ix237Hz3WEl9a6i5.jpg"
   }
}