{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0112546",
      "video": false,
      "title": "Mouth to Mouth",
      "recommendations": [
         79474,
         115485,
         85769,
         5282,
         47792,
         47549,
         121652,
         80919
      ],
      "backdrop_path": "/b5s15on9amjyeOiXyGCTa5Aw6uw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Víctor Ventura",
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092f3f",
               "name": "Javier Bardem",
               "profile_path": "/hbr72lORyRjm8w9ujU5OA7YDzG.jpg",
               "id": 3810,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Amanda",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092f43",
               "name": "Aitana Sánchez-Gijón",
               "profile_path": "/wh3P0RqrbWVRxTT3k1Sg4jXhC0Y.jpg",
               "id": 37946,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bill / Ricardo",
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f47",
               "name": "Josep Maria Flotats",
               "profile_path": null,
               "id": 235221,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Angela",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092f4b",
               "name": "María Barranco",
               "profile_path": "/h01wRNz8Jmx1sZOg6AEIuvMG1pt.jpg",
               "id": 25025,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sheila Crawford",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092f4f",
               "name": "Myriam Mézières",
               "profile_path": "/uf6IEhqwSSB6NVoqZIQu78MspiD.jpg",
               "id": 73698,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092f53",
               "name": "Kiti Mánver",
               "profile_path": "/3xChWWE9LTCspCqWbxZrZmixXRY.jpg",
               "id": 16975,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Belvedere",
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092f99",
               "name": "Jordi Bosch",
               "profile_path": "/b0t6hoD5v8jV9lUtDVUxlrOEsKh.jpg",
               "id": 43329,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Debra Reynolds",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092f9d",
               "name": "Tres Hanley",
               "profile_path": null,
               "id": 346167,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Oswaldo (as Sam MacKenzie)",
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092fa1",
               "name": "Alastair Mackenzie",
               "profile_path": "/jGgIabBwHh4Ixp2rHCJCkngZXfF.jpg",
               "id": 39970,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Raúl",
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092fa5",
               "name": "Fernando Guillén Cuervo",
               "profile_path": "/5SlkprJPw5t8x3Y883zsi5PbQKH.jpg",
               "id": 149307,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Tanya",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092fa9",
               "name": "Candela Peña",
               "profile_path": "/vXsuroxcILYbOoI4fufchaSrsIP.jpg",
               "id": 958,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Madre de Raúl",
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092fad",
               "name": "Amparo Baró",
               "profile_path": "/z3KRYWJrzsFpZOis5aEu49pI8YR.jpg",
               "id": 59141,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092fb1",
               "name": "Emilio Gutiérrez Caba",
               "profile_path": "/flK5yHznlXYeArnsJ10ikg2QWPY.jpg",
               "id": 105161,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Madre de Luci",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092fb5",
               "name": "Asunción Balaguer",
               "profile_path": "/8Vlgsey9XplXQnS9bz2wHKN0zTB.jpg",
               "id": 24922,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Padre de Luci",
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092fb9",
               "name": "Germán Cobos",
               "profile_path": "/kRytYOjFXACQ7FEP4lG0uv6WXTi.jpg",
               "id": 104064,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Padre de Victor",
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092fbd",
               "name": "Saturnino García",
               "profile_path": "/3Kxkf8nEdYCd4QDzjw7PA4wDFhf.jpg",
               "id": 93831,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Madre de Víctor",
               "gender": 1,
               "credit_id": "52fe467ac3a368484e092fc1",
               "name": "Pilar Bardem",
               "profile_path": "/aPtXpY9memp6SQvAVZpzBbysI9U.jpg",
               "id": 3812,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f59",
               "name": "Manuel Gómez Pereira",
               "profile_path": "/bLLbJiuEdSqfOi9Ia2TQPjzshAZ.jpg",
               "id": 108499,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092f5f",
               "name": "Juan Luis Iborra",
               "profile_path": null,
               "id": 125068,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f65",
               "name": "Joaquín Oristrell",
               "profile_path": "/kunRcZMagGoTsZW2r3WoShD86vK.jpg",
               "id": 43317,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f6b",
               "name": "Naomi Wise",
               "profile_path": null,
               "id": 1005620,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f71",
               "name": "Bernardo Bonezzi",
               "profile_path": null,
               "id": 27045,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f77",
               "name": "Juan Amorós",
               "profile_path": null,
               "id": 1005622,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f7d",
               "name": "Manuel Gómez Pereira",
               "profile_path": "/bLLbJiuEdSqfOi9Ia2TQPjzshAZ.jpg",
               "id": 108499,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f83",
               "name": "Guillermo Represa",
               "profile_path": null,
               "id": 26016,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe467ac3a368484e092f89",
               "name": "Juan Luis Iborra",
               "profile_path": null,
               "id": 125068,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f8f",
               "name": "Luis Vallés",
               "profile_path": null,
               "id": 1156953,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe467ac3a368484e092f95",
               "name": "Nereida Bonmatí",
               "profile_path": null,
               "id": 1156955,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.482529,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 62364,
      "vote_count": 6,
      "budget": 0,
      "overview": "For financial reasons an unemployed aspiring actor works for a phone-sex enterprise. One day he receives a call from the mysterious wife of one of his best clients.",
      "similar": [],
      "original_title": "Boca a boca",
      "runtime": 106,
      "poster_path": "/eOwQxoHcR1UGlwiqvUaaiC8F9DZ.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "1995-11-10",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Manuel Gómez Pereira"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Manuel Gómez Pereira",
         "Juan Luis Iborra"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0112546/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2OTkwODU3NV5BMl5BanBnXkFtZTcwOTgyNTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Javier Bardem, Aitana Sánchez-Gijón, Josep Maria Flotats | See full cast and crew »"],
      "reviews": [
         "Take a struggling actor (Javier Bardem downplaying his good looks and normal masculine appeal for a 'nebbische'-looking character) who becomes a phone sex operator (in a wonderfully sleazy phone sex operation), and then becomes involved with a (male) client, pretending to be gay. Add in an excellently created agent, a self-centred director (brilliantly played by Alistair Mackenzie), a love interest or two, lots of fun and laughs. Roller-coaster with the film when it becomes 'dark', becoming and spoofing 'film noir'. All of these 'archetypes' have been set up and spoofed before. And here is a Spanish film which does so, with humour and fun: simultaneously sending up its own industry and that of Hollywood. It's stunning! This is an inventive, witty, fun film! It's very similar in intent to the recent 'Unconditional Love' aka 'Who killed Victor Fox?' (which cannot be boxed into a specific genre of movie), where the ensemble acting, the lead acting, and quite quirky script work: in a strange way, this is a feel-good movie: one can sense the actors really enjoying themselves. And so does the audience. It is a film worth seeing; a Spanish spoof of Hollywood, of various film genres (and add in here plot convolutions, homage to other movies (often with a 'twist'), of beginnings and endings (no spoiler here, but in my opinion both beginning and ending are so true to the film's intention)and a fun take on actors and directors. It's not at all a 'heavy' film. Director Manuel Gomez Pereira has the script nicely sewn up, and his direction (while never heavy handed) is tight, light and snappy. He has a great cast of actors, led by Javier Bardem (who can never really convince one that he is a nerd and unsexy!) and Maria Barranco, who gives a deft performance as female lead. There are brilliant cameo roles, and some amusing American (language) lines counterpointed with the Spanish dialogue. This film works! It's an absolute gem, a treat: see it....",
         "I watched Boca a Boca four times in one weekend! I kept inviting people over to see this hilarious Spanish comedy. Javier Bardem (previously of Jamon, Jamon and Carne Tremula) gives an outstanding performance as Victor, a struggling Spanish actor trying to find the road to stardom and making ends meet inbetween. His character seems something akin to T.V.'s Ally McBeal: melodramatic, desperate for love, finding love in all the wrong places, and tripping over himself (literally) constantly. The plot seems to unfold and unfold relentlessly, completely unpredictable and original: the movie never drags! All the characters are full of life and no scene seems to end without something to make you roar with laughter. All mocking of stereotypes in this movie is done without any sense of hostility, allowing for scene after scene of endless wit, without offending anyone. My highest recommendation for Boca a Boca!!",
         "That was a great film, showing that in today's life, money is almost everything. And that's not good. Everything is killed in the name of profit and earning money, according to the directions of modern marketing and management.The hero of the film, a poor boy from Carthagena, tries to earn to live, until the great job he's dreaming: the first role in a great movie. In order to do so, he works in phone sex but he falls in love, in the middle of an unbelievable story with murders, wife cheatings ,money arrangement and a sweet gay.... The rest of that very sweet and at the same time, bitter movie, watch them on screen.....Have fun.....",
         "Boca a Boca is one of those rare films that is able to satisfy the viewer on all fronts. Film buffs will be amused with its satire of Hollywood. The film follows an aspiring actor who is forced to take a job as a phone-sex operator. From there the movie becomes a mystery/romance/comedy that will leave audiences satisfied. 10/10, I highly recommend this film!",
         "This movie is a fun, sexy and interesting comedy. Javier Bardem is adorable, gullible, funny and loving. What an actor! In this movie Bardem plays an actor who is required to test his acting talents out on everyone he meets. I picked this movie on a whim, and I am pleased that I did.",
         "It's not an American film, there is plenty of English in it, but if you don't understand Spanish you gotta turn on the subtitles; fast paced movie, never really loses you, a mix of comedy, love, struggle and many different sides of Javier Bardem's brilliance. A must for any Bardem collector! I settled for the 15 year old VHS tape of this movie, played fine, and it was a lot cheaper than trying to obtain the DVD of this movie as those are anywhere from $50 to $150 on amazon or ebay. NO way would spoil this movie for any fan, it's worth while! I have about 12 Bardem movies now. We became fans after we saw the James Bond movie he was in. We were curious who he was. No we have over a dozen movies from Jamon Jamon to Goya's Ghosts, Love in a time of Choelera and Vicky Christina Barcelona. He has made a lot of movie in this century. In the 1990's he made movies to, and they are HILARIOUS! Just hard to obtain and some are trickier to watch. The Dancer Upstairs, Before the Nite Falls, Second Skin and Live Flesh are other mandatory Bardem movies. The Dancer Upstairs is Incredible also. Start Collecting!",
         "I missed the opening credits, so I didn't know whose film this was. But by the end I was convinced it must be Pedro Almodovar's. The film has the pace and plot twists typical of Almodovar. The dialogue sounded like something out of \"Women on the Verge...\". Sort of Billy Wilder on speed. The only thing that was different from an Almodovar film was the look of the sets, especially the lighting and the colors. But still, I was very surprised to find it wasn't Almodovar's. I enjoyed it very much and plan to watch it again, this time from beginning to end.",
         "Typical story of actor down on his luck, taking menial jobs to support oneself. This one takes a turn where the protagonist ends up working for a 1-900 sex line, and there starts an often madcap story. A good, biting wit in the script and some good performances makes BOCA A BOCA (MOUTH TO MOUTH) very worthwhile. Recommended.",
         "American films have definitely influenced European Filmmakers and \"Mouth to Mouth\" seems to be an homage to films like \"Get Shorty\" and to anything that DePalma or Hitchcock directed. This story has an aspiring actor named Victor Ventura (Javier Bardem) who dreams of being in American films and in an act of desperation to pay his bills he takes a job as a phone sex operator. One of his regular callers is a man named Bill (Jose-Maria Flotats) who is a closet homosexual and married. One night Victor decides to meet one of his female callers named Amanda (Aitana Sanchez-Gijon) and has a night of passion. As it turns out Amanda says she is married to Bill but Victor thinks he loves her! She asks him to help set up Bill for their divorce and he agrees. When Victor and Bill are alone a hitman tries to kill them and it turns out that Amanda is not married to Bill. Both had been set up. The rest of the film has the whole bunch of them trying to figure out who is behind all of this and the film becomes a real comedy. The plot and situations are familiar and all the actors are engaging enough especially Bardem who shows real comedic ability but I found the whole story a little familiar. *****SPOILER ALERT***** Another part of the film that I think does not work is the forced romance between Victor and Amanda. Even after Amanda has been found out as a fraud and works in a sleazy club, Victor still has some affection for her. This part of the story rings false, I think it hurts the film and Victor is just to intelligent for such an obvious and contrived plot device. I understand that a lot of what happens in the film is suppose to be tongue in cheek and to imitate and poke fun at some of the American films that it spoofs and thats fine. But I think for American audiences we're just a step or two ahead of the joke.",
         "The director tries for an outrageous sex comedy in the manner of Almavodar, but comes up with a mild screwball amusement. Javier Bardem is neither sexy nor amusing, although he tries very hard. He's not a funny guy. One central plot line revolves around a closeted gay man whose wife is having an affair with his business partner. The character is a sad reminder of the tormented closet homosexuals from movies of the 60s (e.g., William Windom in \"The Detective\"). Even in a farce, the character must be remotely believable. Is it possible that in the enlightened Spain of the 1990s, such a pitiful creature could still exist? Even in a farce, the premise must be believable. Another plot line involves Bardem trying to get a part in an American movie and become an international superstar. The satire regarding the American view of Spanish men is obvious and puerile. It's meant for hip Spanish twenty-somethings so they can knowingly smirk about the superiority of Spanish culture to that of Hollywood. But the slapstick is mere juvenilia, without much genuine humor. The American view of Spanish men as hot Latin lovers went out with the death of Valentino (yes, I know, he was Italian, but Americans don't know the difference--therein lies something to satirize)."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Bocaboca Producciones",
         "Sociedad General de Televisión (Sogetel)",
         "Sogepaq"
      ],
      "summaries": ["For financial reasons an unemployed aspiring actor works for a phone-sex enterprise. One day he receives a call from the mysterious wife of one of his best clients."],
      "budget": 0
   },
   "movielensId": 717,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1995-11-10",
      "dvdReleaseDate": "2003-09-02",
      "directors": ["Manuel Gómez Pereira"],
      "runtime": 106,
      "movieId": 717,
      "title": "Mouth to Mouth",
      "mpaa": null,
      "actors": [
         "Javier Bardem",
         "Aitana Sánchez-Gijón",
         "Josep Maria Flotats",
         "María Barranco",
         "Myriam Mézières",
         "Kiti Mánver",
         "Jordi Bosch",
         "Tres Hanley",
         "Alastair Mackenzie",
         "Fernando Guillén Cuervo",
         "Candela Peña",
         "Amparo Baró",
         "Emilio Gutiérrez Caba",
         "Asunción Balaguer",
         "Germán Cobos",
         "Saturnino García",
         "Pilar Bardem"
      ],
      "imdbMovieId": "0112546",
      "originalTitle": "Boca a boca",
      "genres": [
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "For financial reasons an unemployed aspiring actor works for a phone-sex enterprise. One day he receives a call from the mysterious wife of one of his best clients.",
      "tmdbMovieId": 62364,
      "avgRating": 3.20408,
      "releaseYear": "1995",
      "numRatings": 98,
      "posterPath": "/eOwQxoHcR1UGlwiqvUaaiC8F9DZ.jpg"
   }
}