{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "servant",
            "id": 964
         },
         {
            "name": "time travel",
            "id": 4379
         },
         {
            "name": "clumsy fellow",
            "id": 5347
         },
         {
            "name": "middle ages",
            "id": 41406
         },
         {
            "name": "nobility",
            "id": 177998
         }
      ],
      "imdb_id": "tt0108500",
      "video": false,
      "title": "The Visitors",
      "recommendations": [
         10353,
         33701,
         11183,
         14645,
         56715,
         17350,
         2899,
         13043,
         21435,
         760,
         8290,
         9421,
         38277,
         182219,
         248705,
         8265,
         2395,
         14257,
         9564,
         15152
      ],
      "backdrop_path": "/br7ixyPHNpBJt96j5f6vcKbRkdQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Godefroy de Papincourt",
               "gender": 2,
               "credit_id": "52fe44799251416c75036023",
               "name": "Jean Reno",
               "profile_path": "/cdsN5efCYGQWlPrj7vFlZRBTR16.jpg",
               "id": 1003,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Frénégonde de Pouille / Béatrice de Montmirail",
               "gender": 1,
               "credit_id": "52fe44799251416c7503602d",
               "name": "Valérie Lemercier",
               "profile_path": "/hPUIFiIfMaQvpNmPvAVDxOQuZBS.jpg",
               "id": 62531,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Jacquouille la Fripouille / Jacquard",
               "gender": 2,
               "credit_id": "52fe44799251416c75036031",
               "name": "Christian Clavier",
               "profile_path": "/1VB7ls5ibtsklup67akj6bLbgp.jpg",
               "id": 28781,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Ginette la clocharde",
               "gender": 1,
               "credit_id": "52fe44799251416c75036035",
               "name": "Marie-Anne Chazel",
               "profile_path": "/iDfbfCk3uzlCaFypaIelkmIlhmi.jpg",
               "id": 64913,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Jean-Pierre",
               "gender": 0,
               "credit_id": "52fe44799251416c75036039",
               "name": "Christian Bujeau",
               "profile_path": "/32r6vqwcLjxfPQwjF2cxwfQVIy4.jpg",
               "id": 24877,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Fabienne Morlot",
               "gender": 1,
               "credit_id": "52fe44799251416c7503603d",
               "name": "Isabelle Nanty",
               "profile_path": "/bvBUBjulWm3gFiGY11BjHvX0h0J.jpg",
               "id": 2412,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Edgar Bernay",
               "gender": 2,
               "credit_id": "52fe44799251416c75036041",
               "name": "Gérard Séty",
               "profile_path": "/4BKQ4awXMhubwIsPLnXbudTXNLZ.jpg",
               "id": 39193,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Louis VI le Gros",
               "gender": 2,
               "credit_id": "52fe44799251416c75036045",
               "name": "Didier Pain",
               "profile_path": "/pCupSXZsoYgiWALZW5ph2gB1HQZ.jpg",
               "id": 38389,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Marechal des Logis Gibon",
               "gender": 2,
               "credit_id": "52fe44799251416c75036049",
               "name": "Jean-Paul Muel",
               "profile_path": "/gDc5jjzFY5OyQhX1KYKv8MGZijS.jpg",
               "id": 45447,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Jacqueline",
               "gender": 1,
               "credit_id": "52fe44799251416c7503604d",
               "name": "Arielle Sémenoff",
               "profile_path": "/8VnLKU4gyeheTUZ2uRBgelER3DB.jpg",
               "id": 239421,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Edouard Bernay",
               "gender": 0,
               "credit_id": "52fe44799251416c75036051",
               "name": "Michel Peyrelon",
               "profile_path": "/rbg7rMvqukjqn1OdtF3cYBgzugJ.jpg",
               "id": 34605,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Wizard Eusebius / Monsieur Ferdinand",
               "gender": 0,
               "credit_id": "52fe44799251416c75036055",
               "name": "Pierre Vial",
               "profile_path": "/uAVnUWmTLV1z3hhE2Li7GTDHGFE.jpg",
               "id": 134744,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Priest",
               "gender": 0,
               "credit_id": "52fe44799251416c75036059",
               "name": "François Lalande",
               "profile_path": "/i2tfJ9OYlA4SguYsUSE7VTnoti3.jpg",
               "id": 239422,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Intern Beauvin",
               "gender": 2,
               "credit_id": "52fe44799251416c7503605d",
               "name": "Didier Bénureau",
               "profile_path": "/hSkwMCRMO05jJTWQhzK6HFiy6xG.jpg",
               "id": 35966,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Freddy",
               "gender": 0,
               "credit_id": "52fe44799251416c75036061",
               "name": "Frédéric Baptiste",
               "profile_path": null,
               "id": 239423,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44799251416c75036001",
               "name": "Jean-Marie Poiré",
               "profile_path": "/nOyQke4gCSjeOFqwZItZyI8vduO.jpg",
               "id": 64909,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44799251416c75036007",
               "name": "Christian Clavier",
               "profile_path": "/1VB7ls5ibtsklup67akj6bLbgp.jpg",
               "id": 28781,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44799251416c7503600d",
               "name": "Jean-Marie Poiré",
               "profile_path": "/nOyQke4gCSjeOFqwZItZyI8vduO.jpg",
               "id": 64909,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44799251416c75036013",
               "name": "Alain Terzian",
               "profile_path": null,
               "id": 64910,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44799251416c75036019",
               "name": "Jean-Yves Le Mener",
               "profile_path": null,
               "id": 70208,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44799251416c7503601f",
               "name": "Catherine Kelber",
               "profile_path": null,
               "id": 24574,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44799251416c75036029",
               "name": "Eric Levi",
               "profile_path": null,
               "id": 64911,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.176373,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 11687,
      "vote_count": 574,
      "budget": 0,
      "overview": "This outrageous time-travel comedy follows the misadventures of a wacky medieval knight (Jean Reno) and his faithful servant when they are accidentally transported to contemporary times by a senile sorcererMayhem rules as these 12th-century visitors try adapting to the wildly confusing modern world. To avoid being stuck here for good, however, they soon begin an all-out cosmic assault on their former castle -- now a luxury hotel -- in their quest to return to the past",
      "similar": [
         206487,
         23048,
         41154,
         766,
         14337,
         10353,
         7551,
         817,
         869,
         871,
         1954,
         141,
         196,
         63,
         165,
         673,
         13475,
         816,
         1417,
         59967
      ],
      "original_title": "Les Visiteurs",
      "runtime": 107,
      "poster_path": "/tKCeoKQzf5kwaAMBkfhLyphuJeL.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": "/oA5OLrPPlfbaskzPAo7J4uLydzD.png",
            "name": "Canal Plus",
            "id": 104,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gaumont International",
            "id": 7961,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 3 Cinema",
            "id": 16804,
            "origin_country": ""
         }
      ],
      "release_date": "1993-01-27",
      "vote_average": 7.1,
      "belongs_to_collection": {
         "backdrop_path": "/ywYnkeaa7LZBU1bW8zavPwzve4X.jpg",
         "name": "The Visitors Collection",
         "id": 52888,
         "poster_path": "/tqLSEkKYdkFCqsNHP1v9pnr0sl.jpg"
      },
      "tagline": "They Weren't Born Yesterday!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "FRF ",
      "directors": ["Jean-Marie Poiré"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Christian Clavier",
         "Jean-Marie Poiré"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0108500/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNzAxMDE4Ml5BMl5BanBnXkFtZTcwMTE0MjgzMg@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Christian Clavier, Jean Reno, Valérie Lemercier | See full cast and crew »"],
      "reviews": [
         "Looking at some of the other comments, not everyone is in agreement here, but I have really liked \"Les Visiteurs\". The original is so good, its a pity they had to spoil with the Americanized version - 'Just Visiting' - which is at best an insult on the intelligence of the American viewing public. For us that do not understand French, they have done a tremendous job with the English subtitles (translating a kind of 'medieval' French into a comparable type of old English \u0096 modern swearwords included). In fact, the job is so well done, that we had a lot of laughs just by comparing the film's verbal antics to the translation. Even though I do not speak French myself, it is quite clear that a lot of effort had gone into this. Sometimes the conversations are fast and furious, so it's worthwhile to see the movie a second time. Even on the second pass, there was a lot to laugh at. This is meant to be slapstick and the story is a total farce, so it's hard to see why some viewers apparently expected more. I thought it was well done, and very well executed. Even though this whole thing is intended as a joke, the reactions of the medieval guys are quite believable. The movie is a blast!",
         "When I saw the low rating on this movie, I knew I had to submit a vote because, in my opinion, it make discourage many others from watching one of the funniest movies ever. The plot is very original, a knight and his servant, who were supposed to return in the past only several hours to correct a fatal error in judgment, mistakenly get zapped to modern times. Imagine medieval eyes seeing asphalt and a horse less steel chariot (a car of course) rolling towards them. The men, used to witches and sorcerers, believe it is some sort of devil machine. When the car stops, they promptly attack it. A black man exits and the medievals yell: \"A Saracen, a Saracen!\". I saw this movie in its original language: French. If you can understand French, I very strongly recommend it. This is slapstick at its best. You will want to buy the movie and watch it over and over because you will always discover something else you missed. It is a jewel!",
         "I just finished watching the movie, and it was hilarious. I was laughing outloud at many many points. However, as my title indicated, it was the original french track that made me laugh. As is always the case for biliguals, one cant help but listen to the track and read the subtitles at the same time. Unfortunately, the subtitles do not do justice to the movie. There are just too many semantic jokes that play off names and locations that could not be translated and make sense. That is why in so many reviews there seems to be a sharp contrast in views of whether or not this was a joke-a-minute movie. The hollywood remake is awful, in fact,it never really made any sense and and the jokes were far and few in between. This one makes much more sense, and the meeting of people and their descendants makes for many more laughs. The other factor is the acting and casting. This is just the nature of subtitled movies - one very rarely gets the fantastic acting and language ability of actors when reading the watcher is reading a yellow line, especially in comedy. Those who listen to the movie in its original french thikn the acting was fantastic, the voice casting (something i think is terribly important in acting [say, could Ashton Kutcher play Maximus from Gladiator, no, a high pitched voice could not do it]) is brilliant, but reading a crummy translation (and it was crummy) wont do the film justice. 8/10 for francophiles 6/10 for subtitle readers",
         "I admit I haven't seen more than probably 40 or 50 \"foreign\" films, but of those, this is still the funniest one I have watched. The major problem I had with it was that the dialog (and the humorous lines) came so fast I barely had time to read the subtitles. It gets a little tiring after awhile trying to keep up with the reading and viewing at the same time, at that pace. As with all comedies, you get smart and stupid scenes. You get more stupid when you have more slapstick, but you also have more laugh-out-loud moments. Such is the case here, as Jean Reno and Christian Clavier portray clownish 11th-century men who suddenly find themselves in modern-day France. Time-travel films almost always are fascinating, whether it's sci-fi or comedy. Most of the jokes center around the guys trying to figure out today's modern conveniences, such as toilets, and the problems they have trying to figure them out. Also, there are big problems with the men's relatives, who are trying to figure out who these strange-acting guys are all about! As for family viewing: not suitable. There is no sex and no nudity, but there is rough language which is why it's rated \"R.\"",
         "The dialogue is fast at times and sometimes in olden French at that, the subtitles are in white and can't be read on a white background but I still found this excellent, (I don't speak French). Jean Reno always a favorite, plays well, though there is not the same scope as in some of his thriller roles. Christian Clavier is superb in his two roles, but for me the star was the Countess. Altogether very enjoyable.",
         "I watched this film late at night on Channel 4 while not being able to sleep, not knowing what on earth to expect. In fact it turned out to be a delightful film, which really made me laugh and was unashamedly silly while not being specifically aimed at kids. I ended up getting it on DVD and making my friend watch it: she also thought it was great. Neither of us can speak French and while we knew the subtitles probably weren't getting all of the humour across we still found it very enjoyable. Shame it had to be remade, although I never saw the English version I'm sure it wasn't as good. Recommended! (P.S. We were also shown some of it in French class - the teacher and I giggled throughout and no one else in the class did! So maybe an acquired taste, but I loved it!)",
         "Les Visiteurs is a brilliant film. It makes me want to learn French so that I could enjoy the movie even more! Although the jokes are coarse, they are used correctly, WITHOUT fake laugh tracks in the background. The actors portray the characters so well I could almost believe it! Well, almost believe it. In any case, this film will bring on the giggles and laughter. It is not easily forgotten.",
         "Sometime soon we'll agree not to be mad at the French. When that happens, look for \"Les Visiteurs\" on cable or at the video place. The frantic humor of this time-shifting comedy works well both on the French dialogue track and through the somewhat loose paraphrases of the subtitles. Yes, folks, subtitles and all, this is a good one. Christian Clavier emerged from the Splendide, a French take on Second City, to seize the film comedy market by the throat. Like Jerry Lewis, he is in need of a straight man. Lewis's moved on to the Ding-a-Ling Sisters. Clavier has granite-faced Jean Reno of \"French Kiss\" and \"Mission Impossible\", the man with the permanent dix-sept heures shadow across his jowls. Their interaction is spot-on hilarious. Oddly, the memorable quote from this film is in (sort of) English. \"OK\" is acceptable Franglais, the Academie notwithstanding. Clavier's character becomes fascinated with the word, shouting \"O-Kayyy\"! at the least provocation. Listen to my wife and I converse: we echo old Jacqouille all the time.",
         "The French have a wonderful sense of detail. I've spent 10 months there, and this sixth sense seeps through most things - including films. Their comedies are almost always very good, and if they could just get rid of the need for banana-skin-humor (in this case a bowl of soup on someone's head), they would be hilarious. This film is the funniest of the lot. The characters are extremely funny, and the clash between the medieval knight and his sidekick and the modern world is just as grotesque as I imagine it would be in real life. The part where they have dinner together is the best: \"Jour...nuit...jour...nuit...\" You can't quit laughing.",
         "I'm Chinese who reside in Sydney, Australia, and was fortunate to have a government operated television studio to show foreign programs in its original language with English subtitles. More fortunate isn't because of the showing of the Hong Kong Kung-Fu films but the funniest film in anyone's language \u0091Les Visiteurs'. As the English subtitles has already provided so much enjoyment to the film, I would assume most of the French would have laugh until they start coughing, to the extended of suffering from a sore throat. OOOKAY!! \u0096 Which was frequently used in the film deliverers the impact to some the comic relief, but from my point of view, it is not a simple comedy to make. Some research was properly done to imagine someone who had lived in the middle ages, not forgetting their customs and habits from that era, then place them to the present day, you will end up witnessing similar chaos and disasters that is far worse than Mr. Bean. My favorite is when they call the car a \u0091chariot', also the subtitles is presented with Medieval English, I would imagine the same in French. This is not doubt the funniest movie I have seen in my lifetime, the way they mess up the bathroom made me though it was stupid at first, but then I realize it actually make sense, as this is how they clean themselves back in the middle ages. This film beats my funniest English film, which is \u0091Dirty Rotten Scoundrels' directed by Yoda (i.e. Frank Oz)"
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Alpilles Productions",
         "Amigo Productions",
         "Canal+"
      ],
      "summaries": ["A medieval nobleman and his squire are accidentally transported to contemporary times by a senile sorcerer. He enlists the aid of his descendent to try to find a way to return home, all the while trying to cope with the cultural and technological changes distinguishing his time from ours."],
      "budget": 50000000
   },
   "movielensId": 718,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1993-01-27",
      "dvdReleaseDate": "2001-11-09",
      "directors": ["Jean-Marie Poiré"],
      "runtime": 107,
      "movieId": 718,
      "title": "The Visitors",
      "mpaa": "",
      "actors": [
         "Jean Reno",
         "Valérie Lemercier",
         "Christian Clavier",
         "Marie-Anne Chazel",
         "Christian Bujeau",
         "Isabelle Nanty",
         "Gérard Séty",
         "Didier Pain",
         "Jean-Paul Muel",
         "Arielle Sémenoff",
         "Michel Peyrelon",
         "Pierre Vial",
         "François Lalande",
         "Didier Bénureau",
         "Frédéric Baptiste"
      ],
      "imdbMovieId": "0108500",
      "originalTitle": "Les Visiteurs",
      "genres": [
         "Fantasy",
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["nT1XlVVzKB4"],
      "plotSummary": "This outrageous time-travel comedy follows the misadventures of a wacky medieval knight (Jean Reno) and his faithful servant when they are accidentally transported to contemporary times by a senile sorcererMayhem rules as these 12th-century visitors try adapting to the wildly confusing modern world. To avoid being stuck here for good, however, they soon begin an all-out cosmic assault on their former castle -- now a luxury hotel -- in their quest to return to the past",
      "tmdbMovieId": 11687,
      "avgRating": 3.43301,
      "releaseYear": "1993",
      "numRatings": 1127,
      "posterPath": "/tKCeoKQzf5kwaAMBkfhLyphuJeL.jpg"
   }
}