{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "college",
         "id": 3616
      }],
      "imdb_id": "tt0113537",
      "video": false,
      "title": "Kicking and Screaming",
      "recommendations": [
         53765,
         18408,
         15389,
         13132,
         19094,
         13983,
         34101,
         16771,
         152640,
         14167,
         121207,
         42707,
         177851,
         30019,
         44389,
         257407,
         22792,
         48375,
         92378,
         168128
      ],
      "backdrop_path": "/f61rupdBeqLxl0S6tOcA2asuyxH.jpg",
      "revenue": 718490,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Grover",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d21",
               "name": "Josh Hamilton",
               "profile_path": "/uzqTbGXDrVp6j97OkbFBphJUmKf.jpg",
               "id": 52419,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe4592c3a368484e062d25",
               "name": "Olivia d'Abo",
               "profile_path": "/l7m7nw7wQFvc2ROXOTa4Flblh4M.jpg",
               "id": 46423,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Otis",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d29",
               "name": "Carlos Jacott",
               "profile_path": "/wzCNencJ1xx9EOEFRrGlJB1twtQ.jpg",
               "id": 52930,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Chet",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d31",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d2d",
               "name": "Chris Eigeman",
               "profile_path": "/4JXp2loLNrssBipfrvnhmXfhcaz.jpg",
               "id": 78190,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Skippy",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d35",
               "name": "Jason Wiles",
               "profile_path": "/7p6NAI5z9yTYSEqsJCAZJmS7SC3.jpg",
               "id": 81373,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Miami",
               "gender": 1,
               "credit_id": "52fe4592c3a368484e062d39",
               "name": "Parker Posey",
               "profile_path": "/pSDZaaXxX1Ic0Fz34tjr6rexMxk.jpg",
               "id": 7489,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Pete",
               "gender": 0,
               "credit_id": "52fe4592c3a368484e062d55",
               "name": "Samuel Gould",
               "profile_path": "/kzoyMk82i2tzag1KtJXVvwLR16K.jpg",
               "id": 21967,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Gail",
               "gender": 1,
               "credit_id": "52fe4592c3a368484e062d59",
               "name": "Catherine Kellner",
               "profile_path": "/hmOfknife4GM8oHRqbsMUC03d4W.jpg",
               "id": 10130,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Professor",
               "gender": 0,
               "credit_id": "52fe4592c3a368484e062d5d",
               "name": "Jonathan Baumbach",
               "profile_path": null,
               "id": 1052883,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Lester",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d65",
               "name": "Peter Czernin",
               "profile_path": null,
               "id": 54474,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Josselyn",
               "gender": 1,
               "credit_id": "52fe4592c3a368484e062d69",
               "name": "Eliza Roberts",
               "profile_path": "/twTgZzVk2hT4KHHfNQ7AnkCJ371.jpg",
               "id": 55207,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Friedrich",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d6d",
               "name": "Christopher Reed",
               "profile_path": null,
               "id": 76989,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d71",
               "name": "Noah Baumbach",
               "profile_path": "/6PuCDnBLURBnLCuat7BfouH9Gus.jpg",
               "id": 5656,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Zach",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d75",
               "name": "Dean Cameron",
               "profile_path": "/hrATK7lU4dO6MQy2jkVFXlrnlrj.jpg",
               "id": 64057,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Grover's Dad",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d79",
               "name": "Elliott Gould",
               "profile_path": "/bo5jSwWyFRsKVAkELT9n7AKQqMk.jpg",
               "id": 827,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Bouncer",
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d7d",
               "name": "David DeLuise",
               "profile_path": "/uwQ3mplpY0WEU8Q719LpbLwM7ln.jpg",
               "id": 97600,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe4592c3a368484e062d81",
               "name": "Cara Buono",
               "profile_path": "/8nK8PSGTfDr3GtqdgUcWwbSlyJX.jpg",
               "id": 20047,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Amy",
               "gender": 1,
               "credit_id": "52fe4592c3a368484e062d85",
               "name": "Perrey Reeves",
               "profile_path": "/mQrk0rd6rU86lfkXlmOf5Sb28VW.jpg",
               "id": 68495,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Stephanie",
               "gender": 0,
               "credit_id": "532b8143c3a3684bce0002b4",
               "name": "Lauren Katz",
               "profile_path": null,
               "id": 162607,
               "order": 19
            },
            {
               "cast_id": 26,
               "character": "Louis",
               "gender": 0,
               "credit_id": "532b83a59251416e8900026e",
               "name": "John Lehr",
               "profile_path": "/8v0cXIQtFqfgKt9ukFCDGX3GnSU.jpg",
               "id": 1219214,
               "order": 20
            },
            {
               "cast_id": 27,
               "character": "Ike (as Dave Kirsch)",
               "gender": 2,
               "credit_id": "5a6283160e0a261a07001141",
               "name": "Ian Davids",
               "profile_path": "/z78q4dx3yGo0WCCNSfKYVBwyaE1.jpg",
               "id": 1963514,
               "order": 21
            },
            {
               "cast_id": 28,
               "character": "Audra",
               "gender": 1,
               "credit_id": "5a646e9f0e0a261a070221e4",
               "name": "Kaela Dobkin",
               "profile_path": null,
               "id": 1201332,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d3f",
               "name": "Noah Baumbach",
               "profile_path": "/6PuCDnBLURBnLCuat7BfouH9Gus.jpg",
               "id": 5656,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d45",
               "name": "Noah Baumbach",
               "profile_path": "/6PuCDnBLURBnLCuat7BfouH9Gus.jpg",
               "id": 5656,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4592c3a368484e062d4b",
               "name": "Noah Baumbach",
               "profile_path": "/6PuCDnBLURBnLCuat7BfouH9Gus.jpg",
               "id": 5656,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4592c3a368484e062d51",
               "name": "Oliver Berkman",
               "profile_path": null,
               "id": 125504,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.16404,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28387,
      "vote_count": 46,
      "budget": 0,
      "overview": "After college graduation, Grover's girlfriend Jane tells him she's moving to Prague to study writing. Grover declines to accompany her, deciding instead to move in with several friends, all of whom can't quite work up the inertia to escape their university's pull. Nobody wants to make any big decisions that would radically alter his life, yet none of them wants to end up like Chet, the professional student who tends bar and is in his tenth year of university studies.",
      "similar": [
         10760,
         114150,
         8065,
         489,
         325133,
         8923,
         20453,
         337874,
         11137,
         8469,
         9285,
         8277,
         9777,
         11004,
         62211,
         440021,
         9529,
         27066,
         12620,
         22970
      ],
      "original_title": "Kicking and Screaming",
      "runtime": 96,
      "poster_path": "/urPxxjylNUHmoNcGkMgHStMTxhF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Castleberg Productions",
            "id": 5841,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sandollar Productions",
            "id": 5842,
            "origin_country": ""
         }
      ],
      "release_date": "1995-10-06",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Anxiety loves company.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Noah Baumbach"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Noah Baumbach",
         "Oliver Berkman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113537/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMjkwMzE4Nl5BMl5BanBnXkFtZTcwNzY0NzMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Josh Hamilton, Eric Stoltz, Samuel Gould | See full cast and crew »"],
      "reviews": [
         "Noah Baumbach's Kicking and Screaming is one of those rare films that actually gets it right when it comes to understanding the angst of being a young adult right out of college. Baumbach's dialogue matches each of the feelings that newly graduated students go through, but doesn't stoop to the level of condescending. We all identify with the characters of Kicking and Screaming whether it is Skippy and his wanting to further his education because there might be something he missed out on or if Skippy doesn't subconsciously want to become his friends Max, Grover, or Otis. We might identify with Max who blatantly doesn't know what to do now. Max's only hellbent on not looking back on his college years, \"I'm nostalgic for conversations I had yesterday. I've begun reminiscing events before they even occur. I'm reminiscing this right now. I can't go to the bar because I've already looked back on it in my memory... and I didn't have a good time.\" Kicking and Screaming is a film deserving to be recognize as a journey through the minds of graduates and self-discovery of oneself.",
         "This is simply the best \"Big Chill\" movie since, well, \"The Big Chill.\" The cast is terrific; the writing is even better. I've seen Josh Hamilton in several other films, but somehow he never has caught my eye except in this role (interestingly monnikered Grover, by the by). What makes this film work above the usual rabble of 20-something angst films is that you genuinely understand, can relate to, and feel for the characters. And the bits of business that have nothing to do with the \"main\" storyline, Grover's, are every bit as amusing and resonant. Highlights: Eric Stoltz and Carlos Jacott's \"book club.\" Chris Eigeman ducking the \"cookie guy.\" Carlos Jacott trying to remember the last \"Friday the 13th\" film. Any scene involving Parker Posey. I think I've watched this film about 10 times in completion. The ending, I've watched about 30 times. It's that good. I don't think I've ever seen a more tender, memorable, perfect scene than the parting one between Hamilton and Olivia D'Abo, where she takes out her retainer, smiles shyly at him and then there's a fabulous music cue that leads us into...the unknown. Of course, we know the ending, because Jane and Grover's fate has basically been the subject of the whole film, but the way Baumbach ties all of this together is truly inspired. Grover's speech at the airline ticket counter may be the best monologue in the history of cinema. Am I gushing irrationally here? Perhaps a little. But this film needs to be seen and recognized as the little gem (that's often better than anything else in the same genre done by a major studio/director) that it is.",
         "If I had to pick one movie that I was forced to watch again and again, it may be this one. Not that this is Citizen Kane or The Godfather, it's just that it speaks to me. Never has anyone dealt with disaffection in such a witty manner. Every character has something to say on the subject, and it's hysterical. I really GET all of the characters, even if I can't identify with some of them. None of the actors appear to be TRYING, which most seem to do in films of this genre. Josh Hamilton's portrayal of Grover is subtle but outstanding. Olivia d'Abo is radiant, and (retainer and all), I can't take my eyes off of her. Chris Eigeman steals every scene he's in, as usual, and missed his calling as a stand-up comedian - he's that funny. Baumbach's use of flashbacks is one of the most effective I've ever seen, and the transitions to flashbacks look amazing. And finally, this movie is infinitely quotable. \"Cookie Man, go away\", \"I gotta go - I gotta sleep with a freshman\", \"Jane 2: Electric Boogaloo?\", and \"Oh, I've been to Prague\" still crack me up after 20 or 30 viewings of this film (need the DVD to come out before my tape wears out). So I can't say enough about this film. If you haven't seen it, go buy it. P.S. What happened to Noah Baumbach? Sophomore and Junior jinxes with his two follow-ups. Bad movies. Oh well, \"Kicking and Screaming\" more than makes up for them.",
         "\"Kicking and Screaming\" shows a considerable degree of self-awareness for a film about college graduation directed by a 25-year-old, but it is still an awkward, self-conscious film that is no more confident than its insecure characters. It was fortunate that in 1995, there were producers out there who believed a movie about depressed upper-middle class white boys had commercial potential, because those producers launched the career of Noah Baumbach, who would go on to make superior films in the next decade. As in his later films, Baumbach seems to take pity on pretentious and tremendously insecure characters while simultaneously taking delight in exposing their weaknesses to the world. But in \"Kicking and Screaming,\" unlike, say, \"The Squid and the Whale,\" Baumbach seems to identify just a little too closely with his young characters and seems to believe that they are less obnoxious than they are. \"Kicking and Screaming\"'s greatest strength and weakness is how well it captures an aspect of growing up not often captured on film: the resistance to change. Many films deal with characters who gradually change as they come of age, but \"Kicking and Screaming\" deals with characters who desire on some level to move on past their current selves but are hesitant to do anything about that desire. This also hurts the film, however, since very little changes from beginning to end, and when characters do change at all, they change less than they (or the film) believe. The stagnation would not be a problem if the film were a comedy, but, while the film is full of quirky characters and occasionally funny jokes, it deals with the dullness and depression too honestly to really work as a comedy. When wealthy Max, perhaps the most stagnant of all the characters, puts a \"broken glass\" sign over a pile of shattered glass rather than cleaning it up, it is good for a laugh, but as the film goes on, we get to know Max well enough that it almost stops being funny. \"Kicking and Screaming\" is certainly worth seeing for any fans of college-related movies and should probably be required viewing for anyone in their junior or senior years, since it could work as an effective warning against the perils that await graduates without plans. But the film, like its characters, has both too much self-consciousness and too little self-awareness to achieve the levels of comedic or dramatic potential that it hints at.",
         "Kicking and Screaming is easily my favorite film. It is a funny and intelligent look at the identity crisis that follows graduation. A brilliant script lifts the film out of gen-x romantic comedy hell. First time director Noah Baumbach does the impossible by keeping such a talky film constantly moving. With more insight and heart than most movies, Baumbach has created something timeless. A must see for all who are scared about taking that next big step.",
         "Apparently, I watched \"Kicking and Screaming\" at the perfect time -- not even a month after graduating college. Still, I don't find myself identifying with its characters or empathizing with their struggles other than the basic \"I wish I didn't have to leave.\" Granted graduating college is different now than it was in the 1990s, but if this film were truly very good, it would resonate with college graduates of all generations. The problem is that as sharp, witty and original as the dialogue is, it's unnatural and it pushes us toward nothing. Fans of dialogue in film, particularly the avant garde approach, will probably be quick to love this film debut from writer/director Noah Baumbach. He manages to write a lot of dialogue that we all think but never actually speak aloud (admirable), it's all quite clever (funny or at least amusing) but his characters like to talk a lot about what they do, which in this movie is nothing (boring). College graduates and friends Grover, Max, Skippy and Otis, all played by no-name actors basically decide to spend their first year post-graduation back at school because they are to afraid to leave. Skippy's girlfriend Miami is still a student so he stays, Otis is scared of moving to Milwaukee, Grover's girlfriend went to Prague, thus dumping him and backing out of their plans to live in Brooklyn together, etc. It's a very indie take on a coming of age story. If it hasn't been made apparent, there's a lot of talking. You'll like a lot of what you hear and you'll be bored by a lot of it. People just generally don't talk this way, which helps the movie avoid cliché, making it fresh and funny, but also alienates the audience at times. At times I told myself I kind of liked it, at others I wondered what the point was. There is some definite intention behind everything Baumbach does, but he communicates this intention in ways most people won't grasp and it all comes across pointless. Plus, either Baumbach never communicates the reason for the title or I missed it because I wasn't totally paying attention. With so much dialogue, everything Baumbach really wants the audience to understand he must have spoken aloud and so rather than discovering meaning, it comes in the form of explanation. \"Kicking and Screaming\" is an experiment, an artsy film that some will love just for being artsy and others will find boring for being exactly that way. Baumbach's writing shows promise, but it also has the potential to fail miserably.",
         "i rented this movie because it was in the criterion collection section of the video rental store, and i was very disappointed. my boyfriend and i literally got up and walked around and did other stuff while it was on. to me it seemed like total undergraduate pseudo-intellectual masturbation on baumbach's part. we watched the special features to see what these guys had to say for themselves, there it was revealed that they went to VASSAR (where apparently everyone wears sport coats ALL THE TIME). maybe i just had a totally different college experience, but this movie was completely unrelatable except for the fact that everyone in college seems to think they're smarter than they actually are. in that sense, it was nostalgic in a bad way. i guess maybe the movie didn't appeal to me because i watched it in a vacuum (it's not 1995 anymore, i'm not 22 anymore, and i'd never heard of it). i'd say most of us would probably think the flaming lips' first album sucked if we didn't know about everything they'd done since then. so, all i can say is, renter beware. for me, this movie just never quite clicked. (also, we all know parker posey is hilarious, but totally diluted in this film.)",
         "Let me begin by stating that I am a big fan of Whit Stillman and his ensemble movies, especially \"The Last Days of Disco,\" which in my opinion was one of the most perfectly realized movies of the nostalgic '90s. To put it bluntly, \"Kicking and Screaming,\" despite its excellent cast and decent premise (the fate of a somewhat inbred group of friends after graduation from college) is so badly executed that it is almost incoherent. This one needed to stay in the can. No - it needed to stay AWAY FROM the can. They could at least have hired a cinematographer...the photography in this flick is the worst I've seen since Elvira went off-air. What is truly unfortunate is that there are some very funny lines buried in all the drek...it may have been possible to make a good movie out of this crap, but as it stands, its just a heap o' nothing. Oh well. Try \"Swingers,\" \"Henry Fool,\" \"Pecker,\" \"Metropolitan,\" \"The Last Days of Disco,\" \"Chasing Amy,\" \"Porky's 2,\" or absolutely anything else instead. Not even worth a free rental.",
         "This is an all-time favorite. Not just for the nuanced performances and witty banter, but because my particular group of friends my senior year of college bore striking resemblances to the \"hawks\" (or \"cougars\" or whatever the hell Skippy wants to call the group). One of our girlfriends actually made the comment, \"you guys all talk the same.\" So I can understand why some may pass this film over, but since the action and dialogue hit so close to home, I have to love this movie. It gets better with repeated viewings and the writing, acting, and chemistry are spotless. At times I felt like this movie was made just for me. And that's a comforting feeling. I can tell that Baumbach felt a lot of the same things I did in college - Max's speech at the Hole comes to mind, as well as the writing class scene, and especially, \"I'm Max Belmont, I do nothing.\" Fortunately, it's SUCH a well-made film. So much goes on in the corners - the renaissance festival guys, the conversations on top of conversations, Grover's dad on the phone talking about Riley's marriage. It's a great movie that deserves to be seen. Even if you're not a hopeless postgrad loser.",
         "If you're looking for an interesting, involving movie that uses dialogue thoughtfully (and efficiently), step aside, or you're liable to be swept up when this dust storm of 20's angst and supposedly witty banter comes barrelin' through town. It's a gloomy episode of \"Friends\" stretched over an hour and a half, where \"wit\" is created through pop culture references, cheap cynicism, and nifty little one-liners. I'm still not sure what the point of the whole thing was; I've a feeling the only people who get anything from this movie are the ones who watch films for the experience of \"relating to the characters.\" Maybe the point was simply to give me a slice of post-college life. Yuck. Man, is it bad. Just stay away."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Trimark Pictures",
         "Castleberg Productions",
         "Sandollar Productions"
      ],
      "summaries": [
         "After college graduation, Grover's girlfriend Jane tells him she's moving to Prague to study writing. Grover declines to accompany her, deciding instead to move in with several friends, all of whom can't quite work up the inertia to escape their university's pull. Nobody wants to make any big decisions that would radically alter his life, yet none of them wants to end up like Chet, the professional student who tends bar and is in his tenth year of university studies.",
         "Following graduation, a handful of college students do nothing and talk about it wittily."
      ],
      "budget": 0
   },
   "movielensId": 72,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-06",
      "dvdReleaseDate": "2006-08-22",
      "directors": ["Noah Baumbach"],
      "runtime": 96,
      "movieId": 72,
      "title": "Kicking and Screaming",
      "mpaa": "R",
      "actors": [
         "Josh Hamilton",
         "Olivia d'Abo",
         "Carlos Jacott",
         "Eric Stoltz",
         "Chris Eigeman",
         "Jason Wiles",
         "Parker Posey",
         "Samuel Gould",
         "Catherine Kellner",
         "Jonathan Baumbach",
         "Peter Czernin",
         "Eliza Roberts",
         "Christopher Reed",
         "Noah Baumbach",
         "Dean Cameron",
         "Elliott Gould",
         "David DeLuise",
         "Cara Buono",
         "Perrey Reeves",
         "Lauren Katz",
         "John Lehr",
         "Ian Davids",
         "Kaela Dobkin"
      ],
      "imdbMovieId": "0113537",
      "originalTitle": "Kicking and Screaming",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["c_Q1WwePBNI"],
      "plotSummary": "After college graduation, Grover's girlfriend Jane tells him she's moving to Prague to study writing. Grover declines to accompany her, deciding instead to move in with several friends, all of whom can't quite work up the inertia to escape their university's pull. Nobody wants to make any big decisions that would radically alter his life, yet none of them wants to end up like Chet, the professional student who tends bar and is in his tenth year of university studies.",
      "tmdbMovieId": 28387,
      "avgRating": 3.48035,
      "releaseYear": "1995",
      "numRatings": 1323,
      "posterPath": "/urPxxjylNUHmoNcGkMgHStMTxhF.jpg"
   }
}