{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113429",
      "video": false,
      "title": "Institute Benjamenta, or This Dream People Call Human Life",
      "recommendations": [
         128410,
         44258,
         143796,
         67556,
         222560,
         85747,
         42631,
         37836,
         55616,
         42156,
         64527,
         49152,
         46150,
         115527,
         222226,
         41936,
         90228,
         2363,
         84880,
         144611
      ],
      "backdrop_path": "/sR7HM39LD2EiqlGNKCNdXmhQmIC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Lisa Benjamenta",
               "gender": 1,
               "credit_id": "52fe459cc3a36847f80d0c55",
               "name": "Alice Krige",
               "profile_path": "/kUuVEsfZNxXdlK2JQdTEGcfkoY3.jpg",
               "id": 2506,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jakob",
               "gender": 2,
               "credit_id": "52fe459cc3a36847f80d0c59",
               "name": "Mark Rylance",
               "profile_path": "/5XrQYvdYqiGUepbgmRQfOltgBRJ.jpg",
               "id": 40900,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Herr Benjamenta",
               "gender": 2,
               "credit_id": "52fe459cc3a36847f80d0c5d",
               "name": "Gottfried John",
               "profile_path": "/hOVrTlQwZX4THosi9usXISC7mNS.jpg",
               "id": 3757,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Kraus",
               "gender": 0,
               "credit_id": "560a65229251417e9e000164",
               "name": "Daniel Smith",
               "profile_path": null,
               "id": 1516481,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe459cc3a36847f80d0c4b",
               "name": "Stephen Quay",
               "profile_path": "/9Z8YMbCDR1xzNwfXdq2IQyUjnHy.jpg",
               "id": 124237,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe459cc3a36847f80d0c51",
               "name": "Timothy Quay",
               "profile_path": "/8hGRmypiLEoj4fYGa55kcq01z5s.jpg",
               "id": 124238,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "560a646cc3a368680e001eb0",
               "name": "Timothy Quay",
               "profile_path": "/8hGRmypiLEoj4fYGa55kcq01z5s.jpg",
               "id": 124238,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "560a647b925141719c001f01",
               "name": "Stephen Quay",
               "profile_path": "/9Z8YMbCDR1xzNwfXdq2IQyUjnHy.jpg",
               "id": 124237,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "560a648ac3a3686814002136",
               "name": "Alan Passes",
               "profile_path": null,
               "id": 1321355,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56956ea69251413ae0000870",
               "name": "Nicholas D. Knowland",
               "profile_path": null,
               "id": 47748,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.207403,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         }
      ],
      "id": 40651,
      "vote_count": 14,
      "budget": 0,
      "overview": "Jakob arrives at the Institute Benjamenta (run by brother and sister Johannes and Lisa Benjamenta) to learn to become a servant. With seven other men, he studies under Lisa: absurd lessons of movement, drawing circles, and servility. He asks for a better room. No other students arrive and none leave for employment. Johannes is unhappy, imperious, and detached from the school's operation. Lisa is beautiful, at first tightly controlled, then on the verge of breakdown. There's a whiff of incest. Jakob is drawn to Lisa, and perhaps she to him. As winter sets in, she becomes catatonic. Things get worse; Johannes notes that all this has happened since Jakob came. Is there any cause and effect?",
      "similar": [],
      "original_title": "Institute Benjamenta, or This Dream People Call Human Life",
      "runtime": 104,
      "poster_path": "/w2bdb5sEwWMNHN08KntkS06z4wA.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pandora Filmproduktion",
            "id": 254,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Koninck Studios",
            "id": 3541,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Image Forum",
            "id": 64448,
            "origin_country": ""
         }
      ],
      "release_date": "1995-08-01",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Stephen Quay",
         "Timothy Quay"
      ],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Alan Passes",
         "Stephen Quay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113429/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA4OTYxNjQ0NDNeQTJeQWpwZ15BbWU3MDU0MTMyMzg@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Mark Rylance, Alice Krige, Gottfried John | See full cast and crew »"],
      "reviews": [
         "Institute Benjamenta is an oddity. Let me say that first, get it out of the way. Part of me hesitates from revealing here that it is one of my favourite films of all time because I know I'll make some people reading this mini-review approach it from the wrong angle. A film like this should never become required viewing. You should stumble across it at a repertory cinema somewhere or be beguiled by the video-box art showing the striking visage of Alice Krige as she paces before her blackboard, deerfoot staff in hand. You should find one evening that its the only thing that sounds interesting on TV, or peer at a still alongside a mention in your TV guide and wonder what on earth the picture is supposed to depict. Contained between main and end credits here is a world so visually ravishing and technically abstruse that you are only in the film while you are watching; the rules of the outside do not apply. You peer into the dreamy, foggy black-and-white and what you can't identify for certain your imagination fills out. These are the most special special effects because you wonder 'what' and 'why' by never 'how.' The Institute of the title is a school for servants, the lessons they are taught bizarre and repetitive to the point of making 'deja-vu' a permanent state of being. Is the repetition the point of it all or has the teacher lost the plot? If she has, how come we care? None of this is vaguely like real life. None of it, that is, bar the characters emotions. Or is the whole thing like real life, like Life with a capital 'L?' In the end does this sort of pondering make for a good movie? I won't answer that because I'm terribly biased. Remember the title and look it up sometime. It's the cinematic equivalent of a stunning old-fashioned magician's trick. A monochrome bouquet, a sad smile. There are images, scenes that may make the hairs on the back of your neck think they're a cornfield with a twister on the way. I tried to warn you as quietly as I could.",
         "It is fairly rare that moving pictures are made with real artistic value in mind and even more rare when the endeavor pays off. Well, The Quay brothers' Institute Benjamenta is one such picture. At first sight it might appear a little too pretentious with an abounding array of hidden symbolism of a strange and antique meaning but then again, the basic thread of the picture is as old as humanity itself, pointing back to the ancestral roots of what makes us human: to love and to loose. It is remarkable the technique and the rendering of the camera in the Quay brothers' masterpiece. You cannot but help wondering if the images themselves are not centuries old and, in a sense, that is exactly the aim of the picture, to make itself look old and timeless, at the same time. I urge anyone who is really looking for that special feeling films give us, far from commercialism and hollywoodia, to see this movie. Sure, most of you will find it a little bit hard to watch but if you give it patience and let the mood of the picture fill you from within your imagination then I think this will be a rewarding cinematic experience.",
         "A truly wonderful film that slowly unfolds images of great beauty before you. I particularly like the through the keyhole moment and the dust being brushed aside by the clock pendulum. But mentioning specific scenes is to distract from the whole work which is I am sure is as close to a dream as one would get without sleeping. I adore Alice Krige in it and the way scenes have been constructed with the actors placed within the whole composition of the frame. I would not recommend this film, rather I think it is much better to discover it yourself and cherish it.",
         "Not for all tastes, Institute Benjamenta is like David Lynch's The Elephant Man via the works of Bergman and silent expressionism. Every single frame in the bizarre odyssey is tightly composed and beautifully printed in black and white. The use of shifts in focus and depth, and the wild juxtapositions of the most mundane actions, allowing them to take on any number of connotations only heightens the floating dream like atmosphere, as we are dumped into this world with no idea of what is going on, or what is going to happen. But this film is terribly slow (this is were the Bergman element comes into play), and it's a test of the viewer's concentration to see the film through. But unlike Bergman, Institute Benjamenta does not pay off at the end, nor does it leave the viewer puzzled, conflicted and desperate to experience the film again (ala Persona). Instead Institute Benjamenta just ends, and personally I have no desire to watch the film again, I felt I got everything I could and wanted to gain from the experience. The acting was good, suitably distant and with the right level of cold detachment, but there was a constant feeling the actors were plating second fiddle to the sumptuous visuals put on show by the famed animators the brothers Quay. It's sad that they have yet to make another live action film, as the wealth of great ideas and knowledge of film-making displayed in Institute Benjamenta is one-hundred times better than most of the recent films I've seen, if the Brothers had put a little more time into the depth of the narrative, they could have backed up those haunting images with some much needed substance. This is not a film for everyone, as I have already stated. The nonsensical narrative and bursts of surrealism will undoubtedly put off some viewers, but this is a film that should have a wider audience. In a cinematic world of conventions and formulas the brothers Quay made a film that, although by no means great, showed originality and definite promise, that makes Institute Benjamenta a film worthy of cult classic status.",
         "This story about love, death, pride and loneliness. The story about mask of a pride on everybody in our society, and loneliness and love under this mask. The best of human emotions never to come out from this mask. This is one of most strong self-contradiction in our society. Everybody hide his own emotions and only mask of pride and lie see to the outer world. From this contradiction born loneliness and death. In this film every frame is a beautiful photograph work. Any frame can be viewed on art exhibition. Masters of light and depth resolution. No any unnecessary details in every frame. All of attention on needed elements of frame. It is a great. This is deep philosophy and social story, and uncommon beautiful film. My score 9 of 10.",
         "In reading the comments, it occurred to me that many who have watched this film have missed the point. There are some very thoughtful comments to be sure and this is a very thought provoking film. I think that the analogy between this film and Eraserhead is a valid one but not for the reasons stated. Institute Benjamenta and Eraserhead are both films that to my mind are not to be viewed in the same way as Hollywood fare where plot and story is everything. These films are meant to be appreciated in the same way you would go to a museum and look at something by Van Gogh or Dali. These films are cinema paintings designed to wash over you and envelope you in a way that a plot-based film traditional film seldom does. Most filmmakers are strapped tightly into a box which is the \"Hollywood Formula\". That form is very rigid and if you want to make films consistently in Hollywood you have to conform. The Brothers Quay have paid dearly for their invention and artistry. It's very hard for them to get money to make these films. They don't need to fix \"Institute\" by being better, we need to fix ourselves for being too limited in our acceptance of what a film can be. This film is a work of unbridled genius. I only say \"God Bless them and give us MORE!",
         "A quiet and softly spoken man arrives at a ghostly building to enrol for the servants class taught there. He rings the doorbell and is greeted by a monkey's face through the small hole in the door. The man's name is Jakob. He enters and meets one of the two owners (a brother and sister). The brother is unpleasant, and informs Jakob that there are no favourites here. Jakob goes into class to meet the other students. They all announce their names to him and then fall over. The lessons are presumptuous and iterative. They involve the men swaying from side to side and standing on one leg. They really are quite eccentric. The institute seems to be its own little world away from reality, with its low ceiling rooms. The sister soon has a strange fondness for Jakob. This is a very sombre film, but has a unique air to it. The pacing is pedestrian, but you stay with it. The acting is good, and the camerawork is meticulous and probing.",
         "If this has a meaning beyond the one on the surface, which carries no conviction, it must be one of the classic horror films. But I can't see that it does. The authoritarian, sexually perverse world that it depicts seems the creation of someone who has never experienced oppression or obsession at first hand and so has nothing to say about it. The film is a totally artificial and hermetic work. On the other hand, its distance from reality allows its manufacturers to take as much time as they please to refine and distill its essence, as in a bottle. But what is it they're distilling? Whatever it is, it gives off a lovely scent. One exquisite shot follows another; the actors are perfectly cast. Alice Krige I suppose can be called a cult figure (I'm one of the cult), and in this film she has finally found the ideal environment. It's never uninteresting, never unattractive--but it should have been disturbing and it isn't. Some day I hope to find something inside it.",
         "The comparison to David Lynch's \"Eraserhead\" is important but only in an opposite way. While Lynch's first feature (and still the best) relies strongly and almost only on directors vision and artistic \"feel\" (without any philosophy, just a free thought) this one found an inspiration in poetry and tried to transcend it into a living world. So, the wrong approach is more than obvious. How can anybody turn poetry into a motion picture. The answer is: only if you approach the film the same way as some poet might approach his poem - with senses and instinct, nothing else. And that is where the Quay brothers failed. They tried to put poetic vision into a hermetic space and, of course it doesn't work. Photography and acting are excellent but they are not much important here. For me, the whole scenery and the plot is unnecessary and got very little to do with the philosophy of dialogues. It is just there to fill the visuals. And then you end up with something that's not exactly a film but not exactly anything else either. Still, true artistic films are so rare today, that even a weak one is more than welcome in a world of superficial art. Let's just hope that it will be better next time, for brothers Quay and for us.",
         "The first time I saw this movie, I fell asleep--but I don't blame the movie at all. I was tired. Before I fell asleep, I found it frustrating and oblique. But when I woke up, suddenly the dream logic of the movie seemed to make sense. Then I saw it again. Often compared to Eraserhead, I think this movie has much, much more to offer than Lynch's first feature. Institute Benjamenta doesn't have any kind of decoder...in fact, it refuses any. Filmed in a hazy, drowsy black-and-white, with scenes of flat, if surreal, simplicity, interspersed with dreamy, nonsensical interludes, it must be accepted before it can be enjoyed."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Image Forum",
         "Koninck Studios",
         "Pandora Filmproduktion"
      ],
      "summaries": ["Jakob arrives at the Institute Benjamenta (run by brother and sister Johannes and Lisa Benjamenta) to learn to become a servant. With seven other men, he studies under Lisa: absurd lessons of movement, drawing circles, and servility. He asks for a better room. No other students arrive and none leave for employment. Johannes is unhappy, imperious, and detached from the school's operation. Lisa is beautiful, at first tightly controlled, then on the verge of breakdown. There's a whiff of incest. Jakob is drawn to Lisa, and perhaps she to him. As winter sets in, she becomes catatonic. Things get worse; Johannes notes that all this has happened since Jakob came. Is there any cause and effect?"],
      "budget": 0
   },
   "movielensId": 729,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1995-08-01",
      "dvdReleaseDate": "2000-08-01",
      "directors": [
         "Stephen Quay",
         "Timothy Quay"
      ],
      "runtime": 104,
      "movieId": 729,
      "title": "Institute Benjamenta, or This Dream People Call Human Life",
      "mpaa": null,
      "actors": [
         "Alice Krige",
         "Mark Rylance",
         "Gottfried John",
         "Daniel Smith"
      ],
      "imdbMovieId": "0113429",
      "originalTitle": "Institute Benjamenta, or This Dream People Call Human Life",
      "genres": [
         "Animation",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Jakob arrives at the Institute Benjamenta (run by brother and sister Johannes and Lisa Benjamenta) to learn to become a servant. With seven other men, he studies under Lisa: absurd lessons of movement, drawing circles, and servility. He asks for a better room. No other students arrive and none leave for employment. Johannes is unhappy, imperious, and detached from the school's operation. Lisa is beautiful, at first tightly controlled, then on the verge of breakdown. There's a whiff of incest. Jakob is drawn to Lisa, and perhaps she to him. As winter sets in, she becomes catatonic. Things get worse; Johannes notes that all this has happened since Jakob came. Is there any cause and effect?",
      "tmdbMovieId": 40651,
      "avgRating": 3.41736,
      "releaseYear": "1995",
      "numRatings": 121,
      "posterPath": "/w2bdb5sEwWMNHN08KntkS06z4wA.jpg"
   }
}