{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "confession",
            "id": 718
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "louisiana",
            "id": 3134
         },
         {
            "name": "survivor",
            "id": 5385
         },
         {
            "name": "assault",
            "id": 6093
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "drugs",
            "id": 14964
         }
      ],
      "imdb_id": "tt0116508",
      "video": false,
      "title": "Heaven's Prisoners",
      "recommendations": [
         41938,
         88174,
         41779,
         84071,
         36141,
         22288,
         28614,
         76868,
         31696,
         30574,
         65603,
         29973,
         44626,
         26283,
         34322,
         40160,
         19118,
         47922,
         72086,
         33927
      ],
      "backdrop_path": "/sEzdKohnPpjpOnsyuLq5f1OaNTj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dave Robicheaux",
               "gender": 2,
               "credit_id": "52fe46199251416c91049067",
               "name": "Alec Baldwin",
               "profile_path": "/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg",
               "id": 7447,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Annie Robicheaux",
               "gender": 1,
               "credit_id": "52fe46199251416c9104906b",
               "name": "Kelly Lynch",
               "profile_path": "/2ZbV0mppAxxyh4mIG4HKTHfLkDM.jpg",
               "id": 6473,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bubba Rocque",
               "gender": 2,
               "credit_id": "52fe46199251416c9104906f",
               "name": "Eric Roberts",
               "profile_path": "/45i6fsxBwH1UyA74tWQ6am0DntC.jpg",
               "id": 21315,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Claudette Rocque",
               "gender": 1,
               "credit_id": "52fe46199251416c91049073",
               "name": "Teri Hatcher",
               "profile_path": "/xnvUJvf0vjHliYa2PlXyLGaJe9l.jpg",
               "id": 10742,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Robin Gaddis",
               "gender": 1,
               "credit_id": "52fe46199251416c910490a1",
               "name": "Mary Stuart Masterson",
               "profile_path": "/jQLmmJWumj0MsxE2DjvMHbf5ysz.jpg",
               "id": 31140,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Minos P. Dautrieve",
               "gender": 2,
               "credit_id": "52fe46199251416c910490a5",
               "name": "Vondie Curtis-Hall",
               "profile_path": "/tH7QvQ9ST9zLuZZsTHzxMXkgtIy.jpg",
               "id": 6198,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Batist",
               "gender": 2,
               "credit_id": "52fe46199251416c910490a9",
               "name": "Badja Djola",
               "profile_path": "/i5j8WpNKydvBs2Vu3cYJyXNBy3V.jpg",
               "id": 107009,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Alafair",
               "gender": 0,
               "credit_id": "52fe46199251416c910490ad",
               "name": "Samantha Lagpacan",
               "profile_path": null,
               "id": 132433,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Didi Giancano",
               "gender": 2,
               "credit_id": "52fe46199251416c910490b1",
               "name": "Joe Viterelli",
               "profile_path": "/3HhSpMcoWk4fucH6DSTU66x2D0g.jpg",
               "id": 60023,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Jerry Falgout",
               "gender": 2,
               "credit_id": "52fe46199251416c910490b5",
               "name": "Tuck Milligan",
               "profile_path": "/1R4G3cYSi4mMep89Y2HnaWkKcLM.jpg",
               "id": 130744,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Victor Romero",
               "gender": 2,
               "credit_id": "52fe46199251416c910490b9",
               "name": "Hawthorne James",
               "profile_path": "/i7PiUf2mN7zs3V78NPlF79nCOZ4.jpg",
               "id": 12056,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Eddie Keats",
               "gender": 2,
               "credit_id": "52fe46199251416c910490bd",
               "name": "Don Stark",
               "profile_path": "/M4zP41qHZvDkIFVJ7YM6v0s7oy.jpg",
               "id": 130129,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Toot",
               "gender": 0,
               "credit_id": "52fe46199251416c910490c1",
               "name": "Carl A. McGee",
               "profile_path": null,
               "id": 1075123,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Det. Magelli",
               "gender": 2,
               "credit_id": "52fe46199251416c910490c5",
               "name": "Paul Guilfoyle",
               "profile_path": "/vQRNg8D5jeUHGKeFzMuwFaAFnzZ.jpg",
               "id": 925,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Priest",
               "gender": 2,
               "credit_id": "52fe46199251416c910490c9",
               "name": "Chris Krisea",
               "profile_path": null,
               "id": 37255,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46199251416c91049079",
               "name": "Phil Joanou",
               "profile_path": "/5snXDgDV7xU0uX6ZbXiAxSXHbmI.jpg",
               "id": 18500,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46199251416c9104907f",
               "name": "James Lee Burke",
               "profile_path": null,
               "id": 132432,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe46199251416c91049085",
               "name": "Harley Peyton",
               "profile_path": null,
               "id": 15795,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46199251416c9104908b",
               "name": "Scott Frank",
               "profile_path": "/hV0DEtOsiiQAMb7Oqo2VEII8o2l.jpg",
               "id": 2199,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46199251416c91049091",
               "name": "George Fenton",
               "profile_path": "/23V03rGdkvNgeiBwLodJzNKdhJC.jpg",
               "id": 1528,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46199251416c91049097",
               "name": "Harris Savides",
               "profile_path": "/7B7o49bFyrfoiUvEujqqXNW8avK.jpg",
               "id": 10688,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe46199251416c9104909d",
               "name": "William Steinkamp",
               "profile_path": null,
               "id": 2241,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.649098,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 36915,
      "vote_count": 22,
      "budget": 25000000,
      "overview": "A hardened New Orleans cop, Dave Robicheaux, finally tosses in the badge and settles into life on the bayou with his wife. But a bizarre plane crash draws him back into the fray when his family is viciously threatened.",
      "similar": [
         4771,
         12150,
         979,
         627,
         281957,
         445954,
         133805,
         302,
         357096,
         8012,
         9093,
         111083,
         479,
         15069,
         37645,
         2502,
         769,
         949,
         1586,
         189
      ],
      "original_title": "Heaven's Prisoners",
      "runtime": 132,
      "poster_path": "/tJ61l57S7iMiHgzZJHehpfxjt2V.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "PVM Entertainment",
            "id": 10171,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ruddy Morgan Productions",
            "id": 6137,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Rank Organisation",
            "id": 364,
            "origin_country": ""
         },
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Savoy Pictures",
            "id": 11308,
            "origin_country": ""
         }
      ],
      "release_date": "1996-05-17",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "For an ex-cop obsessed with an unsolved murder, trusting the wrong woman could be a deadly choice.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Phil Joanou"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "James Lee Burke",
         "Harley Peyton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116508/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxOTg2NDAwM15BMl5BanBnXkFtZTcwNTkwNTcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Alec Baldwin, Kelly Lynch, Mary Stuart Masterson | See full cast and crew »"],
      "reviews": [
         "I guess you could call this a \"neo-noir,\" which is a modern-day film noir. It has that atmosphere, especially in New Orleans which seems to always been pictured on the seamy side in films. After the devastation that took place there last year, perhaps filmmakers will kinder to the city in future movies. Anyway, a seedy New Orleans, some good blues music and five varied-and-all interesting lead characters make this a very watchable movie. Alec Baldwin, Kelly Lynch, Teri Hatcher, Mary Stuart Masterston and Eric Roberts all contribute with good performances All but Roberts are the \"good guys\" in this one. The movie keeps your attention and has you involved for most of the two hours. The action is well-dispersed. My only complaint is a small one: Baldwin with the southern accent doesn't sound natural. Otherwise, a good modern-day crime story.",
         "I thought the opening scene was one of the best movie openings I've ever watched - beautifully written and sensitively played. Drawn in from the outset, I was happy to watch the plot unfold. Yes, it could be argued that the main protagonist brings his troubles upon himself but that is hardly a plot fault - some people do. Problems with the film? I don't know why an actress of Mary Stuart Masterson's caliber should take on such a nothing role. And the plane crash looked cheap and unconvincing. Otherwise, I have no complaints. I love the books and I thoroughly enjoyed the film. I have read the previous reviews which seem to be critical for the most part and I am left wondering why they are so. I've watched a lot of rotten films and this certainly isn't one of them. I give it an eight out of ten. I enjoyed it.",
         "Nice shots of the bayou under the opening credits. Unspoiled rivers, pristine swamps, oaks draped with Spanish moss. It all looks rather promising. I guess you can still find such subtle but majestic littorals, maybe along route 90 around Houma, but from most highways in southern Louisiana all you see is oily swamp water with derricks planted in it. Beer cans and garbage and, quien sabe?, corpses floating in the murk. The movie's kind of like that too. The location shooting is just fine. Everyone sweats up a storm in the heat and humidity and it's no wonder that they head for the gin rickeys with all that ice. New Orleans is exposed in all its funkiness. The French Quarter is more or less avoided, but we get to see the lesser neighborhoods, now drowned and empty of human life in the wake of Katrina. There are the shotgun houses of the poor, the stripper bars playing bluesy music. The streetcars travel not through the Garden District but through ordinary residential streets. Beautiful in its own rotting way, almost phosphorescent with corruption. Outside the city there are bait shops that rent boats and sell tackle. One of these is run by Alec Baldwin, ex cop, recovering alcoholic. The story isn't very much, when you come right down to it. Hard to follow at times, not really captivating but not absolutely mainstream generic either. Baldwin has a marvelously normal family, including a stolen adopted girl, but is accidentally involved in some shenanigans I couldn't quite follow, something about smuggling, which draws the attention of the mob. Baldwin doesn't seem to actually DO anything that threatens their presence but they surround his house one lightning-filled night and do his loving and courageous wife (Kelly Lynch). The rest of the plot is a revenge story, with Baldwin tracking down the killers one by one. There are some good action scenes, a chase across the rooftops, a battle on a streetcar. All the action is done in slow motion so you get a chance to savor it -- the crashing crashing cars, the catapulting bodies, the muzzle flashes brilliantly lighting up the interiors of dark houses. PS: Mister Director, can we have a moratorium on slow-motion deaths? It's more than a cliché; it's positively decadent by now. Let's get together and blame Sam Pekinpah, okay? I thought the conclusion was pretty well done. After his wife is blasted to shreds by shotguns, an attractive young blond -- and old friend -- moves into his house in the woods and provides him with some emotional comfort. They once were quite close. Now -- see -- Baldwin's wife is gone, and he's got this little Latina girl that he's adopted, but there's a big hole in the nuclear family. (In other words, the guy needs a wife.) A conventional script calls for him to overcome his grief and fall in love with the reassuring and loving blond babe. But no. When he makes clear that he holds his wife's memory sacred, the blond leaves him a note and takes off, realizing he's not ready to get on with his life, as they say. The last scene has Baldwin in his house, gazing affectionately at his sleeping little girl, then falling on his back beside her. Sensing his presence she twists over and puts her arm around his chest, and he places his hand over hers and stares at the ceiling. It is not a cheap shot. It's a brief but genuinely tender scene, encompassing both love and the loss of it.",
         "Great work by the cast - not so great when it comes to the writing. Heaven's Prisoners lacked a couple of key elements in writing and the film suffered as a result. Once again Kelly Lynch did a fantastic job and made tremendous use of limited screen time. Baldwin wasn't too bad either. This probably ranks as one of his best performances along with The Hunt for Red October. Teri Hatcher was HOT. Overall - Heaven's Prisoners is worth renting - if only to check out the great work by a talented, if not successful, cast.",
         "Excellent flick. Caught me by surprise on TV, never heard of it. Very well done; all actors superb. Violent and good action yet slow enough to go deep. Interesting story and atmosphere down in Louisiana. Knowing that Alec Baldwin is from Long Island I thought the accent was done well enough to be convincing. I agree on someone's comment on the DEA agent/ friend. His character could have been more established but no real harm done. I really got into this movie.",
         "Excellent movie. Takes place in steamy sultry New Orleans. I love movies that really explore the city, and this is no exception. New Orleans is wonderful city, even though it will never be the same as it once was. Just like \"Tightrope\" and \"No Mercy\" New Orlens is one of the main characters of this film. Eric Roberts as a rich bad guy and Alec Baldwin as he ex-cop are excellent in this film. Mary Stuart Masterson did a great job too as a lovable stripper with a heart of gold. Did I mention that Teri Hatcher is naked in this film? Oh, yes she is. What I might say to her in this movie: \"No, I don't like your butterfly, but I like everything else around it\". He he.",
         "I put this film up there with \"Two Days in the Valley\", as one of the most entertaining of its genre of cops-excops-drugs-mob type movies. I think the main criticism of it has to do with the ruthless violence along with the revenge theme of Baldwin's part. But violence is as violence does in film. Although it ends abruptly, Baldwin's acting was still superb, and so was everyone else's acting. All the female actors did superb job, not just Teri Hatcher. The writers could have put more meaningful time and script into the DEA agent's role as he also had added some positive \"good guy\" vibe to it, although \"good-guy vibe\" was not 100% present in his role. It was unclear as to why he kept showing up the way he did in the movie. Writing further revelation of that into the movie could have been done and helped round out the movie more. They had a good actor in the role of the DEA agent, as well. Good acting in the role of Baldwin's Bayou employee.",
         "Ex-cop and ex-drunk Dave Robicheaux has got his life back and makes a living selling bait outside New Orleans with his wife Annie. When they witness a plane crash into the river, Dave saves a little girl and they decide to keep her since she has been orphaned. However, when they then get a visit from the DEA and some local heavies it is apparent that the plane was doing more than just carrying a few illegals and soon Dave finds his new life rapidly crumbling around him. Opening with a stylish and atmospheric semi to-camera confession, this film immediately caught my interest and managed to hold throughout despite not actually being that good. The film is set in the Deep South and is full or rather annoying mannerisms and clichés from that area that put me off a bit. Despite this, I still quite enjoyed it; the plot meanders out of control a bit and involves too many characters to really keep a tight emotional grip on the audience but it still have enough grit and tension to it to keep you watching. Some elements are better than others though - when the film focuses on Dave and his tough investigation it is great; but when it tries to expand (eg with Robin) it just comes across as baggy. The film hasn't got massive action scenes but it does have some good chases and moments of thrills - most notably a roof top chase across New Orleans. These are fine but the film does too much talking in slow southern drawls for my liking - also making the film feel a lot longer than it probably was! The talking is fine, but it does more than enough to set the tone and action - and then it keeps talking! Combine this with the characters and you have a film that can't help but feel baggy and slightly disjointed. The one thread that holds it all together though is Baldwin. He gives a great performance across the whole film; dealing well with the various emotions that it throws at him. Roberts is OK, certainly better than some other rubbish I've seen him in. Lynch is given little to do but look good in a bikini; Masterson is not cast well and doesn't fit into the trashy stripper role; Hatcher gets naked and looks good but her character is not dealt with that well by the script. The support cast includes Hall and Guilfoyle but this is Baldwin's film and, for it's other faults, he carries it with him. The direction is also good; using some very good shots to up the tension and the pace of the film at key moments - if only the editor had been a bit more persistent though. Overall this is a tough noir-ish thriller that works well for the majority despite feeling bogged down by dialogue and characters at times. If you can put up with the heavy Southern drawls and the iced-tea clichés then it is worth a look.",
         "while this movie does not really capture the flavor of Burkes \"prose\" it's nice to see recognition of one of fictions better characters. Noticeably missing is the character \"Clete Purcell\" who was Dave R's former NOPD homicide partner. I see that Tommy Lee Jones will tackle A TV version of another Robicheaux mystery of which 16 Robicheaux novels have been written. Moe action by Baldwin and an interplay between he and the missing Clete Purcell might have brought this movie along further into another feature. New Orleans is always the great mixture of characters and places for mystery, murder and mayhem. Alex Baldwin does a great job given some of the missing flavor of James Lee Burkes writing. Baldwin made a great looking \"Shadow\" as well with an unfortunate script.",
         "Not exactly faithful to the book but the film certainly delivers as an enjoyable thriller. Alec Baldwin is superb as Robicheaux, Lynch, Masterson and Hatcher are rather pretty and give the film what is needs but are mainly forgotten about as the film progresses. Roberts shows that he does have a great deal of talent to offer when it comes to a juicy part like this. The film isn't brimming with action thankfully but it has a number of lengthy and exciting action sequences. It seems to me that Baldwin is becoming something of the thinking mans action hero. Whilst Willis is off doing the brainless actioners Baldwin manages to get the intelligent movie. This is a fine example as is The Edge. Baldwin makes this movie stunningly enjoyable and the supporting actors help a little but Baldwin manages to carry the whole thing single handedly."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "PVM Entertainment",
         "Rank Organisation, The",
         "Ruddy Morgan Productions"
      ],
      "summaries": [
         "Ex-detective Dave Robicheaux has made a new life for himself and his wife Annie running a bait shop in the outskirts of New Orleans. When they save a little girl, the sole survivor of a plane crash, their lives become forever changed. They take the orphan child into their home and prepare to raise her. However, a visit from DEA agent Dautrieve brings out the detective instincts in Robicheaux and he begins to ask about the rest of the passengers. This brings trouble to Robicheaux and he turns to drug lord Bubba Rocque, a childhood friend. But the friendship becomes estranged when an assault on the Robicheaux home leaves one victim...Annie.",
         "Homicide detective Dave Robicheaux has quit the New Orleans police department, has stopped drinking, and is living in the swamplands with his wife Annie. Dave runs a bait-and-tackle shop in New Iberia. Things are fine until the day Dave and Annie, entirely by happenstance, are on the scene when a drug smuggler's airplane crashes into the bayou, killing a number of people. Donning scuba gear, Dave succeeds in rescuing one of the passengers, an El Salvadoran girl, whom Dave and Annie take home with them. Annie names her Alafair, after Dave's mother. The plane crash brings DEA agent Minos Dautrieve in to investigate. And the drug connection brings Dave bad memories from his life as a cop -- his childhood friend Bubba Rocque is now the leading pharmaceutical drug kingpin in the area, and Bubba has a seductive wife named Claudette. And Dave's old flame Robin Gaddis, a blond stripper, still has feelings for Dave. Dave decides to investigate the airplane crash, but there is someone who wants Dave to keep his nose out of it. Dave is threatened. The warning that he should mind his own business only pushes Dave harder into the case, and one night, Annie is shot dead while Dave is outside chasing intruders. Dave thinks Bubba and Claudette may have had something to do with it, and Dave won't stop until he finds Annie's killer.",
         "A hardened New Orleans cop, Dave Robicheaux, finally tosses in the badge and settles into life on the bayou with his wife. But a bizarre plane crash draws him back into the fray when his family is viciously threatened."
      ],
      "budget": 25000000
   },
   "movielensId": 731,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-17",
      "dvdReleaseDate": "2003-10-07",
      "directors": ["Phil Joanou"],
      "runtime": 132,
      "movieId": 731,
      "title": "Heaven's Prisoners",
      "mpaa": "R",
      "actors": [
         "Alec Baldwin",
         "Kelly Lynch",
         "Eric Roberts",
         "Teri Hatcher",
         "Mary Stuart Masterson",
         "Vondie Curtis-Hall",
         "Badja Djola",
         "Samantha Lagpacan",
         "Joe Viterelli",
         "Tuck Milligan",
         "Hawthorne James",
         "Don Stark",
         "Carl A. McGee",
         "Paul Guilfoyle",
         "Chris Krisea"
      ],
      "imdbMovieId": "0116508",
      "originalTitle": "Heaven's Prisoners",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["hwuRDxzitek"],
      "plotSummary": "A hardened New Orleans cop, Dave Robicheaux, finally tosses in the badge and settles into life on the bayou with his wife. But a bizarre plane crash draws him back into the fray when his family is viciously threatened.",
      "tmdbMovieId": 36915,
      "avgRating": 2.9223,
      "releaseYear": "1996",
      "numRatings": 888,
      "posterPath": "/tJ61l57S7iMiHgzZJHehpfxjt2V.jpg"
   }
}