{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "loyalty",
            "id": 1797
         },
         {
            "name": "sheep",
            "id": 3020
         },
         {
            "name": "innocence",
            "id": 6139
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "framed",
            "id": 15124
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "animal",
            "id": 18165
         },
         {
            "name": "sheep rustling",
            "id": 182287
         },
         {
            "name": "wallace & gromit",
            "id": 210009
         }
      ],
      "imdb_id": "tt0112691",
      "video": false,
      "title": "A Close Shave",
      "recommendations": [
         531,
         530,
         14447,
         533,
         54825,
         13930,
         11898,
         13928,
         14320,
         53210,
         13927,
         13925,
         194113,
         11787,
         13062,
         52954,
         10608,
         11167,
         11533,
         74961
      ],
      "backdrop_path": "/mATUzBPKf8CHXCdnZWPmnXS2m2O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Wallace (voice)",
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e63",
               "name": "Peter Sallis",
               "profile_path": "/8vMFK2SJFzQbtEIj4FU7adyhCGM.jpg",
               "id": 7317,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Wendolene (voice)",
               "gender": 1,
               "credit_id": "5545798e92514158650055b3",
               "name": "Anne Reid",
               "profile_path": "/6YgtxvIE1NXZCLMJs4ryQjCiZPI.jpg",
               "id": 77287,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e5f",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57293c289251414e190001f3",
               "name": "Michael Salter",
               "profile_path": null,
               "id": 1454685,
               "department": "Art",
               "job": "Other"
            },
            {
               "gender": 2,
               "credit_id": "5728df9f92514114750014ad",
               "name": "Bob Baker",
               "profile_path": null,
               "id": 7315,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5728dfb0c3a3684b58002cc1",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5728dfd69251417566000a2c",
               "name": "Peter Lord",
               "profile_path": "/fBaZLXX3rBwhSXvtplQEtvW7VS3.jpg",
               "id": 53304,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5728e0109251413568001184",
               "name": "Michael Rose",
               "profile_path": null,
               "id": 1345578,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5728e02dc3a3685c37002884",
               "name": "Carla Shelley",
               "profile_path": null,
               "id": 1082203,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5728e04d9251417566000a45",
               "name": "David Sproxton",
               "profile_path": "/zVeJRzQaIvENbOUbhMgP4DkgK7W.jpg",
               "id": 53329,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5729377ec3a36820a7000023",
               "name": "Julian Nott",
               "profile_path": null,
               "id": 7657,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "572937a29251414e100001b4",
               "name": "Dave Alex Riddett",
               "profile_path": null,
               "id": 1119834,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "572937c09251414e19000173",
               "name": "Helen Garrard",
               "profile_path": null,
               "id": 937612,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "572937dfc3a36808f30001cb",
               "name": "Phil Lewis",
               "profile_path": null,
               "id": 1119837,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57293898c3a36808fc0001c6",
               "name": "Paul Hamblin",
               "profile_path": null,
               "id": 1343898,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "572939139251414e100001d4",
               "name": "Adrian Rhodes",
               "profile_path": null,
               "id": 7659,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "5729392dc3a36808fc0001d1",
               "name": "Jack Stew",
               "profile_path": null,
               "id": 1393300,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "572939719251414e060001b4",
               "name": "Nic Raine",
               "profile_path": null,
               "id": 557706,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "572939cc9251414e0a000214",
               "name": "Simon Rhodes",
               "profile_path": null,
               "id": 1393351,
               "department": "Sound",
               "job": "Scoring Mixer"
            },
            {
               "gender": 0,
               "credit_id": "57293b449251414e190001b8",
               "name": "Mike Booth",
               "profile_path": null,
               "id": 554218,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 0,
               "credit_id": "57293cc7c3a36808f000025c",
               "name": "Nick Upton",
               "profile_path": null,
               "id": 138939,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "57293d6dc3a3680902000298",
               "name": "Harry Linden",
               "profile_path": null,
               "id": 34899,
               "department": "Crew",
               "job": "Other"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.113261,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 532,
      "vote_count": 276,
      "budget": 0,
      "overview": "Wallace falls in love with wool-shop owner Wendolene, not suspecting that she (or rather, her dog) is at the head of a fiendish sheep-rustling plot. Gromit is set up and jailed, but his new-found sheepish friend is determine to give Wallace a helping hand in finding out the real truth.",
      "similar": [
         9598,
         28178,
         1429,
         424488,
         10948,
         10345,
         531,
         257091,
         263109,
         530,
         328111,
         1598,
         13377,
         10063,
         29264,
         10481,
         10710,
         47354,
         49361,
         11494
      ],
      "original_title": "A Close Shave",
      "runtime": 30,
      "poster_path": "/efFW4euBJIha6WVJoBPSfyui2Aa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ykJbf1z5qIreJrHWfnh1ev1alkD.png",
         "name": "Aardman Animations",
         "id": 297,
         "origin_country": "GB"
      }],
      "release_date": "1995-12-24",
      "vote_average": 7.5,
      "belongs_to_collection": {
         "backdrop_path": "/huyrvVKEKa9czUY89fnvaAVAtkX.jpg",
         "name": "Wallace & Gromit Collection",
         "id": 529,
         "poster_path": "/993pCCMO9g9RQUtNDxQgE1B330H.jpg"
      },
      "tagline": "From the Oscar-winning creator of A Grand Day Out and The Wrong Trousers.",
      "adult": false,
      "homepage": "http://www.wallaceandgromit.com/films/a-close-shave",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Park"],
      "runtime": 30,
      "synopsis": null,
      "writers": [
         "Bob Baker",
         "Nick Park"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112691/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMzY5NjQ1NF5BMl5BanBnXkFtZTcwNTk5MTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Sallis, Anne Reid | See full cast and crew »"],
      "reviews": [
         "This was the third in a series of three short BBC programs featuring Wallace and his pet dog Gromit. I thought the three films got better and better as went along, this being the best of the three. There are some very clever and entertaining scenes in the 30-miunte movie. the color also was good - nice animation. Of course, it's only gotten better and better since these were made, capped off recently by a full-length Wallace & Gromit film. I don't think I ever stop laughing looking at the mouths on Wallace and the woman he likes in this story. Wallace is a window cleaner and \"Wendolene\" is the object of his affections. Unfortunately, both the woman and her pet dog are not good \"people.\" In fact, her pet dog, \"Preston\" frames poor Gromit for sheep-rustling and winds up in jail. Wallace must rescue him. A subplot involves Wallace and his love of cheese. It's all silly, of course, but very entertaining and the best of the three short Wallace & Gromit animated films of the period (1989-1993), in my opinion.",
         "Of all the W&G films A Close Shave is by far the best of all. Not only is the animation far more polished & detailed than its earlier predecessors, A Grand Day Out (1992) and The Wrong Trousers ('93). But in addition the story is far more engaging, light & humourous compared to the darker more mechanical nature of TWT (my least favourite of the three). For the first time, A Close Shave introduces an extra dimension to the W&G pairing, in the form of Wendolene, a lady woolshop owner who Wallace falls in love with when both he & Gromit clean her shop windows. With the addition of a female into the story we are given a little more character development concerning Wallace. The previous two stories only centred around his self-serving interests in cheese, inventions, making money and relying on his pet pooch to get him out of sticky situations. But in ACS we are offered a more rounded perspective of his personal life and his keeness to have a woman sharing his home at long last. As the film progresses the relationship between the couple grows, in spite of all the dangers & hazards that they face along the way. And by the end of the film we are left on tenterhooks as to whether Wendolene will finally move in with W&G for good! So not only is the animation and attention to detail significantly improved over TWT but so too is the characterisation and storyline. The voice of Wallace, Peter Sallis, is dependable & easy on the ear, even though he doesn't have much to say compared to the previous films. But it is to Gromit where the real plaudits lie. Because he can't speak (or bark apparently!) we have to rely on his facial expression to understand how he feels & reacts to those around him. Because of the wonderful attention to animated detail Nick Park and his crew have spent, we can connect & relate very easily to Gromit's body language, especially within his eyes. I don't think I've ever seen such wonderful expressions since Laurel & Hardy. In fact the next time you have the benefit of seeing a L&H film take note of Ollie's facial expressions to-camera and you'll understand the comparison between him & Gromit. Its now 6 years since the last W&G installment and it is to be hoped that Nick Park will do another follow up. I only hope he doesn't rely on lifeless cgi for his animation technique. On average it took NP between 2 to 3 years for each of the W&G episodes. But it was worth the wait. However, the Dreamworks Studio to which NP is affiliated, may not like having to wait such a long time for the next installment to be made, a may insist on using computer animation rather than clay to speed the production process up somewhat. Chicken Run (2000), NP's first full-feature movie in conjunction with Dreamworks was, on the whole, ok. But the story seemed so formulaic & safe that you just knew the studio had \"influenced\" the production more than NP would have liked. And as a result you get a bland film built on hype. So I only hope the next W&G doesn't follow the same route otherwise the entire W&G franchise will be ruined for the sake of the mighty dollar yet again. ****/*****",
         "Wallace and Gromit: A close shave has to be my favourite out of all four Wallace and Gromit movies. It has better clay animation then the other two, the story is excellent, it is never boring (with A Grand Day Out I found some scenes boring) and you can even watch it two times in a row its that good! In Wallace and Gromit's adventure there is a sheep rustler, Wallace falls in love and Wallace and Gormit are ensare in a malevolent mystery only they can unravel. I saw a close shave years ago but I still really like it all these years later, I think most people that see the Wallace and gromit like them and like them still years later. Thats whats great about all the Wallace and Gromit movies adults and children alike can enjoy them. Overall I think this is the best in the Wallace and Gromit series and I highly recommend it!",
         "Wallace and Gromit are working as window cleaners when Wallace meets Wendolene \u0096 the owner of the local wool store and falls in love. Gromit stumbles across a plot to kidnap sheep to make them into food but is framed for a sheep murder before he can do anything. Can Wallace get Gromit out of jail in time to foil the sheep rustlers? By this stage Christmas on the BBC was basically better known as the time when we get the new W&G film rather than for the birth of the son of God. This film was THE focus for Christmas day \u0096 ITV did everything but stop broadcasting at the same time as this was on \u0096 who would want to compete with this?! Happily it doesn't disappoint. The plot is silly but incredibly well thought out and very imaginative. The comedy is as bright and breezy as ever \u0096 getting to kids without resorting to lazy clowning or stupid sight gags and also reaching adults without lacing the film with innuendo or hidden smut. Instead it is just a clever mix of wit and humour that really hits the mark. On Christmas Day it's easy to sit and doze through anything but this made me sit up and pay attention The characters are as good as ever. As always Wallace is solid and wonderfully eccentric while Gromit is the real brains behind everything working. Gromit is my favourite character but here he is upstaged by the oh-so-cute Shaun the sheep (on his way to a merchandising boom!). Shaun is more for kids but Gromit still steals many scenes. Wendolene (gettit?) is not so good and the scenes with Wallace and her don't work as well as the rest. Overall this is very funny despite just falling short of the mark set by `The Wrong Trousers'. Word is Park is currently writing a W&G movie \u0096 I can't wait!!!!",
         "Oh, if only this great, great movie wasn't so short! WALLACE AND GROMIT: A CLOSE SHAVE is one of the best and most original movies ever made. Every hilarious and charming character is made out of clay, so it takes the committed claymators a horribly long time to film everything, but boy does it look good. The story is about Wallace (voiced by the incomparable Peter Sallis, and the equally good Claes Månsson in the dubbed Swedish version) and his clever dog, Gromit, who usually has to clean up the messes his master gets himself into. Working as window cleaners, Wallace falls in love with Wendolene, who sells wool together with her dog, Preston, who isn't very fond of Gromit. After Gromit gets life in prison after being set up by Preston, it soon turns out that Wendolene and her dog are up to no good. The movie has the best plot twist since perhaps \"I am your father\", so I won't give it away. The voice acting is passionate and great, and the claymation is also beautiful. The unique characters and story are very imaginative, the cutest character being Shaun the sheep (who wears a sweatshirt made of his own fur after Wallace accidentally shaved him). A short, but very tragic, funny, exciting, and touching work of art by the incomparable Nick Park and the Aardman animation studios. I love this classic movie more than any movie and I hope that the upcoming third sequel, \"Curse of the wererabbit\" won't suck or be too American (fart humor). 10/10! If I could give it 20 I would!",
         "STAR RATING: ***** The Works **** Just Misses the Mark *** That Little Bit In Between ** Lagging Behind * The Pits The resurgence in popularity of the plasticine two-some has caused me to also seek out this 1995 entry into the series, the last short film and the only other one I've seen (I don't think I got round to A Grand Day Out.) This time, dodderingly traditional Yorkshire-man Wallace and his faithful manservant Gromit have come up with a spot of bother in the shape of a mysterious pest that's leaving holes in everything in the house, especially the cheese! Wallace won't be having this and vows to investigate! But, first things first, him and Gromit have to run their new window-cleaning service, and their latest customer is Wendolene, who runs a wool shop left to her by her departed father. But, aside from providing a tricky love interest for Wallace, she also has a brutish looking pet dog. And, after a series of local sheep are killed for their fur, the finger of suspicion points somewhere. Technically, this is as fine as TWT and it's very funny in parts, but the plot here just feels a bit disjointed and over-whelming compared to the smoother flow of the plot to TWT. But it's still a far-cry from bad, as such impressive model craftsmanship would be, with Park's twisted blur between the laws of man and animal as high as ever, as Gromit is dealt with not by the RSPCA after being wrongfully convicted of sheep-murder, but the police and jail! ****",
         "A lone sheep, later named Shaun, escapes from a sheep rustling plot and hides in the home of eccentric inventor Wallace and his long-suffering dog/best pal Gromit. A silent but deadly canine down at the wool shop appears to be the mastermind behind the plot and frames Gromit for the rustling scam. With a little help from Shaun, Wallace must rescue Gromit and catch the real crooks. There are more laughs and jokes in this half-hour short than most feature-length comedies manage in their entire running time. Nearly every frame has some kind of wit or imagination. The world of Wallace and Gromit, much like the stop-motion world of Postman Pat, is an incongruous mix of post-war Northern countryside crossed with sci-fi and a touch of horror. The horror themes would be explored in greater depth with Curse of the Were-Rabbit but it's handled with more care and sly invention here than in most slasher sequels. A fun time. Catch it on its inevitable Xmas Day screening.",
         "I love Christmas for many reasons but one of them is that the BBC always (and I do mean, ALWAYS) show the Wallace & Gromit shorts, this being the third and the last one before their recent big-screen adventure \"The Curse Of The Were-Rabbit\". It was also the first time Park decided to really push the boat out and you can see how much fun he is having with the characters. This is almost as good as \"The Wrong Trousers\" but is much more ambitious in scope and scale. For the uninitiated (and quite frankly, where have you been?), Wallace (once again voiced by Peter Sallis) is an inventor living in northern England with his long-suffering dog called Gromit. This time, the pair have a window-cleaning service on offer and it's via this that Wallace meets a woman called Wendolene (Anne Reid) and promptly falls in love. But this isn't good news for Gromit who finds himself framed for sheep rustling. Soon, it's up to Wallace and a slightly scrawny sheep called Shaun to rescue the pooch from prison and discover who is behind the sheep shortage. This feels more like a big-budget production than the earlier shorts, though there are still moments when fingerprints can be seen on a character's nose. This is also a perfect example of true family entertainment, warming all but the coldest of hearts and keeping adults as joyously amused as kids. It's genuinely funny, wonderfully inventive and a sheer joy from start to finish. The highlight for me is the brilliant night-time pursuit of the sheep rustlers with the motorcycle sidecar, a porridge cannon and a small army of woolly hostages balanced in a sheep-pyramid. Fantastic from start to finish - if you want consistently good family entertainment then look no further than Wallace & Gromit.",
         "Just thinking about stop motion animation makes one think of a slow and tedious process of moving everything in the frame scene by scene. It takes forever (seemingly), and just two years after Wallace and Gromit's last adventure, we get this superbly animated, well thought out short film, that is actually as exciting as many live action adventure pictures. Proof that Nick Park and crew are about quality, because after the success of \"the Wrong Trousers\" it would be easy to cash in on a less than great installment, but thankfully for us, that's not the case. A mysterious wool shortage has plagued the town where Wallace and Gromit, who are now cleaning windows, live. What lies before this man and dog duo is a love interest, a sheep rustling murderous dog, and a lot of sheep. When thinking of the original three Wallace and Gromit shorts, I've always put this one and the Wrong Trousers nearly on par as perfect shorts, and while I still feel that way, this one falls a little short of their second adventure, and yet this has nothing really wrong with it to make it worse. When you have two perfect shorts, one is going to probably be favored over the other, and the lack of talking and pure clay animated suspense that \"Wrong Trousers\" produced stands above this equally wonderful, but more grandiose outing. Either way, this is seriously great, and one of the greatest short films out there. The animation has improved greatly since \"The Wrong Trousers\". The animation is smoother, the sets are more three dimensional and the town in which they live in is given more of a personality, and fingerprints aren't as prominent on the figures. And the animation on the action sequences is superb. The last film gave us the hilarious train sequence, and this one gives us many action sequences, most notably being the motorcycle chase and the oatmeal machine gun shootout which are both spectacular and hilariously implausible. The whole five (or so) minute chase scene in the film is seriously as interesting, well thought out, and action packed as most regular action flicks, and it manages to be so without any violence or explosions. Truly a testament to the writing and animation of this thing. Composer Julian Nott is also a huge part of this film. His music sounds like a mix of suspenseful thriller music, and a German polka...an unlikely combination, but one that fits so perfectly, giving the scenes a playful bounce, along with a \"something bad is going to happen\" feel. A new addition to the score for this film that wasn't in the previous two was the love theme which is almost a parody of love themes, but one that stands on it's own and also works perfectly in the scenes. Wallace and Gromit represent not just quality animation, but also top notch writing, well thought out jokes and gags, fantastic direction from Nick Park, and proof that animation is not just for kids. Nick Park and the team at Aardman animation can easily be thought of as the Pixar team of England. My rating: **** out of ****. 31 mins. Not rated, but good for the whole family.",
         "Wallace and Gromit has proved that over the years, they can still entertain. This episode is not quite as funny as Wrong Trousers, but there was never a dull moment. I loved the love subplot with Wendolene and Wallace, and it never distracted from the story, otherwise it would have gone downhill. Shaun the Sheep is so cute as himself, and Gromit proves his facial expressions are still funny. I loved Wendolene and Preston, but my favourite in this episode were the sheep. That scene with the motorcycle pursuing the van, and the sheep on the ladder, was priceless. Another funny scene was the jailbreak, when Wallace slips on the soap, and the sheep come crashing down on him. There is a touch of heartbreak here also, as you feel so sorry for Gromit. In conclusion, a brilliant short and a must see! 10/10 Bethany Cox"
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Crime",
         "Family"
      ],
      "productionCompanies": [
         "Aardman Animations",
         "BBC Bristol",
         "Wallace & Gromit"
      ],
      "summaries": [
         "When Wallace and Gromit go over to wash windows, Wallace falls in love with a wool store owner named Wendolene. Meanwhile, Gromit is framed for killing sheep and is put in jail. So with help from the sheep and Wendolene, Wallace must get him out of prison.",
         "Wallace falls in love with wool-shop owner Wendolene, not suspecting that she (or rather, her dog) is at the head of a fiendish sheep-rustling plot Gromit is set up and jailed, but his new-found sheepish friend is determine to give Wallace a helping hand in finding out the real truth. Hurrah for Wallace and Gromit!",
         "Wallace and Gromit become involved in a sheep rustling operation run from the local wool shop. Wallace falls for Wendolene, the shop owner, while Gromit is framed for the rustling by her pet dog.",
         "When Wallace and Grommit set themselves up as window cleaners, you know it's going to be a paneful experience. Wallace takes a shine to Wendolene, a local shopkeeper whilst Grommit becomes the victim of a smear campaign. Can Grommit get his name cleared as well as his windows? Who is behind the spate of sheep rustling and will they come quietly? But most importantly, can Wallace find a cure for his cheese fetish before he finally goes crackers?",
         "Wallace falls for Wendolene, a wool shop owner, while Gromit is framed for the sheep rustling."
      ],
      "budget": 0
   },
   "movielensId": 745,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-24",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["Nick Park"],
      "runtime": 30,
      "movieId": 745,
      "title": "A Close Shave",
      "mpaa": "NR",
      "actors": [
         "Peter Sallis",
         "Anne Reid"
      ],
      "imdbMovieId": "0112691",
      "originalTitle": "A Close Shave",
      "genres": [
         "Family",
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "KtmmI9JCCUo",
         "36GfaI0_B8E"
      ],
      "plotSummary": "Wallace falls in love with wool-shop owner Wendolene, not suspecting that she (or rather, her dog) is at the head of a fiendish sheep-rustling plot. Gromit is set up and jailed, but his new-found sheepish friend is determine to give Wallace a helping hand in finding out the real truth.",
      "tmdbMovieId": 532,
      "avgRating": 4.11014,
      "releaseYear": "1995",
      "numRatings": 13796,
      "posterPath": "/efFW4euBJIha6WVJoBPSfyui2Aa.jpg"
   }
}