{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "numbers racket",
            "id": 157138
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0040366",
      "video": false,
      "title": "Force of Evil",
      "recommendations": [
         17487,
         35956,
         29481,
         28297,
         2912,
         31713,
         36786,
         34667,
         25918,
         25955,
         20945,
         1834,
         44098,
         19119,
         31532,
         42678,
         20442,
         22112,
         25726,
         26530
      ],
      "backdrop_path": "/e9aYe86CttMkpf7oulEtMqmZjNy.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "531ed2fbc3a3685baa001de5",
         "content": "Black sheep like to make everybody else look black. \r\n\r\nForce of Evil is directed by Abraham Polonsky, who also adapts the screenplay from the Ira Wolfert novel Tucker's People. It stars John Garfield, Thomas Gomez, Beatrice Pearson, Marie Windsor, Howard Chamberlain and Roy Roberts. Music is by David Raksin and cinematography by George Barnes. Plot finds Garfield as lawyer Joe Morse, who works for powerful gangster Ben Tucker (Roberts). Tucker has a plan to control all of the numbers rackets in New York, something that with the fix on the numbers up and coming for the 4th July, will see all of the smaller number rackets go bust. This is a problem for Morse because his big brother Leo (Gomez), is one such operator, an honest good guy who did everything he could to ensure that Joe had a proper start in life. \r\n\r\nIt has come to be regarded as an influential and important movie in the film noir pantheon. Big critics, big film makers and film noir aficionados, all have queued up to salute Polonsky's film. If it's worthy of such elegant praise will always be debatable, but film does have a uniqueness about it, using stylised dialogue passages and in opening up a corrupt and socially bankrupt can of worms for the cinema loving world, Polonsky has crafted a thematically potent 1940's crime picture. The exchanges between Garfield and love interest Pearson, have an almost poetic flow to them, this in a film that for most of its running time shows that badness can not be beaten, or at best that it can't be railed against or broken away from so easily. While the biblical tones, both allusions and allegorically speaking, also give the picture some added power. Though mostly talky in the main, it does burst into shocking violence for its final quarter, with a finale that contains distress segueing into the possibility of spiritual regeneration…or maybe that, too, will prove futile? \r\n\r\nAdded to the biting narrative are great cast performances and evocative music scoring, and with skilled location photography adding authenticity, it's not hard to see why it has come to be so revered. Not as bleak as the title suggests, and veering a bit close to being too arty for its own good sometimes, but still a fine experience and it rewards more on further viewings. 8/10",
         "url": "https://www.themoviedb.org/review/531ed2fbc3a3685baa001de5"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Joe Morse",
               "gender": 2,
               "credit_id": "52fe4516c3a368484e047d9b",
               "name": "John Garfield",
               "profile_path": "/erQR0rXqGHwVBkXV8rNAj0auD1d.jpg",
               "id": 81970,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Leo Morse",
               "gender": 2,
               "credit_id": "52fe4516c3a368484e047d9f",
               "name": "Thomas Gomez",
               "profile_path": "/7CNFFi9FG1Jc6ngmnZY3MGcK4zx.jpg",
               "id": 18646,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Edna Tucker",
               "gender": 1,
               "credit_id": "52fe4516c3a368484e047da3",
               "name": "Marie Windsor",
               "profile_path": "/dy2787JbnskmAt2vjYTjYfFOYRx.jpg",
               "id": 3340,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Freddie Bauer",
               "gender": 0,
               "credit_id": "52fe4516c3a368484e047da7",
               "name": "Howland Chamberlain",
               "profile_path": "/c9YuYib0HRSNcqCLan34ObxStQS.jpg",
               "id": 96137,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ben Tucker",
               "gender": 2,
               "credit_id": "52fe4516c3a368484e047dab",
               "name": "Roy Roberts",
               "profile_path": "/zKGk6q2As8QFkE4V0OHD3JmF4yA.jpg",
               "id": 19400,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Bill Ficco",
               "gender": 2,
               "credit_id": "52fe4516c3a368484e047daf",
               "name": "Paul Fix",
               "profile_path": "/5uySf96UVra95Ru24YvbjLuiBS5.jpg",
               "id": 8496,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Det. Egan",
               "gender": 2,
               "credit_id": "52fe4516c3a368484e047db3",
               "name": "Barry Kelley",
               "profile_path": "/q1t3gNvtx0A4pGHEGUJATuMIrwZ.jpg",
               "id": 89834,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hobe Wheelock",
               "gender": 0,
               "credit_id": "52fe4516c3a368484e047db7",
               "name": "Paul McVey",
               "profile_path": "/j6lkbAjxQnNlYQMa2NuPQ7OTubF.jpg",
               "id": 30513,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Doris Lowry",
               "gender": 1,
               "credit_id": "52fe4516c3a368484e047dbb",
               "name": "Beatrice Pearson",
               "profile_path": null,
               "id": 96138,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Frankie Tucker (uncredited)",
               "gender": 2,
               "credit_id": "5581254092514144a30012e6",
               "name": "Beau Bridges",
               "profile_path": "/xv6sDCHxHvBgCK4y96H32kxgcdr.jpg",
               "id": 2222,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Link Hall (uncredited)",
               "gender": 2,
               "credit_id": "5581256192514144a70012b8",
               "name": "Arthur O'Connell",
               "profile_path": "/rWoLpGwQlIZSiPIzJqE1yIMiDxr.jpg",
               "id": 857,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4516c3a368484e047d85",
               "name": "Abraham Polonsky",
               "profile_path": null,
               "id": 81976,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4516c3a368484e047d8b",
               "name": "Abraham Polonsky",
               "profile_path": null,
               "id": 81976,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4516c3a368484e047d91",
               "name": "Ira Wolfert",
               "profile_path": null,
               "id": 96135,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4516c3a368484e047dc1",
               "name": "David Raksin",
               "profile_path": "/4XgFLYDkcoMYPcxYmD2Z9ksgOPO.jpg",
               "id": 18593,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4516c3a368484e047dc7",
               "name": "George Barnes",
               "profile_path": "/rSN2fSx7HyorrMdBQ5IyIkskvYW.jpg",
               "id": 3356,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55cdd3589251413196001aa5",
               "name": "Jack Baur",
               "profile_path": null,
               "id": 7511,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55cdd3b4c3a3681bf000189d",
               "name": "Bob Roberts",
               "profile_path": null,
               "id": 95270,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 5.397603,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26744,
      "vote_count": 40,
      "budget": 0,
      "overview": "Lawyer Joe Morse wants to consolidate all the small-time numbers racket operators into one big powerful operation. But his elder brother Leo is one of these small-time operators who wants to stay that way, preferring not to deal with the gangsters who dominate the big-time.",
      "similar": [
         14638,
         996,
         513285,
         910,
         9348,
         247,
         5503,
         2502,
         1724,
         27576,
         599,
         76341,
         289,
         642,
         390043,
         294254,
         291805,
         201088,
         260346,
         256591
      ],
      "original_title": "Force of Evil",
      "runtime": 78,
      "poster_path": "/piKroeALv3ckaZe9QroagMDfVse.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Roberts Pictures Inc.",
            "id": 19760,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Enterprise Productions",
            "id": 3333,
            "origin_country": ""
         }
      ],
      "release_date": "1948-12-25",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Abraham Polonsky"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "Abraham Polonsky",
         "Ira Wolfert"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040366/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5NjgyMDY1NV5BMl5BanBnXkFtZTcwNTYyNTUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: John Garfield, Thomas Gomez, Marie Windsor | See full cast and crew »"],
      "reviews": [
         "This is a gripping film noir, dark and despairing in mood, co-written and directed by Abraham Polonsky, shortly before he was blacklisted in Hollywood for his left-wing views. Those views are perhaps implied in the plot, which is about the illegal numbers game, and the attempt of a big operator to gain a monopoly of the racket in New York. The film shows how everybody from the individual punter putting a few cents on a number to the gangsters making a fortune out of the operation is soiled by the racket. For Polonsky, the numbers game may have symbolised capitalism as a whole, with both bosses and workers being corrupted by the system. However, the details of the plot are less important than the mood, characterisations and visual aspects of the movie. John Garfield is brilliant as the charming, amoral lawyer Joe Morse, a Mr Fixit for racket-boss Ben Tucker (Roy Roberts). Thomas Gomez plays Joe's sick, world-weary brother Leo, who also runs an illegal numbers game, but independently of the mob, in an honorable and decent fashion. Some of the best scenes in the film show Joe trying, as he sees it, to help Leo by bringing him into Tucker's operation, while Leo resists and berates Joe for using his ability and education in such an ignoble cause. Much of this intense dialogue is reminiscent of that in plays by Clifford Odets or Arthur Miller. Also compelling, but with a lighter feel, are scenes between Joe and Doris (Beatrice Pearson) a quiet but assured young woman who works for Leo. Joe adopts slick patter, and runs himself down, in an attempt to gain her sympathy. Also in the movie, but with a disappointingly small part, is Marie Windsor, as Edna, Tucker's wife; in a longer, more commercial, film, her role of femme fatale would almost certainly have been expanded. But it is the sets, location work, cinematography and editing which lift the film above the average. Practically every scene and shot has visual interest, and it is definitely one film you want to go on longer than its allotted 80 minutes.",
         "Superficially, \"Force of Evil\" can be considered a film noir and gangster movie. But it is so much deeper than that. The very bleak message I got from the film is that even decent people must submit to corruption to survive. The character of Leo, superbly played by Thomas Gomez, is inherently honest and noble but he must live and work in the naturally shady numbers racket. He knows that he will be eventually crushed. This knowledge makes Leo one of the most bitter and tragic characters in film...a decent man whose life is dominated by futility. The protagonist of the film, portrayed by John Garfield, is Leo's brother. He has ridden his job as a sleazy mob lawyer to a life of fame and ease. He has everything Leo doesn't. Yet despite his blustery banter, he,too,is uneasy with his position. He knows Leo is headed for disaster and pulls all the strings he can to protect him, even though Leo reacts to him with contempt. Their relationship is doomed by the corrupt methods both use to survive. Garfield's character finds redemption of a sort by the film's end but not before inevitable tragedy has struck. There are many more levels to this complex film and discussion of them all could fill many pages. Above all, it is a beautiful movie,expertly directed with tremendous black and white imagery. The dialogue combines snappy patter with almost poetic sensibility. And the performances of all concerned are top notch. This is truly a treasure of cinematic art. Be prepared to think deeply when you watch it",
         "The subject of the movie might not interest everybody.But it does not matter because it's mainly a criticism of capitalism.And anyway,Polonsky's directing is so stunning that remarkable sequences abound all along the movie : -The two arrests ,with the poor guy suffering from claustrophobia. -The very short scene when Garfield is frightened by his telephone,and the one when he uses it as a weapon. -Garfield in the street ,alone,surrounded by the huge buildings ,with this statue which seems to point him out. -Bauer's death in the cafe ,a film noir peak. -Garfield's desperate final search,when he finally redeems his soul. Hints at Genesis make Garfield and Gomez new Cain and Abel.They are both excellent ,especially Gomez who seems to die in every sequence ,exhausted,jaded,disheartened .The two female parts follow suit:Windsor is cynical ruthless and femme fatale to the core;Pearson provides the movie with its only ray of light.She epitomizes innocence,loyalty and tenderness.Her luminous face radiates and illuminates the whole movie. \"Force of evil\" is a film noir extraordinaire.Some will say it's doctrinaire,Marxist ,but it has intellect and talent going for it.",
         "Martin Scorsese has hailed this film as one of the forgotten masterpieces of the film-noir genre. He took it a step further by resurrecting the film from the vaults and teaching it at NYU in the late 60's. He said it was the first film he ever saw that related \"to a world he knew and saw.\" Indeed, the film's realism and location shooting is great to see, especially Wall Street circa 1948. Those scrapers have stood for a long time. This is not traditional noir, however. It is an excellent study of a personal battle between two brothers. Joe (John Garfield) is a rich, corrupt mob lawyer, not unlike Duvall in the Godfather flicks. His older brother Leo (A great actor named Thomas Gomez) is a banker trying to live on the \"up and up\". The relationship is a tragic one. Thomas Gomez must be one of the most underrated actors of his day. He steals every scene he's in with the quick-talking Garfield, who was so good in THE POSTMAN ALWAYS RINGS TWICE. This may be familiar to fans of RAGING BULL, where both sets of brothers in two very different films love each other, but have a difficult time displaying affection. Two fabulous scenes stand out and would be impossible if shot in color. The first occurs when Garfield stumbles upon a darkened office with his door slightly ajar. The light from his office cuts through the middle of the screen, allowing Garfield to snoop. Another is the shootout at the film's climax, where all of the three shooters are lying in the shadows, creating suspense based on what we cannot see. It is all done in a very impressionistic way, a superb use of lighting and shadow. This is black and white at its best. Pure and evil. A truly great film. I would stay focused on the scenes between Gomez and Garfield. This sad brotherhood plays incredibly against a brilliant backdrop of crime and double-crossing. FORCE OF EVIL is another reminder of how good Hollywood films of the 1940's were. Without them, we probably would not have the classics of the past 25 years.",
         "Oft times an author's first major work is his/her best work. This is true for director Abraham Polonsky. Had Polonsky not been blacklisted by the Hollywood and Congressional bigots who knows what he might have done. Certainly his earlier script for \"Body and Soul\" is one of the best in movie history. Since he was later blacklisted by the power hungry hooligans of the nation, it is easy to read too much Marxism and Communist psycho-babble into \"Force of Evil.\" In pointing out that there is not much difference between underworld numbers banking and banking in the world of acceptable business, Polonsky is utilizing social and political criticism, not of necessity a Marxist slant. Marxism is an entire Utopian recreation of the economic world order, not artistic expression and intellectual conceptualization as presented by Polonsky in \"Force of Evil.\" The director/writer is also concerned with moral bankruptcy in justifying evil as a means of rationalizing big profits from illegal activities. There is a spin off story concerning two brothers, one of whom has warped scruples who helped his younger brother become a successful if now corrupt corporate lawyer with no scruples until tempered by the seemingly innocent babe in the woods Doris Lowry (Beatrice Pearson) who in reality has questionable morals herself yet clothed in hypocrisy. Both Doris and Leo Morse (Thomas Gomez)are pursued by their own demons. The viewer has to determine where the moral depravity or evil actually lies and with whom. The title \"Force of Evil\" could just as well be \"THE Force of Evil,\" since evil tends to be almost omnipotent that every mortal is tempted and it takes very strong souls indeed to resist and remain true to heart. It's much easier to make a deal with the devil in the fashion of Faust and to take the wrong highway at the crossroads. The brilliant John Garfield who left this world much too soon never gave a poor performance. Only Garfield could have done justice to the complicated complex character of Joe Morse. Yet Thomas Gomez stays up with Garfield all the way and nearly steals the show as Joe's impenetrable sibling whose persona appears one-dimensional on the surface until one begins to scratch away the enamel. A delectable bonus for the viewer is the magnetic New York City photography that takes on the appearance of Edward Hopper paintings, as Polonsky intended. All the exterior shots are to be savored but one that sticks in the mind long after the film ends is near the final credits when Joe seeks where his brother Leo's body has been dumped. The narration by Joe tells it all as he runs in a desperate gait downward toward the murky water, with Doris trying to keep up but mainly just watching. One of the neglected movie gems of the 1940's, not to be missed.",
         "The VHS version I own of Force of Evil is one with a forward by Martin Scorsese. In it Scorsese says that this film was the first one that depicted a world he knew, growing up in New York City. Scorses was mesmerized by it as a kid and studied it frame by frame as when he grew up. He pays tribute to Force of Evil saying that you can see the influence of it Mean Streets, Raging Bull, and Goodfellas. Of course the fact that the film was shot totally on location in scintillating black and white noir in New York City, gave it a dimension that no other noir films have, save possibly Night and the City which was also shot on location in London. John Garfield who was as quintessential a New Yorker as you could get plays Joe Morse, smooth lawyer for a big time racketeer Roy Roberts who is looking to either take over or muscle out the small time policy banks in the numbers racket. One of those banks is owned by Garfield's brother, Thomas Gomez. Garfield is as ruthless as Roberts, but with a velvet glove. He tries to get Gomez to go along with the syndicate, but Gomez balks. There's also a prosecutor looking into the numbers racket and a tapped phone which figures prominently in the climax. Given the leftwing polemics of both the star and director Abraham Polonsky, Force of Evil got the attention of the ultra rightwing House Un American Activities Committee. Polonsky was blacklisted for over 20 years and Garfield died under the strain of the investigation. Given what has happened to the Soviet Union, I wonder if Garfield and Polonsky were alive today what they would say and how they would feel about their work here. It's interesting to speculate. But as entertainment Force of Evil is a great success and that is the first rule of film. Also look for a good performance by Marie Windsor as Roberts's wife with a yen for Garfield. One of her first femme fatale roles and one of her best.",
         "This movie is about the \"numbers\" racket that existed at the time the movie was made. Younger viewers, familiar with state lotteries may not appreciate the pervasive influence that was required to operate a nickel and dime play of individuals, that translated into millions that went to corrupt local politicians, judges, and police. One reviewer said the crime was petty which is true; but that makes the cost to the characters involved so tragic and cinematcally vivid. John Garfield acting is at its best as he portrays a person trying to balance ambition, romance and family loyalty. The minor characters are all nice people who found themselves caught in a dirty business that seemed harmless to everyone who played the numbers. This movie shows the real cost in personal terms. The writing, acting and direction of this movie excels any crime movie of this generation.",
         "****SPOILERS**** John Garfield as big time mob lawyer Joe Morse at his best in a Cain and Able like story about the numbers racket in New York City. Where his brother Leo, Thomas Gomez, has a small neighborhood numbers bank that gets wiped out on July 4th when the number 776 which was heavily bet comes out not by chance but by design. In a fix engineered by Joe's mobster client Ben Tucker, Roy Roberts, in an attempt to corner and take over the numbers business in the city. Joe being helpless to get Leo out of the numbers business before 776 hit because of a combination of Leo's honesty to pay off those who played the number at his establishment. Joe's affiliation with Tucker made it impossible for him to tell Leo the real reason for him to close up on July 4th without reviling Tucker's criminal activities. On the evening of July 4th all hell breaks loose with all the small numbers banks all over the city going bust by not being able to pay off those thousands who played number 776. Joe trying to get Leo back on his feet by getting him a job with the Tucker mob sees that Leo would rather be broke then be involved with organized crime. Leo cares more about the people who worked for him, who ended up broke and in jail, then himself making a lot more then he did when he was a small time numbers banker. With Leo wanting out of the business before he corrupts himself by working for the mob he's kidnapped by the Ficco gang, Tucker's muscle men. Leo's accountant Freddie Bauer, Howard Chamberlain, is later murdered because not only didn't want out like Leo but could identify those who kidnapped Leo as well. Joe drunk and depressed, over what is happening to Leo, at a local nightclub with Leo's secretary Doris Lowry, Beatrice Pearson, sees the news of Leo's kidnapping and Bauer's murder in the newspaper and rushes to Tucker's office. Finding Tucker there with his gangster partner Bill Ficco, Paul Fix, Joe tries to get his brother Leo released by the Ficco mob. It's then that Joe finds out that Leo died of a heart attack and was dumped on the rocks under the Washington Bridge. In an explosive and emotional moment Joe secretly lifts up a phone in Tucker's cabinet drawer, that Joe knows is being tapped by the DA's office. Joe knowing that it's all over between him and Tucker gets, by inciting, both him and Ficco to spill the beans about their criminal operations, as well as Ficco's kidnapping and later death of Leo. When Tucker and Ficco are shown the activated phone by Joe the lights go out and there's a shootout where both Tucker and Ficco end up getting shot and killed by Joe. Taking off with Doris to the Washington Bridge Joe find Leo's body lying on the rocks. Sad and emotional ending with Joe and Doris finding Leo's body and later, as the movie ends, Joe going to the DA to tell all he knows about the life of crime that he led defending hoods like Tucker that cost Leo's life. Both powerful and touching movie about good and evil that was so ahead of it's time in how the force of evil destroys the lives of those who embrace it. That even now almost sixty years after it's release \"Force of Evil\" still packs the same wallop as it did back in 1948.",
         "FORCE OF EVIL has remained hovering over me like a ghost all these years. I was studying at Manhattan's Grand Street Playhouse at the time, and the political climate that was beginning to engulf the public had started. Polonsky barely hid the real undercurrent of this remarkable film. When it finally hit the VHS bins, I was almost first on line. I agree with all of the positive remarks on this strong movie, that has all kinds of ghostly memories hovering over it. I did indeed develop a strong crush on Beatrice Pearson, who was an established Broadway actress. She later did quite a turnaround, and even more effective role in LOST BOUNDARIES with excellent work alongside Mel Ferrer, Susan Douglas, Richard Hylton and Carleton Carpenter. From what I have read (if it is to be believed), she was difficult with a friend around offering advice at every turn. Pearson, after BOUNDARIES, returned to Broadway. Wherever she is now may be a mystery, but if she ever reads this, I hope she knows that this is one fan who still smiles at thoughts of her hair falling over the side of her face, her lovely smile, and the sight of her sitting atop a high hall mantle.",
         "McCarthy blacklist victim Abraham Polonsky's angry and poetic film noir is perhaps the most candidly subversive picture ever made in a commercial genre, almost explicitly equating capitalism with crime in the metaphor of the numbers racket. It belongs on the face of it to the post-war-disillusionment school of American thrillers (eg The Blue Dahlia, Key Largo), in which the evils that ordinary Joes spent the war fighting turn out to be business as usual when they get back home. But what makes it so unusual is its insistence, contrary to the message of other social-comment crime thrillers of the 1940s, that it's a bad system, rather than bad people, that's to blame for the woes of the world. The fate of Mob lawyer John Garfield's decent, kind-hearted brother Thomas Gomez, a small-time policy banker, shows us what happens to good people who try to play straight in a crooked game. If the bad guys in the film turned good, Polonsky implies, they'd only get the same. Polonsky described the source novel, Tucker's People, as \"an autopsy on capitalism\". Sermon over: none of the above gets in the way of a raging, doom-laden crime melo that, like a snowball, gets faster and weightier as it barrels along. Superb New York location photography, a vitriolic script, and committed, sincere performances lock our attention to every second of its 81 New York minutes. If it weren't for Gun Crazy (scripted under a front name by another dangerous pinko, Dalton Trumbo), Force of Evil would be the best film noir ever made."
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Drama"
      ],
      "productionCompanies": [
         "Enterprise Productions",
         "Roberts Pictures Inc."
      ],
      "summaries": [
         "Lawyer Joe Morse wants to consolidate all the small-time numbers racket operators into one big powerful operation. But his elder brother Leo is one of these small-time operators who wants to stay that way, preferring not to deal with the gangsters who dominate the big-time.",
         "It's one thing for a lawyer to defend a client in the numbers racket, but it's another for him to become partners with the man. Joe Morse crosses that ethical line with his gangster client, Ben Tucker. Together they've got a scheme to shut down all the illegal banks in the city, and buy up the ones they want. Joe has an older brother, Leo, a man with heart trouble; and Leo has one of these illegal banks. Joe wants to do something good for Leo, to force his brother out of his penny-ante racket and come work for the big boys. The trouble is, Leo is happy with his small, if not quite ethical, business. His employees are like family to him. His secretary, Doris Lowry, is like a daughter. He wants nothing to do with his little brother's scheme and nothing to do with gangsters. But Joe won't give him a choice. Joe has a strong will - strong enough to make the sweet and innocent Doris fall in love with him. But he's still too weak to turn straight and save himself, and everyone connected to him, from disaster.",
         "An unethical lawyer, with an older brother he wants to help, becomes a partner with a client in the numbers racket."
      ],
      "budget": 0
   },
   "movielensId": 746,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1948-12-25",
      "dvdReleaseDate": "2004-05-11",
      "directors": ["Abraham Polonsky"],
      "runtime": 78,
      "movieId": 746,
      "title": "Force of Evil",
      "mpaa": "",
      "actors": [
         "John Garfield",
         "Thomas Gomez",
         "Marie Windsor",
         "Howland Chamberlain",
         "Roy Roberts",
         "Paul Fix",
         "Barry Kelley",
         "Paul McVey",
         "Beatrice Pearson",
         "Beau Bridges",
         "Arthur O'Connell"
      ],
      "imdbMovieId": "0040366",
      "originalTitle": "Force of Evil",
      "genres": [
         "Drama",
         "Action",
         "Crime"
      ],
      "youtubeTrailerIds": ["yAm_DYb1-jo"],
      "plotSummary": "Lawyer Joe Morse wants to consolidate all the small-time numbers racket operators into one big powerful operation. But his elder brother Leo is one of these small-time operators who wants to stay that way, preferring not to deal with the gangsters who dominate the big-time.",
      "tmdbMovieId": 26744,
      "avgRating": 3.73225,
      "releaseYear": "1948",
      "numRatings": 338,
      "posterPath": "/piKroeALv3ckaZe9QroagMDfVse.jpg"
   }
}