{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "surreal",
            "id": 3307
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0103926",
      "video": false,
      "title": "Careful",
      "recommendations": [
         115132,
         83096,
         31123,
         27017,
         43014,
         55102,
         28365
      ],
      "backdrop_path": "/dxHiTtCzEMCaRqPsWqg5Qvx3XfW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Grigorss",
               "gender": 2,
               "credit_id": "52fe48d7c3a36847f817c10b",
               "name": "Kyle McCulloch",
               "profile_path": null,
               "id": 177950,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Zenaida",
               "gender": 1,
               "credit_id": "52fe48d7c3a36847f817c10f",
               "name": "Gosia Dobrowolska",
               "profile_path": null,
               "id": 222737,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Klara",
               "gender": 0,
               "credit_id": "52fe48d7c3a36847f817c113",
               "name": "Sarah Neville",
               "profile_path": null,
               "id": 186300,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Johann",
               "gender": 2,
               "credit_id": "5770e8dbc3a3683e91001f4c",
               "name": "Brent Neale",
               "profile_path": "/lAjIopWuih3SNd9Aqv8tXaL0p8f.jpg",
               "id": 1195707,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Count Knotkers",
               "gender": 0,
               "credit_id": "5770e9609251412a06002225",
               "name": "Paul Cox",
               "profile_path": null,
               "id": 939275,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Herr Trotta",
               "gender": 2,
               "credit_id": "5770e980c3a3683e850025a5",
               "name": "Victor Cowie",
               "profile_path": null,
               "id": 81238,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Blind Ghost",
               "gender": 2,
               "credit_id": "58329662c3a3685ba103a545",
               "name": "Michael O'Sullivan",
               "profile_path": "/vNEvIWShuqen7i1ZOXdXZdZH8Nm.jpg",
               "id": 1641989,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Franz",
               "gender": 0,
               "credit_id": "5832968cc3a3685bb0032b0d",
               "name": "Vince Rimmer",
               "profile_path": null,
               "id": 1711872,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sigleinde",
               "gender": 0,
               "credit_id": "583296abc3a3685b9a034aac",
               "name": "Katya Gardner",
               "profile_path": "/470oLzYPcPEiX84qNvsNueyPdWn.jpg",
               "id": 174577,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Frau Teacher",
               "gender": 1,
               "credit_id": "583296c192514162cf03462b",
               "name": "Jackie Burroughs",
               "profile_path": "/y9V6xyAbUIS4VzsLq6KkPScZowj.jpg",
               "id": 61185,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Chief Steward",
               "gender": 2,
               "credit_id": "583296d1c3a3685ba8034a25",
               "name": "Ross McMillan",
               "profile_path": null,
               "id": 75812,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48d7c3a36847f817c0fb",
               "name": "Guy Maddin",
               "profile_path": "/foMrtxtTnBCDZz5fs2QbU5TUt6l.jpg",
               "id": 97579,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48d7c3a36847f817c101",
               "name": "Greg Klymkiw",
               "profile_path": null,
               "id": 222730,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58329831c3a3685b9602e22b",
               "name": "George Toles",
               "profile_path": null,
               "id": 145600,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5832983dc3a3685bad031a53",
               "name": "Guy Maddin",
               "profile_path": "/foMrtxtTnBCDZz5fs2QbU5TUt6l.jpg",
               "id": 97579,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.38047,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 55613,
      "vote_count": 7,
      "budget": 0,
      "overview": "In the remote Alpine village of Tolzbad at the turn of the century, people talk quietly and restrain their movements lest avalanches come and kill them. This atmosphere lends itself to repressed emotions - shown through the parallel stories of butler student Johann lusting after his mother (an old flame of the mysterious Count Knotkers) and Klara's attraction to her father (who lusts after his other daughter), leading to duels and suicidal plunges galore. All this is shot in the style of an early German sound film, complete with intertitles, deliberately crackly soundtrack and 'hand-tinted' colour effects.",
      "similar": [
         133805,
         3134,
         298312,
         8810,
         281,
         948,
         141,
         381283,
         1696,
         10212,
         11564,
         43923,
         2142,
         12162,
         1359,
         4771,
         431,
         8923,
         10285,
         23483
      ],
      "original_title": "Careful",
      "runtime": 100,
      "poster_path": "/lQL7oJqTZdvjj9SE9prcgmIeYxo.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "the Canadian Council",
            "id": 6697,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Canada Manitoba Cultural Industries Development Office (CIDO)",
            "id": 6698,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Manitoba Arts Council",
            "id": 6700,
            "origin_country": ""
         }
      ],
      "release_date": "1992-09-30",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Guy Maddin"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Guy Maddin",
         "George Toles"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103926/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2Mjk4MTEzN15BMl5BanBnXkFtZTgwNTExNTkwMzE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kyle McCulloch, Gosia Dobrowolska, Sarah Neville | See full cast and crew »"],
      "reviews": [
         "Will wonders never cease? Here is a DVD that I never thought I'd see. Guy Maddin's brilliant and hilarious (particularly for early film buffs) `Careful.' The plot and style of this film have been well explained by other commentaries on this page and elsewhere, so there's no need to go over it again. My favorite comment about it is that it is like a Ricola ad gone horribly, horribly wrong. Suffice it to say that the DVD is an improvement in image quality. While many of the images are intentionally vague, grainy or indistinct by the choice of the filmmakers, I get the impression that these effects are more clearly conveyed in the DVD. In a spoken commentary track with Maddin and screenwriter George Toles (new to this DVD, and obviously not possible on the VHS edition), Maddin admits that he wanted to add an effect through use of the color controls during the digital transfer, but resisted that temptation in order to let this DVD stand as a faithful representation of the film. While the effect he had in mind might have been interesting, I'm still grateful to him for his restraint. Maddin claims in his commentary that people often obliquely criticize the performances of the actors in this film while, at the same time, telling him how much they like it, placing him in the position of defending those performances. Maddin states that he absolutely stands by the performances in this film, and that the actors gave him precisely what he asked for. This should dispel any doubts among people who see this film about the unusual, stiff delivery of lines, which might lead people who know nothing about the cast to suspect they are amateurs, which they are definitely not. This sort of line reading can be seen in some of the very earliest talkies. The antiquated sound of this film, along with its look, is all of a piece, and completely intentional, right down to the fake patina of noise added to the mono soundtrack. Maddin does regret some of the props and effects which had to be done on the cheap, due to budget restraints. Who knows how much more bizarre and fantastic it might have looked with a larger budget? On the other hand, it might have lost some of its unique charm. As it is, it's a wonderful piece of work that I find unforgettable, and that has remained vivid in my memory years after first seeing it. Copies of this DVD aren't to be found in abundance, and I don't know how long it will stay in print. If you like this film, do get this DVD now, and tell anyone you know who likes unusual films about it. Near the end of the film, which hints at a continuation of the story, Maddin says that he may make that sequel some day. I don't know if he was serious about it or not, but I'd sure love to see it.",
         "This is my first experience with a Guy Maddin movie and I have to say that it took a while to get myself accustomed to his particular style. At first I thought all the movie would be a mind boggling homage to early German cinema combined with some ideas from the seventies comedies and exploitation movies. But the movie actually goes into a surprisingly coherent story involving not only the superficial aspects of style but deep ideas relating Careful via Expressionism to the early days of psychoanalysis. Dealing with issues such as an incestuous relation between mother and son, love-hate relationships between parents and children, brothers and sisters etc. this film comes pretty close to a Twin Peaks directed by von Stroheim as it has been earlier characterized. But this is more than a quirky story with stylish camera-work, it is more like a nightmare that puts our innermost nature at stake. Just like any compelling nightmare it is packed with a bizarre sense of humor and a hand-full of absurd scenes but they only help boost the mood and do not interfere with the essentially humane story. I look forward to seeing other Maddin movies and I hope they will be at least the experience this one proved to be",
         "Guy Madden is almost like the David Lynch of Canada. His films have a look all of their own; blending surrealism with German style expressionism. The grainy slightly faded style of his films, make them appear from another era. \"Careful\" is filmed in a bright Technicolor style that's visually dazzling. The film contains Icelandic folk lore with dark humor. The story concerns a town living in the mountains. They have to watch their every move so they don't cause an avalanche. So they try to keep quiet and not make much noise out of fear. Many of the characters have strange incestuous desires that lead them to insanity. Especially Yohan and his fantasies about his mother. Yuck! This is one strange film, with picturesque landscapes that look like they jumped out of a Salvador Dali painting. If you are looking for a disturbing candy colored dark comedy, careful you don't pass this opportunity up.",
         "The USA Film Festival described this as Twin Peaks directed by Erich von Stroheim. Not a bad description. It's an uproarious satire, in the vein of YOUNG FRANKENSTEIN ... but the film often so beautifully duplicates the material it parodies that your breath is taken away. It's a little like reading a hysterical comic book, and finding original paintings by old masters salted throughout! This brilliant Canadian film heavily borrows from the high-camp expressionism of German silent films and early talkies, especially the \"mountain\" films of Leni Riefenstahl. Anyone who's read FROM CALIGARI TO HITLER will recognize dozens of scenes in this film as near carbons of stills from the book. Perhaps more than any other films before or since, German silent cinema created compelling images that tap into universal race consciousness, portraying grainy, moving archetypal images all of us vaguely recognize from dreams or nightmares. Because of this, CAREFUL will often take your breath away with unexpected moments of quiet majesty and beauty. But there are plenty of laughs in between, (with \"sick,\" 70's style National Lampoon-like humor). If you've never laughed at seeing an eye poked out, leave political correctness at the door and give this film a whirl! The soundtrack if often deliberately scratchy or muffled, and in several scenes easter-egg like colors are used that resemble the early two-strip technicolor process. Ominous title cards are used to introduce scenes. This bizarre film is salted with unexpected dialogue like this: BOY: \"My, aren't you the frisky one today.\" GIRL: \"Even the reindeer are such, when Spring is coming!\" Enough of the aesthetics, what is the film supposedly about? The action takes place in the 19th century alpine village of Tolzbad, that is so precariously poised under constant threat of avalanche that villagers have learned to communicate only in whispers. Animals have had their vocal chords removed, and gramophones have lambs wool stuffed in the horn. Villagers keep time to the \"sound\" of silent instruments at a \"concert.\" There are handful of soundproof ice caves where the villagers can frolic and shout, letting out their pent up, pagan passions. The film is clearly a biblical parable about repression. Jackie Burroughs does a brilliant bit part as the puritanical teacher, who closely resembles the Cloris Leachman role in YOUNG FRANKENSTEIN. All of the characters display a surface naivete; actresses speak in the perky, breathless voices reminiscent of badly dubbed post-war European B films; \"strapping\" young sons still wear short pants'd school uniforms. The film quickly descends below the surface to show the village as a cauldron of incestuous flirtations, violent retaliation and explosive \"family secrets.\" The plot follows an arc of forbidden loves and passions, leading to retribution on a biblical scale. What may appear to the modern audience as \"cheap\" special effects are actually loving recreations of how ghosts and visions were portrayed in silent and early talking German films. Many of the images are unforgettable, like the \"trolley\" cars pulled by oxen, or the mine workers wearing crowns of flickering candles. Uncoated lenses and back lit hair make some closeups resemble images from early Garbo or Dietrich films. CAREFUL warrants multiple viewings. Watch it with a friend; this is definitely a film you'll want to dissect over several capuccinos.",
         "I recently watched the film, Careful, by Guy Maddin on television and found it to be very interesting indeed. The person introducing the film called Maddin a Canadian David Lynch and while both directors do have a certain flair for the unusual, I believe Lynch to be a surrealist while Maddin's style to be something else entirely. Granted, Careful is the only film of Maddin's I have seen except for excerpts and press for The Saddest Music in the World, but his style, at least in this film, is one of sentimentality and homage. I have seen plenty of German Expressionist films and Careful would seem to fit right into that mold. I myself have often toyed with the idea of producing a film in the Expressionist style if only for the exercise of it. Maddin has produced an Expressionist film in the year 1992 which flawlessly mimics the films of Ufa, Wiene, Murnau, and Lang from the early 20th century. Any viewer, even those versed in early Expressionism, who would happen across this film without any context would be forgiven for mistaking it to be an actual 80-year-old film, so true is Maddin's style, so exacting is his pacing. Full frame color tinting, sound stage shooting, post-produced soundtrack, rigid acting style, and obsolete directorial choices, combine to provide the viewer with a disturbing portrait of repression, duty, and mountain goats. This film is incredible!",
         "Bizarre and highly imaginative film with a distinctive style. It reminds me a little bit of \"Quintet\" (the snowy background, and parts of the soundtrack) and \"Institute Benjamenta\" (the low-key weirdness and the butler-school sub-theme). The humour is subtle; there are no laugh-out-loud moments, but some of the ideas are hilarious. For example, Sarah Neville deciding to work in a mine(!), in which we later find more women. Or the almost pythonesque conversation between Neville and McCulloch, in which they both yawn(!) while the former tells the latter about having been molested by her father. But Madden probably didn't intend to go for the big laughs otherwise he wouldn't have made this whole thing so moody.",
         "If you are a fan of German Expressionism, then you will enjoy this modern homage to a beautiful and arresting style perceived and captured wonderfully by Guy Maddin. There is a ton of symbolism and exploration of the sexual taboos found in both the Oedipus and Cassandra complexes of Greek mythology while allowing for quite humorous character developments which certainly make the film that much more enjoyable than just an \"art\" film. Maddin's use of light and especially color adds to the classic expressionist model which gets a gorgeous injection of modern fare. While I can enjoy the notion of one reviewer calling this a cross between \"The Wizard of Oz and Eraserhead\", I definately saw this as a much more direct colorful homage to \"Caligari\" than anything Lynch-esque. There is not the mind-numbing mixture of light and sound which generates its own tension but rather a playful use of sets and characters which surmount to quite a comical time. That is not to say there is not a scene or two that would make a horror fan happy but they are very straight forward and even amusing.",
         "This is the second Guy Maddin film that I've seen (the other being \"Twilight of the Ice Nymphs\") and in both cases, the films wore out their welcome about half an hour in. I enjoy the offbeat style of the humor, the intentional visual stylization patterned after early silent films (this one reminded me particularly of the work of Melies), and I have no problem with the flat acting style (which is an honest homage to early film acting) or the coloring (which, again, is based in films of yesteryear). Where Maddin's films run into trouble is, as soon as the novelty has worn off and the character based introductory jokes have played out, there is simply nothing beneath it all for the film to fall back on. The story is actually very simple, yet it is so relentlessly bizarre that it borders on surrealism. So, either there is no deeper meaning to the story, or it's so far buried that it eludes me during the actual viewing of the piece. (Not that one can't come up with various things after the fact; I simply doubt that the director intended them or had any control over them if I can only interpret the vaguest elements of the story.) The concept of Oedipal lust and such simply aren't enough to sustain a film of this length. Not in the way that they are handled anyway. The film is absolutely brilliant up until Johann dies. It then withers quickly, as the last real belly laugh comes in the first few minutes of \"Part Two.\" The remaining hour or so limps along to a decent though unsatisfying end. Guy Maddin is without doubt a clever and unique director, and I look forward to the day when I can say that I've seen him at his best. But he's far from it in this film in my opinion. Endless homages to early films aren't enough to last 100 minutes... And perversity caused by child rearing needs to be handled more cleverly to take up the slack...",
         "I love Guy Maddin's work and this is my favourite of his films. It's odd and unsettling and it sticks with you long after you've watched it. It's definitely not the most accessible of his works, but I like it. It's been described as a \"pro-repressionist\" movie, but I don't think that's entirely accurate. The people portrayed in the village are deeply repressed and one small push makes their whole stack of cards morals come tumbling down. It's tale of three brothers and their trials and tribulations. Their father is deceased and one brother, Vince Rimmer as Franz, is an invalid confined to the attic, who can do little more than watch as his brothers are tempted and run amok. First Brent Neale as Johann, then Kyle McColloch as Grigorss give in to their desires and forbidden longings with tragic consequences. Kyle McColloch is a Maddin regular and he shines here. Engagements are broken, people have knife fights and their mother is seeking to re-marry.",
         "Influenced by the German Expressionist films of the 1920s and filtered through the oddball sensibilities of writer/director Guy Maddin, Careful is a film like no other. Maddin appropriates silent cinema's monochrome aesthetic in multiple scenes but even when color is being used in a more traditional way he tends to fill the screen with garish brightness. The film has (melo)dramatic elements but is primarily comedic, albeit with a wink and a nudge subtlety almost altogether absent from silent film's heyday. The bizarre plot of the film is centered on a repressed mountain community, particularly the brothers Johan and Grigors and their mother. The boys' father, who lost both his eyes in separate freak accidents, is long since dead and their older brother is locked in the attic where he silently watches. Johan and his younger brother spend most of their time in a strict school for butlers where they learn about dining etiquette and grooming. Johan becomes engaged to Klara, a local girl who lusts after her own father in spite of his clear favoritism toward his younger daughter, in spite of his own obsessive lust directed at his mother. Naturally, characters become involved in murder plots, duels, and suicide as they're too repressed and shut off to resolve their problems in a less dramatic fashion. Thematically, Careful is too jumbled to have much coherence but like most Maddin films this is more about style than plot or meaning. Maddin's creative visual style is engaging enough on its own to make Careful a worthwhile film."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Canada Council, The",
         "The Canada Manitoba Cultural Industries Development Office (CIDO)",
         "The Greg & Tracy Film Ministry"
      ],
      "summaries": ["In the Alpine village of Tolzbad in the 1800s, the townsfolk talk quietly and restrain their movements lest they incur avalanches. This atmosphere lends itself to repressed emotions - shown through the parallel stories of butler student Johann lusting after his mother (an old flame of the mysterious Count Knotkers) and Klara's attraction to her father (who lusts after his other daughter), leading to duels and suicidal plunges galore. All this is shot in the style of an early German sonal film, complete with intertitles, crackly sound-track and 'hand-tinted' colour effects."],
      "budget": 0
   },
   "movielensId": 751,
   "movielens": {
      "languages": [
         "Deutsch",
         "English"
      ],
      "releaseDate": "1992-09-30",
      "dvdReleaseDate": "2000-10-17",
      "directors": ["Guy Maddin"],
      "runtime": 100,
      "movieId": 751,
      "title": "Careful",
      "mpaa": "",
      "actors": [
         "Kyle McCulloch",
         "Gosia Dobrowolska",
         "Sarah Neville",
         "Brent Neale",
         "Paul Cox",
         "Victor Cowie",
         "Michael O'Sullivan",
         "Vince Rimmer",
         "Katya Gardner",
         "Jackie Burroughs",
         "Ross McMillan"
      ],
      "imdbMovieId": "0103926",
      "originalTitle": "Careful",
      "genres": [
         "Horror",
         "Comedy",
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In the remote Alpine village of Tolzbad at the turn of the century, people talk quietly and restrain their movements lest avalanches come and kill them. This atmosphere lends itself to repressed emotions - shown through the parallel stories of butler student Johann lusting after his mother (an old flame of the mysterious Count Knotkers) and Klara's attraction to her father (who lusts after his other daughter), leading to duels and suicidal plunges galore. All this is shot in the style of an early German sound film, complete with intertitles, deliberately crackly soundtrack and 'hand-tinted' colour effects.",
      "tmdbMovieId": 55613,
      "avgRating": 3.4491,
      "releaseYear": "1992",
      "numRatings": 167,
      "posterPath": "/lQL7oJqTZdvjj9SE9prcgmIeYxo.jpg"
   }
}