{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gold",
            "id": 1321
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "teenage girl",
            "id": 10809
         }
      ],
      "imdb_id": "tt0113188",
      "video": false,
      "title": "Gold Diggers: The Secret of Bear Mountain",
      "recommendations": [
         3288,
         49478,
         118430,
         21352,
         20551,
         77291,
         40688,
         68927,
         134237,
         55016,
         73336,
         77946,
         144060,
         53882,
         49345,
         80346,
         33657,
         79783,
         36929,
         36259
      ],
      "backdrop_path": "/tEjkdx2OPxsSgsbgjgJbgFxjNaX.jpg",
      "revenue": 6029091,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Beth Easton",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a897",
               "name": "Christina Ricci",
               "profile_path": "/dzB58d6fNrTEi7nBAU1tySJc2at.jpg",
               "id": 6886,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jody Salerno",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a89b",
               "name": "Anna Chlumsky",
               "profile_path": "/wWuhDcOKU3t8WVPLNsP268GKvOU.jpg",
               "id": 34612,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kate Easton",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a89f",
               "name": "Polly Draper",
               "profile_path": "/1zViE8Kn2i6Idg2uOMJOnptRwnj.jpg",
               "id": 114470,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Matt Hollinger",
               "gender": 2,
               "credit_id": "52fe45ad9251416c9103a8a3",
               "name": "Brian Kerwin",
               "profile_path": "/cC69Vc7F59RKBZUldffhWJWx57A.jpg",
               "id": 50464,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lynette Salerno",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a8a7",
               "name": "Diana Scarwid",
               "profile_path": "/1Z11dGfpfJygcL0r3CYLFREEU8l.jpg",
               "id": 2958,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ray Karnisak",
               "gender": 2,
               "credit_id": "52fe45ad9251416c9103a8ab",
               "name": "David Keith",
               "profile_path": "/v1b7NQqJifk7xgt9HOGh0lvfkbP.jpg",
               "id": 18181,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Grace Briggs",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a8af",
               "name": "Gillian Barber",
               "profile_path": "/qoqPX15J5jh6Sy0A9JvvRJIuw64.jpg",
               "id": 56522,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Tracy Briggs",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a8b3",
               "name": "Ashleigh Aston Moore",
               "profile_path": "/ijkawzik8lV28jVwPHEkOvDc8N.jpg",
               "id": 114471,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Samantha",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a8b7",
               "name": "Jewel Staite",
               "profile_path": "/bNYBYhNN9gC0ZyeJ1bw1Z8Q6mWe.jpg",
               "id": 72092,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Molly Morgan",
               "gender": 1,
               "credit_id": "52fe45ad9251416c9103a8bb",
               "name": "Amy Kirk",
               "profile_path": null,
               "id": 114472,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sgt. Weller",
               "gender": 0,
               "credit_id": "52fe45ad9251416c9103a8bf",
               "name": "Dwight McFee",
               "profile_path": null,
               "id": 114473,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Hank",
               "gender": 2,
               "credit_id": "52fe45ad9251416c9103a8c3",
               "name": "Andrew Wheeler",
               "profile_path": "/7KTddekzmrhzHww8BkujEYaQq4q.jpg",
               "id": 102748,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Girl",
               "gender": 0,
               "credit_id": "52fe45ad9251416c9103a8c7",
               "name": "Kimberley Warnat",
               "profile_path": "/fmyKAEHqF93IOTzMgkHf1VsIgU8.jpg",
               "id": 102749,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe45ad9251416c9103a8cb",
               "name": "Jesse Moss",
               "profile_path": "/d4FY9ZdC5imLXq3wp6eCBUjy8vq.jpg",
               "id": 59926,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Paramedic",
               "gender": 2,
               "credit_id": "52fe45ad9251416c9103a8cf",
               "name": "Roger Cross",
               "profile_path": "/cyd6iZZArmXmuAyxxJkodfMiMDs.jpg",
               "id": 25877,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ad9251416c9103a88d",
               "name": "Kevin James Dobson",
               "profile_path": null,
               "id": 114468,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ad9251416c9103a893",
               "name": "Barry Glasser",
               "profile_path": null,
               "id": 114469,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 2.808035,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 35645,
      "vote_count": 26,
      "budget": 0,
      "overview": "Two teen girls, one from the city, one from the country, try to find the hidden gold of Bear Mountain learning about friendship, loyalty and courage on the way.",
      "similar": [
         376660,
         962,
         76726,
         449176,
         3170,
         28178,
         12227,
         308369,
         74465,
         286565,
         19913,
         23168,
         40807,
         2105,
         862,
         8363,
         13,
         72105,
         320,
         235
      ],
      "original_title": "Gold Diggers: The Secret of Bear Mountain",
      "runtime": 94,
      "poster_path": "/2EZf5FKxGRswhOUHn9GM5yqRR0h.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bregman/Baer Productions",
            "id": 11393,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Universal City Studios",
            "id": 69627,
            "origin_country": ""
         }
      ],
      "release_date": "1995-11-03",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Some friendships are worth a fortune",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kevin James Dobson"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Barry Glasser"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113188/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNjQ2ODcxM15BMl5BanBnXkFtZTcwMjAyNzAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Christina Ricci, Anna Chlumsky, Polly Draper | See full cast and crew »"],
      "reviews": [
         "If I could just say a few words about this movie they would be, \"A Must Buy!\". In fact, I don't know why I let this movie go for so long before getting it myself and watching it because it is very good -- a fantastic adventure and enough suspense to keep you watching it all the way through (at least the 1st time). When this movie aired on the Wonderful World of Disney this past Sunday night (June 11, 2000) I watched it for the first time to preview it. I was also trying to do something else at the time, but it was so good that I could only continue what I was doing during commercial breaks. The next day, I just had to go out and find it on video to add it to my own video library and then I watched it again later that night and one more time the next night. This is real good movie to watch over and over again, though, seeing it the 1st time is the best. To sum all this up in a few words, this movie has surely become one of my favorites and will most probably be a heavily played video, too! An excellent movie! 10 Stars!!",
         "Being a teenager this was a very good movie, and christina ricci is one of my absolute favorite actresses so it was a great movie for me and my friends to watch on a saturday night with a bowl of popcorn and a few sodas, go see it!!",
         "I absolutely love this movie it made me cry the first 5 times I watched it. I think this movie should get 20 stars out of 10, I have seen this movie so many times I have every single word of it memorized, this movie deals with so many issues we face today, and even though it was make in 1995 doesn't mean it's an old fogie movie that doesn't deserve the time of day, just trust me I have seen it enough times to know! lol. I think that if you are looking for a movie to sit down and watch and not want it to be over then you have found the right movie Gold Diggers can make you laugh, cry, and wonder what's going to happen next all at the same time! So if you have yet to see this wonderful movie don't pass it up, go see it now! PS, See this movie, you have to!",
         "I loved this movie but then I guess I love anything Christina Ricci is in. But this is great for family time it is the mini- Indiana Jones and it was set in the pacific norhtwest that in itself gives it high marks.",
         "I have seen this movie many times, watched it over and over and I never get sick of it. This is a wonderful story about friendship that has touched my heart. A brilliant family movie that children will especially love for the adventure, fun, and triumph that it presents.",
         "Beth( Christina Ricci) and her mother Kate( Polly Draper) have just moved from L.A, to a small town where Kate's aunt used to live. Beth becomes friends with this girl Jody( Anna Chlumsky). Jody is wild, adventerous and the total opposite of Beth. But a lot of people are saying that Jody is a really bad influence and that she steals and that she has a lot of problems. Beth doesn't listen to those story's, she likes Jody no matter what people tell her. One day, the two of them head out to this Bear Mountain that supposedly still carries gold. But a accident happens to Beth and it is up to Jody to save her life. This is a wonderful movie, I enjoyed it a lot. Christina Ricci and Anna Chlumsky were great. I would give Gold Diggers:The Secret Of Bear Mountain 8.5/10",
         "Christina Ricci is great as Elizabeth in this intelligent adventure flick. The supporting cast is brilliant. The costumes are simple. One of the good farces in the genre, Gold Diggers: Secret Of Bear Mountain will sparkle golden bears in the viewer's eye. 10 out of 10.",
         "In my perspective, I thought this movie was a great family movie that talks about true friends and what they go through. I think it will teach children to dream and also show them what a good friend really is. It has a great plotline and stars both Christina Ricci and Anna Chlumsky.",
         "This is a movie that should be viewed by everyone because it is a true testament to what friends will do for one another without question. Anna Chlumsky gives one of her best performances as Jody Salerno and Christina Ricci shines in her role as Beth Easton. Together they are on a mission to capture gold. However, along the way they encounter problems that will test their friendship. I enjoyed and appreciate how the director took his time to focus the story more on the development of Jody and Beth's friendship instead of just searching for the gold. One of the best examples was when Beth was trapped in the mountain and Jody went for help. It was then I realized that Jody really cared about someone other than herself. Through thick and thin, happy or difficult times they were there for one another, which was the best part. No matter who was in trouble or who was getting pucked on, they stuck together. I was thrilled to see a movie that is a change of pace from what has come out, which has come out recently. I really hope this movie does the same for each viewer as it did for me. I highly recommend this film because it shows the true meaning of friendship",
         "Watched this the first time this morning on HBO and LOVED IT!!! Just ordered the DVD to watch it again when I want to!! Can't believe I never saw it before!! The friendship between the girls is right on, reminds me of being young! LOVE IT, LOVE IT!!!! Will recommend it to family and friends, and even let them borrow the DVD I just ordered! I know there are family members who will enjoy it, especially since the whole family can watch it together. This is unusual to find one these days, even programs on regular TV surprise me with some of the language! My DVD will arrive on Wednesday, and I can't wait to watch it again. so many ups and downs in it, was so happy there was a very happy ending! I have four Grandchildren now, so nice to have a good, clean movie for them to watch."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Universal City Studios",
         "Bregman/Baer Productions"
      ],
      "summaries": [
         "Moving from the big city (LA) to a backwater town is always difficult, but especially for the one doing the moving. After her dad's death, Beth Easton and her mother, Kate, move to the house left to the family by a deceased aunt. Kate meets up with several old friends, but Beth has none. Slowly, however, she makes friends, despite the lack of a nearby mall or anything else to do. Soon she meets up with two boys fighting ... except one isn't a boy, but a girl. The girl, Jody, is shunned by her peers as a \"bad kid.\" As the film progresses, we see Jody as the apparent victim of a bad relationship between her own widowed mother and Ray, a man who, like everybody else, grew up in the town. Somehow, Beth sees that Jody isn't all that bad; \"she just needs a friend.\" Beth sticks by her, even when Jody is blamed for almost killing Beth. Jody has a dream, though, a dream of finding lost gold in Bear Mountain, left there by a legendary woman named Molly Morgan. Jody has a map, and she has a \"condo\" in the mountain near the entrance to a series of caves & tunnels leading to the supposed gold. On the first day of summer, Jody and Beth find the cave where the gold supposedly is hidden. The movie continues digging deeper into Jody's life through Beth's eyes. Although the legend of Bear Mountain is the prime motivator of several incidents, it's Jody's relationship to Ray, her mother, Beth, and the rest of the townspeople that provides the focus of the movie.",
         "A city girl teams up with a tomboy to solve the mystery of Bear Mountain, Molly Morgan, and the buried treasure as well as learn about true friendships."
      ],
      "budget": 0
   },
   "movielensId": 754,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-03",
      "dvdReleaseDate": null,
      "directors": ["Kevin James Dobson"],
      "runtime": 94,
      "movieId": 754,
      "title": "Gold Diggers: The Secret of Bear Mountain",
      "mpaa": "",
      "actors": [
         "Christina Ricci",
         "Anna Chlumsky",
         "Polly Draper",
         "Brian Kerwin",
         "Diana Scarwid",
         "David Keith",
         "Gillian Barber",
         "Ashleigh Aston Moore",
         "Jewel Staite",
         "Amy Kirk",
         "Dwight McFee",
         "Andrew Wheeler",
         "Kimberley Warnat",
         "Jesse Moss",
         "Roger Cross"
      ],
      "imdbMovieId": "0113188",
      "originalTitle": "Gold Diggers: The Secret of Bear Mountain",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["5wWemU9479E"],
      "plotSummary": "Two teen girls, one from the city, one from the country, try to find the hidden gold of Bear Mountain learning about friendship, loyalty and courage on the way.",
      "tmdbMovieId": 35645,
      "avgRating": 2.94402,
      "releaseYear": "1995",
      "numRatings": 393,
      "posterPath": "/2EZf5FKxGRswhOUHn9GM5yqRR0h.jpg"
   }
}