{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "india",
            "id": 14636
         },
         {
            "name": "street kid",
            "id": 193430
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt0042644",
      "video": false,
      "title": "Kim",
      "recommendations": [
         43331,
         41503,
         57575
      ],
      "backdrop_path": "/tFdtREbXKUn54F1GcjDStzI8xFx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mahbub Ali, the Red Beard",
               "gender": 2,
               "credit_id": "52fe4ad7c3a36847f81e491b",
               "name": "Errol Flynn",
               "profile_path": "/2fd8ZORZMGFJQqMcnoNgSnTOpPS.jpg",
               "id": 8724,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kim",
               "gender": 2,
               "credit_id": "52fe4ad7c3a36847f81e491f",
               "name": "Dean Stockwell",
               "profile_path": "/gooE10UOH6t4geqsEbji9NiQalP.jpg",
               "id": 923,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lama",
               "gender": 2,
               "credit_id": "52fe4ad7c3a36847f81e4923",
               "name": "Paul Lukas",
               "profile_path": "/uPN8hpMtacoFylb0Ez9j800bilZ.jpg",
               "id": 2092,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Colonel Creighton",
               "gender": 0,
               "credit_id": "5385b9180e0a26144a001131",
               "name": "Robert Douglas",
               "profile_path": "/vYpdx1y2L0d1aLOB4cFupximTWx.jpg",
               "id": 33484,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Emissary",
               "gender": 2,
               "credit_id": "52fe4ad7c3a36847f81e492b",
               "name": "Thomas Gomez",
               "profile_path": "/7CNFFi9FG1Jc6ngmnZY3MGcK4zx.jpg",
               "id": 18646,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Hurree Chunder",
               "gender": 2,
               "credit_id": "55705f58925141321700208c",
               "name": "Cecil Kellaway",
               "profile_path": "/3qcMgq1JFZWXct7Y6CiXNi0jCZr.jpg",
               "id": 30228,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Lurgan Sahib",
               "gender": 2,
               "credit_id": "55705f66925141321700208f",
               "name": "Arnold Moss",
               "profile_path": "/dzYW3sJFzM15zHlhb3PeHRxPPkI.jpg",
               "id": 15676,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Father Victor",
               "gender": 2,
               "credit_id": "55705f75c3a368709c0001a9",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Laluli",
               "gender": 1,
               "credit_id": "55705f83c3a36810590022d3",
               "name": "Laurette Luez",
               "profile_path": "/zWgKYji6JBpMj5mUGDWJYdsgGuG.jpg",
               "id": 83990,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Hassan Bey",
               "gender": 0,
               "credit_id": "55705fa29251410861002381",
               "name": "Richard Hale",
               "profile_path": "/7gOSDGBSZkNwutua1qGjWdaExeJ.jpg",
               "id": 16055,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "The Russian",
               "gender": 0,
               "credit_id": "55705fafc3a36810710023ba",
               "name": "Roman Toporow",
               "profile_path": null,
               "id": 115851,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "The Russian",
               "gender": 2,
               "credit_id": "55705fbe9251410872002360",
               "name": "Ivan Triesault",
               "profile_path": "/gWpMvwsE3ydU0GeFtvLqQZBXbov.jpg",
               "id": 5041,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ad7c3a36847f81e4917",
               "name": "Victor Saville",
               "profile_path": null,
               "id": 14860,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ad7c3a36847f81e4931",
               "name": "Leon Gordon",
               "profile_path": null,
               "id": 1504,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4ad7c3a36847f81e4937",
               "name": "Helen Deutsch",
               "profile_path": null,
               "id": 31068,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad7c3a36847f81e493d",
               "name": "Richard Schayer",
               "profile_path": null,
               "id": 42064,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 1.063224,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 110465,
      "vote_count": 5,
      "budget": 0,
      "overview": "Kim, a young boy living on his own on the streets of India, is actually the son of a British officer. He meets a lama, a holy man, and devotes himself to his tending. But when British administrators discover his birthright, he is placed in a British school. His nature, however, is opposed to the regimentation expected for the son of a British soldier, and he rebels. His familiarity with Indian life and his ability to pass as an Indian child allows him to function as a spy for the British as they attempt to thwart revolution and invasion of India. Rejoining his holy man, Kim (with the help of daring adventurer Mahbub Ali) takes on a dangerous mission.",
      "similar": [
         11236,
         11224,
         36669,
         10545,
         44826,
         206647,
         49529,
         342473,
         281957,
         278927,
         581,
         954,
         267935,
         49517,
         12113,
         27576,
         302699,
         213,
         2502,
         2503
      ],
      "original_title": "Kim",
      "runtime": 113,
      "poster_path": "/9KlWbUFqL1ROwNZSn1Vjw2KnIsn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1950-12-07",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Famed Spectacular Adventure Story Filmed Against Authentic Backgrounds in Mystic India The Greatest Spy Thriller of Them All!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Victor Saville"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Leon Gordon",
         "Helen Deutsch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042644/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDcwNTg2NjM4NF5BMl5BanBnXkFtZTcwNzQxNDcxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Errol Flynn, Dean Stockwell, Paul Lukas | See full cast and crew »"],
      "reviews": [
         "A faithful rendering of Kipling's exciting tale, together with fine screen falues and an all-star cast makes for fine entertainment for young and old alike. I remember being read Kipling as a young boy, and while the animated Disney bastardization of the Jungle Book is unwatchable for anyone who knows the book, this rendering of Kipling's other great adventure is in a class with other great \"exotic\" films like The Four Feathers and King Solomon's Mines. While some may fault the rather unconvincing casting of an over-the-hill Flynn as a dashing thief and Paul Lucas as an aging lama, these professionals soon overcome that liability and assume their characters successfully. Dean Stockwell was at his peak as a child star. His impishness as a white boy gone native suggests the perverseness characteristic of his screen persona in a successful transition to adult roles. Imagine a young boy (in a non politically correct milieu) being read or watching Kim just before bedtime. What dreams he'll have! By the way, while parts of the film were made on a soundstage or backlot - like all films with decent sound - much of it was shot on location - IN INDIA.",
         "When KIM came out (1950) I was 10 years old. I was fascinated with the intrigue of a boy like me getting involved in a spy situation. Dean Stockwell was 12 or 13 at the time. The film stuck so close to me over the years that I wrote about it later in high school and remember it well to this day some 54 years later. Yes, there is action but not the usual, now-a-days blood-and-guts for two hours. In between the chilling scenes were the spy intrigues of the British trying to hold on to their empire. It was easy to tell the good guys from the bad. I admired the skill of Stockwell then and still do. His career has spanned nearly 60 years now. Watch KIM -- again and again. I still get something new every time I see it.",
         "I watched this film on Turner Classics as I had been entranced by it as a child, and wanted to see how it stood up to today's expectations. I was very pleasantly surprised to see that it was a rolicking good adventure yarn, that would be an ideal film for the family to watch together after a holiday dinner. As I had a tape of the TV version, with Peter O'Tool as the Llama, I was able to compare the two, which is why I felt that the 1950 version has worn well. The colour is excellent, the acting is very good, and the locations shots in India lend a great deal of authenticity to the production. I realise that many of today's audience will find the lack of sex and violence make for a tedious film, but it is precisely the lack of obvious sex and violence, it is implied rather than overt, which makes for a good family film. In fact it was a relief to see a film that did not include the obligatory chase and fisticuffs that we have seen in every film and TV series in the last 50 years.",
         "Fans of The Great Game in general and Rudyard Kipling's Kim specifically will enjoy this film, I think, especially if they've read or re-read the book recently. While it is true the film shows its age, if you're not a nit-picker, you should remain engaged. Stockwell does a good job with the title character of Kim, who is the central character, just as he is in the book. While The Great Game swirls around Kim, the story is one of his education in the arts of spying and his devotion to his holy man. The courage portrayed by characters Mahbub Ali (played by Errol Flynn) and Hurree Chunder is reminiscent of the exploits of the real-life locals who served in the Indian Secret Service in the late 19th and early 20th centuries.",
         "This is a grand retelling of a wonderful story, with Flynn still shining through, though he is not in fact the main character in the tale. Young Dean Stockwell is the person who is on camera on almost every scene and he shows swagger and plumb that indicates a real talent and understanding of his part. While Flynn was certainly nearing the end of his career, he still showed he still possessed his outstanding ability to play parts such as his \"horse trader\" in this costumer, which no actors alive today, save Peter O'Toole or Sean Connery - who not surprisingly made another outstanding Kipling piece into the movie - \"The Man Who Would Be King\", are able to match. The movie is highly entertaining and the supporting players are veterans all and play their parts very well.",
         "I've always thought that Rudyard Kipling's Kim might very well have been influenced by Charles Dickens and his creation of those street urchins in London led by that young survivor, the Artful Dodger. Certainly Kim as portrayed by Dean Stockwell in this film is every bit as resourceful in his way as the Dodger is in Oliver Twist. The Dodger had the advantage of growing up poor, but growing up in his own culture in 19th century London. Kim is short for Kimball O'Hara who's growing up on the mean streets of India. Kim's dad was a British soldier and in this film, the mother who died in childbirth is also white. Kim learned the way to survive real fast. Which makes him of great use to British Intelligence ever worried in the 19th century about Russian designs on India. Of course what they were doing in India is a question not asked in these films. This is Dean Stockwell's film, maybe the best he did as a child actor. He's appealing as all get out in Kim. Adults like Errol Flynn as the horse trader Mahbub Ali who's really a British agent, Robert Douglas as the colonel in charge of British Intelligence, and Paul Lukas as the lama on pilgrimage who befriends young Kim are clearly in support of Stockwell. This is familiar territory for Flynn back in his salad days he had just such a role in The Prince and the Pauper supporting the Mauch twins as Miles Hendon. By the way you might get confused a bit when you hear Flynn's character referred by name in Kim. They pronounce it in the film as one word, Mahbubali. Flynn was loaned to MGM from Warner Brothers for That Forsyte Woman and a second film. He was given a choice of Kim or King Solomon's Mines, each film being shot on location in India and Africa respectively. Flynn opted for the Indian story although he got to Africa later in The Roots of Heaven. Kim is still a fine boy's adventure story, should appeal to the twelve year old boy in all of us.",
         "I have always felt that among the child actors who managed to maintain their careers into adulthood, Dean Stockwell has been one of the best. He certainly is able to handle any role - he was the more sympathetic one of the two child killers in COMPULSION, and he played the amorous crime boss in MARRIED TO THE MOB. He even was Howard Hughes in TUCKER. His early films showed great promise too. Besides the one I am about to review, notice THE GREEN YEARS and THE BOY WITH GREEN HAIR and THE SECRET GARDEN. KIM gave Stockwell more than just a chance to play the central figure in a film. He was playing in a colorful background (India in the days of the British Raj in the 19th Century). He was sharing the central stage with one of the great film stars of the 1930s and 1940s (Errol Flynn). And he had a chance to play in a movie based on a classic story - Kipling's best remembered novel. Kimball O'Hara is half Anglo-Irish and half Indian. His father has been dead many years, so he lives with his mother's people on the streets of Calcutta. It is about 1885, and while the British are running India, memories of the atrocities of the Indians against the British (remember Cawnpore - see the review of Flynn's THE CHARGE OF THE LIGHT BRIGADE), and memories of British retaliation against the Indians (such as tying Indian rebels to cannon mouths and blowing them apart) have poisoned the relationship quite deeply. Moreover, the Russians are active in the subcontinent supporting rebellion and dissent. He finds a pair of substitute father figures. One is the Hindu holy man, the Lama (Paul Lukas) who is seeking a final pilgrimage in his life to a holy site. When Kimball is identified as the son of a former army officer, Colonel Creighton (Robert Douglas) takes him off the streets, and puts him into a school. His learning is difficult (there is an amusing sequence where we see Kim cheating all the time, not realizing his pragmatic approach to learning is not what is expected of him). Eventually Creighton puts him in the hand of the spy-master Mahbub Ali (Flynn), who becomes the second substitute father while training him in intelligence gathering. The novel goes into great detail about this - called by Kipling (and ever since) \"the great game\". Kim is trained to react to stimuli as though he has a photographic memory: he can look at a bunch of seeds or jewels once and rattle off how many of each there are. But although he is patriotic, and follows the orders given from Creighton to Mahbub Ali, Kim remains deeply faithful to the Lama. Mahbub Ali sees this as an unexpected advantage: Kim can go undercover accompanying the Lama on that pilgrimage which goes towards the Russian Indian border (near present day Packistan and Afghanistan). So the novel (and the film follow Kim and the Lama on the pilgrimage - and show all the color and diversity of that remarkable subcontinent. It does not fail to continue the espionage, with Kim learning what is going on with the Russian agents (and relaying the information to Mahbub Ali, who is following from a distance as a back-up). But the crisis in the story is which of the two distinct missions of the two distinct father figures will get the upper hand in Kim's mind. And how will he balance them out? I won't go into the final details - the audience will not be disappointed by the resolution. The end result is that we do see a young, happy, care-free little boy turn into a thoughtful teenager preparing for manhood. Stockwell's performance was a very good one, abetted by Lukas as a simple and good man, and Flynn as a craftier one, but one who does keep a close eye on his apprentice \"son\". And the canvas of India won't disappoint at all. Definitely a film to watch.",
         "Excellent rendition of the Rudyard Kipling novel! True to the book, and preserving the nuance and subtleties of the original. A must see for any one and highly recomended for children. A great stocking stuffer, or gift for any child as an opening to the great writing of Kipling.",
         "\"Kim\" is a Hollywood attempt at a literary adaptation that doesn't quite come off: on re-reading the book I was surprised at just how much is lifted directly from Kipling's original dialogue, albeit not always in the original context, and many of the familiar images are there even where the plot strands that were attached to them have been omitted. The little boys still ride astride the great gun in Lahore, the smashed water-jar reforms itself on the floor of Lurgan's shop, and the old woman from Kulu peeps shamelessly from the corner of her curtained cart. A great deal has been condensed in order to meet the requirements both of length and of the cinematic form; the most memorable parts of Kim's adventures, like those of Mowgli, occur before he is 'civilised', and the film does a good job of trying to reduce the strung-out remaining two thirds of the novel into a reasonably short timespan. Many of the added scenes, such as the one where Mahbub Ali cheerfully dispatches a would-be assassin and Kim tries for equal equanimity but fails, Creighton's device for helping Kim escape his pursuers at Ambala, and the boy's hard bargaining with the disguised goat-herd in the mountains, are true to the spirit of the book. Someone clearly did try hard on this. But what I would guess that MGM were hoping for was another Kipling-cribbed adventure story along the lines of \"Gunga Din\", and \"Kim\" simply doesn't come to life in the same manner. British-made films of India such as \"The Drum\" or \"North West Frontier\" capture the local colour better, but they also have the advantage of more sophisticated political dialogue and a more inherently cinematic plot. Ironically, \"Kim\" probably sticks too close to source: Kipling's novel was never intended as a conventional thriller, and once you take out the philosophy, description and the unequalled ear for the demotic that conjure up the author's India at such length, there isn't that much actual action in the book. The screenplay supplies some extra thrills to take the place of the novel's ignominiously simple defeat of the Russians and adds a couple of rooftop chases earlier on, with the somewhat creaky device of a narrator used to fill in the gaps, but it didn't really catch my imagination. Dean Stockwell is no Sabu, but he acquits himself well in a film that absolutely depends on its central child actor. He handles Kim's long streams of abuse or cajolery with aplomb, and looks if anything more convincing in Indian clothes than European costume, where he seems more the 1950s schoolboy than a child of the nineteenth century. Casting Errol Flynn as Mahbub Ali, the Afghan horse-trader 'as prompt as he was unscrupulous', was clearly a publicity coup for MGM, who awarded him top billing for what is really only a supporting role, and rewrote the story to give the character a more heroic place in the action. For his part, Flynn sacrifices not only his trademark pencil moustache, but his entire head of hair to the studio, appearing at one point with a shaven scalp and at another with a bizarre ginger stubble that suggests someone had misunderstood the concept of a crimson-dyed beard... He wears his costumes well, and the script adds in a couple of winking nudges to Flynn's image as a screen Lothario that aren't really an improvement; but on the whole he plays it straight, although relatively uninspired. There's nothing wrong with the performance but nothing really memorable about it either, although there is a visible rapport between Mahbub and the boy. Paul Lukas gives a good performance as the holy man whom Kim loves and protects, once you've got over the fact that he looks nothing whatsoever like a Buddhist monk -- more like an elderly Cardinal! The fact that he is supposed to be Tibetan is perhaps wisely glossed over in the script, and Lukas brings out the quiet steel behind the old man's unworldly determination, as well as his affection for Kim. Ultimately, however, I felt this film neither had the depth of character of its source nor the magic and excitement of the type of adventure it's trying to be; it reads as a tea-time adaptation rather than a film in its own right. I'd rank it as a 7 on my personal scale: worth recommending if it's on, but not worth going out of one's way to see.",
         "This is a nice version of Rudyard Kipling's notorious India tale, adapted in Hollywood style by Victor Saville and set in 1880s. Along with ¨Courageous captains¨, ¨Jungle book¨, ¨The Elephant boy¨ are the Kipling's most known adaptations. Kim(Dean Stockwell) is 15-years old boy posing as vagrant native , but he's actually son of a English sergeant. He's living on his own resources when finds a monk Lama(Paul Lukas) , a holy man. Kim is looking for a red bull an the Buddhist Lama on search for a river where Budda hurled an arrow becoming itself a sacred place. Kim also befriends an Afgan horse dealer named Mahbub Ali (Errol Flynn) . Later on , Kim is trained by English secret service(Arnold Moss) as spy. Then Kim receives orders of a Brit colonel(Robert Douglas) for a daring mission. This rousing adventure film packs emotion, feats, thrills and agreeable performances. Stars Paul Lukas does a magnificent acting as spiritual monk but is Dean Stockwell as the rogue waif , in the title role, who steals show. Although relies heavily on the enjoyable relationship between the protagonists , nevertheless the film is very amusing, providing some intense action scenes and lots of excitement. Enthusiastic supporting cast from Robert Douglas, Cecil Kellaway, Thomas Gomez, Laurette Luez and Reginald Owen as Father Victor, among them. Glamorous cinematography in glimmer Technicolor by William L Skall . Filmed on location in Rajasthan,Agra(India) and US, as Lone Pine, Alabama Hills, Sierra Nevada mountains of California and with production design by prestigious Cedric Gibbons and Hans Peters. Stirring and exotic musical score by Andre Previn. The picture is flavorfully directed by Victor Saville. Rating : Good and nice, it's an exciting family fare. It's remade for TV(1984) in an inferior version directed by John Davies and starred by Peter O'Toole as Lama and Blayr Brown as Ali."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family",
         "History"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Kim, a young boy living on his own on the streets of India, is actually the son of a British officer. He meets a lama, a holy man, and devotes himself to his tending. But when British administrators discover his birthright, he is placed in a British school. His nature, however, is opposed to the regimentation expected for the son of a British soldier, and he rebels. His familiarity with Indian life and his ability to pass as an Indian child allows him to function as a spy for the British as they attempt to thwart revolution and invasion of India. Rejoining his holy man, Kim (with the help of daring adventurer Mahbub Ali) takes on a dangerous mission.",
         "Kim is a young orphan boy, the son of a British soldier by the name of O'Hara who plays - and survives - pretending to be an Indian, He joins a Tibetan lama in search of a holy river but when a British Regimental chaplain discover he's a white boy, he's put into a school for the orphans of soldiers and eventually St. Xavier's, an expensive private paid for his friend the lama. He doesn't fit in very well however and when the long summer holiday arrives he runs off. When he overhears a plot to kill his friend Mahbub Ali, a spy in the employ of British Colonel Creighton, Kim saves him and is recruited to play the great game. When one of Creighton's operatives is killed, Kim goes off on his own and discovers a Russian plot to establish a military presence in the north.",
         "Buring the British Raj, the orphan of a British soldier poses as a Hindu and is torn between his loyalty to a Buddhist mystic and aiding the English secret service."
      ],
      "budget": 0
   },
   "movielensId": 755,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-12-07",
      "dvdReleaseDate": "2003-08-26",
      "directors": ["Victor Saville"],
      "runtime": 113,
      "movieId": 755,
      "title": "Kim",
      "mpaa": "",
      "actors": [
         "Errol Flynn",
         "Dean Stockwell",
         "Paul Lukas",
         "Robert Douglas",
         "Thomas Gomez",
         "Cecil Kellaway",
         "Arnold Moss",
         "Reginald Owen",
         "Laurette Luez",
         "Richard Hale",
         "Roman Toporow",
         "Ivan Triesault"
      ],
      "imdbMovieId": "0042644",
      "originalTitle": "Kim",
      "genres": [
         "Family",
         "Adventure"
      ],
      "youtubeTrailerIds": ["nR5qoOSkfAQ"],
      "plotSummary": "Kim, a young boy living on his own on the streets of India, is actually the son of a British officer. He meets a lama, a holy man, and devotes himself to his tending. But when British administrators discover his birthright, he is placed in a British school. His nature, however, is opposed to the regimentation expected for the son of a British soldier, and he rebels. His familiarity with Indian life and his ability to pass as an Indian child allows him to function as a spy for the British as they attempt to thwart revolution and invasion of India. Rejoining his holy man, Kim (with the help of daring adventurer Mahbub Ali) takes on a dangerous mission.",
      "tmdbMovieId": 110465,
      "avgRating": 3.37342,
      "releaseYear": "1950",
      "numRatings": 158,
      "posterPath": "/9KlWbUFqL1ROwNZSn1Vjw2KnIsn.jpg"
   }
}