{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt0109688",
      "video": false,
      "title": "Ashes of Time",
      "recommendations": [
         24163,
         18311,
         18329,
         11220,
         11104,
         844,
         11471,
         55157,
         30368,
         44865,
         40213,
         42006,
         843,
         47423,
         21835,
         31439,
         123997,
         18817,
         20347,
         13345
      ],
      "backdrop_path": "/pqD0kQIZqLolztvQWTEQdrmPaQo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Ouyang Feng / Malicious West",
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1d8b",
               "name": "Leslie Cheung",
               "profile_path": "/jY0eInsklo9aYc1Som6vEdVd4OL.jpg",
               "id": 69637,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Huang Yaoshi / Evil East",
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1d87",
               "name": "Tony Leung Ka-Fai",
               "profile_path": "/vxrUpkWMqWYMjx5bg8Q0fioBrQg.jpg",
               "id": 56861,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Murong Yang / Murong Yin",
               "gender": 1,
               "credit_id": "52fe45a1c3a36847f80d1d8f",
               "name": "Brigitte Lin",
               "profile_path": "/t1rhY7b63WaZ3FuajV5CQLCgiNR.jpg",
               "id": 56830,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Hong Qi",
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1d7b",
               "name": "Jacky Cheung",
               "profile_path": "/n3zdB09qfGem9V0wftu1MXagqP.jpg",
               "id": 25245,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Blind Swordsman",
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1d77",
               "name": "Tony Leung Chiu-Wai",
               "profile_path": "/xSEwMBLHdiKjyG4YVCsjpaT5fgD.jpg",
               "id": 1337,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Peach Blossom",
               "gender": 1,
               "credit_id": "52fe45a1c3a36847f80d1d83",
               "name": "Carina Lau",
               "profile_path": "/lYKpESOemC8GVxfnInJVC6zglVD.jpg",
               "id": 12672,
               "order": 5
            },
            {
               "cast_id": 24,
               "character": "Girl with mule",
               "gender": 1,
               "credit_id": "52fe45a1c3a36847f80d1db7",
               "name": "Charlie Yeung",
               "profile_path": "/li5TvQ8ySF7xmhEvUCZUU45nBpq.jpg",
               "id": 66762,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Feng's sister-in-law",
               "gender": 1,
               "credit_id": "52fe45a1c3a36847f80d1d73",
               "name": "Maggie Cheung",
               "profile_path": "/eT5HNJT307Zg2PyMsgKdrtIlG3u.jpg",
               "id": 1338,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Hong Qi's wife",
               "gender": 0,
               "credit_id": "52fe45a1c3a36847f80d1d7f",
               "name": "Li Bai",
               "profile_path": null,
               "id": 125464,
               "order": 8
            },
            {
               "cast_id": 29,
               "character": "Swordsman",
               "gender": 2,
               "credit_id": "53fc609e0e0a267a6900a6f7",
               "name": "Collin Chou",
               "profile_path": "/Ug1pqZuUcQjW4y9ljgBpFnHpcA.jpg",
               "id": 52908,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "",
               "gender": 0,
               "credit_id": "53fc60b10e0a267a7500a7db",
               "name": "Siu Tak-Foo",
               "profile_path": null,
               "id": 1357095,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1d63",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1d69",
               "name": "Louis Cha",
               "profile_path": null,
               "id": 67218,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1d6f",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a1c3a36847f80d1d95",
               "name": "Ye-cheng Chan",
               "profile_path": null,
               "id": 1059532,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a1c3a36847f80d1da7",
               "name": "Hai Kit-Wai",
               "profile_path": null,
               "id": 68030,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1dad",
               "name": "William Chang",
               "profile_path": "/u1rSUvhCQSo0z7bPaDoi1pyntFb.jpg",
               "id": 45818,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a1c3a36847f80d1db3",
               "name": "Lee Kwong-Yiu",
               "profile_path": null,
               "id": 144485,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a1c3a36847f80d1dbd",
               "name": "Frankie Chan Fan-Kei",
               "profile_path": "/jQ2wfYUiG5IGEB1eC5BmNxayBCJ.jpg",
               "id": 1011224,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "532ef5349251413a780035c4",
               "name": "Jeffrey Lau",
               "profile_path": "/uyHSy9QyXb9pwZPG2Rd4jI7fPIV.jpg",
               "id": 57617,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5310c39cc3a36829e2001495",
               "name": "Christopher Doyle",
               "profile_path": "/u7xRErdN6ya9qzOG8PVa2QshZFC.jpg",
               "id": 1357,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "532ed68f9251413a81003493",
               "name": "Kwan Pung-Leung",
               "profile_path": null,
               "id": 12667,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 8.61581,
      "production_countries": [
         {
            "iso_3166_1": "TW",
            "name": "Taiwan"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         }
      ],
      "id": 40751,
      "vote_count": 90,
      "budget": 0,
      "overview": "The film is set in five parts, five seasons that are part of the Chinese almanac. The story takes place in the jianghu, the world of the martial arts. Ouyang Feng has lived in the western desert for some years. He left his home in White Camel Mountain when the woman he loved chose to marry his elder brother rather than him. Instead of seeking glory, he ends up as an agent. When people come to him with a wish to eliminate someone who has wronged them, he puts them in touch with a swordsman who can do the job.",
      "similar": [],
      "original_title": "東邪西毒",
      "runtime": 100,
      "poster_path": "/ir2277KpcFcJYZ0VApCXAi5hXm3.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Beijing Film Studio",
         "id": 708,
         "origin_country": ""
      }],
      "release_date": "1994-09-16",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.sonyclassics.com/ashesoftimeredux/",
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": "HKD ",
      "directors": ["Kar Wai Wong"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Louis Cha",
         "Kar Wai Wong"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0109688/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0NzMxMjI0MV5BMl5BanBnXkFtZTcwNzIwNzM5MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Brigitte Lin, Maggie Cheung, Leslie Cheung | See full cast and crew »"],
      "reviews": [
         "This classic ultra-stylized and (in the words of the NYFF blurb) \"insanely gorgeous\" 1994 martial arts or 'wuxia' film based on the Louis Cha novel 'The Eagle-Shooting Horses' needs no introduction to film fans now, though before Tarantino's release of 'Chungking Exrpess' Americans had to go to Chinatown theaters or rent pirated videotapes to see it; I saw it in Chinatown in a double bill with 'As Tears Go By' (1988). A cinematic icon today, Wong Kar-wai didn't get international recognition till 1997 at Cannes (for 'Happy Together'), and the majority of US art-house viewers didn't notice him till 'In the Mood for Love' (2000). Now ironically since the huge blowout and exhaustion of Wong's epic '2046' (2004), a summing-up of his 60's nostalgia themes and characters, he seems to have reached a point of exhaustion, and his English-language romance 'Blueberry Nights' (2007) was a critical failure. Re-editing 'Ashes of Time' looks like another example of treading water, but it's still great to have it; many have still not seen it, and any films as visually magnificent as Wong's are best seen in theaters. It's also fortunate that all his films can be seen on decent DVD's now with readable subtitles for English speakers, instead of the weird earlier Hong Kong prints with flickering titles in Chinese and peculiar English that disappeared before you could read them. 'Ashes of Time Redux' has the best English subtitles yet both visually and linguistically. According to Wong, 'Ashes of Time' negatives weren't in very good shape, and a search of various versions led him to a huge warehouse somewhere near San Francisco's Chinatown that contained the entire history of Hong Kong movies. He and his team put together various versions, adding a bit to what we already know, digitally cleaning up the images and \"enhancing\" some of the color and doing things with the sound, adding a new score and \"re-arrangement\" by Wu Tong including cello solos by Yo Yo Ma. Experts will have to comb over all this to explain the differences. The cinematographer Christopher Doyle, who was present at the press screening of the film at the NYFF, doesn't like the enhancing of the color and neither do I. A lot of yellows and oranges are heightened, greenish-turquoise touches are set in, and many of the desert sand landscapes seem to have lost their surface detail. This seems unnecessary and even obtrusive, but it's not enough to spoil the experience. Other images simply look more pristine and clear. Wong wouldn't say what specific changes were made in the editing. He preferred to talk about how he adapted Louis Cha's novel and how this film relates to his oeuvre. Both for him and for Doyle it was an essential milestone. The cast features the late Leslie Cheung, both Tony Leungs (Chiu Wai and Ka Fai) and Jacky Cheung, and has Maggie Cheung as The Woman and martial arts film great Brigitte Lin as Murong Yin and Murong Yang, the sister and brother. Lin, now retired, was responsible for the revival of the genre and is central to this film, though Maggie Cheung is its diva, its dream lover. Cha's novel is a complicated 4-volume wuxia genre epic, very popular but little known or appreciated in the West. Wong studied it carefully (and made a parody of it called 'Eagle-Shooting Heroes') but then though he says this film unlike all his others had a fixed plan (and thus made for a story full of fatalism), he threw away the story and just took a couple of the main characters and made up another simpler story imagining what the characters' lives were like when they were young. A simpler story. Well. The story has always seemed completely incomprehensible to me but after re-watching 'Redux' it obviously is nonetheless a coherent narrative; it's just intricate and, above all, cyclical. It ends as it begins, with the narrator looking into the camera and repeating the opening lines. 'Ashes of Time' was shot in the desert. Doyle had never done that. The film was long delayed and the shoot was difficult. Doyle knew nothing about martial arts or 'Jianghu,' the parallel universe of martial arts fiction. He was under extreme constraints, having very little artificial light. Nonetheless he produced some of the most beautiful sequences in modern film, because he's a great cinematographer, perhaps the greatest of recent decades, as Wong Kar-Wai is one of the defining contemporary cinematic geniuses. Wong is notable for his meditative and arresting voice-overs. Here is a sample: \"People say that if a sword cuts fast enough, the blood spurting out will emit a sound like a sigh. Who would have guessed that the first time I heard that sound it would be my own blood?\" \"You gained an egg, but lost a finger. Was it worth it?\" There are aphorisms or bits of advice: \"Fooling a woman is never as easy as you think.\" The film is anchored and structured by the Chinese calendar: the Chinese almanac is divided into 24 solar terms and the narrative moves forward selectively through these terms, which contain weather descriptions (naturally) and advice as to what is propitious or unlucky and in what regions and directions. There is also a great deal about oblivion and forgetfulness (which are linked with wine, including a magic wine that eliminates memory). The desert and drinking are visual touchstones throughout as are pairs, opposites, and contrasts; and there is cross-dressing and perhaps bisexual love. The images are full of flickering light. The sword fights, which do not begin until more than half way into the film, are without the acrobatic feats actually performed or digitally faked as in current martial arts films, though they are elaborately staged by the action choreographer Sammo Hung. They are a symphony of fast cutting, closeups, blurs, and slow motion (which Wong intended particularly to express the fatigue of the Blind Swordsman in the film).",
         "Loosely based on the Chinese heroic literature classic, \"The Eagle-Shooting Heroes\" by prolific Wuxia author Louis Cha, ASHES OF TIME is conspicuous for the unusual and postmodern approach it takes to a genre so firmly entrenched in Hong Kong cinema. The \"story\" consists interactions between various characters as they weave in and out of each other's lives, with a small village in a bleak desert wasteland as the crossroads. These vignettes are not always sequential, and we must gradually piece together the relationships and backgrounds of the protagonists, some of which contribute to a larger story, while others do not. The all-star cast portrays a varied palette of characters, perfectly flawed incarnations of fantastical beings, with performances teetering on the line between disarming humanity and iconic romanticism. One thing to love about this movie is the way that director Wong Kar-Wai takes the reflective internal monologues and quirky, alienated losers from his other films and transposes them to the world of Chinese heroic fantasy. It's an interesting idea that both ennobles and deconstructs the genre. Martial-arts superheroes who can literally shear mountainsides with a wave of the sword, mired in their own personal conflicts and bouts with inadequacy, in the points of time that occur between the legend-worthy events. This unusual treatment lends these mythic characters a familiar dimension that is both poetic and banal. The cast and the desert are wrenchingly beautiful in the same starkly desolate way. The music consists of odd synth dirges, like a moody clash of Ennio Morricone and Vangelis (particularly the 1492 soundtrack), but it is nonetheless hauntingly atmospheric. ASHES OF TIME is a truly beautiful movie. The cinematography is a lush blend of stunningly arid vistas, iconic posturing, minute sensual gestures, grainy documentary-style camera-work, and stylish, impressionistic fight sequences. A visual metaphor for textiles and tapestry persists, with the various interwoven plots echoed in the camera's almost tactile attention to fabric and texture throughout... sometimes tightly bound like an inescapable net, others fraying apart like elusive memories. That said, this movie is not going to appeal to everyone. The disjointed dreamlike narrative can be confusing initially, with so many characters behaving in obscure ways, backwards and forwards in time. Still, in the end, if you take some time to retrace your steps, it all does fit together remarkably well. The puzzle pieces really do form a coherent picture, but for most people it will probably take a second viewing to see it all. Also, those looking for the action sequences Hong Kong movies are famous for, will find the emphasis is on the characters and their meandering thoughts. When the (nonetheless exciting and very cool) action scenes do take place, they are blurred hyperkinetic washes of motion. While Hong Kong action films have some of the greatest choreography captured on film, ASHES OF TIME attempts to capture an impressionistic, psychological aspect as well, sometimes obscuring the action as much as displaying it. This movie takes many of its cues from Sergio Leone's revisionist westerns. The stylized desert environment is the wastes of New Mexico revisited through Chinese legend, complete with tormented superhumanly-skilled anti-hero swordsmen/gunslingers, lost, deromanticized ideals, melodramatic showdowns, and roving hundreds-strong gangs of horse thieves. Still, Ashes of Time manages to be its own beast, a technical, artistic, visual, sentimental masterpiece, that gives a new twist on old conventions, while simultaneously managing to belong very much to Wong Kar-Wai's thematic oeuvre. A movie you won't easily forget.",
         "As a Chinese, I had chance to watch Kar Wai Wong's movies in my childhood. One of them is Dung che sai duk. But at that time, I couldn't even understand any of the actor's lines. Didn't understand why they people fight or cry. Then I fell asleep. But after many years, when I went to university, when the girl I deep in love with left me to another country. I saw DVD of this film again, alone. And this time I cannot help enjoying it. Every actor's line touched me very very much. What's behind the mountain? May be another mountain, and another. How wonderful it'd be to forget the past. Everyday would be a new beginning. Isn't that great? What's love? Maybe love is to leave the one you love, to win the one then finally find you have lost everything including yourself. Now I have my job and new life. Many things have been past for a long time. And this movie, I cannot remember some of the scenes. But sometimes I still recall lots of words they say. When I am alone, when I feel gloomy or a little bit sad, the words will come to my mind with beautiful music and the scene of huge desert. In this world, something's gonna change, something's not. If you cannot have someone, the only thing you can do is not to forget. I will never forget.",
         "Although I enjoy them, I seldom re-watch slow and introspective movies. Ashes of Time is the exception to the rule, as it haunts me so much that I have already given it three viewings! It may be because of the wonderful pictures, the essential yet poignant dialogues or the grave & epic music, nevertheless Ashes of Time is a fascinating movie! Set in a tavern in the middle of the desert, it tells us stories of different swordsmen and deals with the theme of unrequited love. All the people, in fact, had to face a rejection.. and now strive to find a way to overcome the delusion and go on with their life. Swordsmanship is mostly viewed as an outlet to bring out the inner passions and frustrations. The protagonist, Ouyang Feng [Leslie Cheung] is one of those swordsmen, who left his lady [Maggie Cheung] and his village to pursue fame and glory, convinced that she would have waited for him to return. Now instead he faces loneliness and the fact that she has married his elder brother. The most peculiar aspect of the movie is the pictures, so beautifully shot that each still can make a wonderful portrait. Even the battles, rather than being filmed continuously, are rendered as a sequence of separate shots, thus remaining more indelibly impressed in our head. Indeed, the movie also focuses about memory (whom the movie title probably refers to) and its power to keep alive moments of the past, that otherwise would perish in the flow of time. Highly recommended! 9/10",
         "Without a doubt, Ashes of Time is the most special film I have ever seen. It is also the most artistic, which naturally means it is more challenging than entertaining. Indeed, I was not comfortable watching it for the first time, but I was so mesmerized that now it has become the movie I have revisited the most. Nevertheless, Ashes is still a very difficult piece to sit through in its entirety. In my opinion, due to its disjointed storytelling, it is a film where parts are better than the whole, and those parts simply take my breath away. Interestingly enough, the most breathtaking and spellbinding film to me is not one I so much \"like\" or enjoy, but is one that I cherish for its evocative artistry. This majestic collection of disjointed heartbreaking tales is complemented to perfection by unrivaled and unforgettable imagery, music, and performances that penetrate the soul.",
         "On the surface of things we are faced with a martial arts film, a typical HK wuxia piece. But knowing Wong Kar-Wai, did you really expect a regular martial arts movie? 'cos that's not what you'll get... Best known for his \"In the Mood for Love\" and \"2046\", this stylish director has established his reputation among Asians and Westerners alike through his dreamy, poetic romances and metaphysical dramas. Here, in Ashes of Time, an earlier film remade, the director's teamwork with cinematographer Christopher Doyle is already in full bloom. The film offers the same colour palette and style that we find in their more recent collaborative works. This film is beautiful to look at, a mystery to behold and a genre-breaking ode to love and loss. Clearly, it looks and feels like a 21st century movie, but its origins go back some years. Based on a film originally released back in 1994, Ashes of Time Redux is a retelling a story that most of us missed the first time around. The \"redux\" is more than a remastered version of the original. Apparently it features significant alterations to the basic structure of the narrative as well a new musical score. More than that, it stands as the definite version of the movie, a true director's cut. It's almost a kind of second birth, because finally the movie can become known for what it truly is. Even though I have not seen the original, I will take the director's word for it and trust his judgment. And it is very easy to trust his judgment when the result is as strong as this relatively short (93 min) film. It feels like a labour of love. There must be heaps and heaps of discarded film on the editing floor, because it is clear that all the little details and cuts were hand-crafted to perfection. My main problem with the film is that it is unforgiving to its audiences, even \"careless\" about how they might feel about being bombarded with constant, overloaded verbiage. The result, full of symbolic links and razor-thin internal connections, may feel over-stylized and over-worked, but this kind of approach to film-making is admirable because it is so rare. Films that demand a lot also reward the viewer for paying attention. But don't get me wrong: this is not a puzzle or a mystery like some Lynch film; nor is it surrealistic dream logic like some Buñuel. No, it conveys a surprisingly simple poetic truth, encompassing love, manhood, relationships, struggle, perseverance, betrayal, fantasy, hate, jealousy, remembrance, forgetfulness, loss and loneliness. It is a movie about forgetting, and about the forgetting of having forgotten in the first place. It portrays characters as duplicates, mirages and psychic phantoms. Identities are mixed up. Friendships are won and lost, mainly lost. Love is first fleeting, then impossible and finally a memory. Memory, and time, and the passing of time: these are the central themes of this tale divided up into (non-linear) seasons. Nature is cyclical, and so is human life and especially human memory, which is always obsessed about some recurring dream or fantasy. Memory is not a time-line of events but a force of inertia, a dead weight and a curse. Time is the archnemesis of happiness, and love is proved impossible by the accidents of nature. Love that once was is no more. Nor was there any love to get around to begin with, if memory serves me correctly. Have another sip of wine, it'll help you remember/forget... The performances are through and through superb. Both the male characters and the elusive female characters are perfectly cast, and the fact that it's an all-star cast does not make it feel any less authentic. Especially female charms (and the ambivalent androgyny of one of them) are given such full force that we are left with a sea of emotions, an ocean of desire. The wailing soundtrack reaches melodramatic heights even when you expect nothing but calm and quiet; this signals that the characters are still haunted by their past. There IS no quietude, only the passing of time and the lingering-on of memory. The sword-fights are stylish (thanks to Sammo) but peripheral. Action is more often than not a piercing flash of violence that only deepens the emotional wounds carried in the hearts of the protagonists. The physical dagger in the heart of man is nothing compared to the deep soul wound inflicted in love. In death, some lucky ones lose their anxiety, while others lose nothing but their chance for redemption. Still others are driven to death by precisely this impossibility of redeeming themselves. Living and death become equally mortifying. These themes, such as the passion of unrequited love, and the wounding of lonely hearts, will be familiar from films like Mood and 2046. In fact, the director is as obsessed about these themes as are the characters in his movies. The setting does not matter: human heart is always the same - desiring, hurt and lonely. But it is not pure darkness that we encounter, there are also a few authentic flashes of pure passion and empathy (although less in Ashes than in many of his other films). To call Wong Kar-Wai a pessimist is to call outer space cold: it is rather to miss the point, to understate the case. He is not a pessimist but an explorer of love's tragic journey in life, from conception to annihilation. He takes us, as it were, beyond the here into the yonder, and gives us intimations of love's afterlife. The film is not perfect. It is oftentimes too self-absorbed. The audience will be split. I know I was. I didn't especially enjoy the movie-going experience, but I learnt a lot from it, and remembered something I thought I had forgotten... In this honest and heart-wrenching mood piece, love's memory, on the big screen, is burnt into ashes of time.",
         "I saw this at the New York Film Festival in which Bridgette Lin, who was in the first segment of the film, was there. She still looks beautiful. This film is not a remake, it is a redone version of the film, a 1992 drama set and shot in the Chinese desert in which Ouyang Feng (the late Leslie Cheung) plays a person for hire, mostly to kill others. Through the film, you see various people enter his life, and their stories are told in the passing of the seasons. This absolutely stellar casts includes Maggie Cheung, both Tony Leungs, Carina Lau and Jacky Cheung, along with Bridgette Lin and Leslie Cheung. The film chronicles tales of love, lust, betrayal, vengeance, pain and yearning admirably. There is also excellent swordplay in this film, but the real brilliance of this film is the cinematography by Christopher Doyle. The desert is punctuated with wind & sandstorms, and many images are purposely blurred. Really, if you are a film buff of any kind, this film is essential viewing for the cinematography alone. The film is more dramatic than violent and you are filled with a sense of foreboding throughout, wondering what will happen next. I never saw the film in its original incarnation, so I can't compare, but if you did see the film and liked it you have to see this. If you're a fan of director Wong Kar Wai, this is also essential viewing. Do yourself a favor and try to catch this film in a theater, where you can enjoy the overall majesty of it. Not a perfect ten only because at times it is a bit hard to follow, but stay with it and you'll be rewarded with a great cinematic experience.",
         "Kar-Wai is one of the three best directors working today. Many feel this is his best work. Surely it is the greatest leap since his previous, but I find the Mood-2046 pair more important, even lifealtering. If you come into this expecting a story that unfolds in good order and makes sense, you will be disappointed. The overlapping of layers, the folding of narrative, the merging of images is what we're in for. There are two famous stories about this. The first is that at some point he quit work, then quickly went off to make \"Chunking Express,\" during which he \"found himself\" ... The other story has to do with \"Pulp Fiction.\" Tarantino is a huge borrower of ideas. Having already written a couple \"raw\" movies that people admire, he stumbled upon Kar-Wai in the midst of making this \u0097 a long affair. All the clever bits in the structure of \"Pulp\" are from this, just as surely as all the clever bits in \"Star Wars\" are from Kurosawa. What are those bits? Multiple persons in one body. Multiple bodies for one person. Circular storytelling where any part is the beginning. Nested narrative where one story tells another. Characters that imagine and forget each other, bringing them into our world and out. Death, love, yearning, accident, encounter. All of this at the beginning of a luscious partnership between Kar-Wai and Christopher Doyle. They are today what Greenaway and Sacha Vierny were: dangerous adventures in cinematic imagination coupled with mastery of cinematic expression. This takes a few too many chances and you can see precisely where Kar-Wai abandoned it to search for sense. (He always shoots in order of what you see.) But if you are ready for the transcendental thrills of his later work, you might want to start here. Ted's Evaluation -- 3 of 3: Worth watching.",
         "\"Ashes of Time Redux\" is Wong Kar Wai's venture into the martial arts genre. However, energetic action and narrative clarity take a backseat to the visual poetry that contemplates wounded hearts, loneliness and the memories of lost love that cut deeper than any sword. Best appreciated as a sensory experience, \"Ashes of Time Redux\" unfolds as a series of beautiful yet melancholic images like the soft brush strokes of a Chinese landscape painting. Even the sword fights are shot as swirling, hallucinatory dreamscapes. The haunting desert landscape gorgeously captured in saturated colors by cinematographer Christopher Doyle, a brooding cello score by Yo-Yo Ma and the beauty of the actors (an all-star Hong Kong cast) contribute to a movie experience that both pleases the senses and engages the heart.",
         "'Ashes of Time' is the rarest of Wong Kar Wei's films and best remembered as the one that so confounded him that he went off and made 'Chungking Express' to clear his mind before finishing it. Actually, it's worth remembering in its own right, as he brings his uniquely romantic take on the world to the fantasy swordplay genre with the expected unexpected results. There are sword fights, most of them pretty good, but the fantasy is kept to the bare minimum with the focus on the emotional cost of being a professional killer. Love is lost and so are memories, vengeance is sought and denied, characters meet but fail to connect, secrets are kept and regrets shared, all filtered through Leslie Cheung's inn on the edge of the desert where he acts as agent for killers for hire. The interest here isn't in action but reasons, and in the emotional cost of pursuing a life of violence, all captured via his usual dreamlike imagery and poetic confessional narration. Part Hong Kong, part European, part Leone (acknowledged/plagiarised at times in the score), not everything works, but the parts that do are quite magnificent, whether it's a woman tracing her hand over the sleeping body of a man who is not her lover or the curiously memorable shots of the horse thieves waiting their turn in a battle. It can get confusing \u0096 not only do the characters sometimes blur into each other but he even hires both Tony Leungs for key roles in the same film while Brigitte Lin plays dual roles and, just to add to the clarity, the film's chronology is very misleading \u0096 but it's worth bearing with. A film I'll definitely be returning to, and I suspect more than just the once."
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "Jet Tone Production",
         "Block 2 Pictures",
         "Scholar Films Company"
      ],
      "summaries": [
         "Ou-yang Feng lives in the middle of a desert, where he acts as a middle man to various swordsmen in ancient China. One of those swordsmen is Huang Yao-shi, who has found some magic wine that causes one to forget the past. At another time, Huang met Mu-rong Yin and under the influence of drink, promised to marry Mu-rong's sister Mu-rong Yang. Huang jilts her, and Mu-rong Yin hires Ou-yang to kill Huang. But then Mu-rong Yang hires Ou-yang to protect Huang. This is awkward, because Mu-rong Yang and Mu-rong Yin are in reality the same person. Other unrelated plot lines careen about. Among them is Ou-yang's continuing efforts to destroy a band of horse thieves. Oy-yang recruits another swordsman, a man who is going blind and wants to get home to see his wife before his sight goes completely. The swordsman is killed. Ou-yang then meets another swordsman who doesn't like wearing shoes. Oy-yang sends this man after the horse thieves, with better results. We then find out what a man must give up to follow the martial path.",
         "A broken-hearted hit man moves to the desert where he finds skilled swordsmen to carry out his contract killings."
      ],
      "budget": 40000000
   },
   "movielensId": 757,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "普通话"
      ],
      "releaseDate": "1994-09-16",
      "dvdReleaseDate": "2001-01-01",
      "directors": ["Wong Kar-wai"],
      "runtime": 100,
      "movieId": 757,
      "title": "Ashes of Time",
      "mpaa": "R",
      "actors": [
         "Leslie Cheung",
         "Tony Leung Ka-Fai",
         "Brigitte Lin",
         "Jacky Cheung",
         "Tony Leung Chiu-Wai",
         "Carina Lau",
         "Charlie Yeung",
         "Maggie Cheung",
         "Li Bai",
         "Collin Chou",
         "Siu Tak-Foo"
      ],
      "imdbMovieId": "0109688",
      "originalTitle": "東邪西毒",
      "genres": [
         "Drama",
         "Action"
      ],
      "youtubeTrailerIds": ["j8zg_25-SYA"],
      "plotSummary": "The film is set in five parts, five seasons that are part of the Chinese almanac. The story takes place in the jianghu, the world of the martial arts. Ouyang Feng has lived in the western desert for some years. He left his home in White Camel Mountain when the woman he loved chose to marry his elder brother rather than him. Instead of seeking glory, he ends up as an agent. When people come to him with a wish to eliminate someone who has wronged them, he puts them in touch with a swordsman who can do the job.",
      "tmdbMovieId": 40751,
      "avgRating": 3.57353,
      "releaseYear": "1994",
      "numRatings": 272,
      "posterPath": "/ir2277KpcFcJYZ0VApCXAi5hXm3.jpg"
   }
}