{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116833",
      "video": false,
      "title": "The Last of the High Kings",
      "recommendations": [
         37613,
         64523,
         43079,
         41240,
         21370,
         26108,
         39467,
         18808
      ],
      "backdrop_path": "/hI0psXjFJrUf3kf7PuHArWzoYGn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cathleen",
               "gender": 1,
               "credit_id": "52fe46b0c3a368484e09e7cb",
               "name": "Catherine O'Hara",
               "profile_path": "/nDlIwrkmvz11mwsKSTAbM2dfDgC.jpg",
               "id": 11514,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Frankie Griffin",
               "gender": 2,
               "credit_id": "52fe46b0c3a368484e09e7cf",
               "name": "Jared Leto",
               "profile_path": "/msugySeTCyCmlRWtyB6sMixTQYY.jpg",
               "id": 7499,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Erin",
               "gender": 1,
               "credit_id": "52fe46b0c3a368484e09e7d3",
               "name": "Christina Ricci",
               "profile_path": "/dzB58d6fNrTEi7nBAU1tySJc2at.jpg",
               "id": 6886,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jack Griffin",
               "gender": 2,
               "credit_id": "52fe46b0c3a368484e09e7d7",
               "name": "Gabriel Byrne",
               "profile_path": "/lFIH4De52Eg21m7pScPMXezZDUh.jpg",
               "id": 5168,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Cab Driver",
               "gender": 2,
               "credit_id": "52fe46b0c3a368484e09e7db",
               "name": "Stephen Rea",
               "profile_path": "/taD1NngDbW8cyCuacAT3YaecSEG.jpg",
               "id": 9029,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jim Davern",
               "gender": 2,
               "credit_id": "52fe46b0c3a368484e09e7df",
               "name": "Colm Meaney",
               "profile_path": "/irPAowqDk7llCvm8uyCJuBClzJw.jpg",
               "id": 17782,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Nelson Fitzgerald",
               "gender": 2,
               "credit_id": "52fe46b0c3a368484e09e7e3",
               "name": "Jason Barry",
               "profile_path": "/cHtfb7s9LsDGMJqm5bCl9HehecD.jpg",
               "id": 8541,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Romy Thomas",
               "gender": 1,
               "credit_id": "52fe46b0c3a368484e09e7e7",
               "name": "Emily Mortimer",
               "profile_path": "/jSw6VNNFXCc0cEAbGHafiWOWRKU.jpg",
               "id": 1246,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46b0c3a368484e09e7ed",
               "name": "David Keating",
               "profile_path": "/dMCnrepKBgAdEH3pYYaSpdQkQn8.jpg",
               "id": 229695,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a869f600e0a2653b3035131",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a869f700e0a26400b0389ea",
               "name": "David Keating",
               "profile_path": "/dMCnrepKBgAdEH3pYYaSpdQkQn8.jpg",
               "id": 229695,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a869f77c3a3682dbf03b95e",
               "name": "Gabriel Byrne",
               "profile_path": "/lFIH4De52Eg21m7pScPMXezZDUh.jpg",
               "id": 5168,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.697173,
      "production_countries": [],
      "id": 63564,
      "vote_count": 21,
      "budget": 0,
      "overview": "It is 1977, Dublin rocks to the music of Thin Lizzy and the world is stunned by the death of Elvis Presley. Frankie, caught between acne and adulthood, has just completed his final exams in school. Convinced he will fail, he survives the summer organising a beach party, having lustful thoughts about two girls he believes are unobtainable and fending off the advances from a visiting American family friend, all whilst coping with his oddball family.",
      "similar": [],
      "original_title": "The Last of the High Kings",
      "runtime": 102,
      "poster_path": "/zMhtL7emeyMcIHUnbPtrjhoB5jf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-12-06",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "When school ends... and life begins.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Keating"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Gabriel Byrne",
         "David Keating"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116833/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3NzA2ODQ4N15BMl5BanBnXkFtZTcwOTQyNTQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Catherine O'Hara, Jared Leto, Christina Ricci | See full cast and crew »"],
      "reviews": [
         "A coming of age story for people who don't usually like coming of age stories, unfortunately renamed for American audiences a Summer Fling, which it is not about at all. Nor is it really much of a coming of age movie, in the sense the strongest character is the proddy hating Irish Catholic mother, played by Catherine O'Hara, a red haired overly political passionate nutcase who steals the movie from the kids. The kids, by the way, are interesting, amusing, and not idiotic, like those found in most Hollywood comedies. I found the movie entertaining and I appreciated not being patronized. If you're looking for something light, a little Irish, and a pleasant way to pass the time, check this out.",
         "I really liked this movie, however I may have missed it if I only knew it by it's US video title, \"Summer Fling\". That really does not do this entertaining film about a young man and his wacky family justice. Catherine O'Hara was great as well as the rest of the cast. I wish US video makers would stop messing with Irish, UK and European film titles.",
         "Saw this film in Ireland when it came out and loved it then. Found it again on Amazon and I still think it's a great film. It is touching without being mawkish, wryly amusing. Makes me glad I'm half Irish! Interesting introduction to Lorraine Pilkington, lovely girl and a talented actress. The setting is perfect, faded gentility in an Ireland becoming more sophisticated. Some comment on the politics of both church and state, poking gentle fun at both. Not deeply intellectual, but fun without being facile. If you like to see genuine human interaction, skilfully portrayed, you will love this film, now something of a period piece.",
         "Many people may believe that \"Summer Fling\" is a coming of age story. From my perception, I see that this movie is about a 17 year old boy growing up in 1977 Dublin, named Frankie Griffin(played by Jared Leto) trying to discover his destination in life. The movie starts out with Frankie taking exams for his completion of school. The results to these exams will play an important matter if either Frankie is going to further his education or has to get a job. Catherine O'Hara plays Frankie's mother, Cathleen, who is very political and devoted to her country. Frankie's father, played by Gabriel Byrne, is a steady stage actor who is a minor influence in Frankie's life and also to the film, but plays an important element in the storyline. Throughout the film, Frankie tries to gain the respect of two protestant girls that Cathleen is not to fond of. However, Christina Ricci plays Erin, a girl who is from America, is of Irish decent, and not protestant. Cathleen welcomes Erin with open arms, and Frankie just ignores her. Many people may think that \"Summer Fling\" is about a boy who has a fantasy about being in love with one of the two protestant girls. But to everyone's surprise, \"Summer Fling\" is about a boy who is on his journey into coming into manhood and along the way picking his own path in his life. I believe that this film a great original story that will make you rethink about important matters in your own life and making dreams of your own.",
         "It is tempting to dismiss this as a condescending survey of the only semi-modernized Ireland of Irish-Americans nostalgia, overbearing on dry humor that is not funny to anyone not broadly familiar with Irish history and sociology, and particularly so since the lead roles are filled by Americans. Yet as anyone who has been to Ireland will discover, it is difficult to draw the distinction between the packaged commercialization of Irish culture and Irish culture itself--partially because entities like the Guinness Irish Pub Co. are just plain good at what they do, so that the Irish themselves get wrapped up in it. (Go to any well-designed \"Irish pub\" in a major U.S. city and I guarantee you will find Irish people drinking there themselves.) With this in mind, it is a shame they had to change the U.S. title to the rather bland, Hollywood-esquire \"Summer Fling\" presumably to get into the theaters, since pretty much everyone who would want to see this movie would understand \"The Last of the High Kings.\" But I suppose I digress. Frankie Griffin is desperate to be \"normal,\" yet stuck in a family of idiosyncrasies and waiting painfully for his exam results to return so that he can know whether he will be going to university. The film is not entirely clear what drives this desire for \"normalcy,\" nor does it seem wholly sympathetic toward his somewhat immature proclamation of self-emancipation from the bonds of Catholicism, Fianna Fáil, and chastity. Frankie is apparently highly gifted in the letters and in music, yet he refuses to show this to anyone, even to the end. Perhaps, then, the admonition of his stern and quirky yet very loving mother that \"There are plenty of good Protestants... It's a shame they're all dead\" (along with accusing Jayne of being a \"Protestant bitch,\" which she is, though not because of her Protestantism) is a hint that his true coming of age will only come with his embracing of his family and identity. The Last of the High Kings is a fun little ride when it takes us into those nostalgic facets of 1970's Ireland and despite its theme, admits that no one these days really comes of age by 17. It is not, however, one of my favorites, owing to its choppy progression and holding back of sympathetic notes for the main characters.",
         "regardless what some would think about this movie...it was a great movie...those who don't like it probably stay pretty much on the side of the \"shoot em up...kill em...kick em...punch em...destroy\" type movies. For those who are more down to earth.. you will probably enjoy this movie emensely...",
         "1977. Awkward teenager Frankie (an excellent and engaging performance by Jared Leto) has just finished his final exams that could lead to him going to college. However, Frankie fears that he may have failed said exams, so he spends the summer pining for two local girls while contending with his eccentric family and trying to figure out exactly what he's going to do with the rest of his life. Director David Keating, who also co-wrote the wry script with Gabriel Byrne, relates the engrossing story at a relaxed pace, offers an affectionate depiction of the 70's era that thankfully doesn't resort to silly kitsch, neatly mines an amusing line in good-natured low-key humor, and astutely nails the bittersweet yearning, confusion, and uncertainty of adolescence verging on adulthood. Moreover, what makes this movie so likable and appealing is the breezy way it just sort of ambles along at a pleasantly laid-back clip, with plenty of well observed moments of warm drama and gentle comedy sprinkled throughout as well as loads of sharp asides at Irish pride, conservatism, and nationalism. The sturdy acting by the able cast keeps the picture on track: Catherine O'Hara almost steals the whole show with her spirited portrayal of Frankie's fiery and domineering mother Cathleen, Christina Ricci makes the most out of her regrettably minor role as bubbly and radiant American Erin, Byrne registers well as Frankie's colorful actor father Jack, Colm Meaney impresses as smug politician Jim Davern, and Stephen Rea has a funny bit as a gregarious cab driver with a knack for telling tale tales. In addition, there are praiseworthy contributions from Lorraine Pilkington as the saucy and vibrant Jayne Wayne, Jason Berry as loyal friend Nelson Fitzgerald, and Emily Mortimer as the pretty and charming Romy Thomas. Bernd Heinl's crisp cinematography provides a pleasing sunny look. Michael Conventino's jaunty harmonic score and the choice rock soundtrack are fine as well. A nice little film.",
         "A coming-of-age drama, set in Ireland in 1977, the year Elvis died. Louisiana-born Jared Leto plays the eldest and somewhat shy son of an eccentric Irish family, waiting for his exam scores for college admittance while his father (Gabriel Byrne) trots off to America for an acting gig and his mother (Canadian-born Catherine O'Hara) is driving him insane. Plus the two hottest girls in town (one of them Emily Mortimer) are both sniffing around him, and he is the subject of unwanted attention from a visiting American (Christina Ricci). Everything is coming to boil, including a sleazy politician (Colm Meany) sniffing around Leto's perpetually lonely mom. O'Hara is a hoot, and makes what might have been a thoroughly obnoxious character actually quite lovable. A young actor at the time, Leto already showed great promise. I won't vouch for his Irish accent, not being Irish.",
         "Great performances by Catherine O'Hara and Gabriel Byrne as the parents of the Griffin household; both roles are very different (as far as I know) from what the actors usually play. Jared Leto proves himself to be a good actor and also shows he can do a convincing Irish accent.",
         "Fine drama about an Irish family. The story is nothing new but the movie is very entertaining. There are some big names related to this movie. Gabriel Byrne was co-writer of the screenplay, producer and actor in this movie. There's also a small but funny role for Stephen Rea as a cab driver. The leading role is for Jared Leto, the guy who played also one of the leading role is the outstanding movie \"Requiem for a dream\". In \"The last of the high kings\" he also gives a good performance. Furthermore we have Emily Mortimer who gives an excellent performance as the sweet and beautiful Romy Thomas. Christina Ricci, who we know from \"The opposite of Sex\" is also in this movie as Erin. In general this is a entertaining and sometimes funny movie, although there's nothing special in it. 7/10"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Irish Film Board",
         "Nordisk Film",
         "Northolme Entertainment"
      ],
      "summaries": ["It is 1977, Dublin rocks to the music of Thin Lizzy and the world is stunned by the death of Elvis Presley. Frankie, caught between acne and adulthood, has just completed his final exams in school. Convinced he will fail, he survives the summer organising a beach party, having lustful thoughts about two girls he believes are unobtainable and fending off the advances from a visiting American family friend, all whilst coping with his oddball family."],
      "budget": 0
   },
   "movielensId": 763,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-06",
      "dvdReleaseDate": "2003-01-14",
      "directors": ["David Keating"],
      "runtime": 102,
      "movieId": 763,
      "title": "The Last of the High Kings",
      "mpaa": null,
      "actors": [
         "Catherine O'Hara",
         "Jared Leto",
         "Christina Ricci",
         "Gabriel Byrne",
         "Stephen Rea",
         "Colm Meaney",
         "Jason Barry",
         "Emily Mortimer"
      ],
      "imdbMovieId": "0116833",
      "originalTitle": "The Last of the High Kings",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "It is 1977, Dublin rocks to the music of Thin Lizzy and the world is stunned by the death of Elvis Presley. Frankie, caught between acne and adulthood, has just completed his final exams in school. Convinced he will fail, he survives the summer organising a beach party, having lustful thoughts about two girls he believes are unobtainable and fending off the advances from a visiting American family friend, all whilst coping with his oddball family.",
      "tmdbMovieId": 63564,
      "avgRating": 3.07377,
      "releaseYear": "1996",
      "numRatings": 61,
      "posterPath": "/hFnr81xOiXUYqg1lura8ynHAs7G.jpg"
   }
}