{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "fast food restaurant",
            "id": 3015
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "pizza",
            "id": 4735
         },
         {
            "name": "rejection",
            "id": 4951
         },
         {
            "name": "sexual fantasy",
            "id": 9835
         },
         {
            "name": "obesity",
            "id": 9974
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0113280",
      "video": false,
      "title": "Heavy",
      "recommendations": [
         294459,
         367053,
         161382,
         40479,
         54694,
         54747,
         54680
      ],
      "backdrop_path": "/u6kFweWbsrdmzYxubvYYwDUzU47.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Callie",
               "gender": 1,
               "credit_id": "52fe4449c3a368484e01a749",
               "name": "Liv Tyler",
               "profile_path": "/jDxaBShnipKE2wvRaHavTtZb0qk.jpg",
               "id": 882,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Victor Modino",
               "gender": 2,
               "credit_id": "52fe4449c3a368484e01a741",
               "name": "Pruitt Taylor Vince",
               "profile_path": "/p3xmcGJ7IKCxw42lwQbg4WmwPTA.jpg",
               "id": 3201,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Dolly Modino",
               "gender": 1,
               "credit_id": "52fe4449c3a368484e01a745",
               "name": "Shelley Winters",
               "profile_path": "/zVg966M0RVK5kycHZUEDc51QULV.jpg",
               "id": 7632,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Delores",
               "gender": 1,
               "credit_id": "52fe4449c3a368484e01a74d",
               "name": "Deborah Harry",
               "profile_path": "/pASovJqjDaaHGs08jQs9FBOuWW6.jpg",
               "id": 102,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Leo",
               "gender": 2,
               "credit_id": "5468d025eaeb816b43000f50",
               "name": "Joe Grifasi",
               "profile_path": "/cesXbWZaKHeOhsSdfbF9mB9750w.jpg",
               "id": 4887,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jeff",
               "gender": 0,
               "credit_id": "5468d03122136e68c7000f22",
               "name": "Evan Dando",
               "profile_path": null,
               "id": 1386006,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Grey man in hospital",
               "gender": 2,
               "credit_id": "5961979f9251410b860cc3ae",
               "name": "David Patrick Kelly",
               "profile_path": "/ujvmeyBvEJ7gkvww0OYDBlbxOTT.jpg",
               "id": 1737,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Darlene",
               "gender": 0,
               "credit_id": "596197e19251415a4009a70b",
               "name": "Marian Quinn",
               "profile_path": null,
               "id": 171374,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Donna",
               "gender": 0,
               "credit_id": "596198049251410b860cc41c",
               "name": "Meg Hartig",
               "profile_path": null,
               "id": 1443860,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Jean",
               "gender": 1,
               "credit_id": "596198209251410c560c2618",
               "name": "Zandy Hartig",
               "profile_path": "/famJMe0BPufHc0lf1pp9p0wdRp2.jpg",
               "id": 1475102,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Tony",
               "gender": 0,
               "credit_id": "5961982fc3a368253c0b4f42",
               "name": "Peter Ortell",
               "profile_path": null,
               "id": 1771098,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Orderly",
               "gender": 0,
               "credit_id": "596198479251410a590c8c29",
               "name": "George Alvarez",
               "profile_path": "/pWPb1egSo8Mf9XNFylONFk2nVQO.jpg",
               "id": 58956,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "596198579251415a4009a7a6",
               "name": "Cordis Heard",
               "profile_path": "/dQPfidlcSRhsdUWf9A8fObYeck3.jpg",
               "id": 90531,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Gas Man",
               "gender": 2,
               "credit_id": "59619870c3a36825e80bbffa",
               "name": "J.C. MacKenzie",
               "profile_path": "/znCOHTsdWW1WgrJ8NuYecdcSqOE.jpg",
               "id": 63296,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4449c3a368484e01a753",
               "name": "James Mangold",
               "profile_path": "/1gt0VmCyBHhQLKhaBDCEIwvRWe.jpg",
               "id": 366,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5468d00722136e68c900117d",
               "name": "James Mangold",
               "profile_path": "/1gt0VmCyBHhQLKhaBDCEIwvRWe.jpg",
               "id": 366,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.755976,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22621,
      "vote_count": 17,
      "budget": 0,
      "overview": "Victor is a cook who works in a greasy bar/restaurant owned by his mother, Dolly. It's just the two of them, a waitress named Delores, and a heavy drinking regular, Leo. But things change when Callie, a beautiful college drop-out, shows up as a new waitress and steals Victor's heart. But Victor is too shy to do anything about it, and too self-consciously overweight to dream of winning Callie away.",
      "similar": [
         27066,
         9769,
         1213,
         1939,
         2252,
         1586,
         10285,
         298312,
         2142,
         3134,
         49950,
         638,
         1730,
         11564,
         1599,
         2149,
         25983,
         521,
         11033,
         20178
      ],
      "original_title": "Heavy",
      "runtime": 105,
      "poster_path": "/y0yIzgFOxJMvyOOtOQfPt2Fa8xH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Available Light Productions",
         "id": 4125,
         "origin_country": ""
      }],
      "release_date": "1995-01-20",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Mangold"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["James Mangold"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113280/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMDgwNDQ5MV5BMl5BanBnXkFtZTcwNzQzMTkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Pruitt Taylor Vince, Shelley Winters, Liv Tyler | See full cast and crew »"],
      "reviews": [
         "This film is beautifully shot, and full of emotion. It is a character study. Very little action,of even the most basic kind. But you are drawn into the film, if you have even the slightest compassion, by the sheer loneliness and alienation of the characters. The lead character, Vincent, is a middle aged man, weighing 250lbs. Heavy. Our first introduction to Vincent plays upon our own bigoted perceptions of big guys: that they're all perverts. But through the film, we get to know Vince, and find that he is motivated, or rather paralyzed, by a fear of change and a painful shyness. His also a highly moral person. Not in the Christian sense, which would tend to make him seem truly perverse, but in the Human sense. He believes in Dignity and, despite the seemingly futility of it, Hope. These are hard things to find in the small town in which he resides; especially considering he works in the family pub. I won't give away the ending, but HOPE sums it up. The film deals with the hardships of being an overweight man, without indicting anyone or blaming anyone; and without telling the audience that being a big boy is inherently evil. In fact, Director James Mangold has much affection for this lonely man. If you have ANY opportunity to watch this film on DVD with Mangold's commentary, please do, but only after you have watched the film once or twice. Pruitt Taylor Vince is perhaps in this film better than I have ever seen him. He is a beautiful man, whose eyes are filled with every emotion imaginable. I can tell, he has been through these painful experiences before in his own life. The rest of the cast is great too. You won't see glamorous people here. Shelly Winters plays the mother with a spareness that makes you think there's not much underneath, but as the film unfolds you find the exact opposite. Deborah Harry essentially revisits the \"Wise Guy\" character she played, but without the glamor. Lost and desperate, and too old to pretend she's not. Liv Tyler, in one of her first roles, is also lost and desperate, but without the cynicism of Harry. Great counterbalance. She is also beautiful, and compassionate. Mangold knows human nature. Here, he takes the brave step of challenging the audience to stop and think about it. The pauses in this movie are amazing, and say more than 30 minutes of a traditional narrative film do. This film is not just about a heavy guy...it is about all of us; how we react to those who are different, our own insecurities, our own sorrows, loneliness, and frail hearts. And yet, it defies becoming a \"chick flick,\" Perhaps because it does center around the man's experiences, or perhaps because it does not cop out at the end with Cinderella fantasies. WATCH THIS FILM.",
         "Solemn, but terrific mood piece about a shy, chubby cook in a rivertown restaurant who fantasizes about getting to know the new waitress who just hired on, a perky young thing with long brunette hair and a big charming smile. Graceful film never goes the commercial route, neither injecting shady characters into the mix nor throwing in blatant jokes to give the film comedic uplift. The picture is all on one level, which may drive some viewers batty with impatience, but I found the whole thing quietly invigorating. The lead character, Victor (Pruitt Taylor Vince), daydreams, watches airplanes, has secret hopes; he's a loner, and the filmmakers are careful not to flood the screen with potential conquests. There's Debbie Harry as a loose waitress with weary eyes and Liv Tyler, the new hire, who brings fantasy into Victor's life, but, as with all fantasies, the advent of reality diffuses the passionate tension. Everyone is sad in this film, and I imagine some audiences won't get with it, but I admire director James Mangold for putting this story on film so eloquently. It's a new \"Marty\". *** from ****",
         "Heavy is a film about sad and desperate people, all of whom seem to have nothing to look forward to. At the center of the film is Victor, played magnificently by Pruitt Taylor Vince. He's the cook at his mother's restaurant. Victor goes about his job and life almost mechanically, he rarely say a word and his movement is limited. Until a couple of major event in his environment happens. One the hiring of a beautiful young waitress named Callie(Liv Tyler) which represent to Victor something wonderful and unattainable. Yet it gives him hope for his empty existence. The second major event is tragic, yet Victor hides it from everyone around him because he wants things to stay the same. He has no sense of what else is there for him. Yet this event might give him the opportunity to go out and see what's beyond the front door of his mom's restaurant. The final reel shows that whereas the other character's lives seem to be continuing the same pattern of sadness and despair. Victor might try to move on with his. Particularly his interaction with a convenience store female clerk with whom he's never spoken to before. It's not much but it's a start.",
         "As one of my boyfriends friends described this film \"This is one of those movies where you don't really feel any better after you watch it.\" Reguardless, this is a film everyone needs to see. This film is about Victor, who is brutally shy. Victor has had everything a certain way, for a long time, and wants it to stay that way. His dream is to go to culinary school and become a chef, so his mom and dad open a resturant, so that he has a place to cook - sort of a greasy spoon - nothing all that special. During the film, Victors mom gets sick, and he takes her to the hospital. He sits with her for days. He goes to the cafeteria for lunch, and while he's gone for lunch, his mom dies. He doesn't tell anyone - not even the people that work at the resurant, because, as he puts it later, he \"didn't want anything to change.\" I am unfamiliar with the man that played Victor in this film. However, I think he is one of the most amazing actors that I've seen in a long time. You feel all his emotions - his painful shyness, how alone he feels after his mom passes, how alone he is in the world. You actually FEEL all of that. Now, be forwarned - I cried for two days after watching this movie. This mans performance was just so heartbreaking, that I couldn't help it. Every time I thought about it, I teared up. If your wanting a feel-good movie, or a date movie, I wouldn't really recommend this. However, if your having one of those \"depressed, lay around in your pajamas, and eat a whole tub of ice cream\" sort of days, then I wouldn't miss this film at all.",
         "An overweight cook who lives with and works for his mother, develops a crush on a young waitress who comes to work for their diner. However, what do you say when you're 30, overweight, have never gone anywhere, never kissed a girl, and rarely speak more than three words a day? Not everyone will get this movie. Having said that, it's a work of beauty. A simple story line, with minimal drama, dealing with a situation that could happen to anyone, except that it happens with someone who is unable to express himself. The simple pulse of this movie beats and builds slowly, and doesn't sweep you away, but leaves you to contemplate life in someone else's shoes. Excellent cinematography, a haunting original score by Thurston Moore, and a story that's so fresh simply because of it's ordinary nature. We need more films like this. I was disappointed to find that James Mangold has since gone on to write and direct some movies, which are quite overblown. However, this one was pragmatic and elegant.",
         "\"Heavy\" is not the type of movie I would watch when looking for action, thrills, horror, or adventure. It's not about a fat guy making goo-goo eyes at a pretty waitress where he makes pizzas, either... although that could be seen from an outsider's glance. The movie captures a period of time where our big hero, Victor, is experiencing a number of life-altering changes. From what we know, he has always led a sheltered life under the regime of his mother. When a new waitress, Callie (Liv Tyler), starts work at the bar, Victor's daily life is suddenly altered from a spark of curiosity. He's not a perverted horndog, but he is fascinated by this girl's kindness and beauty, watching her from afar and having visions of her as the drama grows. It's the quiet internal struggle Victor faces that really heightens the intensity of the movie. Those nervous eyes, the quiet voice, the big guy who won't fight back... he is a man trying to become a man. By the end of the film, we are at least given the hope that he is now on the right track. It's the subtle moments in \"Heavy\" that really make the film. From the airplanes soaring overhead, giving transition to new points in the lives of the characters, to the Boston Terrier noticing important details, this movie is one to sit back and ponder. The more I think about this movie, the more I like it. It's a lesson on how the quiet subtle moments in life can be the most important.",
         "Victor works as a cook in his mother's diner along with waitresses Delores and Callie. Callie is the new girl who arouses jealousy in Delores but feelings of longings in Victor. With his mother in the hospital Victor realises that his life needs more to it \u0096 but his size puts him off being forward Like the lead character this is a slow film that requires patience as everything is understated rather than shouted out. The story follows Victor as he tries to make progress from his shy, quiet life one step at a time. The eerie electronic score adds to the feeling of pace and thoughtfulness and in many ways the film backs it up. On the down side it does seem aimless at times and sometimes the plot feels like it isn't real. These are minor flaws and the director has set a good story for a good cast to carry through on. Vince is especially good as Victor. He fits the role like a glove and his moving eyes and shy gestures bring the character to life and make him totally believable. Tyler is also very good \u0096 what a shame that her most successful roles have been in MTV-type of stuff, but she is very bright here. Both Winters and Harry put in good roles but less central than the former two. Overall this is a very patient piece of work looking at the character of Victor. It may seem aimless and drifting at times but it is quite touching \u0096 mainly due to an understated performance from Vince.",
         "This is a movie that I almost didn't watch because it was to be about a fat pizza cook. After watching for thirty minutes, it was obvious that the movie was about the very sensitive feelings of someone who is over weight. The performance by Pruitt Taylor Vince was very impressive, and I felt if not winning an Academy Award, should have at least been nominated. Few actors can express as much without saying a word, as he did in this very powerful and touching movie.",
         "I feel that this is an emotional, heavy hearted and well acted, film. The story centers around an overweight, maternally dependent short order and pizza cook, at a family run bar and eats, in a small town somewhere in America. Learning about Victor as he deals with change in his reclusive, maternally dominated life, by the introduction of an outsider, portrayed by Liv Tyler, and the sudden death of his mother is what makes this film so good. It is not a dark tale, but I feel, one of sadness that is presented through a group of people who in everyone's real lives would just be passed by. The film makes you feel for this small group of people struggling to make their emotional ends meet in their everyday lives. The film is well done enough that you feel a desire to know the history of the characters but feel as what you know is enough to emphasize with these characters.",
         "Mainly watched this because Liv Tyler is one of the most beautiful women on the planet and was pleasantly surprised how good it was. Poor Victor in the pizza shop is the kind of guy an awful lot of people can relate to I'm sure. Debbie Harry puts in a good performance too. The moodiness and dark settings make the film very compelling viewing indeed. Victor's outlook on life and his consciousness of his size and looks is so believable and his daydreaming is handled so well throughout. Any self conscious person should watch this as should people who pass judgment on others on looks alone. A film hard to forget."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Available Light Productions"],
      "summaries": [
         "Victor is a cook who works in a greasy bar/restaurant owned by his mother, Dolly. It's just the two of them, a waitress named Delores, and a heavy drinking regular, Leo. But things change when Callie, a beautiful college drop-out, shows up as a new waitress and steals Victor's heart. But Victor is too shy to do anything about it, and too self-consciously overweight to dream of winning Callie away from her demanding boyfriend, Jeff. Victor's terrible loneliness overwhelms him when he has to face losing what he loves the most.",
         "The life of an overweight, unhappy cook is changed after a kind, beautiful college drop-out comes to work as a waitress at he and his mother's road-side restaurant."
      ],
      "budget": 0
   },
   "movielensId": 764,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-20",
      "dvdReleaseDate": "1999-09-21",
      "directors": ["James Mangold"],
      "runtime": 105,
      "movieId": 764,
      "title": "Heavy",
      "mpaa": "R",
      "actors": [
         "Liv Tyler",
         "Pruitt Taylor Vince",
         "Shelley Winters",
         "Deborah Harry",
         "Joe Grifasi",
         "Evan Dando",
         "David Patrick Kelly",
         "Marian Quinn",
         "Meg Hartig",
         "Zandy Hartig",
         "Peter Ortell",
         "George Alvarez",
         "Cordis Heard",
         "J.C. MacKenzie"
      ],
      "imdbMovieId": "0113280",
      "originalTitle": "Heavy",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["mx4KKlwM7c0"],
      "plotSummary": "Victor is a cook who works in a greasy bar/restaurant owned by his mother, Dolly. It's just the two of them, a waitress named Delores, and a heavy drinking regular, Leo. But things change when Callie, a beautiful college drop-out, shows up as a new waitress and steals Victor's heart. But Victor is too shy to do anything about it, and too self-consciously overweight to dream of winning Callie away.",
      "tmdbMovieId": 22621,
      "avgRating": 3.36526,
      "releaseYear": "1995",
      "numRatings": 616,
      "posterPath": "/y0yIzgFOxJMvyOOtOQfPt2Fa8xH.jpg"
   }
}