{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "age difference",
            "id": 965
         },
         {
            "name": "appearance",
            "id": 3758
         },
         {
            "name": "body exchange",
            "id": 5133
         },
         {
            "name": "genetics",
            "id": 6017
         }
      ],
      "imdb_id": "tt0116669",
      "video": false,
      "title": "Jack",
      "recommendations": [
         11597,
         9574,
         12154,
         9304,
         2928,
         9294,
         10402,
         11335,
         11846,
         10603,
         9894,
         11158,
         12139,
         10414,
         6280,
         9446,
         8989,
         4244,
         11000,
         11630
      ],
      "backdrop_path": "/2hsd6MbbhVyfjozeU9oonyyKymR.jpg",
      "revenue": 58620973,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Charles Powell",
               "gender": 2,
               "credit_id": "52fe4471c3a36847f8096541",
               "name": "Robin Williams",
               "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
               "id": 2157,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Karen Powell",
               "gender": 1,
               "credit_id": "52fe4471c3a36847f8096545",
               "name": "Diane Lane",
               "profile_path": "/81fhEMQlbhQ3mbI5ghq9RUrjkLB.jpg",
               "id": 2882,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Brian Powell",
               "gender": 2,
               "credit_id": "52fe4471c3a36847f8096549",
               "name": "Brian Kerwin",
               "profile_path": "/cC69Vc7F59RKBZUldffhWJWx57A.jpg",
               "id": 50464,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Miss Marquez",
               "gender": 1,
               "credit_id": "52fe4471c3a36847f809654d",
               "name": "Jennifer Lopez",
               "profile_path": "/yOz9MwgY9IV4kV9QdJyMCrATHCw.jpg",
               "id": 16866,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lawrence Woodruff",
               "gender": 2,
               "credit_id": "52fe4471c3a36847f8096551",
               "name": "Bill Cosby",
               "profile_path": "/74QfZIdzeCziphi251ueaCVXbW7.jpg",
               "id": 51962,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Dolores Durante",
               "gender": 1,
               "credit_id": "52fe4471c3a36847f8096573",
               "name": "Fran Drescher",
               "profile_path": "/vQxr8CRgyDkH3GTFLwacs9W9tF4.jpg",
               "id": 53122,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Louis Durante",
               "gender": 2,
               "credit_id": "52fe4471c3a36847f8096577",
               "name": "Adam Zolotin",
               "profile_path": "/tkaFxHz4rtsY7Nqd2pljwFLQIZT.jpg",
               "id": 53123,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Poppy",
               "gender": 0,
               "credit_id": "53e2f0840e0a262b8000305e",
               "name": "Irwin Corey",
               "profile_path": "/rLpmlAF4SVjjUX1mv3KIbDSV8qn.jpg",
               "id": 28035,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Phoebe",
               "gender": 1,
               "credit_id": "556d15ca925141689c0004e4",
               "name": "Jurnee Smollett",
               "profile_path": "/1d9lMxE6lqYmcgFovXo0t3QTjwO.jpg",
               "id": 59017,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Allison",
               "gender": 1,
               "credit_id": "5900d0c392514161be00d8af",
               "name": "Ashlee Lauren",
               "profile_path": null,
               "id": 1509841,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "George",
               "gender": 2,
               "credit_id": "5a6399250e0a2619f50139e3",
               "name": "Mario Yedidia",
               "profile_path": null,
               "id": 533016,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4471c3a36847f8096557",
               "name": "Francis Ford Coppola",
               "profile_path": "/vEGwqahu7UlI6OwELy92xbXk9Kd.jpg",
               "id": 1776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4471c3a36847f809655d",
               "name": "Michael Kamen",
               "profile_path": "/y83bqw1VP1PkuvOhG2XROwc9eXG.jpg",
               "id": 7714,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4471c3a36847f8096563",
               "name": "Francis Ford Coppola",
               "profile_path": "/vEGwqahu7UlI6OwELy92xbXk9Kd.jpg",
               "id": 1776,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4471c3a36847f8096569",
               "name": "James DeMonaco",
               "profile_path": null,
               "id": 53120,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4471c3a36847f809656f",
               "name": "Gary Nadeau",
               "profile_path": null,
               "id": 53121,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "5a35d3ac0e0a264cc81dc621",
               "name": "Alice Tompkins",
               "profile_path": null,
               "id": 1487530,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.3889,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 7095,
      "vote_count": 436,
      "budget": 45000000,
      "overview": "Jack Powell suffers from an affliction that makes him grow four times faster than normal, so the 10-year-old looks like a 40-year-old man. After years of being tutored at home, Jack convinces his overprotective parents to send him to public school. The children don't know what to make of Jack, but with the help of his fifth-grade teacher, he makes an effort to win them over.",
      "similar": [
         782,
         9348,
         37707,
         9738,
         329,
         284,
         17654,
         38055,
         1635,
         1927,
         14160,
         78,
         135397,
         153,
         164,
         2652,
         335984,
         258480,
         19265,
         4935
      ],
      "original_title": "Jack",
      "runtime": 113,
      "poster_path": "/nOgHa5ggt6vbmIuoNW7exrJQJq9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ueaENQkPcy8rlr5fGZVBXKOhlBh.png",
            "name": "American Zoetrope",
            "id": 70,
            "origin_country": "US"
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Great Oaks Entertainment",
            "id": 2173,
            "origin_country": ""
         }
      ],
      "release_date": "1996-08-09",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Jack Powell is about to tackle his biggest adventure ever... the fifth grade!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Francis Ford Coppola"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "James DeMonaco",
         "Gary Nadeau"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116669/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMjIzOTY2M15BMl5BanBnXkFtZTcwMzM3NTYyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Robin Williams, Diane Lane, Brian Kerwin | See full cast and crew »"],
      "reviews": [
         "Okay it's not exactly the biggest stretch of casting to have Robin Williams playing a ten year old in the body of an adult. However, Jack is a pretty decent and funny movie. Jack Powell is born and he ages at four times the normal rate. For the first ten years of his life he is tutored at home and sheltered by his parents. Bill Cosby plays his tutor Mr. Woodruff. Diane Lane and Brian Kerwin play his parents who are reluctant to send Jack to public school because they fear the other children's reactions to him. When he does go to school, his teacher, played by Jennifer Lopez, welcomes him with open arms while, predictably the kids are both awed and afraid, and teasing soon follows. Jack gains acceptance when the boys realize that he is a natural for basketball, and he soon is running with a whole group of new friends. The rest of the movie is basically about Jack and how his body is just naturally slowing down, leading to his withdrawal from school, his eventual return, and the epilogue at his high school graduation. Jack was a pretty charming film and I liked the way that Robin Williams acted in his scenes with Diane Lane as the 10 year old with a strong bond with his mother, and her feelings of longing when he shows that he is pulling away when he gains friends his own physical age.",
         "This movie has something very important attached to it: a message of life. This is due to the underlying themes as well as to Robin Williams' touching performance which is saddening and inspirational at the same time. He is able to transform the sheer hopelessness of his fate which subjects him to an early death with such outstanding and sincere skills that are deeply moving. Apart from that his entire character - as it is designed - demands substantial acting throughout the whole plot. He delivers a performance that many other actors would simply not have been able to accomplish. It takes a special kind of actor to portray such a character just as Jack here. The message is that despite a fate that destines us to be exposed to tremendous agonies and blank despair, there is always a light of hope, and this light burns in our hearts. It's up to us only what we do with the time that we're granted with. In Jack's case time is even more precious than for normal people. Despite the sadness and despair that is ultimately caused thereby, we still have the chance to make the best out of every minute. All we have to do is value the little things, such as friendship and love, and thus escape the shades of darkness. The movie itself is funny and sincere, it has important dialogues and, as stated above, a real massage, which makes it special. Watch out for it.",
         "When you see a shooting star... Robin Williams makes a really great acting as a 10 year old boy!, it's amazing how he can represent the feelings of a boy of this age!; the only role almost similar that i saw was Tom Hanks in Big (1988); but Tom act as a totally shy boy; Williams combines here innocence with happiness and a funny life!. The message of the movie is touching and with a beautiful message! In this touching and really good story you will surely have an important message for life: live everyday as it was your last, and always maintain that child that you'll always have inside you (as Mr. Woodruff). The role of Fran Drescher as Miss Dolores is also great too! ABOUT THE MOVIE: Robin Williams plays here Jack Powell, a child who has a medical disorder that makes him grow four times faster than any other boy, because of this, he, at the age of 10 looks like a man of 40 years, only that his brain and behavior maintains like the child he really is. Only this makes this role a total challenge for any actor. Jack's fathers (Diane Lane as Karen and Brian Kerwin as Brian) don't put him on a regular school afraid of what his classmates or other people will say; but at the age of 10, and after an excellent and touchable education of Mr. Woodruff (Bill Cosby), they decide to put him on a normal school where he finds difficulties but also great friends, specially Louis and Eddie (Adam Zolotin and Todd Bosley), he finds also an amazing teacher, Miss Marquez (Jennifer Lopez). Good movie,..Worth to watch 8/10",
         "I'm sorry, but just having read a few of the comments on here I am absolutely astounded! The problem is that what people seem to be doing here is reviewing the film as one whole pot, where as that is not how it works. I film has so many layers that it is impossible to tell how great it is without reviewing them all. Everyone seems to look at the plot and disregard it straight away when the acting in it is so unbelievable. Robin Williams may well be a very childish man but this went so beyond anything that can even come close to a normal personality, he is completely convincing 100% of the time, at no point in the movie do you ever doubt his being only 10 years old. This film may have a strange plot and weirdly written but the acting is phenomenal and William's is, of course, the star in the show. I actually feel very sorry for the actors around him in this, how can they possibly shine when with him and they were all great as well so that just heightens Williams' ability. This is a fantastic film simply because of Robin Williams!",
         "A curiosity coming from Francis Ford Coppola (who also co-produced for Zoetrope) has pregnant Diane Lane going into labor after only two months, delivering a healthy-seeming baby boy (when she pleads to her husband in the delivery room, \"It's too soon!\", it's rather an understatement). Doctors have never seen another child like this, yet quickly determine the boy has an internal clock which is ahead of itself by four times the average rate, meaning that when Jack is ten-years old he'll look like a man of forty. This peculiar movie gimmick aside, what we really have here is Robin Williams back in grade school. Although this may sound perfectly inexcusable, not to mention somewhat derivative, it isn't a silly movie (at least, not at its core) and has good acting. Williams manages to hold back a bit from his usual barrage of vocal effects and facial expressions, and a few of his scenes are peddled quite softly (as they were in \"Awakenings\"). Also quite fine are Bill Cosby as Jack's initial tutor and Jennifer Lopez as his schoolteacher. The little boys are way over-the-top, and some of their gross-out talk is just stupid (they hole up in a tree house, equipped with TV, looking at nudie magazines--probably an attempt to mirror grown-ups but it plays sour). Oddly, Coppola can't stop himself from ultimately tugging at the old heartstrings, and not just once but for an entire sequence and an epilogue! I could have done without the \"seven years later\" bit, but for the most part this is a warm family comedy with a bigger heart than it knows what to do with. ** from ****",
         "Robin Williams is great as a ten year old, who looks like 40. When he plays with his mother (Diane Lane), explores the world or has a rendez-vous with the mother of his best friend - that is more than well-played. Williams as Jack: his best role after playing Adrian Cronauer in \"Good Morning,Vietnam\".Supported by the lovely, warm performances of Jennifer Lopez and Bill Cosby, Williams makes \"Jack\" a wonder. You can either love or hate this movie, depending on your RQ (=Romance quotient).",
         "Many reviewers have compared this work to Tom Hanks's Big, wherein a young boy wishes he were \"big,\" and the wish is granted. However, this work is the anti-thesis of that work, as an adult portrays a young child, physically, which thrusts Jack into the same venue as Martin Short's \"Clifford,\" which was done some two years prior to this work. That not withstanding, Clifford was a holy terror, while Jack is a mother's dream. While both works require a total suspension of belief in order to enjoy them, Jack is endearing, sweet, sentimental, and entertaining. There is nothing endearing, sweet, or sentimental about Clifford. Jack is born with a genetic disorder which causes him to age 4 years for every 10, thereby causing him to appear as a 40 year old man at the age of 10. Many have bludgeoned Coppola's involvement in such a scheme, citing his prior \"masterpiece\" works while bemoaning this one. The fans seem to forget that artistic people who do not spread their wings, and plant their feet on strange ground, never grow as individuals and artists. Some found this work \"insulting\" due to the premise. It is called unintelligent. But not all films are based on intellect, and not all movie-goers care to have to think in order to enjoy a movie. And there is the added benefit of the heartwarming sentiment carried by this work. It did well in the box office, nearly doubling its budget, worldwide, and is generally under-rated here at IMDb (if only mildly so), which says that word of mouth (that this film wasn't as bad as the critics said) carried this film further than the negative reviews would have liked. It rates a 6.2/10 from... the Fiend :.",
         "There was aomething a bit off about this film, but I, for some reason still liked it.I think it has many possible meanins depending on how you look at the story, I remebered seeing it when I was quite young... I thought that Jacks parents would have to see their child die and that was sad. I saw it when I was older and thought maybe it was about not taking life for granted and living life to its fullest, but that still didn't really seem quite right...And then I thought maybe it is about always being a kid even when your an adult, but that makes absolutely no sense with the story.......... and maybe I was right when I was a younger and I thought that it was about loosing a child... not only to death but to friends.... perhaps the aging thing was added to show a different form of somebody being picked on, as Jack was in the movie, even if they may look tougher. I thought the relationship between jack and His mother was brillant, I really felt that, however I thought parts of the story digressed whoch gave the story multiple meanings....which is interesting to ponder, but in some cases makes the story jump around to much, adn I am the kind of person who likes movies to jump around a bit if you can not tell y my writting style.... I loved the chracters though... please forgive me for my randomness and at the moment tired-ness....overall, it was thought provoking, sweet,and just a little bit off....",
         "\"Jack\" is a silly, genial and charming story about a \"little\" boy who ages four times faster than he should. It's a tragedy disguised as comedy. It has some comic elements but who couldn't admit the basic idea is rather sad. \"Jack\" is the kind of a film you least expect from the man who directed violent crime, war and horror masterpieces \"The Godfather\" -trilogy, \"Apocalypse Now\" and \"Dracula\". Nevertheless it's one of the most personal projects of Francis Ford Coppola since his own son died at an early age. Even though this is not a classic Coppola movie it's definitely classic role from Robin Williams. It's hard to think of another actor to play the part of a ten year old boy who looks like a man of middle age. Williams really relieved the child inside of him. Bill Cosby is also splendid as Jack's sympathetic teacher Woodruff. For the sake of comparison I might mention that Penny Marshall's \"Big\" starring Tom Hanks is an outstanding, heart-warming classic and I've seen it many, many, many times but it's hard to get tired of a movie that's simply so enjoyable and entertaining. \"Jack\" is watchable once or probably even twice but unfortunately it doesn't come even close to \"Big's\" glamour. \"Jack\" has a good idea and yet another excellent performance from Williams but it's a movie that just might have been even better.",
         "This could have been an absolutely wonderful film, but due to a one big criticism it remains a nice film, in all the bog-standard sense of the word. Robin Williams plays the part of a 10-year old trapped in a 40-year old's body, but the big problem is that we can't help but see Robin Williams himself. Anyone that has seen his stand-up comedy will know that Williams is exactly that (10 years old trapped in a body 30 years senior). Whilst his performance would have been quite believable, the film would have worked much better with a lesser-known actor (even one not known for comedy) in the role. I still cannot believe that the great FFC directed this film - it defies all movie sense. However he has done a fine job, and the cast work well together. Miss Lopez makes a very appealing schoolteacher (only in Hollywood!!), and the child actors work hard. Good fun, but you may find yourself frustrated."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "American Zoetrope",
         "Great Oaks",
         "Hollywood Pictures"
      ],
      "summaries": [
         "The movie is about a boy with a unique aging disorder: one that makes him age 4 times faster than normal. It picks up when Jack (Robin Williams) is 10 years old, but looks 40. He tries to go to public school for the first time, and to become friends with kids his own age. His physical appearance causes him lots of problems, however.",
         "Because of an unusual aging disorder that has aged him four times faster than a normal human being, a boy enters the fifth grade for the first time with the appearance of a 40 year old man."
      ],
      "budget": 45000000
   },
   "movielensId": 765,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-09",
      "dvdReleaseDate": "2004-08-03",
      "directors": ["Francis Ford Coppola"],
      "runtime": 113,
      "movieId": 765,
      "title": "Jack",
      "mpaa": "PG-13",
      "actors": [
         "Robin Williams",
         "Diane Lane",
         "Brian Kerwin",
         "Jennifer Lopez",
         "Bill Cosby",
         "Fran Drescher",
         "Adam Zolotin",
         "Irwin Corey",
         "Jurnee Smollett",
         "Ashlee Lauren",
         "Mario Yedidia"
      ],
      "imdbMovieId": "0116669",
      "originalTitle": "Jack",
      "genres": [
         "Comedy",
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["iHaFdSx26WM"],
      "plotSummary": "Jack Powell suffers from an affliction that makes him grow four times faster than normal, so the 10-year-old looks like a 40-year-old man. After years of being tutored at home, Jack convinces his overprotective parents to send him to public school. The children don't know what to make of Jack, but with the help of his fifth-grade teacher, he makes an effort to win them over.",
      "tmdbMovieId": 7095,
      "avgRating": 3.05498,
      "releaseYear": "1996",
      "numRatings": 5966,
      "posterPath": "/nOgHa5ggt6vbmIuoNW7exrJQJq9.jpg"
   }
}