{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113973",
      "video": false,
      "title": "Nico Icon",
      "recommendations": [],
      "backdrop_path": "/71MweF7afO241k7CCpeSDPh3noZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Herself",
               "gender": 1,
               "credit_id": "59d54df4c3a36845610206b5",
               "name": "Nico",
               "profile_path": "/aedJ0lIZWao7k8OnnReaCk4MYey.jpg",
               "id": 938895,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Herself",
               "gender": 1,
               "credit_id": "59791479c3a3686831002638",
               "name": "Tina Aumont",
               "profile_path": "/s1QuuoZyCUA5fQ7xlSxfud5Fw6o.jpg",
               "id": 109142,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "597914a6c3a3686831002668",
               "name": "Jackson Browne",
               "profile_path": "/4KFoYmDc8jwyS8hwZ8yryFBEEUB.jpg",
               "id": 14397,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "597914b0925141080400268f",
               "name": "John Cale",
               "profile_path": "/jtzO8cnQhseN7Ww0f60D1X4hv0j.jpg",
               "id": 7491,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "597914c1c3a368684b002815",
               "name": "Paul Morrissey",
               "profile_path": "/bv4aWgFTm8lSn5Gb0W5QorhpyxF.jpg",
               "id": 18627,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Herself",
               "gender": 1,
               "credit_id": "597914d192514107c8002b97",
               "name": "Viva",
               "profile_path": "/igiVyQgvSDPI89tAFpmivVsiZ7y.jpg",
               "id": 54754,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "59791490c3a3686868002570",
               "name": "Ari Boulogne",
               "profile_path": null,
               "id": 1078926,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ab0c3a368484e161cd5",
               "name": "Susanne Ofteringer",
               "profile_path": null,
               "id": 1080309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "597915019251410810002870",
               "name": "Judith Kaufmann",
               "profile_path": null,
               "id": 24076,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59791514925141081c0028d5",
               "name": "Katarzyna Remin",
               "profile_path": null,
               "id": 1858636,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59791523c3a368683e0025d6",
               "name": "Sibylle Stürmer",
               "profile_path": null,
               "id": 1858637,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59791568c3a368685a002be9",
               "name": "Elfe Brandenburger",
               "profile_path": null,
               "id": 1858638,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5979157cc3a368683100272b",
               "name": "Guido Krajewski",
               "profile_path": null,
               "id": 1858640,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.661109,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 124626,
      "vote_count": 4,
      "budget": 0,
      "overview": "A look into the many lives of Christa Päffgen, otherwise known as Nico; from cutie German mädchen to the first of the supermodels, to glamorous diva of the Velvet Underground, to cult item, junkie and hag. Many faces for the same woman, whom, you realize, just couldn't bring herself to care enough to live.",
      "similar": [],
      "original_title": "Nico Icon",
      "runtime": 70,
      "poster_path": "/tuIDKBp92R4tGFOB46MofvakfiY.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zweites Deutsches Fernsehen (ZDF)",
            "id": 4606,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bluehorse Films",
            "id": 93174,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ciak Filmproduktion",
            "id": 83201,
            "origin_country": ""
         }
      ],
      "release_date": "1995-02-18",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Susanne Ofteringer"],
      "runtime": 70,
      "synopsis": null,
      "writers": ["Susanne Ofteringer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113973/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTY2MDM2NzcyM15BMl5BanBnXkFtZTcwMjk3MzcyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Nico, Tina Aumont, Ari Boulogne | See full cast and crew »"],
      "reviews": [
         "A fascinating look at a sad & mysterious woman whose music was a deep, dark gaze into the pit of existence. If you have never heard Nico, then by all means, you must see this film. Fans will love it regardless, but the uninitiated have the most to gain. The facts of her life are chronicled, but numerous attempts by friends & acquaintances to describe who Nico was are fruitless. One realizes by the end of the film that Nico was so elusive, much like her music, that attempts to describe who she was tend to reveal more about the speaker, than they do about Nico. Someone says that Nico, who had been a model first, always hated being complimented on her beauty. The speaker suggests that it must have been some German perversity. He then explains how she proceeded to continually attempt to make herself ugly. Another person says \"No one loved Nico & Nico loved no one\" - a haunting statement that points to the isolation that Nico experienced. When she was beautiful, she was adored, so she destroyed heself & watched (& cried beautiful melodies) as everyone in her life capitulated. One of the finest scenes in the film finds Nico's Aunt looking over pictures & press clippings of the girl she helped raise. She speaks of Nico in adoring terms, referring to her as a princess. We then see her listening to Nico & The Velvets, gazing into the sky, lightly singing along, then shedding tears. It is a striking scene, as a tight & proper, matronly German figure crosses the boundary to an underground youth culture, that is so divorced from her world, yet bridged by her love for Nico. A great documentary of a performer who was well ahead of her time.",
         "This documentary is worth watching if you're interested in Nico or related subjects (my interest in the Velvet Underground is what got me to watch it, and VU are so important to modern music history that it's worth watching just for that), but it is seriously lacking in several respects. First of all, the movie is only 67 minutes long and ends too abruptly. Another half-hour of more extensive interviews would have greatly strengthened the film. Maybe people like Lou Reed or the surviving members of The Doors simply refused to take part in the movie, but the absence of their opinions leaves definite holes in the story. In the film's defense, maybe there's just not much elaboration anyone can give about Nico--she was pretty, had a striking voice, and was a depressive junkie; that about sums up the impression I'm left with (which probably isn't all the film's fault!). But couldn't they have at least given us Lou Reed's take on Nico, even if it was only via anecdotes shared by others? The creation of her solo songs & albums is very glossed-over. Suddenly Andy Warhol's crew is talking about hearing a single of Nico's--the viewer is left to wonder, \"Well, when & how did that recording come about?!\" We are shown pictures of her solo albums while clips of her songs are played, but that's about it--no real discussion of the circumstances surrounding the writing, recording, promotion, dates of release, etc. It's left unclear how much of the actual CREATION of those songs was done by Nico herself--did she learn to play any instruments, did she direct other music writers to produce what she was envisioning? Maybe these things were addressed and I simply missed them, but if so, it was a sentence or two at most, which might have been inaudible-- --which leads us into the problem of the poor sound quality; the music sometimes drowns out the poorly recorded interviews, so that when the interviewees lapse into softer voices, mutters & mumbles (their various accents add to this problem), it can be very hard to understand what is being said. Also annoying is the cheesy method of occasionally superimposing words on the screen as they are spoken by interviewees or sung by the soundtrack. This technique feels cheap and superficial--like a commercial trying to convince us that what is being said is important or deep. Overall, it's definitely worth seeing if you like documentaries & music/pop history, but not a great documentary by any means. I'm almost tempted to go back and change my vote to 6, but I think I'll leave it at 7 because I did enjoy watching it. Worth renting, but not worth owning.",
         "Spoilers herein. No one who survived that period can forget Nico, at least her voice in the midst of sounds that have come to define what heroin sounds like. She wasn't the only pretty face we saw get ravaged. But this was the only soul I know that did so as a deliberate act of art. At least the aura of Warhol claimed it such. Was she a real musician? It doesn't matter to me, even if there were such a thing. She became part of my dream life, so is at least worth a revisit or two. I waited to see this until I could see it with `Joni Mitchell: Woman of Heart and Mind,' an equally insipid portrait, but of quite a different musician. Both Joni and Nico were pretty blond singers, from the same era. Both had kids they had to give up. Both had lives with drugs and fellow male musicians. In fact, both were in New York at the same time. Each had their own demons. But what different music! I'm not sure which was the greater artist: one gave her life to music while it was the inverse otherwise. Does passion matter! Was Jim Morrison a waste or a successful ride on an angry beast? You won't get any of this from the dreary documentary alone. But if you were at all alive then, this effectively reminds. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "This is one of the best documentaries I've seen so far. The weird but mesmerizing horror & occasional beauty of Nico's life & music are extremely well evoked. The most impressive scenes are the interviews with Alain Delon's mother Edith Boulogne -- who died soon after the movie was finished -- who had taken care of Alain's & Nico's son Ari, and, finally, John Cale performing \"Frozen Warnings\" alone on the piano. Susanne Ofteringer's film includes interview footage with James Young, the former keyboarder of her band, who has himself written a book about his time with Nico & the band. Only Alain Delon is missing ... No matter if you know or like Nico's definitely genuine, but strange approach to music, the movie is worthwhile watching for its documentary qualities.",
         "i can see how anyone who doesn't already enjoy nico wouldn't enjoy this film, but i thought it was great. i was first introduced to nico via her work with the velvet underground, and while nico herself isn't a very sympathetic \"character\" her life was extraordinarily interesting. i didn't think the filmmaker tried to her make her more lovable than she was, but instead tried to portray her as she was; interesting as well as cold, shallow but artistic. what made her unique and fascinating also made her a poor mother and an isolated individual, but her voice was different as was what she had to say. if you have an interest in her music and her work with andy warhol's factory, then i think this is a movie you'll enjoy.",
         "this film is truly anything but a real documentary. How anyone could take as interesting a subject as Nico and so incomprehensively make a film that purports to go inside her life is beyond me? It seems like this film was thrown together at best. I had no understanding of the real chronology of Nico's life, as the timeline jumps around repeatedly. The interviews seem largely to rely on one interview with John Cale, and it's just quite clear that the filmmakers didn't do any research whatsoever. Instead the filmmaker's come up with the dull technique of using superimposed titles throughout the film to highlight the un-insightful interviews. So superficial, so dull-looking, so without any kind of understanding of what must go into a posthumous documentary that it is really sad. A wasted opportunity. Shooting photographs for an hour or so and playing the Velvet Underground and Nico album over it is hardly the stuff of insightful or talented documentaries.",
         "As a big time nico-fan who has spent an unreasonable amount of money on all sorts of semi- and unofficial stuff of her, I must say that, when I came out of the movie theatre, I had quite a good feeling about this docu. Some call it a lie, but then again, wasn't Nico one of the first to invent/reinvent any part of her life as she saw fit? To add some drama? This piece of docu is pretty nice to look at, and, despite being not entirely chronological, forms a whole to me. This said, it is indeed true that it is not that representative, and that the \"whole\" it constructs might not exactly be Nico. But still. Indeed, there is a lot of focus on negative aspects of her life, but then again, you can hardly find a career of 6 studio albums and some unfinished material for a potential new one in the span of 20 years prolific, can you? And it is a fact that, while before she got hooked on H she recorded 3 albums in 3 years (two of which were astonishing pieces of unheard of music that she wrote entirely by herself), once she got addicted her creativity went downhill, if not as much in quality than in quantity. The touring became a way of bringing home the bacon, while performing the same songs over and over again. In an impressive way, alright, but still the same. Frequent touring is no substitute for creativity. Look at what John Cale has been doing for the last 15 years. He has accomplished some impressive creative feats, true, but a lot of his stuff is soundtrack-muzak and the shows are copies of his first solo shows in the early 80's. But back to the documentary. Indeed, more unique footage would have been welcome and the complete omission of Drama of Exile is unforgivable. Furthermore, this story would have clearly illustrated how deep downhill it had gone, since Nico sold the incomplete master tapes because she needed the money (guess what for) - and they recorded a second version. But still, it's negative. With the Lutz Ulbrich-interview you get the impression that they leave a lot out of the picture and instead focus on the point where Ulbrich says he can't understand how a mother could introduce her own son to the needle (true...). What about Ulbrich's involvement in her last show (on cd as Fata Morgana), for which she seemed to have taken a new start, with wonderful new material! What's more important, it does not, apart from a few things, shed any light on the why and how of Nico's oeuvre. And this may indeed be a very difficult task, mainly because Nico was not exactly an art-explainer, which is good. That's why one might say that this documentary, as a provider of information on Nico, falls short. The beauty was in the music, and it was and is exactly its force that it needs no further explanation. Furthermore, the docu will leave fans unsatisfied and will not gain Nico a new audience, for with her music it's simple: you love it or you hate it to bits. And anyone open to its unworldly beauty will inevitably find it, documentary or not. The others will keep away, and this docu will not change their minds. But, after all, it's nice that at least a documentary is made on her. It would be greater still if in some future, the excellent interviews would be used by someone else to make a real, full documentary, with a focus on the work and its evolution, and not on her personality problems, for though they were part of the process, they were no part of the results.",
         "Nico made many great albums like \"marble index\", \"desert shore\" or \"the end\". She might have been the best female pop artist of the 70s. Her records were quite original and they are still very important. This movie just tell us about the very sad story of her life. There must be less than ten minutes of Nico singing. This film really missed the point. It's just a form of \"dark\" glamour, quite pointless to me.",
         "\"Nico Icon\" is a movie which will not satisfy Nico's fans cause the essential,that is to say,the musical side ,is minimal .Both her short stint with the Velvet and her solo career are botched. On the other hand,we hear Edith Boulogne, actor Alain Delon's mother talk for a long time of her grandson Ari -who appears himself too- .There was a world between Nico, an avant-garde artist and a simple woman such as Mrs Boulogne who complains \"cause she was always feeding him with crisps \".The boy seems to despise his grandma who raised him though. In his biography of Delon (2000),(I do not know if the book has been translated into English) Bernard Violet devoted the end of a chapter to Nico's son: \"Le cas \"Ari Boulogne\" \".",
         "As a big fan of this Artist I was very interested what this documentation will tell me about her. I didn't tell much. If you don't know anything about her before you see this film, you will get no real info at all about her and a distorted impression about her. The interviews are nice, but are missing background info. I only detested James Young who calls her a \"failure\". Much time is wasted which odd images which texts from her songs over them. Why is the music video for \"Evening of light\" or \"I'm not saying\" not played in full length? For a real fan this would be very interesting. This docu also has no real chronological order, but just jumbles around with no connection. Important facts (especially about her death, her last concert, her last movie, her music, her albums) aren't told. Important people don't show up in this movie, like Antoine Giacomoni. Why is Nicos album \"Drama of Exile\" totally ignored in this Docu. What about her alleged Mafia connections? etc etc etc. Sure, the cuts from interviews with her are very interesting, but this docu is still very sloppy."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Music"
      ],
      "productionCompanies": [
         "Bluehorse Films",
         "CIAK Filmproduktion",
         "Zweites Deutsches Fernsehen (ZDF)"
      ],
      "summaries": ["A look into the many lives of Christa Päffgen, otherwise known as Nico; from cutie German mädchen to the first of the supermodels, to glamorous diva of the Velvet Underground, to cult item, junkie and hag. Many faces for the same woman, whom, you realize, just couldn't bring herself to care enough to live."],
      "budget": 0
   },
   "movielensId": 77,
   "movielens": {
      "languages": [
         "Deutsch",
         "English"
      ],
      "releaseDate": "1995-02-18",
      "dvdReleaseDate": "1998-01-14",
      "directors": ["Susanne Ofteringer"],
      "runtime": 70,
      "movieId": 77,
      "title": "Nico Icon",
      "mpaa": null,
      "actors": [
         "Nico",
         "Tina Aumont",
         "Jackson Browne",
         "John Cale",
         "Paul Morrissey",
         "Viva",
         "Ari Boulogne"
      ],
      "imdbMovieId": "0113973",
      "originalTitle": "Nico Icon",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A look into the many lives of Christa Päffgen, otherwise known as Nico; from cutie German mädchen to the first of the supermodels, to glamorous diva of the Velvet Underground, to cult item, junkie and hag. Many faces for the same woman, whom, you realize, just couldn't bring herself to care enough to live.",
      "tmdbMovieId": 124626,
      "avgRating": 3.4386,
      "releaseYear": "1995",
      "numRatings": 228,
      "posterPath": "/tuIDKBp92R4tGFOB46MofvakfiY.jpg"
   }
}