{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jurors",
            "id": 1417
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "court case",
            "id": 3012
         },
         {
            "name": "son",
            "id": 5153
         },
         {
            "name": "trial",
            "id": 11038
         },
         {
            "name": "courtroom",
            "id": 33519
         }
      ],
      "imdb_id": "tt0116731",
      "video": false,
      "title": "The Juror",
      "recommendations": [
         12280,
         11384,
         9440,
         12618,
         12518,
         8984,
         9415,
         9879,
         65137,
         2246,
         48781,
         10859,
         4478,
         7007,
         11853,
         2275,
         9605,
         11630,
         2087,
         9625
      ],
      "backdrop_path": "/mayJ8p4l6WNWJ2p6GfN82eP2Gp0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Annie Laird",
               "gender": 1,
               "credit_id": "52fe4512c3a36847f80badfd",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Teacher",
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae01",
               "name": "Alec Baldwin",
               "profile_path": "/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg",
               "id": 7447,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Oliver Laird",
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae05",
               "name": "Joseph Gordon-Levitt",
               "profile_path": "/zSuXCR6xCKIgo0gWLdp8moMlH3I.jpg",
               "id": 24045,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Juliet",
               "gender": 1,
               "credit_id": "52fe4512c3a36847f80bae09",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae0d",
               "name": "James Gandolfini",
               "profile_path": "/19r3knxqTAPUgfItOPXg3ouOcpI.jpg",
               "id": 4691,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Tallow",
               "gender": 1,
               "credit_id": "52fe4513c3a36847f80bae47",
               "name": "Lindsay Crouse",
               "profile_path": "/mAZTWVbtfmC0R4R6TZ3rjhJSW0b.jpg",
               "id": 32225,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Louie Boffano",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae4b",
               "name": "Tony Lo Bianco",
               "profile_path": "/juGwBRuoP25CN8fvVqTitbLsF3w.jpg",
               "id": 15183,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Judge Weitzel",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae4f",
               "name": "Michael Constantine",
               "profile_path": "/fZXfSyDEeIWzGudVhgwG3f9HTl0.jpg",
               "id": 14884,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Boone",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae53",
               "name": "Matt Craven",
               "profile_path": "/atUkssC0DowpBbFvsnRf92cEf9y.jpg",
               "id": 13525,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Bozeman",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae57",
               "name": "Todd Susman",
               "profile_path": "/jG5wIJ2pERfYhOuZ12H6pASglSk.jpg",
               "id": 148635,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Joseph Boffano",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae5b",
               "name": "Michael Rispoli",
               "profile_path": "/mRS7DAXhuLu8Z7PAlicm6kP0EZz.jpg",
               "id": 18313,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Inez",
               "gender": 0,
               "credit_id": "52fe4513c3a36847f80bae5f",
               "name": "Julie Halston",
               "profile_path": "/uIRC2QqBCKwHVCcXl564a4FYPRe.jpg",
               "id": 57552,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "DeCicco",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae63",
               "name": "Frank Adonis",
               "profile_path": "/gvFFIid37pDICRPlEFYOQdH9mWc.jpg",
               "id": 4692,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Rodney",
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae67",
               "name": "Matthew Cowles",
               "profile_path": "/g1YnlLnDoR8Hy4XV51ZqgOXnQEE.jpg",
               "id": 94434,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Forewoman",
               "gender": 0,
               "credit_id": "52fe4513c3a36847f80bae6b",
               "name": "Polly Adams",
               "profile_path": "/gCOMppcfjT2o3efRNylXnUMFtLM.jpg",
               "id": 47538,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae13",
               "name": "Brian Gibson",
               "profile_path": "/jjc2ARxLzv3El2tHeEUKC89vPtW.jpg",
               "id": 18069,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae19",
               "name": "George Dawes Green",
               "profile_path": null,
               "id": 58203,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae1f",
               "name": "Ted Tally",
               "profile_path": null,
               "id": 57862,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae25",
               "name": "Rob Cowan",
               "profile_path": null,
               "id": 18330,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae2b",
               "name": "Irwin Winkler",
               "profile_path": "/chJjLXD7PlFhuyeverNCgemIAAC.jpg",
               "id": 11472,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae31",
               "name": "Patrick McCormick",
               "profile_path": null,
               "id": 57465,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4512c3a36847f80bae37",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4513c3a36847f80bae3d",
               "name": "Jamie Anderson",
               "profile_path": null,
               "id": 13622,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a36847f80bae43",
               "name": "Robert M. Reitano",
               "profile_path": null,
               "id": 12926,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4513c3a36847f80bae71",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.458813,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9623,
      "vote_count": 117,
      "budget": 44000000,
      "overview": "With his gangster boss on trial for murder, a mob thug known as \"the Teacher\" tells Annie Laird she must talk her fellow jurors into a not-guilty verdict, implying that he'll kill her son Oliver if she fails. She manages to do this, but, when it becomes clear that the mobsters might want to silence her for good, she sends Oliver abroad and tries to gather evidence of the plot against her, setting up a final showdown.",
      "similar": [
         1645,
         389,
         37257,
         11560,
         11975,
         9800,
         12219,
         4771,
         1592,
         9798,
         320,
         819,
         595,
         396371,
         314365,
         336843,
         3597,
         93,
         392982,
         445954
      ],
      "original_title": "The Juror",
      "runtime": 118,
      "poster_path": "/7aXOB0DyZPxNOYbaQ2oiNn64jm3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1996-02-02",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "There is no defense.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brian Gibson"],
      "runtime": 118,
      "synopsis": "Annie Laird (Demi Moore) is a sculptor who lives in New York with her son Oliver (Joseph Gordon-Levitt). Annie works as a data entry clerk. Oliver has a crush on Annie's friend Juliet (Anne Heche), who has a son named Jesse (Brett Barsky). Annie is selected to be a juror in the trial of mob boss Louie Boffano (Tony Lo Bianco), who is accused of ordering the murders of Salvatore Riggio. Annie meets a man named Mark Cordell (Alec Baldwin). He buys some of Annie's artwork, then wines and dines her before Annie discovers that Mark is better known as \"The Teacher.\" He is Boffano's enforcer, and the material perpetrator of the hit job for which Boffano is being prosecuted. Mark tells Annie to convince the jury to acquit Boffano, or Oliver, Juliet, and Jesse will all die. An extremely frightened Annie does convince the jury to acquit Boffano. After the trial, Boffano wonders if maybe Annie should disappear, because Boffano sees Annie as a loose end. Mark has a problem with this because he has developed feelings for Annie. In order to exert further pressure on Annie, Mark goes after Juliet, who has been his lover. After the two have sex, Mark reveals himself to Juliet as being Annie's stalker. He pulls a gun and forces Juliet to take a fatal drug overdose. Mark boasts of Juliet's murder to his partner Eddie (James Gandolfini). Annie hides Oliver in T'ui Cuch, Guatemala with her friend Boone (Matt Craven). At the same time, the district attorney wants Annie to turn state's witness so they can go after Mark, who now plans to take over Boffano's empire. When the DA's office has her wear a wire, Annie removes it and gives it to Eddie, instructing him to leave her and Mark alone. Annie then succeeds in getting Mark to incriminate himself in a boastful rant on his ambitions, which were recorded on a hidden tape recorder. She then uses the tape to tip off Boffano to Mark's plans. Boffano schedules a meeting to \"deal\" with Mark. Eddie arranges the meeting, but Mark kills both Boffano and Boffano's son Joseph (Michael Rispoli), along with their henchmen. He also slashes Eddie's throat. Mark is furious at Annie for setting him up. He calls her, revealing his knowledge of Oliver's whereabouts and his intention to travel to Guatemala to kill Oliver. In Guatemala there is a showdown when Mark arrives. After Mark chases Oliver into a structure, natives shoot Mark. Annie, who has a pistol, fires eight more shots, killing Mark, and ensuring Oliver's safety. (Source: Wikipedia)",
      "writers": [
         "George Dawes Green",
         "Ted Tally"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116731/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgwOTc5MjYzNl5BMl5BanBnXkFtZTcwMjYzMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Demi Moore, Alec Baldwin, Joseph Gordon-Levitt | See full cast and crew »"],
      "reviews": [
         "I thoroughly enjoyed this movie and am at a total loss as to why it scored such a low vote. I guess these days a movie just can't be a big hit unless it has lots of fancy special effects and sex scenes. 'The Juror' has a strong, easy to follow plot and some really great acting; Alec Baldwin's role was terrifyingly real! I'm no fan of Demi Moore, but she played her part very well. And the kid that played her son was equally great -- I remember him from the TV series 'Third Rock from the Sun' and always liked him. To anyone thinking of renting this flick, I say pay no attention to the naysayers and go for it!",
         "Alec Baldwin comes on quoting from the Tao Te Ching, making me think he's my kind of anti hero. He's urban, sophisticated and seemingly very safe since he's an art curator, or seems to be. Demi Moore as Annie Laird, a gifted and original sculptor (she sculpts works of art that you feel with your hands by reaching up into them: it's all tactile), is thrilled when he offers to buy her work and sell it to the Japanese. Wow. She has arrived as an artist. Thus we have an intriguing and original premise for a thriller. One almost wishes that there weren't this little matter of her agreeing to serve on the jury in the case of a Mafia boss on trial for murder.. I will gloss over the excellent, if unlikely, plot since it would be preemptive to reveal any of it, and concentrate on Demi Moore who is gorgeous, strange and riveting. It might seem impossible to give an 'heroic' performance in a thriller, since the point of a thriller is pure entertainment, but this movie manages to look into the nature of good and evil a bit more than most, and Moore plays her part like our dream of a true heroine. Her character has strength and cunning; she's sharp without pretension. I always thought Moore was better than her reputation, but somehow she always seemed a little on the not entirely bright side, the kind of actress who would never presume to play Shakespeare. But now I think she's a 'natural,' like a gifted athlete-I'd almost say an 'animal'-as an actress, which is probably why some people don't like her. She can project the beautiful woman, an ordinary woman, or herself as a matronly woman with just a turn of her head. She can display a wide range of emotions and be, by turns, both a masculine and a feminine entity; but she is not androgynous. The role she plays here is, in a sense, the feminine counterpart of many Harrison Ford roles, the ordinary person elevated to heroic action by compelling circumstances. I would not say that Demi Moore is a great actress, but she is close, and I could be wrong. Alec Baldwin combines megalomania with a seductive cynicism. He fills the screen with his presence like something you can't get rid of. He is so compelling you want to push him away or just give up. And he is charming-evil, but charming. Brian Gibson's direction is unobtrusive and clever, and he pays attention to detail. The script is relatively free of the implausibilities that usually mar the genre, and the editing is crisp without jarring. The story practically transcends the genre by making us feel the evil of violent crime and how it perverts society, the sort of revelation not usually attempted in a thriller. I was especially delighted to see the Mafia demeaned and defeated, even if it's only by a new breed of international criminal. This is a superior thriller. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "When Annie Laird is selected as a juror in a big Mafia trial, she is forced by someone known as \"The Teacher\" to persuade the other jurors to vote \"not guilty\". He threatens to kill her son if she doesn't commit. When the trial is over, he can't let her go... There are two big problems with this movie, they should have trimmed the ending by at least ten minutes, and Baldwin should not have got his motivation from the T-1000. There are times when he is so autonomous, you can almost hear the mechanics grinding in the background, which is a shame, because in the first act, he is really convincing, but when we find out he's the Teacher, it's as if he's expecting the audience to want him go that little more Psychotic. Moore is as good as she always is, convincing as the parent who is worried for her son's well being. But when Baldwin and Moore are on screen together, it just doesn't convince. You do think every now and again that they will get together at the end, but thats only because the fear factor that Baldwin had in the first act vanishes. Gandolfini is great in this movie though, and shows what a talent he is. Just a shame he isn't in the movie a lot more. There is some good camera-work and good performances, even from your token mobsters, who look like extras from Goodfellas. It's not a bad film, entirely watchable, just not plausible enough.",
         "This movie is enough to recommend on the strength of the acting from Moore, Gandolfini, and especially Alec Baldwin but it is a shame that some of the excesses and superfluousness (especially the unsatisfying escapade in Guatemala) could not have been cut out. Instead of more action it would have been interesting if the ethical aspect of a compromised juror (albeit unwillingly) could have been explored in the spirit of 12 Angry Men. Anyway, this movie still rates a 7/10 on the strength of some undeniable suspense and very strong acting especially from Baldwin.",
         "This film is a great demonstration of why Demi Moore didn't have a more successful career as a top-level actress, though whether it was the fault of Moore or society is open for debate. She's a capable enough performer, but she lacks the ability to project either vulnerability or likability. With the former, you can trade on an audience's sympathy. With the latter, you can paper over the problems in a script or a production with your own charm. Moore's weaknesses are so clear in The Juror because she fails first at playing the victim and then can't entice the viewer to overlook the obvious melodramatics of the film's conclusion. She also stands exposed when compared to her co-star Alec Baldwin. He himself has always suffered from a lack of likability, especially in his dramatic roles, but Baldwin can manage a bit of vulnerability. His cold-blooded, criminal mastermind here is far more open and inviting than Moore's ordinary woman and mother. It's especially a shame because a different actress, one without Moore's emotional blind spots, could have raised this movie up from being slightly better than average and made it a truly thrilling thriller. Anne Heche is a perfect example, playing as she does a supporting role to Moore's lead. There's an unguarded energy to her acting that makes her characters so much more appealing than Moore's, who cannot radiate the same kind of joy and ease as an essential contrast to the more sullen and terrifying moments in the story. I'll confess to being more a fan of Heche than Moore, but I think my argument is supported by examining the roles and quality of work done by each woman in the years after The Juror. Annie Laird (Demi Moore) is a sculptress and single mother to Oliver (Joseph Gordon-Levitt) who essentially talks her way onto the jury of a major Mafia trial. That leads to her being targeted and manipulated by the brilliantly evil \"Teacher\" (Alec Baldwin), a Mafia associate who demands that Annie produce a not guilty verdict. She succeeds, only to find that the twisted romantic obsession of \"Teacher\" is far more dangerous than any aspect of organized crime. Putting aside Moore's deficiencies as the star of the show, this is a pretty good flick up until and ending that goes over-the-top and all the way to Guatemala. With James Gandolfini as a gangster that serves as sort of a midpoint between Annie's normality and the psychopathic nature of \"Teacher\", Ted Tally's screenplay put a lot of mostly effective effort into building an interesting dynamic between his two leads. And in the relationships between \"Teacher\" and other mobsters, Tally defuses the super-villain aura around his bad guy and makes him both more believable and more frightening because of that. And when Moore is able to play Annie as a strong and defiant person, her strengths as an actress shine through. Which brings up the point of why a woman can't build a career on playing strong, aggressive characters on screen? There's a legion of men in Hollywood history who duplicated Moore's lack of accessibility or possessed even worse flaws in their craft, yet were able to prosper in roles that didn't require or disguised their faults. But at least in American cinema, female roles are defined almost entirely by vulnerability, likability or f**kability. Moore has the last in spades but admirable avoided that career path. Maybe the problem isn't in Moore, dear friends, but in ourselves. All in all, I like The Juror enough to give it a mild recommendation. Heche does get naked in it and that's more than enough to tip the scales to the good for me.",
         "Annie Laird (Demi Moore) is a sculptress and single mother to Oliver (Gordon-Levitt) who essentially talks her way onto the jury of a major Mafia trial. That leads to her being targeted and manipulated by a hit-man(Baldwin) who demands that Annie produce a not guilty verdict\u0085\u0085 Baldwin and Moore trying their best, and are compelling to a point, it all eventually unravels due to over-length and implausibility of the characters, whose actions over the course of the film are increasingly unlikely. This film is a great demonstration of Demi Moore's lacking of facial expression. She's a capable performer, but she lacks the ability to project either vulnerability or likability. Moore fails at playing the victim. Moore is played away by Heche (one with great facial expressions). Heche in the leading role And Moore in the role of best friend, could have raised this movie up from being slightly better than average into an exciting thriller. This is a pretty good movie up until the ending, that goes way over-the-top.",
         "Terrific. Exciting thriller about a woman on jury duty who is threatened by the mob to make sure that the jury votes for acquittal. Demi Moore is the juror with conviction, that is to save her young son who is threatened. Alec Baldwin is the psychotic killer who will go to any length to make sure that Moore tows the line. He even kills her friend, Ann Heche, a doctor. Tony Lo Bianco is the head of the mob syndicate who fears Moore even after he is acquitted of all charges. An exciting ending for this gripping film. Moore becomes Rambo-like in the end and it's well justified.",
         "Over the years of watching movies, there are two types of movies that stand out above all. The ones that are beyond excellent, and those that that are complete garbage. The ones that teeter between not entirely bad, but really all that good become left out like a sore thumb. Brian Gibson's \"The Juror\" based on a novel by George Dawes Green falls in the category of forgettable average films even though it stars a cast of very talented performers like Demi Moore, Alec Baldwin, Joseph Gordon-Levitt, Anne Heche and James Gandolfini. It's a very easy film to keeping its obscure status because it's overall a mediocre film that leans more towards a bad mediocre than a good one with some rather absurd characters complimented with an even more absurd story that goes way off kilter at times. Demi Moore stars as a sculptor names Annie Laird who's been assigned to stand as a juror on the trial of a hardened Mafia crime boss, only to fell her life and her young son Oliver (Joseph Gordon Levitt)are in jeopardy. A minion of his known only as \"The Teacher\" (Alec Baldwin) convinces her to plead \"Not Guilty\". Even after the trail folds, her and her son's life are still in the balance which leads to her taking care of business herself, personally. The intensity level of the story here is really not that bad considering that a juror was forced to overrule a decision by a Mafia minion. The suspense even after the trial with her still being under the threat still sends chills up my spine after viewing it for the first time in many years. It's what you would expect in a bone-chilling suspense thriller. But the script by Ted Tally was badly executed making the story awfully surreal. The characters just don't match nicely to the story-line and charge up the tense dramatic scenes goes way out of proportions to the point where it unintentionally becomes more laughable. Even the opening scenes where Annie has the chance to bow of the trial is very awkwardly built up. I personally would not ever consider stepping up to such a situation knowing that your life and your loved one's lives would be in jeopardy. It just seems odd that Annie seems more determined to through with it makes her at times be kind of a daft individual. Her enthusiasm makes doesn't give much sympathy to her situation as she gladly agrees to the trial and that a mob henchman is breathing down her and Oliver's neck unless she pleads \"Not Guilty\" to the judge. And to make matters worse she eventually takes matters in her own hands as she decides to confront the Mafia without realizing what these guys are capable of. The surrealist structuring isn't with just the protagonists, but the antagonists as well. Alec Baldwin's character Marc \"The Teacher\" Cordell is meant to be a chilling, cold-blooded remorseless killer, he doesn't come across that cerebral. Granted Baldwin does a good job of making this man a cool and collected individual, but it seems his motives are not fully functioning at times. I'm not condemning Moore or Baldwin in any way; they give a good performances in what's given to them, but the motives between the leading hero and villain just don't hit the right cords. Surely, to have a compelling ending, you have to mold the ending with some rather bizarre twists that are not always plausible. And in the genre of suspenseful thrillers, it should come as no surprise. Sadly, in \"The Juror\", the results are not thrilling, but just plain dumb and quite unconvincing. If it would've had a conclusion similar to the like of \"Runaway Jury\", then this movie would've had a better outcome. If they would have gone with Annie overturning the judge's decision, then I wouldn't be ranting too much on this movie. The supporting cast behind Moore and Baldwin, fail to add any impression on me. Joseph Gordon-Levitt who would later climb to bigger and better things later in his career, was quite good as innocent child put in precarious situation by his naive mother. James Ganolfini who would later on become the iconic Tony Soprano was near perfect as mob henchman Eddie was really not offered much to do and Anne Heche's Juliet is only as a clichéd sex symbol as she gets jazzy with The Teacher. It's like as if it's never been done before. At long last all I can say is that \"The Juror\" was an unsatisfying thriller that was let down by the characters and a story structure that loses its direction and tarnishes in what could have potentially been a very exciting thriller. The effort to boost excitement was put-off because they took a wrong turn in direction making this movie contrived and stupid instead of a chilling surprise ending which this film had the potential to achieve.",
         "If you have two hours to kill (or whack, in the mob nomenclature), then feel free to watch The Juror, a brain-dead thriller that is best witnessed on TV (you don't have to pay for it and you can pretty-much tell when the cussing, sex, and bloodletting are being snipped out). It's an easy synopsis, here--mob boss orders a hit, Alec Baldwin carries it out, there's a trial, Demi Moore gets threatened in order to keep her from voting \"guilty,\" biff-boom-bang. By the end, there are lots of bullet holes in the bad guys, Moore has turned from cutesy artist to Dirty Harriet, and, if you're an Anne Heche or Alec Baldwin fan, you are wondering if you should rent this nonsense to see what all happened in the sack. Since I am neither, I'll stick with the butchered-for-TV version and hope that not all juries are as stupid as the one Demi served on.",
         "After a great run of movies \"Ghost\", \"A Few Good Men\", Indecent Proposal\" and \"Disclosure\". Demi Moore had escaped the 'Brat Pack' phase of her career and was now the go to leading lady of Hollywood. However she came unstuck with \"The Scarlett Letter\" tanking and \"Now & Then\" hardly setting the world alight. Up next was the \"The Juror\". Which didn't stop the rot before \"Striptease\" opened to scathing reviews and a less than expected Box Office returns. There is a lot wrong with this movie, but none of that is really Moore's fault, as despite a stellar cast (Alec Baldwin, James Gandolfini, and Anne Heche) it is her who carries the movie on her own. Baldwin was still an attractive leading man back them, gives a career low performance of the time. I'm not sure his character is meant to be as funny as he seems. Gandolfini (with an awful accent to match his performance) gives no indication of his future in \"The Soprano's\" but is still better than Baldwin. A bright spot though is Joseph Gordon-Levitt catches the eye and shows his future promise as Moore's son Oliver. It's over half an hour too long, I was surprised at it's running time as it felt a lot longer. Ridiculous plot twists and some unnecessary scenes of sex and violence weigh down what could have been a tight little thriller. Moore is watchable as always, but these are not two of her better hours."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": ["When Annie Laird is selected as a juror in a big Mafia trial, she is forced by someone known as \"The Teacher\" to persuade the other jurors to vote \"not guilty\". He threatens to kill her son if she doesn't commit. When the trial is over, he can't let her go..."],
      "budget": 44000000
   },
   "movielensId": 79,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-02",
      "dvdReleaseDate": "1998-07-29",
      "directors": ["Brian Gibson"],
      "runtime": 118,
      "movieId": 79,
      "title": "The Juror",
      "mpaa": "R",
      "actors": [
         "Demi Moore",
         "Alec Baldwin",
         "Joseph Gordon-Levitt",
         "Anne Heche",
         "James Gandolfini",
         "Lindsay Crouse",
         "Tony Lo Bianco",
         "Michael Constantine",
         "Matt Craven",
         "Todd Susman",
         "Michael Rispoli",
         "Julie Halston",
         "Frank Adonis",
         "Matthew Cowles",
         "Polly Adams"
      ],
      "imdbMovieId": "0116731",
      "originalTitle": "The Juror",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Awng-jZnkoY"],
      "plotSummary": "With his gangster boss on trial for murder, a mob thug known as \"the Teacher\" tells Annie Laird she must talk her fellow jurors into a not-guilty verdict, implying that he'll kill her son Oliver if she fails. She manages to do this, but, when it becomes clear that the mobsters might want to silence her for good, she sends Oliver abroad and tries to gather evidence of the plot against her, setting up a final showdown.",
      "tmdbMovieId": 9623,
      "avgRating": 3.1603,
      "releaseYear": "1996",
      "numRatings": 6332,
      "posterPath": "/7aXOB0DyZPxNOYbaQ2oiNn64jm3.jpg"
   }
}