{
   "tmdb": {
      "original_language": "ro",
      "keywords": [],
      "imdb_id": "tt0111546",
      "video": false,
      "title": "An Unforgettable Summer",
      "recommendations": [
         96092,
         62819,
         355930
      ],
      "backdrop_path": "/tW2mVqsuNszTAedSWO0mrmjUEYX.jpg",
      "revenue": 65352,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Marie-Thérèse Von Debretsy",
               "gender": 1,
               "credit_id": "52fe48349251416c91083fe3",
               "name": "Kristin Scott Thomas",
               "profile_path": "/9NuZGaPn3Z1svlbF9ZkdtjgrHZo.jpg",
               "id": 5470,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Capt. Petre Dumitriu",
               "gender": 2,
               "credit_id": "52fe48349251416c91083fe7",
               "name": "Claudiu Bleont",
               "profile_path": "/3FuJi3FzjdTqPTMcOHdpZZvCts0.jpg",
               "id": 134830,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Mme. Vorvoreanu",
               "gender": 0,
               "credit_id": "52fe48349251416c91083feb",
               "name": "Olga Tudorache",
               "profile_path": null,
               "id": 556459,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Gen. Tchilibia",
               "gender": 2,
               "credit_id": "52fe48349251416c91083fef",
               "name": "George Constantin",
               "profile_path": null,
               "id": 592763,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Serban Lescari",
               "gender": 0,
               "credit_id": "52fe48349251416c91083ff3",
               "name": "Ion Pavlescu",
               "profile_path": null,
               "id": 592764,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Gen. Ipsilanti",
               "gender": 2,
               "credit_id": "52fe48349251416c91083ff7",
               "name": "Marcel Iureș",
               "profile_path": "/5SUJOa1L2V8OVDrwpMHv8hMxx54.jpg",
               "id": 15320,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Lt. Turtureanu",
               "gender": 2,
               "credit_id": "52fe48349251416c91083ffb",
               "name": "Răzvan Vasilescu",
               "profile_path": "/5xdW4iF15jEz8axqI8ePLRIyD04.jpg",
               "id": 55507,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48349251416c91083fdf",
               "name": "Lucian Pintilie",
               "profile_path": "/7fkrAOUYQdgBf2GdXEHuUkRoVVz.jpg",
               "id": 592762,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48349251416c91084001",
               "name": "Marin Karmitz",
               "profile_path": "/t9KgqeBerwxwnSkvkvlapJ8gcSS.jpg",
               "id": 1134,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48349251416c91084007",
               "name": "Constantin Popescu",
               "profile_path": null,
               "id": 122778,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48349251416c9108400d",
               "name": "Anton Suteu",
               "profile_path": null,
               "id": 1181815,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5715ecadc3a3686678010080",
               "name": "Lucian Pintilie",
               "profile_path": "/7fkrAOUYQdgBf2GdXEHuUkRoVVz.jpg",
               "id": 592762,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5715ecb892514146c8003121",
               "name": "Calin Ghibu",
               "profile_path": null,
               "id": 1120488,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.235738,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "RO",
            "name": "Romania"
         }
      ],
      "id": 81949,
      "vote_count": 6,
      "budget": 0,
      "overview": "In 1925 Romania, young Marie-Therese Von Debretsy refuses the flirtatious advances of her husband's commanding officer. As a result, the cosmopolitan family is reassigned to a brutally bleak and dangerous outpost on the Bulgarian/Romanian frontier where both their relationship and humanity are severely tested.",
      "similar": [],
      "original_title": "Un été inoubliable",
      "runtime": 82,
      "poster_path": "/qW6vsxia4F8Wk8FglHn3rgAVC0g.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Română",
            "iso_639_1": "ro"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MK2 Productions",
            "id": 6274,
            "origin_country": "FR"
         },
         {
            "logo_path": "/oA5OLrPPlfbaskzPAo7J4uLydzD.png",
            "name": "Canal Plus",
            "id": 104,
            "origin_country": ""
         }
      ],
      "release_date": "1994-05-15",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Romania",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lucian Pintilie"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Lucian Pintilie",
         "Petru Dumitriu"
      ],
      "originalLanguage": "Romanian",
      "imdbLink": "http://www.imdb.com/title/tt0111546/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2OTcwMDAzNF5BMl5BanBnXkFtZTcwMDk4MDQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kristin Scott Thomas, Claudiu Bleont, Olga Tudorache | See full cast and crew »"],
      "reviews": [
         "Most of the action unfolds in a remote, dry, semi-deserted place, a romanian military outpost at the border with Bulgaria. Out of this world, comes Kristin Scott Thomas, a summer breeze, lively, hopeful, and somewhat unexpectedly devoted to her husband. She does not hesitate to follow him to his post, in the middle of nowhere. She could live happily anywhere. Her good faith and kindness are unusual in that land. Indeed an unforgettable summer for those who met her, and for the viewers too. But sad, often outrageous things happen in that region. Orders must be carried out, innocent prisoners must shot. Things that no one can stop, or change. Not even a bright and genuinely hopeful character as that of Kristin Scott Thomas. She ends up drinking, we are told...And all is the same, and will probably stay the same. A lost hope...A defeat. A pessimistic movie for those who come from there. Though well made, with very good, solid performances, it is unlikely that this movie will be of much interest to non-romanian audiences. Kristin Scott Thomas: a super intelligent actress, under-rated by far.",
         "Ete packs a great deal of moral and ethical examination into its 82 minutes. The language bounces around between French, English, Romanian and some Bulgarian and I think this adds to its charm. Beautifully acted by both Kristin Scott Thomas and Claudiu Bleont. Lucian Pintilie is a brilliant director and screenwriter -- he deserves more exposure than he gets. Very strong film!",
         "It is interesting to judge what place 'O vara de neuitat' (An Unforgettable Summer) plays in the too short cinematography of Lucian Pintilie and to speculate about why he had chosen to make this film in 1994, his second only after the fall of the Communism which had practically silenced for two decades the creative voice of a director who debuted in the 60s and could have become in a different constellation one of the most important creators of the European cinema. While most of his films after 1990 deal either with the Communist era or its repercussions in the process the Romanian call 'transition' this film as well as 'Tertium non datur' made in 2005 (his last by now) connect with the more remote past of Romania, the first half of the 20th century. Both deal with the actions of the Romanian army beyond the borders of today's Romania, both happen in remote places, and place the moral dilemma of the Romanian officers in the center of the action. There is one more element in the making of this film that is worth mentioning. The film is inspired by a story written in the 50s by a Romanian writer who was then belonging to the Socialist Realism style (but later became a political opponent and a refugee). So here we have Pintilie, the most famous dissident film-maker of Romania picking up a story written in the Communist era - maybe in a demonstrative manner that tells in a most authoritative voice that bridges with the past should not be completely blown-up. 'The Unforgettable Summer' is a anti-war drama on the road open by Kubrick's 'Paths of Glory'. Yet it has also another classical source in the Romanian cinema - Liviu Ciulei's 'Padurea Spanzuratilor', the first Romanian movie to have won a major prize at the Cannes film festival. Pintilie's film, with the moral dilemma of the officer hero, making eventually the right decision with the major risk for his career and even life has a lot of similarity in theme and form. The cinematographic approach is simple and direct. The film is beautifully filmed, with attention to the detail, and a fluent story telling. Music also playes a role in the narrative structure, the whole action happens between the opening French Can-Can music and the closing 'Eine Kleine Nachtmusik' and in the meantime nothing too nice happens. The horror of the violent actions that happen or are suggested to happen on screen is balanced by the innocent view of the child whose story telling leads the action. Here the innocence is also under pressure as in many other films by Pintilie, so is the destiny of principal heroine superbly acted by Kristin Scott Thomas, who together with her partner on screen Claudiu Bleont give life to the couple of heroes. Her actions cannot cut off sufferings or fix evil, they can only postpone by a second the sentences of history. Is it too much, is it too little? The open question is left to the viewer to answer.",
         "The director manages to pack a lot of local color and drama into a spare 82 minutes. The costumes and scenery are gorgeous, and the acting is superb. And the story itself is both poignant and uplifting. A romantic drama in the Ayn Rand tradition.",
         "I am a Romanian and I never heard of this movie before. I was amazed to see Kristin Scott Thomas speaking Romanian so well and staring in the movie of a Romanian director like Pintilie. The subject was dramatic, but full of heart. It was about human goodness, which from a contemporary perspective is very obvious, but I suppose that at the beginning of the 20th century was seen rather differently. All in all, the movie was good; it kept me hooked for its full length. And bravo for Kristin Scott Thomas, Claudiu Bleont, and Lucian Pintilie. I'm really happy to see Romanian post-communist movies without a script about various transition-related issues.",
         "altering nature is altering mind, and that explains many things except the meaning of a woman and her love. but this movie comes close to show how valuable a woman can be in a rigid world, and how a woman can make life rich and beautiful. still,there is a catch in that, and that is: a husband has to stand for his family and his woman precisely in order for life to develop from there as a lively flower in any given territory. romantic , natural, and pin-pointed with stern conflicts, the movie makes a good call to humanity to stand conflicts and interests, to connect with hearts rather than language or ethnicity. the family is the center of our universe, big or small.",
         "Those who have seen films by Lucian Pintilie, one of the greatest directors in the history of Romanian cinema, would find it easy to detect his unflinching sympathy for the underdogs. Beginning with \"Reconstitution\" (1968) until \"Niki and Flo\"(2003),all his films are about brave people who are able to wriggle out of tough problems solely through their tenacity. One of Lucian Pintilie's more internationally acclaimed films, \"An Unforgettable Summer\" draws viewers' attention towards the ignominious persecution of ordinary, innocent Bulgarian workers by some bad elements of Romanian army. Its wickedness is shown solely from the point of view of a person whose parents' lives were shattered beyond recognition during a turbulent summer when a group of mean Romanian army personnel punished everybody who was not on their side. One should not be shocked to see that some Romanian army officers were depicted not only as philanderers but also as enemies of humanity. It is amidst such a morass that an honest army officer and his wife emerge victorious as they are able to overcome their ethical dilemma by choosing the path to justness. Although \"An Unforgettable Summer\" is not a philosophical film per se, Lucian Pintilie's film does succeed in highlighting the message that one man's \"arbitrary logic\" might lead another man to be despondent to such an extent to even contemplate suicide.",
         "The movie depicts the atrocities committed against Bulgarian peasants by the Romanian authorities after reconquering Southern Dobrogea at the end of World War I. Petre Dimitriu, a young army captain heads the local garrison and attempts in vain to prevent the killings. It is difficult to understand why Lucian Pintilie chose an obscure short-story, published in the early 1950s as subject for his film. The author, Petre Dimitriu, was at that time a young writer aspiring for recognition by the communist regime. The autobiographical story tries at the same time to vilify the former regime and to prove that the authors father had dissociated himself from that regime. The story was intended to reinforce the author's credentials and to help him become an aclaimed communist writer before his defection to the West. Lucian Pintilie's direction was not able to annihilate the political background of the story. Therefore, despite its qualities, the film rings like an anachronic revival of the socialist realism of the 1950s."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "MK2 Productions",
         "La Sept Cinéma",
         "Le Studio de Creation Cinematographique du Ministere de la Culture"
      ],
      "summaries": ["In 1925 Romania, young Marie-Therese Von Debretsy refuses the flirtatious advances of her husband's commanding officer. As a result, the cosmopolitan family is reassigned to a brutally bleak and dangerous outpost on the Bulgarian/Romanian frontier where both their relationship and humanity are severely tested."],
      "budget": 0
   },
   "movielensId": 790,
   "movielens": {
      "languages": [
         "English",
         "Română"
      ],
      "releaseDate": "1994-05-15",
      "dvdReleaseDate": null,
      "directors": ["Lucian Pintilie"],
      "runtime": 82,
      "movieId": 790,
      "title": "An Unforgettable Summer",
      "mpaa": "",
      "actors": [
         "Kristin Scott Thomas",
         "Claudiu Bleont",
         "Olga Tudorache",
         "George Constantin",
         "Ion Pavlescu",
         "Marcel Iureș",
         "Răzvan Vasilescu"
      ],
      "imdbMovieId": "0111546",
      "originalTitle": "Un été inoubliable",
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1925 Romania, young Marie-Therese Von Debretsy refuses the flirtatious advances of her husband's commanding officer. As a result, the cosmopolitan family is reassigned to a brutally bleak and dangerous outpost on the Bulgarian/Romanian frontier where both their relationship and humanity are severely tested.",
      "tmdbMovieId": 81949,
      "avgRating": 3.51695,
      "releaseYear": "1994",
      "numRatings": 118,
      "posterPath": "/qW6vsxia4F8Wk8FglHn3rgAVC0g.jpg"
   }
}