{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0072362",
      "video": false,
      "title": "A Very Natural Thing",
      "recommendations": [
         365126,
         46469,
         294086,
         149715,
         20116,
         132561,
         28628,
         215960,
         49113,
         40421,
         5591,
         158875,
         142108,
         79919,
         21001,
         287855,
         4676,
         19654,
         70993,
         142115
      ],
      "backdrop_path": "/tL45wmAO1vu2o8eDSx33rJvgBe1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "David (as Robert Joel)",
               "gender": 2,
               "credit_id": "52fe468bc3a36847f8104c95",
               "name": "Robert McLane",
               "profile_path": null,
               "id": 44610,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mark",
               "gender": 0,
               "credit_id": "52fe468bc3a36847f8104c99",
               "name": "Curt Gareth",
               "profile_path": null,
               "id": 1144695,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jason",
               "gender": 0,
               "credit_id": "52fe468bc3a36847f8104c9d",
               "name": "Bo White",
               "profile_path": null,
               "id": 937696,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gary, the Roommate",
               "gender": 0,
               "credit_id": "52fe468bc3a36847f8104ca1",
               "name": "Anthony McKay",
               "profile_path": null,
               "id": 153957,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe468bc3a36847f8104c91",
               "name": "Christopher Larkin",
               "profile_path": "/NCVdb6Sks0nyVvDtt7ilh93qB4.jpg",
               "id": 1144694,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "596e9800c3a3686acb0001f6",
               "name": "Joseph Coencas",
               "profile_path": null,
               "id": 1854055,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "596e98259251412d41014723",
               "name": "Christopher Larkin",
               "profile_path": "/NCVdb6Sks0nyVvDtt7ilh93qB4.jpg",
               "id": 1144694,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.641796,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44495,
      "vote_count": 6,
      "budget": 0,
      "overview": "When David, an ex-monk still in his twenties meets Mark, he falls hard; soon he's asked Mark if they can live together. Things go well for awhile, and then differences in their definition of \"commitment\" begin to push them apart. Mark wants other sexual adventures, David tries to go along. Can they talk through the crisis in their relationship or is a breakup in the offing? David sees his relationship with Mark as a marriage, so if it ends, can David's heart ever heal?",
      "similar": [],
      "original_title": "A Very Natural Thing",
      "runtime": 80,
      "poster_path": "/4MsrBHWIClZIcd66XsWUn4lt2LO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1974-01-01",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Larkin"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Joseph Coencas",
         "Joseph Coencas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072362/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMTA4NjA0Nl5BMl5BanBnXkFtZTcwOTUzODIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert McLane, Curt Gareth, Bo White | See full cast and crew »"],
      "reviews": [
         "\"A Very Natural Thing,\" according to sources I've read, was one of the first films to show gay men candidly as people. The two principle characters could be anyone. They don't fall easily into stereotypes which plague gay-themed films, even today in the late 1990s. This film definitely has the look and the feel of its times, the mid-70s. It's fascinating to see how people dressed, the way they talked, what cars they drove, even how they cut their hair. It's also interesting to look at gay lifestyles in this period setting. This was before AIDS/HIV, and unprotected sex was the norm. It takes place just at the beginnings of the 70s age of sexual liberation, not only for gays, but people in general as well. (For another view of the period see BOOGIE NIGHTS or the TALES OF THE CITY series.) But the most important part of the film is the relationship between the two, psychologically different characters who meet in a dance club, fall in love, and live together. It could be two people today. It shows what two average gay men might experience living together. I cross-referenced some of the people who made this film. Few went on to do anything else in movies. I think only one made it into the '80s in a mainstream film. The film has low-budget production values from the period. I didn't find that so much distracting as endearing. It made the film all that much more real.",
         "I was genuinely surprised by how good this film is, especially given that it was made only a few years after Stonewall. The portrayal of the relationships the protagonist has was very moving and real, the psychological depth much more complex than most films that are made today, gay or straight. Of all the movies I've seen in my life, I have never seen so many beautiful images of gay male love that are so celebratory and happy. It's like a Walt Whitman love poem brought to vivid life. The movie is worth seeing just for the last five minutes alone. The film is also an incredible historical archive. Some of my favorite sequences were interviews made with people on the street during the 1973 \"Christopher Street Pride Parade,\" probably among the first Pride festivals ever. Many of the comments made could have been said today. This film shows a slice of life at the beginning of the gay sexual revolution, and at the same time deals with all the complicated issues of falling in love that remain timeless. That it shows life before AIDS also adds a layer of poignancy that the filmmakers could never have planned for. I was sad to see that the principal figures in the movie, the actors and director, didn't do much more cinema work beyond this film. I hope they know they created a very special film that still can touch one's heart.",
         "I only heard of this film in passing, and did not realize how good it was until I rented the DVD. Don't be put off by the dated 1970s music, wardrobes, hairstyles, small-budget, grainy photography, etc. for this is a milestone in gay cinema. Made just about 5 years after the groundbreaking \"Boys in The Band\", this greatly improves upon that film, with no self-loathing characters, but natural, real people. The writer-director Christopher Clark incorporates pensive dialogue in the story of an ex-Seminary student who finds love with one man, but is soon turned away from him and eventually finds peace with someone else. The musical score is moving, with classical pieces and more. Cast of unknowns unfortunately remained that way, but they are all outstanding. The parade sequences give added flavor and still timely food for thought. The last 5 minutes, with slow-motion photography and soaring music (pre-dates \"Chariots of Fire\" -1981), better illustrates male bonding than anything seen before or since. Most of the latter-day gay films remain silly, shallow, frequently mean-spirited fodder, with \"Making Love\" (1982 - good, \"Maurice\" (1987 - better) \"Big Eden\" (2000 -great) among the few notable exceptions. A classic awaiting rediscovery.",
         "I watched this last night on television. I'm quite the gay film buff but I had never heard of this movie. I can't top Tom Norris's review;they reflect my thoughts perfectly. The film is a documentary of a time I lived through but was just a little too young to participate in. A must see film.",
         "I no longer live in Florida, having decided to move to California after the death of my long-time companion/partner -- a life altering event. Having never heard about or seen this movie before, I wish Bill could have viewed this film before he left me! We were pre-Stonewall (I am now in my 80's)and, in fact, living just around the corner from The Stonewall in the NYC Village on the night of that famous explosive event -- another life altering event. A Very Natural Thing is an amazing film that everyone (gay or straight) should (must?)see. It tells a simple story in a very simple manner: expressive of a time when gay men and women were watchful and fearful of exposure. I confess tears streamed down my face -- partially because of the beauty of the film and partially grieving for lost youth. I hope younger homosexuals will not disparage the old-fashion-ness or the lack of modern day cinematic sophistication of this outstanding piece of film work: indeed a thing of beauty and a joy forever.",
         "I stumbled across this film from Netflix. I really had no preconceived notions of the film when I got the DVD in the mail. I was surprised and uplifted to see a film that was extremely progressive for being filmed in 1973(!) The discussions and concepts brought to light are somewhat the same as now. There was an openness to the cast and real people interviewed during the film that I was unaware of during the early 70s. So many times gay films seem to lack real substance and can't get over the basic premise of dealing with being gay and using stereotypical characters. The story moves from beyond that point and deals with real issues, even if it's just finding someone to love. I was very impressed and it was a great story of modern gay relationships.",
         "this is a tale of pre-aids post stone wall. gay in new york city (early village) this a very important film for many reasons including the 1973 NYC gay pride parade footage, the very ground breaking subject of that time men on men in long term relationships, also for its very butiful gay love seence. A truly butiful movie a decade before its time. thanx sky w.",
         "This 1973 film tells a story of gay life that is simple and familiar. Boy meets boy. Boy loves boy. Boy gets bored with boy. Etcetera. The straightforward, non-apologetic script is either timeless or old as the hills, depending on your tolerance level. While I was watching I began to wonder if the script could be re-shot today without significant modification. I think it probably could--there isn't much happening that couldn't take place almost word-for-word in any present-day urbanopolis. Despite the sometimes raging amateurism in acting, photography, and especially sound, this film is well worth seeing. Those who lived through the era will experience an affectionate nostalgia for what I cannot help but call \"the good old days.\" For those born after, say, 1985, you'll get an accurate look at what gay life was like as it was beginning to coalesce post-Stonewall. The production of the film also reflects the times. Some scenes have a cinema verite feel, some are clearly documentary. The last scene's unflinching male \"frontal\" nudity is another relic of the 70s. Like I said, the good old days. I would classify this as a \"must-see\" for any gay cinema buff. To my knowledge it is the first to grapple with the relationship problems unique to post-Stonewall gay life.",
         "This is a beautiful period piece. Even though the direction is uneven (but gets better in the last half) it carries a powerful message which still has meaning 3 decades later. It has less sex than the series \"Queer as Folk\",or cable \"Adult Movies\", yet still communicates this aspect of gay relationships. The surprising thing when viewed from an historical perspective, is that society's attitudes toward diversity have changed little and gay people are still struggling with the problems presented in this movie. An additional plus, is that it deals with the difficulties facing all human relationships, whether gay or heterosexual. A must see film.",
         "Some very fine reviews already posted for this interesting movie, which I found very enjoyable as an intriguing look at gay life and also from a historical point of view. It often has the flavor of a documentary because of the interjection of real newsreel scenes of Stonewall. The cruising episodes on Fire Island and in steam baths have a cinema verite quality. The story involving the up-and-down efforts of ex-priest David to find a man he can settle down with hold the viewer's interested, but the bickering between the two men becomes a drag on the movie. One is relieved when David finally hooks up with the Bo White character, leading to a very beautiful closing episode shot amid the dunes at Truro on Cape Cod. The movie therefore ends on a note of affirmation and one hopes that all went well for all the men involved in this important glimpse at gay life a generation ago."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Montage Creations"],
      "summaries": [
         "When David, an ex-monk still in his twenties meets Mark, he falls hard; soon he's asked Mark if they can live together. Things go well for awhile, and then differences in their definition of \"commitment\" begin to push them apart. Mark wants other sexual adventures, David tries to go along. Can they talk through the crisis in their relationship or is a breakup in the offing? David sees his relationship with Mark as a marriage, so if it ends, can David's heart ever heal?",
         "A poignant romantic drama examines the life of gay 26 year old, ex-monk, school teacher living in Manhattan. When he meets a man at a gay bar, they connect and are soon living together. Unfortunately their views on monogamy don't match."
      ],
      "budget": 0
   },
   "movielensId": 796,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-01-01",
      "dvdReleaseDate": "1998-11-11",
      "directors": ["Christopher Larkin"],
      "runtime": 80,
      "movieId": 796,
      "title": "A Very Natural Thing",
      "mpaa": "",
      "actors": [
         "Robert McLane",
         "Curt Gareth",
         "Bo White",
         "Anthony McKay"
      ],
      "imdbMovieId": "0072362",
      "originalTitle": "A Very Natural Thing",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "When David, an ex-monk still in his twenties meets Mark, he falls hard; soon he's asked Mark if they can live together. Things go well for awhile, and then differences in their definition of \"commitment\" begin to push them apart. Mark wants other sexual adventures, David tries to go along. Can they talk through the crisis in their relationship or is a breakup in the offing? David sees his relationship with Mark as a marriage, so if it ends, can David's heart ever heal?",
      "tmdbMovieId": 44495,
      "avgRating": 2.96809,
      "releaseYear": "1974",
      "numRatings": 47,
      "posterPath": "/4MsrBHWIClZIcd66XsWUn4lt2LO.jpg"
   }
}