{
   "tmdb": {
      "original_language": "fa",
      "keywords": [
         {
            "name": "fish",
            "id": 1357
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "celebration",
            "id": 33648
         },
         {
            "name": "goldfish",
            "id": 40846
         }
      ],
      "imdb_id": "tt0112445",
      "video": false,
      "title": "The White Balloon",
      "recommendations": [
         187864,
         35867,
         123648,
         149156,
         36226,
         94798,
         8896,
         38311,
         52322,
         14495,
         89785,
         47161,
         132364,
         90041,
         215407,
         155006,
         198902,
         42199,
         150707,
         122445
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Razieh",
               "gender": 0,
               "credit_id": "52fe470cc3a36847f8120b0f",
               "name": "Aida Mohammadkhani",
               "profile_path": null,
               "id": 1034640,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Ali",
               "gender": 0,
               "credit_id": "52fe470cc3a36847f8120b13",
               "name": "Mohsen Kafili",
               "profile_path": null,
               "id": 1034642,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Mother",
               "gender": 0,
               "credit_id": "52fe470cc3a36847f8120b17",
               "name": "Fereshteh Sadre Orafaiy",
               "profile_path": null,
               "id": 1034643,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Old Lady",
               "gender": 0,
               "credit_id": "546e16b0c3a36817f7000044",
               "name": "Anna Borkowska",
               "profile_path": null,
               "id": 1387299,
               "order": 3
            },
            {
               "cast_id": 1007,
               "character": "Soldier",
               "gender": 0,
               "credit_id": "546e16bc9251414684000035",
               "name": "Mohammad Shahani",
               "profile_path": null,
               "id": 1387300,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b1d",
               "name": "Jafar Panahi",
               "profile_path": "/a8HN99enx3plYkpb1UK1Jl6qnmS.jpg",
               "id": 120229,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "546e168cc3a36817e300003f",
               "name": "Abbas Kiarostami",
               "profile_path": "/bK2PXoGS1hcCzGd9OoIkTnJyEYX.jpg",
               "id": 119294,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.660604,
      "production_countries": [{
         "iso_3166_1": "IR",
         "name": "Iran"
      }],
      "id": 46785,
      "vote_count": 27,
      "budget": 0,
      "overview": "Several people try to take advantage of a little girl's innocence to hustle money her mom gave to her to buy a goldfish with.",
      "similar": [
         4547,
         949,
         10555,
         41513,
         7345,
         164,
         587,
         9016,
         15,
         55,
         104,
         509,
         539,
         275,
         38055,
         60243,
         127380,
         9982,
         5236,
         13809
      ],
      "original_title": "بادکنک سفید",
      "runtime": 85,
      "poster_path": "/96UDOJNgJXHmQMJqA79bKS9PR8i.jpg",
      "spoken_languages": [{
         "name": "فارسی",
         "iso_639_1": "fa"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "I.R.I.B. Channel 2",
            "id": 38953,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ferdos Films",
            "id": 38954,
            "origin_country": ""
         }
      ],
      "release_date": "1995-01-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jafar Panahi"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Abbas Kiarostami",
         "Jafar Panahi"
      ],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0112445/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5ODk5MDAwN15BMl5BanBnXkFtZTYwNDA3MjE5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Aida Mohammadkhani, Mohsen Kafili, Fereshteh Sadre Orafaiy | See full cast and crew »"],
      "reviews": [
         "This movie, as has been said before, enters the world of children. But it does it with such a lack of full credit for grace and feeling. It never belittles children - in fact, it makes adults look like the buffoons they are. You feel for every victory and defeat they have and get engrossed in their plots and problems. The encounters with common Iranians is also wonderful, especially the soldier at the end. Perhaps the most natural example of child acting is shown through Rezayeh - I am surprised she was never nominated for anything in this film. Her other films are also great, but nothing matches \"The White Balloon\" Not to be missed - one of the best Iranian films of all time, without question.",
         "In his directorial debut, Jafar Panahi - a devoted pupil of Iranian film-god Abbas Kiarostami - is able to encapsulate the stubbornness and curiosity of a seven-year-old Tehranian girl so authentically (by use of newcomer Aida Mohammadkhani) that we forget that we are watching fiction unfold. The White Balloon has a continuous feel that is obtained by allowing the story to unravel in real time. An unseen radio informs us that the Iranian New Year is almost upon the town; a tradition for this annual event is to either catch or buy a fish (fish represent life). Razieh, the little girl, is unsatisfied with the selection of fish in the family's pond. She complains that the family's fish are too \"skinny.\" Eventually, Razieh's brother, Ali (Mohsen Kalifi's only role thus far), cons their mother into letting Razieh have a 500 note (Iranian money) to buy the fish that she wants. On her way to the market, Razieh loses the money two times. It is the second loss that is the most serious - the money falls into the cellar of a closed shop through a sidewalk drain. The remainder of the film is devoted to the introduction of various strangers offering either to help retrieve the note or pass the time with light-humored conversation. Beautiful cinematography (winner of the Camera d'or at Cannes in 1994), memorable characters, and stunning direction backed by Kiarostami's expertly written script make for a great film that was reminiscent of my viewing of John Sayles' Secret of Roan Inish. Like Sayles' film, there is a magical, absorbing quality to The White Balloon that spellbinds the viewer regardless of age.",
         "Young Razieh (Aida Mohammadkhani) needs to buy a goldfish to celebrate the New Year in Iran. Her mother (Fereshteh Sadr Orfani) gives her the money and she sets out to buy said fish. Along the way she continually loses the money and must rely on the kindness of strangers to help her. This is a very slight film. It's plot is wafer thin in terms of traditional narrative, it may well frustrate many viewers with it's gentling strolling style. However it is quite funny on the surface. The many people who come and go during Razieh's journey are amusing - from the tailor berating a customer for having a small face causing his shirts to not look correctly tailored to the antics of the honest snake charmers. It's not a laugh out loud type of film but it does have a gentle humour throughout that is fun if you are in the mood for it. In fact you really need to be in the mood for the whole thing - if you're lacking patience then you'll probably not last out this film but if you're willing to stick with it then you may be pleasantly surprised by the whole thing. The story doesn't grip you, but the humour helps to divert attention from this. In fact the guts of this film seems to be a message on the nature of society. Throughout the film Razieh finds herself relying on the kindness or honesty of strangers to help her get her money. The towards the end one of the characters (a soldier played by Mohammad Shaani) talks to Razieh about his sisters and about what he has in common with her. He then defends himself when Ali (Mohsen Kalifi) attacks his sister for talking with strangers. This is closely followed by a short scene where all the characters that had interacted with Razieh cross the screen at the same time without really acknowledging each other. The message here is clear - that society is a lot closer knit than we think and it's only times of trouble where we turn to others. Instead we should develop the relationships with strangers that we easily could. However this message is not delivered until the end of the film and it's only then that you understand what you've been watching. However the gentle comedy of the strangers make it easy to follow the film till this conclusion. Unlike other reviewers I don't think Mohammadkani was that good - she did come across as a very weepy brat and it was hard to sympathise with the problems that are all her own fault. However the other roles are good, Kalifi is the best child actor as Razieh and the other characters seem natural and forced (although Shahani's soldier is a bit preachy). Overall a gently amusing film that is light on plot, but delivers it's simple message intelligently without forcing it down your throat.",
         "It was my big sister's turn to pick a film to go to when we were gorging ourselves in what the Reykjavik cinema festival had to offer back in the days. Didn't expect anything but mushy boredom for an hour and a half. Instead of the sentimental torture I had braced myself for, I became spellbound by this beautiful story that totally held me captivated right from the beginning to the end. The little girl, Aida who plays the protagonist, was ever so sincere and true in her role that you forgot you were watching a film, and even I felt a couple of masculine tears running down my cheeks. The White Balloon is simply a gorgeous film and it's out of the blue quirky humor elevates it even further. Even with the wet towel slap in the end, I truly loved the whole of this Persian confect buffet down to it's last bit, ... and still do!",
         "Abbas Kiarostami wrote this film, which is very much like his 1987 masterpiece, Where Is the Friend's Home? That film had a young boy trying to give back some other boy's homework that he accidentally took home. This one has a little girl having all kinds of problems trying to buy a goldfish on New Year's Eve. Each of these children have to navigate their way through a world of adults in a culture where the young are to be seen, but not heard. The earlier film is quite a bit better than The White Balloon, but this is a wonderful film in its own right. It has a wonderful set piece where a street performer thinks that the girl is donating the money she has for her goldfish to a snake charmer. She has to work up the courage to speak up for herself, and then to take the money when it has been wrapped around a snake. My only real problem with the film was the lead performance, by Aida Mohammadkhani. She has really nice facial expressions, but her voice and line delivery are monotonous; truth be told, she gets kind of obnoxious after a while. Mohsen Kalifi, who plays her older brother, is wonderful, on the other hand. I really liked the way the sibling relationship was developed. Kiarostami, genius that he is, adds some small details that give the film a much deeper resonance than one might find at first glance (I'd almost call this a trademark of his). The sequence with the titular balloon, along with the haunting final shot, is the kind of thing that could make this film last forever inside of me.",
         "Most of the respondents have reviewed \"White Balloon\" as an art film. I would like to advocate its a great kids' movie. My kids (9 and 10) watched it entranced. To them its a movie about a real life situation that any kid could get into. It never patronizes children but treats them as the center of the film with their own lives and needs. Something else which escapes the other reviewers is the filming is all done from a child's level.",
         "I had the pleasure of watching this movie last year. I have recommended it to countless others since. There is something about this movie that stays with you and is absolutely unforgettable. I can't quite put my finger on it. The pace is slow and purposeful. The little girl and her brother are adorable. The minor characters are fantastic, including the tailor and the difficult customer. I found myself laughing out loud several times during the movie, The themes are universal. It was very easy to forget it took place in a different country in another language. It is all familiar and at the same time, revolutionary. I can watch this over and over. It may be a perfect film.",
         "The title of this film refers to the final scene (and indeed frame) of the film, and it is key to understanding the central message. Whilst the most part of the runtime is spent following the little girl Razieh around the city streets of Tehran, the film ends with her and her brother running away out of sight, and instead draws focus on the Hazara boy standing there alone, clutching his single balloon. Far from being a heart-warming tale, The White Balloon tells of childhood selfishness, greed and desperation, amongst other things. In the film, these traits are shared by all the other (apparently) grown-up adults too: the father who becomes distressed over a bar of soap, the mother who is too busy to help her child, the shady snake charmers who try to steal Razieh's money, and the various shopkeepers and people out and about. All these people are out for themselves. It is perhaps Panahi's (or Kiarostami's) opinion that whilst the girl and her brother's childhood impatience and moody behaviour can be tolerated due to sheer naivety, the fact these traits are still abundant in mature people is to be decried. The only person who possesses none of these failings is the balloon seller, who selfishly helps the girl retrieve her money. In the end he is left thankless. The simple title belies this films widespread reproach of modern society, as the film is played out in real-time (lending it a disarming verisimilitude) in the cultural and economic centre of Iran.",
         "I just finished watching this delightful movie about a five-year old Iranian girl who is given money to buy a goldfish but loses it. The film, innocent yet interesting and enthralling takes the viewer along on her journey to find the money so that she can get her fish. She encounters many people along the way, all who try to help her to get back the money. There are many underlying themes throughout the movie as well, but above all, we learn to help each other and see each other as more than just strangers. Also, the plot summary given about this film is misleading and downright false. No one tries to take advantage of this little girl at all!",
         "I recently viewed this movie on Bravo TV and was absolutely spellbound. At first, the Farsi language threw me, but it was delightful after awhile in a melodic sort of way. Plus, the lead character is adorable. Her traumatic experience in buying the goldfish is heartrending and at the same time is enlightening. You will want to turn away for fear that she will not succeed and yet you watch because you know that she will. The movie also helps you to regain a faith in the common goodness of the human race."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Ferdos Films",
         "I.R.I.B. Channel 2"
      ],
      "summaries": [
         "Razieh wants a fat goldfish for the Iranian New Years celebration instead of the skinny ones in her family's pond at home, because the fat fish looks like it's dancing when it swims. After many attempts she and her brother convince their mother to give them her last bit of money. Between their home and the fish store, Razieh loses the money.. She finds it, but it is temptingly just out of her reach.",
         "Several people try to take advantage of a little girl's innocence to hustle money her mom gave to her to buy a goldfish with."
      ],
      "budget": 150000
   },
   "movielensId": 80,
   "movielens": {
      "languages": ["فارسی"],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": null,
      "directors": ["Jafar Panahi"],
      "runtime": 85,
      "movieId": 80,
      "title": "The White Balloon",
      "mpaa": "",
      "actors": [
         "Aida Mohammadkhani",
         "Mohsen Kafili",
         "Fereshteh Sadre Orafaiy",
         "Anna Borkowska",
         "Mohammad Shahani"
      ],
      "imdbMovieId": "0112445",
      "originalTitle": "بادکنک سفید",
      "genres": [
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": ["jL4l_tyPC0Y"],
      "plotSummary": "Several people try to take advantage of a little girl's innocence to hustle money her mom gave to her to buy a goldfish with.",
      "tmdbMovieId": 46785,
      "avgRating": 3.72629,
      "releaseYear": "1995",
      "numRatings": 601,
      "posterPath": "/96UDOJNgJXHmQMJqA79bKS9PR8i.jpg"
   }
}