{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "nanny",
            "id": 2341
         },
         {
            "name": "notebook",
            "id": 5585
         },
         {
            "name": "binoculars",
            "id": 158071
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116493",
      "video": false,
      "title": "Harriet the Spy",
      "recommendations": [
         83489,
         17414,
         25641,
         35645,
         15170,
         55015,
         20224,
         36797,
         15489,
         73249,
         37434,
         68927,
         20551,
         44373,
         60666,
         44232,
         38937,
         82549,
         114540,
         150889
      ],
      "backdrop_path": "/jZvnkh7TO1DvmmT0FsAzmj78Hmg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harriet M. Welsch",
               "gender": 1,
               "credit_id": "52fe46a09251416c9105a76b",
               "name": "Michelle Trachtenberg",
               "profile_path": "/jLkEO1ggRke1PQ6XZ2kZpVXMrob.jpg",
               "id": 49961,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ole Golly",
               "gender": 1,
               "credit_id": "52fe46a09251416c9105a76f",
               "name": "Rosie O'Donnell",
               "profile_path": "/76ZWoNK1Fr6gmJUH1zhEBMsT9DT.jpg",
               "id": 12929,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mrs. Welsch",
               "gender": 1,
               "credit_id": "52fe46a09251416c9105a779",
               "name": "J. Smith-Cameron",
               "profile_path": "/nlqKCF29YVHmn9w2IX9pMa5nMqe.jpg",
               "id": 52475,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Agatha K. Plummer",
               "gender": 1,
               "credit_id": "52fe46a09251416c9105a77d",
               "name": "Eartha Kitt",
               "profile_path": "/orRADHGrQwUD2H9eUcFA8wDbYNH.jpg",
               "id": 70243,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Janie Gibbs",
               "gender": 1,
               "credit_id": "52fe46a09251416c9105a781",
               "name": "Vanessa Lee Chester",
               "profile_path": "/7MISWIcns6CLagoPnKGzRXchoMz.jpg",
               "id": 4938,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sport",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a785",
               "name": "Gregory Smith",
               "profile_path": "/h13wfMQQrcyg98Gxg8Ult3vCSR9.jpg",
               "id": 20814,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ben Welsch",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a789",
               "name": "Robert Joy",
               "profile_path": "/xh5eb9p379k9w3NOGRjEyAw2yrP.jpg",
               "id": 19976,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46a09251416c9105a775",
               "name": "Bronwen Hughes",
               "profile_path": "/eOCUyOpDGsliiWA3c5qc2CGS5he.jpg",
               "id": 18320,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54678cdf22136e1e1700038b",
               "name": "Douglas Petrie",
               "profile_path": "/yX3kfhOksjWl6bY9TonfMso8fZG.jpg",
               "id": 1213071,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "54678ceb22136e1e1f0003db",
               "name": "Theresa Rebeck",
               "profile_path": null,
               "id": 163496,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.384423,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38223,
      "vote_count": 61,
      "budget": 12000000,
      "overview": "When the secret notebook of a young girl who fancies herself a spy is found by her friends, her speculations make her very unpopular! Can she win her friends back?",
      "similar": [
         11236,
         858,
         141,
         634,
         788,
         242224,
         49517,
         112160,
         452507,
         437557,
         302699,
         258480,
         806,
         433,
         43923,
         36669,
         954,
         6637,
         213,
         27576
      ],
      "original_title": "Harriet the Spy",
      "runtime": 100,
      "poster_path": "/erYGaztkz1tJbmyiB8uLMa9e4ZG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Rastar Pictures",
            "id": 2070,
            "origin_country": ""
         },
         {
            "logo_path": "/m31fQvZJuUvAgxoqTiCGYFBfZYe.png",
            "name": "Nickelodeon Movies",
            "id": 2348,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-07-10",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "On your case!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bronwen Hughes"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Louise Fitzhugh",
         "Greg Taylor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116493/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5NzUzODA5MV5BMl5BanBnXkFtZTcwOTAwNTAzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Michelle Trachtenberg, Rosie O'Donnell, Gregory Smith | See full cast and crew »"],
      "reviews": [
         "I first saw this movie when I was nine years old. I liked it for that time. I in fact tried to emulate Harriet and her friends. But those days are over now. What I am trying to say is don't say this is an awful movie because you found it dumb. Yes, some of it may be a little...juvenile. But remember, it WAS MADE for juveniles, not adults or anyone else but the age range of 8-12. If you are between the ages of eight and twelve, and you still hated it, then yes, it is understandable. But it is ridiculous for an adult to say that they hated this movie because it is 'too juvenile'. I think this movie has a great plot and a great message to young children. Be truthful to your friends, and you will succeed beyond your dreams. I also read the book, and this movie is quite close to the book, which is a good thing for a movie to be. In totality, this is a cute movie with a good message, and if you liked the movie, read the book too.",
         "I saw Harriet the Spy when it first came out and bought the video about a year ago. I had read the book back in the early eighties in the fifth grade and had never forgotten it. I always thought that it would make a good film (along with the Narnia tales and A Wrinkle in Time). The book was very engrossing and seemed a lot smarter and less condescending than some of the other books that wound up on school library 'recommended' lists. The movie contains the same wit and utter lack of condescension, making it a rarity in the world of tweenage cinema. Michelle Trachtenberg is very good. Her innate charisma and complete chemistry with Rosie o'Donnell make for perfect casting. Ms. O'Donnell herself shows once again how well she can carry off playing these quiet nurturing roles. (for another good performance by Rosie, see also Wide Awake) Harriet seems like a typical albeit intelligent kid. Her friends are like real friends: they can be there for you and they can turn on you if they themselves feel under attack. This defense/offense posture is typical in a child's world. and that's what's great about Harriet the Spy. You never feel that the film is talking down to its audience or trying to present the child world in such a sweetened watered-down way so as to placate adults. Harriet and her friends have their little quirks. there's also the other kids who have wierdnesses about them that if we try hard we can all relate to. For instance, there exists in every classroom a perfect Teacher's Pet like Marion Hawthorne. There is also a Pinky Whitehead and a boy with purple socks. (probably me back then haha) the important thing is that the movie accepts their world without whitewashing or judging them for it. Those posters who felt that the movie was juvenile must understand that it WAS written for children. That doesn't however mean that adults should avoid it. It contains several themes that can be discussed and understood by anyone: Coping with school, Coping with Growing Up, Trouble with peers and miscommunication and isolation with parents and peers alike. As i said earlier, The character of Harriet was well thought-out. They could've done a little better fleshing out the character of Janie. If i remember correctly, she had a somewhat larger role in the book. But they actually improved on Sport's role. Some people have complained that the movie is disjointed and at times unrealistic. Well, try and think back to when you were eleven. wasn't the world somewhat surreal and disjointed? The movie is from The subjective lens of Harriet's minds-eye, an eye that see things with more than a little wit and imagination. Think back...then you'll get it.",
         "Harriet the Spy is the story of an eleven-year-old girl, who has been taught to be an individual. Harriet wants to learn about people and she wants to learn how to express her thought about them. So, she decides to becomes a spy and thus eavesdrops on the nuances of the world around her. Of course, her schoolmates find her all too different, and when they learn what she has been writing about, they decide to castigate her and that is where things come to a head. Children can be cruel. Even Harriet. But they can also be hurt more profoundly. Here is a story about growing up. Like Stand By Me, it enjoys humor, but balances itself carefully between the light and dark sides of growing up. Michelle Tractenberg is nothing short of superb in her role as Harriet M. Welsch. Rediscovered as Dawn Summers in Buffy the Vampire Slayer, here is a girl who by rights should have been placed on equal terms with Anna Paquin in Fly Away Home or Anna Chlumsky in My Girl. Harriet the Spy is an extraordinary film that bubbles out charm toward kids of any age.",
         "with the possible exception of irvin kershner's 1966 adaptation of elliot baker's a fine madness, i don't i've seen a better translation of a book about writing into a film. sure we think of louise fitzhugh's harriet trilogy (harriet the spy, the long secret, and sport) as being about the the comic adventures of a little girl and her friends in nyc and they are; but the heart of harriet's writerly spirit comes shining through in bronwen hughes film of douglas petrie's fairly literal, and literate, adaption. there is a period update which makes some of the book's innocence play a little quaint and the kid movie necessary rapid edit kiddie silliness that saps some of the seriousness without actually attaining the levity it seeks; but by and large the film is worth taking any kid over 8 to and anyone who has ever seriously thought of writing, or even just felt a longing to express and accepted. PS the rosie odonnell billing is way over valued. Michelle Trachtenberg,as Harriet, more than ably carries the film, especially considering she was only 11 at the time.",
         "I just saw this film yesterday morning - ideal relaxation for the holiday weekend. The story was OK, maybe a bit shallow for my taste - I'm haven't been a kid for a long time - but I was really taken with the acting. Everyone played his/her part beautifully, completely credible, and none was the frightful red-haired brat as used to be portrayed in children's movies. I was particularly taken with Harriet herself, and am not surprised that she has gone on to greater things. The main lesson learned from this film appears to be that two wrongs do not make a right. Bush note!",
         "This is a good film. Michelle Trachtenberg makes a great Harriet the Spy. This movie is filled with comedy for the younger kids and is worth a look. I think this movie is underrated and it should have recieved more than it did. I read the book and from what I can remember, this movie resembles the book well. The supporting cast including Rosie O'Donnell is great. The characterization is also well done including the characters Sport, Janie and the wise cracker Marion Hawthorne. Harriet the Spy has a great mix of comedy, drama and tragedy. I recommend this movie to any young one and if you've haven't read the book, I would recommend you do or you might not understand this movie. *** out of ****",
         "I watched this movie first in the movie theaters when I was younger. I must tell you that I enjoyed it to the extreme. It's the type of movie that makes a young child want to go out and be the main character. You know what I mean, get a spy notebook and gadjets and try to spy on the next door neighbors. Come on, I did it, haha. Anyway, Michelle Trachtenberg (Buffy The Vampire Slayer) plays Harriet, the lead character. She gets herself into a lot of trouble throughout the story, but has a lot of fun on the way too. She does an awesome job with that character. I also think the role of Sport (played by Gregory Smith of Everwood) was also great. He did a good job of making Sport a believeable character. Rosie O'Donnell also stars in this movie. I like this movie, and it is fun to see those actors such as Trachtenberg and Smith now and see how much they have grown since this movie.",
         "This movie was not what I expected, but I was not disappointed; I was rather entertained. I'm not familiar with the books regarding Harriet the Spy, so I thought the movie was going to be about a kid who uncovered and foiled some illegal plot she stumbled across. I had no idea it was about a girl who aspired to be a writer. It was more dramatic than I expected too, but very realistic..it was about loosing friends and winning friends back-a more realistic story than uncovering and foiling an illegal plot. I loved the city scenes of the children running around Ontario in the autumn. I found it to be rather cinematographic.",
         "this movie i went and saw when it first came out. After watching the behind the scenes promos on nickelodeon i was really shocked that Nickelodeon can do movies as well as a television network. Brilliantly written and acted i loved the acting and all the characters. It shows that what you are thinking is not always good to write down for fear of someone finding it. It also show's her trials and tribulations going through 6th grade wanting to be a spy and having a nanny in the mix. I loved Rosie O' Donnell in this film she is truly an awesome actor and during the movie you can't help but get a little teary eyed and crack up when your supposed to. I recommend for anyone especially a movie night for the family and/or friends! ~!",
         "This little film has been roundly criticized for being disjointed and amateurish. Well, it _is_ disjointed: part of it is surreal allegory, part realistic morality play. Part of it moves with a natural rhythm while other parts seem to have been transplanted from afternoon TeeVee. Some is done with a cartoon cosmology, and the rest is straight from Marlo Thomas' heart. Distributed throughout are mottles of bad acting and unconsidered dialog. And I loved it all. Why? Because this is in the tradition of movies and books that generate themselves. Rather, the characters in the stories play double duty as the authors of the story and the creators of the world that surrounds it. So it makes sense as precisely what a preteen would imagine her older self writing about her. Indeed, the whole thing is a meditation on how someone might abstract the world (for writing) without a mature faculty for abstraction \u0097 which is to say how a kid would imagine an adult's mind imagining a kid's mind. Its all about the deep problems of writing. I imagine the author of the original book sitting down and having trouble writing, them ruminating about why on the page. Therefore, we have a youthful experimenter, a blocked writer, a \"gardener\" who makes environments from trash, another maker of environments (cages) who craves companionship, a woman who lives in a cage (Kitt), the Dad who is a movie comedian, together with lesser characters. And the spy who spies so she can write what we see. It is all about sight and callow abstraction, just what movies were made for. Sure, it differs from the book because film can amplify what the book cannot. The adapter (the guy that did the game as life as game \"Jumanji\" project) understood this. Ted's Evaluation -- 3 of 3: Worth watching."
      ],
      "genres": [
         "Family",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Nickelodeon Movies",
         "Paramount Pictures",
         "Rastar Pictures"
      ],
      "summaries": ["Harriet M. Welsch is a spy. But when Harriet's friends find her secret notebook the tables are turned on her. Can she win her friends back and still keep on going with the spy business?"],
      "budget": 13000000
   },
   "movielensId": 801,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-07-10",
      "dvdReleaseDate": "2003-05-27",
      "directors": ["Bronwen Hughes"],
      "runtime": 100,
      "movieId": 801,
      "title": "Harriet the Spy",
      "mpaa": "PG",
      "actors": [
         "Michelle Trachtenberg",
         "Rosie O'Donnell",
         "J. Smith-Cameron",
         "Eartha Kitt",
         "Vanessa Lee Chester",
         "Gregory Smith",
         "Robert Joy"
      ],
      "imdbMovieId": "0116493",
      "originalTitle": "Harriet the Spy",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["pV1YuMsPO88"],
      "plotSummary": "When the secret notebook of a young girl who fancies herself a spy is found by her friends, her speculations make her very unpopular! Can she win her friends back?",
      "tmdbMovieId": 38223,
      "avgRating": 3.0304,
      "releaseYear": "1996",
      "numRatings": 1842,
      "posterPath": "/erYGaztkz1tJbmyiB8uLMa9e4ZG.jpg"
   }
}