{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "brain tumor",
            "id": 879
         },
         {
            "name": "telekinesis",
            "id": 5086
         },
         {
            "name": "genius",
            "id": 6257
         },
         {
            "name": "terminal illness",
            "id": 6564
         },
         {
            "name": "doctor",
            "id": 13005
         },
         {
            "name": "psionic power",
            "id": 163543
         }
      ],
      "imdb_id": "tt0117333",
      "video": false,
      "title": "Phenomenon",
      "recommendations": [
         2928,
         9208,
         10326,
         3595,
         10003,
         8012,
         6950,
         11517,
         10328,
         10478,
         2275,
         12154,
         10153,
         12665,
         7007,
         2636,
         9869,
         2614,
         11808,
         1727
      ],
      "backdrop_path": "/dhzAVfv8ZGxC7e0YeejsFsFOhIA.jpg",
      "revenue": 152036382,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "George Malley",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80afff9",
               "name": "John Travolta",
               "profile_path": "/6CKR08ipxM8d2xOB26ja7OlXx7H.jpg",
               "id": 8891,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lace Pennamin",
               "gender": 1,
               "credit_id": "52fe44e3c3a36847f80afffd",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nate Pope",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0001",
               "name": "Forest Whitaker",
               "profile_path": "/4pMQkelS5lK661m9Kz3oIxLYiyS.jpg",
               "id": 2178,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Doc Brunder",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0005",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Prof. John Ringold",
               "gender": 0,
               "credit_id": "52fe44e3c3a36847f80b0039",
               "name": "Jeffrey DeMunn",
               "profile_path": "/n47DHl1RFfSEKUvL0MKGKwrL71S.jpg",
               "id": 12645,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Dr. Wellin",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b003d",
               "name": "Richard Kiley",
               "profile_path": "/gd0wZUwusAdm37LJmetsZnJK7Yw.jpg",
               "id": 26660,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Al Pennamin",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0041",
               "name": "David Gallagher",
               "profile_path": "/kD72ZPZRXv83mCo9qghk0zvVcZf.jpg",
               "id": 59451,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Glory Pennamin",
               "gender": 1,
               "credit_id": "52fe44e3c3a36847f80b0045",
               "name": "Ashley Buccille",
               "profile_path": "/nZEBfTk32jU8rBHmHn85X2roZsH.jpg",
               "id": 106976,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Tito",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0049",
               "name": "Tony Genaro",
               "profile_path": "/zicRnTUBHN5MBr8oQkPk2t1HAyG.jpg",
               "id": 166606,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Banes",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b004d",
               "name": "Sean O'Bryan",
               "profile_path": "/doVNkZLo1aqfRVfUymkjuTpyUYa.jpg",
               "id": 33836,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Roger",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0055",
               "name": "Troy Evans",
               "profile_path": "/74r7ajwva1F0yd6moWljQFfqnnR.jpg",
               "id": 31006,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "FBI Agent Jack Hatch",
               "gender": 0,
               "credit_id": "52fe44e3c3a36847f80b0059",
               "name": "Bruce A. Young",
               "profile_path": "/ty2NwUAAwnn356eTAu7RuSsQlhT.jpg",
               "id": 4943,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Ted Rhome",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b005d",
               "name": "Vyto Ruginis",
               "profile_path": "/dDZyaISuF9FVK18nTmsuDgOpyKl.jpg",
               "id": 61216,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Dr. Bob Niedorf",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0061",
               "name": "Brent Spiner",
               "profile_path": "/gYaOWwycKcSEPQzUOITt9DA5AcY.jpg",
               "id": 1213786,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "5775b006c3a3680906000b6d",
               "name": "Susan Merson",
               "profile_path": "/bNgJ8r9zDyu82hpDBomrhBgN7eB.jpg",
               "id": 1178376,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0051",
               "name": "Michael Milhoan",
               "profile_path": "/y8fS3RInMnUfG0pqz55PAs5xUKq.jpg",
               "id": 154295,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80afff5",
               "name": "Jon Turteltaub",
               "profile_path": "/borF48XTUkOCKE3ryh3BFxe4Unr.jpg",
               "id": 12962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b000b",
               "name": "Gerald Di Pego",
               "profile_path": null,
               "id": 46086,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0011",
               "name": "Phedon Papamichael",
               "profile_path": "/vsALQXJ7XDO3VPwS4kEYtqqLkeV.jpg",
               "id": 432,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e3c3a36847f80b0017",
               "name": "Bruce Green",
               "profile_path": "/yplxWPVgwK1b33AjvbhM9mWX2Aw.jpg",
               "id": 12970,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44e3c3a36847f80b001d",
               "name": "Barbara Boyle",
               "profile_path": null,
               "id": 71324,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0023",
               "name": "Michael Taylor",
               "profile_path": null,
               "id": 17797,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e3c3a36847f80b0029",
               "name": "Charles Newirth",
               "profile_path": "/u2qvWMuOfGazAgfsufIrhjGEe24.jpg",
               "id": 15004,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b002f",
               "name": "Thomas Newman",
               "profile_path": "/nZSsNIrjbkqqxFYwsD3zcHskxdP.jpg",
               "id": 153,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e3c3a36847f80b0035",
               "name": "Jonathan D. Krane",
               "profile_path": null,
               "id": 14093,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5675eacbc3a36816890038b6",
               "name": "Jack Keller",
               "profile_path": null,
               "id": 1551320,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.769996,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9294,
      "vote_count": 403,
      "budget": 32000000,
      "overview": "An ordinary man sees a bright light descend from the sky, and discovers he now has super-intelligence and telekinesis.",
      "similar": [
         40807,
         238615,
         258230,
         336843,
         510,
         277216,
         167,
         7350,
         10312,
         378018,
         9079,
         22824,
         10052,
         24150,
         78383,
         11549,
         7797,
         11821,
         291351,
         27029
      ],
      "original_title": "Phenomenon",
      "runtime": 123,
      "poster_path": "/gsmwDAtdxAUzVyELzvdRavqqVYN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1996-07-05",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Some things in life just can't be explained.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jon Turteltaub"],
      "runtime": 123,
      "synopsis": "This movie is for those of us that believe in a, \"Higher Intelligence,\" but to which doctrine this power, \"holds court\" is left to the observer.",
      "writers": ["Gerald Di Pego"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117333/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwMDA2NzEyMl5BMl5BanBnXkFtZTgwNTA2MjgxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Travolta, Kyra Sedgwick, Forest Whitaker | See full cast and crew »"],
      "reviews": [
         "This movie doesn't get the credit that it deserves. Travolta's speech at the end of the movie to the doctor is incredible. Rarely do I ever see a movie that acknowledges the value of a single human life like this movie does. Most movies glorify sacrifice. This movie glorifies life. I highly recommend it.",
         "An ex-girlfriend talked me into seeing this movie, and I am happy she did. In my opinion, John Travolta deserved at least a nomination for an Oscar here, if not the award itself. The story was decent, but the performances of Travolta, Forest Whitaker, Robert Duvall, and Kyra Sedgwick made me care about what was happening on the screen. By no means is this a romantic comedy. It's romantic, probably the most romantic film I have seen in a long time. The reason for that is simple...it's real. In most movies you see the main characters sleep together within a day at the most, which rarely happens with two people who are really in love. True love has to take time and effort, which is exactly what you see here. Travolta's George is patient, but not because he wants to be. If you're a romantic at heart you will understand and relate to him, and you will hope for his success as you would for your own. Without giving anything away, I will tell you that the ending is sad, but also heartwarming. George has his \"experience\" for no other reason than to suggest what we as humans can become. Phenomenon is a story about our potential, the good and bad things that can happen to us if we achieve it. We could only be so lucky, and watching the movie is a good start. I give it 8 out of 10 stars.",
         "An ordinary small-town man (John Travolta) sees a flash of light in the sky one night and then starts to experience super-intelligence and telekinesis. Soon he is changing everyone's life for the better (most notably love interest Kyra Sedgwick, town doctor Robert Duvall and best friend Forest Whitaker). Slyly funny and innovative at first and then impressively dramatic and thought-provoking, \"Phenomenon\" is an effective picture that comes through because of good performances across the board and smart screen-writing. Travolta and Duvall are excellent together and they share the spotlight in the venture. Under-rated production that should be given a try. It is one of those films that will cause your emotions to come shining through. 4 stars out of 5.",
         "I think any movie that can be described as both (a) a Scientology recruiting pamphlet, and (b) an analogy to Jesus' life has to be a bit out of the ordinary. In some ways, this film reminds me of another seeming science fiction movie that really turned out to be about people's response to the unusual: `Charly' In both films an extraordinary increase in intelligence frightened the people around the main character; they just couldn't deal with it and feared him for it. The love story was a gem. Lacy had obviously been badly hurt by a past relationship, and simply didn't want to encourage George's love. But when he began to be hurt by the way some of his friends treated him, she warmed and opened her heart to him. The way George tried to describe how he looked at things differently and saw relationships that he'd never seen before reminded me of classical descriptions of the act of creativity in many fields. And it's a sad thing but true that we are all capable of concentrating harder and focusing on things to achieve more, but it's very difficult, and more often than not, we tend to take the easier road. Good thought-provoking flick.",
         "My favorite movies are: Pulp fiction, Run Lola Run, Seven, and A Clockwork Orange. So how in the world do I like Phenomenon? It is very well-made (i.e. lighting, direction, editing), excellente acting, and a very strong message. Give it a real chance, and you can't deny that it is at least good. I personally gave it a 9 out of ten, and I'm rarely that generous.",
         "This movie was, without a doubt, one of the finest ever made in a long, long time. I was expecting ti to take a sci-fi route with abductions and vulcan mind-melds...but the ending and explanation for George's predicament are not only plausable but heart-breaking. You cannot help but feel for a like George Malley. I didn't buy into too much of the hyseria surrounding the townsfolk as it seemed a little \"tacked on\"...but the performances by Travolta, Duval, Kyra Sedgwick and Forrest Whitaker made up for any shortcomings and plot holes. I have watched this movie time and time again and the combination of true emotional drama and a beautiful score nearly bring me to tears everytime. 9 out of 10.",
         "When I saw this movie in the theater, I was on a first date with a nice lady. However, she appeared to not be moved by the movie and showed no emotions at all, not even one tear. Seeing as how this movie is a real tear jerker, I thought she was not my kind of women. I have seen this movie about 10 times (or so) and never tire of it. Absolutely wonderful. Great casting, writing, directing and acting. Everyone involved is at their very best! Truly a \"must see\" movie. John Travolta was superb here and Kyra Sedgewick was at her very best! This movie is pure magic. It made me cry happy and sad tears. Truly a remarkable achievement. Enjoy.",
         "Phenomenon is a story about energy that is in everything and everyone. It's a very subtle and philosophical film that expresses more than meets your senses. It goes right for your heart and stays there. One might argue that it is a very \"sugarsweet\" tale of the things that make life (worthwhile), but there is so much more to it. The heart of the matter is that nothing goes to waste in the universe. Everything is on it's way to somewhere all the time. Energy will manifest itself without getting tired. Things, bodies, thoughts, even love, are all vessels that are secondary to the spirit that drives them. This sounds all very vague and maybe even religious-like. But indeed some things are hard to explain. Questions are often a waste of time. So don't ask where all this energy originates from. Phenomenon will not provide the answer, at least it is not pretentious in that direction because the makers realize that the human-mind is unfit to grasp this in the first place. Phenomenology is the philosophical school that investigates how things appear in the world. The film shows that it is often slightly or profoundly different from how it looks at first hand. I enjoyed the simple way of presenting this very complicated message that matters to all of us and everything else too.",
         "\"Phenomenon\" is about a small town auto mechanic (Travolta) who experiences something he can only describe as being \"light\" and suddenly has peculiar powers such as being able to learn to speak Portuguese in 20 minutes or understanding Dianetics. At issue is, will these powers, which make him the object of fear and awe by the townsfolk, help of hurt his chances with his reluctant love interest (Sedgwick). An pleasant little folksy, Mayberry RFDish flick, \"Phenomenon\" sticks to the people story and doesn't go off into sci-fi-land as it conjures up the warm and fuzzies, takes a romantic turn with the best haircut & shave since \"Wrestling Ernest Hemingway\", and tries hard to deliver a message about what's important in life. Yes, the film gets a little sugary sweet but...okay, it gets a lot sugary sweet...but, if you go with it and don't fight it you'll be assured of a pleasant three star watch. Good stuff for sentimentalists. (B)",
         "I'm not usually inspired to review your average hollywood fare, but I was moved by this film. Not only did it portray dramatic tension between one who is experiencing 'supernatural' awareness and their hokey, small-town friends, but Phenomenon also gains rank by being one of the first few films with a completely 'open mind.' I attribute its existence to the film Powder, which came out a few years ago, and I am honestly looking forward to more innovative dramas in a similar vein. It will probably not become a classic, but it deserves to be seen in its time. Perhaps the honesty of this film will inspire other, greater filmmakers with more influence to change their ways and provide more thinking elements in their films. Watch it with a loved one on a Saturday night. A good alternative to show those boyfriends who are caught up in their own male-ness. Try this before plopping in Gone with the Wind. It may bridge the gap."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Krane Entertainment"
      ],
      "summaries": [
         "John Travolta plays George Malley, who owns the local auto repair shop in a small California town. After celebrating his birthday with friends at the local bar/hang-out, George heads for home. He pauses to watch a strange light in the sky, then collapses for a few seconds in the middle of the deserted street. In the days and weeks that follow, George finds his IQ and consciousness expanding dramatically, and develops telekinetic abilities. Despite his attempts to explain what has happened to him, with just a very few exceptions, most of the local townspeople treat the \"new\" George as a freak. His state of isolation becomes even more pronounced when his new-found abilities allow him to correctly predict an earthquake, and outside authorities become interested in what's happened to him.",
         "The main character observes a strange light on his birthday at a bar. The following days he becomes very intelligent and puts the intelligence to good use in his community. When word gets around he becomes known as a freak and everyone wants to figure out why this happened to a car mechanic. The government also wants to get their hands on it to put it to other uses.",
         "An ordinary man sees a bright light descend from the sky, and discovers he now has super-intelligence and telekinesis."
      ],
      "budget": 32000000
   },
   "movielensId": 802,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-07-05",
      "dvdReleaseDate": "1997-12-03",
      "directors": ["Jon Turteltaub"],
      "runtime": 123,
      "movieId": 802,
      "title": "Phenomenon",
      "mpaa": "PG",
      "actors": [
         "John Travolta",
         "Kyra Sedgwick",
         "Forest Whitaker",
         "Robert Duvall",
         "Jeffrey DeMunn",
         "Richard Kiley",
         "David Gallagher",
         "Ashley Buccille",
         "Tony Genaro",
         "Sean O'Bryan",
         "Troy Evans",
         "Bruce A. Young",
         "Vyto Ruginis",
         "Brent Spiner",
         "Susan Merson",
         "Michael Milhoan"
      ],
      "imdbMovieId": "0117333",
      "originalTitle": "Phenomenon",
      "genres": [
         "Drama",
         "Fantasy",
         "Romance",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["H3woaPZowmM"],
      "plotSummary": "An ordinary man sees a bright light descend from the sky, and discovers he now has super-intelligence and telekinesis.",
      "tmdbMovieId": 9294,
      "avgRating": 3.46738,
      "releaseYear": "1996",
      "numRatings": 14637,
      "posterPath": "/gsmwDAtdxAUzVyELzvdRavqqVYN.jpg"
   }
}