{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "taxi",
            "id": 444
         },
         {
            "name": "ex-girlfriend",
            "id": 1595
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "bride",
            "id": 3582
         },
         {
            "name": "broker",
            "id": 5628
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "wedding",
            "id": 13027
         }
      ],
      "imdb_id": "tt0117628",
      "video": false,
      "title": "She's the One",
      "recommendations": [
         9413,
         16388,
         17127,
         9962,
         18169,
         10563,
         12658,
         23531,
         10154,
         23570,
         77469,
         33657,
         4967,
         10468,
         2800,
         8998,
         9844,
         9283,
         14578,
         10660
      ],
      "backdrop_path": "/n2o4yRQ4chOpgk2bHaxlrFakOxG.jpg",
      "revenue": 9482579,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mickey Fitzpatrick",
               "gender": 2,
               "credit_id": "52fe44319251416c7502bf89",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Francis Fitzpatrick",
               "gender": 2,
               "credit_id": "52fe44319251416c7502bf8d",
               "name": "Michael McGlone",
               "profile_path": "/rB2uLTM2xh2O2aKri8OgPDKM0tK.jpg",
               "id": 69298,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Heather Davis",
               "gender": 1,
               "credit_id": "52fe44319251416c7502bf91",
               "name": "Cameron Diaz",
               "profile_path": "/ahFkUN9Sm8oF1txUHE5JcJ95Ere.jpg",
               "id": 6941,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Renee Donati Fitzpatrick",
               "gender": 1,
               "credit_id": "52fe44319251416c7502bf95",
               "name": "Jennifer Aniston",
               "profile_path": "/4d4wvNyDuvN86DoneawbLOpr8gH.jpg",
               "id": 4491,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Mr. Fitzpatrick",
               "gender": 2,
               "credit_id": "5427f64dc3a3680b1b002324",
               "name": "John Mahoney",
               "profile_path": "/jK2uDKxfysuYjNAgUxbwyhd4fKD.jpg",
               "id": 4251,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Hope",
               "gender": 1,
               "credit_id": "5427f670c3a3680b21002291",
               "name": "Maxine Bahns",
               "profile_path": "/vI2TFKHuz9DTgQunzcrV9qJI7yc.jpg",
               "id": 21398,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Connie",
               "gender": 1,
               "credit_id": "5427f686c3a3680b28002260",
               "name": "Leslie Mann",
               "profile_path": "/epM29FmcrLX5HaFIKYChr7wL4gM.jpg",
               "id": 41087,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Molly",
               "gender": 1,
               "credit_id": "5427f690c3a3680b310022d2",
               "name": "Amanda Peet",
               "profile_path": "/81KzrntoeEztNpfhCYNgfOtI3kU.jpg",
               "id": 2956,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44319251416c7502bf9b",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44319251416c7502bfa1",
               "name": "Ted Hope",
               "profile_path": null,
               "id": 5952,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44319251416c7502bfa7",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44319251416c7502bfad",
               "name": "Edward Burns",
               "profile_path": "/lwFncQkXtJ9pCNMjl464F1bJ0eh.jpg",
               "id": 12833,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44319251416c7502bfb3",
               "name": "Frank Prinzi",
               "profile_path": null,
               "id": 56906,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44319251416c7502bfb9",
               "name": "Susan Graef",
               "profile_path": null,
               "id": 39983,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44319251416c7502bfc5",
               "name": "Tom Petty",
               "profile_path": "/aCK0M7nRk8kRF0WVOZ5b0OrWZt5.jpg",
               "id": 60642,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "584a9978c3a368141401f625",
               "name": "James Schamus",
               "profile_path": "/9E0gGd0rhOZyMnBAeIqFfCAPqzn.jpg",
               "id": 1617,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.864789,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11363,
      "vote_count": 87,
      "budget": 3500000,
      "overview": "Mickey, a free-spirited New York cabbie, and Francis, a materialistic Wall Street stockbroker, are extremely competitive and confused about women as a result of their father's influence. Though they disagree about everything, they have one thing in common: Mickey's ex-fiance Heather is Francis's secret love. Though both brothers have beautiful wives, Heather triggers their longtime sibling rivalry",
      "similar": [
         10330,
         858,
         10054,
         1826,
         712,
         298312,
         1903,
         8273,
         112160,
         425,
         319,
         164,
         637,
         2288,
         2064,
         4347,
         11012,
         1075,
         6557,
         12220
      ],
      "original_title": "She's the One",
      "runtime": 96,
      "poster_path": "/qGOpJLWCncOt5EIz39N8q7O45X.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
         "name": "Fox Searchlight Pictures",
         "id": 43,
         "origin_country": "US"
      }],
      "release_date": "1996-08-26",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "A romantic comedy about two brothers... and the one thing that came between them.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Edward Burns"],
      "runtime": 96,
      "synopsis": "The film tells the story of Irish-Catholic Fitzpatrick brothers, Mickey (Edward Burns) and Francis (Mike McGlone) and the tribulations of love, family and betrayal. Mickey is a New York City blue-collared taxi driver, unhappy over an act of infidelity committed by Heather (Cameron Diaz), his ex-fiancée. Francis is a white-collared Wall Street stock investor, who unknown to his wife, Renee (Jennifer Aniston), is having an affair. During weekends, Mickey and Francis visit their parents who live on Long Island. Their mother is never seen on screen, while they have better time interacting with their father, Frank (John Mahoney), whom is a emotionally bereft conservative man as well as an old-school sexist and a bigot whom takes them out fishing on his motorboat, but refuses to let women on board due to family tradition. Frank always gives Mickey and Francis advice to live out their lives any way they can and to always go for what drives them to succeed. While driving his cab one day, Mickey picks up Hope (Maxine Bahns), a young woman and NYU art student with whom he becomes infatuated and impulsively marries that same week despite knowing her only a few days. Mickey and Hope show up one evening at Francis and Renee's apartment to inform them of their quickie marriage. This causes consternation for his brother, largely because he was not asked to be best man at the wedding. Mickey moves in with Hope, but later becomes disillusioned with aspects of her liberal and free-spirited lifestyle, including frequent power cuts in their ramshackle apartment. Francis is also having problems in his marriage. He is concerned that he is being unfair to Heather, his mistress, the very same woman Mickey left, by continuing to stay with Renee. At the same time, Renee's family, especially her younger sister Molly (Amanda Peet) suggests the problem with Francis' lack if interest in her is that he may be gay, so she has Mickey and his father confront him about it. He denies being gay, but admits to being unfaithful. Meanwhile, Francis' arrogance leads him to take potshots at his brother for the apparent lack of forward progression in his life with his new wife, while Francis argues with Heather about her own sexual infidelity with a much older man referred to as \"Papa\". One day, Mickey picks up Heather in his cab and goes up to her apartment to retrieve a television that belonged to him during their relationship. Heather responds by demanding Mickey's watch, which she purchased as a gift. Mickey relents, which she implies she wants more from him, but he does not reciprocate, instead reminds her of her affair, and her previous profession. Throughout all this, Mickey and Francis' father offers more egoistical and selfish advice to them. Then Frank learns, during a fishing trip with the church's pastor, that his supposedly highly religious wife hasn't been to Church Mass in months. On a visit to his mistress's apartment, Francis learns that Mickey and Heather have recently met. Francis makes an unexpected visit to his brother's apartment and questions Mickey about his visit with Heather. They get into an argument over whether or not Mickey had sex with Heather. Later, Mickey discovers that she is the woman Francis has been having an affair with. The revelation escalates to an argument in their parents' home, during a birthday dinner for their father. In an attempt to settle the dispute, Frank takes both Francis and Mickey outside and ties boxing gloves on each, with the intent of having them fight out their differences. Mickey proves the victor. Eventually, Francis confronts Renee about his affair and files for divorce, in order to marry Heather. When Mickey finds out about the impending marriage, he informs Francis that Heather was once a prostitute during her college days. This causes Francis to get cold feet and it angers Heather. She tells Mickey that she thought that he didn't have a problem with her prior choice of employment, and Mickey says that he doesn't, but Francis may, and that he has a right to know. Meanwhile, Hope has already dropped a bomb on Mickey: she is moving to Paris very soon to attend art school and Mickey is not sure about whether or not to join her. On a visit to the bar where Hope works, Mickey has a talk with Connie (Leslie Mann), one of Hope's co-workers, who claims to have had a \"special relationship\" with Hope before the marriage. This troubles Mickey so much that he begins to avoid Hope. Later, Hope tells Mickey that she is unsure if he should come to Paris after all and admits to having a \"semi-lesbian affair\" with Connie some years back. As a result, Mickey and Hope's relationship appears to be about to break up. Due to Francis' indecision over marriage in light of the news that Heather was a prostitute, Heather decides to leave him and marry \"Papa\", the wealthy older man she has been seeing concurrently while she was with Francis. When Francis threatens to tell Papa that Heather was a prostitute, Heather tells Francis that Papa was \"her best customer\". He then calls Renee in hopes of getting back together with her. But she is already in another relationship with Scott Sherman, a overweight mutual acquaintance whom Francis had made fun of in an earlier scene. In the final scenes of the film, Mickey and Francis meet with their father at his house where the distraught Frank tells them that their mother had just left him the previous day and has run off with a dry-cleaning store owner whom she has been having an affair with for several months. Unsure about everything now, Frank finally apologizes to Mickey and Francis for giving them bad advice about life and love when his own wife was cheating on him behind his back. As a result, the three men decide to go out fishing aware that despite the failure of their love lives, they will always have each other. As they prepare the motorboat to cast off, only Mickey decides it would be better if he tried to have one last talk with Hope before she leaves America. Only their father has arranged a surprise guest - Hope. The movie ends with Hope asking to drive the boat, but Frank, aware that women are not allowed on board, says it is too soon for that.",
      "writers": ["Edward Burns"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117628/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MDA1MjM0OV5BMl5BanBnXkFtZTcwMjE0MDYxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Edward Burns, Jennifer Aniston, John Mahoney | See full cast and crew »"],
      "reviews": [
         "A fast-moving and nimble comedy with witty dialogue, an intelligent script, well-developed characters and a credible ethnic ethos. It's unpretentious and amiable, yet truly acerbic when it needs to be. The acting is mostly first-rate. Well done, Burns! (I guess all of this will make the delayed-maturity stratum of movie fans truly averse to this movie...)",
         "I'm not sure why I've rented this film 3 times in the last couple of years. The characters are well developed, Tom Petty's sound track is very good and there are the gorgeous gals of course (Diaz, Anniston, Bahns), but there's more to it. This is an excellent, but perhaps not classic, drama posing as a romantic comedy. It's about morality and responsibility in a time when there is no morality and responsibility.. about love and family in a time when the definition of these words has become blurred. It cuts pretty close to home at times.. and there are those beautiful women.",
         "I found this movie to be hilarious, I actually laughed out loud by myself! \"Come on Dorothy, it's all over\"! Hahahahaha, the repartee is fast and funny between the Fitzpatricks. Not to mention there are so many 'hot' babes in this movie. I vaguely recall somewhere in the back of my memory that I may have seen this movie before, but even if I had it doesn't matter because the laughs were fresh, new and satisfying. The almost 'infantile' banter between the brothers is genuinely hilarious. John Mahoney plays a very convincing role as the dubious patriarch who sees his boys as if they were perpetually 12 years old. The funniest part of it is, the boys unconsciously and unwittingly play right into his hands, at every twist and turn of the dialogue. Tune into this flick for some hearty laughter, silly shenanigans and some surprising plot twists.",
         "Edward Burns is to be admired for directing this (in places) wonderful \"slice of life\", examining the intricacies of relationships, the ideas of romantic love and sibling rivalry. The family unit (Mike McGlone, Edward Burns, John Mahoney) is excellently conveyed. The father and younger brother (an impressive performance from both the actors) display (initially) a rampant misogynist, a far cry from the character Edward Burns plays. The cast is rounded off with a very good Jennifer Aniston as the cheated-against wife, who has her \"needs\", not fulfilled sexually, a beautiful and contained Maxine Bahns and a vulnerable and (at the same time) brittle and almost defiant Cameron Diaz. It's a good movie, with good acting, and good lines.As in all Romantic Comedies, the story is quite predictable. However, it's an engaging film, and involves the viewer. Recommended",
         "This is definitely one of my favorites! Very funny, Very well done. was laughing throughout the movie..especially the \"family matter\" backyard boxing! Hilllarious! Other favorite scenes include, Jennifers family discussion about the possibility of her husband being GAY!, \" Ecxuse me!, My husband is not Gay\" she exclaimes!. \"You know he does wear that cologne\" her Dad says. Great scene. Also... the Limo ride with the butler... \"its a new day my man\", \"Today is the first day of my new life\" \"how do I look?\" And... as he exclaims to Cameron Diaz \"Maybe he loves you because your young blonde and beautiful and he's got one foot in the grave!\" as he describes \"grandpa\".",
         "Ed Burns wrote, directed, stars in \"She's The One.\" After breaking up with his girl (Diaz) he is giving a taxi ride to a young lady (Bahns) and within 24 hours they are married. Destined to fail, right? Meanwhile his younger brother seizes the opportunity and cheats on his wife (Aniston) to begin an affair with Diaz, who worked her was through college as a hooker. This film is mainly about the relationships between the two brothers and their father. After Diaz marries a rich old guy, young brother cannot salvage his broken relationship with Aniston, rightly so. After first being hesitant to follow his new wife to Paris for school, Burns realizes his error, the film ends with the three men and the young wife heading out on the boat, going fishing, a break in the family tradition of \"men only\" fishing trip. This is symbolic of the changed way the three of them look at life and relationships, coming on the heels of dad finding out mom wasn't going to church each morning a 8AM, but fooling around with the old hardware store man who simply admired her and gave her attention. This is a subtle film, speaks volumes about relationships and our obligation to do the right thing. Not a great film, but good. In the story Bahns was from Vermont, and she really is from Vermont. In the film she became Burns' wife, while in real life they were dating. She was going to France, and in real life she speaks fluent French. Jennifer Aniston, Amanda Peet, Cameron Diaz were all still relatively unestablished in film, and that was what allowed them to fit into the salary cap for this film. I don't think Burns will ever become known as a great writer/director, but his films are honest and in that he has a lot going for him.",
         "This movie doesn't depend on special effects, or high profile stars (no offense)to grab you and bring you inside the story. It actually has a plot! Something which is sadly missing in some of the big, flashy, \"premise\" movies today. The dialogue is witty and down to earth. It has a smatterring of the great tongue in cheek comments you wish you could use as a retort in real life. Burns constructs some great cut-aways from one conversation to another. This is a great movie that gets better every time you watch it. I would recommend this to anyone who doesn't require a car crash, gun fire, or an explosion every few minutes to hold their attention. Some of the subject matter limits the audience to adults, but send the kids to grandma's house and enjoy this one.",
         "I can't believe this movie has only a 6 rating. I thought it was entertaining as all hell and John Mahoney would be worth the whole movie, but doesn't need to be as all the other characters come through vibrantly. The relationship between the brothers is great, so textural, and Jennifer Aniston is priceless. But still in all, I go back to John Mahoney and the subplot between him and his wife (who we never actually see). That entire scenario was priceless and hysterical. A great film that shows Ed Burns really is a talent as a writer and director. I give it a much higher rating then what it ranks at as a whole right now.",
         "You have to see this movie. It's one of the best romantic comedies ever; the story is great, the performances are solid,and the dialogue is amongst the wittiest I have ever seen on screen. What more can I say, I've already seen it seven (or something like that) times and each time I get as ecstatic as the first. This is a must-see! I give it 9/10!",
         "This is a great movie, Edward Burns did a great job. It is a great story with great characters. It also has an amazing amount of beautiful women in it (Diaz, Aniston, Bahns, Peet, and Mann). This movie is on Comedy Central all the time and is worth watching just for these amazing women, not to mention it really is a good movie. I highly recommend it."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Good Machine",
         "Marlboro Road Gang Productions",
         "South Fork Pictures"
      ],
      "summaries": [
         "How do siblings deal with each other in their targets? This is the question tackled in this movie. Blue-collared Mickey drives a New York taxicab since the breakup with his promiscuous ex-fiancée Heather two years ago. His younger, white-collared brother, Francis, cannot let Mickey forget the tragedy of the \"hairy ass\": (Mickey's image of his apartment floor of the guy having sex with Heather after walking in on them). Finding relief in driving his cab, Mickey meets an art student named Hope whom he marries after knowing her for only 24 hours. Mickey also meets his old lover Heather, and learns more about life itself as taxi fares in the course of a summer. Francis, a young Wall Street corporate raider, unhappy in his marriage to Renee and led by his infidelity, continues his shots at Mickey throughout the film, only to find himself a plot device that lends humor and lessons about marriage and brotherhood when he meets and starts an dangerous affair with Heather, despite Mickey's warnings that Heather is a gold-digging nymphomaniac who goes through sexual partners as often as a person changes clothes. Given Mickey's frame of reference on the past and his bride of 24 hours, it is no wonder that the two brothers, along with their father, an ego-eccentric and emotionally bereft bigot and a hard-core chauvinist who does not allow women aboard his fishing boat, learn about the strength of women, and their own lives.",
         "Two Irish-American brothers. Mickey, the older, hippie-like, lost, not knowing what he wants. The younger brother, Francis, a Wall Street power player with a beautiful wife named Renee, rich. Unfortunately, Francis is having an affair with Mickey's promiscuous ex-fiancée Heather. Mickey meets and marries a girl, named Hope he's known for 24 hours, while Francis dumps Renee to ask Heather to marry him... not realizing that Mickey was right about her.",
         "The love lives of two brothers, Mickey and Francis, interconnect as Francis cheats on his wife with Mickey's ex-girlfriend, while Mickey impulsively marries a stranger."
      ],
      "budget": 3500000
   },
   "movielensId": 804,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1996-08-26",
      "dvdReleaseDate": "2000-10-03",
      "directors": ["Edward Burns"],
      "runtime": 96,
      "movieId": 804,
      "title": "She's the One",
      "mpaa": "R",
      "actors": [
         "Edward Burns",
         "Michael McGlone",
         "Cameron Diaz",
         "Jennifer Aniston",
         "John Mahoney",
         "Maxine Bahns",
         "Leslie Mann",
         "Amanda Peet"
      ],
      "imdbMovieId": "0117628",
      "originalTitle": "She's the One",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["mIvoJ2_8X5I"],
      "plotSummary": "Mickey, a free-spirited New York cabbie, and Francis, a materialistic Wall Street stockbroker, are extremely competitive and confused about women as a result of their father's influence. Though they disagree about everything, they have one thing in common: Mickey's ex-fiance Heather is Francis's secret love. Though both brothers have beautiful wives, Heather triggers their longtime sibling rivalry",
      "tmdbMovieId": 11363,
      "avgRating": 3.07985,
      "releaseYear": "1996",
      "numRatings": 2367,
      "posterPath": "/qGOpJLWCncOt5EIz39N8q7O45X.jpg"
   }
}