{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116823",
      "video": false,
      "title": "Larger Than Life",
      "recommendations": [
         27141,
         83489,
         20551,
         20096,
         26180,
         26261,
         41579,
         38554,
         18862,
         40562,
         10879,
         12656,
         38916,
         31633,
         17745,
         27985,
         15170,
         42158,
         26202,
         25697
      ],
      "backdrop_path": "/wVHq3fNyrblrbM7ZbDjtXehAn0V.jpg",
      "revenue": 8315693,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Corcoran",
               "gender": 2,
               "credit_id": "52fe45599251416c9102f361",
               "name": "Bill Murray",
               "profile_path": "/7BOoOAIA1CnSzFSVSJP7saniQaB.jpg",
               "id": 1532,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Vera",
               "gender": 0,
               "credit_id": "5324b15e92514113b9000b77",
               "name": "Tai the Elephant",
               "profile_path": null,
               "id": 201868,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Walter",
               "gender": 2,
               "credit_id": "5324b16f9251410d95000bc8",
               "name": "Jeremy Piven",
               "profile_path": "/qtho4ZUcValnVvscTGgyWfUr4VP.jpg",
               "id": 12799,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mo",
               "gender": 1,
               "credit_id": "5324b17d9251411708000bb3",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Vernon",
               "gender": 2,
               "credit_id": "5324b18a925141652a000941",
               "name": "Pat Hingle",
               "profile_path": "/bW8alHCKEK0UOJjoZwjwwH7T0ga.jpg",
               "id": 3798,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Terry Bonura",
               "gender": 1,
               "credit_id": "5324b19d9251411544000b60",
               "name": "Linda Fiorentino",
               "profile_path": "/aKadq5uC9CjCKtkMYPYECNcGz3s.jpg",
               "id": 9625,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tip Tucker",
               "gender": 2,
               "credit_id": "5324b1ac9251411f8500661f",
               "name": "Matthew McConaughey",
               "profile_path": "/jdRmHrG0TWXGhs4tO6TJNSoL25T.jpg",
               "id": 10297,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Hurst",
               "gender": 2,
               "credit_id": "5324b1b99251411544000b64",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Wee St. Francis",
               "gender": 2,
               "credit_id": "5324b1c99251411708000bb8",
               "name": "Tracey Walter",
               "profile_path": "/pMeImyAZ8fpQ32QyPO8g6W8gs13.jpg",
               "id": 3801,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Trowbridge Bowers",
               "gender": 2,
               "credit_id": "5324b1eb9251410d95000bd7",
               "name": "Harve Presnell",
               "profile_path": "/hH4HYzCa5BzWxOs76HQnDBOKe4c.jpg",
               "id": 3907,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45599251416c9102f367",
               "name": "Howard Franklin",
               "profile_path": "/fio3AI3ApZYclhP59vf8tMZNooC.jpg",
               "id": 2357,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5324b1ff9251410c87000bdb",
               "name": "Roy Blount, Jr.",
               "profile_path": null,
               "id": 112167,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5324b2109251411708000bbb",
               "name": "Pen Densham",
               "profile_path": null,
               "id": 2182,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5324b21e9251410c87000bdd",
               "name": "Garry Williams",
               "profile_path": null,
               "id": 567311,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5324b22d92514113b9000b80",
               "name": "Pen Densham",
               "profile_path": null,
               "id": 2182,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5324b23b92514113b9000b82",
               "name": "Richard Barton Lewis",
               "profile_path": null,
               "id": 2184,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5324b24e9251410c87000bdf",
               "name": "John Watson",
               "profile_path": null,
               "id": 2185,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5324b25b9251411708000bc8",
               "name": "Miles Goodman",
               "profile_path": null,
               "id": 63964,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5324b26792514113b9000b87",
               "name": "Elliot Davis",
               "profile_path": null,
               "id": 5506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5324b2759251410c87000be4",
               "name": "Sidney Levin",
               "profile_path": null,
               "id": 2588,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5324b2829251411544000b6b",
               "name": "Marcia Hinds",
               "profile_path": null,
               "id": 1197918,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.590218,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34170,
      "vote_count": 47,
      "budget": 30000000,
      "overview": "Motivational Speaker Jack Corcoran is determined to get his career off the ground, but the biggest gigs he can get are the ones nobody wants. Then one day, he receives a telegram that his circus clown father has passed away, and has left a \"huge\" inheritance. When he gets there, he finds that his inheritance has come in the form of an elephant that was his father's pride and joy in circus acts. His main intention is to sell the pachyderm off. Jack must choose between loud and rude zookeeper Mo or attractive animal show owner Terry. As the two treks through the country Jack and the elephant develop a bond, and it changes his approach on life for the better.",
      "similar": [],
      "original_title": "Larger Than Life",
      "runtime": 93,
      "poster_path": "/hrnStoGvCyJT4vvIWinTlt8fNVG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Trilogy Entertainment Group",
            "id": 2231,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Majestic Films International",
            "id": 2630,
            "origin_country": ""
         }
      ],
      "release_date": "1996-10-31",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "He's got 5 days to go coast-to-coast. (There's just one BIG problem.)",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Howard Franklin"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Roy Blount Jr.",
         "Pen Densham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116823/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODM0NzY3NjcyM15BMl5BanBnXkFtZTcwODYzNzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bill Murray, Matthew McConaughey, Jerry Adler | See full cast and crew »"],
      "reviews": [
         "I would probably have given up on this movie had it not been showing in the middle of the night against infomercials and test patterns. It takes about 30 minutes before it really gets going, when Bill Murray and Vera hit the road. Bill Murray's performance is serviceable if unspectacular; it's a rather underwritten role that could have been played by most anyone, but the low-wattage version of Murray's charm does come through from time to time. Janeane Garofalo is well-used in a small role, but Matthew McConnaughey makes the most vivid impression in truly goofy part as an insane truck driver. Except for exposition, the first quarter or so of the film is dull, but the rest makes for pleasant if low-key entertainment. The \"relationship\" between man and elephant is genuinely touching.",
         "As with most animal/comedian movies, I thought this one would be a bomb. However, it wasn't as bad as I expected. The plot is decent and the funny parts are mostly funny, instead of just stupid. Kids and adults both will enjoy the elephant and the occasional outdoor scene, as Bill Murray and his new friend trek across the beautiful American countryside. This movie also touches on serious topics like animal abuse. Bill Murray is funny as usual and Matthew McConaughey puts in an unusual and funny performance. This movie isn't going to win any Oscars, but provides good entertainment, without resorting to sex or violence. I gave it 7 out of 10.",
         "I really liked this movie. It shows how much fun an elephant can be. I also liked Bill Murray in this. After I saw him in Ghostbusters and other movies I really wanted to see Larger Than Life. Also I think Bill Murray is good at comedy comedy not the stupid comedy that Adam Sandler gives you in Little Nickey. All and all I like the actors and the elephant in this movie so I give it a ten.",
         "I think, if you take a moment, you can actually see that this movie is an interesting metaphor for the grieving process. Grief can be seen as a big uncontrollable thing that you didn't even know was yours until you have it laid in your lap. Then you have to figure out what to do with it, maybe make friends with it. Maybe find some way to control it. And, eventually, you have to give it up.",
         "I remember seeing this movie with my Aunt a little after it came out in the theaters. We were the only people in the place and that shocked us because it turned out to be a very good movie. I remember saying to her that it was a good thing nobody else was there because we laughed as loud I ever have. I haven't seen it since then but I would love to see it again and find out if it is on DVD. It surprises me that this isn't at any of the rental places I have been to, including the almighty blockbuster. I think I was about 19 at the time it came out. This would be a great family movie too. I recommend seeing this. It is very underrated.",
         "Bill Murray is a comedic genius. His demeanor is hilarious. He is the driving force of this movie. Even though this movie is meant for kids, I enjoyed it thoroughly. I wish they would release it on DVD, but Disney is funny about what they put out on DVD. If you enjoy a good guffaw, watch this movie.",
         "Jack Corcoran is an inspiration speaker who is trying to get his career moving to get the bigger gigs after having a best selling book. He bases his theory on his ability to get over his father's death just before his birth. He is surprised to find his father has just died and has actually left him an inheritance. He travels out to collect to find that his father was a clown and his inheritance is substantial -\u0096in fact she's an elephant. Now he has less than a week to get across country to deliver the elephant to one of several interested parties. Around about this period Bill Murray films kinda sunk to a bit of a low in terms of money making and quality. One thing has kept him a star however and that's himself \u0096 even an average film can be made enjoyable by him, and that's what happens here. The plot is predictable \u0096 who will he give the elephant to, the evil trainer or the jungle bunny? Will he make it in time? The answers are easy, but no matter. The message about loving animals etc are a little sentimental and don't sit well with the idea that we are actually watching an animal that belongs to a movie organisation such as the one being shown here as evil! The comedy is also predictable \u0096 we know the elephant will knock things down and lift things up etc, but it's not overdone and is amusing to a point. It may not be rocket science but it will please kids for sure. For adults the physical nature of this comedy is tempered by a world weary Murray who really does make the film worth watching. He is a funny guy and although he is on auto-pilot here, he is still very good. The film rests solely on his shoulders and he just about carries it off. The rest of the cast may well be made of faces but they are all in minor roles. People like Piven, Garofalo, Fiorentino, Jerry Alder, Presnell etc are all round the edges making it look tidy but really do little. McConaughey has a bigger, minor role but he isn't very good. His character is funny but he doesn't quite carry it off and I wonder if he is embarrassed by it now. Overall this sort of thing usually stinks the place up, and this one doesn't. It's nothing special but is amusing enough to pass the time. This is mainly due to Murray doing his usual world-weary cynical act \u0096 we've seen it before but that doesn't mean it's not still funny.",
         "I thought it was Great, as an animal film and as a comedy. I laughed for the bulk of it, and nearly cried at the end (it's nothing near drama, I'm just weird). Perhaps it got a little sappy at times, but never 'so-sappy-you-could-die' and was never vulgar, hurray! I suppose I could go into all the themes and merits of this movie, but I'll just suggest you go see it.",
         "Jack Corcoran (Bill Murray) is a struggling motivational speaker. When he gets a telegram that his absentee circus father had passed away, he doesn't know that he left him a giant elephant and $35k in damages. Now he must figure out what to do with the elephant, and how to get to California. He could get $30k with Mo (Janeane Garofalo) who's sending elephants to Sri Lanka for a breeding problem, or at least $40k to Terry (Linda Fiorentino) who has an animal circus. It was probably a hilarious pitch to put Bill Murray with an elephant. I just don't know what they said to Bill to get him to do the movie. The biggest problem is that the whole story is really stupid. It's setup like a ridiculous sitcom. Bill has a few cute moments but it is mostly sad to see him fall so low. Matthew McConaughey puts in a ridiculous performance as a wild and crazy trucker.",
         "This movie has several things going for it. The writing is wonderful, the plot is wonderful, the acting is wonderful. And who ever trained the elephant has to be commended. VERA can do anything. This is also a great film for kids. Also, don't miss Tip Tucker, what a riot."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "United Artists Pictures",
         "Trilogy Entertainment Group",
         "RCS"
      ],
      "summaries": [
         "Motovational Speaker Jack Corcoran is determined to get his career off the ground, but the biggest gigs he can get are the ones nobody wants. Then one day, he receives a telegram that his circus clown father has passed away, and has left a \"huge\" inheritance. When he gets there, he finds that his inheritance has come in the form of a elephant that was his father's pride and joy in circus acts. His main intention is to sell the pacaderm off. Jack must choose between loud and rude zookeeper Mo or attractive animal show owner Terry. As the two trek through the country Jack and the elephant develop a bond, and it changes his approach on life for the better.",
         "A motivational speaker discovers that the inheritance his father left for him is in the form of an elephant."
      ],
      "budget": 30000000
   },
   "movielensId": 813,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-31",
      "dvdReleaseDate": "2003-02-04",
      "directors": ["Howard Franklin"],
      "runtime": 93,
      "movieId": 813,
      "title": "Larger Than Life",
      "mpaa": "PG",
      "actors": [
         "Bill Murray",
         "Tai the Elephant",
         "Jeremy Piven",
         "Janeane Garofalo",
         "Pat Hingle",
         "Linda Fiorentino",
         "Matthew McConaughey",
         "Keith David",
         "Tracey Walter",
         "Harve Presnell"
      ],
      "imdbMovieId": "0116823",
      "originalTitle": "Larger Than Life",
      "genres": [
         "Family",
         "Comedy"
      ],
      "youtubeTrailerIds": ["I4xX5vuxOaY"],
      "plotSummary": "Motivational Speaker Jack Corcoran is determined to get his career off the ground, but the biggest gigs he can get are the ones nobody wants. Then one day, he receives a telegram that his circus clown father has passed away, and has left a \"huge\" inheritance. When he gets there, he finds that his inheritance has come in the form of an elephant that was his father's pride and joy in circus acts. His main intention is to sell the pachyderm off. Jack must choose between loud and rude zookeeper Mo or attractive animal show owner Terry. As the two treks through the country Jack and the elephant develop a bond, and it changes his approach on life for the better.",
      "tmdbMovieId": 34170,
      "avgRating": 2.77174,
      "releaseYear": "1996",
      "numRatings": 506,
      "posterPath": "/hrnStoGvCyJT4vvIWinTlt8fNVG.jpg"
   }
}