{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hawaii",
            "id": 1668
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "family vacation",
            "id": 14724
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0118073",
      "video": false,
      "title": "A Very Brady Sequel",
      "recommendations": [
         9066,
         44347,
         76657,
         334328,
         290300,
         30502,
         9403,
         11054,
         30330,
         11041,
         352552,
         52862,
         14242,
         53380,
         45759,
         14262,
         18414,
         15258,
         478629,
         42198
      ],
      "backdrop_path": "/gSoFmAaUAwcEyhvtIn2JY12Nq0d.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Carol Brady",
               "gender": 1,
               "credit_id": "52fe45059251416c75048fe9",
               "name": "Shelley Long",
               "profile_path": "/tO5kdv22kixxy0pGBYJh9943EVh.jpg",
               "id": 56881,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mike Brady",
               "gender": 2,
               "credit_id": "52fe45059251416c75048fed",
               "name": "Gary Cole",
               "profile_path": "/cqsNC0LRZZz2k1dbgIcGITQ4DZN.jpg",
               "id": 21163,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Greg Brady",
               "gender": 2,
               "credit_id": "539b236a0e0a264526001581",
               "name": "Christopher Daniel Barnes",
               "profile_path": "/mbnpGbndavEHgkmu9tgyqF22I0i.jpg",
               "id": 31468,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Marcia Brady",
               "gender": 1,
               "credit_id": "539b237e0e0a2644f6001575",
               "name": "Christine Taylor",
               "profile_path": "/99OssnGmgGjduXFA7syxjNqt9tQ.jpg",
               "id": 15286,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Peter Brady",
               "gender": 0,
               "credit_id": "539b238f0e0a2645040015b0",
               "name": "Paul Sutera",
               "profile_path": "/7jWwVTnnIwRatPNDepDpuru6KWm.jpg",
               "id": 1231709,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Jan Brady",
               "gender": 1,
               "credit_id": "539b239f0e0a26452600158b",
               "name": "Jennifer Elise Cox",
               "profile_path": "/rXBb4Ts5jUZTn6jA0Nw9EPUzNs2.jpg",
               "id": 112052,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Bobby Brady",
               "gender": 2,
               "credit_id": "539b23ad0e0a2644ea001615",
               "name": "Jesse Lee Soffer",
               "profile_path": "/tQur9W9Jxj7CZF0NEd9dVnZZfsQ.jpg",
               "id": 1011102,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Cindy Brady",
               "gender": 0,
               "credit_id": "539b23ba0e0a2644ea00161e",
               "name": "Olivia Hack",
               "profile_path": "/cCmbXiZGZmYlH5OOKbRlRyoqa2h.jpg",
               "id": 116437,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Alice Nelson",
               "gender": 0,
               "credit_id": "539b23d90e0a26452600159b",
               "name": "Henriette Mantel",
               "profile_path": "/b6R7YCtfOdGBfrlKfjQDgaQwZhA.jpg",
               "id": 1224522,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Roy Martin / Trevor Thomas",
               "gender": 2,
               "credit_id": "539b23f60e0a26453f00164c",
               "name": "Tim Matheson",
               "profile_path": "/iQQCtIS9bQJlQ8OMOzeidsJptAQ.jpg",
               "id": 21561,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "Ms. Cummings",
               "gender": 2,
               "credit_id": "539b24250e0a2645080016d8",
               "name": "RuPaul",
               "profile_path": "/gNwa8c7XmYWXxa0i9fGF3OXazL4.jpg",
               "id": 78589,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Zsa Zsa Gabor",
               "gender": 1,
               "credit_id": "539b244d0e0a2645080016de",
               "name": "Zsa Zsa Gábor",
               "profile_path": "/spsHbBoqF6aeLhqjYvsgvL5EBMp.jpg",
               "id": 44715,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Rosie O'Donnell",
               "gender": 1,
               "credit_id": "539b24880e0a2645040015d7",
               "name": "Rosie O'Donnell",
               "profile_path": "/76ZWoNK1Fr6gmJUH1zhEBMsT9DT.jpg",
               "id": 12929,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "Sergio, the hair stylist",
               "gender": 2,
               "credit_id": "539b24aa0e0a2645280014eb",
               "name": "David Spade",
               "profile_path": "/tamKFAKdB1Q2mllHYHXxqg3YUXr.jpg",
               "id": 60950,
               "order": 14
            },
            {
               "cast_id": 31,
               "character": "Jeannie",
               "gender": 1,
               "credit_id": "539b24c50e0a2645280014ee",
               "name": "Barbara Eden",
               "profile_path": "/m3pmDfsFBK97L4ibYupf9FITMJF.jpg",
               "id": 22090,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45059251416c75048ffb",
               "name": "Arlene Sanford",
               "profile_path": "/dHPhsNnybFnfNsWXYVPZkrZC4OF.jpg",
               "id": 15042,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75049001",
               "name": "Sherwood Schwartz",
               "profile_path": "/wF659B46tId8vi5n1DQmna9McKZ.jpg",
               "id": 56888,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe45059251416c75049007",
               "name": "Harry Elfont",
               "profile_path": "/mxRw17lYzGvUTNTUsNbSHv1hIUn.jpg",
               "id": 13615,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe45059251416c7504900d",
               "name": "Deborah Kaplan",
               "profile_path": null,
               "id": 13614,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75049013",
               "name": "James Berg",
               "profile_path": null,
               "id": 73078,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75049019",
               "name": "Stan Zimmerman",
               "profile_path": null,
               "id": 73079,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c7504901f",
               "name": "Alan Ladd, Jr.",
               "profile_path": null,
               "id": 2488,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75049025",
               "name": "Lloyd J. Schwartz",
               "profile_path": null,
               "id": 56887,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c7504902b",
               "name": "Sherwood Schwartz",
               "profile_path": "/wF659B46tId8vi5n1DQmna9McKZ.jpg",
               "id": 56888,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c75049031",
               "name": "Guy Moon",
               "profile_path": null,
               "id": 56889,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45059251416c75049037",
               "name": "Anita Brandt-Burgoyne",
               "profile_path": null,
               "id": 68295,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45059251416c7504903d",
               "name": "Mac Ahlberg",
               "profile_path": "/a1BF9YiCGQ66Mncin2UmYi1g2iN.jpg",
               "id": 4614,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.726416,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12606,
      "vote_count": 57,
      "budget": 0,
      "overview": "A man claiming to be Carol Brady's long-lost first husband, Roy Martin, shows up at the suburban Brady residence one evening. An impostor, the man is actually determined to steal the Bradys' familiar horse statue, a $20-million ancient Asian artifact.",
      "similar": [
         8346,
         8273,
         49519,
         112160,
         858,
         93456,
         634,
         693,
         773,
         437557,
         1075,
         6557,
         10330,
         433,
         10118,
         43923,
         8272,
         427900,
         316023,
         9261
      ],
      "original_title": "A Very Brady Sequel",
      "runtime": 90,
      "poster_path": "/qzsNA9uYrnjeKDnuRNf5rUOCpOH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1996-08-23",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Brady Bunch Collection",
         "id": 224478,
         "poster_path": "/cXW4na1zatUrsxgsssY8uwJ6A3t.jpg"
      },
      "tagline": "The more everything changes the more they stay the same.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Arlene Sanford"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Sherwood Schwartz",
         "Harry Elfont"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118073/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4NDY1Njk2OV5BMl5BanBnXkFtZTcwNjc1MjIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Shelley Long, Gary Cole, Tim Matheson | See full cast and crew »"],
      "reviews": [
         "The Brady Bunch Movie that was released a couple years prior to A Very Brady Sequel was a decent success. The movie was actually pretty funny, I was obsessed with it when I was a kid. As I grew up, there was a flaw that I found with the film, the point of that film was to show how the Brady's were so different from the world and the real life family, no matter what decade. The Brady Bunch Movie was missing one main thing, the reactions from others around them. So A Very Brady Sequel, that's not only what they did, but they did it extremely well and this movie is one of the funniest comedies that you will ever see. One evening, a man claiming to be Carol's long-lost first husband, Roy Martin, shows up at the suburban Brady residence. He is actually a con man named Trevor Thomas and is there to steal their familiar horse statue that is actually a $20 million ancient artifact. They, portrayed as naïve, believe his story about suffering from amnesia and having plastic surgery after being injured. Eventually, Trevor's ruse is uncovered by Bobby and Cindy; in retaliation, he kidnaps Carol and takes her and the artifact to a buyer in Hawaii. The remaining Brady family travels to Hawaii to save her and foil his plans. One of the scenes that nearly kills me with laughter each time is when Roy is taking Carol and tells the kids to stay back, Cindy says \"You can't take my mommy!\", Marcia says \"Cindy's right, take Jan!\". You rarely get comedic timing on a joke like that! Roy's reactions to hanging with the Brady family was too funny. I loved when Alice mistakes his \"mushrooms\" for actual mushrooms and as he's eating them in the spaghetti she made he realizes that he's \"tripping with the Brady's\". Leading into a very funny cartoon of an acid trip with the Brady's. I thought the touch with Marcia and Greg having a romance was funny since every Brady fan knows that in real life Maureen McCormick and Barry Williams had a little fling, weird seeing brother and sister have that kind of chemistry on camera. A Very Brady Sequel is guaranteed to make you laugh. It's just a fun comedy with a lot of fun pokes at the series. The cast was great and really clicked well. Adding Tim Matheson as Roy was a great idea, he's timing on the jokes was perfect. His character was exactly what these movies needed. I also thought it was a great idea taking on the famous Hawaii episode, how could you not laugh at the way Greg gets \"wiped out\" again while surfing? I wish they did make another sequel, but maybe it's better to leave the movies off with a bang, keep us laughing, keep us wanting more because the Brady's can finally rest knowing that they left that audience with a smile on their faces. 7/10",
         "This satiric sequel is a rare exception--it's better than the original. Highlights include Jan's made-up boyfriend, George Glass, Marcia and Greg's awkward sexual attraction, a cameo by Zsa Zsa Gabor and Rosie O'Donnel, not one but TWO musical dance numbers, Marcia's obvious wig in her scene at the pool, Jan losing her contact lens while driving, Mr. and Mrs. Brady's hilariously obvious sexual innuendo, Alice's spaghetti with \"special mushrooms,\" the family trip to Hawaii, and the (brief) return of Tiger, the dog. There's a lot more funny stuff too! While the original was all about the Brady's living in the 90s, the sequel is more concerned with the wacky misadventures the characters get themselves into. The comedy is intensified when other non-Brady's (people of the 90s) react to the Brady family. Fortunately, the Brady's are still oblivious to the fact that they aren't living in the 1970's anymore, so we can keep on laughing at the ridiculousness of the situations they are placed in. Honestly, it is such a funny, underrated comedy...RENT IT!",
         "This movie is one of the funniest films I've ever seen. Way better than the first which is very unlikely. This movie just makes you laugh from the first frame to the very last. Not much more to say, a perfect comedy.",
         "This quick cash-in sequel to the 1995 Brady Bunch Movie is surprisingly really quite good - The wonderfully tongue-in-cheek Shelley Long and Gary Cole make this worth watching just for their performances alone and the story is quite good if a little far-fetched. Tim Matheson stars as Shelley Long's EX-Husband or is he? If your feeling low - this movie will certainly bring a smile to the face if nothing else! MY Rating 8/10",
         "Just a year after the original comes out, they make a follow-up, which is just as good as the original. Shelley Long, Gary Cole and all the kids come back for this one. Carol's supposedly dead husband comes back, leaving the Brady household confused, so they do they only thing that will help - fly over to Hawaii (of course!)! Yet more laughs and more funny lines (ie. [coming off the plane] Mike: Where's Marcia? Cindy: She's been lay-ed by those Hawaiian boys!) Ahem, yeah, but you might wanna check this one out for yourself! The Brady kids aren't short of singing numbers either, not on a stage though, this time on the 'groovy' plane!",
         "If you were a fan of the first \"Brady Bunch Movie,\" you'll probably find this sequel enjoyable as well. The whole cast has now slipped effortlessly into their roles (especially Gary Cole's absolutely spot-on mannerisms of Robert Reed/Mike Brady) The story and jokes this time tend to start petering out near the end, but on the whole there are enough laughs, satiric jabs and nostalgic winks to inspire good will towards the whole film. It's fluff, to be sure....but entertaining fluff.",
         "Wow. I didn't think I would like this movie at all, since the first was very lackluster. I was wrong. This is MUCH funnier than the first film, and is a fresh change. A man named Trevor (Played by Tim Matheson) claims to be Carol's (Shelly Long) long lost husband. But, Trevor's partner was Carol's husband, who had died, and Trevor is trying to get a treasure he left her. Mike (Gary Cole) and the kids must help stop this from happening. There are some great storyline extras here (George Glass most definitely.) but some things seemed tasteless, like with the Greg and Marcia incest relationship (Though technically...). I thought most of those parts were unfunny. Look for alot of cameos in here, like in the first one. A very comedic movie. Recommended. RATING: *** out of ****",
         "A sequel that's even better than the first part is a rare occurrence, even more fun than the first film. Once again, it's Jennifer Elise Cox who steals the show with a number of hilarious moments. This overlooked actress has (or had?) the potential to be another Goldie Hawn, but, alas, the major hindrance in her career going forward is that she isn't a Spelling, a Coppola, an Arquette, a Fonda, or a Barrymore. Having lack of powerful family connections is a truly unforgivable crime, and probably a major reason why she didn't make a breakthrough. If Drew Barrymore, for example, had 5% of her talent, she'd be the no.1 female star in the past 2 decades. I don't think much of child and teen actors, but Cox is possibly the funniest teenager I have ever seen in a movie, and one of the funniest actresses, as well. Her semi-retarded, ultra-naive facial expressions, so perfectly suited to this role, and her delivery of lines are absolutely perfect. Matheson is also very good, as is the guy playing the oldest son.",
         "A VERY BRADY SEQUEL(1996) Shelley Long, Gary Cole, Christine Taylor, Christopher Daniel Barnes, Jennifer Else Cox. In this sequel to the 1995 hit, the brady bunch movie, a man named Roy Martin comes to the brady's house one night and says that he is Carols first husband. But really, he wants an Asian Horse statue that the Bradys have that is worth 20 million dollars. I would have to say that this was a little bit better than the first. This was funnier, and more entertaining. But I did enjoy the original. Anyway, Even if you haven't seen the show, you will still laugh. For the first movie, if you haven't seen the show, then you wouldn't have laughed as much. There was more bad material for little kids in this one, but neither were bad PG-13's. In this one, Jan was extra funny. In the original, she wasn't that funny. But in this one, she was hilarious. This one also doesn't make fun of the show as much as the other one. The other one had more funny things in the beginning. In this one, it was funnier after halfway. Recomended to anyone who like the show or the first film. Grade for A VERY BRADY SEQUEL: ***(outta 4) PG-13; some sex-related humor.",
         "A Very Brady Sequel is a very good movie. All the actors did well here, especially Shelly Long, Gary Cole, Jennifer Elise Cox and Tim Mathieson. The funny situations, quotes, tone and style of this movie help hide the fact that not all that much really happens and the premise of this film is absurd. One of the biggest questions that fans often had about the show was the taboo subject of whether any of the Brady kids hooked up. A Very Brady Sequel tackles this issue head-on with Greg and Marcia trying to decide whether they should give in to the urges they start to feel for each other. This whole subplot was very interesting, if not also a little uncomfortable at times. Christopher Daniel Barnes and Christine Taylor are great as Greg and Marcia. The one role that I felt was perfectly done and helped the movie out the most is Jennifer Elise Cox as Jan Brady. She does an even better job with the role then the original Jan, Eve Plumb. Almost all the scenes with Jan are funny and Jennifer just shines through. Obviously, fans of The Brady Bunch are going to get the most enjoyment out of this. For a newcomer, you might want to check out a few episodes of the TV show first."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Ladd Company, The",
         "Paramount Pictures"
      ],
      "summaries": ["A man claiming to be Carol Brady's long-lost first husband, Roy Martin, shows up at the suburban Brady residence one evening. An impostor, the man is actually determined to steal the Bradys' familiar horse statue, a $20-million ancient Asian artifact."],
      "budget": 15000000
   },
   "movielensId": 818,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-23",
      "dvdReleaseDate": "2003-06-10",
      "directors": ["Arlene Sanford"],
      "runtime": 90,
      "movieId": 818,
      "title": "A Very Brady Sequel",
      "mpaa": "PG-13",
      "actors": [
         "Shelley Long",
         "Gary Cole",
         "Christopher Daniel Barnes",
         "Christine Taylor",
         "Paul Sutera",
         "Jennifer Elise Cox",
         "Jesse Lee Soffer",
         "Olivia Hack",
         "Henriette Mantel",
         "Tim Matheson",
         "RuPaul",
         "Zsa Zsa Gábor",
         "Rosie O'Donnell",
         "David Spade",
         "Barbara Eden"
      ],
      "imdbMovieId": "0118073",
      "originalTitle": "A Very Brady Sequel",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["WBJo1OLm1IA"],
      "plotSummary": "A man claiming to be Carol Brady's long-lost first husband, Roy Martin, shows up at the suburban Brady residence one evening. An impostor, the man is actually determined to steal the Bradys' familiar horse statue, a $20-million ancient Asian artifact.",
      "tmdbMovieId": 12606,
      "avgRating": 2.61387,
      "releaseYear": "1996",
      "numRatings": 3144,
      "posterPath": "/qzsNA9uYrnjeKDnuRNf5rUOCpOH.jpg"
   }
}