{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "menage a trois",
         "id": 3190
      }],
      "imdb_id": "tt0061495",
      "video": false,
      "title": "La Collectionneuse",
      "recommendations": [
         86764,
         48831,
         81399,
         39543,
         67062,
         48764,
         71329,
         37239,
         28249,
         44102,
         14495,
         35124,
         1818,
         29933,
         27817,
         68553,
         94655,
         43360,
         43596,
         225
      ],
      "backdrop_path": "/geh2f8hCLap7kzH1VGiTlOwP9ap.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Adrien",
               "gender": 0,
               "credit_id": "52fe43ddc3a36847f8074fab",
               "name": "Patrick Bauchau",
               "profile_path": "/eAlTfdwkw4xCU8UIxVCkL4LWYO5.jpg",
               "id": 5274,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Haydée",
               "gender": 0,
               "credit_id": "52fe43ddc3a36847f8074faf",
               "name": "Haydée Politoff",
               "profile_path": "/hs8wRGB8uw0GKNZRNIIHGNVISHi.jpg",
               "id": 39672,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Daniel",
               "gender": 2,
               "credit_id": "52fe43ddc3a36847f8074fb3",
               "name": "Daniel Pommereulle",
               "profile_path": "/gA9bvpiWOb8qLOKmTc0Rfp8HSwo.jpg",
               "id": 39673,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Writer",
               "gender": 0,
               "credit_id": "52fe43ddc3a36847f8074fb7",
               "name": "Alain Jouffroy",
               "profile_path": "/40pales8HGOTDuRfLeq8jXvDXbg.jpg",
               "id": 39674,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Carole",
               "gender": 1,
               "credit_id": "52fe43ddc3a36847f8074fbb",
               "name": "Mijanou Bardot",
               "profile_path": "/9opA7SmVIsRuRayG0D2WZWQtL5y.jpg",
               "id": 39675,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "amie de Carole",
               "gender": 1,
               "credit_id": "52fe43ddc3a36847f8074fbf",
               "name": "Annik Morice",
               "profile_path": null,
               "id": 39676,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Charly",
               "gender": 2,
               "credit_id": "52fe43ddc3a36847f8074fc3",
               "name": "Dennis Berry",
               "profile_path": null,
               "id": 39677,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Sam",
               "gender": 0,
               "credit_id": "5438a91ac3a36811e8000a83",
               "name": "Seymour Hertzberg",
               "profile_path": null,
               "id": 1372849,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "5438ac990e0a266f3f000ab7",
               "name": "Néstor Almendros",
               "profile_path": "/3O9fLu6Mc1AYHHOh3DFwSO9vveY.jpg",
               "id": 3569,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "un homme dans l'auto",
               "gender": 0,
               "credit_id": "5438ad55c3a3680f6c000b59",
               "name": "Patrice de Bailliencourt",
               "profile_path": null,
               "id": 1372854,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "5438b0260e0a2617c100415a",
               "name": "László Benkö",
               "profile_path": "/use68KkC8nc7Sz7c6mCpsOggQkf.jpg",
               "id": 1372855,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "5438b5acc3a3680f6c000cbf",
               "name": "Anne Dubot",
               "profile_path": null,
               "id": 1372857,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 1,
               "credit_id": "5a5afa890e0a265767016690",
               "name": "Jackie Raynal",
               "profile_path": "/fjqRoLM3FPUKq1RP8XbjbyUYASq.jpg",
               "id": 1160008,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ddc3a36847f8074fc9",
               "name": "Éric Rohmer",
               "profile_path": "/4VUnQk2yA6m58uak9LguIAzZ8Re.jpg",
               "id": 28615,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ddc3a36847f8074fd5",
               "name": "Néstor Almendros",
               "profile_path": "/3O9fLu6Mc1AYHHOh3DFwSO9vveY.jpg",
               "id": 3569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ddc3a36847f8074fdb",
               "name": "Georges de Beauregard",
               "profile_path": null,
               "id": 3779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5737e14ec3a36823b40050d0",
               "name": "Éric Rohmer",
               "profile_path": "/4VUnQk2yA6m58uak9LguIAzZ8Re.jpg",
               "id": 28615,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5737e137925141155f0023fe",
               "name": "Patrick Bauchau",
               "profile_path": "/eAlTfdwkw4xCU8UIxVCkL4LWYO5.jpg",
               "id": 5274,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "5737e13f9251417dd80018b9",
               "name": "Haydée Politoff",
               "profile_path": "/hs8wRGB8uw0GKNZRNIIHGNVISHi.jpg",
               "id": 39672,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "5737e1469251417dd80018c0",
               "name": "Daniel Pommereulle",
               "profile_path": "/gA9bvpiWOb8qLOKmTc0Rfp8HSwo.jpg",
               "id": 39673,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "5737e15ac3a3687e1a00601c",
               "name": "Barbet Schroeder",
               "profile_path": "/jDMy62PR1pfD0dX5E0K3Q6SI1wm.jpg",
               "id": 23393,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5737e162c3a3687e1a006021",
               "name": "Alfred de Graff",
               "profile_path": null,
               "id": 1620067,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5737e1719251417a60000838",
               "name": "Blossom Toes",
               "profile_path": null,
               "id": 1620068,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5737e178c3a36840ec0044ba",
               "name": "Giorgio Gomelsky",
               "profile_path": null,
               "id": 1620069,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5737e182c3a3682ae9001638",
               "name": "Jackie Raynal",
               "profile_path": "/fjqRoLM3FPUKq1RP8XbjbyUYASq.jpg",
               "id": 1160008,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5737e194c3a36823b40050f3",
               "name": "László Benkö",
               "profile_path": "/use68KkC8nc7Sz7c6mCpsOggQkf.jpg",
               "id": 1372855,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5737e19c925141155f002420",
               "name": "Patrice de Bailliencourt",
               "profile_path": null,
               "id": 1372854,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.058769,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 4837,
      "vote_count": 32,
      "budget": 0,
      "overview": "A bombastic, womanizing art dealer and his painter friend go to a seventeenth-century villa on the Riviera for a relaxing summer getaway. But their idyll is disturbed by the presence of the bohemian Haydée, accused of being a “collector” of men.",
      "similar": [
         2255,
         4031,
         4710,
         3934,
         5187,
         6187,
         244772,
         1018,
         5038,
         617,
         9681,
         10784,
         402,
         84354,
         157851,
         19344,
         1811,
         11822,
         51241,
         28325
      ],
      "original_title": "La Collectionneuse",
      "runtime": 89,
      "poster_path": "/wxSls14xsv2iukhmjAIGS7xbB0.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rome Paris Films",
            "id": 109,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films du Losange",
            "id": 223,
            "origin_country": ""
         }
      ],
      "release_date": "1967-03-02",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eric Rohmer"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Patrick Bauchau",
         "Haydée Politoff"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0061495/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0MTg5OTkzN15BMl5BanBnXkFtZTcwODg0MDcxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Patrick Bauchau, Haydée Politoff, Daniel Pommereulle | See full cast and crew »"],
      "reviews": [
         "Art dealer, in need of serenity, finds that the holiday villa is shared by a hedonistic young woman. He becomes obsessed with ignoring her and pretends to himself that she wants to seduce him while he remains unaffected. The holiday thus turns into a love triangle between the indifferent but flirtatious girl, the man's unacknowledged desire, and his incessant, pompous self-rationalizations (the best cinematic use of voice-over EVER!). A sunny, witty, and deeply ironic \"moral tale\" that explores, like most of Rohmer's work, the uneasy vacillation between intellect and eroticism.",
         "\"La Collectionneuse\", the third film in Eric Rohmer's six moral tales, is packed with lacerating observations on life, love, and the nature of man. It is a sensitive conversation piece with elegant people commenting poetically on their lives and of those around them. Attractive men and women who reflect openly about the conflicts of intellect and impulse; inclination and action, solitude and companionship. Rohmer characteristically paces this eloquent tale of sexual temptation with long, fluid takes. \"La Collectionneuse(Collector Girl) centers around a young, hedonistic girl(Haydee) who saunters laconically around the provincial environs of a large vacation home, seemingly indifferent to the two older men's(Adrian and Danele) existence. Haydee exudes a casual independence and an unflappable reserve. Her cursory dealings with her young lovers prompts Danele to cast her as 'the atrocious ingenue'. Though they find her unexpectedly alluring, both men regard 'the idea of collecting boyfriends opposite of purity'. Rohmer, the director of \"Chloe in the Afternoon\" and \"A Tale of Springtime\", enjoys revealing which individual can best cast their charm and guile to their best advantage. This 'game' between the sexes only leads to unwanted desires for the men and a resumption of her search by Haydee. Rohmer handles the material with a light touch throughout and concludes his story by offering a tenuous solution to the prevailing tension in the movie between one's solitude and fraternity. Adrian privately confesses that 'I was overwhelmed by a feeling of delightful independence, of total self-determination. But in the emptiness and silence of the house, I was overcome with anguish'. A universal truth clearly-rendered by one of cinema's most ingenious and graceful filmmakers.",
         "It's hard to explain what is the Rohmer's cinema. In his movies you can't find heroes, incredible adventures or great action sequences. Everything happens inside the mind of the characters, and the most important aspect is the psychology of them. La Collectioneuse is simply the masterpiece of Rohmer. The plot is very simple: two boys and one girl in their friend's house in St.Tropez. That's all. There are not incredible events that happen, they simply LIVE there. It's an typical situation of Rohmer who likes to study the evolution of love triangles, in different situations. The explanation of the development steps, made by the usual interior voice of the main character (Adrien), it's incredibly accurate and likely. It's fantastic that sometimes Adrien's thoughts look at first to be absurd, but even in this case if we reflect a bit to that we can realize that it's true, that really in similar cases we have non-sense thoughts like those. In this way, Rohmer is unique: the psycho-evolution of the characters is incredibly real. Dialogs, internal and not, are superb and the directing essential. Rohmer shows us how it's possible to make a masterpiece with a ridiculous budget, and how an intellectual movie can be also enjoyable and not so heavy. The vote, of course, can't be different by 10 out of 10.",
         "The first feature length moral tale, La Collectionneuse is easily better than its predecessors. Offering a realistic look into the lives of three young people and narrated perfectly by one, La Collectionneuse is a beautiful film. This is Eric Rohmer's first color feature and it is absolutely magnificent to look at. There are several gorgeous beach scenes. The cinematography all around is just glorious. Aside from that, the acting is wonderful. There is so much chemistry between the main characters that it electrifies the film. It also provides a realistic tale of the struggle to keep morality. Translated as \"The Collector\" in English, La Collectionneuse is an overlooked, underrated film that should be considered a classic. The story begins with three prologues. The first, Haydee's prologue, simply shows the girl on the beach in a skimpy bikini. The second prologue introduces the viewer to Daniel, a painter, who becomes a key character. Adrien's prologue, the third and last, gives us an introduction to Adrien, who becomes our narrator throughout the rest of the film. These three characters are whom the story revolves around. Sharing a mutual friend, the three of them come to share a villa during their vacation. Adrien, an art dealer who is played by Patrick Bauchau, has made it his goal to do absolutely nothing during his stay. He and Daniel (Daniel Pommereulle) become friends fairly quickly, but both keep their distance from Haydee (Haydee Politoff), the beautiful young girl who beds a different guy every night. Adrien is at first disgusted with her behavior, calling her a \"collector\" of men, but eventually becomes intrigued by her. As he grows more and more attracted to her, Adrien must decide whether or not to sleep with her and forget his moral integrity or to abstain and do what he knows is right. Through his narration, Adrien debates this and plays mind games with Haydee, although he's not sure if she shares the attraction or if she simply wants to add him to her collection. This film is simply beautiful. The sexual tension feels very real, which is due to both the performances of the actors and the direction of Eric Rohmer, who is quickly becoming one of my favorite directors. The narration is refreshing, offering a good look into Adrien's mind. La Collectionneuse is very sharp with its dialogue and themes. Like the other Rohmer films I've seen, this one ends very abruptly. It reminds us that we're watching these people's lives for only a short time. The 87 minutes is completely worth it, though. La Collectionneuse is a great film and should be regarded in higher esteem than it seems to be. I can't imagine why this one isn't ranked alongside the greats. 10/10",
         "In The Collector, the first feature-length film of the Six Moral Tales series, mind-games, strategies, and overt manipulation thwart the possibility of satisfying relationships. The 54-minute film is beautifully photographed and has an elegance, charm, and wit that bears favorable comparison with his more acclaimed works. Adrien (Patrick Bauchau), an art dealer, and Daniel (Daniel Pommereulle), a painter spend the summer in a house on the French Riviera. Also vacationing there is Haydee (Haydee Politoff), an elegant but rather aloof young woman who sleeps with many boys in the area and has earned the title of \"collectionneuse\", a collector of men. Adrien, smug and self-centered in a charming sort of way, is interested in Haydee but tells himself that her promiscuity is a trick for him to seduce her and he refuses. The summer turns into a love triangle with Adrien convincing Daniel to pursue Haydee to ease the pressure of his own conflict between his rationalizing intellect and his passions. In the moral scheme of things, Haydee may represent the sexual revolution of the 60s and Adrien that of traditional morality, yet the film takes no sides, presenting the issues without judging the characters and giving us much to think about. The Collector is perhaps the most philosophical of the six but in the end the pursuit without passion leads to a feeling of emptiness and missed opportunities. Like most of Rohmer's films, there are no peak dramatic moments or confrontations, just everyday life elevated into art.",
         "LA COLECTIONNEUSE is Eric Rohmer's first color feature, and along with cinematographer and frequent collaborator Nestor Almendros, he uses a bright palette to maximum advantage in a story that like its time frame, is bursting in warm, vibrant hues that pretty much parallels the equally lightweight plot. Straying habitually close to the same story that makes up what the \"Moral Tales\" are about, this one concerns a frisky female, Haydee (Haydee Politoff), who captures the attention and equal repulsion of two other young men: Daniel (Daniel Pommereulle), an artist with a penchant for making art that literally cuts its viewers \"who aren't sharp\", and Adrien (Patrick Bauchau), a young art dealer who is soon to make a lucrative purchase from an American artist. Haydee is first seen in a frank, objectified way: walking on the beach of Saint Tropez, alone, as the camera lingers on her face (reminiscent of Charlize Theron), her torso, her legs. It's, in a way, Rohmer's mode of possibly depersonalizing his heroine since she remains a murky character with little definition -- one moment submissive, another moment quite take-charge, but always obscure. It's also a way of introducing her carefree way to the viewer; had she been introduced as a buttoned-down, prim female, it would have been clear her role would be that of a woman of stiff mores. But, as we see throughout the movie, Haydee is living in the middle of the swinging Sixties and she could care less about those things. Nor if her partying disturbs the sleep of Adrien or Daniel. Their share at the summer house in Saint Tropez is anything but placid. The two men are appalled at her behavior and decide not to have sex with Haydee \"for her own good.\" Adrien even decides to dub her \"The Collector\" -- a moniker that makes up the title of the movie and points at a spiteful machismo because where men can be womanizers and be called studs, women who take on this attitude are sanctioned. He stays at a distance from Haydee as she becomes involved with Daniel. Their liaison, however, becomes rocky and both soon part ways, leaving Haydee and Adrien with an open door to come one step closer. In a shocking move, Adrien offers her to a prospective client in order to secure a Song vase. Surprisingly, she accepts, not without an incident involving the aforementioned vase, which in turn leads Haydee right into Adrien's arms. Rohmer's movie is not without its \"Rohmerisms\" where characters introduce themselves with lengthy discussions as to the nature of life, love, attractions, and repulsions. In fact, every character minus Haydee does so, which makes her the more elusive and difficult to describe. Is she just floating along with what the men think they want? Or is she really clueless, a woman who has a simple view on life and who doesn't find any guilt in her actions? Interestingly enough, her \"philosophy\" is rather close to that of Adrien's girlfriend (every male character in his \"Six Moral Tales\" arc has a steady) who sees love as universal, indifferent to beauty or ugliness. That Haydee acts upon Adrien's girlfriend's statement says a lot more about who the girlfriend might be, but sheds an accessible light on Haydee. And anyways, she comes off better than any of the two men, as do the other females of Rohmer's sextet -- Maud, Laura, or Chloe. (It's also interesting that all of the \"other women\" are mainly brunette and aggressive or assertive in temper, whereas the \"ideal\" one is frequently blond or passive in character.) Even when objectified, there is a mysterious likability within her that is missing in his two male leads. Adrien is a little hypocritical of his own observant nature and while he openly derides Haydee he also wants her. Daniel is a dark guy in this story and in all of the \"Six Moral Tales\" collection, not just because of his pain-inducing art, but a veneer of violence just underneath his arrogant demeanor. Maybe, in this story -- as well as all of his others -- Rohmer seems to be the Ultimate Observer, painting a picture in regards to immature men, their attraction to a worldly female, and their decision to remain in a complacent union with another one that can only be there as a Barbie doll.",
         "Eric Rohmer's movies are, it seems almost without exception, slow- burners that reward those with the patience to sit through them, preferably more than once in some cases, and think about whats being said as much as whats being shown. This, his first feature in colour requires considerable thought on the part of the viewer, serving up nothing in the way of dramatic excitement and featuring three loathsome main characters who's morals are very in keeping with the era of late- 60s self satisfaction and hedonistic excess. Not that the hedonism is very wild. Jimi Hendrix does not blast from the simple record player that sits near a chair and provides the only music in the film. No one smokes anything illegal or pops any pills, talks of Indian mystics or goes in for meditation. But there is the very liberated (nowadays we'd say reckless) attitude to casual sex, although we don't see very much; the relaxed tangle of naked legs half glimpsed through one doorway, a brief an unrevealing shot of the main protagonist, the disturbingly young looking Haydee, quietly enjoying the intimate attention of another one-night-stand. Otherwise it's all hints and the more effective for that. Haydee is the very image of a swinging-sixties bed hopper. Young, slender, independent, cool and seemingly amoral she wrecks the plans of Adrian, an art dealer with time on his hands, when he finds her resident in a borrowed holiday villa at which he intends to devote himself to doing nothing at all for a few weeks while his girlfriend is in London. Haydee's noisy night-time frolics disturb his sleep and offend his self- declared sense of morality and the added presence in the house of his lazy, grumpy painter-friend Daniel sets up a spiralling tension between them all. But this is pure Rohmer and that tension manifests itself not in fist-fights, broken furniture, tearful confessions and blood-letting, but insults, low-key/nigh-brow arguments, teasing, sniping and political manoeuvring. In fact the more one thinks about the film, and it's one of those movies that does hang around long after the credits, the more one realises it's actually rather more like real-life, certainly as most of us endure it from time to time, than the over-dramatic offerings we are used to from mainstream movie-makers. Haydee maybe cute, Adrien describes himself as handsome and the setting is idyllic but you really wouldn't like to be on holiday with these unsympathetic characters. Observing their antics from without is one thing but to be part of it would be a nightmare! Oddly with it's morality so perfectly fixed in it's own time, this seems far more like a film from the 1970s. Something in it's look and after-the-party sense of deflation and disenchantment fits in with that later decade. Seeing it without knowing the release date you might well guess at 1972 or even later. If Godard's BANDE A PARTE is set in a Swinging-Sixties that hasn't yet arrived, Rohmer's film portrays one that has already left the building, although it's after-effects continue to create a problem. It all sounds somewhat depressing on paper and to some extent it is! It's not an easy film but if you give it time and maybe second look, you might well find there is more to this outwardly simple tale than you thought.",
         "The arrogant and pretentious intellectual art dealer Adrien (Patrick Bauchau) invites his girlfriend to travel with him to the coast to spend one month vacation with his close friend and painter Daniel (Daniel Pommereulle) in the house of their Randolphe. Adrien expects to do nothing but read and rest in the house and meet a possible investor in an art gallery that he dreams on having; however she prefers to travel to London. When he arrives, he discovers that the sexy and promiscuous pleasure-seeking Haydee (Haydée Politoff) that had one nightstand with Randolphe is sharing the house with Daniel. Along the days, Adrien becomes obsessed in a sick game of humiliating Haydee and imaging that she is trying to seduce him; however, his lust for her increases but his moral rationalization of their possible relationship keeps them apart. \"La Collectionneuse\" is an erotic tale of arrogance, false value judgment and pretentious intellectuality of a false moralist. The witty and cynical screenplay uses excessive narrative in off of the unlikable lead character Adrien that is despicable as well as his friend Daniel. Actually, the only likable character is the libertine Haydee that accepts passively the cruel comments and treatment of Adrien and Daniel. Eric Rohmer uses the successful idea of a triangle of love with two men and a woman of \"Jules et Jim\" in a different and monotonous approach. My vote is six. Title (Brazil): \"A Colecionadora\" (\"The Female Collector\")",
         "Eric Rohmer is a very well respected director and my hating many of his films flies is not typical of many of the reviewers here on IMDb. You might wonder why I keep watching his films and it's because sometimes I have enjoyed them--such as with \"Autumn Tale\". But too often I find his films extremely talky and slow...too slow. This story is about a pretentious and morally superior man named Adrien. He is the sort of guy who THINKS he's somehow better and more intelligent than most, but in this film he just seems like a jerk. This jerk goes to stay at some summer home along with his friend, Daniel. Daniel is a sullen and grouchy jerk and perhaps even more difficult to like than Adrien. Into this joyous household comes a free-spirited and VERY sexually liberated young lady, Haydée. Daniel and Adrien immediately look down on her because of her blasé attitude about sex but soon it becomes clear that the two men would be more than willing to score with her. Adrien takes the approach of a guy who is indifferent to her and he seems to spend most of the film convincing himself he does NOT want Haydée. By the end of the film will Adrien and Haydée 'hook up'? The idea of a pseudo-intellectual snob who feigns indifference towards a sexually adventurous lady isn't the most exciting thing but it could have been much more interesting. First, injecting the movie with ENERGY would have sure helped. Instead, this movie is almost glacially slow and dull. Second, making the characters likable in some way would have increased the audience's connection with the film. I hated Adrien and Daniel in particular. Third, the movie should not have been done mostly with voice-overs by Adrien. Allowing the characters to talk and allowing everything to unfold without narration would have made it more interesting and less pretentious. Overall, I guess this is another one of Rohmer's stories that I just don't get.",
         "It's amazing how diabolical those people sound when they declare that the ovens are the only place for those lacking beauty-completely ignoring the variety of good human attributes. This is the trap that many architects,artists, and designers get stuck in the search for beauty. The film is interesting despite my hate for it's characters because of it's exploration of the ideas of beauty and perception,it also was filmed in a gorgeous old mansion in the country. 1967 was an interesting year in film :Week End,Oedipus Rex,The Graduate,2 or 3 Things I Know About Her,Point Blank,Belle Du Jour,Bonnie and Clyde, Dirty Dozen, this one is worth checking out in addition to those others."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Les Films du Losange",
         "Rome Paris Films"
      ],
      "summaries": [
         "Adrien travels to a villa on the Riviera. He is on vacation and plans to relax. He shares the villa with a friend, Daniel, and a female stranger, Haydée. Haydée has many lovers, and both Adrien and Daniel despise her at first, but Adrien soon becomes more and more intrigued and infatuated.",
         "The arrogant and pretentious intellectual art dealer Adrien invites his girlfriend to travel with him to the coast to spend one month vacation with his close friend and painter Daniel in the house of their Randolphe. Adrien expects to do nothing but read and rest in the house and meet a possible investor in an art gallery that he dreams on having; however she prefers to travel to London. When he arrives, he discovers that the sexy and promiscuous pleasure-seeking Haydee that had one nightstand with Randolphe is sharing the house with Daniel. Along the days, Adrien becomes obsessed in a sick game of humiliating Haydee and imaging that she is trying to seduce him; however, his lust for her increases but his moral rationalization of their possible relationship keeps them apart.",
         "A womanizing art dealer and a painter find the serenity of their Riviera vacation disturbed by a third guest, a vivacious bohemian woman known for her long list of male conquests."
      ],
      "budget": 0
   },
   "movielensId": 823,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1967-03-02",
      "dvdReleaseDate": "2000-04-28",
      "directors": ["Éric Rohmer"],
      "runtime": 89,
      "movieId": 823,
      "title": "La Collectionneuse",
      "mpaa": null,
      "actors": [
         "Patrick Bauchau",
         "Haydée Politoff",
         "Daniel Pommereulle",
         "Alain Jouffroy",
         "Mijanou Bardot",
         "Annik Morice",
         "Dennis Berry",
         "Seymour Hertzberg",
         "Néstor Almendros",
         "Patrice de Bailliencourt",
         "László Benkö",
         "Anne Dubot",
         "Jackie Raynal"
      ],
      "imdbMovieId": "0061495",
      "originalTitle": "La Collectionneuse",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["HMcPo-S1v-k"],
      "plotSummary": "A bombastic, womanizing art dealer and his painter friend go to a seventeenth-century villa on the Riviera for a relaxing summer getaway. But their idyll is disturbed by the presence of the bohemian Haydée, accused of being a “collector” of men.",
      "tmdbMovieId": 4837,
      "avgRating": 3.36923,
      "releaseYear": "1967",
      "numRatings": 130,
      "posterPath": "/wxSls14xsv2iukhmjAIGS7xbB0.jpg"
   }
}