{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0112716",
      "video": false,
      "title": "The Convent",
      "recommendations": [
         186955,
         126376,
         85904
      ],
      "backdrop_path": "/zmUqUobVYUlue0a4ipJXXkixNiK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hélène",
               "gender": 1,
               "credit_id": "52fe4ab0c3a368484e161b73",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe4ab0c3a368484e161b77",
               "name": "John Malkovich",
               "profile_path": "/tCtiWZbKKRgHhLxFCIPfveYAsdc.jpg",
               "id": 6949,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "5531f86cc3a368222a001bd6",
               "name": "Luís Miguel Cintra",
               "profile_path": "/bVv9Hgy62EhGWsuFAf4kc7zQ417.jpg",
               "id": 234486,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "5531f87a925141631000137f",
               "name": "Leonor Silveira",
               "profile_path": "/pNRH0PQKBwaOc8nwkRv3H6vFDpa.jpg",
               "id": 213290,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4ab0c3a368484e161b6f",
            "name": "Manoel de Oliveira",
            "profile_path": "/yDDRrKfzFhyoMkujD46ask3XeFF.jpg",
            "id": 81749,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 1.545823,
      "production_countries": [],
      "id": 124614,
      "vote_count": 6,
      "budget": 0,
      "overview": "The journey of Michael Padovic, an American professor who arrives with his wife, Helene, at a Portuguese convent where he expects to find the documents needed to prove his theory: Shakespeare was born in Spain; not in England.",
      "similar": [],
      "original_title": "O Convento",
      "runtime": 91,
      "poster_path": "/8VJt6pezZPNJAFJtDxFsjSN25ok.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-09-06",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Portugal",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Manoel de Oliveira"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Manoel de Oliveira",
         "Agustina Bessa-Luís"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0112716/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2NzE0NTc0NF5BMl5BanBnXkFtZTcwNDMzMjUxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Catherine Deneuve, John Malkovich, Luís Miguel Cintra | See full cast and crew »"],
      "reviews": [
         "A sparse movie, but under-appreciated. John Malkovich's intellectual curiosity threaten both his marriage and his soul. The conclusion flows, but is not obvious when it happens. I suggest watching this twice in succession (it isn't very long) in order to pick up nuances in the dialogue that you might have missed during the first pass.",
         "This film is absolutely beautiful -- a picture of cinematic craft, and has a complexity that is rarely found in American films. Contrary to what others have said, this film has a fantastically developed plot. It is sad that the others who have reviewed this movie found it to be lacking. If you don't know Goethe's Faust, don't bother watching it. If you are so numbed by Hollywood that you can't stand to watch a movie without nudity, gore, blood, explosions, or sex, don't rent this movie. If you don't like to discuss nuance in films after watching them, don't watch this movie. If you hate French people, don't watch this movie. Rent something with The Rock in it instead. To the others who reviewed The Convent, I would say bad films do not win prizes at Cannes. This movie is brilliant, and is the epitome of what art film should be.",
         "Well, first of all I've enjoyed this film immensely. I think it had all the right tone, the right actors, and the way the story is developed is done with great know-how. It's not boring in any way, but spectators need to be aware of the kind of movie they're going to watch. Deneuve, Malkovich, and the Portuguese actor Silveira and Cintra are all able to create an atmosphere of metaphysical mystery, in dealing to all the questions about all books, convents or even the devil. Thank god there are still movies that make you think and don«t give you all the answers so that you forget just after leaving the theater. Great scene the one where the \"devil\" runs through the forest... don't miss it!!!",
         "The casting of John Malkovich for the role of Dr. F.W. Murnau in \"Shadows of a vampire\" (2000) was probably not by change (although there is not a ghost of similarity between Malkovich and Murnau) - at least not for those people who have seen Malkovich in \"The Convent\", where he plays the director of the Nosferatu- and Faust-topics. I think the best approach to this rather hermetic movie of Manoel De Oliveira is by asking questions. Why does his wife who openly despises her husband's work accompany him into the monastery, where she has absolutely nothing to do, where a minute is as long as a day outside of the walls, where she has neither inside nor outside of the remote convent connections to other people? Why is a convent guarded by a couple who celebrates black messes? And does the chief-guardian not look like the Devil in medieval depictions and knows big parts of Faust I by heart, as if he would be actually Mephisto? Another interesting detail is that \"Piedade\", the immaculate, fragile, angel-like librarian gives the professor an edition of Faust, but of Faust II. The content of Faust II is the purification of Faust's soul. Therefore, all those people who see in \"The Convent\" the classical Faust-motives are wrong, because these are from Faust I. So, it does not astonish that the wonderful Portuguese landscape that De Oliveira shows us, corresponds practically literally with Goethe's description of the different scenes of Faust II (including the mysterious grove in which Piedad vanishes at the end and in which to loose herself she is wished by the professors jealous wife). I am afraid, all these people who have not read Faust II (and this is the majority both in Europe and elsewhere), is left alone in this movie. At the end of the film, before the credits, we read that the professor has abandoned his research to prove that Shakespeare was the Jewish Spaniard Jacques Perez, but, according to his impressions in the monastery, has dedicated his life now to the research of occultism. This is very interesting insofar as we have here now the former Faust II turned into the Faust at the beginning of Faust I, where he sits in his hollow-like apartment and studies Cabbalist signs, at the same time depressed that he cannot go into the magic letters and thus invokes Satan (as to be seen in F.W. Murnau's \"Faust\" (1926)). But in De Oliveira's movie we seen the already purified Faust II turning slowly into Faust I. This is by all means exciting.",
         "I consider myself a rather weird individual myself, I see strange foreign and art films, I read a lot on history and classics. Yet when I saw this film I oculdn't stop wondering what in the world was happening. I understand the metaphysical aspects of the film, even the Faust influence, but to me it lacked something central. The acting was great from Deneuve and Malkovich (Loved Shadow of a Vampire), but some other actors were a bit too fake, too overly dramatic. Yes, the cinematography is gorgeous, it makes me feel rather odd and at the same time its beauty is alarming. I think that it is actually an okay film that needs a better score and a more developed plot. A good but not phenomenal film. I have seen better movies concerning this idealogy, not many but a handful.",
         "Seldomly do we get films with such an interesting and involving plot as this one. An absolute joy to watch, with an excellent cast. There are not many films with such an interesting and fascinating plot as this one. Part of what makes the film such fascinating viewing is the settings and the stories that are associated with them. First rate cinema and obviously a moment of pure genius for the film maker.",
         "This film sounded interesting but turned out to be a pretentious flop. The only good thing about it was the Portuguese scenery. It inspired a desire to visit that country. But the film itself was terrible. I usually like philosophical foreign films, but this one just seemed to be all style and no substance. Catherine Deneuve portrays her usual self: the intriguing ethereal beauty and Malkovich portrayed a low-key form of his usual self: quirky intellectual. But the plot just seemed pointless. The Professor did not seem to show any real interest in his alleged research. It did not seem clear why he came to this particular place to do the research. His wife did not seem interested in their relationship until she felt jealous. The mystery of the people living at the monastery was never explained. The music was disturbingly intrusive. The Faust story did not seem particularly relevant... I could go on and on about all the dissatisfying elements of this film. It was like a bad David Lynch movie...",
         "Regarding others opinions, this movie is not to bee seen vainly, or as a block buster from another big company. The plot although can be a bit boring in some way, it's enormously compensating by the story it self, the picture work (the movie photography is brilliant), and of course by the talent of the actors, the Convent (in fact was really a convent, i know, i have been there) is based upon a book of, Augustina Bessa-Luis called, \"As Terras do Risco\" (the lands of risk, as a free translation) if you do not like reading a good book,or if you are not interested in some of the Europe's culture, just go head, eat American trash. If you're reading habits are updated, (you may find it easy to understand it if you are familiarly whith Dr. fust's History), you really shuld not miss this one, it's a brilliant movie whith a great history from the oldest of film directors in the world (belive it see the date of his 1st movie).This is an artwork",
         "This film was just too mysterious at times and, even though I found it super provocative and ultimately, worthwhile: the end had me laughing out loud -- and I'm sure that wasn't the intended effect. I'm curious to know what others think: Does the professor actually make a visit to Piedad's room? Or is it a dream, as she describes? How do you read the professor's reaction when she describes her vision? \"I should stay far away from this lunatic.\" or \"She and her delusions are sooo hot.\" -- are a couple of options. How to interpret Piedad's flight into the forest -- is she doomed to fall prey to desire, does this demonstrate the flaw in \"goodness\"? What other movies by this director would you recommend? Are there similarities among them?",
         "Two stars for fairly competent cinematography. Good composition and good camera movement without glitzy focus-racking thru the forest. Malkovich and Deneuve are there only for their names. The real acting takes place with the Porteguese? actors. And they struggle with the pretentious dialog. The two worst offenses are committed by the director who explains the characters and their actions thru narration ( or awkward scenes with minor actors describing the main characters by using some vaguely occult terminology) rather than showing their characters and motivations thru their actions and their own dialog. It is a movie, after all, not an essay. Second offense is the music, which is overwhelming at times. Using Stravinsky with violent string passages to imply evil, danger, foreboding etc could work, but it didn't for this production. Just loud and annoying without any real matching action. It reminded me greatly of a university master's thesis film I worked on 37 years ago--(fortunately not mine). Lots of fantasy, lots of literary allusions, lots of mood, pointless scenery long shots, more than a few long takes that the director fell in love with and the editor was not inclined (or allowed) to abbreviate, and some really over-the-top acting moments (as when Baltar meets the prof's wife for the first time). Down, boy, down! I rented it because I am trying to catch up on some Deneuve films that I missed over the years, but I'm sorry I did. She must have really needed some money to have done this one."
      ],
      "genres": [
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Madragoa Filmes",
         "Gemini Films",
         "La Sept Cinéma"
      ],
      "summaries": ["The journey of Michael Padovic, an American professor who arrives with his wife, Helene, at a Portuguese convent where he expects to find the documents needed to prove his theory: Shakespeare was born in Spain; not in England."],
      "budget": 0
   },
   "movielensId": 827,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-06",
      "dvdReleaseDate": "2002-07-02",
      "directors": ["Manoel de Oliveira"],
      "runtime": 91,
      "movieId": 827,
      "title": "The Convent",
      "mpaa": null,
      "actors": [
         "Catherine Deneuve",
         "John Malkovich",
         "Luís Miguel Cintra",
         "Leonor Silveira"
      ],
      "imdbMovieId": "0112716",
      "originalTitle": "O Convento",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "The journey of Michael Padovic, an American professor who arrives with his wife, Helene, at a Portuguese convent where he expects to find the documents needed to prove his theory: Shakespeare was born in Spain; not in England.",
      "tmdbMovieId": 124614,
      "avgRating": 3.0988,
      "releaseYear": "1995",
      "numRatings": 167,
      "posterPath": "/8VJt6pezZPNJAFJtDxFsjSN25ok.jpg"
   }
}