{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "pinocchio",
            "id": 3244
         },
         {
            "name": "talk show",
            "id": 3741
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "crime",
            "id": 14536
         },
         {
            "name": "poor people",
            "id": 207840
         },
         {
            "name": "boys",
            "id": 216919
         }
      ],
      "imdb_id": "tt0115472",
      "video": false,
      "title": "The Adventures of Pinocchio",
      "recommendations": [
         216971,
         102492,
         138311,
         17745,
         83489,
         31220,
         18417,
         42001,
         23056,
         19042,
         26258,
         145960,
         35645,
         25697,
         17711,
         11511,
         22466,
         17834,
         17949,
         129014
      ],
      "backdrop_path": "/nb1RxvAZjWf2w7al9GFtnP7ogkp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Geppetto",
               "gender": 2,
               "credit_id": "52fe47af9251416c750a20d5",
               "name": "Martin Landau",
               "profile_path": "/ylT7pqkcPNsHloe2dJsePFSoIkE.jpg",
               "id": 2641,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pinocchio",
               "gender": 2,
               "credit_id": "52fe47af9251416c750a20d9",
               "name": "Jonathan Taylor Thomas",
               "profile_path": "/1S8DpfNv6iiQRuKFPtb5u6sCQ5G.jpg",
               "id": 53283,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Leona",
               "gender": 0,
               "credit_id": "52fe47af9251416c750a20dd",
               "name": "Geneviève Bujold",
               "profile_path": "/qqtni1dpO3b7nDeG9NOxKAPk7yM.jpg",
               "id": 35341,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lorenzini",
               "gender": 2,
               "credit_id": "52fe47af9251416c750a20e1",
               "name": "Udo Kier",
               "profile_path": "/sTNpaKOBNi7WUJw7jPDrsbGAL4O.jpg",
               "id": 1646,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Felinet",
               "gender": 1,
               "credit_id": "54e62ac292514121f6000594",
               "name": "Bebe Neuwirth",
               "profile_path": "/xm58rpMRVDHS0IGttw1pTlqGwkN.jpg",
               "id": 10739,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Volpe",
               "gender": 2,
               "credit_id": "54e62acac3a3685fd40003e1",
               "name": "Rob Schneider",
               "profile_path": "/vDbjHkAc4OMKObi9W5xW9OuDhDI.jpg",
               "id": 60949,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lampwick",
               "gender": 2,
               "credit_id": "54e62ad492514121f2000414",
               "name": "Corey Carrier",
               "profile_path": "/vG4WOj5M5IYFf0Mnl8bUs7zhoCr.jpg",
               "id": 94968,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Pepe (voice)",
               "gender": 2,
               "credit_id": "54e62ae392514121f80003db",
               "name": "David Doyle",
               "profile_path": "/o5ugOCZoaqkz8tjLtGgYZ6PGth4.jpg",
               "id": 123632,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Baker's Wife",
               "gender": 1,
               "credit_id": "54e62aeec3a3685fd6000418",
               "name": "Dawn French",
               "profile_path": "/gXJCY176QwRiQOjROeqTRCqvoya.jpg",
               "id": 5539,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47af9251416c750a20e7",
               "name": "Steve Barron",
               "profile_path": "/3T5EQ8u1yfz3MIAYV1VQHGLVhSC.jpg",
               "id": 18308,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47af9251416c750a20ed",
               "name": "Collodi",
               "profile_path": "/sMMNkbghC5alRHZEblJA0T4c9uO.jpg",
               "id": 67372,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe47af9251416c750a20f3",
               "name": "Sherry Mills",
               "profile_path": null,
               "id": 1111142,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "553b35afc3a3685cf8004e0c",
               "name": "Phil Dale",
               "profile_path": null,
               "id": 1448043,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 10.0049,
      "production_countries": [
         {
            "iso_3166_1": "CZ",
            "name": "Czech Republic"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 18975,
      "vote_count": 72,
      "budget": 0,
      "overview": "One of puppet-maker Geppetto's creations comes magically to life. This puppet, Pinocchio, has one major desire and that is to become a real boy someday. In order to accomplish this goal he has to learn to act responsibly. This film shows you the adventures on which he learns valuable lessons.",
      "similar": [
         1265,
         17663,
         13,
         9738,
         8967,
         10830,
         49524,
         35,
         72105,
         137106,
         587,
         118,
         433,
         10009,
         309809,
         1259,
         1903,
         5176,
         1213,
         40807
      ],
      "original_title": "The Adventures of Pinocchio",
      "runtime": 90,
      "poster_path": "/fT5b16eeBcroK6OhsmxYPTv36gQ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Kushner-Locke Company",
            "id": 2499,
            "origin_country": ""
         },
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Savoy Pictures",
            "id": 11308,
            "origin_country": ""
         }
      ],
      "release_date": "1996-07-26",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "A new angle on the classic tale... And that's no lie!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Barron"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Sherry Mills",
         "Steve Barron"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0115472/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4ODU3NjQwNl5BMl5BanBnXkFtZTYwODU0NzI5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Martin Landau, Jonathan Taylor Thomas, Geneviève Bujold | See full cast and crew »"],
      "reviews": [
         "This is one of the better \"family films\" that adults would still enjoy, and I don' mean to use that as a cliché. Suffice to say it's a fast-moving story, is creatively done and looks super on DVD. This was a stunner, visually-speaking. The creativity - especially for a film 10 years old - involves the wonderful special-effects that make the famous wooden puppet so lifelike. I haven't seen it in eight or nine years but when this came out first on VHS I remember being shocked at the visuals and how real things looked. This is not an animated film, and the story is a bit different from other versions. How faithful this is to the original story, I cannot tell you, because I never was a big fan of the story. I can tell you, however, that Martin Landau is very good playing Pinochhio's creator \"Geppetto.\" I found it interesting that the cricket in this story was called \"Pepe,\" not Jiminy Cricket. At any rate, this is a nicely-done version of the famous kids' story.",
         "This is certainly a well done movie, with an all-star cast. However, the intended target audience of this film is unclear. While little kids, who know of Pinocchio from story books and the Disney Animated Classic, are sure to enjoy the outstanding animation of the puppet, will most likely be frightened by many of the other scenes. Older kids, teenagers, and many adults often consider themselves too old for the story of Pinocchio; with a few exceptions. There's also a couple other scenes in the film which make it objectionable for younger children. One scene makes repeated use of the word \"jack-a**\"; while referring to donkeys, as in the original story, the word seems a little over used for a film that has a \"G\" rating in Canada (not sure of the US rating). Another objectionable scene is at the end when \"real boy\" Pinocchio, tells a lie to two of the films villains, knowing that his nose won't grow anymore. To me this counter-acts the lesson to be learned by having his nose grow when he lies in the first place. Over all the film is still really well done, and very touching (provoking tear-ducts in places). The acting is excellent and the direction seems good. The script on the whole seems good, apart from the few objectionable scenes, which make me wonder what the film's target audience is meant to be; as opposed the recent Disney musical version, titled \"Geppetto\", which was definitely family-oriented.",
         "It's hard for me to believe this movie had received such a low rating when it deserves wonderful reviews. Adventures of Pinocchio is a true gem, so perfect, so unique, that it can only be defined as a work of art. You don't have to believe me, just rent it today. I have watched this movie several times and is one of my favorite movies of all times.",
         "This is a lavish, sumptuously-mounted version of the classic story. Great costumes and location work, with Prague as 18th-century Italy. Top-notch FX: Pinocchio himself; Pepe (not Jiminy) Cricket; a hUge, whale-like sea monster; boys morphing into jackasses. Good cast: Martin Landau (fresh from his Oscar-winning portrayal of Lugosi in \"Ed Wood\") as Gepetto; Genevieve Bujold, whom I hadn't seen in ages (and who is aging very nicely), as his long-term love interest; Udo Kier as the heavy; plus an assortment of other character actors mostly unknown to me. Altogether well-done, its only drawbacks being a couple of lame songs, plus occasional slapstick for the kiddies. And it must be admitted, the Diz cartoon is a tough act to follow.",
         "Don't get me wrong, I really like this movie. The star is Pinnocchio himself, with a very likable voice over by Jonathan Taylor Thomas, with very careful design by Angus Bickerton. Also superb is Martin Landau as Geopetto, who brought charm and sadness to the role. The only things that weren't so well done were Jiminy Cricket, though David Doyle voiced him with spirit,(it's just his character animation was a bit mechanical) and Udo Keir's villain did little for me, but that is just me being picky. The film is lavishly designed, especially with the scenes with the puppets with the sets that look like something out of an opera or vaudeville. Also Rachel Portman's score was beautiful, very dynamic and sometimes moving in the more slower bits. Comparing this to the Disney film, this is a lot more faithful to the book by Carlo Callodi, but the Disney film has charm and a certain darkness that isn't quite there here, but it is evident. All in all, a highly underrated and beautiful film. 7/10 Bethany Cox.",
         "Had this version of Pinnochio been made by a major Hollywood studio we would have had adverts on TV, all the major cinemas would have run it for weeks and we would never have heard the end of it. I saw this premiered at the Edinburgh Festival where the running time was listed as 180 minutes (so far as I can recall) and I thought we were half way through when in fact there were just 15 minutes to go. After the premier, it vanished from sight and I never heard nor saw any sign of it again. What a terrible waste. The film deserves better. My only disappointment was when the puppet turned into a chubby little boy but, after the excellent blending of animation with live action, this was a minor niggle. I found the film entertaining on several levels and strongly recommend it to film clubs and people with large screens - I suspect this is a film that does not work nearly so well on an average television set - a full-sized cinema or large Home Cinema system with surround sound is what it needs to do it justice.",
         "So, I've watched Pinocchio. So, what do I think about it? Let's begin with the good parts. We have Prague, Český Krumlov and Croatia serving as the sets, I adored that, and it makes the movie better because of it. The music matches the tone of the scenes and gives a nice feeling to it. The puppet of Pinocchio is also a nice piece of professional craftsmanship and is properly used in the movie production. And there is Martin Landau playing as Gepetto and it is obvious he's doing a good job at it. But then everyone with a human brain that is properly functioning and isn't here for a cheesy half-dead experience starts to think about what the movie shows them. And then this movie falls apart. The writing is bad and that is obvious. I'm not going to do a scene analysis but just going to pick the biggest sore points I saw in this movie. For instance, we have Pepe the Cricket. I think he is supposed to be reminiscent of Jiminy Cricket in some way, but he is not helping Pinocchio really as a supporting character. I think Pinocchio just found everything he needed to know out on his own and Pepe did not really help in that. His jokes also aren't funny and he is just plain annoying. And whereas with the Disney version we clearly understood why Jiminy was doing what he was doing because the Blue Faerie asked him to do so, Pepe is just a stalker doing things for no reason or motive whatsoever. The second problem is Pinocchio's quest to become a real boy. It is contrived and comes out of nowhere and only seems to exist ''just because all Pinocchio versions are based around that''. But here there are no promises regarding him becoming a real boy if he fulfills a certain condition (like the Blue Faerie gave him in the Disney version after he was made alive and in the book at a certain point in the story), but here it is blatant wish-fulfillment and because miracles come from the heart. Yeah, that is a great idea for writing. The third problem is the lore of the world in general. Lore is information we learn about the universe of the story and what makes it tick. Some parts are nicely set up, like how Gepetto's emotional impact on a tree makes the magic in it alive so he could years later find it again and make a puppet out of it. And of course there is the water that turns people into animals they are mostly in common with and how Pinocchio escapes that by the holes in his body. It could've been done better but we understand why things are the way they are. However, there are major holes that a bit of rationalizing aren't going to save. This is mostly due to poor exposition. For instance: at the end of the story we learn that Lampwick was turned back into a human because he did a lot of good deeds. Wait, what? We only were told that the water turned people into animals, not how to resolve that. If we as the audience could learn about what the solution was against it, and it turned out to be good deeds, then we understood what their next plan was and how Lampwick could resolve his tiny problem. And also, if good deeds are the answer, wouldn't any hard-working donkey-kid turn back after a certain amount of time? Weird. And then there is the problem regarding the foreman turning into a monster \u0096 wait, that isn't an animal. Why not a vicious wolf or bear or any other animal that can fit his metaphor? The fourth problem are Volpe and Felinet (get it? Fox and Feline. Yeah, great satire here.) Whereas in the book they were brilliant and deceitful, and in the Disney movie they had a clear motive to what they were doing, they're suffering here from the same problem as Pepe; what are they doing anyways? I understood the part with Lorenzini because of the money and all that, but afterwards they don't really seem to have a purpose except for staying on screen and annoying everybody. O, yes, they're supposed to bring him back to Lorenzini but they're not trying to do that. Strange. And my last big problem is the teacher. If I were a teacher back then, I would have noticed that there is a boy in my class that isn't a student of mine, and, o yeah, is A WOODEN PUPPET. He does never question it but only remarks the nose, like he had more wooden puppets before as students. Great. Anyway, for those who were TL; DR: the atmosphere is good, the acting is decent but the story falls flat on its wooden face. And stories are kind of important.",
         "This well-intentioned adaptation of Carlo Collodi's book has its moments but it's all a bit blah. The Pinocchio puppet, brought to life using a mixture of CGI, animatronics and stop-motion animation, is very well realised, and the costumes and cinematography give the movie a sense of class. But there's no real heart here, no sense of wonder. Director Steve Barron doesn't have the visual style necessary for a story like this and pushes his film through the plot as though he's trying to tick off the chapters as quickly as possible. A missed opportunity, then, but a lot better than the ineptly directed sequel 'The New Adventures of Pinocchio', which features a terrible performance from Udo Kier and a typically sequelish role reversal plot in which Geppetto becomes a puppet. Devoid of inspiration.",
         "I really hate the Disney movie of Pinocchio. Why? Because it totally destroys the real Pinocchio's image. Pinocchio isn't a such kid-friendly story in his original BOOK (yes, it is a book, not a fairy tale) written by Carlo Collodi. It was a story for everyone yes, but it was also pretty dark and edgy too! That's why I absolutely love this movie (and hate to the death that awful sequel). I know, like the Disney one, it doesn't follow perfectly the plot of the book, but the big difference is that it actually have MORE things from the book than the Disney one. Also, the book has a pretty long story with lots of things that are difficult to put in a hour and half movie (Roberto Begnigni tried to do that, and we all know that the result was horrible). The classic special effects without CGI are amazing and the acting is great. The style of the movie reminds me a little Terry Gilliam's \"The Adventures of Baron Munchausen\" (1988). This movie is really magic to me and it has all the atmosphere and style of the original book. If only people read more Collodi's book (wich is amazing) and watch less the Disney movie, everybody would agree with me. This is by far my favorite Pinocchio movie, and one of my favorite movies of all time.",
         "Saw it on DVD, pretty good transfer from film. I can't give it a very high rating as a film, it was a bit muddled at times in exactly what it was trying to convey. But the wooden puppet looked very life-like, his \"education\" was handled very well, and in the end the message of where life really comes from is very clear. My favorite part, however, was listening to Stevie Wonder sing the songs he wrote for the film. I bought the DVD to give to my grandchildren, 7 and 10. It will be interesting to see how they react to it."
      ],
      "genres": [
         "Fantasy",
         "Family",
         "Adventure",
         "Musical"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Savoy Pictures",
         "Twin Continental Films"
      ],
      "summaries": ["One of puppet-maker Geppetto's creations comes magically to life. This puppet, Pinocchio, has one major desire and that is to become a real boy someday. In order to accomplish this goal he has to learn to act responsibly. This film shows you the adventures on which he learns valuable lessons."],
      "budget": 25000000
   },
   "movielensId": 828,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1996-07-26",
      "dvdReleaseDate": "1997-09-24",
      "directors": ["Steve Barron"],
      "runtime": 90,
      "movieId": 828,
      "title": "The Adventures of Pinocchio",
      "mpaa": "G",
      "actors": [
         "Martin Landau",
         "Jonathan Taylor Thomas",
         "Geneviève Bujold",
         "Udo Kier",
         "Bebe Neuwirth",
         "Rob Schneider",
         "Corey Carrier",
         "David Doyle",
         "Dawn French"
      ],
      "imdbMovieId": "0115472",
      "originalTitle": "The Adventures of Pinocchio",
      "genres": [
         "Animation",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["m8e2Hv-nO24"],
      "plotSummary": "One of puppet-maker Geppetto's creations comes magically to life. This puppet, Pinocchio, has one major desire and that is to become a real boy someday. In order to accomplish this goal he has to learn to act responsibly. This film shows you the adventures on which he learns valuable lessons.",
      "tmdbMovieId": 18975,
      "avgRating": 3.15067,
      "releaseYear": "1996",
      "numRatings": 1729,
      "posterPath": "/fT5b16eeBcroK6OhsmxYPTv36gQ.jpg"
   }
}