{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "racial segregation",
            "id": 6984
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "rural setting",
            "id": 11004
         },
         {
            "name": "african american",
            "id": 11243
         }
      ],
      "imdb_id": "tt0114039",
      "video": false,
      "title": "Once Upon a Time... When We Were Colored",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Poppa",
               "gender": 2,
               "credit_id": "52fe4b889251416c7510604b",
               "name": "Al Freeman, Jr.",
               "profile_path": "/tAN4hyguaYPAzqvmfrdxIVZKrPr.jpg",
               "id": 19739,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ma Ponk",
               "gender": 1,
               "credit_id": "52fe4b889251416c7510604f",
               "name": "Phylicia Rashād",
               "profile_path": "/88MQJyzIBPyCU9wQxt7NUvwVX7r.jpg",
               "id": 119598,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Ma Pearl",
               "gender": 1,
               "credit_id": "54639f570e0a267810002940",
               "name": "Paula Kelly",
               "profile_path": "/5SLeOYrCPAilNpHiwCv1BfTYTQb.jpg",
               "id": 157439,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Miss Alice (as Salli Richardson)",
               "gender": 1,
               "credit_id": "54639f670e0a2678060029a9",
               "name": "Salli Richardson-Whitfield",
               "profile_path": "/huQHvzHVULR965KGFcHSw9IYXbN.jpg",
               "id": 53918,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Miss Annie",
               "gender": 1,
               "credit_id": "54639f750e0a26780d002924",
               "name": "Anna Maria Horsford",
               "profile_path": "/aHGNsdQyfYiMsclGTlEPvvmZw3a.jpg",
               "id": 54800,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Walter",
               "gender": 2,
               "credit_id": "54639f820e0a2678060029af",
               "name": "Bernie Casey",
               "profile_path": "/rvL40yyewKgTDVm7doR1ym09sUj.jpg",
               "id": 10939,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Preacher Hurn",
               "gender": 2,
               "credit_id": "54639f91c3a36812590027a7",
               "name": "Isaac Hayes",
               "profile_path": "/4igh7emwzt4xBLw1r05gCUHxwzD.jpg",
               "id": 6542,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Cliff (12 Yrs.) (as Willis Norwood Jr.)",
               "gender": 0,
               "credit_id": "54639fa4c3a36812590027ac",
               "name": "Ray J",
               "profile_path": null,
               "id": 1384901,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Miss Maybry",
               "gender": 1,
               "credit_id": "54639fb20e0a26781000295c",
               "name": "Polly Bergen",
               "profile_path": "/f2AjVdpEIJ7Q0F69fEmGHVHzAEy.jpg",
               "id": 40175,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mr. Will",
               "gender": 2,
               "credit_id": "54639fbdc3a368125500297c",
               "name": "Taj Mahal",
               "profile_path": "/tEqFRK0vJFZsTgwMSLdUqnKKrRB.jpg",
               "id": 94511,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Uncle Melvin",
               "gender": 2,
               "credit_id": "55dffbadc3a368269b001561",
               "name": "Leon",
               "profile_path": "/ctcZ94ykGlCSh0s8QwRkYPCKAsq.jpg",
               "id": 12974,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b889251416c75106047",
               "name": "Tim Reid",
               "profile_path": "/o5euxJdZMwtQJ37AiaklK8jHKuM.jpg",
               "id": 27771,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54639f330e0a26780a0029ce",
               "name": "Paul W. Cooper",
               "profile_path": null,
               "id": 1216926,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54639f3e0e0a26780a0029d1",
               "name": "Clifton L. Taulbert",
               "profile_path": null,
               "id": 1384900,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.922012,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 146599,
      "vote_count": 2,
      "budget": 0,
      "overview": "This film relates the story of a tightly connected Afro-American community informally called Colored Town where the inhabitants live and depend on each other in a world where racist oppression is everywhere, as told by a boy called Cliff who spent his childhood there. Despite this, we see the life of the community in all its joys and sorrows, of those that live there while others decide to leave for a better life north. For those remaining, things come to a serious situation when one prominent businessman is being muscled out by a white competitor using racist intimidation. In response, the community must make the decision of whether to submit meekly like they always have, or finally fight for their rights.",
      "similar": [
         2675,
         112160,
         13,
         376867,
         393457,
         381284,
         277216,
         323677,
         50014,
         419430,
         11216,
         10637,
         9741,
         11631,
         334,
         8967,
         40807,
         110415,
         68718,
         41630
      ],
      "original_title": "Once Upon a Time... When We Were Colored",
      "runtime": 115,
      "poster_path": "/tsJSlkFSZPQhhVuKrYJXNClYaPD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "BET Pictures",
            "id": 38196,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Image Entertainme",
            "id": 38197,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-26",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tim Reid"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Clifton L. Taulbert",
         "Paul W. Cooper"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114039/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NDk2MDcyNV5BMl5BanBnXkFtZTcwMTQxNTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Al Freeman Jr., Phylicia Rashad, Leon | See full cast and crew »"],
      "reviews": [
         "Tim Reid has not been \u0091that guy from WKRP' for some time now. And no, he wasn't Isaac on The Love Boat either. He still finds himself in too many schlocky TV movies, and weak situation comedies. One must pay the rent, and no one can argue with that. More and more a champion of black film, he has been careful, deliberate in his choice of projects. Once Upon a Time When We Were Colored, elevates him, appropriately, as a serious filmmaker, black, white, or otherwise. This is not a \u0091new' film, but it is a different approach. An insightful look into Afro-American existence during turbulent times, the focus is on the community, rather than the oppression, the individuals rather than the cause. The result is every bit as effective in getting the message across. \u0091You get more flies with honey\u0085' Al Freeman Jr. gets a well-deserved opportunity to show that he's not just some kind of TV Morgan Freeman. His portrayal of Poppa, the family patriarch is wonderful and slighted unfortunately by the Academy. Even the Image awards overlooked him, preferring to bestow honor on the over-cooked and under-talented Phylicia Rashad, one of the only weak links in this strong cast. Bernie Casey and Richard Roundtree both play well against their macho-type. Don't expect to be hit over the head with the ideas of this film. Just let it ease you on down the road, and, take a look around, every so often as you do.",
         "\"Once Upon a Time When We Were Colored\" (1996): Set in the deep American South, over the years 1946-1962, and told as biography, this is the story of one boy's memories of being raised in the Cotton & Bible Belt. He's poor, his family is in pieces, he's Black, he's surrounded by the KKK\u0085and yet, this is a soft, even soft-focus look back at the people who DID provide community family, did not dwell on their poverty nor make their race the focal point of a normal day. We are so accustomed to angry, relentlessly violent films about the racial divides, this film could easily be taken as a Hallmark Card presentation\u0085but SOMETHING about it tells me otherwise. Yes, problems are depicted, and yes, the times they were a-changin', but not as fast or dramatically as we've come to accept from the quick flip of a few pages in history class. I LIKE the pace of this film. It's slow, warm, often funny, occasionally sugary, sometimes sad or maddening, but for the most part it's a nostalgic look back at the GOOD parts of black author's childhood.",
         "The author's stated intention was to show the family that nourished him and protected him from the world of hatred and segregation. The film showed just enough of the segregated life to let the viewer know that Cliff needed to be protected from that world and nurtured to overcome the scars that outside world could inflict. I think Taulbert and the movie did a good job of showing how the love of his immediate and extended family could compensate in some way for the hatred and oppression of the outside world. I hate to see the movie berated for not being a documentary of all the hateful excesses of the segregated South when that was not the movie's intent. We have films that are considered classics that are about different parts of World War II, and they don't document all the atrocities of the Holocaust. Not focusing on parts of an era that are not the main point of the film is not \"sugarcoating.\" It's an excellent film about growing up in a loving family and overcoming challenges through the love and support of others. It's fine the way it is.",
         "I am very fond of this film, and I have had the opportunity to hear Clifton Taulbert speak in person. I think the point of the film is that while black people who had to endure much during the 100 years that followed the civil war they still managed to create many supportive communities. In addition there were good role models for young people like Clifton Taulbert. As a response to the undeniable oppression, the black community of Glen Allen, Mississippi, bonded and supported one another. It did, in fact, mean that their lives were made less miserable. They experienced joy and fellowship as well as oppression. They refused to take on victim-hood as an identity. At the same time, there was a vigorous challenge to the status quo. I don't think the movie is too sentimental, or inaccurate. I have shown this movie to students many times and it has never failed to move them to a real concern for the condition of minorities. It reaches these students on an emotional level, and it gets them interested in learning more about the issue of human rights. That is no small feat.",
         "This was a very nice, scaled down version of how it really was in the Deep South. The movie did not even begin to depict the real horror Blacks faced each day. There was just a hint of the KKK, Jim Crow and the plantation mentality Blacks had to endure. I kept waiting for those historical, explosive events, we all knew to be the law of the land, to explode onto the screen, but it never happened. Life was unbearable; Blacks were looked upon as animals and treated as such. I walked away from this movie feeling like life was almost a bowl of cherries. I find it so odd that people are tired of hearing about the Black experience but never get tired of all the holocaust movies. 6 million Jews were slaughtered over a 6 year period (approx) -- hundreds of thousand Blacks were hung, beaten, raped, shot, humiliated and abused to death over a period of 150+ years, not to mention the suicides that took place on the slave ships in route to America. Admittedly, the holocaust was an atrocity, hopefully never to be repeated, while discrimination of Blacks is still a reality. Too bad there are no great movies that tell the Black Plight the way it should be told.",
         "I kept waiting for the bad moments to happen, as so often they do in these reminiscent movies of growing up in the south, yet no real drama occurred. These were moments pieced together, and if that was the intent--it worked. True, a child's reflection of childhood would be pieces of memory chained loosely together, impressions of events, people, and times. However, when the movie ended I thought, \"That's it?\" There were fine performances; however, the plot seemed to soft-step around the real issues, such as the Jim Crow laws, segregated schooling, subservient wages, and escaping to the north to avoid the subjugation. We got breadth, when depth might have made a much more interesting plot line.",
         "***SPOILERS*** ***SPOILERS*** ....When We Were Colored is a well-intentioned, visually appealing movie that suffers from a pointless script and some poor acting. I try to recommend movies that paint a true picture of Americana - warts and all - especially those with historical slants, but this one has too many holes to make it worthwhile. If you're looking for reasons to see it, here are a few: Positives: Al Freeman Jr. as \"Poppa\" is very good. He was the only believable character in the story. The \"look\" of the old south is very authentic, and great care was taken in securing vehicles, signage, clothing, etc. The music is \"OK\", especially in the Juke Joint scene, but I would have expected more in a film examining black southern culture during the time period. Negatives: The plot is really just a bunch of cliches lopped together. Sure, a five year old kid in the deep south in the 1940s would be influenced by segregated bathrooms and water fountains, and the sight of a KKK parade down mainstreet, but (for the purposes of this film) so what? We've seen these images before (see recommendations below), and here they have absolutely nothing to do with the plot. An inordinate amount of time is spent on a peripheral character, Cliff's cousin (?) Melvin, who returns from Detroit to tell everybody how great it is up there. All he does is get in a knife fight, pick up some girl we never met before, and go back to Detroit. Again, what does this have to do with the plot? There are other well-intended, heart-string tugging moments, like the death of a family member, but such events are by no means uniquely southern, uniquely black, nor unique to the time period. (Spoiler ahead) Geesh, everybody's grandparents have died. Finally, while most of the cast is at least passable, some of the school-age boys look and sound like they were pulled off current-day schoolyards and shoved into knickers. I didn't find their dialogue to be particularly southern in its derivation. As I say, I hate to pan a well-intentioned movie like this, and for some, just seeing what life in the deep south earlier in the last century may be enough - it does seem to be authentic. It could be argued that this is just a \"slice of life\" movie with no real intention other than to educate, but I felt as if I had seen it all before. If you want good movies on related topics, try Driving Miss Daisy (closest in time period - the final scene makes me cry), Four Little Girls (great documentary by Spike Lee), Ghosts of Mississippi (not a great film, but at least historically interesting), Mississippi Burning, Eve's Bayou (the best of these movies), The Color Purple, or even Soul Food (more contemporary, but an interesting story of black family life). There are many more...."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "BET Pictures",
         "United Image Entertainment"
      ],
      "summaries": [
         "This film relates the story of a tightly connected Afro-American community informally called Colored Town where the inhabitants live and depend on each other in a world where racist oppression is everywhere, as told by a boy called Cliff who spent his childhood there. Despite this, we see the life of the community in all its joys and sorrows, of those that live there while others decide to leave for a better life north. For those remaining, things come to a serious situation when one prominent businessman is being muscled out by a white competitor using racist intimidation. In response, the community must make the decision of whether to submit meekly like they always have, or finally fight for their rights.",
         "A narrator tells the story of his childhood years in a tightly knit Afro-American community in the deep south under racial segregation."
      ],
      "budget": 0
   },
   "movielensId": 83,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-26",
      "dvdReleaseDate": "1999-01-12",
      "directors": ["Tim Reid"],
      "runtime": 115,
      "movieId": 83,
      "title": "Once Upon a Time... When We Were Colored",
      "mpaa": "",
      "actors": [
         "Al Freeman",
         " Jr.",
         "Phylicia Rashād",
         "Paula Kelly",
         "Salli Richardson-Whitfield",
         "Anna Maria Horsford",
         "Bernie Casey",
         "Isaac Hayes",
         "Ray J",
         "Polly Bergen",
         "Taj Mahal",
         "Leon"
      ],
      "imdbMovieId": "0114039",
      "originalTitle": "Once Upon a Time... When We Were Colored",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["UwkAOHd8WRU"],
      "plotSummary": "This film relates the story of a tightly connected Afro-American community informally called Colored Town where the inhabitants live and depend on each other in a world where racist oppression is everywhere, as told by a boy called Cliff who spent his childhood there. Despite this, we see the life of the community in all its joys and sorrows, of those that live there while others decide to leave for a better life north. For those remaining, things come to a serious situation when one prominent businessman is being muscled out by a white competitor using racist intimidation. In response, the community must make the decision of whether to submit meekly like they always have, or finally fight for their rights.",
      "tmdbMovieId": 146599,
      "avgRating": 3.64911,
      "releaseYear": "1996",
      "numRatings": 617,
      "posterPath": "/tsJSlkFSZPQhhVuKrYJXNClYaPD.jpg"
   }
}