{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "los angeles",
            "id": 12670
         }
      ],
      "imdb_id": "tt0116531",
      "video": false,
      "title": "High School High",
      "recommendations": [
         12475,
         19326,
         20551,
         49345,
         20009,
         19087,
         22590,
         20759,
         2620,
         17949,
         55731,
         17796,
         9099,
         30963,
         8494,
         118430,
         12251,
         9835,
         16297,
         273610
      ],
      "backdrop_path": "/yKVSYyStSqy9vQH3d7RqnIpLWxs.jpg",
      "revenue": 21302121,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Richard Clark",
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06c5",
               "name": "Jon Lovitz",
               "profile_path": "/3Sw3X69m19FHSiSpv9cs4doBBfI.jpg",
               "id": 16165,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Victoria Chapell",
               "gender": 1,
               "credit_id": "52fe44e5c3a36847f80b06c9",
               "name": "Tia Carrere",
               "profile_path": "/s2y4Hj7ZIuEMyE0W3o8WCVcHwiL.jpg",
               "id": 13445,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Schuldirektorin Evelyn Doyle",
               "gender": 1,
               "credit_id": "52fe44e5c3a36847f80b06cd",
               "name": "Louise Fletcher",
               "profile_path": "/A4Cn7LsuLlOXvOMKv5ez4ThyeZL.jpg",
               "id": 7071,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Griff McReynolds",
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06d1",
               "name": "Mekhi Phifer",
               "profile_path": "/xrv9RDMPoTd9NsfpUzL81XglAmk.jpg",
               "id": 327,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Julie Rubels",
               "gender": 1,
               "credit_id": "52fe44e5c3a36847f80b06d5",
               "name": "Natasha Gregson Wagner",
               "profile_path": "/g4k8hwH33fbFbCJGzaV57YujCvV.jpg",
               "id": 3270,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Thaddeus Clark",
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b0715",
               "name": "John Neville",
               "profile_path": "/b6s37ak6b0ikhpVk6XVG56QWVqp.jpg",
               "id": 12642,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Natalie Thompson",
               "gender": 1,
               "credit_id": "53697092c3a36812380067c3",
               "name": "Malinda Williams",
               "profile_path": "/hx4vstXwizQOSuFQ8awWO7fcR7Y.jpg",
               "id": 74612,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Paco Rodriguez",
               "gender": 2,
               "credit_id": "5369709ec3a36812380067c5",
               "name": "Guillermo Díaz",
               "profile_path": "/hnWjRRud2n2rDI6NbaeSIeEOMcP.jpg",
               "id": 8695,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Mr. DeMarco",
               "gender": 2,
               "credit_id": "536970b8c3a368122600689f",
               "name": "Marco Rodríguez",
               "profile_path": "/sxb036JuWSn7IPYWIWwTEbpm3oj.jpg",
               "id": 73132,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Hulk",
               "gender": 2,
               "credit_id": "536970c3c3a36812260068a2",
               "name": "Eric Allan Kramer",
               "profile_path": "/hTMwSGZIwmvdt4hLFKK8yZXKykY.jpg",
               "id": 41125,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Rhino",
               "gender": 2,
               "credit_id": "54f36788c3a36832320051b6",
               "name": "Nicholas Worth",
               "profile_path": "/ohKOmHwBEyIrAUYSNQY2uNbSznN.jpg",
               "id": 100461,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Miss Bernie Wells",
               "gender": 0,
               "credit_id": "54f367d2c3a368322f004427",
               "name": "Lu Elrod",
               "profile_path": null,
               "id": 1433893,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06db",
               "name": "Hart Bochner",
               "profile_path": "/2gCrMv3yJlFQxloacxjTAcXGEAz.jpg",
               "id": 7678,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06e1",
               "name": "David Zucker",
               "profile_path": "/rJzWA35n0dsn4xecDGW8x7EkmKB.jpg",
               "id": 12987,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06e7",
               "name": "Pat Proft",
               "profile_path": null,
               "id": 12991,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06ed",
               "name": "Robert LoCash",
               "profile_path": null,
               "id": 13429,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44e5c3a36847f80b06f3",
               "name": "Sasha Harari",
               "profile_path": null,
               "id": 57244,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06f9",
               "name": "David Zucker",
               "profile_path": "/rJzWA35n0dsn4xecDGW8x7EkmKB.jpg",
               "id": 12987,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b06ff",
               "name": "Gil Netter",
               "profile_path": null,
               "id": 25455,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b0705",
               "name": "Ira Newborn",
               "profile_path": null,
               "id": 12939,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b070b",
               "name": "Vernon Layton",
               "profile_path": null,
               "id": 33282,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e5c3a36847f80b0711",
               "name": "James R. Symons",
               "profile_path": null,
               "id": 13432,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.252514,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9308,
      "vote_count": 59,
      "budget": 0,
      "overview": "Richard Clark has just left the well-known Wellington Academy to teach at Marion Barry High School. Now, he will try to inspire the D-average students into making good grades and try to woo a fellow teacher.",
      "similar": [
         14671,
         13342,
         37725,
         37735,
         272693,
         8363,
         449176,
         10625,
         40264,
         26123,
         121875,
         57214,
         2105,
         4951,
         9655,
         9377,
         52449,
         2108,
         8193,
         315635
      ],
      "original_title": "High School High",
      "runtime": 86,
      "poster_path": "/8KlvHpAoNoYx3xawMQRnzy16uk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1996-10-25",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "A Dangerous Mind is a terrible thing to waste",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hart Bochner"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "David Zucker",
         "Robert LoCash"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116531/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MDc4Mjk5OF5BMl5BanBnXkFtZTYwNTc0NTc5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Jon Lovitz, Tia Carrere, Louise Fletcher | See full cast and crew »"],
      "reviews": [
         "I've seen the movie about nine or ten times, so naturally many of the jokes--which I found hysterical at first--aren't that funny anymore. But I don't think they could've done a much better job at spoofing high school flicks like \"Dangerous Minds,\" \"Lean on Me,\" \"The Blackboard Jungle\" and \"To Sir, With Love.\" There are lots of witty moments that hit the bullseye. The jokes are not over-the-top, nor are they filthy and vomit-inducing like many recent spoofs. It's from the writers of \"The Naked Gun\" and the talent really shows. Jon Lovitz is funny, like usual. Tia Carrerre has never looked hotter, and serves as great eye candy. Louise Fletcher is appropriately creepy as the principal, who is sort of like a female version of Joe Clark--she also roams the hallways with a baseball bat. The young stars like Guillermo Diaz, Mekhi Pfieffer, Natasha Gregson Wagner and Brian Hooks are very good and their timing is just right. I would probably praise this movie a lot more if I submitted this comment after my first viewing, but trust me--it's very funny! But, like many broad comedies of this kind, it's not as enjoyable on repeat viewings. After having seen the latest spoof, \"Not Another Teen Movie,\" I'm able to appreciate this film a lot more. This is a spoof with wit and structure, and even has a few subtle in-jokes: the school is titled Marion Barry High. You get it? My score: 7 (out of 10)",
         "Jon Lovitz is possibly the most under-rated Saturday Night Live alumnus. While Mike Myers, Adam Sandler and others have gone on to bigger things, Lovitz has primarily been background fodder for the other ex-cast members. And he's good at this, but he's also good on his own - as this movie proves. High School High was the best school movie parody of its time (before \"Not Another Teen Movie\"), taking \"Dangerous Minds\" and making a plot we should actually care about and enjoy. And we also have Tia Carrera (not to be confused with Asia Carrera). Lovitz plays a history teacher who wants to turn a school full of unwanted students into a fleet of tomorrow's best and brightest. With help from his street smarts and an intense chicken race scene, he might just accomplish his goals. But, oh no, what happens when a rival gang steals the tests or the class valedictorian turns to dealing drugs? You're just going to have to watch and see. Recommended (unless you don't like Lovitz, but then you have no sense of humor anyway).",
         "Although it was co-written by David Zucker, this comedy is more conventional than, say, the \"Naked Gun\" series; it doesn't have the same rapid-fire, relentless pacing. However, it does have a number of successful gags (when the teacher enters the ghetto area, his car radio will play ONLY rap music), and, of course, the gorgeous Tia Carrere....wow! (**)",
         "A naive but dedicated educator (Jon Lovitz) decides to teach at the roughest high school in L.A. and once he arrived at this new job, he finds out the conditions at this school is tough, violent and students don't want to know anything about higher education. This educator befriends with an beautiful teacher (Tia Carrere) and an student (Mekhi Phifer), who wants an education. But this student has troubles with his previous gang members, especially with the leader (Guillermo Diaz). Who still wants him to sell drugs on the streets. This educator also has trouble with passionless principal (Oscar-Winner:Louise Fletcher) but he finds a way to teach his most unlikely students and giving them hope for education, which they never had before. Directed by Canadian actor:Hart Bochner (PCU) made an amusing comedy that spoofs films like \"Dangerous Minds\", \"Stand and Deliver\", \"The Deer Hunter\" and other memorable films. Lovitz is extremely likable and he has some very big laughs in this silly comedy. Although this comic spoof is unusually realistic at other moments also. The film has an good message for any students for those who wants an education and to have a bright future but it is also hard, what it's wants to be. Ambitious to be sure but always watchable. Written by David Zucker (Airplane!, Baseketball, Ruthless People), Robert LoCash (CB4:The Movie, Naked Gun 33 1/3:The Final Insult) and Pat Proof (Hot Shots 1 & 2, Bachelor Party, Police Academy). (*** ½/*****).",
         "Spoofing 'Dangerous Minds,' 'Lean on Me,' and others, Jon Lovitz stars in 'High School High' as an ambitious, optimistic teacher from a prep school who wants to prove to his father that he is perfectly capable of inspiring his students at an inner-city high school. While there, he inadvertently becomes involved in a turf war between two rival students and their idiotic posses. Time capsule movie spoofs the mid 90s scene of hip hop has one gag after another, but is probably more destined for laughs for younger teenagers or first-time viewers. I caught this movie on cable after not having seen it in a few years and didn't think it was as funny as I first remember it. Best recommended for Jon Lovitz fans, as he always does well as the clueless doofus. With Tia Carerre, Louise Fletcher, Mekhi Phifer, and Guillermo Diaz.",
         "Yes, I'll grant you this movie is less than perfect. The storyline doesn't always make sense. Not every joke works, but the movie's batting average is high enough to justify seeing it. And it's funnier to me than every Adam Sandler/David Spade/Chris Farley movie I've ever seen, in part because the three of them are nothing but annoying. Jon Lovitz, on the other, is a likable everyman you can root for. He carries the movie. Lovitz is an underrated comedian who always makes the material seem better than it is. His delivery and timing help make this movie enjoyable. And of course, Tia Carrere is absolutely gorgeous. I'm not saying \"High School High\" is a classic. But I was amused by it. Like any Zucker production, the gags come fast and furious. They don't all work, but enough hit the target to make it worth seeing.",
         "Pretty boring slapstick comedy about a school teacher (Jon Lovitz) who is sent to teach at a school in the \"hood.\" Lovitz does his usual routine in this lackluster Jim Abrahams-scripted comedy. It has its occasional moments but it's just not good enough to qualify for a feature film. Maybe a brief \"SNL\" skit, but not a movie. I think Lovitz is pretty funny, and without him there would have been no Phil Hartman on \"SNL\" (literally! check out his bio on IMDb for more info), but here he does his same old schtick with the same old gags. It's not very funny. Lovitz would perfect his overwhelmed everyman role in \"Rat Race\" (2001). But here he seems more overwhelmed with the quality of the film, which isn't too terribly surprising. 2/5 stars. - John Ulmer",
         "High School High is a very decent spoof comedy written by comedic geniuses Pat Proft and David Zucker. You recognize all these ordinary high school dramas like Dangerous Minds, The Substitute, High School Confidential and many others. And off-course there's many very absurd scenes that is very common to screenplays by Zucker. Also you can enjoy performance of Jon Lovitz. His character Richard Clark isn't stupid and clumsy like we know all Leslie Nielsens characters but just naive. At the same time Lovitz doesn't leave a strike that he is taking it all too seriously. Louise Fletcher's and Tia Carrere's performances were in full seriousness at the same time. They both played like in usual roles in usual high school films. High School High is a bit underrated but might not be as brilliant than the other films by Zucker/Craft but still it has it's moments.",
         "I would have to say the highlight of this movie was the drunk guy at the end of my row puking about halfway through. Jon Lovitz was at his annoying worst and the rest of the cast was completely unfunny. This is an hour and a half of my life that I will never have back and for that I am truly sorry.",
         "Underrated but lovable film which takes all the cliche high-school movie scenes (many of them awful), mixes large dollops of political incorrectness, throws in sophomore humor only a guy could love, and tops it off with a fun good-guys-win-in-the-end finale. Ever affable Lovitz and ever gorgeous Carrere are an oddly suitable couple and Fletcher is filthy evil (and that's before you know the ending). Lots of furious gags in the Zucker tradition (the school nurse stapling condoms to info cards is an example). Look for `The Hughley's' Eric Allan Kramer as a muscle man who likes to frisk just a wee-bit too much."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Zucker Brothers Productions"
      ],
      "summaries": ["Richard Clark has just left the well-known Wellington Academy to teach at Marion Barry High School. Now, he will try to inspire the D-average students into making good grades and try to woo a fellow teacher."],
      "budget": 0
   },
   "movielensId": 833,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-25",
      "dvdReleaseDate": "1998-03-31",
      "directors": ["Hart Bochner"],
      "runtime": 86,
      "movieId": 833,
      "title": "High School High",
      "mpaa": "PG-13",
      "actors": [
         "Jon Lovitz",
         "Tia Carrere",
         "Louise Fletcher",
         "Mekhi Phifer",
         "Natasha Gregson Wagner",
         "John Neville",
         "Malinda Williams",
         "Guillermo Díaz",
         "Marco Rodríguez",
         "Eric Allan Kramer",
         "Nicholas Worth",
         "Lu Elrod"
      ],
      "imdbMovieId": "0116531",
      "originalTitle": "High School High",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["jBGru6cBEdU"],
      "plotSummary": "Richard Clark has just left the well-known Wellington Academy to teach at Marion Barry High School. Now, he will try to inspire the D-average students into making good grades and try to woo a fellow teacher.",
      "tmdbMovieId": 9308,
      "avgRating": 2.71154,
      "releaseYear": "1996",
      "numRatings": 1560,
      "posterPath": "/8KlvHpAoNoYx3xawMQRnzy16uk.jpg"
   }
}