{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tattoo",
            "id": 331
         },
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "harassment",
            "id": 2539
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "teenage girl",
            "id": 10809
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116353",
      "video": false,
      "title": "Foxfire",
      "recommendations": [
         28026,
         44895,
         21811,
         41944,
         86913,
         43079,
         42548,
         34376,
         40562,
         31421,
         9382,
         37636,
         22597,
         48781,
         177851,
         82432,
         52855,
         5247,
         26674,
         12793
      ],
      "backdrop_path": "/oo3FJDYDnkL1XQNzHfMLdUOC5QT.jpg",
      "revenue": 258263,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Legs Sadovsky",
               "gender": 1,
               "credit_id": "52fe47869251416c7509c7f3",
               "name": "Angelina Jolie",
               "profile_path": "/6tocswK39SrSjZIRDaTpVyPxDz8.jpg",
               "id": 11701,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Maddy Wirtz",
               "gender": 1,
               "credit_id": "52fe47869251416c7509c7f7",
               "name": "Hedy Burress",
               "profile_path": "/mktE9DQDLIbycur8Y78QO4KscRg.jpg",
               "id": 41558,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rita Faldes",
               "gender": 1,
               "credit_id": "52fe47869251416c7509c7fb",
               "name": "Jenny Lewis",
               "profile_path": "/gAsEK7zcS8PUJxdakQLwN8iaXy3.jpg",
               "id": 91415,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Goldie Goldman",
               "gender": 1,
               "credit_id": "52fe47869251416c7509c7ff",
               "name": "Jenny Shimizu",
               "profile_path": "/6wZZdFbhFBOIefrQ3MtD4HelaHB.jpg",
               "id": 119311,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Violet Kahn",
               "gender": 1,
               "credit_id": "52fe47869251416c7509c803",
               "name": "Sarah Rosenberg",
               "profile_path": null,
               "id": 119312,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Ethan Bixby",
               "gender": 2,
               "credit_id": "58a4df4bc3a3682c1d00019e",
               "name": "Peter Facinelli",
               "profile_path": "/jVlwcMxC0mtWttvvSbovybpLrBX.jpg",
               "id": 56857,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dana Taylor",
               "gender": 2,
               "credit_id": "58a4df72c3a3682c2e0001ca",
               "name": "Dash Mihok",
               "profile_path": "/jnruNUJv57nNtO66SR3oJ5tQuM5.jpg",
               "id": 6066,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Cindy",
               "gender": 1,
               "credit_id": "58a4df9e925141490a000215",
               "name": "Michelle Brookhurst",
               "profile_path": null,
               "id": 154481,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Bobby",
               "gender": 2,
               "credit_id": "58a4dfd0c3a3682bf5000202",
               "name": "Elden Henson",
               "profile_path": "/nX2c32A2ppiw5IC86zUM4JTLpoz.jpg",
               "id": 20220,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Martha Wirtz",
               "gender": 1,
               "credit_id": "58a4dffec3a3682c1d0001fa",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mr. Parks",
               "gender": 2,
               "credit_id": "58a4e0209251414b4c00019e",
               "name": "Richard Beymer",
               "profile_path": "/9jOYQIu3jVAhMNMUKG50Q6TdEmv.jpg",
               "id": 6679,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Mr. Buttinger",
               "gender": 2,
               "credit_id": "58a4e046925141490a000275",
               "name": "John Diehl",
               "profile_path": "/hDUvgqpIv753skoeRGjVw6gYp7A.jpg",
               "id": 4942,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Girl in Print Shop",
               "gender": 1,
               "credit_id": "58a4e0709251414913000289",
               "name": "Ever Carradine",
               "profile_path": "/hXuT4YFpD0Fwb7Ez7b3W3KkOhHn.jpg",
               "id": 41557,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "First Geek",
               "gender": 2,
               "credit_id": "58a4e08b925141490f000260",
               "name": "Joel David Moore",
               "profile_path": "/y6AyGCsQHLoi4LegSS7VRtgRyJe.jpg",
               "id": 59231,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47869251416c7509c7ef",
               "name": "Annette Haywood-Carter",
               "profile_path": null,
               "id": 119310,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53af2138c3a3682edf003cd3",
               "name": "Joyce Carol Oates",
               "profile_path": null,
               "id": 222472,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "53af214ec3a3682ee2004081",
               "name": "Elizabeth White",
               "profile_path": null,
               "id": 1335313,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a7d32b20e0a263e82000f6a",
               "name": "Alan Locke",
               "profile_path": null,
               "id": 1881500,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5a7d32cc0e0a263e8b000fee",
               "name": "Newton Thomas Sigel",
               "profile_path": "/mTauZZzOY0fhpNkNjeOeDHDk8xm.jpg",
               "id": 9040,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.114888,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18555,
      "vote_count": 42,
      "budget": 0,
      "overview": "The story of five teenage girls who form an unlikely bond after beating up a teacher who has sexually harassed them. They build a solid friendship but their wild ways begin to get out of control.",
      "similar": [
         376660,
         1429,
         627,
         13342,
         133805,
         192132,
         378064,
         8457,
         17612,
         1359,
         4771,
         6075,
         11005,
         235,
         38234,
         51828,
         109414,
         82693,
         180863,
         216015
      ],
      "original_title": "Foxfire",
      "runtime": 102,
      "poster_path": "/3LR8l22YXY8DuBKnF79HO59V5iX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Chestnut Hill Productions",
            "id": 26192,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Red Mullet Productions",
            "id": 24827,
            "origin_country": ""
         }
      ],
      "release_date": "1996-08-23",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "It took them 17 years to learn the rules. And one week to break them all.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Annette Haywood-Carter"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Joyce Carol Oates",
         "Elizabeth White"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116353/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1ODEzNjA3MF5BMl5BanBnXkFtZTcwODYxNjYxMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Hedy Burress, Angelina Jolie, Jenny Lewis | See full cast and crew »"],
      "reviews": [
         "I've always loved watching Angelina Jolie on screen... but watching her in \"Foxfire\" quite literally gave me *chills* (and still does). When Legs first walks into Maddy's classroom and they do that long, slow pan up - from head to foot - of Legs, you can instantly feel Angie's incredible magnetism and presence. As much as people would like to point out the negative aspects of this film - that violence of any sort is \"unladylike\" or just plain wrong coming from females - \"Foxfire\" has got many more positive ones on its side. Maddy and Legs' relationship is one of the warmest, most heartfelt I've ever seen portrayed on film ... Legs is not so much a maternal figure as she is a supportive driving force. She teaches each of the girls to respect themselves and not be ashamed or afraid to be who they are. If anything, I think it's Maddy that's the maternal one ... directing her loving and protective instincts towards Legs. Maddy teaches Legs to open up her heart and stop *running* long enough to realize that some people *can* love you and not abandon you (like her father) or die (like her mother). She teaches her to care again... to love again.",
         "When Foxfire first came out, I had no interest to watch it at all. Recently I became a huge Angelina Jolie fan. The main reason to watch the movie was her. Jolie is great as usual. She gives everything into her character and is very good. Not a surprise. Besides Jolie, I was shocked as to how entertained I was while watching it. It gave me a sense of longing for that kind of rebelliuos female companionship. Foxfire has such reckless abandon that makes for fun ride. From Angelina's mysterious entrance into the science lab, to the end credits, I stared at my screen. And smiled. I had so much fun I watched it again the next evening. Hedy Burgess (as \"Maddy\") and Angelina Jolie (as \"Legs\") give the best performances. Everybody else, are cardboard cutouts of girls for the most part. \"Legs\" is everything \"Maddy\" wants to be. Self sufficient, drifting, taking no **** from anyone. \"Maddy\" has the loyalty and values that \"Legs\" longs to have. The ability to hold friendships, love, conscience. Like someone else once said, the sexiest scene is really Legs and Maddy talking on the rooftop, and its not even about sex. The soundtrack is a great adrenaline ride. The music has the same spirit as the movie and is really fun. A must for Angelina Jolie fans. An entertaining movie. 6 out of 10",
         "Not a perfect film, but I got a great feeling from it. I love movies about girls together, being strong and being friends. Not being intimidated and even laughing when the football team shows up to threaten them. Some of the things they did were not ideal, but they were kids, and they made mistakes. Legs was a cool character, and she meant well even when she was acting nuts. But it showed girls sticking together in the face of a \"man's\" world, the boys visiting their house in the woods, the boys attacking them and the girls commandeering the truck... dancing in the house, driving fast and music blaring... when girls are together, laughing and feeling great in their own skin, nothing else in the world matters, and no opression can hold them. That's the feeling I got from this film.",
         "I bought this movie without ever hearing of it before. After seeing the cover and reading the back, I was intrigued. I was not disappointed in the least. Angelina Jolie is acting's best kept secret...or was at least. Now she is starting to finally get the recognition she deserves. The storyline, acting, and camera work was splendid. The bond that forms between the group of girls is touching as is the bond between Maddie and Legs. True, many may not like this movie after reading the novel, because the two are so different, but the movie is more modernized and appeals to a larger audience. The end of the movie never fails to get me choked up. 10/10.",
         "I have loved this movie ever since I first saw it. It forces you to think for yourself. What would happen if you acted on the impulses in your heart, instead of what you were told was right? Jolie gives a stunning performance as the free-spirited Legs, and Hedy Buress (Maddie) portrays the coming-out-of-her-shell part of us all extraordinarily well. The other characters are well thought out, but don't overwhelm the script. This movie speaks to the rebel in all of us, and it will make you laugh, cry, yearn, and hope. I believe that every generation of girls should see this movie, and realize that they have the ability to think for themselves as well. There is nudity on the part of 3 out of the five actresses, and partial nudity in the very beginning, but it is not distasteful or even sexual at all. It's more about being comfortable. Bless you, FoxFire.",
         "Four teenage girls are joined by Legs (played by Jolie). Experiencing various teenage anxieties and failed communication with parents, they form a strong emotional bond which is augmented by events in which they take part together and into which they are drawn. Supporting each other, they play the role of both friend and family to each other. The plot deals with the isolation of late teenage from mainstream society and one's parents' generation, and the communication divide which neither parents nor children seem to be able to bridge easily during these years. Another theme is what too much pain and abandonment in the early years can do to you, and how good people can clash with a society trying to do the right thing, but getting it wrong.",
         "I have seen this movie in 1996 when it was released. We didn't know who Jolie was back then but I think this is where producers discovered her even though she'd already made a few movies. This film is mostly about different human beings meeting and changing the life of each other. Just like in real life, you meet someone that has nothing to do with you or your interests but this person will make you feel alive, make you do and beleive stuff you never thought possible. Legs is there only like a tornado sweeping off everything on it's path. And sometimes it can be a good thing. Of course there is many subject related to womwn solidarity, girl power, and bla bla bla. But really a movie is what you see but what comes out of it and what you learn is entirely up to you.",
         "This is not by any stretch of the imagination a great film. The characters are two-dimensional, the plot is clunky, the sound is spotty, the directing is uneven... but \"Foxfire\" is worth watching because a previously unknown young actress named Angelina Jolie waltzed onto the set and completely stole this movie. From her memorable entrance, with the camera panning slowly up from her boots, this movie belongs to Jolie. Part riot-grrl James Dean, part goth Ingrid Bergman, smoldering with sexual tension-- she's simply perfect in this part. The rest of the cast is pretty solid, the indie rock soundtrack is great, and the story manages to avoid being completely predictable... which is pretty rare for a teen flick. \"Foxfire\" is a schlocky movie, to be sure, but it's definitely a guilty pleasure.",
         "*SPOILER WARNING! SORTA...* I rented this movie because, like others, I love Angelina Jolie. She is a fabulous, beautiful actress, and is naturally impressive in \"Foxfire\" too. But this is one of those plots that requires all adults to be morons, all men to be horrible, all the cheerleaders to actually prance around school in thier outfits ALL THE TIME, and all characters to be stereotypes that go down the most ridiculous paths possible. And the worst part is that this movie is a patchy mimick of 1980's \"Foxes\" that starred Jodie Foster. It also had the wise ringleader, the awkward virgin, the tuff troubled teen with the abusive father, the flirtatious slut...and it did a much better job of bringing the mixed nuts of characters together in a believable way. There is even a scene in \"Foxfire\" where the awkward virgin exclaims, \"We're like those girls from that movie \"Foxes\"!\" No, hun. You're carboncopies of them. But I will admit that the relationship between 'Legs' and Maddy is touching during the moments where it is allowed to develop.",
         "This movie is kind of an inspiration for girls.If this movie can teach a girl not to care what people think and boost confidence then this is a great movie.Legs is a great role modelish figure.She knows she isn't perfect.This is a great movie.Maddy is like a lot of girls too.She opens up after they find they all have something in common.Some guys might not like the movie.Then again some guys might.This movie isn't a chick flick.Its based on reality.Once people see this movie, people will find that they have a lot in common with some of the characters in this movie.It is a really good movie to watch.This movie can help you understand bonds between some people.They realize that you don't need a label to be someone."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Chestnut Hill Productions",
         "Red Mullet Productions",
         "Rysher Entertainment"
      ],
      "summaries": ["The story of five teenage girls who form an unlikely bond after beating up a teacher who has sexually harassed them. They build a solid friendship but their wild ways begin to get out of control."],
      "budget": 0
   },
   "movielensId": 835,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-23",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["Annette Haywood-Carter"],
      "runtime": 102,
      "movieId": 835,
      "title": "Foxfire",
      "mpaa": "R",
      "actors": [
         "Angelina Jolie",
         "Hedy Burress",
         "Jenny Lewis",
         "Jenny Shimizu",
         "Sarah Rosenberg",
         "Peter Facinelli",
         "Dash Mihok",
         "Michelle Brookhurst",
         "Elden Henson",
         "Cathy Moriarty",
         "Richard Beymer",
         "John Diehl",
         "Ever Carradine",
         "Joel David Moore"
      ],
      "imdbMovieId": "0116353",
      "originalTitle": "Foxfire",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["SQ-CopNrehU"],
      "plotSummary": "The story of five teenage girls who form an unlikely bond after beating up a teacher who has sexually harassed them. They build a solid friendship but their wild ways begin to get out of control.",
      "tmdbMovieId": 18555,
      "avgRating": 3.19283,
      "releaseYear": "1996",
      "numRatings": 1032,
      "posterPath": "/3LR8l22YXY8DuBKnF79HO59V5iX.jpg"
   }
}