{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "difficult childhood",
            "id": 2467
         },
         {
            "name": "telekinesis",
            "id": 5086
         },
         {
            "name": "child prodigy",
            "id": 5561
         },
         {
            "name": "childhood trauma",
            "id": 5707
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "teacher student relationship",
            "id": 41355
         }
      ],
      "imdb_id": "tt0117008",
      "video": false,
      "title": "Matilda",
      "recommendations": [
         10330,
         9820,
         10137,
         11674,
         8839,
         9598,
         3050,
         11007,
         10054,
         2300,
         11011,
         888,
         11451,
         788,
         9637,
         9880,
         11283,
         12139,
         9574,
         9641
      ],
      "backdrop_path": "/wTUO3HhVaxLtzEuTnAwlGdwSwAp.jpg",
      "revenue": 33459416,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Matilda Wormwood",
               "gender": 1,
               "credit_id": "52fe43be9251416c7501c641",
               "name": "Mara Wilson",
               "profile_path": "/twFydeLmcbYR7DFBgs3cKe4es8O.jpg",
               "id": 11717,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Harry Wormwood",
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c645",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Miss Jennifer \"Jenny\" Honey",
               "gender": 1,
               "credit_id": "52fe43be9251416c7501c64d",
               "name": "Embeth Davidtz",
               "profile_path": "/gmc4nZtGc6bge9DnriR57VYq0dA.jpg",
               "id": 6368,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Zinnia Wormwood",
               "gender": 1,
               "credit_id": "52fe43be9251416c7501c649",
               "name": "Rhea Perlman",
               "profile_path": "/cq7Cf4z3BHD9o58ki7MgCioty8q.jpg",
               "id": 24203,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Agatha Trunchbull",
               "gender": 1,
               "credit_id": "52fe43be9251416c7501c687",
               "name": "Pam Ferris",
               "profile_path": "/sQuUMFmDPc5qQU1FAzIl0cfF65e.jpg",
               "id": 11213,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "FBI Agent Bob",
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c68b",
               "name": "Paul Reubens",
               "profile_path": "/qiY2maQ1iFnoaUiGNGLTKnaj3Xu.jpg",
               "id": 5129,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "FBI Agent Bill",
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c68f",
               "name": "Tracey Walter",
               "profile_path": "/pMeImyAZ8fpQ32QyPO8g6W8gs13.jpg",
               "id": 3801,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Michael 'Mikey' Wormwood",
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c693",
               "name": "Brian Levinson",
               "profile_path": null,
               "id": 109693,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Lavender",
               "gender": 1,
               "credit_id": "52fe43be9251416c7501c697",
               "name": "Kiami Davael",
               "profile_path": "/as0DweFWeVO6DK35LmxiRKKCScT.jpg",
               "id": 109694,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Bruce Bogtrotter",
               "gender": 2,
               "credit_id": "5a0cfe1c9251416ef2005336",
               "name": "Jimmy Karz",
               "profile_path": null,
               "id": 156734,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c653",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43be9251416c7501c659",
               "name": "Roald Dahl",
               "profile_path": "/me3PtcT5mw88y3e3AYG3exuOO99.jpg",
               "id": 1299,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c65f",
               "name": "Nicholas Kazan",
               "profile_path": null,
               "id": 20213,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c665",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43be9251416c7501c66b",
               "name": "Liccy Dahl",
               "profile_path": null,
               "id": 68896,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c671",
               "name": "David Newman",
               "profile_path": "/vncTIJaBWoYmpdNCPkDnA8hT3PM.jpg",
               "id": 3393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c677",
               "name": "Stefan Czapsky",
               "profile_path": null,
               "id": 1919,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43be9251416c7501c67d",
               "name": "Lynzee Klingman",
               "profile_path": null,
               "id": 3394,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43be9251416c7501c683",
               "name": "Brent White",
               "profile_path": null,
               "id": 41079,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 15.610418,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10830,
      "vote_count": 1244,
      "budget": 36000000,
      "overview": "A grouchy couple are parents to a very sweet girl, Matilda. Unlike her bratty brother and mean parents, Matilda becomes a very sweet and extremely intelligent 6 year old girl, who is very keen to go to school and read books. After a while, her parents send her to school with the worst principal in the world, a very sweet teacher, and good friends. While trying to put up with her parents' and principal's cruelty, she starts to unwittingly unleash telekinetic powers, destroying a television and making a newt fly onto the principal. With enough practice, Matilda starts to learn to control her telekinetic powers and soon using them on her principal so she can drive her away from the school.",
      "similar": [
         244772,
         8967,
         52449,
         12,
         233063,
         118,
         437670,
         1075,
         433,
         309809,
         400928,
         7340,
         1265,
         334,
         73,
         39254,
         277216,
         10054,
         2196,
         8457
      ],
      "original_title": "Matilda",
      "runtime": 98,
      "poster_path": "/vddUwPL3L8MBH4FrEDCAZM9T6sj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jersey Films",
            "id": 216,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         }
      ],
      "release_date": "1996-08-02",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "A little magic goes a long way.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Danny DeVito"],
      "runtime": 98,
      "synopsis": "Matilda Wormwood (Mara Wilson) is an incredibly brilliant child born to crass and ignorant parents. Her father Harry (Danny DeVito), a crooked car salesman, and her mother Zinnia (Rhea Perlman), a dim-witted Bingo enthusiast, ignore their daughter constantly and, despite her pleas, do not enroll her in school. Left home alone all day, young Matilda makes frequent trips to the library for mental stimulation. She develops a love for reading, and for knowledge in general. Matilda's intelligence does not impress her father, who interprets it as \"being a smart-aleck.\" After being unfairly punished once too often, Matilda plays a stealthy string of practical jokes on Harry (including swapping his hair oil with bleaching peroxide, and gluing his hat to his head). After a particularly nasty outburst from Harry, Matilda stares at the television in anger until it explodes. Confused by the phenomenon, she shakes it off. A disgruntled Harry finally enrolls Matilda in Crunchum Hall Elementary, after the principal becomes a customer at his dealership. Miss Agatha Trunchbull (Pam Ferris), the headmistress, is an enormous, intimidating, and brutal woman with a passionate hatred for children. Matilda arrives at her first day of kindergarten and befriends two students, Hortensia and Lavender, who warn her of Miss Trunchbull's violent habits. The student body witnesses Trunchbull, an ex-Olympian, perform a \"human hammerthrow,\" and fling a little girl over a nearby fence by her pigtails. Despite the initial horrors of Crunchum Hall, Matilda's teacher Miss Honey (Embeth Davitz) is a kind and gentle woman, and Matilda is praised for her intelligence for the first time. Miss Honey speaks with Matilda's parents at their house and attempts to convince them of their daughter's brilliance. They rebuff her rudely, but she is not dissuaded from finding intellectual stimulation for Matilda. The next day at school, Miss Trunchbull once again demonstrates her cruelty. Calling all the students to a special assembly, she devises a public punishment for a boy called Bruce Bogtrotter who had allegedly stolen cake from the school kitchen. Trunchbull forces him to eat an enormous cake in one sitting, and is furious when he manages to succeed without getting sick. She gives the whole student body a five-hour detention. The next day, Miss Trunchbull's car breaks down and she takes her anger out on Matilda, simply because she is Mr. Wormwood's daughter. Matilda is put in the Chokey, a small closet in Trunchbull's office studded with nails on the inside, forcing its inhabitant to stand poker-straight. Miss Honey's class prepares for a lecture from the headmistress, who visits classrooms sporadically to intimidate the children up close. Matilda's friend Lavender gets revenge on Trunchbull by hiding a newt in the water pitcher on the teachers desk. While Miss Trunchbull menaces the students, Miss Honey rescues Matilda from the Chokey and brings her back to class. After Trunchbull drinks a glass of water she spots the newt, causing her to have an uncharacteristically childish panic attack when she sees it. She instantly blames Matilda for the newt in the glass. Matilda is furious and, using the same angry energy from the television explosion, manages to tip the glass over with her eyes, sending the newt flying onto Trunchbull. Trunchbull blames Matilda again but Miss Honey points out that Matilda had never left her seat. After the disgruntled headmistress leaves, Matilda tells Miss Honey that she had indeed tipped the glass over using her eyes. She cannot repeat the phenomenon in the moment, but Matilda knows she has a strange mental power that had also caused her parents' television to explode. Matilda and Miss Honey soon form a bond, and Matilda is invited over for tea after school. Miss Honey lives in a tiny cottage, and tells Matilda the story of her childhood: She had once lived in a beautiful mansion (which they had passed on the walk from school), where Miss Trunchbull now lives. Miss Honey's mother had died early on, and her father invited his wife's stepsister (Trunchbull) to look after the house and his daughter. Miss Trunchbull, not surprisingly, was cruel to her niece. A few years later, Miss Honey's father mysteriously died, and his death was ruled a suicide. Miss Honey walks Matilda home, and they pass Trunchbull's house once again. Matilda suggests they go in and retrieve Miss Honeys beloved childhood doll, as they saw Miss Trunchbull getting into her car and preparing to leave. Miss Honey tries to dissuade Matilda, but the girl dashes into the house leaving Miss Honey with no choice but to follow her. They explore the house briefly, with Miss Honey experiencing nostalgia from her childhood, but are terrified when they hear Miss Truchbull re-enter. Her car (purchased from Harry Wormwood) broke down on the driveway, and as she bellows to him over the phone she senses something awry. Matilda and Miss Honey desperately evade Truchbull as she tears through the hallways searching for the intruders, and escape from the house just in time. Out of breath and terrified, Miss Honey makes Matilda promise to never enter the house again. Harry is being secretly followed by two undercover agents (Paul Reubens and Tracey Walter) due to his shady methods of restoring shoddy used cars, such as reversing the mile counter with a drill and attaching bumpers with superglue. Agents Bob and Bill lurk in a car outside the Wormwood house, snapping incriminating photos of Harry. Meanwhile, Matilda discovers that her telekinetic powers work when channeling her anger towards her family. She uses this knowledge to practice her telekinesis, and soon becomes adept enough to move objects quickly and easily from a good distance away. Matilda buys some extra time for her father by stealing the agents' evidence tape and disposing of it. Matilda resolves to return to Trunchbull's house and retrieve Miss Honey's doll. On a stormy night, she climbs onto Trunchbull's garage roof and begins to move items inside the house in order to scare the superstitious woman. Matilda transports the doll out of a window, and escapes. A horrified Miss Trunchbull seeks refuge in her car, but discovers Matilda's red hair ribbon (blown off during the storm). She brings it to school the following day, and menaces Miss Honey's class to a new degree. Matilda finally demonstrates her powers to Miss Honey, and uses them to write a message on the blackboard which the children read in eerie unison. The message appears to be from the ghost of Miss Honey's father, demanding that Trunchbull give his daughter back her house and rightful possessions. It is suggested that he was, in fact, murdered by Miss Trunchbull long ago. When Trunchbull is sufficiently frightened, Matilda uses her powers to battle Miss Trunchbull by pummeling her with flying classroom equipment. The broken-down and horrified headmistress flees the school forever and is pelted with food by the entire student body. Some time later, Matilda is visiting Miss Honey, who lives in her childhood home once again. The Wormwoods suddenly arrive and (with sirens in the background) say they are immediately moving to Guam and demand that Matilda get in the car. Matilda resists and produces adoption papers, begging to be allowed to stay with Miss Honey. Miss Honey defends Matilda and agrees. Matilda's mother finally shows remorse for her treatment of her daughter, and signs the papers to grant her a better life. The Wormwoods leave forever. Eventually, Miss Honey is named the new principal of Crunchum Hall Elementary. She and Matilda start a new life together, with Matilda only using her telekinesis for small tasks like removing a book from a shelf.",
      "writers": [
         "Roald Dahl",
         "Nicholas Kazan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117008/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTYxNDEyMDQ1MF5BMl5BanBnXkFtZTcwODcxMDYyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny DeVito, Rhea Perlman, Mara Wilson | See full cast and crew »"],
      "reviews": [
         "This movie is an absolutely wonderful fantasy. I totally loved it. The dialog is brilliant. The humor is both bold, and subtle. The characters are archetypal. Matilda perfectly captures what it is like to be an intelligent person, trapped in the body of a child, and surrounded by idiots who control far too much of your life. The notion that bad people (even adults) deserve to be punished for their evil ways (even by children) is truly subversive. Any child who suffered through the countless typical abuses of unthinking, uncaring, and ignorant parents will truly love this movie. Those same unthinking, uncaring, and ignorant parents will probably hate this movie, unless they are wise enough to see the truth behind the fantasy. Despite the difficulties Matilda faces, like all good fantasies this movie has a wonderfully happy ending. I wish the same for all.",
         "personally, i hate nauseatingly cute family movies, but this movie is great! I went to see it in the theatre because i had read the book, but i thought that it wouldn't even come close to it. But you know what? I enjoyed this movie more than the novel! I thought it wouldn't be faithful to the book and that it would have turned out to be one of those typical kids' movies, but there's nothing \"cute\" about mrs. Trunchbull! This has got to be one of my favorite films ever and it IS the best childrens' movie ever made. I definitely recommend this movie to anyone who has his heart in the right place!",
         "\"I'm smart your dumb, I'm big your little, I'm right your wrong and there's nothing you can do about it!\" What a catchphrase \u0096 I could use that on my brother sometime but anyhow this was an influence on Matilda that made her strong and prepared her for her turbulent time ahead at school, especially with a nasty head teacher 'Miss Trunchbull'. Roald Dahl had written this book to show that a small girl like Matilda can show courage and get herself out of a bad situation, once the film had been made, everything I can remember from the book was alive with a sweet girl to a lazy Mum and Dad (played by Danny DeVito and Rhea Perlman). I give this film 10/10.",
         "One of my most highly-anticipated films, 'Matilda' is both a treat and a disappointment. The casting of Mara Wilson as the title character is ingenious - the little girl exudes the qualities set forth in Roald Dahl's classic. Unfortunately, the filmmakers apparently could not resist the urge to alter the book, in which Matilda is British and lives in a small village. The movie version, of course, depicts Matilda as American, but what's worse, that she lives in a larger area. This detracts somewhat from the bucolic setting of the book, although not enough to create a starkly different environment. The casting of Embeth Davidtz as \"Miss Honey\" was another great choice. While not what I had pictured from the book, Miss Davidtz captures the warmth and energy of the young teacher. Pam Ferris, as the grotesque \"Miss Trunchbull,\" is simply outstanding. Both her demeanor and her looks bring the book's character alive. 'Matilda,' while straying from the book's true form, is still highly enjoyable to watch, especially for those of us who have read the Dahl's masterpiece. Those who enjoy 'Matilda' should also enjoy the movie adaptation of ``The Witches,\" another Roald Dahl classic.",
         "Hi hi! Danny DeVito touches on the viewpoint of children - and their imaginations - in this fantasy come to life: MATILDA. Who of us as children didn't see the world in the powerful images of youthful, innocent eyes? The horrific Agatha Trunchbull, the kindly librarian, Mrs. Phelps? The annoying big brother 'Mikey', or the wondrous, perfect teacher, Miss Honey? Who of us as children didn't see that some things in life were wrong and wanted to put them right - if only we had magic powers! Life as a child is fantastic and happy and exciting and scary. And in MATILDA we see all elements of childhood shine through by the intentionally ridiculous, over-the-top performances of Danny DeVito (Matilda's Dad), Rhea Perlman (Mom), and Pam Ferris (Ms. Trunchbull, the principal). And yes, there is a scary element to the movie: The chase in Ms. Trunchbull's house; the \"Chokey\"; the spooky scene of Matilda taking back \"Lizzie Doll\" from Ms. Trunchbull while \"haunting\" her house. But this is the scariness of youth; shown from a safe distance for even the young audience. And despite the scariness - which kids KNOW exists - Matilda and Miss Honey and all their friends are victorious. Danny DeVito has demonstrated a lesson well-learned from the Disney animated films of yesteryear: The more evil the villain, the more noble and victorious the heroine. To miss seeing MATILDA is to miss a heart-warming, hand-clapping, magical trip back to your childhood fantasies and ideals.",
         "I believe this film best represents the themes behind Roald Dahl's rather subversive children's literature. It follows the continuity of both \"The Witches\" and \"James and the Giant Peach,\" casting repulsive Trunchbull into the roles of Grand High Witch and repulsive evil aunt, with a bit of the ogre (especially during the chase in Magnus House). It's also pretty obvious that J.K. Rowling had read Roald Dahl long before she wrote the first of her Harry Potter books. I find it very odd how few people have noted Roald Dahl's literary influence on the spate of children's fantasy authors today. All the elements for Harry are here, in Matilda, right down to her unpleasant 'Muggle' family -- the Wormwoods -- and a brutish, Dudley-like brother. And for the record, Mara Wilson does a good job!",
         "Critics always get away with giving a lot of good movies the bad ratings. Matilda was one of them. I happened to think Matilda was particularly great. Mara Wilson did good as the title character, except on some levels she acted more like a kid, while more of an over-sophisticated teen on other levels. The only thing missing in her future is a part as the star character in yet another Alice in Wonderland project. Pam Ferris seemingly got the part of Ms. Truchbull for an obvious reason. No offense, but she's UGLY!! That best fit Ms. Trunchbull's personality. Danny DeVito was sort of trying to put a one-man act in the film. He was Matilda's dad, the director, and one of the producers. The other actors/actresses, Rhea Perlman, Embeth Davidtz, Brian Levinson, etc. did good as those they were acting as. That's what made this movie so wonderful. The casting was the right price. Again, the producers decided to wait until the original story writer passed away before making a movie from one of his works. The British story was somehow modified into an American perspective. One thing most people don't understand is how advanced Matilda's content is, even though it was probably intended for kids. That doesn't make it a bad thing; movies have to appeal to everyone in general, not just little kids. But other than that, Matilda was a real treat.",
         "I can't say 'Matilda' was one of my favorite Roald Dahl books as a child but the movie adaption isn't that bad. Matilda is a very bright and intelligent for a girl of her age. She's quite different from her grouchy and ignorant parents. Danny DeVito was good as Matilda's grouchy father, he often plays very grouchy characters. Mrs Trunchbull is as scary as she is in the book. She's worse than mean. She's a deranged and aggressive monster! She's an absolute monster! She hates children and does nothing except bully and intimidate them. As for Mrs Jennifer Honey she's the exact opposite of Mrs Trunchbull. She's kindest and sweetest teacher you could find. She's like a mother to her school children and tries to protect them, but unfortunately she to is intimidated by Mrs Trunchbull. So when Matilda develops these telekinetic powers, it is up to her to teach Mrs Trunchbull an ultimate lesson. I really liked the relationship Matilda has with Mrs Honey. It reminds me of the relationships I had with certain teachers at school. So I would say this movie is both frightening and touching at the same time.",
         "Matilda is a good film for all ages to enjoy. Embeth Davidtz plays a very good friend to Matilda, Danny Devito was wonderful as the father who didn't care about his daughter, Rhea Perlman was good as the mother who also couldn't care about Matilda, Pam Ferris was brilliant as the scary head teacher and Brian Levinson played a small role but proved a lot. It's about a girl called Matilda who's parents couldn't care less about her and then she realizes she has magical powers. She has lots of adventures with her powers with her teacher and her friends. If you haven't seen it then you simply must!",
         "My daughters (ranging from age 9-16) have loved this movie for several years. I am normally a very sensitive person and wasn't disturbed by the macabre tone of the movie. Somehow the movie remains upbeat as Matilda is able to find someone who will love her even though her parents don't appreciate her. Young Mara Wilson shines as Matilda. Each time I watch this I am amazed at her talents at such a young age. I haven't heard of her making any films lately...I hope this is by her own choice. In addition, Danny DeVito, Rhea Perlman, Pam Ferris, and Embeth Davidtz all were wonderful in their roles as Matilda's parents, principal and teacher, respectively. I have read the book, and yes, it is different as far as the setting goes, but in my opinion, they've kept the main ideas quite intact. Movies are almost never the same as books, because by definition they can't be. We have enjoyed watching this as a family for at least 5 years now and will continue to. I just wish they'd release a special edition DVD with COMMENTARY. I'd love to hear from Danny DeVito and Rhea Perlman about the making of this someday classic movie. At least it is in my family. My criterion for a classic? We are constantly quoting its script to each other. UPDATE: They DID release a special edition. It does have some fine extras, but I have to wonder why in the world didn't they offer a widescreen edition? That is a big disappointment."
      ],
      "genres": [
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Jersey Films"
      ],
      "summaries": [
         "A grouchy couple are parents to a very sweet girl, Matilda. Unlike her bratty brother and mean parents, Matilda becomes a very sweet and extremely intelligent 6 year old girl, who is very keen to go to school and read books. After a while, her parents send her to school with the worst principal in the world, a very sweet teacher, and good friends. While trying to put up with her parents' and principal's cruelty, she starts to unwittingly unleash telekinetic powers, destroying a television and making a newt fly onto the principal. With enough practice, Matilda starts to learn to control her telekinetic powers and soon using them on her principal so she can drive her away from the school.",
         "Matilda is a bright little girl who is very eager to learn. Eventually, her insensitive parents send her to a school run by Miss (The) Trunchbull. She is a cruel authoritarian that loathes children. Matilda befriends her school teacher, Miss Honey. She soon realizes Matilda's talents, but is later amazed to see the full extent of Matilda's powers.",
         "This is the story of a sweet bright little girl named Matilda, who is a child of wondrous intelligence. But unfortunately she is different from the rest of her family. Ignored at home all the time, Matilda escapes into a world of reading, exercising her mind so much she develops telekinetic powers. Good thing, too: sent off to a school headed by a cruel hulking monster, principal Agatha Trunchbull, Matilda needs all the help she can get. Amid Crunchem's darkness, Matilda finds a single light in warm-hearted Miss Honey, the first-grade teacher who recognizes the girl's remarkable skills--including a very special talent that allows the spirited girl to turn the tables on the wicked grown-ups in her world.",
         "Story of a wonderful little girl, who happens to be a genius, and her wonderful teacher vs. the worst parents ever and the worst school principal imaginable."
      ],
      "budget": 36000000
   },
   "movielensId": 837,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-02",
      "dvdReleaseDate": "1997-07-22",
      "directors": ["Danny DeVito"],
      "runtime": 98,
      "movieId": 837,
      "title": "Matilda",
      "mpaa": "PG",
      "actors": [
         "Mara Wilson",
         "Danny DeVito",
         "Embeth Davidtz",
         "Rhea Perlman",
         "Pam Ferris",
         "Paul Reubens",
         "Tracey Walter",
         "Brian Levinson",
         "Kiami Davael",
         "Jimmy Karz"
      ],
      "imdbMovieId": "0117008",
      "originalTitle": "Matilda",
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["pnzLRDDijW0"],
      "plotSummary": "A grouchy couple are parents to a very sweet girl, Matilda. Unlike her bratty brother and mean parents, Matilda becomes a very sweet and extremely intelligent 6 year old girl, who is very keen to go to school and read books. After a while, her parents send her to school with the worst principal in the world, a very sweet teacher, and good friends. While trying to put up with her parents' and principal's cruelty, she starts to unwittingly unleash telekinetic powers, destroying a television and making a newt fly onto the principal. With enough practice, Matilda starts to learn to control her telekinetic powers and soon using them on her principal so she can drive her away from the school.",
      "tmdbMovieId": 10830,
      "avgRating": 3.43137,
      "releaseYear": "1996",
      "numRatings": 6805,
      "posterPath": "/vddUwPL3L8MBH4FrEDCAZM9T6sj.jpg"
   }
}