{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "basement",
            "id": 9866
         },
         {
            "name": "children",
            "id": 10103
         },
         {
            "name": "divorce",
            "id": 15160
         }
      ],
      "imdb_id": "tt0116571",
      "video": false,
      "title": "House Arrest",
      "recommendations": [
         18856,
         46924,
         20551,
         83489,
         16299,
         51321,
         17949,
         17745,
         29098,
         41579,
         54007,
         157036,
         27993,
         34309,
         80346,
         25697,
         61418,
         25969,
         37108,
         17770
      ],
      "backdrop_path": "/w4Whv1q0ALWqSlwSlsEnAs6tq2l.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Janet Beindorf",
               "gender": 1,
               "credit_id": "52fe47a29251416c750a0607",
               "name": "Jamie Lee Curtis",
               "profile_path": "/c4poMDwQ0nUj81m4WPriiv96ExZ.jpg",
               "id": 8944,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Ned Beindorf",
               "gender": 2,
               "credit_id": "52fe47a29251416c750a060b",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Gregory Alan 'Grover' Beindorf",
               "gender": 2,
               "credit_id": "52fe47a29251416c750a05f9",
               "name": "Kyle Howard",
               "profile_path": "/veImiJGtD14qGhE9QvWDpUdkyAS.jpg",
               "id": 83699,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Brooke Figler",
               "gender": 1,
               "credit_id": "52fe47a29251416c750a060f",
               "name": "Jennifer Love Hewitt",
               "profile_path": "/kp8cLdEivtJD5yu8Ij8xMeZ1Jc8.jpg",
               "id": 33259,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 1,
               "credit_id": "5522cae69251416d6a001b3b",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "5522caefc3a368333a004147",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "5522caf6c3a3683453003d28",
               "name": "Wallace Shawn",
               "profile_path": "/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg",
               "id": 12900,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "5522cafec3a3684dda0069b4",
               "name": "Ray Walston",
               "profile_path": "/5N6AVWIJCBD71uZtxSTTE8ZNfkB.jpg",
               "id": 4093,
               "order": 7
            },
            {
               "cast_id": 3,
               "character": "T.J. Krupp",
               "gender": 0,
               "credit_id": "52fe47a29251416c750a0603",
               "name": "Herbert Russell",
               "profile_path": "/xgUU5qH9RMIWfCXnld9OYbN6nAz.jpg",
               "id": 148114,
               "order": 8
            },
            {
               "cast_id": 7,
               "character": "Mrs. Burtis",
               "gender": 1,
               "credit_id": "52fe47a29251416c750a0613",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Louise Finley",
               "gender": 1,
               "credit_id": "590102c4c3a3681123001ae1",
               "name": "Caroline Aaron",
               "profile_path": "/9v9h9bR4CX6MrpZFgEktTHFIlgT.jpg",
               "id": 1910,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a29251416c750a05ff",
               "name": "Harry Winer",
               "profile_path": null,
               "id": 92554,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53f466110e0a267f7d001a99",
               "name": "Michael Hitchcock",
               "profile_path": "/73p9EPqV8fmjRyYnsFW9iFzuuqH.jpg",
               "id": 75463,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.500895,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18862,
      "vote_count": 38,
      "budget": 0,
      "overview": "High-schooler Grover Beindorf and his younger sister Stacy decide that their parents, Janet and Ned, are acting childishly when they decide to divorce after 18 years of marriage, so they lock them up in the basement until they'll sort out their problems. Their school friends also decide to do the same with their parents to solve their respective problems",
      "similar": [
         46705,
         87567,
         12102,
         4944,
         15373,
         20352,
         787,
         50546,
         225886,
         252512,
         601,
         159824,
         150540,
         239563,
         342473,
         394823,
         376659,
         1586,
         10404,
         59
      ],
      "original_title": "House Arrest",
      "runtime": 108,
      "poster_path": "/mhvhcOqAlRnB5taKdhDznNay9zF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-08-14",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "There's More Than One Way To Keep A Marriage Together...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harry Winer"],
      "runtime": 108,
      "synopsis": "The film opens with Grover Beindorf introducing himself: he is a kid who lives with his sister Stacey and his parents Ned and Janet in the suburbs of Ohio. Then follows a montage of videos taken over the Beindorfs 18-year-long marriage... which is an anniversary gift from Grover and Stacy. Unfortunately, Ned and Janet drop a bombshell on their children: they are considering a separation. A depressed Grover confides in his best friend Matt Finley, whose father Vic never keeps a wife for more than two years, who says if it was to him hed lock them in a closet until they sorted things out. This gives Grover an idea... That night, Grover and Stacy dress up the basement in a Hawaiian décor, inspired by their parents honeymoon in that country, and invite their parents down there for dinner in an attempt for reconciliation. Unfortunately, all Ned and Janet do are squabble with each other, so the kids leave them in the basement... and lock them in. They inform their flabbergasted parents that they will not let them out until they resolve their issues and go back to loving each other. The next morning, Grover informs Matt what hes done; however, the school bully TJ Krupp overhears them, and goes over to the Beindorf home to see for himself. He is impressed with Grovers feat, and decides to get involved: when Ned and Janet try to break out through the basement door, he installs a new, more secure one. Later, he throws into the basement his own parents, brash bullying Donald Krupp and his doormat wife Gwenna, so that THEY can level things between them. Matt too wants his father to keep his current wife Louise and locks them up too till they can manage to stay together. Later, Grover encounters Brooke Figler, a popular girl on whom hes had a long-term crush. She unexpectedly confides in him that her mother, single parent Cindy, is a source of embarrassment: Cindy behaves like a child, maintaining the position of a teenager and peer to Brooke and committing acts like dancing to the latest trendy music and going out with Brookes own friends. Grover invites Brooke to send Cindy into his basement, which she does and which finally secures Grover the girl of his dreams. The kids take over the house, while the adults in the basement rant and protest and make repeated attempts to escape. However, Grover eventually gets them all in line and reminds them why they imprisoned their parents; they actively start counseling the parents, trying to get them to improve their attitudes. Over the course of time, the parents begin to repair things: Vic learns that Louise thinks she cant be accepted by his children, but when Donald attacks Matt she saves him and he thanks her by calling her mom, putting her at rest; Gwenna manages to assert herself as Donalds equal partner; and Cindy, with help from Gwenna, manages to mentally grow up and be more adult-like. However, an ex-policeman neighbor starts to snoop around the Beindorfs home, suspicious of their prolonged absence and the antics of the children present. Also, Grover receives a shock when a man claiming to be Janets lawyer appears with divorce papers. This leads to Ned breaking off speaking with Janet, and an angry Grover leaves the house. He later returns, and states the house arrest was a failure; Brooke and the others tell him even if they couldnt have their parents to count on, theyll always have each other. The ex-cop neighbour arranges a police assault on the house, and all the parents are freed. Donald attempts to sue and imprison Grover, but the children and Gwenna force him to back down. The film ends with an epilogue from Grover: Donald and Gwenna separate, but remain friends and open a law firm together; Vic and Louise stayed together and are expecting a child; Cindy began actively dating men her own age; and Brooke officially became Grovers girlfriend. As for Ned and Janet, they reconciled and went on a long-overdue second honeymoon to Hawaii. They also made their children swear never to lock them in the basement again. Grover and Stacy complied if anything went wrong again, they had the attic...",
      "writers": ["Michael Hitchcock"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116571/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MTQ2OTA2MF5BMl5BanBnXkFtZTcwNTQyMDU1MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jamie Lee Curtis, Kevin Pollak, Kyle Howard | See full cast and crew »"],
      "reviews": [
         "I don't know why a lot of critics attacked this movie. What is there to attack? That's the problem with critics, they're always way too serious. Lighten up! No one said this would be Saving Private Ryan. It's not even Honey I Shrunk The Kids, but it's still cute. I mean think about it, at one point (well, more than one) in our lives we all just wish we could lock our parents in the basement. The acting is not superb but it's cute and the kind you would expect from a movie like this. The one person I will hand it to is Jennifer Tilly, who really stole the show as Jennifer Love Hewitt's teen-like mother. Not bad at all, though not near to becoming one of the best. This movie will soon be forgotten but if it ever comes on TV watch it.",
         "After learning that his parents are getting separated, a sensitive, idealistic teenage boy is so shocked and distraught that he recruits his younger sister to help lock them in the basement in the desperate hope that they'll actually talk out their problems and come to a rational solution. It starts out as a good idea, until his friends bring over their parents and lock them into the basement as well. Film's premise is far-fetched and protracted, to be sure, but it benefits from a talented cast (especially Howard), believable characters, and a good sense of family values. Not easy to take seriously, but meaningful and not bad for what it is. **½",
         "After Grover(Kyle Howard) and his younger sister Stacy(Amy Sakasitz) find out that their parents, Janet(Jamie Lee Curtis)and Ned Beindorf(Kevin Pollak) are getting separated and maybe divorced they decide to lock them in the basement so that they can figure things out. But during school, Grover tells his friend Matt(Mooky Arizona)what he did to his parents and the school bully T.J.(Russel Harper)hears them and decides to lock his parents in Grover's basement too, along with Matt's parents and Brooke's mother too. Brooke is played by Jennifer Love Hewitt and she plays a popular girl in school on who Grover has a big crush on. I thought this was a wonderful family movie. It was very funny and I think it can be enjoyed by both kids and adults. All the actors do a good job and it's just a very entertaining movie. A lot of people have complained and said that this movie was very unrealistic and things like that would never happen in real life but c'mon, what movie is really realistic and things that happen in movies usually don't happen in real life but you should enjoy movies such as these while you still can. Anyways, I would give House Arrest 9/10.",
         "'House Arrest' is a really cute movie and hopefully will influence parents to think about things before just getting a divorce. This movie may not be the most realistic portrayal of how a kid would act when he found out his parents were thinking about splitting (ie locking your parents in the basement) but the reactions are pretty genuine in the fact that just about all kids have problems with their parents. Some things were def. over-exaggerated though, like when Grover (Kyle Howard) finds divorce papers in the mail and then 'flips' out by shoving a bunch of papers around and knocking stuff over. No kid, well usually, would be that mad about their parents divorcing (I'm sure they would be upset, maybe cry, but like wrecking stuff in some sort of manner, yea right). The acting wasn't bad, I thought it was pretty good all around. The story was funny and if your parents aren't like any of the ones in the movie, you probably will appreciate your own family more. I recommend seeing this if you can, it's on HBO a lot.",
         "This comedy, about a teenager and his younger sister who lock their parents in the basement until they work out their marital problems, is not as bad as it sounds. We wind up with a bunch of kids upstairs who know how to relate to one another but gradually have to work out how to keep practical things running, and a bunch of adults downstairs who are just the opposite. In truth, neither side does very well, but at least this is not the tired condescension of the kids screwing up and needing to be rescued by the adults: both groups are portrayed with a mix of severity and sympathy. Throw in a meddling retired chief of police across the street, and make him Ray Walston whom I think everybody loved most in \"Picket Fences,\" and you have a film that is very entertaining, and also carries across some deeper meaning about what contributions young people and older ones can make to each other's ongoing development. Kyle Howard was 18 trying to play 14, which took a good deal of suspension of disbelief, but that miscasting seems to be an obsession Hollywood just can't seem to grow out of.",
         "No matter how you beat around the bush this movie is still a good movie. Even though at times it can be sappy, like when Grover has his temper tantrum (which was absolutely funny) its still cute. My favorite part would have to be when the parents are dancing, it was so cute. But then you want to wonder what was going on with Mark's folks I mean at one point I was trying to understand why they were looking like they had sex the that night. When TJ started playing \" Its Not Unusual\" you see their heads pop out. Why would they be having sex when other people were around, thats kind of weird. Another thing it was kind of grimy how the fist thing that Mrs. Beindorf notices about her husband is his car. what was up with the nosy behind neighbor? These scenes really made you really want to go \"hmmmmmm\"? I love the part when Mr. Beindorf tells his wife that Mr. Krump would be his attorney. Krump looks at the wife and turns to Beindorf and say \" I can get you the house, but kids might be a problem\" All in all this movie is still good.",
         "Ok, I know this isn't the greatest movie but it is a good movie if you are from the younger generation. It's about some kids who are frustrated at their parents for fighting all the time. They lock them up in their basement. At school some bullies overheard Grover talking to his friend about what he did and he wants part of it. I liked the actors and the acting all together.",
         "The Calibre of the actors is not in question but what they did with the material was nothing short of a miracle. As Actors you have to make a living so please don't blame them, although I would say that the one that didn't fit was kevin pollack. He gave no reason for us to either empathise or sympathise with his character. Jennifer Tilly stole the show in this instance but I will have to admit Her daughter played by Jennifer Love Hewitt showed signs that her acting ability in comedic roles suits her better than he more serious roles she has been given. Admittedly she doesn't have a gutsy enough part for the film. In fact the characters were all too shallow to be taken seriously in any respect although the storyline was entertaining there is no real depth to it. The film needed more background to each of the families involved to succeed. As it happened the only redemption was Jenifer Tilly whom not seen until almost all the parents were kidnapped, made the best of a bad situation and became a catalyst for the the other characters to play off of. Verdict: Most of the actors made the best of a bad script. But not a bad film I felt the Director could have done better.",
         "House Arrest Two kids are shocked when their parents announce that they are separating. As a last resort, the siblings decide to lock them in the basement and not let them out until their marital problems are solved. However, the friends of the children soon find out about what they are up to, and force their parents into the basement as well. Will the group of couples be able to sort out their relationships, or is this just one really bad plan gone wrong? Okay, first of all, it's unlikely that the events in 'House Arrest' would ever happen, but the film is still frothy and fun. Even though some of the acting is highly irritating, the children (apart from the main guy) are very funny, as is Jamie Lee Curtis. While everything about the film is far too predictable and safe (even for a family film), there's an energy about the production that is impossible to resist. A guilty pleasure. ~ 6/10 ~",
         "Now this movie was a good one seeing as though it did not reach the big screen. Jamie Lee Curtis leads an all star cast in this hilarious comedy about love, Hope and a little bit of luck. House arrest a must see holiday flick."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Rysher Entertainment"
      ],
      "summaries": [
         "High-schooler Grover Beindorf and his younger sister Stacy decide that their parents, Janet and Ned, are acting childishly when they decide to divorce after 18 years of marriage, so they lock them up in the basement until they'll sort out their problems. Their schoolfriends also decide to do the same with their parents to solve their respective problems.",
         "A group of children, desperate to keep their various parents from getting divorces, kidnap them and hold them prisoner in the basement in order to force them to reconcile.",
         "A group of children, desperate to keep their various parents from getting divorces, kidnap them and hold them prisoner in a basement in order to force them to reconcile."
      ],
      "budget": 0
   },
   "movielensId": 840,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-14",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Harry Winer"],
      "runtime": 108,
      "movieId": 840,
      "title": "House Arrest",
      "mpaa": "PG",
      "actors": [
         "Jamie Lee Curtis",
         "Kevin Pollak",
         "Kyle Howard",
         "Jennifer Love Hewitt",
         "Jennifer Tilly",
         "Christopher McDonald",
         "Wallace Shawn",
         "Ray Walston",
         "Herbert Russell",
         "Colleen Camp",
         "Caroline Aaron"
      ],
      "imdbMovieId": "0116571",
      "originalTitle": "House Arrest",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["RQYNVWQe9no"],
      "plotSummary": "High-schooler Grover Beindorf and his younger sister Stacy decide that their parents, Janet and Ned, are acting childishly when they decide to divorce after 18 years of marriage, so they lock them up in the basement until they'll sort out their problems. Their school friends also decide to do the same with their parents to solve their respective problems",
      "tmdbMovieId": 18862,
      "avgRating": 2.71049,
      "releaseYear": "1996",
      "numRatings": 734,
      "posterPath": "/mhvhcOqAlRnB5taKdhDznNay9zF.jpg"
   }
}