{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0108227",
      "video": false,
      "title": "The Story of Xinghua",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 0,
               "credit_id": "548508d8c3a3680b3a001db3",
               "name": "Jiang Wenli",
               "profile_path": "/dWBCkrto4WUwkl5nf88wfdF9EIU.jpg",
               "id": 137917,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "548508eb9251416a6c001988",
               "name": "Zhang Guoli",
               "profile_path": "/yuR59999SjGmbs9oyYDVlz6hiEv.jpg",
               "id": 543178,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "5485092cc3a36867d5000752",
               "name": "Xingli Niu",
               "profile_path": "/fRQAdOuo7iulNM7sNRyyAVk14b8.jpg",
               "id": 552478,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "548509349251416a6900157c",
               "name": "Tian Shaojun",
               "profile_path": "/tjYCFUPJOQ0bYKsOk04EJKRcbAX.jpg",
               "id": 1396188,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "5485093b9251416a6300181c",
               "name": "Zhang Haiyan",
               "profile_path": null,
               "id": 1396189,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "548508d1c3a3680b3a001db1",
            "name": "Yin Li",
            "profile_path": null,
            "id": 1189125,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.00323,
      "production_countries": [],
      "id": 297645,
      "vote_count": 0,
      "budget": 0,
      "overview": "This Chinese melodrama presents an allegory tinged with feminism with it’s portrayal of life and free enterprise in a modern, liberalized Chinese mountain village. Wanglai is the shady town grocer who steals stones from the Great Wall to sell as souvenirs.",
      "similar": [],
      "original_title": "The Story of Xinghua",
      "runtime": 90,
      "poster_path": "/z5XSFR7szHfCKrJ6zzJ5814IyfL.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [],
      "release_date": "1994-03-30",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Li Yin"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Ling Shi"],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0108227/",
      "coverLink": null,
      "actors": ["Stars: Wenli Jiang, Xingli Niu, Shaojun Tian | See full cast and crew »"],
      "reviews": [
         "A study in the seemingly rank unfairness of Chinese culture toward women, this is an excellent film. Our heroine has a particularly raw deal, matched (or more correctly, purchase by) to a cruel, but well off husband. His only interest is to have a son, but Xinghua does not become pregnant, bringing great hardship on herself. I liked the movie, although it was a little long and some of the characters could have been developed more, like Nizi, the husband's sister. If you accept the movie as a real depiction of life in rural China, it is a wonderful, but depressing view of the Chinese twist to life's complications. Try it. You'll like it.",
         "The picture of rural life in Northwestern China makes this movie. The plot line, with the evil husband and the victim wife with a heart of gold is pretty maudlin. The English in the subtitles is stilted - would anyone voluntarily write English like that in a screen play?",
         "The acting was good but the script developed limited aspects of the characters. Xinghua obviously is pregnant by her brother in law because she's shown to be sick a couple times. At the end she seems to be leaving to be with her brother in law because she's headed for his grove of trees and her husband has died chasing his greed - but I had some doubt because the brother in law had been unreliable in the past and she may not have forgiven him. Also the film did not have the beautiful cinematography that some of the better known Chinese films have.",
         "The characters are engaging, the actors are outstanding, the scenery is breathtaking, and the story is engrossing. There's just one problem: the ending. I think it's open to interpretation, and it's hard to be sure of what happens when the movie's over. Also, certain plot points don't seem to add up right; I can't give details without giving spoilers, and I may have misunderstood something (sometimes subtitles can be confusing), but at one point I wasn't sure whether Xinghua was telling the truth (meaning that much more time passed between scenes than I had thought), knowingly lying, or just bluffing to anger her husband. Overall, however, it's an enjoyable film, and quite different for those who don't know a lot about modern rural China. I recommend this movie if you're curious about rural China; however, some familiarity with certain Chinese customs would probably be a big help.",
         "I found this film to be a bit too depressing. I don't mind dramas, but this was a bit too much for me. Luckily, there does seem to be somewhat a decent outcome. I suppose it was well done. I'd watch it again, but it's nothing to rave about."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Youth Film Studio of Beijing Film Academy"],
      "summaries": [
         "Gesitueerd in een verlaten dorp nabij de ruines van de Grote Muur in Noord-China, schetst dit allegorisch drama het conflict tussen morele corruptie, oude Onder het systeem van vrije handel heeft kruidenier Wanglai fortuin gemaakt met het kappen van stenen uit de Grote muur en hetbedriegen van zijn klanten. Ondertussen is Xinghua verliefd geworden op de idealistische Fulin. Maar uiteindelijk blijkt diens progressieve voorkomen een alweer conformistisch en lafh",
         "In Northern China, Xinghua lives with her husband, who makes money by selling stones from the Great Wall. But she is unable to give him a son to inherit this wealth. When her husband hatches a plan to tear down the local historic fortress to find a legendary hidden treasure, she finds herself drawn to a gentler, more educated man who wants to preserve it."
      ],
      "budget": 0
   },
   "movielensId": 844,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1994-03-30",
      "dvdReleaseDate": null,
      "directors": ["Yin Li"],
      "runtime": 90,
      "movieId": 844,
      "title": "The Story of Xinghua",
      "mpaa": "",
      "actors": [
         "Jiang Wenli",
         "Zhang Guoli",
         "Xingli Niu",
         "Tian Shaojun",
         "Zhang Haiyan"
      ],
      "imdbMovieId": "0108227",
      "originalTitle": "The Story of Xinghua",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "This Chinese melodrama presents an allegory tinged with feminism with it’s portrayal of life and free enterprise in a modern, liberalized Chinese mountain village. Wanglai is the shady town grocer who steals stones from the Great Wall to sell as souvenirs.",
      "tmdbMovieId": 297645,
      "avgRating": 3.75691,
      "releaseYear": "1994",
      "numRatings": 181,
      "posterPath": "/z5XSFR7szHfCKrJ6zzJ5814IyfL.jpg"
   }
}