{
   "tmdb": {
      "original_language": "vi",
      "keywords": [
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "bicycle taxi",
            "id": 226577
         }
      ],
      "imdb_id": "tt0112767",
      "video": false,
      "title": "Cyclo",
      "recommendations": [
         42506,
         123997,
         257638,
         78128,
         52512,
         262650,
         141032,
         159414,
         64719,
         45999,
         98636,
         19552,
         98193,
         87147,
         45572,
         134769,
         79860,
         27197,
         42627,
         29268
      ],
      "backdrop_path": "/6xfBL3Wb6t1zPH2K3WgxKEIeJr8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Cyclo",
               "gender": 2,
               "credit_id": "52fe45d99251416c910408b9",
               "name": "Le Van Loc",
               "profile_path": "/5lAKlAhPKVL4JfLiJEmJ9ahxy82.jpg",
               "id": 128485,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Poet",
               "gender": 2,
               "credit_id": "52fe45d99251416c910408bd",
               "name": "Tony Leung Chiu-Wai",
               "profile_path": "/xSEwMBLHdiKjyG4YVCsjpaT5fgD.jpg",
               "id": 1337,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Madam",
               "gender": 1,
               "credit_id": "52fe45d99251416c910408c1",
               "name": "Như Quỳnh Nguyễn",
               "profile_path": "/dk2Yea4lbqhhyMks9cW3MqfjgoH.jpg",
               "id": 20201,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Tooth",
               "gender": 2,
               "credit_id": "52fe45d99251416c910408c5",
               "name": "Hoang Phuc Nguyen",
               "profile_path": "/itRNZgaMUwTxB434y4KDBH1iCeO.jpg",
               "id": 128487,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Knife",
               "gender": 0,
               "credit_id": "52fe45d99251416c910408c9",
               "name": "Ngo Vu Quang Hal",
               "profile_path": null,
               "id": 128488,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Happy Woman",
               "gender": 0,
               "credit_id": "52fe45d99251416c910408cd",
               "name": "Tuyet Ngan Nguyen",
               "profile_path": null,
               "id": 128489,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Sad Woman",
               "gender": 0,
               "credit_id": "52fe45d99251416c910408d1",
               "name": "Doan Viet Ha",
               "profile_path": null,
               "id": 128490,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Crazy Son",
               "gender": 0,
               "credit_id": "52fe45d99251416c910408d5",
               "name": "Bjuhoang Huy",
               "profile_path": null,
               "id": 128491,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Cyclo's Friend",
               "gender": 0,
               "credit_id": "52fe45d99251416c910408d9",
               "name": "Vo Vinh Phuc",
               "profile_path": null,
               "id": 128492,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Grandfather",
               "gender": 0,
               "credit_id": "52fe45d99251416c910408dd",
               "name": "Le Kinh Huy",
               "profile_path": null,
               "id": 128493,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Sister",
               "gender": 1,
               "credit_id": "52fe45d99251416c910408e1",
               "name": "Tran Nu Yên-Khê",
               "profile_path": "/kA8tIxj9fu0IJwnzoF4Tu5eqDWc.jpg",
               "id": 113388,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Foot Fetishist",
               "gender": 2,
               "credit_id": "570357a6c3a36822bd00069b",
               "name": "Trịnh Thịnh",
               "profile_path": null,
               "id": 1601161,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Money Thief",
               "gender": 0,
               "credit_id": "570560ebc3a3680c90000a12",
               "name": "Chu Hung",
               "profile_path": null,
               "id": 20965,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Cabaret Man",
               "gender": 0,
               "credit_id": "5705610f92514175f9000a02",
               "name": "Manh Cuong Tran",
               "profile_path": null,
               "id": 35055,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Lullaby Man",
               "gender": 0,
               "credit_id": "5705612592514175f4000996",
               "name": "Nguyen Van Day",
               "profile_path": null,
               "id": 1601912,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d99251416c910408af",
               "name": "Tran Anh Hung",
               "profile_path": "/xrJKzB1anxjGL8OHCf9ZeRohic5.jpg",
               "id": 107730,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d99251416c910408b5",
               "name": "Tran Anh Hung",
               "profile_path": "/xrJKzB1anxjGL8OHCf9ZeRohic5.jpg",
               "id": 107730,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57a202b2c3a3682d230024c1",
               "name": "Adeline Lecallier",
               "profile_path": null,
               "id": 5428,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "57a202bec3a3682d9d0026a7",
               "name": "Alain Rocca",
               "profile_path": null,
               "id": 5427,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "57a202cac3a368479d008b06",
               "name": "Christophe Rossignon",
               "profile_path": "/jQ9b5lSeI63w4BLXWfg8duVnzsD.jpg",
               "id": 5425,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57a202dac3a3682d230024d8",
               "name": "Benoît Delhomme",
               "profile_path": "/qa2h6tyIG4iIc700VN7acYnhU4v.jpg",
               "id": 21655,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a202ecc3a3682d230024e0",
               "name": "Nicole Dedieu",
               "profile_path": null,
               "id": 1660835,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a202f89251415f2c002cec",
               "name": "Claude Ronzeau",
               "profile_path": null,
               "id": 1660836,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.748815,
      "production_countries": [
         {
            "iso_3166_1": "VN",
            "name": "Vietnam"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 36266,
      "vote_count": 30,
      "budget": 0,
      "overview": "Follows a young cyclo (bicycle cab) driver on his poverty-driven descent into criminality in modern-day Ho Chi Minh City. The boy's struggles to scratch out a living for his two sisters and grandfather in the mean streets of the city lead to petty crime on behalf of a mysterious Madame from whom he rents his cyclo.",
      "similar": [
         627,
         23949,
         12271,
         20289,
         22318,
         9777,
         17899,
         979,
         122081,
         180863,
         9025,
         86838,
         796,
         19053,
         9352,
         8363,
         6075,
         4771,
         319,
         39939
      ],
      "original_title": "Xích lô",
      "runtime": 123,
      "poster_path": "/mdOsnSVTLwHMEH1juOLMiwXcO5o.jpg",
      "spoken_languages": [{
         "name": "Tiếng Việt",
         "iso_639_1": "vi"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cofimage 5",
            "id": 1871,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Les Productions Lazennec",
            "id": 5869,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Société Française de Production (SFP)",
            "id": 6849,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lumière",
            "id": 11793,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 16366,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Salon Films",
            "id": 21331,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cofimage 6",
            "id": 78239,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Giai Phong Film Studio",
            "id": 78240,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1995-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Vietnam",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tran Anh Hung"],
      "runtime": 123,
      "synopsis": null,
      "writers": ["Tran Anh Hung"],
      "originalLanguage": "Vietnamese",
      "imdbLink": "http://www.imdb.com/title/tt0112767/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2ODY3OTA2OF5BMl5BanBnXkFtZTcwNjgxMjAwMQ@@._V1_SY290_CR1,0,214,290_AL_.jpg",
      "actors": ["Stars: Le Van Loc, Tony Chiu Wai Leung, Tran Nu Yên-Khê | See full cast and crew »"],
      "reviews": [
         "In Vietnam, a cyclo is both the driver of a bicycle taxi and a name given to the taxi itself. In Tran Anh Hung's 1995 film Cyclo, the cyclo driver is a naïve 18-year old (Le Van Loc) whose innocence is corrupted by the choices he is compelled to make to escape the circle of grinding poverty. Cyclo is far removed from the director's introspective and contemplative dramas (Scent of Green Papaya, Vertical Ray of the Sun) that preceded and followed it. In Cyclo, Tran assaults our senses with the churning swirl of colors and sounds of Ho Chi Minh City, capturing the vibrations of the city with its street markets, pavement cafes, sidewalk vendors, and choking traffic. He also shows the underbelly of the city: its violence, flesh for hire, and atmosphere of poverty, dirt, and decay. While the violence is graphic and unsettling, it is not exploitative and without the glamour associated with gangster films. Cyclo has little dialogue, mostly gestures and silences, and cinematographer Benoit Delhomme's focus on the underlying beauty of the city gives the film a lyricism that renders the violence ambiguous. Cyclo has lost both parents and lives in near poverty with his grandfather (Le Kinh Huy), who continues to work fixing bicycle tires despite his failing health. His younger sister (Phan Ngoc Lieu) earns a living by shining shoes outside of restaurants and the older sister (Tran Nu Yen-Khe) works as a cook and delivery person. Cyclo's father was also a pedicab driver but was killed when he was hit by a truck. Cyclo's boss (Nguyen Nhu) is known only as the Boss Lady (none of the characters in the film are named) who leads a criminal operation while taking care of her retarded son (Bjuhoang Huy). When Cyclo's bicycle is stolen by a rival gang, the young man is recruited by the Boss lady and her associate, The Poet (Tony Leung Chiu Wai), a small-time hoodlum and pimp, to work off his debt. The Poet is involved with robberies, sabotage, drug trafficking, and prostitution and is no stranger to homicide. He is strangely sympathetic to Cyclo, however, and seems to share with him the common longing for an absent father as revealed in the poetry he reads to him. Cyclo asks to join his gang but, in response, is forced to witness a mobster singing lullabies while he knifes a victim who is bound and gagged. Unknown to Cyclo, the Poet recruits his older sister into prostitution, making her available to men interested in various fetishes while preserving her virginity, presumably out of his own love for her. When her virginity is finally violated, The Poet tracks down and brutally murders the offending patron. Cyclo is forced to stay in an apartment away from his family and told to perform errands for the gang such as smuggling dope hidden in slaughtered cattle and throwing a gasoline firebomb into the building of the rival gang that stole his pedicab. Tran's vision is hallucinatory and unnerving and I often found myself unable to distinguish between what is real and what is a dream. The story is told from Cyclo's perspective and we enter his mind to witness his steady descent into confusion and fear, culminating in a memorable sequence where he combines pills and liquor and drenches himself in blue paint. Cyclo is disturbing and raw but it is an original work of art, both a brutal and often bizarre look at Saigon's mean streets, and a searing love poem to the city and a young man who finally steps outside the vicious circle to discover himself beyond the chaos.",
         "First of all I was blown away by the strong visual quality of Cyclo. Directed by the talented Ahn-Hung Tran, a Vietnamese/French director. This is his second film after the critically acclaimed `Scent of a Green Papaya'. The film looks and feels like a visual poem, and you can't do anything but be awestricken by the sheer intensity and power of the images and their composition that are expressed towards you. Even if their exact meaning isn't always clear to us. In visual terms I would say that the director borrows more from photographers and video artists than other films. What emerges from this is a bold and powerful film. But unlike his fellow film director such as Wong Kar-Wai (In the Mood for Love, Fallen Angels), whose films can sometimes give you the same feel as leafing through a hip photo magazine. Tran's film is more collected, even though it can be made a point out of the plot at times being a bit sketchy. The story circles around a young cyclo (played by Le Van Loc), a bicycle taxi driver (pedicab), his older sister and her lover / ex-lover the local hoodlum, know as the poet ( played by Hong Kong star Tony Leung). We don't learn any of their real names; even the film credits them as the cyclo, the sister, the poet, the grandfather, the madam etc. The cyclo has lost both his parents and is currently living with his siblings and his grandfather. The film gives us a unique view of the contrasts and the poverty of Saigon. Everyone in this household has to work, in order to make ends meet. The cyclo drives his pedicab looking for passengers. His younger sister shines shoes after school. The beautiful older sister cooks and carries water from the marked, and even the old grandfather repairs tyres. The chain of events starts rolling when the cyclo gets jumped by rivals who steal his pedicab and beat him up. The cyclo who was employed by the local gang boss, the madam, is now forced into taking up petty crimes, under her sponsorship to pay for his cab. But instead of returning to a normal life, he is pressured by the madam's gang led by the silent gangster the poet, to commit even more violent crimes, on madams behalf. The poet however, is at the same time living a second life as a pimp, under which guise he recruits the cyclos elder sister (presumably because she and her family need the money). There is also a clear indication that she and the poet are either lovers or have been so. But trying to follow or find the plot of the film is missing the whole point of this film. Events occur suddenly for no direct reason, while other times, events don't occur as you as a viewer expect them to. The film follows a dynamic structure reflecting the human spontaneity. Events are sometimes difficult to make out, because the director clearly doesn't believe in feeding us information with a spoon. It's liberating to watch a film that isn't afraid of its audience, and deliberately has a storytelling that leaves much up to our imagination and interpretation of event. There is such room for speculation, because Tran leaves a whole continent of emotions and information unexposed. Let me just point out that this is not a bad thing in anyway. We are raised upon a tradition of films that force-feed us their purpose. Formula based clichés where you know where the film is going and what's going to happen after watching 10 min of it. What Ahn-Hung Tran does is both daring and plausible: breaking new ground and expanding our horizons. As I mentioned, that trying to follow the plot is to miss the point of this film. It reminds me of French new wave aesthetics and the work by John Cassavetes. While most films and their characters are more about doing instead of being, this film does the direct opposite. It seems like the story is serving the purpose of exposing a distinct character emotions, instead of the western plot driven stories, where characters serve as devices to push the plot forward. Tran has a great eye for visual composition and picking out details he want to show. The films story could easily have turned into something uninteresting and shallow. But the attention the right detail along with the decision to show consequences of situations instead of action and confrontation makes this a unique insight of human nature. The main characters are all mostly silent throughout the film. This strengthens the feeling of them being almost passive accepting of the choices pressed upon them. Because the cyclo, his sister and the poet are all in one way or another force to do what they're doing, either by each other or by their environment. With this minimal amount of dialog, the majority of the scenes are more dependant of the characters actions or more: their reactions. Their expressions and body language conveys their desires and torments, without ever becoming sentimental. Ahn Hung Tran's storytelling suits the exquisite minimalist approach the cinematographer Benoit Delhomme turns toward the material. The films fixation with fluids is also quite interesting choice. All kind of fluids play a visual and symbolic role throughout the entire film: water, mud, sweat, paint, even urine and blood. Everything ads to the visual flow of the film. Evoking an incredible atmosphere of chaos, helter-skelter activity that seems to follow no law, the strength of cyclo lies in its imagery. Stunning colours and cascade of metaphors, on many different levels, constructs a coherent picture of the world. The main story is regularly intertwined by photomontages from Saigon: everything from the city streets of Saigon, or a montage of all the residents of a particular block, classroom of children singing Vietnamese songs. And a quite surreal funny scene of a helicopter carrier that tips over with its military helicopter, in the middle of heavy street traffic. Everything is connected with a kind of dream logic that's hard to define, where things just fit together even if they logically shouldn't. The film is a beautiful daring triumph, which isn't afraid of its audience. It will make you reflect over it long after you have seen it. And isn't that what all good art should do ?",
         "Xich lo is a highly disturbing movie which manages to combine aspects of many cinematic traditions to make something new. It seems that the director held European cinematic and directorial traditions very high, and that is plainly visible in this movies. But the use of colours that somehow seem to move the soul can only be asian. The humdrum of the city does not let up. The movie depicts a vicious cycle of abuse, extortion and violence. Le cyclo's attempt to get justice after his cyclo has been stolen is futile at first. Angry, he seeks help from le poete. This leads him into a spiral of violence, drugs and insanity. The fact that the actors do not have names, simply lables, such as \"le cyclo,\" \"le poete\", and \"le grand-pere,\" seem to reinforce the futileness of life in such conditions. There is a strong undercurrent of frustration in this movie. Le poete, pimping out his girlfriend to fetishists whose pleasure does not come from the sexual act. He wants to keep her virtue for himself, but of course, this is folly. And even sadder is the le grand-pere, who is old, and sick, and yet, has to perform back breaking work to get by in life. Given a chance to earn some money, he rejects it, sticking by his principles. But ultimately, this does not get him anywhere. So what is one to do? Being honest doesn't help you get anywhere. Neither does being a gangster. Or a madame. In the end, this is the question that remains unanswered...or to which there is no answer.",
         "\"Cyclo\" is one of the greatest independent movies ever made. Vietnamese Auteur Tran Anh Hung shows how by accident violence becomes dominant in the life of a poor, young worker toiling in the streets of Saigon. Brilliantly shot with sometimes shocking and very intimate close-ups of violence and perversion, this movie deserves more attention. Besides \"Cyclo\" is also a documentary about the sad daily street life in giant third world cities and the permanent fight to survive.",
         "The camera-work in this film is unbelievable. I haven't seen many films from Vietnam but this one is undoubtedly the best. Cinematography is top notch. Some of the photography is mind-boggling. Xich lo is about a young bicycle taxi driver from a poor family who becomes involved in gang activities after his taxi is stolen and his options are limited. The 123 minutes of the film give time for good character development. The gang's lieutenant, Poet, is a ruthless criminal who rarely speaks and is troubled his bad childhood and a recurring nosebleed problem. Madame is the wise leader with a retarded son, Fishmouth. Every character in the story is human, each with their own problems. I am not familiar with the filmmakers' other works so I don't know if there are any political or social messages contained in this film, but one shot of a wealthy, clean development late in the film is shown in sharp contrast to the dirty and violent world that we see in the rest of the film. My only criticism of this is the pace.. it dragged slightly at a few points, and these seemed to be included in the final cut for the poetry and songs contained in them. I give this film a 10 in the end. Highly recommended.",
         "\"Cyclo\" tells of an impoverished Saigon family whose son (Cyclo) turns to crime and whose daughter turns to prostitution as a matter of economic survival. A magnificent accomplishment in cinematography, there's little new to be found in the film's somewhat muddled story which is told almost exclusively with the camera as Oscar winning director Anh Hung Tran demonstrates mastery over the lens in delivering this tapestry of pictures which captures the beauty and blight of a bustling Vietnamese city. Not for everyone, \"Cyclo\" will play best with those who appreciate true artistry in film.",
         "I've seen this movie for several times, and can't get enough of it. There are a lot of reviews here, I mostly can agree with (redanit and others). So I will just add some thoughts of mine. The camerawork, composition, acting and plot(s) are all absolutely exceptional, the (Vietnamese) cultural aspects about family (father-mother-child) are omni-present (mentioned by redanit, also \"the egg\"); HCMC is a really captivating,noisy and ugly city in this movie, but Tran Anh Hung also shows the \"other side\" of Vietnam in his new one, \"À la verticale de l'été\", again on family and relation. Tran Anh Hung has created a real masterpiece with Cyclo (Xich-Lo), worth 10 for sure ! See it and you will know why Vietnam has banned this one !",
         "This is an astonishing film. It captures Vietnam as it transforms from a tightly controlled communist state to a free-market economy, with the poverty, crime, overcrowding and squalor in graphic detail. It must be one of the most dramatic portraits of Third World poverty ever put on film. The story of a young man's descent and redemption goes back to 1930s Hollywood and the Italian neo-realists. But it is transformed by its setting in a Saigon hell-hole, and by the complexity of the characters. There are no stereotypes. Even the most vicious pimps and murderers have redeeming features. And an overall theme of a father's influence on his sons is distinctively Asian. The emigre Vietnamese director Anh Hung Tran brings a cold, sharp yet loving eye to Saigon and Vietnam. One of the greatest films of the 1990s.",
         "On first sight maybe just another nouveau-violence movie, but actually much more than that. It's about the coming of age of three characters: a riksja-rider, his sister and a poet/pimp/ganster. The innocent riksja rider is forced to join a gang, his sister transforms from water-carrier to some sort of geisha (somehow staying virgin), and the poet who \"moves\" them suffers from a mental crisis. All this against the decor of a busy, and quite noisy, Ho-Chi-Min City. Every now and then the story is put in a frame by seemingly uncorrelated shots of o.a. posing children. Fluids, like blood, paint and water, are present in almost every scene. Perhaps it was a (failed) attempt to soften the censors, but any western influence that shows up in the movie has a negative aura. And then there is the funny shot of a us-army helicopter that is carried by a low-loader through a busy crossing and that falls side-ways on the street. It's 120 minutes of fascinating cinema, and one of the very few movies I give my 10.",
         "\"Cyclo\" begins with neo-realist naturalism, as a young man struggles day to day driving his cycle taxi in modern day Vietnam. His father has just died, and after working his entire life as a bike-taxi driver, has nothing to leave his children, but the suggestion that they might find something nobler to do with their lives. The young man spends his days navigating the alleys and the side streets for the quickest routes and attempting to avoid collisions with other bike taxi drivers who have divided the city into turfs and gangs, of who can pick up customers where. One day his taxi is stolen, and to repay the taxi's owner (a local lady crime boss); he has to take on a series of petty crimes to pay the debt. The young man is never given a name; the credits refer to him as \"Cyclo\", his sister as \"sister\" etc. His sister(played by the gorgeous Tran Nu Yen-Khe begins a tenuous relationship with the boss of the gang Youth works for, a silent constantly smoking man called \"Poet\" played by the always excellent Tony Leung. By relationship I mean he pimps her out to old business men provided they \"not touch her\", instead she indulges their foot and urine fetishes, in at first disturbing and then increasingly reflective and resigned scenes. The Poet rarely speaks but we hear his poetry for time to time in voice over, obliquely appearing and disappearing. The first half of the film focuses more on Cyclo getting in over his head with the gang, stealing, transporting drugs,and lighting a rival building on fire with a Molotov cocktail. The second half shows us more of the \"Poet\" and \"the Sister\". Dialog is sparse throughout, but the sister seems to only really exist in relation to the poet, he pimps her out, but not too much. That may be going too far, as we do get a \"sense\" that her indulging the fetishists is more amusing and certainly less physically tiring than the work she was doing before. Leung's apartment becomes a kind of club house for the girls, a paradoxical bordello of innocence. The Poet is corrupt but wants to keep some aspects of his life pure. There are scenes where he is beaten by his father and collapses into sudden helpless boyhood, and a virtuoso and pivotal scene in a nightclub set to Radiohead's \"Creep\", in the best tradition of using pop songs to encapsulate not just moment in time (the 90's in which the film is set), but the very heart of a character. When Yorke sings \"what the hell am I doing here?\" it might as well be Leong singing it aloud. As Cyclo becomes more fascinated with the power, attention, and adrenalin rush he is getting from the gang, \"Poet\" becomes more aloof splitting his time between the three girls he pimps, and he the lady crime boss who he serves as soldier and lover(or whore depending on how you look at it). Vietnamese/French director Ahn Hung Tran delicately weaves us in and out of violence and tranquil beauty, near psychedelic explosions of color and poetic reflections, pimps and corpses and children happily at play. After he commits his first major crime, we see him covered in filth, as he had to escape the police in a river or tunnel. The escape isn't fully shown, and we are left with the image of the crime and then the criminal covered in what looks like s*&t; insects crawling slowly across his lips in a close up. To clean his face he puts it in a fish bowl (his only company in the dilapidated room the Poet forces him to live in.), and effectively contaminates the world of the only friend he had. It's a great visual metaphor for gang violence and corruption and its effect on community life, it just makes everything dirtier and sh*&$ier. By the end of the film, Cyclo does not come to his senses, but implodes on himself, and get's a brief offer to escape the life he bumbled or was forced into (its implied that one of the Lady crime bosses henchman was involved in stealing Cyclo's taxi in the first place.) The crime queen's handicapped son, who is Youth's same age, is a kind of mirror image of him throughout the film; financially privileged to his economic struggle, an eternal child to his forced growing-up, the apple of his mother's eye to the deafening absence of being an orphan. Cyclo's blue neon painted face at the end is less about psychedelic freak out as it is a desperate desire to escape back to the simplicities of childhood. The fates of the Poet, Youth, and the crime mistresses' son each reach their peak, at the same moment, showing us the product of innocence/idiocy and evil/apathy. In psychological terms this is guilty and reflective super-ego (poetic Leung) and impulsive childish Id (overgrown man-child son) on two opposite poles of self-destruction, and Ego sandwiched between the two, clinging to a faint possibility of hope/rationality. \"Cyclo\" is compulsively watchable and despite its experimentations easily accessible. The films score reminded me of a Hitchcock film, and is responsible in large to the films strange atmosphere, as if a horror film lurks just beneath the surface at all times, waiting to escape. In a sense the ominous sound-scape is fitting, as there is a horror waiting to devour the characters, and it is their lives. \"Cyclo's\" cinematic and aesthetic techniques amount to nothing less than incredibly solid and visually breathtaking storytelling, that elevates it's well-worn concept a step above the rest."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Canal+",
         "Centre National de la Cinématographie (CNC)",
         "Cofimage 5"
      ],
      "summaries": ["A young man who struggles through life by earning some money with his bicycle-taxi in Saigon (Ho Chi Minh city) gets contact to a group of criminals. They introduce him to the mafia-world of drugs and crime."],
      "budget": 0
   },
   "movielensId": 850,
   "movielens": {
      "languages": ["Tiếng Việt"],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["Tran Anh Hung"],
      "runtime": 123,
      "movieId": 850,
      "title": "Cyclo",
      "mpaa": "",
      "actors": [
         "Le Van Loc",
         "Tony Leung Chiu-Wai",
         "Như Quỳnh Nguyễn",
         "Hoang Phuc Nguyen",
         "Ngo Vu Quang Hal",
         "Tuyet Ngan Nguyen",
         "Doan Viet Ha",
         "Bjuhoang Huy",
         "Vo Vinh Phuc",
         "Le Kinh Huy",
         "Tran Nu Yên-Khê",
         "Trịnh Thịnh",
         "Chu Hung",
         "Manh Cuong Tran",
         "Nguyen Van Day"
      ],
      "imdbMovieId": "0112767",
      "originalTitle": "Xích lô",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Follows a young cyclo (bicycle cab) driver on his poverty-driven descent into criminality in modern-day Ho Chi Minh City. The boy's struggles to scratch out a living for his two sisters and grandfather in the mean streets of the city lead to petty crime on behalf of a mysterious Madame from whom he rents his cyclo.",
      "tmdbMovieId": 36266,
      "avgRating": 3.53184,
      "releaseYear": "1995",
      "numRatings": 267,
      "posterPath": "/mdOsnSVTLwHMEH1juOLMiwXcO5o.jpg"
   }
}