{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "outback",
            "id": 157906
         }
      ],
      "imdb_id": "tt0104109",
      "video": false,
      "title": "Dingo",
      "recommendations": [],
      "backdrop_path": "/bfyzTxapDqmrPqqWyXPTKmnBWaH.jpg",
      "revenue": 300000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "John Anderson",
               "gender": 2,
               "credit_id": "52fe4745c3a368484e0bdc87",
               "name": "Colin Friels",
               "profile_path": "/tXKCpTwCs4TZYdQ6p5Kch7sRkkS.jpg",
               "id": 27753,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Billy Cross",
               "gender": 2,
               "credit_id": "52fe4745c3a368484e0bdc8b",
               "name": "Miles Davis",
               "profile_path": "/uc3NDjzPmWxIxO14tLNIh7LOv58.jpg",
               "id": 15393,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jane Anderson",
               "gender": 1,
               "credit_id": "52fe4745c3a368484e0bdc8f",
               "name": "Helen Buday",
               "profile_path": "/saALgdtjdNzD89RgF26n0PAmlyX.jpg",
               "id": 57424,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe4745c3a368484e0bdc93",
               "name": "Joe Petruzzi",
               "profile_path": null,
               "id": 164583,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Beatrice Boulain",
               "gender": 1,
               "credit_id": "52fe4745c3a368484e0bdc97",
               "name": "Brigitte Catillon",
               "profile_path": "/5Lk7epqxqcd8TdxfexOc06kiTNn.jpg",
               "id": 20081,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4745c3a368484e0bdc7d",
               "name": "Rolf de Heer",
               "profile_path": "/rrOPgrvHpr0GB8xfk12NUZdiNZZ.jpg",
               "id": 112674,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4745c3a368484e0bdc83",
               "name": "Marc Rosenberg",
               "profile_path": null,
               "id": 38652,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4745c3a368484e0bdc9d",
               "name": "Miles Davis",
               "profile_path": "/uc3NDjzPmWxIxO14tLNIh7LOv58.jpg",
               "id": 15393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4745c3a368484e0bdca3",
               "name": "Michel Legrand",
               "profile_path": "/ewYlyU0UvONnt7jjHhaSXCKVHVa.jpg",
               "id": 10934,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.667606,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 66634,
      "vote_count": 1,
      "budget": 200000,
      "overview": "Young John Anderson is captivated by jazz musician, Billy Cross when he performs on the remote airstrip of his Western Australian outback hometown after his plane is diverted. Years later, now a family man and making a meagre living tracking dingoes and playing trumpet in a local band, John still dreams of joining Billy on trumpet and makes a pilgrimage to Paris.",
      "similar": [
         9555,
         26405,
         873,
         9659,
         8810,
         9355,
         2759,
         36040,
         244786,
         594,
         334543,
         313369,
         525,
         8982,
         16608,
         76341,
         283552,
         245846,
         6972,
         4657
      ],
      "original_title": "Dingo",
      "runtime": 109,
      "poster_path": "/aLPAqR2AckHSiS1v6JElHjeoY9V.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Vertigo Productions",
         "id": 2756,
         "origin_country": ""
      }],
      "release_date": "1991-06-02",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Truth is magic...It makes dreams come true.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rolf de Heer"],
      "runtime": 109,
      "synopsis": null,
      "writers": ["Marc Rosenberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104109/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxNjM4NjcxM15BMl5BanBnXkFtZTcwNTMzMzMzMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Colin Friels, Miles Davis, Helen Buday | See full cast and crew »"],
      "reviews": [
         "In many ways, \"Dingo\" can be thought of as a thinking-person's Crocodile Dundee. It tells the story of a young man who has lived in the Australian bush all his life, and had a cathartic moment at age 12 when veteran jazz-blues trumpeter Billy Cross (Miles Davis) lands his plane on the local airstrip and plays an impromptu jazz session. As Cross is about to leave, the boy tells him that the music is the best thing he'd ever heard. Cross then says that if the boy is ever in Paris, he should look him up. Twenty years later, and the boy has become a trumpeter who has always remembered this invitation. His wife and friends tell him he'll never get to Paris. The movie follows the man's passions, and with a spaciousness and sparcity that fits in well with the glorious outback. Colin Friels is perfect for the role.. playing the bush-bred trumpet-playing 'dogger' who is constantly after a dingo who will not be caught.. just as in his own life, he hangs onto that twenty-year old dream of going to Paris. In Paris there is salvation, both for him and the aging, damaged Billy Cross (played minimally, but effectively, by Davis). And the jam in the Paris nightclub must rank as one of the great filmed sessions in Jazz history. If you love jazz or blues, you must see this film. If you love the Australian bush, or wish to understand it, you must see this film. If you are in neither category, see it anyway.",
         "Sadly this film is an undiscovered little gem, it was not widely shown in the United States. Anyone who loves jazz, Miles Davis especially, will wish to see it. But you do not have to like jazz to like this film, nor do you have to be a fan of Australian films to like this film! It is wonderfully done, a real shame it did not reach wider audiences. One outstanding performance - although a small one in the film - is Hans Meyer as the owner of a Paris jazz club.",
         "I won't fight with Phil Kafcaloudes synopsis of the movie, its spot on, I just wanted to add my comment on the final jazz scene in Paris. Every time i have described that scene to friends and all, I cry. Tears of joy mind you, Reason? Its because of the look on Colin Friels' face, a kid in candyland for the first time, maybe, you can see he is in seventh heaven , the only dream he ever had is coming true in front of us the movie audience and in front of the live audience in the Paris club, The moment just takes you to a special place of powerful emotions of Happiness. what can i say? i cry at movies , so sue me!! grin p.s. this is ridiculous even writing a comment has made me cry!!",
         "I have an old VHS copy of this film and I haven't had a VHS player for more than a decade. I'm not even sure if this ever came out on DVD, I've never seen it in a video shop and I have looked through many. This movie is kind of like an Outback Australian Sci-Fi Jazz Road Trip, brought to you by the man who blessed us with Bad Boy Bubby. The opening scene when Miles Davis lands his space ship (commercial airliner?!?!!), in the desert and proceeds to blow fragile rural minds to smithereens with an awesome array of Jazz Fusion is priceless. I pray to the almighty gods of Jazz that they might one day release this fine film in a format befitting cinema as far out as this.",
         "I loved this movie - partly as a story about jazz, and jazz musicians. Along this line, it couldn't have been better than to star Miles Davis. Knowing nothing of Miles' private life, I wouldn't be in the least surprised to hear the portrayal of Billy Cross was mostly autobiographical. If it had been a non-musical actor, the movie would still be entirely worthwhile. With Miles, Michelle Legrand and Chuck Finley, the music could only be of the highest caliber and indeed, was. However, regardless of the jazz aspect, the point of my review is that this is not just a jazz movie. There are several subplots, which are about people, each of whom has a dream (a goal dream, not a sleep dream). At one point, this is even brought up in the dialog, though it's left appropriately unanswered. The movie follows their lives towards these dreams. In some characters these dreams are, shall we say, past. And of course the scenery, the Australian outback and the streets of Paris is wonderful. The soundtrack includes the background sound of these places, so different yet helps us to see what is shared. When this movie came out it had a one day run in Seattle. What a shame that it was so brief.",
         "the only problem, I and others noticed, was the exclusion of Australian Aborigines. The film depicts the outback Nullabor townships as consisting of just white people. Therefore the authenticity was ruined somewhat."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "AO Productions",
         "Gevest Australia Productions"
      ],
      "summaries": ["Traces the pilgrimage of John Anderson, an average guy with a passion for jazz, from his home in outback Western Australia to the jazz clubs of Paris, to meet his idol, jazz trumpeter Billy Cross."],
      "budget": 0
   },
   "movielensId": 853,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-06-02",
      "dvdReleaseDate": "2002-04-09",
      "directors": ["Rolf de Heer"],
      "runtime": 109,
      "movieId": 853,
      "title": "Dingo",
      "mpaa": null,
      "actors": [
         "Colin Friels",
         "Miles Davis",
         "Helen Buday",
         "Joe Petruzzi",
         "Brigitte Catillon"
      ],
      "imdbMovieId": "0104109",
      "originalTitle": "Dingo",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["1kXUk3dr33c"],
      "plotSummary": "Young John Anderson is captivated by jazz musician, Billy Cross when he performs on the remote airstrip of his Western Australian outback hometown after his plane is diverted. Years later, now a family man and making a meagre living tracking dingoes and playing trumpet in a local band, John still dreams of joining Billy on trumpet and makes a pilgrimage to Paris.",
      "tmdbMovieId": 66634,
      "avgRating": 3.29832,
      "releaseYear": "1991",
      "numRatings": 119,
      "posterPath": "/aLPAqR2AckHSiS1v6JElHjeoY9V.jpg"
   }
}