{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0042054",
      "video": false,
      "title": "Crows and Sparrows",
      "recommendations": [],
      "backdrop_path": "/2Xu0DVH0DNDNa9IwiLY13PcFsib.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "546e69a69251415ffb0005ef",
            "name": "Zheng Jun-Li",
            "profile_path": "/6PNr4sEXJF8oHfRrIbBrUBkQSfN.jpg",
            "id": 1112331,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.071499,
      "production_countries": [],
      "id": 100914,
      "vote_count": 1,
      "budget": 0,
      "overview": "At a Shanghai apartment, Mr Hou, a Nationalist official, gets ready to move to Taiwan upon the imminent defeat of the KMT during the Civil War. Mrs Hou gives an ultimatum to the rest of the tenants to move out on behalf of her husband, who is the \"owner\" of the flat and who is now planning to sell it. From the conversations with the rest, we find out that Hou has been a Hanjian during the Sino-Japanese War and that he has since taken over the apartment by force from the old landlord, Mr Kong.  The tenants, including Mr Kong, Mrs Xiao, Little Broadcast (alias Mr Xiao, played by Zhao Dan) and a schoolteacher, Mr Hua, and his wife, initially plan to band together, but circumstances force them to find other ways out. Mr Hua tries to find a place to stay at the KMT-sponsored school he is teaching in. Little Broadcast and Mrs Xiao invest in black market gold. As the situation escalates, Mr Hua gets arrested by KMT agents and his young daughter falls desperately ill.",
      "similar": [],
      "original_title": "Wuya yu maque",
      "runtime": 113,
      "poster_path": "/chz5wJezJZVsMZZXPATxwKwv6Wc.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1949-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Junli Zheng"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Baichen Chen",
         "Gu Liu"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0042054/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0ODgzNzQ5Ml5BMl5BanBnXkFtZTcwNDMwMTE0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dan Zhao, Yinyan Wu, Daolin Sun | See full cast and crew »"],
      "reviews": [
         "This film was made in 1949 just as the communists were taking over China. It was mostly filmed under the nationalist government, but one can definitely find traces of communist ideaology in the film. With a hopeful look towards communism, \"Crows and Sparrows\" is definitely worth seeing to understand the Chinese spirit of this time.",
         "\"Crows and Sparrows\" is a 1949 film made during the eve of the KMT escape to Taiwan and when the Communist victory is assured. It is clear from this film that the KMT defeat is imminent, so much so that there is no veiled criticism of the Nationalist party - the criticism is pretty direct, and the two characters who embody the Nationalists, the Hou family, are portrayed very unflatteringly. Mr Hou, the Nationalist official, has been a traitor during the Sino-Japanese war, yet is able to gain control of the multi-storeyed apartment which he rents out for his own profit. What is so memorable about this film is that the other characters are very well portrayed - the somewhat timid schoolteacher and his wife; the lower class portrayed by Hu Yin and Zhao Dan; the kind but totally oppressed former old landlord, and the schoolteacher's fellow teachers and the KMT-supporting principal. The production value of this film is a step up those made in 1947 by the Kunlun Studio, such as \"The Spring River Flows East\", \"Eight Thousand Li of Moon and Cloud\" (1947) and \"Myriad of Lights\" (1948). Easily one of the most important and most memorable of Chinese films made in the 1940s, although it is to a certain extent an attack on the deplorable socio-economic conditions of Shanghai under the Nationalists.",
         "This film was started before the Communist take over and complete under the watchful eyes of the Nationalists. Although it was filmed as originally scripted (and now seen on video), it was censored of its more politically sensitive material, although the overall message of the film wasn't pro-communist. Briefly, the film explores the societal problems of the corrupt Nationalist regime of post-WWII China. It takes place in a house that has been commandeered by a corrupt, albeit minor, Nationalist official. The former owner, a well-meaning elder man, has been pushed into a small room in the front. The two other residents, a teacher and his family, and the family of a street merchant (selling American goods) also live under the whims of the greedy and ugly nationalist and his knaiving mistress. While not directly siding with the Communists, the film does portray the Nationalist party as a plague and any revolutionary change as good change. It even goes so far as to stay in touch with the current fighting at the time, with the defeats against the Nationalists playing a role in the film's progress, something the Nationalist government was undoubtedly upset by. For the casual viewer, its a very old fashioned film that looks and feel much like any other film in the early 40's era -only with a slight change in scenery and culture. Its very watchable, the acting is quite good. The best feature was its frank expression of human greed as the weakness of society (its solution must have found favor in the eyes of the Communist officials).",
         "Good film that explores a lot of the experiences of the poorer city folk. Good vs. evil on a smaller scale, yet all the more powerful for it. It's important to remember that this movie was filmed as the GMD was falling, and only released after the Communists had seized power. Thus I would recommend it to anyone wondering what it must have been like to live in an urban area during the fall of the GMD."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Peak Film Industries, The"],
      "summaries": ["A story of a corrupt party official who attempts to sell an apartment building he has appropriated from the original owner and the struggles of the tenants to prevent themselves being thrown onto the street."],
      "budget": 0
   },
   "movielensId": 857,
   "movielens": {
      "languages": [""],
      "releaseDate": "1949-01-01",
      "dvdReleaseDate": "2006-12-01",
      "directors": ["Zheng Jun-Li"],
      "runtime": 113,
      "movieId": 857,
      "title": "Crows and Sparrows",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0042054",
      "originalTitle": "Wuya yu maque",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "At a Shanghai apartment, Mr Hou, a Nationalist official, gets ready to move to Taiwan upon the imminent defeat of the KMT during the Civil War. Mrs Hou gives an ultimatum to the rest of the tenants to move out on behalf of her husband, who is the \"owner\" of the flat and who is now planning to sell it. From the conversations with the rest, we find out that Hou has been a Hanjian during the Sino-Japanese War and that he has since taken over the apartment by force from the old landlord, Mr Kong.  The tenants, including Mr Kong, Mrs Xiao, Little Broadcast (alias Mr Xiao, played by Zhao Dan) and a schoolteacher, Mr Hua, and his wife, initially plan to band together, but circumstances force them to find other ways out. Mr Hua tries to find a place to stay at the KMT-sponsored school he is teaching in. Little Broadcast and Mrs Xiao invest in black market gold. As the situation escalates, Mr Hua gets arrested by KMT agents and his young daughter falls desperately ill.",
      "tmdbMovieId": 100914,
      "avgRating": 3.33,
      "releaseYear": "1949",
      "numRatings": 50,
      "posterPath": "/chz5wJezJZVsMZZXPATxwKwv6Wc.jpg"
   }
}