{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "malaysia",
            "id": 6847
         },
         {
            "name": "hong kong",
            "id": 12354
         },
         {
            "name": "female martial artist",
            "id": 18432
         },
         {
            "name": "illegal drugs",
            "id": 156117
         },
         {
            "name": "jail break",
            "id": 166524
         },
         {
            "name": "jackie chan",
            "id": 192641
         },
         {
            "name": "stunt master",
            "id": 206188
         }
      ],
      "imdb_id": "tt0104558",
      "video": false,
      "title": "Police Story 3: Supercop",
      "recommendations": [
         10753,
         9056,
         9404,
         10975,
         10974,
         21521,
         21519,
         11205,
         11198,
         18857,
         25074,
         18764,
         10622,
         12207,
         21733,
         11636,
         11230,
         33542,
         8697,
         25539
      ],
      "backdrop_path": "/ic450gLSYFUGb5Gxv39YXOqOGOP.jpg",
      "revenue": 20483423,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chan Ka-Kui/Lin Fu Sheng",
               "gender": 2,
               "credit_id": "52fe43ff9251416c7502582f",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Capt Yang Chien Hua",
               "gender": 1,
               "credit_id": "52fe43ff9251416c75025833",
               "name": "Michelle Yeoh",
               "profile_path": "/OhW6BfeZBRn7iupeI8elngV2EN.jpg",
               "id": 1620,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "May",
               "gender": 1,
               "credit_id": "52fe43ff9251416c75025837",
               "name": "Maggie Cheung",
               "profile_path": "/eT5HNJT307Zg2PyMsgKdrtIlG3u.jpg",
               "id": 1338,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Khun Chaibat",
               "gender": 0,
               "credit_id": "52fe43ff9251416c7502583b",
               "name": "Kenneth Tsang",
               "profile_path": "/6oYTIjKlp8vsyxod7nPJ1R9V8Hf.jpg",
               "id": 10885,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Panther",
               "gender": 2,
               "credit_id": "52fe43ff9251416c7502583f",
               "name": "Yuen Wah",
               "profile_path": "/dz71IIr8cfECAOD3KFosz8aj15T.jpg",
               "id": 57609,
               "order": 4
            },
            {
               "cast_id": 25,
               "character": "'Uncle' Bill Wong",
               "gender": 0,
               "credit_id": "52fe43ff9251416c75025887",
               "name": "Bill Tung",
               "profile_path": "/dE7UFkmJqs8PgUOkCTDDI69J90i.jpg",
               "id": 44922,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "The General",
               "gender": 2,
               "credit_id": "52fe43ff9251416c75025855",
               "name": "Lo Lieh",
               "profile_path": "/dtnWwYt8eptupEpraJEAsHwQYcV.jpg",
               "id": 70673,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Hsiung",
               "gender": 2,
               "credit_id": "52fe43ff9251416c75025859",
               "name": "Mars",
               "profile_path": "/zGGxzvblNq4UxNIdXLsQLanvhtS.jpg",
               "id": 119454,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Ching Wing-xi",
               "gender": 0,
               "credit_id": "52fe44009251416c7502588b",
               "name": "Josephine Koo",
               "profile_path": "/xsfXJ0hOVkZYzQCbCsLHeDwVgKi.jpg",
               "id": 1069676,
               "order": 8
            },
            {
               "cast_id": 28,
               "character": "Pierre",
               "gender": 0,
               "credit_id": "53d62646c3a3686b8e0053af",
               "name": "Kelvin Wong",
               "profile_path": "/L4EQoXXkiFuIFTJgTaxHiLp6NR.jpg",
               "id": 224918,
               "order": 10
            },
            {
               "cast_id": 29,
               "character": "General's bodyguard",
               "gender": 0,
               "credit_id": "53d62653c3a3686b8800583f",
               "name": "William Duen",
               "profile_path": "/wf2cYWtpZlehvFE2moyRui01Dze.jpg",
               "id": 1346930,
               "order": 11
            },
            {
               "cast_id": 31,
               "character": "Tai",
               "gender": 0,
               "credit_id": "53d62685c3a3686b8b005b91",
               "name": "Lam Chi-Tai",
               "profile_path": null,
               "id": 1196099,
               "order": 13
            },
            {
               "cast_id": 32,
               "character": "Drug lord #3 bodyguard",
               "gender": 1,
               "credit_id": "55160b55c3a3683485000559",
               "name": "Kim Maree Penn",
               "profile_path": "/vWRg6MExfS2CcJgHAEy8iPUYxGA.jpg",
               "id": 954000,
               "order": 14
            },
            {
               "cast_id": 33,
               "character": "CSP Y K Chan",
               "gender": 2,
               "credit_id": "5743de35c3a3685c4a001349",
               "name": "Philip Chan Yan-Kin",
               "profile_path": "/n1o0tAeQgZWJkJJZKkhIcP6PIjC.jpg",
               "id": 70591,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c75025845",
               "name": "Stanley Tong",
               "profile_path": "/sG4jGodAJpyymBEEODAc0D09bBG.jpg",
               "id": 44916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ff9251416c7502584b",
               "name": "Edward Tang",
               "profile_path": null,
               "id": 46318,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ff9251416c75025851",
               "name": "Jenny Chinn",
               "profile_path": null,
               "id": 68298,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c7502585f",
               "name": "Willie Chan",
               "profile_path": null,
               "id": 56719,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c75025865",
               "name": "Peter Cheung",
               "profile_path": null,
               "id": 46326,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c7502586b",
               "name": "Ardy Lam Kwok-Wah",
               "profile_path": null,
               "id": 65963,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ff9251416c75025871",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ff9251416c75025877",
               "name": "Mac Chew",
               "profile_path": null,
               "id": 1038271,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ff9251416c7502587d",
               "name": "Kar Fei Cheung",
               "profile_path": null,
               "id": 1069673,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ff9251416c75025883",
               "name": "Oliver Wong",
               "profile_path": null,
               "id": 26763,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 10.037973,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 11134,
      "vote_count": 130,
      "budget": 900000,
      "overview": "A Hong Kong detective teams up with his female Red Chinese counterpart to stop a Chinese drug czar.",
      "similar": [
         682,
         55292,
         140300,
         36682,
         9502,
         1586,
         1949,
         146,
         605,
         24,
         275,
         604,
         4771,
         4638,
         2048,
         75780,
         281,
         10835,
         3597,
         3580
      ],
      "original_title": "警察故事 III：超級警察",
      "runtime": 95,
      "poster_path": "/entsYeDr0LVMqWnnmu7CDGZA1fx.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Bahasa melayu",
            "iso_639_1": "ms"
         },
         {
            "name": "ภาษาไทย",
            "iso_639_1": "th"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Golden Harvest Company",
            "id": 2521,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Golden Way Films Ltd.",
            "id": 3054,
            "origin_country": ""
         }
      ],
      "release_date": "1992-07-04",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/5qbfJzkMAUkFxcVo0dqnTRmpUoh.jpg",
         "name": "Police Story Collection",
         "id": 269098,
         "poster_path": "/zF4gP4w1xxM7jDKLjTDK3ixkkms.jpg"
      },
      "tagline": "There's never a cop around when you need one, but when this cop's around, all you need is one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stanley Tong"],
      "runtime": 95,
      "synopsis": "In this third Police Story movie, Hong Kong 'Supercop', Inspector Chan Ka-Kui is sent on a secret mission to mainland China where he is introduced to the military police force's Interpol director, Jessica Yang (Michelle Yeoh), who briefs him on his assignment. The target of the mission is a drug lord named Chaibat. In order to infiltrate Chaibat's Triad organization, the plan is to get close to Chaibat's henchman Panther, who is being held in a Chinese prison labor camp in Canton. Ka-Kui, posing as a petty criminal, is able to help Panther escape with the aid of Chinese military police, who eliminate Panther's men in the prison. Panther then meets up with some of his other men, and Ka-Kui helps them escape to Hong Kong. En route to Hong Kong, Ka-Kui, along with Panther and his men pass through the supposed home-village of Ka-Kui's undercover role. Panther insists that Ka-Kui visit his family there. Realizing he does not actually know anyone in the village, Ka-Kui is apprehensive but is pleasantly relieved to be greeted by undercover military police posing as his family, with Yang posing as his sister. Yang and the Chinese military police help them win Panther's trust by faking the murder of a policeman by Yang. After arriving in Hong Kong, Ka-Kui, Yang and Panther go to Chaibat's luxurious hide out. Ka-Kui and Yang succeed in winning Chaibat's trust, especially after helping his men destroy a fortified drug production lab in Thailand, somewhere in the Golden Triangle, when Chaibat betrays a number of other drug lords who are conducting a heroin deal with him. The action then shifts to Kuala Lumpur, Malaysia, where Chaibat's wife is being held in prison, and is facing the death penalty. However, Chaibat needs to keep her alive because she knows the secret codes to his Swiss bank account, and she will not reveal them to anyone but her husband. More difficulties arise when Ka-Kui happens to run into his girlfriend May at a Malaysian resort hotel. She confronts Ka-Kui, and the situation turns into a misunderstanding, with Panther believing that Ka-Kui was trying to proposition a prostitute. Later, Ka-Kui is able to corner May and explain the situation, and she finally calms down. At one point, May even manages to keep Ka-Kui from inadvertently blowing his own cover. But then, in an elevator, May tells a co-worker about Ka-Kui, and one of Panther's men overhears her. May is taken hostage, and Ka-Kui and Yang their cover now blown are forced to help Chaibat free his wife. Chaibat's scheme is successful, and May is released, as per their agreement. However, the exchange turns sour when Chaibat pushes May from his helicopter. Furious, Ka-Kui and Yang refuse to let Chaibat and his men escape. An elaborate stunt-filled action sequence begins that covers the roads, rooftops, and skies of Kuala Lumpur, finally reaching its climax aboard a speeding train, where Chaibat is killed after his helicopter collides into a tunnel and lands on him. Yang and Ka-Kui finally succeed in apprehending Chaibat's wife. Since her husband is dead, the wife decides to tell Yang and Ka-Kui the password to Chaibat's bank account and the two partners get into an argument over whether Hong Kong or China will take possession of it.",
      "writers": [
         "Edward Tang",
         "Edward Tang"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0104558/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODI0NjUwODg5MF5BMl5BanBnXkFtZTcwOTIyMzYxMg@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Jackie Chan, Michelle Yeoh, Maggie Cheung | See full cast and crew »"],
      "reviews": [
         "This is a great film! Just last night I watched one of his not-so-great films and felt I needed to watch something that fits him, so I chose Supercop. I've forgotten how great it is! Unlike most Jackie Chan movies, this one has a nice plot that is easy to understand and characters that you can easily take a liking to. The music isn't bad in some spots and the storyline is great. Let's not forget the action scenes, which are some of Chan's best (not his VERY best, but good nonetheless)! I really recommend this movie to all Chan fans out there.",
         "POLICE STORY III - SUPER COP (Jing Cha Gu Shi III: Chao Ji Jing Cha) (USA: Supercop) Aspect ratio: 2.39:1 (Technovision) Sound format: Mono Police officer Chan Ka-kui (Jackie Chan) goes undercover within a criminal gang whose millionaire boss (Kenneth Tsang) plans to dominate the Asian heroin trade. Though co-scripted by Chan regular Edward Tang (also responsible for the first two entries in the \"Police Story\" franchise), POLICE STORY III - SUPER COP is slightly darker in tone than its immediate predecessors and offers a much more streamlined combination of comedy, drama and action. This shift in focus was occasioned by the hiring of stuntman-turned-director Stanley Tong (RUMBLE IN THE BRONX, CHINA STRIKE FORCE, etc.), who keeps a tight rein on the film's narrative excesses whilst indulging some of the most spectacular action set-pieces ever filmed, *anywhere*. Nothing in the first half of the movie - Chan's fight with gymnastic beauty Sam Wong at a mainland police training center; his initiation into Tsang's criminal gang by helping the villain's brother (Yuen Wah) escape from a prison work camp; a battle with police in a crowded marketplace, etc. - can prepare viewers for the *astonishing* climactic confrontation between Good and Evil, involving a series of hair-raising car stunts, Chan dangling (apparently unassisted) from a rope-ladder beneath a helicopter as it swings *high* above the streets of Kuala Lumpur (!), and the final hand-to-hand battle on top of a speeding train, upon which the aforementioned helicopter has become precariously entangled - and not a CGI shot in sight! Filmed with breathtaking gusto by artists working at the top of their game, this is commercial cinema at its most astounding (check the outtakes during the final credits, in which various participants come perilously close to serious injury or *death* during filming!). Maggie Cheung makes another extended cameo appearance as Chan's beleaguered girlfriend, though the film is stolen clean away by Michelle Yeoh (billed as 'Michelle Khan' in some prints) as a mainland policewoman who assists Chan in his undercover operation, and who proves to be Chan's equal during the fast and furious combat sequences (the character proved popular enough to warrant her own spin-off feature, PROJECT S, in 1993!). Easily the best of the \"Police Story\" series to date, and one of the most memorable efforts to emerge from HK in the last fifty years, POLICE STORY III - SUPER COP is a winner. Followed by FIRST STRIKE (1996). As usual, the movie was re-edited and rescored for its 1996 US debut under the title SUPERCOP. That version is missing only a few minutes of material, but should be avoided nonetheless. (Cantonese and Mandarin dialogue)",
         "This is a really fun movie. Jerry Bruckheimer could learn a thing or five from Stanley Tong. I can only give it 8 out of 10 because it's not exactly deep, y'know? It is light as a feather, but it's also fun, fun, fun -- far more interesting and surprising than any \"action\" film I've seen out of Hollywood in a long, long time, all of which have seemed to me to be recycling the same script, plot, characters, and score to desperation. (Beats me how people could shell out eight bucks a pop to see Enemy of the State aka Mercury Rising aka Absolute Power...when they could rent Supercop for two bucks and actually see something unexpected.) Of course, this film stars Jackie Chan being his usual goofy self, deftly making his extraordinary skills as a martial artist, stuntman, and physical comedian look as natural as breathing, but the other amazing talent in this piece is exhibited by the fantastic stuntwoman Michelle Yeoh (aka Michelle Khan), the same woman who for the first time blew away many Western moviegoers in Tomorrow Never Dies. I think this woman is made entirely of rubber and springs. Most of her stunts in this movie are actually scarier and more daring than most of Chan's, and some of the most brutal took more than one take. And she did a lot of them in a dress! Fortunately, she is also in the sequel to this, Supercop II. It's seven years old, and I can hardly wait to rent it. (When was the last time you were in a hurry to see an action flick almost ten years old?) Too bad I can't say the same for Rush Hour, which I had to click off after less than 10 minutes because Chan's co-lead character was such an obnoxious idiot. I really hope Hollywood learns from Chan and his Hong Kong associates, and not the other way around. Indicators are not positive. Keep your fingers crossed. Meanwhile, watch Supercop and enjoy something fresh.",
         "With most of these Jackie Chan films, you are guaranteed of getting the same material, meaning: (1) tons of violence; (2) extraordinary stunt scenes; (3) good sound; (4) some hokey dubbed voices; (5) a juvenile story with even more- juvenile attempt at humor; (6) very little profanity and blood; (7) a stupid but still enjoying movie (for at least one viewing.) All of this adds up to a \"fair\" rating. The fun part of watching Chan's films are the outrageous action scenes and stunts by The Man, himself. Especially for someone getting up their in age, Chan is incredible since he does his own stunts. In this film, Chan's girlfriend, played by Michelle Yeoh, does her own stunts, too. She is an excellent martial arts talent in her own right and a pretty lady. By the way, during the closing credits they show some of the stunts that went wrong. Not all of these are shown for laughs. In a few of them, Chan is injured. The sound was amazing for a VHS. I can only imagine the stereo on the DVD. Overall, a dumb movie with unrealistic fight scenes (people just about get killed, but keep getting up for more!) but if you know that and just want to enjoy a lightweight action film, it serves its purpose.",
         "I've seen a lot of Jackie Chan films and its rare to find gem in the many jewels in the films he's made. There are real drama films like Crime Story, or the frentic action in the original police story, there's the three-brother action in Project A, there's the frenctic kung-fu in Drunken Master 2, and then there's this gem. This is certainly the best in the police story series, the action is fantastic, the humor brilliant, the story well put together. The duo of Michelle Kahn (Yeoh) and Chan is amazing, and Yeoh almost steals the show in her own right - her persona and her instance to do her own stunts (like Chan) makes her a marvel to watch - this is why she is so damn good in Tomorrow Never Dies, but its a shame the director of TND never captured her in the same way Stanley Tong does! Chan maybe getting older, and its getting harder and harder for him to surpass his best. In that respect, this is possibly the last, best action film we'll get to see. I enjoyed it, and I'm sure most chan fans will enjoy it too. My Rating: 9/10.",
         "Probably my fave Jackie flick so far, this has great story, GREAT stunts, great action, and great work from an awesome cast. The helicopter/train finale is an absolute rollercoaster. I'm fortunate enough to have scored a chinese-language DVD, and this cut is definitely better than the Americanized version, with more exposition, and probably more MICHELLE YEOH! She's the greatest, nearly upstaging Jackie every moment she's onscreen, and they work great together! And of course the terrific Yuen Wah always makes a good villain! All around a great, slick, fast paced action adventure, that anyone could enjoy! A blast all around! Oh, and let's not forget the gorgeous Maggie Cheung, pretty funny here...",
         "I've never really been a great fan of Jackie Chan, often feeling that he somewhat downgrades the true force & meaning of pure martial arts. Instead he turns it into a caricature mixed with lots of excessive special effects such as flying through plate glass windows or jumping over cars on a motorbike. I prefer the more natural, aethetic Bruce Lee when it comes to studied martial arts. He took the art far more seriously and didn't take it to extremes just for the sake of another \"gee whiz\" effect. HOWEVER..... Jackie Chan DOES take his art just as seriously, (although not in a spiritual sense), this is proved by the number of near-death accidents he has received for the sake of his art over the years. He doesn't use stunt doubles very often and spends hours & hours going over potentially lethal special effects before finally performing them for us. Police Story 3 is a superior Chan product, much better than his paper-thin stories as of late (although this could be down to the heavy Hollywood influence that perpetrates most of the latter films, and IMHO he is worse off for it). PS3 is no different from his earlier films although on this occasion he has a more equally efficient lead in Michelle Yeoh, as his Chinese army partner. Yeoh is a perfect foil for the extroverted yet dumb Chan. She screams screen presence, and her beautiful face belies her hidden deadly martial arts skills. And more significantly she, like Chan, very rarely uses stunt-doubles. (Best example is her jump onto a moving train while riding a motorcycle. Previously a stunt-double tried to do this but failed, ending up with a broken leg. But then Yeoh tried it and hey, perfect jump!) Together they bring a more spirited edge to a rather humdrum story of drug traffiking. Chan isn't allowed to wallow in his ego because Yeoh is never far behind to push him out the way. The \"buddy\" chemistry works surprisingly well, perhaps because we have a woman who is truly independent and can definitely look after herself, thank you very much. Chan does his usual stunts and his martial arts are good enough to get by with, although he is becoming just a tad predictable with more & more extravagant stunts for every new film. Which goes back to my earlier argument that he should really concentrate on the more natural side of his art and push all these boring pyrotechnics into the corner and let the character drive the story rather than the action sequences. ***/*****",
         "The storyline of this movie brings us from a prison in China to Hong Kong. With its large Manhattan-style skyscrapers and its gangsters. Jackie Chan plays an undercover detective with wonderful charisma and has the will to achieve its purposes with total disregard of his own security. He puts duty first. Thank God he is not alone. A gorgeous Chinese woman, martial-arts expert and efficient cop is doing her part all the time to protect Jackie Chan's back. Michelle Yeoh is the perfect complement. Wah Yuen is another top actor from Hong Kong and plays a successful role as the Hong Kong top gangster's little brother. He is so brilliant in his role and this give us a good impression of the excellent actors there are in Hong Kong who deserve an opportunity to go to Hollywood. When the action gets to Malaysia things even improve much more. And the city of Kuala-Lumpur with its American-style buildings is another great scenario for this good movie.",
         "This would be a pretty typical Jackie Chan movie except for two reasons 1) Production values are really high in the movie; there's some really epic action here. I tend to fastforward through the boring parts, but I still give it a 7/10 because of how amazing some of the action is 2) Michelle Yeoh, who is a superstar here - one of the best female martial arts roles of all time; don't doubt her skills, she did that motorcycle stunt for real, and it remains one of the most amazing things I have ever seen knowing how risky that was This is action, this is martial arts and even the boring parts are not too boring. I have watched countless martial arts movies, and in some ways this ranks high up in the list. I leave the artistic martial arts movies for people who love them - I just want 90 minutes of mindless action to relax to most days. Definitely has to be a top 5 Chan film",
         "Third time is the charm for this franchise. The previous two movies is good, but this one is better. Not only does it have a better storyline, it has better action as well. This time Jackie Chan as a cop is going undercover in order to infiltrate a Chinese criminal organization. And it has some good action and slapstick humor along the way. Which is expected from Jackie Chan movies. It's just done really well in this one. Maggie Cheung is back again as May(Jackie's girlfriend in the movie). And again she goes through getting put into another conflicting situation. She must really love the hero of this franchise Jackie. It just seems like she is constantly being used as a plot device to put the hero through one troublesome situation after another in this franchise. But at least she is incorporated into the plot somewhat instead of a girlfriend character that pops up once in a while for irrelevant reasons in movies. The relationship between the two reminded me of Mario and Princess Peach. To spice things up a bit, Michelle Yeoh is in this as well and plays the partner in the undercover work with Jackie Chan. And she actually adds a lot to the film and her fighting and stunt works are just fantastic. This movie alone shows how great of a stunt-woman she really is and plus she is a actress. And highly entertaining to watch, probably a bit more than Jackie in this case. Maybe it's because I enjoy the female lead kicking ass in movies. Also when it comes to the undercover work, there is actually quite a bit of creativity and good humor behind it as well. In a lot of cases the third installment just isn't as good as the previous ones. But in this case the third installment is better...Well until the 4th installment. If your one of the audiences that liked the previous Police Story films, there is a high chance you will enjoy this one. This is one of the best buddy cop movie I seen. Although it lacks in bonding development, it backs it up with the chemistry between the two and the action sequences. 7.9/10"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Golden Harvest Company",
         "Golden Way Films Ltd."
      ],
      "summaries": [
         "A Hong Kong police officer, Ka Kui is sent undercover to mainland China to break up a drug smuggling ring. After breaking the brother of the drug lord out of prison, he and another agent (a beautiful communist policewoman) are taken to Hong Kong to work for the syndicate. The wife of the crime boss has been arrested in Malaysia for drug trafficking and is soon to be executed. However, she is the only person who knows the account number of a secret Swiss bank account containing millions in drug money. While the two officers are in Malaysia preparing for the jail break, Ka Kui accidentally runs into his girlfriend May, who has traveled there from Hong Kong. Soon his cover is blown, the criminals kidnap his girlfriend and he is forced to help them pull off the jail break.",
         "A Hong Kong detective teams up with his female Red Chinese counterpart to stop a Chinese drug czar."
      ],
      "budget": 900000
   },
   "movielensId": 861,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "Bahasa melayu",
         "ภาษาไทย"
      ],
      "releaseDate": "1992-07-04",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Stanley Tong"],
      "runtime": 95,
      "movieId": 861,
      "title": "Police Story 3: Supercop",
      "mpaa": "R",
      "actors": [
         "Jackie Chan",
         "Michelle Yeoh",
         "Maggie Cheung",
         "Kenneth Tsang",
         "Yuen Wah",
         "Bill Tung",
         "Lo Lieh",
         "Mars",
         "Josephine Koo",
         "Kelvin Wong",
         "William Duen",
         "Lam Chi-Tai",
         "Kim-Maree Penn",
         "Philip Chan Yan-Kin"
      ],
      "imdbMovieId": "0104558",
      "originalTitle": "警察故事 III：超級警察",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "qt5KrRfSdzg",
         "18XukjkJ4r0"
      ],
      "plotSummary": "A Hong Kong detective teams up with his female Red Chinese counterpart to stop a Chinese drug czar.",
      "tmdbMovieId": 11134,
      "avgRating": 3.44124,
      "releaseYear": "1992",
      "numRatings": 2706,
      "posterPath": "/entsYeDr0LVMqWnnmu7CDGZA1fx.jpg"
   }
}