{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "runaway",
            "id": 708
         },
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "pregnant",
            "id": 10721
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116985",
      "video": false,
      "title": "Manny & Lo",
      "recommendations": [
         324213,
         207941,
         70264,
         196967,
         91122,
         334204,
         84314,
         14634,
         46989,
         1115,
         78307,
         47841,
         33135,
         43088,
         46147,
         31048
      ],
      "backdrop_path": "/c0sRfgE8ZtC4RCuGLdS840wzH6r.jpg",
      "revenue": 431326,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Elaine",
               "gender": 1,
               "credit_id": "52fe49ed9251416c910bd5d5",
               "name": "Mary Kay Place",
               "profile_path": "/iFZTr6qpFSzJURPOg0YN89pg0RP.jpg",
               "id": 5960,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Amanda",
               "gender": 1,
               "credit_id": "52fe49ed9251416c910bd5cd",
               "name": "Scarlett Johansson",
               "profile_path": "/8EueDe6rPF0jQU4LSpsH2Rmrqac.jpg",
               "id": 1245,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Laurel",
               "gender": 0,
               "credit_id": "52fe49ed9251416c910bd5d1",
               "name": "Aleska Palladino",
               "profile_path": null,
               "id": 935917,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Suburban Family",
               "gender": 0,
               "credit_id": "5454b24ac3a3681480003db4",
               "name": "Dean Silvers",
               "profile_path": null,
               "id": 21275,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Suburban Family",
               "gender": 0,
               "credit_id": "5454b2580e0a2648cb003d0a",
               "name": "Marlen Hecht",
               "profile_path": null,
               "id": 1018643,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Suburban Family",
               "gender": 0,
               "credit_id": "5454b26c0e0a2635de0017a5",
               "name": "Forrest Silvers",
               "profile_path": null,
               "id": 1380393,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Golf Course Family",
               "gender": 1,
               "credit_id": "5911647b9251414edb03f800",
               "name": "Vanessa Johansson",
               "profile_path": "/5kiI5us44QGoOAxPDVkBO4tjSla.jpg",
               "id": 1015616,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe49ed9251416c910bd5c9",
               "name": "Lisa Krueger",
               "profile_path": null,
               "id": 124092,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5454b280c3a3681473003b3b",
               "name": "Lisa Krueger",
               "profile_path": null,
               "id": 124092,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.000377,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 88224,
      "vote_count": 11,
      "budget": 500000,
      "overview": "A pregnant teen and her younger sister run away from foster homes and kidnap a woman whom they believe can help with the pregnancy.",
      "similar": [
         4771,
         281,
         193893,
         9282,
         17130,
         8363,
         275,
         979,
         395990,
         507,
         19053,
         8067,
         226,
         133805,
         26579,
         25376,
         429733,
         167,
         9769,
         638
      ],
      "original_title": "Manny & Lo",
      "runtime": 88,
      "poster_path": "/rd5k8iDiuNAZTPTfJZn0rQ3PtYl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Pope Productions",
         "id": 2974,
         "origin_country": ""
      }],
      "release_date": "1996-01-22",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Lisa Krueger"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Lisa Krueger"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116985/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxODk1NjM4M15BMl5BanBnXkFtZTcwOTI0NzQyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Scarlett Johansson, Aleksa Palladino, Mary Kay Place | See full cast and crew »"],
      "reviews": [
         "\"Manny & Lo\" tells of two runaway girls and the how they deal with the challenges which arise when one gets pregnant. What this film lacks in big budget blockbuster appurtenances it more than makes up for with it's creative and unpredictable story, depth of character, raw charm, tongue-in-cheek humor, and insightful sensitivity. A wonderful little \"sleeper\" which necessarily starts slow and builds delivering pound-for-pound much more than films with many times the hype and box office. Most likely to be appreciated by females and more mature males.",
         "This movie was wonderful. The characters were developed so well I felt as if I knew them. Mary Kay Place was in top form. This movie was unpredictable yet allowed you to come up with your own view as to the future of the characters in the end. This is one of those movies that are a diamond in the rough; a movie that once given a chance, and viewed will be watched by many because of word of mouth. I loved this movie!",
         "How 2 youngsters dealt with a traumatic situation, alone, 'till they thought it was beyond their control. To resort to kidnapping! (Kidnapee or kidnapper ?)I identify with Manny because she thinks for herself with subtle conclusions, knowing what's right disspite. I identify with Elaine because when I grew up I ended up alone. And Lo 'is' my brother (For how he took care of me at that age) I've been a movie buff for 29 years (since I was 10), and \"Manny & Lo\" is on the top of my list!!!!! Thank you Scarlett, Aleksa, & Marry Kay....Thank you.",
         "I think it could use some editing to speed the pace a bit. A pregnant teen and her younger sister run away from foster homes and kidnap a woman whom they believe can help with the pregnancy. This is the kind of low-budget film that truly proves that a small story can be much more meaningful than a larger one. This film is worthy of all the hopes you have as all of the characters struggle against a system that has perpetuated falsehoods. Are there annoying things in this movie? Yes, like the overdone acting. But the movie has enough to keep you entertained. For these reasons, I give this movie a rating of 7 out of 10.",
         "I saw this film for the first time on TV Ontario last night and it was a beautiful film both visually and emotionally. Lo (Aleska Palladino) and her younger sister, Manny (Scarlett Johansson) run away using a family car. When the film opens, we find them on the fresh, green turf of a new sub-division being chased away by the property owners. Lo is sixteen and pregnant and Manny is an 11-year-old with smarts. They make the rounds of the countryside and small towns and kidnap Elaine (Mary Kay Place), a retail clerk working in a baby boutique. Elaine is made to sign a note that she is on vacation, leaving her owner and co-workers to fend for themselves. This is totally out of character for Elaine, who is a pillar of her community with a heart of gold. As the movie moves along, we see a bond develop between the three female characters with Elaine becoming the mother figure to the free-spirited sisters, who come from a troubled family. The girls learn from Elaine as she fills a void in her own life. Director Lisa Krueger has put together a fine story that moves along slowly but draws the viewer into the characters.",
         "Mary Kay Place, Scarlett Johansson and Aleksa Palladino star in this breakthrough drama entitled,Manny & Lo.This is debut feature from writer/director Lisa Krueger that tells the story of orphaned teen-aged sisters that are living on the run, stealing food, and sleeping in random model homes. Two sisters, 11-year-old Amanda,also known as Manny; and 16-year-old Laurel,nicknamed Lo, run away from several foster homes, sleeping wherever they can, including in model homes.Lo is the rude, bossy, incompetent leader, and younger sister Manny is her thoughtful, realistic, logical underling. It quickly becomes apparent that Lo is pregnant and they won't be able to continue their wandering lifestyle of \"keep moving and you won't get nailed.\" After a significant stage of denial, Lo goes to a hospital for an abortion and is denied. Quickly running out of options, Lo comes up with plan that seems ridiculous to the observant narrator Manny. Since they don't know anything about birthing babies, they kidnap Elaine, a middle-aged woman dressed as a nurse who works in a maternity store. Together, the three women squat in an abandoned house in the woods so the disgruntled Lo can have her baby. Eventually, the owner of the house comes home and the captive Elaine resorts to a strange solution to the problem. This is an unapologetically small but wholly original movie, warm- hearted but not precious, and possessed of a gently wacky sensibility.Though employing no surreal devices and remaining within a realistic convention, Krueger takes the story of two young sisters on their own and somehow makes it seem unreal, strange, outside time.Also,it is a sweet little fable only a bit shy on substance but quite charming in the telling.Overall,it is a movie that will leave viewers with a warm glow.",
         "I can hardly write something more about this gem considering the comments below. Without any spoiler given I only reveal to you that this movie is wonderfully well acted, plot is very appealing, kind, humorous and highly enjoyable. Really. Really really. Go and see it. Now. 9/10",
         "This is the sweetest film. It's definitely a 'chick thing' with Manny and Lo and Elaine bonding around an infant to be (Lo's). No men are allowed in this paradise. One appears and he gets bopped over the head, gagged and hog-tied. This is a fem-family made on the run. Lo (Aleska Palladino) in her high teens runs away from a foster home with her younger sister, Manny (Scarlett Johansson). It's a Thelma and Louise crime spree made as a movie for children. Well, not quite. Turns out Lo's pregnant. She has been hiding this from 11-year-old Manny, who has the eye of Sherlock Holmes and is the brains of this team. They find a rather nice, used only during the ski season cabin in the woods and hole up to await the stork. They spot Elaine (Mary Kay Place), a lonely spinster working in a baby clothes shop and kidnap her to help deliver the baby. Everybody, despite gruff exteriors, has a heart of gold, and togetherness and loving concern prevail. And what's wrong with that? Nothing really. But I was thinking: this is the obverse of male war movies where none or few women appear, men doing their manly thing killing one another, women irrelevant. I think that's the key word here for director Lisa Kruege: in the reproductive game that is war by other means, men are irrelevant. Or almost so. In war it doesn't matter how many men are killed. As long as there are some left the population will quickly spring back. Kill the women, though, and you have a serious population problem. Manny and Lo and Elaine prove that you really don't need the male: his sperm will do, and that way you don't have to put up with his loutish behavior. I think I got this right. Anyway, it's a cute movie. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "very agressive. very endearing. the story of two girls and a whole lot of trouble. these chicks rock. i find myself watching this film over and over again. fresh and unhiply hip. lock combinations and bathroom equations. fun. overall, this is extremely fun.",
         "MANNY & LO (2 outta 5 stars) Not a bad movie... just kind of pointless after all is said and done. Two orphaned sisters (one of them pregnant) take the family car and go on the road, trying to keep from getting separated and put into foster homes. Not knowing what to do about the baby on the way, the two young girls kidnap a woman who works in a maternity goods store and hide out in a secluded cabin in the woods. Eventually the three begin to bond emotionally. This would have been a perfect example of a \"nice, family movie\" except for all the profanity spewed by the older sister. The younger sister is played by a young Scarlett Johansson... who I think was a better actress at 12 years old than she is right now. (Oh, I'm just being mean... she's not bad now either.) Mary Kay Place plays the kidnapped baby expert. Aleska Palladino (who?) plays the older sister. Pretty entertaining story... it just tends to get a bit implausible at times."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Pope Productions"],
      "summaries": [
         "Two sisters, Amanda, 11, and Laurel, 16, run away from their different adopted parents, sleeping in model homes, or wherever they can. But when Laurel becomes pregnant, they find they can't make it through this crisis on their own. With nowhere else to turn, they decide to kidnap Elaine, a clerk in a baby supply store. But Elaine seems to need Manny and Lo just as much as they need her.",
         "A pregnant teen and her younger sister run away from foster homes and kidnap a woman whom they believe can help with the pregnancy."
      ],
      "budget": 500000
   },
   "movielensId": 862,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-22",
      "dvdReleaseDate": "2004-01-20",
      "directors": ["Lisa Krueger"],
      "runtime": 88,
      "movieId": 862,
      "title": "Manny & Lo",
      "mpaa": "",
      "actors": [
         "Mary Kay Place",
         "Scarlett Johansson",
         "Aleska Palladino",
         "Dean Silvers",
         "Marlen Hecht",
         "Forrest Silvers",
         "Vanessa Johansson"
      ],
      "imdbMovieId": "0116985",
      "originalTitle": "Manny & Lo",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["-lucc4SIhaY"],
      "plotSummary": "A pregnant teen and her younger sister run away from foster homes and kidnap a woman whom they believe can help with the pregnancy.",
      "tmdbMovieId": 88224,
      "avgRating": 3.59893,
      "releaseYear": "1996",
      "numRatings": 374,
      "posterPath": "/rd5k8iDiuNAZTPTfJZn0rQ3PtYl.jpg"
   }
}