{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "wife",
            "id": 4183
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "unhappiness",
            "id": 156455
         }
      ],
      "imdb_id": "tt0046468",
      "video": false,
      "title": "Wife",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mihoko Nakagawa",
               "gender": 1,
               "credit_id": "5561e321c3a3681f960021ed",
               "name": "Mieko Takamine",
               "profile_path": "/cSkoUpW8YGwoBdovpHtQpwzZUE5.jpg",
               "id": 134373,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Toichi, Mihoko's husband",
               "gender": 0,
               "credit_id": "5561e330c3a3681f960021f2",
               "name": "Ken Uehara",
               "profile_path": "/heFpSXtx3mdrC7APFKBatoaKzJR.jpg",
               "id": 134629,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Tadashi Tanimura",
               "gender": 0,
               "credit_id": "5561e33e92514171ab001f76",
               "name": "Rentarô Mikuni",
               "profile_path": "/lIpjNIVxvm0Tu8CdXiXdpZGpgS1.jpg",
               "id": 76975,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Yoshimi Niemura",
               "gender": 1,
               "credit_id": "5561e34c92514171ab001f79",
               "name": "Michiyo Aratama",
               "profile_path": "/penV4mYKxLtmChZkAoFZss5HuEF.jpg",
               "id": 85307,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Setsuko Sakurai",
               "gender": 1,
               "credit_id": "5561e35bc3a36868e5009389",
               "name": "Sanae Takasugi",
               "profile_path": "/eDzgr9zXnzC88CBnB5Q5vW4KpKs.jpg",
               "id": 213507,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Eiko Matsuyama",
               "gender": 1,
               "credit_id": "56365f42c3a3681b5c01cc85",
               "name": "Chieko Nakakita",
               "profile_path": "/AdvI4nAmDPzrwqvjhQpBNl4jaaR.jpg",
               "id": 125723,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Fusako Sagara",
               "gender": 1,
               "credit_id": "56365f4b9251414ab7018ffe",
               "name": "Yatsuko Tan'ami",
               "profile_path": "/n7X1uuDN1XvOA4K7ndTI07oN5qv.jpg",
               "id": 136382,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Hirohisa Matsuyama",
               "gender": 0,
               "credit_id": "56365f54925141284c01b09e",
               "name": "Hajime Izu",
               "profile_path": null,
               "id": 1481068,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Taeko Niemura",
               "gender": 0,
               "credit_id": "56365f5d925141616700cd43",
               "name": "Yoshiko Tsubouchi",
               "profile_path": null,
               "id": 131017,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "56365f62c3a3681b5901a77f",
               "name": "Tatsuya Ishiguro",
               "profile_path": null,
               "id": 125009,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "56365f67c3a3681b6101bbe5",
               "name": "Akira Tani",
               "profile_path": null,
               "id": 552167,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 0,
               "credit_id": "56365f6c9251416d5200cd85",
               "name": "Noriko Honma",
               "profile_path": "/fewS99hj0xT2l4TgYvBfKOvhXZ5.jpg",
               "id": 7456,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "56365f71c3a3681b5201aa92",
               "name": "Masao Shimizu",
               "profile_path": null,
               "id": 131194,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 0,
               "credit_id": "56365f7692514129fe00d346",
               "name": "Sadako Kimura",
               "profile_path": null,
               "id": 1530336,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "",
               "gender": 0,
               "credit_id": "56365f7b9251416d5200cd88",
               "name": "Eiji Koyama",
               "profile_path": null,
               "id": 1530337,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 0,
               "credit_id": "56365f80c3a3681b4b019461",
               "name": "Masakichi Mitsui",
               "profile_path": null,
               "id": 1530338,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "",
               "gender": 0,
               "credit_id": "56365f85c3a3681b5401c22b",
               "name": "Hideko Ebata",
               "profile_path": null,
               "id": 1529720,
               "order": 17
            },
            {
               "cast_id": 30,
               "character": "",
               "gender": 0,
               "credit_id": "56365f8b92514129fe00d34a",
               "name": "Tsuruko Mano",
               "profile_path": null,
               "id": 136386,
               "order": 18
            },
            {
               "cast_id": 31,
               "character": "",
               "gender": 0,
               "credit_id": "56365f90c3a3681b4d01d531",
               "name": "Toyomi Shiozawa",
               "profile_path": null,
               "id": 1530339,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b9ac3a368484e190d25",
               "name": "Mikio Naruse",
               "profile_path": "/2fePemn6eI8Wfu1p8GbEPjuSuZa.jpg",
               "id": 125690,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5561e30592514171ab001f6f",
               "name": "Fumiko Hayashi",
               "profile_path": null,
               "id": 1081232,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5561e312925141130e0004cc",
               "name": "Toshirô Ide",
               "profile_path": null,
               "id": 33126,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56365ed9925141285701b06e",
               "name": "Sanezumi Fujimoto",
               "profile_path": null,
               "id": 15216,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56365ee99251414ab7018ff1",
               "name": "Masao Tamai",
               "profile_path": null,
               "id": 18599,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56365ef19251414ab7018ff3",
               "name": "Eiji Ooi",
               "profile_path": null,
               "id": 1437785,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56365efa9251414ab7018ff5",
               "name": "Satoru Chûko",
               "profile_path": null,
               "id": 1125521,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "56365f0392514129fe00d33a",
               "name": "Teruo Maki",
               "profile_path": null,
               "id": 1268044,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56365f1dc3a3681b5401c21d",
               "name": "Masayoshi Kawanishi",
               "profile_path": null,
               "id": 1268046,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56365f26c3a3681b5201aa87",
               "name": "Chôshichirô Mikami",
               "profile_path": null,
               "id": 1268048,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "56365f2dc3a3681b6101bbde",
               "name": "Shigeru Mori",
               "profile_path": null,
               "id": 1530334,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "5717bf0f9251413d3000320c",
               "name": "Ichirô Saitô",
               "profile_path": null,
               "id": 125001,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.450703,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 132641,
      "vote_count": 0,
      "budget": 0,
      "overview": "Ten years into a marriage, the wife is disappointed by the husband's lack of financial success, meaning she has to work and can't treat herself and the husband finds the wife slovenly and mean-spirited: she neither cooks not cleans particularly well and is generally disagreeable. In turn, he alternately ignores her and treats her as a servant. Neither is particularly happy, not helped by their unsatisfactory lodgers. The husband is easily seduced by an ex-colleague, a widow with a small child who needs some security, and considers leaving his wife.",
      "similar": [
         521,
         51828,
         11121,
         12102,
         1628,
         696,
         24420,
         44564,
         87567,
         339397,
         688,
         1586,
         49524,
         34601,
         4771,
         769,
         69,
         116,
         13,
         46705
      ],
      "original_title": "Tsuma",
      "runtime": 89,
      "poster_path": "/z9WiHt5uQjs8L8tyBpRBKzlheF2.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": "/lYCOp17DBEjFD1UygdRor98PVWR.png",
         "name": "Toho Company",
         "id": 882,
         "origin_country": "JP"
      }],
      "release_date": "1953-04-29",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tom Noonan"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Tom Noonan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114936/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5MDc1MzI2MF5BMl5BanBnXkFtZTcwNzI2MTUxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Julie Hagerty, Tom Noonan, Wallace Shawn | See full cast and crew »"],
      "reviews": [
         "This is the type of movie that is not for everyone. In fact, most people would not like it at all. It is over an hour and a half of talking heads. Yes, the dreaded \"stage play on film\" which critics seems to hate. For me, it was one of the best movies I have seen in a long time and makes mytop ten list. It has been compared to \"Who's Afraid of Virginia Woolf\" but I think that does not do it justice. Yes, the movie is about two couples and there is a lot of angst however in Woolf the maliciousness is obvious, loud and in your face. In Wife, the angst is subtle, quiet and cerebral. Tom Noonan is so brilliant and it is a crying shame that he does not have more work out there for us to enjoy. Does he need money or what? Every week another heist movie or mafia movie hits the big screen but jewels like this are on the verge of extinction. If you like Wife, be sure and check out Noonan's \"What Happened Was...\".",
         "A rare play that deserves to be a movie, Tom Noonan plays a New Age healer with marital troubles when one of he and his wife's (Julie Hagerty) patients, played by Wallace Shawn, decides to stop by their house in the woods with his wife, played by Karen Young. The cast is brilliantly effective, and we're never sure exactly who is controlling the evening. Noonan is creepily menacing, and the way he uses the camera for close-ups on actors' faces -- sometimes shown by reflections on winne bottles -- is excellent. There are some cliched parts in the movie -- reflections and mirrors, cheating spouses, drug use, and a night of drinking at a \"dinner party\" -- but nothing in the film is conventional. This is one of the best movies of 1995. 9/10",
         "This is one of those movies that takes on a difficult subject and looks at it a thousand different ways. In any other hands than Tom Noonan's it would have been as hypocritical and as shallow as its subjects (Woody Allen would have filled it with celebrities & predictable one-liners).",
         "Over a decade after his dinner with Andre\" Wallace Shawn finds himself at his psychiatrists snow covered house in the wilderness, where his wife is desperate to meet the psycho-therapist team that's been stealing away so much of her hubby and his time. Julie Hagerty and Tom Noonan (who also directs) are said therapists who were just preparing for bed, when in comes the troubled couple. Shawn wants to leave immediately, embarrassed by the imposition, while his wife stalks room to room like a caged tiger, veering between offensive and polite with every blurted out or carefully chosen word. Hagerty too wants to go to sleep, but is too passive aggressive to kick the visitors to the curb. Noonan on the other hand thinks they should stay long enough to resolve whatever issues need addressing. Shawn: I don't like where this is going. Noonan: It's going where it's going He also enjoys his domination over Shawn and his wife (who he can silence with a whisper or slight gesture) and is titillated in more ways than one by Young's edgy barbs, which she has mostly for psychiatrists and the dopes who go in for such psycho-babble. \"What the f*&k are you people talking about\" is her echo throughout the film. Shawn is a mild mannered and pint up neo-liberal who married a dancer in a bar, one who dominates him just as much as the other characters in the film do, but who comes to represent his anxieties (which are many and varied) If you can imagine Anti-Christ without the gore, sex, and supernatural elements you can peer into the power plays present between the two couples in \"The Wife\". The evening never veers into \"Who's Afraid Of Virginia Wolf?\" levels of chaos, as the characters rarely reveal any deeper motivations about themselves for than more a moment. With the exception of Shawn who babbles about himself throughout the entire film, much to the other characters devious pleasure or annoyance. Noonan's direction is sparse and reserved minimalism. There is repeated image of the house with the front door open letting light pour onto the snow, of the characters faces distorted in the reflections of their wine glasses like funhouse mirrors, and an upside down reflection of the characters in a frozen lake at night lit only be torch(the place Noonan goes to \"be himself\"). Light comes and goes as a central theme with the characters submerging into shadows often as their emotions rise up in outbursts. Noonan doesn't stick to this visual pattern enough to become predictable, but uses it as one in a range of subtle tricks to highlight mood and emotion and keep the film from being a play. Noonan is wise enough to let his fellow actors command the screen which is a good choice because between Shawn's groveling, Young's populist emoting, and Hagerty's Quaalude induced bouts of laughter and nervousness, there isn't much room left to do anything but sit at the end of the table smiling like Lucifer and delivering a single sentence of \"tell me what your feeling\" or \"this is really happening isn't it?\" Fortunately Noonan can deliver these lines and any others he has with a truly creepy finesse that really does say more with less. Outside of the house as he walks in the snow in his bathrobe, torch blazing in the dark he resembles a saint on a pilgrimage or a serial killer going to bury a body. You never can tell with Noonan. Like a John Cassavettes movie \"The Wife\" is an actor's showcase and it also ends a bit unresolved, piling up question onto question up into the very last scene. In the final moments Noonan does give himself the spotlight, though he cleverly leaves his face largely in the dark. Another actor or director might complain about the way he is lit in this scene and the lose of potential emotional connection, but its because of this very distance created by the shadows covering his face which make it hard to tell if he's crying, and make the scene so absorbing. It is scenes like this which make \"The Wife\" attractive; the hazy dance of images between shadows and low lighting and the emotional undercurrents of resentment, love, fear, and loneliness that gush up into view only to disappear again a moment later.",
         "Loved it! A 10 as far as I'm concerned. I'm critical by nature and I think this movie was perfect. I hope to find it in a video store so my wife can see it too. Complex, real dialogue. Shows real insight. A lot of talk and never a dull or false moment. Nothing mundane about it. I'm sorry he hasn't received the praise he deserves for the incredible stuff he is writing and directing.",
         "I'm a therapist and, while this was attention-getting, it just doesn't wash. Predictability (the drug-user, the most disturbed-seeming character ending up the most poignant, too much to drink) and lots of gratuitous histrionics; characterizations are not built slowly, they are alternately slapped together and then dismantled. Noonan is unfair to his other characters; he's obviously written \"Jack\" as the only seriously charismatic (although seriously flawed) personage in the screenplay. Why dare to update \"Who's Afraid of Virginia Woolf?\" and only do it halfway?"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [],
      "summaries": ["Tom Noonan's dark comedy features a husband-and-wife team of psychotherapists who run a New-Age therapy group out in the wilderness. Late one night, Jack and Rita are visited by one of their patients, Cosmo, and his wife, Arlie. Cosmo's wife has felt \"left out,\" since her husband spends so much time with the therapists and confides all of their secrets to them. Arlie has insisted on meeting them--the evening begins awkwardly, then painfully grinds on, as various tensions and power struggles emerge between and among the two couples."],
      "budget": 0
   },
   "movielensId": 864,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-16",
      "dvdReleaseDate": "1998-01-27",
      "directors": ["Tom Noonan"],
      "runtime": 101,
      "movieId": 864,
      "title": "The Wife",
      "mpaa": "",
      "actors": [
         "Tom Noonan",
         "Wallace Shawn",
         "Karen Young",
         "Julie Hagerty",
         "Danny Darrow"
      ],
      "imdbMovieId": "0114936",
      "originalTitle": "The Wife",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["vs5F7bYgglQ"],
      "plotSummary": "A sudden visit from a patient and his unstable, outrageously candid wife leads to a delirious night of shattering revelations for a husband and wife team of therapists.",
      "tmdbMovieId": 132641,
      "avgRating": 3.2663,
      "releaseYear": "1996",
      "numRatings": 92,
      "posterPath": "/l1k18GVC49LsfwSN1qmKL83otr3.jpg"
   }
}