{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "illiteracy",
            "id": 2073
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "extreme violence",
            "id": 14687
         }
      ],
      "imdb_id": "tt0114474",
      "video": false,
      "title": "Small Faces",
      "recommendations": [
         202236,
         14778,
         22727,
         167065,
         22913,
         50070
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lex Maclean",
               "gender": 2,
               "credit_id": "52fe4617c3a36847f80ec46b",
               "name": "Iain Robertson",
               "profile_path": "/yRpfwDD2RNJhFjS7RXKXYlJIPDb.jpg",
               "id": 30437,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alan Maclean",
               "gender": 2,
               "credit_id": "52fe4617c3a36847f80ec46f",
               "name": "Joseph McFadden",
               "profile_path": "/ucaOnudy26s8C2Gevn3qcNYWzhQ.jpg",
               "id": 128648,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bobby Maclean",
               "gender": 0,
               "credit_id": "52fe4617c3a36847f80ec473",
               "name": "Steven Duffy",
               "profile_path": null,
               "id": 128649,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joanne Macgowan",
               "gender": 1,
               "credit_id": "52fe4617c3a36847f80ec477",
               "name": "Laura Fraser",
               "profile_path": "/umgqZQNAqE78jFfg1H1nPtaO41Y.jpg",
               "id": 42279,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Charlie Sloan",
               "gender": 0,
               "credit_id": "52fe4617c3a36847f80ec47b",
               "name": "Garry Sweeney",
               "profile_path": "/hVSZ2p5ktpspBdXGjky0kfKLOUL.jpg",
               "id": 71771,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lorna Maclean",
               "gender": 1,
               "credit_id": "52fe4617c3a36847f80ec47f",
               "name": "Clare Higgins",
               "profile_path": "/jfSzbpiCArUJ0lFrwqB7PSyus7k.jpg",
               "id": 45588,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Malky Johnson",
               "gender": 2,
               "credit_id": "52fe4617c3a36847f80ec483",
               "name": "Kevin McKidd",
               "profile_path": "/5MahWq6XoSuThdSLvVXUDa2LlkP.jpg",
               "id": 9013,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Gorbals",
               "gender": 0,
               "credit_id": "52fe4617c3a36847f80ec487",
               "name": "Mark McConnochie",
               "profile_path": null,
               "id": 128650,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "5696e201c3a3683af90003d5",
               "name": "Colin McCredie",
               "profile_path": "/jZuL5VZb6NKOPpOxSJisSrpSv63.jpg",
               "id": 149359,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 1,
               "credit_id": "5696e20b92514154c6000372",
               "name": "Kirsty Mitchell",
               "profile_path": "/7ZpHVxS8Z8a0CqK8koIvuXNad43.jpg",
               "id": 49812,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "5696e225c3a3683aea0003b7",
               "name": "Ian McElhinney",
               "profile_path": "/33RGircMDTbdvD6LUp8sLmQKWvA.jpg",
               "id": 43138,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4617c3a36847f80ec48d",
               "name": "Andrea Calderwood",
               "profile_path": null,
               "id": 6374,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4617c3a36847f80ec493",
               "name": "Steve Clark-Hall",
               "profile_path": null,
               "id": 63127,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4617c3a36847f80ec499",
               "name": "Eddie Dick",
               "profile_path": null,
               "id": 55363,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4617c3a36847f80ec49f",
               "name": "Billy MacKinnon",
               "profile_path": null,
               "id": 64177,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4617c3a36847f80ec4a5",
               "name": "Mark Shivas",
               "profile_path": null,
               "id": 55982,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4617c3a36847f80ec4ab",
               "name": "Gillies MacKinnon",
               "profile_path": null,
               "id": 33405,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [],
      "popularity": 0.841918,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 42758,
      "vote_count": 14,
      "budget": 1850000,
      "overview": "Three teenage brothers, gang-member Bobby, troubled mama's boy Alan and self-assured prankster Lex, reside in a downtrodden section of Glasgow, Scotland, circa 1968. But while Bobby and Alan are beginning to experience the power of raging hormones, the story focuses on Lex, who begins a downward spiral after he accidentally shoots the leader of Bobby's gang. Lex's cockiness and immaturity unfortunately prevent him from understanding the effect his subsequent crimes will have on both himself, and on those around him.",
      "similar": [
         4771,
         3131,
         36647,
         37094,
         64690,
         60304,
         339692,
         769,
         23629,
         26389,
         11253,
         16869,
         1578,
         2253,
         12162,
         1571,
         1894,
         4141,
         1991,
         2034
      ],
      "original_title": "Small Faces",
      "runtime": 108,
      "poster_path": "/s9I3gLu9ySsfyM3JvlpSW9KrszF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-04-05",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "You are now entering Tongland",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gillies MacKinnon"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Billy MacKinnon",
         "Gillies MacKinnon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114474/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4NTMzODI3MV5BMl5BanBnXkFtZTcwMjIxNjIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Iain Robertson, Joe McFadden, Steven Duffy | See full cast and crew »"],
      "reviews": [
         "The gifted Scottish director Gillies MacKinnon made this wonderfully fresh film about growing up in Glasgow in the late sixties and which he co-wrote with his brother Billy. It has the same feel for time and place and what it's like to be a teenager in a slightly idealized, hyper-realist past but it's an altogether more kinetic work full of great visual flourishes. It centres on the three Maclean brothers, the deeply troubled, almost psychopathic Bobby who is a member of one of two rival gangs, (J S Duffy), Adam who is a talented artist hoping to go to Art School, (Joe McFadden) and the youngest Lex, who like Adam also has a talent for art but who also fosters some of Bobby's rebellious spirit (Iain Robertson). When Lex accidentally shoots a member of the rival gang in the eye, the boys find themselves caught up, in an almost surrealist fashion, in the conflict which turns very nasty indeed. MacKinnon may be dealing with such conventional issues as gang warfare but he treats the material in ways movies haven't done before. Adults, such as the boy's mother, (beautifully played by Clare Higgins), remain very much on the fringe. This is a violent, darkly funny but mostly tragic film and the performances from the mostly young cast are extraordinary, in particular from J S Duffy and Iain Robertson and from Garry Sweeney as the vicious leader of Bobby's gang. The film wasn't widely circulated or seen and consequently was not a commercial success yet it remains one of the key British films of the past 10 years.",
         "Small Faces is a small cinematic gem;a rites of passage story set in the ganglands of 60's Glasgow told in a gritty, realistic style, yet infused with humour and sympathy for its characters, this film is too good to miss. Do yourself a favour and watch it now!",
         "In late-1960s Glasgow, three teenage brothers from a fatherless home in a lower working class neighborhood struggle to survive among the chaos and violence that is part of their subculture. The oldest has serious mental problems and a learning disability associated with his acting out. The middle brother tries to steer clear of it all as he struggles to pursue his artistic talent. And the story is told from the viewpoint of Lex, the 13-year-old, whose childish delinquency becomes serious business when he is forced into adult situations. At the beginning I had difficulty with the heavy Scottish dialect and had some confusion of characters and events, but I was drawn in by the progression of events and the development of the characters. This is a poignant coming-of-age story that rewards us if we stay with it.",
         "Without a doubt one of the finest gang/youth films ever! I know several guys who grew up in Glasgow in the 1960's and I'll never look at them the same way again, (And, I thought that the gang members in Boyz N' the Hood were tough... They have nothing on Charlie Sloan and the boys: \"Glen ya' Bass!\"). The only down side to the film is that I had to watch it with the close captioning on, because I their accents were too strong for me to follow. Anyway, a fantastic effort + a must see! Some other IMDb patron said: \"I wish I could make the whole world see this movie\" - I myself can't put it better than that.",
         "Small Faces stands out as an unsentimental and unpatronising glimpse of the life of 1960s working class youth in Glasgow. The film is directed with a light touch and brilliantly conveys the experience of growing up in the slums with the stereotypical escape-routes of gangs, drink and education. In refusing to romanticise its subject matter the film is bleak, funny, brutal and life-affirming all at the same time.",
         "I caught this film late night on the Sundance channel. It is extraordinarily well done. It's good to see more and more cinema from the UK showing on cable here in the US. Small Faces doesn't insult your intelligence, and it doesn't have any affectations. Its setting in the 60s is almost incidental; as someone else mentioned, there's no attempt here to glorify or overstate the setting for stylistic reasons. And I must say, some of the camera-work is beautiful. One shot in particular stands out; Lex stands in a large vacant lot, puddles reflecting the sky, near the Tongs' apartment building. Something in this shot is alternately so deliberately composed for its \"ugly beauty\" and at the same time completely unpretentious and real and necessary. The kid who plays the lead, Iain Robertson, does an incredible job and seems almost an inorganic part of the urban wreckage around him. No clichés. No insult to your intelligence. Just a story, well told, superbly acted, and superbly shot. This film is a textbook on how to make a good drama. Just one of many superb films from the UK (another recent good one was The Loneliness of the Long Distance Runner) that we've been deprived of over here until now. First rate.",
         "A gritty, realistically drawn out rights of passage film, this was an impressive return to form for writer/director MacKinnon after his brief Hollywood fling. Overall the film, although essentially a nostalgic look at a young Glasgow boy coming of age in 1968, manages to steer clear from over romanticising the past as so often happens with such an exercise. This is largely due to an impressive cast, realistic location filming, and a refreshingly simple (especially in light of recent Brit flicks) down to earth pop soundtrack. Its not too preoccupied with presenting a hip representation of 1960s culture which may have prevailed its realism. Lex is the youngest of three brothers MacLean being brought up by a single mother in a grubby tenement flat. His brothers are greatly contrasting in character; Alan a sensitive, aspiring artist, and Bobby an illiterate and unpredictable gang member. It is the former that Lex looks up to rather than Bobby who he sees as a \"moron\". Much of the film's central concerns seem to lie in these two contrasting sides of Lex's up-bringing. He lives in a world where artistic expression, or any such kind of creativity, is stifled. This being graphically represented by the beating of a young artist at the hands of a local gang. We also learn of this character's father's fruitless attempts to produce grapes in the middle of Glasgow. The only escapism and means of capturing anything remotely extrisnic for the likes of Lex and Alan is through their art. Ultimately though it is intelligence which prevails when Malky's ignorant act leads directly to his destruction. Early scenes serve to establish the family life of the MacLean's. Sometimes these seem rather idealistic, such as family gatherings and sing-songs. The singing seems to be a motif for happier times; it doesn't return until directly after Malky's death in a comical children's sing-a-long at a Saturday matinee. Although family life is not disregarded, never can adults successfully communicate with the youngsters. The attempts by an American uncle to have some influence over the boys is ineffectual, and the mother seems to have little control over them. Also there curiously seems to be no intervention by the police into the gang violence. As Lex is the central protagonist we are often given his perspective of events. An earlier gang encounter at a fairground is received from his point of view, which is then followed by a man leading an elephant across a field. Such surreal imagery is almost a childlike representation of events. Shaky camera movements during his drunken stupor are further indication of the camera allowing us to identify ourselves with him. On the whole the film is well-crafted. Some striking images such as the track of red blood across the ice rink after Bobby's is stabbed and great attention to detail are a credit to the director. As well as some clever aesthetic touches the film boasts to its credit some endearing performances by what is mainly a young cast, especially young Ian Robertson as Lex whom our affection for is essential to our enjoyment of the film. Despite the film's violent content we rarely lose sight of humour or hope.",
         "Thank you Sundance for bringing this outstanding film to my attention. What a pity it did not have wider attention and distribution. I was completely drawn into the horror of Glasgow gang life and found myself totally absorbed by the direction, acting and story line of this amazing movie. I cannot recommend it highly enough. The realism of the sets and acting was incredible. One of the most horrifying parts of the film for me was the indifference of some girls who instigated a brutal beating of one of the characters, and then watched without evident remorse. Even the final credits had a special touch with the soundtrack of \"In the Year 2525\", which somehow I had never heard before, but could not have been more appropriate. Wonderful film from beginning to end. A MUST SEE!",
         "I nearly passed this movie up as the film guide had written a poor review (do they even watch the films?). In the end I watched the start intending to go to bed and ended up watching the whole film. What interested me most was the picture the film gave of life in Glasgow during the 60's. The landscape of the film is one of endless factory's, warehouses and derelict buildings. All of which seem to look back to the past. The streets of Govanhill where the Glyn live are cobbled and winding narrow passages. Later in the film we are shown 'tong land'. Three massive tower blocks seemingly standing in the middle of a waste land. At the road leading in some graffiti reads 'you are now entering tong land'. The bleak concrete land in which they live is very striking and seems to belong more to the 70's than Govanhill which seems to belong back in the 1800's. The film itself is good and I doubt anyone would be disappointed were they to watch it.",
         "Life in the tough end of Glasgow in the late 1960s is delightfully and sometimes painfully presented here. This is clearly a work of well-observed autobiography by the Mackinnon family - Billy the writer/producer and Gillies the director. At the centre of the film is the Maclean family - widowed mother with sons Bobby (none too bright), Alan (budding artist in spite of being brought up in the tough end of Govan) and narrator Lex, only 13 and still not sure what life is all about. Iain Robertson's performance as Lex is so good that it is barely credible that he has not reappeared in anything more worthy of his acting talent. The film sets up a series of oppositions - gangs (Glens versus Tongs); romantic family life vs tough and unromantic street life; loyalty vs betrayal. Far from resulting in simplification, this actually makes the life of young Lex even more complex as he is, sequentially, drawn to each aspect of these opposing ideas. Director Gillies shows he knows how to film his environment and gives us telling and memorable images - such as a huge close-up of blood running down a plug-hole that looks like some work of abstract art. Nowhere near as clichéd as most coming-of-age movies, this is a joy for teenagers and adults alike."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Billy MacKinnon",
         "British Broadcasting Corporation (BBC)",
         "Skyline Films"
      ],
      "summaries": [
         "Three teenage brothers, gang-member Bobby, troubled mama's boy Alan and self-assured prankster Lex, reside in a downtrodden section of Glasgow, Scotland, circa 1968. But while Bobby and Alan are beginning to experience the power of raging hormones, the story focuses on Lex, who begins a downward spiral after he accidentally shoots the leader of Bobby's gang. Lex's cockiness and immaturity unfortunately prevent him from understanding the effect his subsequent crimes will have on both himself, and on those around him.",
         "Glasgow, 1968. Thirteen-year-old Lex Maclean lives with his mother, and his two older brothers, Alan, who plans to go to art school, and Bobby, a rather slow-witted member of the Glen gang. Lex enjoys art, but is caught up with the gangs when he mischievously fires an air gun at Malky Johnson, the gang leader of the Tongs. Charlie Sloan, the Glen gang leader, offers Lex protection if Lex will work with his gang. Malky is further annoyed with the Maclean brothers when his girlfriend Joanne is attracted to Alan."
      ],
      "budget": 0
   },
   "movielensId": 865,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-04-05",
      "dvdReleaseDate": null,
      "directors": ["Gillies MacKinnon"],
      "runtime": 108,
      "movieId": 865,
      "title": "Small Faces",
      "mpaa": "R",
      "actors": [
         "Iain Robertson",
         "Joseph McFadden",
         "Steven Duffy",
         "Laura Fraser",
         "Garry Sweeney",
         "Clare Higgins",
         "Kevin McKidd",
         "Mark McConnochie",
         "Colin McCredie",
         "Kirsty Mitchell",
         "Ian McElhinney"
      ],
      "imdbMovieId": "0114474",
      "originalTitle": "Small Faces",
      "genres": [""],
      "youtubeTrailerIds": ["BFwYPhGzNQ4"],
      "plotSummary": "Three teenage brothers, gang-member Bobby, troubled mama's boy Alan and self-assured prankster Lex, reside in a downtrodden section of Glasgow, Scotland, circa 1968. But while Bobby and Alan are beginning to experience the power of raging hormones, the story focuses on Lex, who begins a downward spiral after he accidentally shoots the leader of Bobby's gang. Lex's cockiness and immaturity unfortunately prevent him from understanding the effect his subsequent crimes will have on both himself, and on those around him.",
      "tmdbMovieId": 42758,
      "avgRating": 3.31776,
      "releaseYear": "1996",
      "numRatings": 107,
      "posterPath": "/s9I3gLu9ySsfyM3JvlpSW9KrszF.jpg"
   }
}