{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "carpool",
            "id": 195212
         }
      ],
      "imdb_id": "tt0115836",
      "video": false,
      "title": "Carpool",
      "recommendations": [
         26258,
         41779,
         19931,
         44900,
         26441,
         31220,
         106143,
         21845,
         48287,
         47608,
         36929,
         38554,
         12312,
         26391,
         36259,
         12475,
         17207,
         10486,
         9446,
         13962
      ],
      "backdrop_path": "/lnS1OU4aN3lvJbtx82TXJBBqpQs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Franklin Laszlo",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0252ed",
               "name": "Tom Arnold",
               "profile_path": "/udJkmZPrQs4D8NPV8u4BEv3rNLX.jpg",
               "id": 74036,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Daniel Miller",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e025313",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Martha",
               "gender": 1,
               "credit_id": "52fe4479c3a368484e0252f1",
               "name": "Rhea Perlman",
               "profile_path": "/cq7Cf4z3BHD9o58ki7MgCioty8q.jpg",
               "id": 24203,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Hammerman",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0252f5",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Detective Erdman",
               "gender": 2,
               "credit_id": "53238dec9251411f8c004f70",
               "name": "Kim Coates",
               "profile_path": "/xGoPaGsqRWCsDDDmY1gNR8eoxTA.jpg",
               "id": 8335,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Kayla",
               "gender": 1,
               "credit_id": "52fe4479c3a368484e02531b",
               "name": "Rachael Leigh Cook",
               "profile_path": "/cotGJui5H2Te2ThYERndc3DOVOm.jpg",
               "id": 38581,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Andrew Miller",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0252f9",
               "name": "Mikey Kovar",
               "profile_path": null,
               "id": 236398,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Bucky Miller",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e0252fd",
               "name": "Micah Gardener",
               "profile_path": null,
               "id": 236399,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Travis",
               "gender": 0,
               "credit_id": "52fe4479c3a368484e025301",
               "name": "Jordan Warkol",
               "profile_path": null,
               "id": 236400,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Chelsea",
               "gender": 1,
               "credit_id": "59843f92925141431200081e",
               "name": "Colleen Rennison",
               "profile_path": "/rJdgCklRuMpHtzWldaYhYePIXLz.jpg",
               "id": 21058,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "53238d709251411f8100520d",
               "name": "John Tench",
               "profile_path": "/g1aajd4vizblxNYzYKMsfcrwVKZ.jpg",
               "id": 27143,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Scott Lewis",
               "gender": 2,
               "credit_id": "52fe4479c3a368484e025317",
               "name": "David Kaye",
               "profile_path": "/b1HQg1uhAXo9L1suUbqAXN8iCSz.jpg",
               "id": 84490,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4479c3a368484e02530f",
               "name": "Arthur Hiller",
               "profile_path": "/irrSj7cAn2ByM7hhu2emkMdFOai.jpg",
               "id": 133259,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5464c2ba0e0a26294f001ee3",
               "name": "Don Rhymer",
               "profile_path": "/7Y9CvRWULNyoRFxBBOOmSBTlcg9.jpg",
               "id": 58144,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "565222b19251414b0700bf0c",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "598db32ac3a36875a201103f",
               "name": "John Debney",
               "profile_path": "/hTrlvZlDXQk49nfc2BM9sjKfJv.jpg",
               "id": 4500,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "598db33492514178d6011fa1",
               "name": "David M. Walsh",
               "profile_path": "/iqzK0KjUbH5W2U5XwS3LQZ20RWH.jpg",
               "id": 19129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "598db33ec3a368758e011fbe",
               "name": "L. James Langlois",
               "profile_path": null,
               "id": 1867812,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "598db34f92514178ac01225a",
               "name": "William Reynolds",
               "profile_path": null,
               "id": 3099,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "598db3559251417901011ec2",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "598db35ec3a3687559012a99",
               "name": "James Dowell Vance",
               "profile_path": null,
               "id": 41141,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "598db36592514178b1011742",
               "name": "Sandy Cochrane",
               "profile_path": null,
               "id": 53813,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "598db36bc3a36875a20110c3",
               "name": "Dominique Fauquet-Lemaitre",
               "profile_path": null,
               "id": 32201,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "598db371c3a368758e011fef",
               "name": "Trish Keating",
               "profile_path": null,
               "id": 62164,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.450256,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23945,
      "vote_count": 23,
      "budget": 17000000,
      "overview": "A man with an important business meeting finds himself having to take care of the carpool for the neighborhood school children when his wife gets sick. Stopping to get donuts for the kids, things go even more awry when he finds himself a victim of a robbery. However, the situation only gets worse as a desperate man who had been contemplating a bank robbery robs the robbers and takes the man and the kids hostage in their van as his truck is blocked by an armored car. The thing then proceeds into a comedic chase movie. The father finds his kids don't really respect him and they react better to the robber. The end result is everyone gets a lifestyle change, including the original store owner.",
      "similar": [
         949,
         11966,
         193893,
         4771,
         500,
         359412,
         209247,
         36208,
         968,
         4638,
         138832,
         345915,
         2017,
         11958,
         2048,
         1586,
         298,
         9654,
         1949,
         562
      ],
      "original_title": "Carpool",
      "runtime": 89,
      "poster_path": "/iF3exraajWgTwBXtjMKwfdyPXOj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-08-23",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "A dad in a hurry. A man on the run. And five kids with an attitude.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Arthur Hiller"],
      "runtime": 89,
      "synopsis": "A nice but goofey man takes a busy distant father and his two children plus the three they carpool hostage.",
      "writers": ["Don Rhymer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115836/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNjMzMDU5NF5BMl5BanBnXkFtZTcwNTkzOTQyMQ@@._V1_SY317_CR25,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Arnold, David Paymer, Rhea Perlman | See full cast and crew »"],
      "reviews": [
         "This is your common family comedy: a lack of realism, fart jokes, kids and dopey adults taking control, more bad jokes, and a busy parent with a struggling relationship with his/her child. What is with the last item on that list? All these family movies have the boilerplate `'I hate you, Dad/Mom'\u0085'save me, Dad/Mom'\u0085'I love you, Dad/Mom'' subplots, as if they're required by law. I thought such subplots were dumb when I was young enough to appreciate family movies. As an 18-year-old, they look even stupider. I don't think anyone truly gets anything from them. Even the dumbest jokes were a better investment of time. Still, it's not all bad. Silly movies like this can be much worse. The acting was decent, assuming that several actors were still kids. It's sad that they did a career-crushing film like this. Of the five kids, only Rachael Leigh Cook has had a remotely notable role since (`She's All That,' almost three years later). As for the adults, I was impressed with Rod Steiger and David Paymer, but couldn't they find something better? Most would be horrified to think about a sequel, but with so much to improve, I doubt it could be worse. (Maybe Kayla, now in her late teens, fills in for the carpool and Chelsea and Travis are now teens, with new little kids to take their place. The hijacker could be an early-20's guy so he can have a love/hate relationship with Kayla. You groan, but would you rather a cheesy parent/child relationship?) These are just my ravings: even if you could get the actors to return, the reputation of the original would still be there. Then again, maybe the public has forgotten after four years. My overall impression: this movie is as mediocre as it gets; just how so depends on your age group. Kids will enjoy the bad jokes. Adolescent boys will enjoy Kayla's outfit. Everyone else: it won't kill you, but there has to be at least one better tape in the store. Parents: be advised that family movies are not the best way to spend time with your kids; this one is no exception. My rating: 5.",
         "This film was about what I was expecting, although perhaps a little better. I was surprised that things never got TOO stupid, but that's not to say that it wasn't a piece of fluff. There were a few times when I laughed, and I wasn't watching the clock all that much, but that is about as high as my praise can get for this movie. Basically, it's just another forgettable movie that is an adequate time killer, but has fairly little entertainment value.",
         "As a kid, I had no knowledge of Cinema. I only relied on Cartoons and Comedies like 'Carpool'. I remember enjoying myself while watching 'Carpool' back in the late 1990's. Now when I saw it on TV after all these-years, When I itself started to watch films like 'Ben Hur', 'Casablanca' etc, I consider this 1996 flick to be a weak effort. 'Carpool' is not a terrible film, but it's not good either. However, Kids of my age back then, enjoyed themselves. In terms of 'Screenplay' & 'Direction', this flick offers nothing magnificent and I can confirm you that the Makers didn't intend to make a 'milestone' film anyway. Their intension was to make Kids laugh, and of what I remember, the kids did. Arthur Hiller's direction as well as the screenplay offer nothing great. For some reason, Tom Arnold won a Razzie-Award for Worst Actor for his performance in here, while David Paymer delivered a truly good performance. David Paymer is amongst \"the\" most under-rated actors of his time. The kids did a fine job. On the whole, A film that never will be talked about, and I guess it never even wanted to be Evergreen.",
         "CARPOOL was produced by Warner Bros , a film studio with a long history of movie making . You'd think the studio heads would know what makes a successful entertaining film so couldn't have come up with something better than this ? What's that old saying \" Never work with children or animals \" ? The studio broke one of the rules by employing children as main protagonists and while we don't have much in the way of animals we see another golden rule broken , the one that states \" Never work with a duff script \" . A man drives his children to school only to get kidnapped by a desperate robber . You probably think you've seen this premise a million times before but it's not really a plot that's been filmed all that many times , probably because it's so weak and obvious which leads me to be confused as to how it survived its pitch . I guess the studio must have been really short of good ideas that month . The already weak plot is brought done even more by the way the actors mug for the camera and the really weak situations: \" You put the gun down - No you put the gun down \" which means it's not really worth your time seeing",
         "Daniel (David Paymer) is a businessman who works long hours. One morning, his wife gets the flu, leaving him responsible for getting his children dressed, fed, and dropped off at school. He fumes about this, for he has an all-important meeting at ll:00 am. Nevertheless, he piles his two boys, along with three neighbor kids (its Dan's turn to be the carpool driver) into the van and stops for doughnuts for everyone to have a \"good\" breakfast. Trouble is, at the bakery, there is a hold-up, with Franklin (Tom Arnold) taking the money and taking Daniel hostage, too, to complete a getaway. Franklin is really a nice man but his failing carnival show necessitated the immediate need for funds. Daniel is aghast for he still has his meeting looming on the horizon. After having the kids spray-paint the van purple, to allude authorities, Daniel, Franklin, and the kiddies drive around and around. Will they be caught? And, why does Daniel's children like Franklin better than they like their own father? This movie has a good concept that is, unfortunately, not matched by the film's ultimate execution. The idea that a robber would end up in a mundane carpool routine is infectious but the film's plot line runs thin, at times. Nevertheless, Paymer is a good performer, as is Arnold, who always garners smiles. The children are lively and fun, as well, and the movie's costumes, scenery, and photography make for a good-looking film. To be brief, families will probably enjoy a showing of this flick, for it has humor, chase-scenes, car crashes, and other attention-getting devices. But, it is doubtful that anyone will ask for a repeat showing.",
         "A man with an important meeting finds himself having to take care of the carpool for the neighbourhood school children when his wife gets sick. Things get awry when he finds himself a victim of a robbery. But the situation only gets worse as a desperate man who had been contemplating a robbery, robs the robbers and takes the man and the kids hostage in their van as his truck is blocked by an armoured car. The father finds during this that his kids don't really respect him and they react better to the robber....... During the mid to late nineties, these were the sort of comedies that were released in the states for a couple of weeks, and then later came straight to video here in the UK. Films like Gone Fishin', Most Wanted, and Wrongfully Accused spring to mind, they are nothing special, have flop written all over them, and have that plastic cheese essence to them all. This film has all the elements to a half decent film, but the performances feel too strained, especially from Paymer and Coates. Arnold is as annoying as ever, but he flashes charm every now and again, so he's not that bad, his character reflects his other performances, so you get what you expect. There are so many tropes in this movie, everyone learns there life lessons come the end, and we all change for the better. Shame the film stinks a little....",
         "I don't like Tom Arnold movies, period. Though, the miracle has happened. I liked this one, and so much to be frank. This script has it all. We follow a hostage situation, leads on the run, teen love story, odd couple comedy, bad guys vs. good guys, big fight in a carnival, from zero to hero, rescue in the nick of time, happy ending. And the beautiful thing is that all of that worked too. There were good casting, lines, and chases. However what did overtop everything was the way how this movie mixed comedy with action. Important to mention that it has one of the greatest jumps ever done by a car in the history of cinema; and of course I mean the one which ends the mall's sequence. That was ultra enjoyable and totally unforgettable. David Paymer was born to play that beaten executive and exhausted father. Tom Arnold played that slick desperate carnival owner-turned-criminal finely and, believe it or not, he was funny ! The younger team was fabulous. And the real dessert was Rod Steiger as the scary (naturally) tycoon Mr. Hammerman, a role that couldn't be sweeter without his presence. He won a character which looked like a parody of his film persona, and this movie won him as it too. Wait for his last scene, it's a lovely surprise ! So it's nice fun. And when it comes to Arnold; rare nice fun! Therefore, why all the HATE?!!! I may ascribe not being a commercial hit to the 2 leads' not so flashy charisma; which's the movie's possible flaw. But I still don't know why (Carpool) wasn't fairly appreciated, as a whole, by anyone? There is such a nasty superiority towards it, while praising pure crap produced under the name of art ! I read that Rotten Tomatoes' critics gave it a 0% rating. Well, 0% rating from me to them then ! Finally, watching a good Tom Arnold movie equals seeing actual UFO. Accordingly, (Carpool) is filled with many extra-terrestrials !",
         "I watched this film for the first time tonight. I have to say that I did see it on a small television set, but this did not detract at all from Arthur Hiller's obvious and superb genius comedic directing. The film just fills me with a gleeful warm sense of satisfaction. I particularly enjoy the Mall scene where Franklin drives the people carrier into the hordes of poor shoppers! This film really does shine out from other genres within the mid-90's era of comedy. We see here a delightful microcosm, a delectable pastiche capturing the endless hilaritys of two 'star crossed' people coping with the madcap situation which life has bestowed them on this darkest of days. Hiller actually makes you care about the characters, crazy but lovable Franklin (Tom Arnold gives an outstanding performance) with his wacky driving, Daniel with his all so cautious but semi-professional 'keeping it together attitude.' The screaming kids in the back just add to the foreground of this delightful and mystical journey on which we are taken though 90 minutes of mayhem! With a team of talented writers with the likes of Don Rhymer, you know you're just being given gold! I personally would rate this film 9.5, but that's not for the likes of me to decide. I would thoroughly recommend this film to any friend, and will probably be purchasing on DVD as soon as possible.",
         "The biggest problem with the critically slammed \"Car Pool\" is its lack of originality. The affable Arnold plays a likeable two-bit carnival owner in need of money who carjacks a gaggle of kids on their way to school in a van driven by Paymer. What ensues are the usual chases and sophomoric nonsense. A busy flick with lots going on, \"Car Pool\" is a regurgitation of hackneyed stunts and gags which have been done many times before. An okay diversion for the vegetating sofa spud and little more. (D) Note - IMHO Arnold's Razzie is undeserved. It's hard to look good in a really bad film.",
         "\"Carpool\" wasn't all that bad. I think Tom Arnold can be very funny at times and he came through here. The stars of this movie however were the children. They provide most of the laughs. Maybe my one quarrel with the film was Paymer's character's constant whining about being late for his meeting. The movie is nothing special, but its also not terrible. \"Carpool\" is harmless family fun."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Regency Enterprises",
         "Monarchy Enterprises B.V.",
         "Warner Bros."
      ],
      "summaries": ["A man with an important business meeting finds himself having to take care of the carpool for the neighborhood school children when his wife gets sick. Stopping to get donuts for the kids, things go even more awry when he finds himself a victim of a robbery. However, the situation only gets worse as a desperate man who had been contemplating a bank robbery robs the robbers and takes the man and the kids hostage in their van as his truck is blocked by an armored car. The thing then proceeds into a comedic chase movie. The father finds his kids don't really respect him and they react better to the robber. The end result is everyone gets a lifestyle change, including the original store owner."],
      "budget": 17000000
   },
   "movielensId": 867,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-23",
      "dvdReleaseDate": "2004-02-10",
      "directors": ["Arthur Hiller"],
      "runtime": 89,
      "movieId": 867,
      "title": "Carpool",
      "mpaa": "PG",
      "actors": [
         "Tom Arnold",
         "David Paymer",
         "Rhea Perlman",
         "Rod Steiger",
         "Kim Coates",
         "Rachael Leigh Cook",
         "Mikey Kovar",
         "Micah Gardener",
         "Jordan Warkol",
         "Colleen Rennison",
         "John Tench",
         "David Kaye"
      ],
      "imdbMovieId": "0115836",
      "originalTitle": "Carpool",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["DK8xq9F5m9o"],
      "plotSummary": "A man with an important business meeting finds himself having to take care of the carpool for the neighborhood school children when his wife gets sick. Stopping to get donuts for the kids, things go even more awry when he finds himself a victim of a robbery. However, the situation only gets worse as a desperate man who had been contemplating a bank robbery robs the robbers and takes the man and the kids hostage in their van as his truck is blocked by an armored car. The thing then proceeds into a comedic chase movie. The father finds his kids don't really respect him and they react better to the robber. The end result is everyone gets a lifestyle change, including the original store owner.",
      "tmdbMovieId": 23945,
      "avgRating": 2.38235,
      "releaseYear": "1996",
      "numRatings": 357,
      "posterPath": "/iF3exraajWgTwBXtjMKwfdyPXOj.jpg"
   }
}