{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "restaurant",
            "id": 1946
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "greek",
            "id": 8011
         },
         {
            "name": "job",
            "id": 8438
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "brunswick",
            "id": 193765
         }
      ],
      "imdb_id": "tt0101692",
      "video": false,
      "title": "Death in Brunswick",
      "recommendations": [
         92927,
         32027,
         124296,
         47889,
         52961,
         24084
      ],
      "backdrop_path": "/lYhbCxXXJQc5Cu3wAzv6ETJOpdb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Carl",
               "gender": 2,
               "credit_id": "52fe46719251416c910549b5",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "52fe46719251416c910549bd",
               "name": "Zoe Carides",
               "profile_path": "/mnt3e73dsuoNpD8f3iGYtdjUbX4.jpg",
               "id": 106820,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mrs. Fitzgerald (Carl's mother)",
               "gender": 0,
               "credit_id": "563ee498c3a3681b6102e78a",
               "name": "Yvonne Lawley",
               "profile_path": "/j9xO56tYUZBjOnSFwpWBde4ImYq.jpg",
               "id": 1357277,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mustafa",
               "gender": 2,
               "credit_id": "563ee4a992514134420057ac",
               "name": "Nick Lathouris",
               "profile_path": "/tlkHM8TUcKZFcsS7rGuShkCHeU.jpg",
               "id": 1027146,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Yanni Voulgaris",
               "gender": 0,
               "credit_id": "563ee4bec3a3681b5c02ef26",
               "name": "Nicholas Papademetriou",
               "profile_path": null,
               "id": 1532966,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Maria",
               "gender": 0,
               "credit_id": "56a94e1dc3a36872cb0021c7",
               "name": "Maria Beck",
               "profile_path": "/trZKbe8g6qTISgmoZPHREqYJoWj.jpg",
               "id": 1310813,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "June",
               "gender": 1,
               "credit_id": "56a94e41c3a36872cf0022ae",
               "name": "Deborah Kennedy",
               "profile_path": "/6gZtHDvmK4GbbVChvBraPpkC8fb.jpg",
               "id": 96460,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Dave",
               "gender": 2,
               "credit_id": "59f8aa43c3a368602e0187cc",
               "name": "John Clarke",
               "profile_path": null,
               "id": 1525900,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46719251416c910549c3",
               "name": "John Ruane",
               "profile_path": null,
               "id": 1155073,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "563ee52c92514134420057d1",
               "name": "Boyd Oxlade",
               "profile_path": null,
               "id": 1532969,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "563ee539c3a3681b5402f784",
               "name": "John Ruane",
               "profile_path": null,
               "id": 1155073,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.737498,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 37820,
      "vote_count": 9,
      "budget": 0,
      "overview": "A reserved man in need of a job, Carl Fitzgerald finds employment at a Greek restaurant. Upon meeting waitress Sophie, Carl begins dating the attractive woman. Though it seems things are improving for Carl, an unexpected situation leads to the death of Mustafa, a shady coworker, and Carl must figure out how to cover up the incident. Unsure of what to do, Carl enlists the help of his buddy, Dave, to get rid of Mustafa's corpse.",
      "similar": [
         26405,
         9555,
         9659,
         8810,
         9355,
         36040,
         16608,
         245846,
         8346,
         66125,
         2759,
         199534,
         3784,
         4657,
         13439,
         17381,
         7839,
         347196,
         337958,
         353979
      ],
      "original_title": "Death in Brunswick",
      "runtime": 109,
      "poster_path": "/7vVBRhrvn4qZDDdaLLE3QRfHVIL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Meridian Films",
            "id": 31317,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Victoria",
            "id": 11840,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Australian Film Finance Corporation",
            "id": 1380,
            "origin_country": "AU"
         }
      ],
      "release_date": "1990-11-08",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Carl Fitzgerald has decided to clean up his act... but first he has to get rid of the body.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Ruane"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Boyd Oxlade",
         "John Ruane"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101692/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5OTk1Nzg3MF5BMl5BanBnXkFtZTcwNTE5OTUxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Sam Neill, Zoe Carides, John Clarke | See full cast and crew »"],
      "reviews": [
         "Funny how two Kiwis (John Clarke & Sam Neill) have made one of the best and most keenly observed films ever made about the inner suburbs of Melbourne and sad how the only reviewers who couldn't appreciate its humour came from the southern states of the USA. Perhaps the humour came out of references that were a little too specific for people who haven't experienced post second war Melbourne and the effect that the large influx of southern European migrants had on both the city and the migrants themselves over the second half of the twentieth century. John Clarke, who another reviewer rightly said could be funny reading a phone book, steals the movie as the laconic friend of Sam Neill, the weak but likable hero of the story. Clarke played a significant part in the writing of the movie, which has a much lighter touch than the book upon which it its based, and his character gets many of the best lines. Sam Neill is terrific as the hapless hero of the piece, Ms Carides has an appeal that no \"thirty something\" male could resist, and the supporting characters including \"Cookie's\" domineering mother, Sophies' fearsome father, Clarke's no-nonsense wife, the club's sleazy owner and his dopey flunkies, and the drug dealing Turk and his associates are all just flawless. There may be parts of the world that contain people sufficiently insular to not appreciate this movie's humour or the way it shows a weak man dealing with and coming to terms with the forces that have oppressed him and one can but feel sorry for them. For the rest of us its a both a movie to bring a wry smile to our faces and a warning against eating crunchy pizzas.",
         "I truly love this flick! It is so terribly funny, I find myself laughing until I cry! Very few movies have this effect on me. It's not a deep, or thought-provoking film, but that's not its purpose, either. I enjoy this movie for its subtle and not-so-subtle humor. The plot is simple, yet feasible and perfect. I really cannot say much, except that it is a fun ride, and worth a look! If you're having a glum day, this is a great \"pick-me-up!\"",
         "There's an opening scene where Sam Neill's short-order cook hero has a fatal encounter with a tin can that anyone who's ever tried to sleep off a particularly nasty hangover can fully understand. If it makes you laugh, keep going. Chances are, you'll enjoy the whole movie. If you don't laugh, go back to \"The Sound of Music\"; this movie is not for you. Neill is dead-on accurate as the epitome of every short-order cook that has ever been and his comic timing is brilliant. I picked this film up several years ago and Neill's role in it is still one of my favourites. Sure, he's slumming, but oh, how well he does it. You can just see how much fun he must have had with the role. If you are a Sam Neill fan, definitely give this one a try--if you can find it!",
         "Dave is the hero of the movie. ¿Who would squash the head of a dead and rotting body just to make a favor to his/her friend? I would not have the guts. The cemetery scenes are both absolute hilarious and insane: 2 friends dragging a dead and farting body into an open grave to create the perfect crime. The Police haven't found the corpse yet. They will never do. And Dave's family complaining because he stinks death\u0085 Priceless. Cookie is a loser but he has\u0085 ¿some sex appeal maybe? He also creates all the trouble. I think that Cookie has suffered a lobotomy, and Dave helps him to overcome the problem. You would love these guys. Brunswick is a very horrible place. I visited this suburb in Melbourne and the only missing thing is the Adam's family house. 9/10.",
         "From the moment the film opens, depicting aluminium cans rolling ceaselessly (and noisily) in the wind, along with the elderly Greek ladies putting this year's Christmas trees into the wrecked Austin 1800 (stuffed next to previous year's Christmas trees), you know that this film is going to be a little different. Melbourne, one of the most multi-cultural metropolis's in the world (should that be metropoli?) is the setting for this rather dark comedy drama. Carl, an unemployed and very much down on his luck chef, gets a job at a less than reputable nightclub in the Melbourne suburb of Brunswick. He falls in love with one of the Greek barmaids, much to the consternation of the owner of the bar who has been betrothed to the barmaid. Not helping matters much is a Turkish kitchen hand, who appears to want to spend more time trading in stolen goods and drugs than actually working as a kitchen hand. When matters escalate out of hand, Carl needs the specialist help that only his friend, Dave can provide. If it can be said that a good friend will help you move (house), it's fair to say that only a true friend will help you move - a body, and as a gravedigger at the local cemetery Dave is in the ideal position to help \"dispose\" of one of Carl's kitchen disasters. Along the way, Dave is pestered by his Feminist-rights movement wife who spends most of her on-screen time berating Dave for his pathetic life, while Carl spends his time being roughed up by the nightclub bouncer, roughed up by a Turkish crime syndicate, or, more worryingly, being berated and belittled by his mother. A truly enjoyable Australian film from the early 1990's, though apparently not available in Australia - I had to get my copy from the UK, though fortunately the UK release is region free.",
         "Death in Brunswick is a smashing wee film. It comes from that venerable antipodean tradition of the \"cooky\" movie - see: almost anything by Baz Luhrmann or films like The Team, Goodbye Pork Pie, Don's Party, Cars that ate Paris etc etc. Off beat doesn't describe this kind of film - so talk about refreshing. Just when you think the narrative is heading along in a \"I-sort-of-get-this\" direction - some new character or plot device comes up and wryly calls you over and says: nah that would be too boring. Fear not though this isn't laboured zaniness or posturing surreality - this is clever, clever, clever stuff - character driven, funny as...and basically something to get you thinking. And get this: someone actually sat in a room somewhere and thought: \"Right we'll get that handsome Sam Neill guy and make him a play a weedy loser who lives with his mum.\" ???Only in Oz. No wonder the man himself ranks this gem among his favourite movies.",
         "This is a great and inventive comedy. Although it does follow some tried and true paths, most of it is refreshingly new. There are even some great send up scenes of established movie cliches in it, the fight scene in the stairwell is a classic. It's a very Australian, even a very Melbourne movie. It catches the look and characters of Brunswick rather well. I don't know what director John Ruane did to convince Sam Neill to be a part of this small movie but it was certainly worth it, he fits the character perfectly Best of all though, this has John Clarke in it. He could read the phone book and it'd great comedy. John Ruane hasn't really followed up on the promise of this movie yet, although last year's made for TV, \"The love of Lionels life\" was a step in the right direction.",
         "I enjoyed DIB and don't have much to add to the other positive reviews posted, however I just had to comment on the couple of reviews questioning whether it was a comedy. If you don't understand and enjoy BLACK comedy then don't watch a black comedy and expect to enjoy it! Surely the title should give you a pretty good clue as to whether you're going to like it or not. If you find the idea of death/grim subjects innately unfunny then switch off! I find it tremendously sad, but not surprising, that there are so many people in the world who can't find something funny unless it's \"clean\" and \"nice\". What a loss for them. Oh well, all the more for the rest of us!",
         "This all Australian production is both original and darkly funny. Sam Neill plays a dopey cook who, after meeting an attractive night-club waitress, has an incredible run of bad luck. Zoe Carides is very sexy as Neill's nineteen year old love, while John Clarke provides great support as his best friend Dave. \"Death in Brunswick\" is a fine debut from writer-director John Ruane (co-written with Boyd Oxley), as he brings us many moments of hilarity. Last but not least, Sam Neill himself makes a likable, if very non-directional hero, as Carl Fitzgerald. Fantastic to see home grown humour done as well as this. Friday, January 17, 1992 - Video",
         "Great film. I worked with John a few years back on a short film that never got made. We had a great time and I really wish my movie went further. He was a great director to work with, had some odd ideas, but hey, that's awesome, and Death in Brunswick was a great Australian film. I reckon you , JOHN, should go all out and make that ideal dream film. The one with all your crazy, whacked out ideas. Like the one with the kids that buried their principle under the oval. That was seriously cool. Cant wait to see some more Ruane films. Hope you're still at it John. You kicked butt back then and I'm sure you still can. Well I'm running out of lines cause this thing says I need ten lines to submit it. OK I think that's enough. TySe"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Australian Film Finance Corporation (AFFC)",
         "Film Victoria",
         "Meridian Films"
      ],
      "summaries": ["Carl Fitzgerald is down-on-his-luck until he meets Sophie, a beautiful Greek girl. He gets a job as a cook, but accidentally kills fellow worker Mustafa. He turns to his unscrupulous best friend for help and together they attempt to dispose of the body."],
      "budget": 0
   },
   "movielensId": 868,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-11-08",
      "dvdReleaseDate": null,
      "directors": ["John Ruane"],
      "runtime": 109,
      "movieId": 868,
      "title": "Death in Brunswick",
      "mpaa": "R",
      "actors": [
         "Sam Neill",
         "Zoe Carides",
         "Yvonne Lawley",
         "Nick Lathouris",
         "Nicholas Papademetriou",
         "Maria Beck",
         "Deborah Kennedy",
         "John Clarke"
      ],
      "imdbMovieId": "0101692",
      "originalTitle": "Death in Brunswick",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["E9JXrJ-y5tA"],
      "plotSummary": "A reserved man in need of a job, Carl Fitzgerald finds employment at a Greek restaurant. Upon meeting waitress Sophie, Carl begins dating the attractive woman. Though it seems things are improving for Carl, an unexpected situation leads to the death of Mustafa, a shady coworker, and Carl must figure out how to cover up the incident. Unsure of what to do, Carl enlists the help of his buddy, Dave, to get rid of Mustafa's corpse.",
      "tmdbMovieId": 37820,
      "avgRating": 3.14141,
      "releaseYear": "1990",
      "numRatings": 99,
      "posterPath": "/7vVBRhrvn4qZDDdaLLE3QRfHVIL.jpg"
   }
}