{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "politician",
            "id": 6083
         },
         {
            "name": "kansas city",
            "id": 11016
         },
         {
            "name": "election",
            "id": 15134
         },
         {
            "name": "jazz music",
            "id": 164884
         }
      ],
      "imdb_id": "tt0116745",
      "video": false,
      "title": "Kansas City",
      "recommendations": [
         45695,
         78146,
         42086,
         58062,
         42257,
         30192,
         19258,
         12239
      ],
      "backdrop_path": "/A5uYGESsD1w0tAPiKDVs8UfGc9v.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Blondie O'Hara",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018d97",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Carolyn Stilton",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018d9b",
               "name": "Miranda Richardson",
               "profile_path": "/kTs3t6pnO3zR7WYSVYzQfJ9yKMW.jpg",
               "id": 8436,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Seldom Seen",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d9f",
               "name": "Harry Belafonte",
               "profile_path": "/fSSsExSbBbkr6ZV5uwTMZqZyDwh.jpg",
               "id": 33162,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Henry Stilton",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018da3",
               "name": "Michael Murphy",
               "profile_path": "/ebbKhFgIHugUywSL5udMFNfRxvQ.jpg",
               "id": 4776,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Johnny O'Hara",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018da7",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Johnny Flynn",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018dab",
               "name": "Steve Buscemi",
               "profile_path": "/ieDyVKnQHo7eMGu1GOE7YYr2Fk4.jpg",
               "id": 884,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Babe Flynn",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018daf",
               "name": "Brooke Smith",
               "profile_path": "/fiR32HbDUWCZuRjdlknQMIyIsrw.jpg",
               "id": 31649,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Nettie Bolt",
               "gender": 1,
               "credit_id": "546620c8c3a36836b600020a",
               "name": "Jane Adams",
               "profile_path": "/HbQfL01xmV1psnh0WvldIBzDg3.jpg",
               "id": 209,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d93",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018db5",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018dbb",
               "name": "Frank Barhydt",
               "profile_path": null,
               "id": 10414,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5998a5d89251411e1e0174a8",
               "name": "Oliver Stapleton",
               "profile_path": "/wfzgRB2LbfKvKJ50NZYebi9nv1c.jpg",
               "id": 16425,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5998a5dec3a3680f4e00b0c4",
               "name": "Geraldine Peroni",
               "profile_path": null,
               "id": 1808,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5998a5e5c3a3680eed00cebb",
               "name": "Elisabeth Leustig",
               "profile_path": null,
               "id": 4142,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5998a5edc3a368207e010b74",
               "name": "Stephen Altman",
               "profile_path": null,
               "id": 10420,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5998a5f792514125b50162cd",
               "name": "Richard L. Johnson",
               "profile_path": null,
               "id": 8285,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5998a5fd92514125c2015ea5",
               "name": "Susan Emshwiller",
               "profile_path": null,
               "id": 10422,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5998a60fc3a3680ce10172a5",
               "name": "Dona Granata",
               "profile_path": null,
               "id": 944971,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.762692,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22479,
      "vote_count": 17,
      "budget": 18000000,
      "overview": "Robert Altman's story is a riff on race, class, and power cross-cuts between the two kidnappings and the background of corrupt politics and virtuoso jazz music. It all takes place in Kansas City in 1934.",
      "similar": [
         77953,
         376290,
         5125,
         10139,
         9388,
         38050,
         891,
         26389,
         7485,
         9798,
         35056,
         10316,
         51876,
         665,
         23631,
         261023,
         446354,
         8834,
         9285,
         916
      ],
      "original_title": "Kansas City",
      "runtime": 116,
      "poster_path": "/fer4sGAUAFlRFZBn9l7tF1Y75uX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CiBy 2000",
            "id": 7832,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sandcastle 5 Productions",
            "id": 37163,
            "origin_country": ""
         }
      ],
      "release_date": "1996-08-16",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Kansas City, 1934. Anything could happen here. One night it did.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Altman"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "Robert Altman",
         "Frank Barhydt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116745/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMjIyODA5OV5BMl5BanBnXkFtZTcwNTAzMzMzMQ@@._V1_.jpg",
      "actors": ["Stars: Jennifer Jason Leigh, Miranda Richardson, Harry Belafonte | See full cast and crew »"],
      "reviews": [
         "I happen to like this film... apparently quite a bit more than most people. I even still have a copy of it on VHS somewhere. First and foremost is the music. Absolutely INCREDIBLE old time jazz. The best scene to me is clearly the 'battle' between the sax players at the club. The music in the club throughout the movie and the background score during the non-club scenes is about as good as it gets. And I'm not really a huge jazz guy though I have always liked the Miles Davis - John Coltrane type stuff. This is my favorite non - Angelo Badalamente (sp?)film score. Seriously, see this flick just for the music alone. And, see it for Miranda Richardson who is AWESOME in this movie. I think she really steals the show in this one. J. Jason Leigh is solid and plays the part of a not too bright, not very successful midwest girl decently. Also, Harry Belafonte is great as Seldom Seen and he just looks and sounds the part so well. Steve Buscemi, Dermot Mulroney and the woman who plays J. Jason Leigh's sister are all quite good in supporting roles, and Michael Murphy is perfect for the part of the slightly confused, yet somewhat powerful husband to the kidnapped Richardson character. The clothes, cars, and look of the film is nicely done (cmon it IS an Altman picture!!!) and really does make you feel as if you are in Missouri circa 1935-1940. Add to that a slightly twisted ending and you have a really good and def. underrated film that I really want to see again... on DVD this time to REALLY crank up the music scenes. I give Kansas City 7.5/10",
         "This film is so deceptively constructed that it took me a few viewings to completely get it. Not the most inviting recommendation for a film, but even at first look, there is much to enjoy. The music is superb, the performances outlandish and entertaining, and the take on politics and race relations truly incisive. For example, kidnapping really was a political tool in 1930's Kansas City; Blondie's (Jennifer Jason Leigh) real crime is kidnapping a politician's wife for personal reasons. Though his contempt for romanticism is truly bitter, this remains one of Altman's best films.",
         "Bottom line, whether you love or hate \"Kansas City\" will depend on your reaction to Jennifer Jason Leigh's performance. Leigh's character Blondie anchors the story as a desperate wife trying to save her husband from the gangsters he tried to rob. Leigh looks great in this role, she is fit and trim which makes her face cuter and her character more fragile looking. The contrast between her almost angelic appearance and her tough persona is intentional because the toughness is an affectation, qualities she has adopted because she loves her husband and they are a turn-on for him. Her's is the key performance of the film, the twist is her emulation of Kansas City native Jean Harlow (\"The Public Enemy\" and \"Girl from Missoui\"). Watch Harlow in \"Red Headed Woman\" and you will see the incredible physical resemblance between the two actresses. Personally I found it both touching and humorous; her character worthy of the brave heroine hall of fame. But it is almost a caricature and some viewer will be put off by this tiny woman talking so tough. As in \"Nashville\", there are great songs (but jazz rather than country) throughout the film. It is important to realize that \"Blondie's\" behavior is intended to mirror the \"cutting contests\" between the jazz musicians on-stage at the club. Just as the musicians borrow from one another and weave each others stuff into what they are improvising, \"Blondie\" borrows from the movies and weaves Harlow's tough girl phrases and expressions into her conversation. Leigh and Miranda Richardson spend most of the film in each other's company. Although Richardson's character is doped up on laudanum (tincture of opium) most of the time, you get the idea that she is taking in a lot more of the situation than she is letting on. There is almost a \"Thelma and Louise\" quality to their relationship, in part because Leigh doing Harlow ends up sounding a lot like Geena Davis doing Geena Davis. The two women are polar opposites in the way they react to the desperation in their lives; one has lost all restraint, the other has lost everything but restraint. Richardson's character is unexpectedly touching. An emotional bond is subtly forged between the two women as the film proceeds, with Richarson gradually becoming totally protective of her kidnapper. The ending is shocking but you understand the motivation, then looking back you pick up on the various foreshadowing devices that Altman placed throughout the film. He goes out with a bass duet of Duke Ellington's \"Solitude\" performed by Ron Carter and Christian McBride. Like many films with downbeat endings, \"Kansas City\" is destined to be more appreciated 25 years after its release.",
         "Kansas City is absolutely stunning! Jazz is played practically throughout the entire movie, and one scene in particular could have gone on forever as far as I'm concerned. You'll know which scene I mean when you see it! A real get up and jump 10 minutes or so. Jennifer Jason Leigh was at her best. It was a complex role and her development of the character was incredible. Belefonte was chilling! Altman really picked up a sense of the time and place. This is a must see for jazz fans.",
         "\"You know what I didn't do today? I didn't vote.\" \u0096 Carolyn Stilton I absolutely hated \"Kansas City\" upon first viewing. Its pace seemed strange, its flashbacks seemed oddly placed, its camera seemed to dwell on unimportant details and none of its characters seemed to exist to propel any clearly defined story forward. In other words, though I'd seen virtually every other Robert Altman film, \"Kansas City\" still left me in a state of bewilderment. But as is often the case with Altman, \"Kansas City\" began to make sense - in so far as Altman desires to make sense; his films seem to embrace a certain chaos - upon second viewing. Filled with loving shots of jazz musicians, the film is itself a jazzy tone poem, Altman coming at the audience from odd angles, asking us to pick up on his shifting rhythms of plot and character, themes of race, politics, violence and money. Consider the subtle juxtapositions Altman weaves into the film... A poor white man (Johnny O'Hara) paints his face black and robs a wealthy black man. Seeking assistance, the black man visits a powerful black crime boss called Seldom Seen. Seldom agrees to help, kidnaps Johnny and kills him. In contrast, Johnny's wife (Blondie O'Hara) kidnaps a wealthy white woman (Carolyn Stilton) while she applies a white beauty mask. Carolyn is married to Henry Stilton, a powerful politician. Blondie wants Henry to negotiate with the crime lord so that she may get her husband back. Blondie is eventually killed by Carolyn Stilton. While this drama is unfolding, other characters enter the mix. A young Charlie Parker, years away from musical fame, finds a pregnant black girl. He takes her to a maternity ward. Meanwhile, we learn that Blondie had her baby aborted because Johnny didn't want kids. Similarly, a poor black cab driver (who helped Johnny stage his robbery) is taken to a back alleyway and killed by Seldom and his gang. In contrast, Henry Stilton's goons kill a white man in broad daylight because he was hampering their efforts to falsify local election ballots. And so on and on it goes, Altman juxtaposing his jazz notes, \"Kansas City\" less a linear narrative than a series of contrasting sequences or oppositional musical riffs, some obvious, some subtle, but all revolving around class, race and gender. Blackface paint is mirrored to white beauty cream, black crime lords are mirrored to corrupt white politicians, political thugs are mirrored to violent gangsters, abortions are mirrored to pregnancies, loving marriages are mirrored to loveless couples, poverty is mirrored to power, underground gambling joints and brothels are mirrored to above ground poll booths and ballot stations. Blondie O'Hara, the young kidnapper, is herself contrasted with Carolyn Stilton, the woman she kidnaps. Blondie loves her husband and would do anything for him. Mrs Stilton, in contrast, is constantly doped up on opium and has long given up on her marriage. Furthermore, Blondie is constantly emulating Kansas City native Jean Harlow, an actress whom she idolises. This notion of \"narrative emulation\" is itself intended to mirror the \"cutting contests\" between the jazz musicians sprinkled throughout the film. Just as the musicians borrow from one another and weave each other's material into what they are improvising, Blondie borrows from the movies and weaves Harlow's tough girl phrases and expressions into her conversation. But Blondie's toughness is all a facade, a suit of armour used to compensate for her petite size and coarse environment. While Blondie gives up her child and is constantly subservient to her husband, it is Carolyn Stilton who possesses true strength. Despite her permanently doped up state, Carolyn constantly gives the impression that she knows more than she's letting on, always absorbing information and assessing her surroundings. Her final line, \"I didn't vote\", itself lets us know that she has long cut herself off from a venal world which she refuses to legitimize. And so with \"Kansas City\" - a film which ends with a crime lord counting money in the dark corners of a jazz club - Altman has abstracted the politics of power and persuasion, threat and privilege. Everything in the film hinges on social power, Altman drawing a clean line between those violent people who wield power and all those pathetic dreamers who try to grab it but never succeed in doing so for more than a fleeting moment. The political corruption of the city's democratic machine (the country was built on voting fraud and rigged elections; practises common even today), and the expanding influence of Hollywood (and the power of film to seduce and destroy people such as Blondie), is as important to Altman as the racial segregation that produces Kansas City's two worlds: the white world, dominated by the Stilton's, and the inverted black world of Seldom Seen, a vampiric world of music which seems to only come to life long after the surface world has gone to sleep. The film is also unique in the way it offers jazz music an unprecedented role within the diegetic world. This music is constantly \"seeping into\" he story, providing a kind of tapestry for the characters to perform against. The result is that the jazz music seems to become intertwined with the very social climate that influences it. Altman himself has said that it was his intention that jazz be the structure of the entire film. Whilst a typical song lasts 3 minutes, a jazz tune lasts as much as 17, the effect being that many of the film's scenes are elongated and purposefully stretched out. \"Seldom Seen is like a brass instrument,\" Altman says, \"when it's his turn to solo, he does long monologues and riffs. But the discussions of the two women are like reed instruments, saxophones having duets.\" 8/10 - Best appreciated as a kind of cinematic jazz, the plot lethargically frustrating as it intrigues.",
         "The movie was obviously a musical satire of the political and social conditions in Americain that era (and to some degree today. Even if Altman did experience it first hand, he it he obviously did research and wrote as well as directed a movie that was right on the money. I found everyone's performance to be excellent and if you could not understand some of Belafontes lines it didn't detract from his role, nor did the performances of the rest of the cast as the movie was meant to make you think............as well as be entertained. As for a story line..........unless you know nothing of the past........it was right in your face.",
         "These comments about the movie and a question. I enjoyed the movie, the music , and the \"feel\" of the film. It seemed very authentic: the sets, the lighting, costumes and the extras in the background. Also the social atmosphere that was presented in the film of class, race and economics was very effective. I was mesmerized watching as the film progressed. However, I am at a lost as to what it was about when it got to the end. Can anyone please explain the ending? I saw the movie twice and must have missed something. Why did the politician's wife kill the crook's wife? How did her husband know that this would happen and was outside the house waiting for his wife, who wordlessly gets in the car with him. Thanks.",
         "I was an extra in the film and it was an illuminating experience. We shot the Union Station scenes in 98 degree heat (no AC) and in winter costumes! I was wearing a wool dress, real silk stockings, leather heels and a BEAVER coat! Oh yes, and I was 6 months pregnant! Despite the sweat involved, it was a blast and I am glad I had the experience. Not only was I paid to be in a film, but the caterer was fabulous, the people were very interesting, and it's cool that I can see myself on the screen. I would let my kids see it, but 90% of the movie isn't exactly kid- friendly! I was sorry to hear of Mr. Altman's death - he was one in a trillion. Glad so many people enjoyed the film...",
         "Jennifer Jason Leigh plays a desperate woman who tries to rescue her boyfriend (Dermot Mulrooney) from the hands of local black mobsters led by Harry Belafonte, who have made him a prisoner after he robbed one of them. She kidnaps the laudnum addicted wife (Miranda Richardson) of a Roosevelt political adviser (Michael Murphy) in an effort to somehow get enough leverage to achieve her goal. The Kansas City of the Depression setting looks pretty real and wide open, not only for crime but also political fraud. Robert Altman made a great character for Steve Buscemi as a brutal political operative who's assigned to get out the vote by any and all means possible, including the use of baseball bats, but he failed to give him enough space. Nonetheless, he's just another part of this mosaic of the period, and does well enough with the meager scenes he has. Jennifer Jason Leigh is at the film's center while social, political, and economic forces swirl around her. She affects a Jean Harlow persona throughout the film, and in one scene is actually in a theater watching a Jean Harlow film. The tough girl act conceals her real life existence as yet another victim of the Great Depression of the 1930's. By the end of the film she appears on screen with her hair dyed platinum blond and in an all white evening gown, actually becoming the famous actress who died so young. While the film meanders around, going into and out of crooked politics, race, teen pregnancy, drugs, etc...and in and out of the Hey-Hey Club with the ongoing birth of blues and bebop, the ending that punctuates the kernel of a plot is quite an exclamation point and is well worth the wait.",
         "This movie is by no means a box office magnet, but it is a unique and excellent film about a special time and place: the Kansas City underworld of 1934 and Kansas City jazz of that period. If you are at all interested in this period you will love this movie. Jennifer Jason Leigh is simply astonishing."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Music",
         "Thriller"
      ],
      "productionCompanies": [
         "CiBy 2000",
         "Sandcastle 5 Productions"
      ],
      "summaries": ["Robert Altman's jazz-scored film explores themes of love, crime, race, and politics in 1930s Kansas City. When Blondie O'Hara's husband, a petty thief, is captured by Seldom Seen and held at the Hey Hey Club, she launches a desperate plan to release him. She kidnaps the wife of a powerful local politician in an attempt to blackmail him into using his connections to free Johnny. Despite this being election time, he risks exposure by putting the political machine into action to free Johnny and thereby save his wife. Mrs. Stilton, meanwhile, has befriended Blondie and is impressed by her love and devotion to Johnny, especially in contrast to her own loveless marriage."],
      "budget": 19000000
   },
   "movielensId": 869,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-16",
      "dvdReleaseDate": "2005-02-15",
      "directors": ["Robert Altman"],
      "runtime": 116,
      "movieId": 869,
      "title": "Kansas City",
      "mpaa": "",
      "actors": [
         "Jennifer Jason Leigh",
         "Miranda Richardson",
         "Harry Belafonte",
         "Michael Murphy",
         "Dermot Mulroney",
         "Steve Buscemi",
         "Brooke Smith",
         "Jane Adams"
      ],
      "imdbMovieId": "0116745",
      "originalTitle": "Kansas City",
      "genres": [
         "Thriller",
         "Drama",
         "Music",
         "Crime"
      ],
      "youtubeTrailerIds": ["66rtqQ2Q-Wk"],
      "plotSummary": "Robert Altman's story is a riff on race, class, and power cross-cuts between the two kidnappings and the background of corrupt politics and virtuoso jazz music. It all takes place in Kansas City in 1934.",
      "tmdbMovieId": 22479,
      "avgRating": 3.09423,
      "releaseYear": "1996",
      "numRatings": 589,
      "posterPath": "/fer4sGAUAFlRFZBn9l7tF1Y75uX.jpg"
   }
}