{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boss",
            "id": 5306
         },
         {
            "name": "fistfight",
            "id": 5572
         },
         {
            "name": "bully",
            "id": 10624
         },
         {
            "name": "orangutan",
            "id": 14762
         },
         {
            "name": "hotel manager",
            "id": 158039
         }
      ],
      "imdb_id": "tt0116151",
      "video": false,
      "title": "Dunston Checks In",
      "recommendations": [
         81367,
         19371,
         21352,
         11076,
         66923,
         40490,
         80346,
         41582,
         48287,
         102794,
         40562,
         38223,
         25969,
         38225,
         20551,
         12574,
         26441,
         73952,
         13572,
         222960
      ],
      "backdrop_path": "/dpiciyrHsu9BchmC4x8PoCfubre.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Robert Grant",
               "gender": 2,
               "credit_id": "52fe47239251416c7508f091",
               "name": "Jason Alexander",
               "profile_path": "/ernpSXp2RnkzeV14OEEKXRq1yND.jpg",
               "id": 1206,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mrs. Dubrow",
               "gender": 1,
               "credit_id": "52fe47239251416c7508f095",
               "name": "Faye Dunaway",
               "profile_path": "/sq12RJZ1HTXHHI48y31YIS2qp87.jpg",
               "id": 6450,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kyle Grant",
               "gender": 2,
               "credit_id": "52fe47239251416c7508f099",
               "name": "Eric Lloyd",
               "profile_path": "/e8NPxDPs3MNjkeesMHgTvpkyjFS.jpg",
               "id": 27564,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lord Rutledge",
               "gender": 2,
               "credit_id": "52fe47239251416c7508f0a9",
               "name": "Rupert Everett",
               "profile_path": "/jGTaV5htTRo2T0aeM2eoHZcpLG4.jpg",
               "id": 4757,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Brian Grant",
               "gender": 2,
               "credit_id": "52fe47239251416c7508f0ad",
               "name": "Graham Sack",
               "profile_path": null,
               "id": 171373,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Buck LaFarge",
               "gender": 2,
               "credit_id": "52fe47239251416c7508f0b1",
               "name": "Paul Reubens",
               "profile_path": "/qiY2maQ1iFnoaUiGNGLTKnaj3Xu.jpg",
               "id": 5129,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lionel Spalding",
               "gender": 2,
               "credit_id": "52fe47239251416c7508f0b5",
               "name": "Glenn Shadix",
               "profile_path": "/n8jN66HVN4vjXKvZsOMkbTrJXH6.jpg",
               "id": 13243,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Victor Dubrow",
               "gender": 2,
               "credit_id": "52fe47249251416c7508f0b9",
               "name": "Nathan Davis",
               "profile_path": "/zeNXVXgxQ0qE3jWTyzLcG5Ax7nl.jpg",
               "id": 156592,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mrs. Dellacroce",
               "gender": 1,
               "credit_id": "52fe47249251416c7508f0bd",
               "name": "Jennifer Bassey",
               "profile_path": "/iJrrS8tnGklIBW46ZKgBOPPJbe6.jpg",
               "id": 169906,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe47249251416c7508f0c1",
               "name": "Judith Scott",
               "profile_path": "/Aqeajq8Mdu1SHPVebRCMNKOqcL1.jpg",
               "id": 44185,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Murray",
               "gender": 2,
               "credit_id": "52fe47249251416c7508f0c5",
               "name": "Bruce Beatty",
               "profile_path": "/6lWPrqtnagVMhDOo6VARMjVko8V.jpg",
               "id": 156532,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Norm",
               "gender": 2,
               "credit_id": "52fe47249251416c7508f0c9",
               "name": "Danny Comden",
               "profile_path": "/fOJluBqkLJr1DO7s9r7FSoHjf2B.jpg",
               "id": 90341,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Artie",
               "gender": 2,
               "credit_id": "52fe47249251416c7508f0cd",
               "name": "Steven Gilborn",
               "profile_path": "/qNLTKsZHulKV1Twni0wv9By6KLj.jpg",
               "id": 31032,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Mrs. Winthrop",
               "gender": 0,
               "credit_id": "52fe47249251416c7508f0d1",
               "name": "Lois De Banzie",
               "profile_path": null,
               "id": 159747,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Mrs. Feldman",
               "gender": 1,
               "credit_id": "52fe47249251416c7508f0d5",
               "name": "Natalie Core",
               "profile_path": null,
               "id": 119711,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Bellman",
               "gender": 1,
               "credit_id": "58fec917c3a3685373002aa1",
               "name": "Paula Malcomson",
               "profile_path": "/mqiiy0HXExPYaIczPxWFRDGqhwA.jpg",
               "id": 47533,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Special Vocal Effects (voice)",
               "gender": 2,
               "credit_id": "5ab7267e9251413955015778",
               "name": "Frank Welker",
               "profile_path": "/b3gImArbw13mMKJIe9leFc9YYb7.jpg",
               "id": 15831,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47239251416c7508f08d",
               "name": "Ken Kwapis",
               "profile_path": "/oPjor2KnZcSXmtude62KT62yBsu.jpg",
               "id": 29009,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47239251416c7508f09f",
               "name": "John Hopkins",
               "profile_path": "/t6GU4tIgTi01efkHz0gbyDfZnw7.jpg",
               "id": 9953,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe47239251416c7508f0a5",
               "name": "John Hopkins",
               "profile_path": "/t6GU4tIgTi01efkHz0gbyDfZnw7.jpg",
               "id": 9953,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58fb9562c3a36879f400f38a",
               "name": "Jon Poll",
               "profile_path": null,
               "id": 10395,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58fb954892514163e30112e4",
               "name": "Bruce Graham",
               "profile_path": null,
               "id": 181904,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58fb9553c3a36879be010df5",
               "name": "Miles Goodman",
               "profile_path": null,
               "id": 63964,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58fb955a925141643c010b31",
               "name": "Peter Lyons Collister",
               "profile_path": null,
               "id": 20823,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5aa5497fc3a3687c130217ba",
               "name": "Rick Newsome",
               "profile_path": null,
               "id": 1996002,
               "department": "Art",
               "job": "Storyboard Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.596573,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17414,
      "vote_count": 65,
      "budget": 16000000,
      "overview": "Hotel manager Robert Grant is forced by his boss to postpone his family vacation when a hotel critic checks in. Trouble is, the critic is really a villainous jewel thief with an orangutan assistant named Dunston. When Dunston gets loose and tries to escape a life of crime -- aided by Robert's sons -- havoc, hijinks and lots of laughs abound!",
      "similar": [
         754,
         562,
         1572,
         1573,
         13310,
         258230,
         1654,
         9739,
         1433,
         9208,
         15907,
         24056,
         13339,
         70821,
         49397,
         292044,
         44697,
         246115,
         453064,
         72508
      ],
      "original_title": "Dunston Checks In",
      "runtime": 88,
      "poster_path": "/mvbJSNMRzM7epjeJMT3vFxXydQJ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Joe Wizan/Todd Black",
            "id": 3311,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-01-12",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "He's about to turn a Five Star Hotel into a three ring circus.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Kwapis"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "John Hopkins",
         "John Hopkins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116151/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2OTI4ODAxMl5BMl5BanBnXkFtZTcwODUzMzYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jason Alexander, Faye Dunaway, Eric Lloyd | See full cast and crew »"],
      "reviews": [
         "This was surprisingly entertaining and with a few minor exceptions, very inoffensive family fare. It's another one of those adults-and-kids can enjoy flicks with a number of lines that border on being too much for kids but are still tame for adults - close, but safe. There are also some funny special effects and some good slapstick humor. Being basically a kids' film, the main child, played by Eric Lloyd is cute but a little too spoiled for me but he's tolerable, as is his brother. Jason Alexander is the father, a very likable subdued guy but a little too lenient. The real surprise in this cast is Faye Dunaway. Usually playing hard-edged types, she is the opposite in here which is kind of refreshing to see. She shows a nice comedic touch. The chimpanzee is probably the most entertaining, which is the idea, but so is the villain played by Rupert Evert. In other words, there are a lot of likable characters in this movie. This a \"sleeper:\" an underrated film that a lot of people would enjoy. I'm sorry it never got much \"press.\"",
         "First, let me say what this is not. This is not a movie with high artistic quality. Even when one reminds oneself of the fact that it is meant as a simple comedy, probably a family comedy, it still has a plot with too many coincidences (so many that they become predictable - now the monkey is here, she will not be looking, but when it's gone, and the man comes in, she will) and flat, caricatural characters. But it also is not supposed to be a high-quality movie. It's supposed to be funny. And funny it is. The movie is full of funny ideas, all worked out in a good, classy manner. Even the basest of jokes are done in good style. Just relax - and laugh. And you'll keep laughing through most of the movie. The monkey (that's a negative point - technically an urang utan is an ape, not a monkey) is well in its place as a comedy actor, and as said - the ideas are good, the working-out is even better. Not 'the best movie you'll ever see', not even close. Not a 'must-see movie'. But a very pleasant way to spend 90 minutes. And enjoyable for both adults and children, that's worth something too.",
         "1995 and 1996 were clearly the years for movies dealing with primates. \"Ed \"in 1996 taught us that heroes come in all shapes, and all sizes. Congo (1995) taught us that apes could be both intelligent and evil. Let's not forget 1995's \"Born to be Wild\", where a teenage boy and female gorilla's near bestiality captured all our hearts. However, not since the original \"Planet of Apes\" has a movie captivated our attention, and made us feel what it's like to be a monkey. \"Dunston Checks In\" set the bar for years to come. Sam the orangutan's performance as Dunston is both hilarious and heartbreaking. Blockbuster actors such as Ben Affleck and James Franco could learn a lesson or two from Sam. You think Ben Affleck was emotional when he said \"I love you\" to Bruce Willis in Armageddon? Think again. When Sam looks at the picture of him and his now dead brother, his expression alone brings a tear to ones eye. You think James Franco was in pain in Spider-Man 2 when he realized his best friend was the man who killed his father? Try watching Sam when he is getting a piece of glass torn from his flesh. Sam's connection with the audience is so great you almost feel the glass being ripped from your own hand. This is not to mention the other wonderful qualities this movie has. Amazing slapstick comedy, alcoholic older women, Jason Alexander cursing, Faye Dunaway's fall from grace, an orangutan spanking a prominent socialite, and a cameo from Paul Reubens that can only be explained with two words: Oscar worthy. The fact that this film did not win any Academy Awards is shocking. Five for sure: Paul Reubens beating out Cuba Gooding Jr. and James Woods for Best Supporting Actor, \"Dunston Checks In\" narrowly defeating \"The English Patient\" for Best Picture, Ken Kwapis for Best Director, Best Music Robert Blackwell, and lastly, a landslide victory for Sam, the orangutan for Best Actor. It is criminal that the Academy shafted this great film in 1996 with no Oscars and zero nominations. Although it was given no Oscars this much can be certain: it set the standard and paved the way for future primate movies. Where would MVP: Most Vaulable Primate and MXP: Most Xtreme Primate be without Dunston Checks In? In some Hollywood executive's trash, that's where. Because of pioneer movies like \"Dunston Checks In\" movies like MVP and MXP enjoy much commercial success. So grab your kids, round up the neighbor, pop some popcorn, and get ready to laugh, and cry at one of the best movies in the last twenty years: \"Dunston Checks In\".",
         "Very unique plot, well acted, well directed and highly recommend! Good film for the entire family! The title and leaders might be deceiving, but what kid (or adult) doesn't love a monkey making a monkey out of snooty adults? Jason Alexander (George from \"Seinfeld\" being the responsible, single father of two boys and manager of a major hotel is stretch, at least initially due to his stereotype; however, after watching it a half hour you forget that it is \"George\" and get involved with the other characters. Another reason to watch is to see Faye Dunaway's amazing post-op face lift and Pee-wee Herman as the \"Animal Catcher\"? Good, clean fun for the whole family!",
         "This film is obviously never going to be a monumental classic for all time, but it's quite underrated just the same. The story is simple. A four star hotel (run by Alexander, who lives there with his two sons) is up for a prestigious fifth star in the ratings guide when a jewel thief comes to visit, utilizing an orangutan as his accomplice. The fire-breathing owner turns on the heat to succeed while all hell breaks loose thanks to the primate. There seems to be something for everyone in it. The film begins with a lot of class as the various accoutrements of the hotel are featured. Kids should adore the orangutan \"Dunston\" and be able to identify with young Lloyd as his pal. Seinfeld fans should enjoy watching Alexander face all sorts of turmoil and hubbub as the harried hotel manager. Everett is comic in a grand, old-style sort of way with wrinkles, false teeth and a very threatening cane. There are a number of very talented supporting players who add to the comedic flair of the movie (Shadix, Bassey.) Even former \"Pee Wee\" Reubens has a cameo as a very aggressive exterminator. The end-all, be-all, though, is Dunaway. As the Leona Helmsley-esque, ultra-demanding, hyper-glamorous hotel owner, she walks off with the film and shows a rare funny side. It's not every day you see Dunaway with pink cake and icing all over her face. She cuts loose with a game, vivid, aware comedic performance which echoes all the neurotic, bitchy roles she used to play, but gave up after the stigma of \"Mommie Dearest\" wouldn't wear off. Somehow this missed at the box office, but it is perfect family entertainment for home video.",
         "The story goes like this--Robert Grant (Jason Alexander) is a father to two kids, Kyle Grant (Eric Lloyd) and Brian (Graham Sack). He is the Manager of a hotel that's owned by Mrs. Dubrow (Faye Dunaway) and she promises Robert of some days holiday and a hike in pay and scale if he can convince a visiting undercover reviewer that their hotel is suited to be 6 star. Here enters into the frame Lord Rutledge (Rupert Everett), a thug and crook with intention of stealing jewelry and along with him comes his partner - an orangutan named Dunston!! All the drama unravels when Dunston tries to get out of Rutledge's world of crime and in his mission he gets help from Kyle and Brian. Of course the most appealing part of the film is the Orangutan. He really looks cool and has performed superbly . The other guy who adds an element of humour to the story is Lionel Spalding (Glenn Shadix), the real undercover reviewer. Overall, the film is simple, a bit humorous with no exceptional performances. You only watch this movie for the monkey as apart from that there is nothing new to watch out for in this movie. You can give it a miss if you are expecting a bit too much !!!",
         "After a career entailing \"Bonnie and Clyde\", \"Little Big Man\", \"Chinatown\", \"Three Days of the Condor\" and \"Network\", might it seem really low for Faye Dunaway to act in a movie like \"Dunston Checks In\"? Maybe, but the movie pretty much understands what sort of movie it is: silly, harmless fun. As it is, Faye Dunaway plays the same kind of character that she played in \"Network\", only bitchier. And if it seems that I try too hard to analyze a movie like this, so be it. Above all, I still consider Faye Dunaway REALLY hot! And I'm sure that I always will. Also starring Jason Alexander, Rupert Everett and Paul Reubens (aka Pee-Wee Herman).",
         "This is one of the finest films I have ever seen. Jason Alexander, Faye Dunaway, and Rupert Evert are all brilliant actors who make this thing work. Paul Reubens puts in a hilarious performance as the crazy animal control specialist La Farge. I guarantee than anyone who sees this movie will laugh from start to finish at all the monkey-mayhem created by Dunston, the lovable but mischievous orangutan. Everyone should see this movie.",
         "This is the sort of light caper that is nothing special but does provide some harmless fun for kids who will undoubtedly get more of a kick out of an Orangutan's shenanigans than an adult will--although there are some very clever moments that fill the bill for young and old. JASON Alexander is expert as a hotel manager with two bratty kids who seem to have nothing better to do than make mischief as they cavort around the hotel with an unexpected guest. Seems that a jewel thief (RUPERT EVERETT) has checked in with his pet who's been trained to steal. This sets up the structure of the plot which has the kids and the Orangutan as the main focus of attention. It's fun to see FAYE DUNAWAY enjoying herself in a comic role and everyone else enters nicely into the spirit of the whole thing. Easy to take and passes the time quickly with a few very clever moments among the many vignettes involving some cute stunts.",
         "I don't know about being better than Monkey Trouble, however it is UP THERE. \"DCI\" better known as Dunston Checks In, is by far one of the best movies ever. We all know monkeys have a special place in our hearts but Dunston manages to steal EVERYONES hearts, criminals and mean people alike. He gets in this silliest predicaments and can make a mess of anything! (But hey that's what monkeys do, right?) Anyways, at the movie-renting place (am I allowed to type Blockbuster?) tonight I was very tempted to rent this film, however, I had to stick with Baby's Day Out. But DCI has my vote for sure next movie night. To sum it up, if monkeys could speak, they'd be hollering \"DCI!\" for years to come."
      ],
      "genres": [
         "Comedy",
         "Adventure",
         "Family"
      ],
      "productionCompanies": [
         "Joe Wizan/Todd Black",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Robert's a beleaguered concierge of the luxury hotel owned by Mrs. Dubrow. She tells Robert an undercover reviewer is coming and to look sharp. If he does well he might get a promotion and some time off to take his sons, Brian and Kyle, on vacation. But then the villainous jewel-thief Rutledge checks in with his specially trained orangutan, Dunston. And when Dunston gets loose and tries to escape a life of crime with the help of Brian and Kyle, things go just a little lunatic.",
         "The Majestic Hotel is a 5 star luxurious establishment, and Manager Robert Grant is devoted to keeping his guests happy. However his sons, Brian and Kyle are quite the opposite, troublesome and mischievous. Robert discovers for the chairman of the hotel that a Sixth star could be rewarded to the Majectic Hotel, if a representative is impressed, and this representative is an undercover guest of the Majestic Hotel. But then Lord Rutlidge and his well-trained Monkey, Dunston, check into the hotel. Dunston is trained as a jewel thief by his violent owner, Rutlidge, and Dunston attempts to escape a life of crime and with the help of Kyle and Brian, might just destroy the chances of the hotel becoming a 6-star.",
         "Young boy befriends larcenous orangutan in luxury hotel."
      ],
      "budget": 0
   },
   "movielensId": 87,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Pусский"
      ],
      "releaseDate": "1996-01-12",
      "dvdReleaseDate": "2002-05-28",
      "directors": ["Ken Kwapis"],
      "runtime": 88,
      "movieId": 87,
      "title": "Dunston Checks In",
      "mpaa": "PG",
      "actors": [
         "Jason Alexander",
         "Faye Dunaway",
         "Eric Lloyd",
         "Rupert Everett",
         "Graham Sack",
         "Paul Reubens",
         "Glenn Shadix",
         "Nathan Davis",
         "Jennifer Bassey",
         "Judith Scott",
         "Bruce Beatty",
         "Danny Comden",
         "Steven Gilborn",
         "Lois De Banzie",
         "Natalie Core",
         "Paula Malcomson"
      ],
      "imdbMovieId": "0116151",
      "originalTitle": "Dunston Checks In",
      "genres": [
         "Adventure",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["FjPueQfeQLs"],
      "plotSummary": "Hotel manager Robert Grant is forced by his boss to postpone his family vacation when a hotel critic checks in. Trouble is, the critic is really a villainous jewel thief with an orangutan assistant named Dunston. When Dunston gets loose and tries to escape a life of crime -- aided by Robert's sons -- havoc, hijinks and lots of laughs abound!",
      "tmdbMovieId": 17414,
      "avgRating": 2.40744,
      "releaseYear": "1996",
      "numRatings": 1102,
      "posterPath": "/mvbJSNMRzM7epjeJMT3vFxXydQJ.jpg"
   }
}