{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sea",
            "id": 658
         },
         {
            "name": "boat",
            "id": 1422
         },
         {
            "name": "fishing",
            "id": 1495
         },
         {
            "name": "rogue",
            "id": 186447
         }
      ],
      "imdb_id": "tt0119214",
      "video": false,
      "title": "Gone Fishin'",
      "recommendations": [
         53287,
         29973,
         19324,
         13997,
         17207,
         20678,
         13982,
         12518,
         18495,
         67307,
         39128,
         27224,
         12475,
         11310,
         12661,
         27281,
         19382,
         19819,
         26258,
         106143
      ],
      "backdrop_path": "/r2fk4TmcB2hMozeSLzUg7yUaaSU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joe Waters",
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad07b",
               "name": "Joe Pesci",
               "profile_path": "/2CaYAhUZgkAeqtpIzuqGcqArsOy.jpg",
               "id": 4517,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gus Green",
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad07f",
               "name": "Danny Glover",
               "profile_path": "/jSNTEnm0Sxm8FRtoBfJmhmQyozH.jpg",
               "id": 2047,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe44d6c3a36847f80ad083",
               "name": "Rosanna Arquette",
               "profile_path": "/rQMQYQUF9QzD6oDfkP6tsjmyZhS.jpg",
               "id": 2165,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Angie",
               "gender": 1,
               "credit_id": "52fe44d6c3a36847f80ad087",
               "name": "Lynn Whitfield",
               "profile_path": "/vl99aENfo3wOBWJVvOVj0uIUNfL.jpg",
               "id": 16217,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Billy 'Catch' Pooler",
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad08b",
               "name": "Willie Nelson",
               "profile_path": "/7HmvoLTxsoa9VWsy8s25il0sYtF.jpg",
               "id": 8261,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Bubba",
               "gender": 0,
               "credit_id": "52fe44d6c3a36847f80ad0cb",
               "name": "James R. Greene",
               "profile_path": null,
               "id": 214540,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Diner Patron",
               "gender": 1,
               "credit_id": "54dc575c925141619e00321b",
               "name": "Deborah Smith Ford",
               "profile_path": "/pJlfZ9b5LIpWu6B1QEklEKExHpq.jpg",
               "id": 1426254,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad091",
               "name": "Christopher Cain",
               "profile_path": "/atUMxA5Anavwqdd5tH3B3S8ayli.jpg",
               "id": 56828,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad097",
               "name": "Roger Birnbaum",
               "profile_path": null,
               "id": 4504,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44d6c3a36847f80ad09d",
               "name": "Julie Bergman Sender",
               "profile_path": null,
               "id": 56829,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad0a3",
               "name": "J.J. Abrams",
               "profile_path": "/uiEVOx3QclxnN76t8PU6v5IcUUP.jpg",
               "id": 15344,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d6c3a36847f80ad0a9",
               "name": "Jill Mazursky",
               "profile_path": null,
               "id": 51639,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d6c3a36847f80ad0af",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad0b5",
               "name": "Dean Semler",
               "profile_path": "/AnqGebF9LTL5mkertSBIegQvlB7.jpg",
               "id": 4501,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad0bb",
               "name": "Jack Hofstra",
               "profile_path": null,
               "id": 21811,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d6c3a36847f80ad0c1",
               "name": "Christopher Cain",
               "profile_path": "/atUMxA5Anavwqdd5tH3B3S8ayli.jpg",
               "id": 56828,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44d6c3a36847f80ad0c7",
               "name": "Lizzy Gardiner",
               "profile_path": null,
               "id": 15329,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.424418,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9054,
      "vote_count": 52,
      "budget": 53000000,
      "overview": "Two fishing fanatics get in trouble when their fishing boat gets stolen while on a trip.",
      "similar": [
         2756,
         205775,
         9836,
         166426,
         127380,
         36970,
         10865,
         587,
         1865,
         109424,
         26466,
         228165,
         10144,
         810,
         10191,
         10555,
         35056,
         158,
         12,
         71805
      ],
      "original_title": "Gone Fishin'",
      "runtime": 94,
      "poster_path": "/blNI9KqOM7YPULEnOCcOS1cIvW7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Roger Birnbaum Productions",
            "id": 961,
            "origin_country": ""
         }
      ],
      "release_date": "1997-05-30",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Even the fish are laughing!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christopher Cain"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Jill Mazursky",
         "J.J. Abrams"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119214/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0NDI0OTc4M15BMl5BanBnXkFtZTcwMzYxNjUyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Pesci, Danny Glover, Rosanna Arquette | See full cast and crew »"],
      "reviews": [
         "This was \"Dumb and Dumber\" without the crudeness and profanity. That doesn't mean it's an award winner: it's pretty stupid, but it is refreshing to see a movie in which both Joe Pesci and Danny Glover star and never utter a profane word! Unbelievable! And you can add Rosanna Arquett to that list, too, and she wasn't exactly Mother Teresa in a lot of films. The professional critics totally lambasted this film, which wasn't altogether fair, either. It is refreshing in its innocence (something critics know nothing about) and it has its funny moments. Best of all it's entertaining. Yes, this is \"Lightweight\" with a capital \"L\" but I've seen a whole lot of films that were the opposite and total garbage. At least you watch this with your kids and have some laughs. What's wrong with that?",
         "Don't listen to the cynics. Gone Fishing was pretty fun. There is nothing mean spirited here just a a funny flick about two guys who go on a fishing trip. I know it is fashionable to blast this film. I heard so much negative stuff that I almost did not rent it. If you are looking for comedy based on satire, parody, insults, or crude situations you will not find it here. This is just a fun movie with no agenda which makes it a rarity. This film is more in the spirit of Out to Sea, Grumpy Old Men, Road to Hong Kong or even Legally Blonde. Gone Fishing is worth a rental.",
         "While this certainly isn't your typical Joe Pesci movie, I found it highly amusing. Joe and Gus (Pesci and Glover) find themselves in the most absurd situations...but the characters are so darn likable you really WANT things to work out OK for them! It's a family-friendly (no cursing at all!) FEEL GOOD movie! Seriously, this movie is a fantastic \"pick me up\" after a rough day...I strongly recommend it. Even found myself not minding Willie Nelson in this flick (he plays the pro fisherman Joe and Gus admire). \"We're lucky, Joe. We have great families, our wives love us, we go to church, we work hard...all we want is to go fishing. Can we help it that everything goes wrong around us?\"",
         "Hi; I enjoyed this movie (more than the crap on the tube this season); I even \"suspended disbelief\" once or twice. This might not be the best showcase for any of the main actors talents. We know what is about to happen at every turn, and yet this film feels as comfortable as a well worn pair of shoes, the ones that you only wear to cut the grass or do your bar-B-Quing, the ones that despite your wife's protestations, remain hidden away, awaiting that next perfect summers day. Nice endearing characters, some good ol' fashioned slapstick, a few good laughs and Willie Nelson; what could be better. Glenn Don't expect much, just make some popcorn, sit back and enjoy the film.",
         "Ok, why's this film get a bad rap? I saw it and enjoyed it thoroughly. Not very often in these days do you get a film like this. It's a comedy without poop jokes, sexual innuendo or foul language. And you know what? It's truly funny. The innocents Joe Pesci and Danny Glover project, mixed with the wacky situations they get mixed up in, is truly hilarious. Not only did I find this film a laugh filled feel-good comedy, but its one of the few comedies of the 90's that I would feel OK about my little brother watching it with me. There is nothing bad about this film. Sure; the script is silly, and the plot is inane, but the movie itself projects an innocent fun that can be enjoyed by people of all ages. Sure, if you're looking for a comedy akin to American Pie or Something About Marry, you won't find anything to your liking here. However, if you want a clean fun comedy with wacky antics and a good fun plot, this will work great.",
         "This film is not as bad as it is made out to be. The direction may be slightly dodgy in parts, but the presence of Joe Pesci and Danny Glover and some amusing moments for example, the boat crashing through the window and the boys' capture of the enemy at the end make this a watchable film for most age groups",
         "All I can say about this movie is that i'ts a great time-killer. I would rent it if I saw it in my video store, and personally I think it's very funny despite the reviews it got. If you're a fan of comedy or even just a fan of Pesci or Glover, give it a try!",
         "This one is up there in contention for the worst movie I've ever seen. To put that in perspective, I've seen \"Freddy Got Fingered\", \"Food Fight\", and \"Romy and Michelle's High School Reunion.\" All of which are contenders as well. But I digress. This turd nugget is howlingly bad. I walked out of it at a $1 theater and felt ripped off. The acting is sub par, the writing worse, and the story... There's a story? Really? Seems like a bunch of people got together and got really stoned and thought that making a \"Dumb & Dumber\" ripoff with Glover & Pesci was somehow a good idea. It wasn't.",
         "One of the worst comedies of all time. Amazing how such a talented cast could turn in performances almost as pathetic as the script. I only registered with IMDb so that I could vent on this atrocity. Glover and Pesci play characters that come off as \"mentally challenged\", making this whole movie feel like a cruel assault on the disabled. While I am sympathetic to those who feel there is too much foul language, gratuitous sex and potty humor in movies, that is not enough reason to reward this debacle with even one star. Makes any episode of Gilligans Island feel like Dennis Miller live. If you're laughing at this movie, I really think you have a problem.",
         "According to Murphy's law, \"anything that can go wrong, will go wrong\", and that is basically what happens with Joe and Gus for most of the time. These two fellas intend to go for a fishing, but things don't go according to plan, delivering a lot of bad situations-- which aren't that bad, since both characters are optimist. What amazes me the most is how the humor scenes are filled with original jokes, like the scene in which they are in the first restaurant making their orders like a homosexual couple, and not paying attention that everybody around them felt that way. It's funny how filmmakers portray them like two very innocent guys that end up succeeding in getting the prize-- in fact, the smaller prize-, making you feel like there's no need to be a smart pants to be rewarded. I read some criticism towards the acting, but in my point of view, the whole cast is professional, and the main actors are even a little above average. Besides, the plot is fast paced, never tiring the spectator. Also, it's a BIG personal coincidence that they mention 1972's \"Deliverance\", given that I was just about to watch that movie, but preferred catching what was on cable. All in all, \"Gone Fishin'\" is surely a feel good movie that have been hidden from mainstream since it was released, but it's hard for you to not enjoy it!"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Hollywood Pictures"
      ],
      "summaries": [
         "Two working-class buddies, Joe and Gus, win a contest and get a free fishing trip. When they arrive, everything goes wrong - hurricanes, stolen car, blow-ups and other catastrophes follow them.",
         "Joe and Gus are established early on as two of life's losers. As children, they are shown in opening sequences blowing up an industry as they toss a cigarette in an open pipe. Years later, as adults they get to go on a fishing vacation that you know has to go wrong. First, they are conned out of their car keys by a con man killer, who preys on older women. As they give pursuit, they team up with two young women who are also after the killer who took all of Arquette's mother's jewelry and money. Many disasters later, the two are faced with the killer and all of his loot. Willie Nelson makes a brief appearance as a philosopher fisherman that the two amateur fishermen worship.",
         "Two fishing fanatics get in trouble when their fishing boat gets stolen while on a trip."
      ],
      "budget": 53000000
   },
   "movielensId": 870,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-05-30",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Christopher Cain"],
      "runtime": 94,
      "movieId": 870,
      "title": "Gone Fishin'",
      "mpaa": "PG",
      "actors": [
         "Joe Pesci",
         "Danny Glover",
         "Rosanna Arquette",
         "Lynn Whitfield",
         "Willie Nelson",
         "James R. Greene",
         "Deborah Smith Ford"
      ],
      "imdbMovieId": "0119214",
      "originalTitle": "Gone Fishin'",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["Fiw6M7hmJ6A"],
      "plotSummary": "Two fishing fanatics get in trouble when their fishing boat gets stolen while on a trip.",
      "tmdbMovieId": 9054,
      "avgRating": 2.24547,
      "releaseYear": "1997",
      "numRatings": 497,
      "posterPath": "/blNI9KqOM7YPULEnOCcOS1cIvW7.jpg"
   }
}