{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "sympathy",
            "id": 155393
         }
      ],
      "imdb_id": "tt0113542",
      "video": false,
      "title": "Killer: A Journal of Murder",
      "recommendations": [
         51557,
         75657,
         366622,
         13670,
         15727,
         37774
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Carl Panzram",
               "gender": 2,
               "credit_id": "52fe4995c3a36847f81a1f7b",
               "name": "James Woods",
               "profile_path": "/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg",
               "id": 4512,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Henry Lesser",
               "gender": 2,
               "credit_id": "52fe4996c3a36847f81a1f87",
               "name": "Robert Sean Leonard",
               "profile_path": "/90xoBVpR2LzaFdo83KmcxjXR7Dg.jpg",
               "id": 2692,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Esther Lesser",
               "gender": 1,
               "credit_id": "52fe4996c3a36847f81a1fa1",
               "name": "Cara Buono",
               "profile_path": "/8nK8PSGTfDr3GtqdgUcWwbSlyJX.jpg",
               "id": 20047,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Elizabeth Wyatt",
               "gender": 1,
               "credit_id": "52fe4995c3a36847f81a1f7f",
               "name": "Ellen Greene",
               "profile_path": "/nJzE8dS38hxbALr5LZ88BYt8dm0.jpg",
               "id": 13420,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "R.G. Greiser",
               "gender": 2,
               "credit_id": "52fe4996c3a36847f81a1f9d",
               "name": "Robert John Burke",
               "profile_path": "/ctVRWqY0KfSBIpaGulJMbhyE3jy.jpg",
               "id": 31512,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Woman in Speakeasy (uncredited)",
               "gender": 1,
               "credit_id": "52fe4996c3a36847f81a1f83",
               "name": "Lili Taylor",
               "profile_path": "/pIJ4Enx6kIC9srLkDfGpEzfNlDZ.jpg",
               "id": 3127,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Teenaged Carl Panzram",
               "gender": 0,
               "credit_id": "55ba760bc3a3684af500481d",
               "name": "Seth Romatelli",
               "profile_path": "/enNuQXZRkESHlaEgHI2ea5kJd7n.jpg",
               "id": 1491922,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4995c3a36847f81a1f77",
               "name": "Tim Metcalfe",
               "profile_path": null,
               "id": 69042,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4996c3a36847f81a1f8d",
               "name": "Thomas E. Gaddis",
               "profile_path": null,
               "id": 13777,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4996c3a36847f81a1f93",
               "name": "James Long",
               "profile_path": null,
               "id": 134572,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4996c3a36847f81a1f99",
               "name": "Tim Metcalfe",
               "profile_path": null,
               "id": 69042,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.322463,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 59569,
      "vote_count": 13,
      "budget": 0,
      "overview": "Carl Panzram is sent to Leavenworth Prison for burglary. While there, he is brutally beaten by a guard. Neophyte guard Henry Lesser feels sympathy for Panzram, befriends him, and gets him to write his life story. Lesser learns that Panzram's past is much more violent than he thought, but also that he's capable of being a much better person than the rest of the prison staff believes - or so Lesser thinks.",
      "similar": [
         1696,
         769,
         339692,
         2832,
         10285,
         984,
         21950,
         274,
         294963,
         1991,
         1701,
         431,
         948,
         238636,
         107846,
         9093,
         1359,
         6075,
         5925,
         1949
      ],
      "original_title": "Killer: A Journal of Murder",
      "runtime": 91,
      "poster_path": "/bGhq64TzH7i1jSmK0tYHbDmgzVQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Breakheart Films",
            "id": 15123,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ixtlan Productions",
            "id": 525,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-06",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Liar. Thief. Murderer. He hated all of humanity, himself most of all.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Tim Metcalfe"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Thomas E. Gaddis",
         "James Long"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113542/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1OTcxMTYzN15BMl5BanBnXkFtZTcwMjYwNDAyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: James Woods, Robert Sean Leonard, Ellen Greene | See full cast and crew »"],
      "reviews": [
         "There's something about a prison movie that's absolutely fascinating, I guess otherwise they wouldn't make the damn flicks. Maybe the safe look behind the bars is more convenient than actually being in a dark cell. \"Killer: A Journal of murder\" isn't just a prison movie, it's much more. It's an examination of the whole system. I decided to watch this movie accidentally because at the time there wasn't anything more interesting going on in the TV. My choice gave me a chance to see a fine film and an interesting journey to a criminal mind. This is rather a strange film because it shows what kind of a brutal monster James Woods' character Carl Panzram is (murderer and rapist to start with) and it doesn't leave unclear any of his acts of cruelty. Then it makes the audience feel empathy for him. As far as I've seen, movie rarely makes the audience feel sorry for the bad guy - at least as bad as in this case. James Woods has an excellent role and his performance is one of the most notable of his career. I'm glad I watched the flick, it's always nice to find a whole new side in an already familiar actor. \"Killer: A Journal of murder\" is certainly a film to watch.",
         "Carl Panzram was a viscous creep with a real life bite-your-face-off attitude. Woods played him to smithereens. Sure he overacted a bit, but Panzram was not the most laid-back guy. The problem with this film is that it couldn't decide if it was a character study or a condemnation of prison conditions. They also managed to throw in religious bigotry and left-wing politics. It did it better than some films would have, but the ending left too much open. Woods owned the film. He had Carl as both Genius and loose cannon. The real Panzram was similar. And many quotes contributed to him are scattered about the film. (\"I wish you all had one neck...\" \"I could hang a dozen men...\") Leonard did an adequate job as Henry Lesser but played him a bit to \"nice.\" Most of the guards kept their distance from ol' Carl. With good reason too. Woods fans see this now. Anyone else...your call.",
         "Don't get me wrong; this movie is worth at least one viewing. James Woods - as usual - is great in his performance, and the supporting cast is good, too. Killer: A Journal of Murder is based on Thomas Gaddis' and James O. Long's fascinating 1970 book of the same name. It contains many of the letters Panzram wrote to Henry Lesser (who was a Washington, D.C. jail guard, not a prison guard at Leavenworth) while he was on death row in Leavenworth. While it is a common practice for films to take artistic liberties when dealing with true stories, this film went a bit far in trying to make Carl Panzram (Woods) into a sympathetic character. True, Carl Panzram was the product of a barbaric prison system, but he stands out in history as one of the few arch-criminals who did not want sympathy, something this film ignores. This was a film that needed to be made, but unfortunately, the story was mishandled in a maudlin attempt to get the viewer to care about one of the most reprehensible human beings who ever lived. If they had wanted to make a biographical film to convey their particular message, the people responsible for this movie should have made a film about Caryl Chessman, a criminal more eloquent, tragic and - most importantly - far more sympathetic than Carl Panzram.",
         "(SPOILERS) Sure, I lover James Woods (who doesn't?), and he did the best he could with the script. But the film distorts Panzram way too much. I've read a detailed biography of every serial killer you can think of (Bundy, BTK killer, Chilakito, you name it) and violent criminals, but no one comes close to Panzram when it comes to hatred for humanity (all of it, himself included) and absolute lack of remorse. Yes, the movie's depiction of the abused he endured is accurate (but incomplete, he suffered far more), but the full extent of hatred and rage he indulged (in his book he recounts raping more than 1,000 men and boys, for example) is not shown here. By withholding information the film tries to make him sympathetic, and make Lesser reasonable (he was attracted to Panzram not just for altruistic reasons, fascination towards evil played a part as well, like the Bundy groupies during his trial and death row wait). But hey, don't take my word for it. Check www.crimelibrary.com in the serial killers section. His picture alone tell you the story. But all bull#$%& aside, it's still a good film, just keep in mind that it's a heavy sugarcoated version of the book.",
         "This movie seems more relevant today than ever. Prison conditions may have improved since the early part of the century, but prison populations are increasing exponentially and there seems to be no end in sight. Does punishment really prevent crime? Can harden criminals be rehabilitated? Is society to blame? Whatever your opinion, this is a short but must-see film.",
         "If you are into the genre, as I am, this is a perfectly acceptable film, Woods is fine in it, I feel people either love this guy, or hate him. Should not distract from the story and he is pretty good in it, I am in the love James woods camp. (Videodrome is awesome- all hail the new flesh-) But its not just Woods in this, all the supporting cast are good, it was filmed on a modest budget, but still retains that polished 90's edge to it, does not come across as cheap though. Give this ago if you have not seen it but do not be expecting something along the lines of silence or seven, you will be disappointed.I give it an 8, for the cast, the story and the time it was made in. And I will watch it again in another five years. On a side note, people should judge films a little better, rankings on this site are getting stupid, this is better than a lot of films getting a 9. And there are some film greats that are genre breaking that rank in below an 8, sort it out a little bit please, my fellow community.",
         "Tim Metcalfe's 'Killer: A Journal of Murder', which is based on the life of serial killer Carl Panzram, and uses passages of his biography, works because of one particular reason: James Woods. He plays Panzram, with terrific understanding & amazing ease. Woods, undoubtedly, was the Marlon Brando of the 1990's. 'Killer: A Journal of Murder' explores the journey Panzram. Panzram was a multi-faced person, he was unpredictable, unforgivable & very different, if I may say so. 'Killer: A Journal of Murder', though, not the most efficient take on a person so multi-faced, it at least tries to explore his vision. However, this film isn't as no-holds-barred as I thought it should have been. I thought there was a lack of emotional connect. Though it makes up for a viewing, thanks to Woods's terrific act, but as a whole of a motion-picture, it doesn't reach the level it could've. I was engaged at times, but Woods, well his performance left me thinking about what Panzram must've been thinking before he was hanged. Woods is a genius actor and 'Killer: A Journal of Murder' proves that fact right.",
         "James Woods is again at his best in this very interesting and captivating movie of one mans flight through life, comes to the sad ending he always thought he deserved. Befriended by only two people in his life, he truly had a heart under what everyone believed to be plain meanness.",
         "This movie wants to elaborate that criminals are a product of modern society. Therefore, can thieves, rapists and murderers (the Killer of this movie, Carl Panzram (James Woods), is all three and worse) be held fully accountable for their deeds? An interesting notion, but very difficult to bring to the screen in an intellectually and emotionally satisfying way. And this is where Killer: A Journal of Murder falls very short. Although the film tries to put Panzram's behaviour into perspective, with flashbacks to his violent youth and dysfunctional upbringing, the viewer never gets the idea that Panzram is a victim rather than a culprit. Sure, the system is corrupt, with one mobster occupying the whole sick bay of Leavenworth Prison (where most of the movie takes place), most prison guards are sadistic bullies, and the prison director something like a megalomaniacal despot. But why on earth does new prison guard Henry Lesser (Robert Sean Leonard) take such pity on Panzram? Even after having read his gruesome diaries? The movie offers some explanation: Lesser witnesses Panzram being beaten to a pulp by the most sadistic (and stereotypical) guard, and is impressed by Panzram's intelligence (though it isn't clear why exactly Lesser thinks this man is so smart). Surely this isn't enough to sympathize with a hostile man like Panzram, even though this movie tends to downplay his crimes and highlight his personality? Towards Lesser, Panzram is quite loyal, and the viewer is given the impression that for Lesser this outweighs all of the atrocities he has read about in Panzram's diaries. Does this man Lesser have so little friends that he takes at face value everyone who seems only remotely friendly to him? Perhaps it is Lesser who is a product of modern society, judging on appearance rather than substance. I can advise Monster, starring Charlize Theron and Christina Ricci, as a movie which handles roughly the same themes with far more integrity and scope. BTW: Killer looks as though shot for TV (not so good)",
         "The Australian biopic \"Chopper\" got all the hype in 2000, but the much lesser-known \" A Journal of Murder\" is actually a better film on a similar subject. For one thing, it gives you more of a background about (if not much more insight into) the killer, and for another it doesn't try to make him appear \"cool\". In fact, the script is quite uncompromising in the way it refuses to humanize Panzram, at least beyond the minimum degree required. But despite Woods' strong performance and a few nice directorial touches (especially in the use of black-and-white cinematography and newsreels from the period), the film is rather flat - almost like a TV production. (**1/2)"
      ],
      "genres": [
         "Biography",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Breakheart Films",
         "Ixtlan Productions",
         "Ixtlan"
      ],
      "summaries": ["Carl Panzram is sent to Leavenworth Prison for burglary. While there, he is brutally beaten by a guard. Neophyte guard Henry Lesser feels sympathy for Panzram, befriends him, and gets him to write his life story. Lesser learns that Panzram's past is much more violent than he thought, but also that he's capable of being a much better person than the rest of the prison staff believes - or so Lesser thinks."],
      "budget": 0
   },
   "movielensId": 874,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-06",
      "dvdReleaseDate": "2006-09-29",
      "directors": ["Tim Metcalfe"],
      "runtime": 91,
      "movieId": 874,
      "title": "Killer: A Journal of Murder",
      "mpaa": "R",
      "actors": [
         "James Woods",
         "Robert Sean Leonard",
         "Cara Buono",
         "Ellen Greene",
         "Robert John Burke",
         "Lili Taylor",
         "Seth Romatelli"
      ],
      "imdbMovieId": "0113542",
      "originalTitle": "Killer: A Journal of Murder",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["q5OQLgzGLAA"],
      "plotSummary": "Carl Panzram is sent to Leavenworth Prison for burglary. While there, he is brutally beaten by a guard. Neophyte guard Henry Lesser feels sympathy for Panzram, befriends him, and gets him to write his life story. Lesser learns that Panzram's past is much more violent than he thought, but also that he's capable of being a much better person than the rest of the prison staff believes - or so Lesser thinks.",
      "tmdbMovieId": 59569,
      "avgRating": 3.05357,
      "releaseYear": "1996",
      "numRatings": 84,
      "posterPath": "/bGhq64TzH7i1jSmK0tYHbDmgzVQ.jpg"
   }
}