{
   "tmdb": {
      "original_language": "cn",
      "keywords": [{
         "name": "martial arts",
         "id": 779
      }],
      "imdb_id": "tt0106544",
      "video": false,
      "title": "Project S",
      "recommendations": [
         40166,
         5742,
         18857
      ],
      "backdrop_path": "/c6JwcMcobTmJ45nJB7mH7HqSgIg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jessica Yang Jian Wa",
               "gender": 1,
               "credit_id": "52fe46ee9251416c91064701",
               "name": "Michelle Yeoh",
               "profile_path": "/OhW6BfeZBRn7iupeI8elngV2EN.jpg",
               "id": 1620,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "David Chang Fung",
               "gender": 0,
               "credit_id": "541da67f0e0a26124a008da0",
               "name": "Yu Rong-Guang",
               "profile_path": "/9LxWXXXJM8R0O9LGnec3ajURVfa.jpg",
               "id": 120725,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Insp. Lee Ming",
               "gender": 0,
               "credit_id": "541da68dc3a36801ad008a97",
               "name": "Emil Chow",
               "profile_path": "/iB3clq9RFG4odnyBXG497Gv7bWZ.jpg",
               "id": 931174,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Insp. Chan Ka Kui [Cameo]",
               "gender": 2,
               "credit_id": "52fe46ee9251416c91064705",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Busty Woman in Red [Cameo]",
               "gender": 2,
               "credit_id": "52fe46ee9251416c91064711",
               "name": "Eric Tsang",
               "profile_path": "/xJJZEKanRVgB7u5G3Fg7Xj9Fuoz.jpg",
               "id": 26724,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Annie May Lee",
               "gender": 1,
               "credit_id": "52fe46ee9251416c9106470d",
               "name": "Athena Chu",
               "profile_path": "/c0O8XWuDL82PotY8wyfSQrI13Jf.jpg",
               "id": 87942,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Kuo Shao Long",
               "gender": 0,
               "credit_id": "541da6c6c3a36837e600632a",
               "name": "Fan Siu-Wong",
               "profile_path": "/tFfXqPjqhVItv5lkUVtSMbw1SPd.jpg",
               "id": 130598,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Fung's man in hospital",
               "gender": 2,
               "credit_id": "541da6d50e0a261246009393",
               "name": "Joe Cheung",
               "profile_path": "/pJhqdK9bOOUwDTEJNn6UA1phUH5.jpg",
               "id": 1002925,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Inspector / Uncle Bill",
               "gender": 0,
               "credit_id": "541da6e40e0a2638e70069b4",
               "name": "Bill Tung",
               "profile_path": "/dE7UFkmJqs8PgUOkCTDDI69J90i.jpg",
               "id": 44922,
               "order": 8
            },
            {
               "cast_id": 6,
               "character": "Chuen",
               "gender": 0,
               "credit_id": "52fe46ee9251416c91064715",
               "name": "Dick Wei",
               "profile_path": "/sOhPtfy5nrDlxklZpJ374o3T2KV.jpg",
               "id": 62424,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Ho Chu",
               "gender": 2,
               "credit_id": "541da6f8c3a3683af8006298",
               "name": "Bowie Lam",
               "profile_path": "/rg23eEk6yva4a6VaQeHySiOrBVu.jpg",
               "id": 552084,
               "order": 10
            },
            {
               "cast_id": 7,
               "character": "Red Fighter [cameo]",
               "gender": 0,
               "credit_id": "52fe46ee9251416c91064719",
               "name": "Yukari Ôshima",
               "profile_path": "/mzwNJ56m0WaaLz7B1NLSaXMOrP1.jpg",
               "id": 81670,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Bank manager hostage [cameo]",
               "gender": 0,
               "credit_id": "541da7570e0a26123f009162",
               "name": "Maggie Chan Mei-Kei",
               "profile_path": "/x9vE6fqlxBPCIGIlIcD5NG5LVgN.jpg",
               "id": 1365929,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Cheung Ken",
               "gender": 0,
               "credit_id": "541da7640e0a260e9800887f",
               "name": "Ailen Sit",
               "profile_path": "/sA4EN7CitZa29FGNiZfIdmwrKv0.jpg",
               "id": 1277939,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Roger Davidson",
               "gender": 0,
               "credit_id": "541da7980e0a261235009366",
               "name": "Alain Guernier",
               "profile_path": null,
               "id": 1365930,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ee9251416c9106471f",
               "name": "Stanley Tong",
               "profile_path": "/sG4jGodAJpyymBEEODAc0D09bBG.jpg",
               "id": 44916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ee9251416c91064725",
               "name": "Mok Tang Han",
               "profile_path": null,
               "id": 1173612,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ee9251416c9106472b",
               "name": "Sui Lai Kang",
               "profile_path": null,
               "id": 1173613,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ee9251416c91064731",
               "name": "Stanley Tong",
               "profile_path": "/sG4jGodAJpyymBEEODAc0D09bBG.jpg",
               "id": 44916,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ee9251416c91064737",
               "name": "Michael Wandmacher",
               "profile_path": null,
               "id": 60102,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ee9251416c91064743",
               "name": "Stanley Tong",
               "profile_path": "/sG4jGodAJpyymBEEODAc0D09bBG.jpg",
               "id": 44916,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            },
            {
               "gender": 2,
               "credit_id": "58166f2d9251415abb01130f",
               "name": "Ardy Lam Kwok-Wah",
               "profile_path": null,
               "id": 65963,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.428578,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 38955,
      "vote_count": 12,
      "budget": 0,
      "overview": "As a crime wave sweeps through Hong Kong, the police call Jessica Yang (Yeoh), a rising star in the ranks, to help stop a notorious gang of thieves! What Jessica doesn't realize is that her boyfriend - recently discharged from the force - is the leader of this ruthless crime ring!",
      "similar": [
         9053,
         11841,
         55292,
         140300,
         233361,
         9461,
         44865,
         20811,
         146,
         605,
         24,
         604,
         682,
         9502,
         272,
         11770,
         98566,
         7549,
         1498,
         2024
      ],
      "original_title": "超级计划",
      "runtime": 104,
      "poster_path": "/fkytEZtIL4HhBg2S3w0doeLS0PI.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Golden Harvest Company",
         "id": 2521,
         "origin_country": ""
      }],
      "release_date": "1993-10-21",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/5qbfJzkMAUkFxcVo0dqnTRmpUoh.jpg",
         "name": "Police Story Collection",
         "id": 269098,
         "poster_path": "/zF4gP4w1xxM7jDKLjTDK3ixkkms.jpg"
      },
      "tagline": "Only One Force Can Stop This Crime Wave....And She's One Tough Cop!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stanley Tong"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Mok Tang Han",
         "Sui Lai Kang"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0106544/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5NTg2NzkxMl5BMl5BanBnXkFtZTcwMDI1MTEyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Michelle Yeoh, Rongguang Yu, Emil Chau | See full cast and crew »"],
      "reviews": [
         "This film is being billed in the USA as a Jackie Chan flick. Don't buy into the hype - Jackie has a short (2 minutes approx.) cameo in a scene that makes little sense and is hardly tied in to the rest of the film. His presence in drag is unexplained, and worse still his voice has been dubbed by somebody who apparently spent two hours at the dentist's before filming, and was still under the effects of the anaesthetic - or at least it seems that way. The rest of the film is passable - some good shots of Hong Kong and Guangzhou, but some glaring plot holes as well. Nothing to write home about, but a fairly good performance from Michelle Yeoh at least brings this up to a 5 out of 10 effort.",
         "\u0091Supercop 2', the sequel to \u0091Police Story 3: Supercop' from the same director Stanley Tong, is more than just a sequel. To me, it seems slightly superior to the (still of course very entertaining!) first movie. It has a different approach altogether, because the first movie was basically about full speed action and amazing stunts like we are used from Jackie Chan's movies. Michelle Khan in her role as a police officer from China helped him along. In some ways, it was a `buddy movie' with one buddy being an extremely tough girl! In the second movie, Michelle Khan is the star. Jackie only has a small guest appearance in a silly and unnecessary scene. \u0091Supercop 2' gets a lot more serious than its predecessor. The tragedy motif: Michelle realizes her ex-boyfriend has become a criminal and now works for a gang of high-tech bank robbers. The characterization is surprisingly detailed, down to small things like choosing a wrong present for someone you love but not completely understand, and the ending (Will she shoot him? Or will she let him escape?) had me sit on the edge of my seat... My favourite scene is Michelle's fight against one of the mercenaries: a 7 feet giant trying to hit a 5 feet girl, and you bet he's getting his butt kicked really hard \u0096 I've never seen something like this before. Hah, take this, Rambo! Probably this movie was an important step for Michelle Khan (a.k.a. Yeoh) on her way to the Bond movie `Tomorrow Never Dies'. Very recommendable, unless you only watch movies for being a Jackie Chan completist, and don't care about any other qualities in a movie, like a few other reviewers here seem to do, I'm afraid.",
         "Firstly, the script kicks ass! It's a local story, authentic dialogs, fast paced, straight forward and realistic, yet entertaining. Most of all, it got lots of authentic local cultures in it and it stands out. (Plz don't make movies just for the foreigners markets, draw foreign markets with your local culture - remember the success of Jackie Chan, Bruce Lee, Mr. Vampire series, & recently Pang Brothers movies???!!!) What stands out is the time frame of the storyline is longer than most movies out there in the same genre and yet you don't feel bored or awkward. All the actors and actresses' performances' are so natural and believable. Don't know why, but it makes it so much relaxing to watch. Even the cameos all ditched in and made the movie better bit by bit. Thirdly, the director is very smart in the sense that he acknowledged that he didn't have the luxury of getting the support from Jackie Chan's stuntmen group. Thus, you can't stuff the whole movie with those crazy stunts. Instead, he created a lot of exciting action scenes from various authentic settings - shoot em all scene from the worn down factory building, the underground banking, and the HK underground subway systems. It's jam packed with action, drama, terrific fight scenes. In all it's a great movie because everyone in the movie knows what they're doing and did very well. It may not have the Hollywood production $$$ but definitely more entertaining than their recycled story lines & movie stars. It's a celebration of HK movie during the 90s era! Top notch real S!#$% hk police action crime movie!!! 9/10!!! A must see! Go rent it today!!! (I bet Banlieue 13 stole some ideas from movies like this one =)",
         "Although not as good as the first, this film still contains plenty of action. The action is more shooting/explosions than martial arts though. About a bunch of terrorists and good guys kicking the crap out of them. Rated R: for Violence.",
         "This spin-off of \"Supercop\" is one of my favorite Hong Kong action movies. \"Once a Cop\" (\"Chao ji ji hua\") kicks off with a rousing high-energy title sequence and never lets up. The story is meatier than most action yarns: a Chinese policewoman (Michelle Yeoh) tracks a gang of bank robbers to Hong Kong, unaware that their ringleader is her fiancé, an ex-cop (Yu Rong-Guang). This intriguing set-up searches the emotions of the main character as it explores the cultural clash between get-rich-quick Hong Kong and the duty-bound mainland. There's also a sympathetic subplot about a Hong Kong cop who's attracted to Yeoh but feels intimidated by both her and her fiancé. The action sequences are all superbly executed, credibly grounding their martial arts in the actors' own athletic abilities (rather than falling back on wires and special effects). And Yeoh's graceful gymnastic prowess has never been used to better advantage. Unfortunately, not everything about \"Once a Cop\" clicks. The relationship between Yeoh and Yu isn't developed as deeply as it could be (though it's still more interesting than most action-movie romances), and it ultimately doesn't make the most of the premise's irony. Jackie Chan's cameo (reprising his \"Supercop\" role) is awkward and not well integrated into the story. And Alain Guernier as the central villain gives the worst impersonation of an Englishman I've ever seen (even if John Malkovich's Dr. Jekyll in \"Mary Reilly\" comes pretty darn close). But pound per pound - and punch per punch - \"Once a Cop\" is as thrilling and exciting as any reality-based martial-arts movie to come out of the Crown Colony. Anyone wowed by Michelle Yeoh's work in \"Tomorrow Never Dies\" should definitely check out this",
         "This film was released in 1993. I saw it not long after its release. I was very young when I first saw this film. Obviously, I felt compelled to watch it because Jackie was in it. However, as I first sat through the film, I thought it was extremely boring. The fight scenes were choppy. There were not many scenes that left indelible marks in my memory. Of course I have seen Michelle Yeoh in Supercop. But, I have never quite looked up to her as a great martial artist cum actress. * that is not to say that Michelle Yeoh is a completely untalented MA and actress though * Michelle's fighting style -- at least, her on-screen persona -- comprises of kicks and punches. That is normal. Yes, she would tumble, flip, leap, etc. These are normal too for Hong Kong film productions. But, the one critical element that sets Project S apart from other Hong Kong films -- Jackie's Police Stories included -- is the detailed storyline and plots. Her character, Yu Rongguang's, Emil Chau's, Fan Siu Wong's, and others were deftly crafted and executed. The scene where Michelle sprints to her bike on the parade field -- that is a beautifully done scene. For a military officer who has to remain steadfast in character, then suddenly runs because she was afraid of not being able to send off her lover, the act in itself speaks a lot about Michelle's character and the dramatic elements involved. The raid on the robbers' hideout at the shophouse was also a memorable scene. A team of former soldiers pitted against regular cops -- this scene should have no problems in enticing anyone to at least feel curious, to learn of the eventual outcome from the confrontation. Finally, the scene in the railway tunnel. Seeing Yu Rongguang's character at his end, his previous lies exposed; no longer was he the good man that he wanted Michelle's character to think he was. Then, to sacrifice himself for the sake of his lover, all these are emotional-ladened and intricate moments that uniquely distinguish Project S. This beautiful film subsequently concludes with a song sung by Emil Chau / Wakin Chau. I mean, how can anyone not feel anything when he / she sits through such a beautifully written film the like of Project S? :)",
         "Depending on your whereabouts in the world, this film may go under any one of the following titles: Supercop 2 (USA), Once a Cop, Police Story 3 Part 2, Police Story 4: Project S, Police Story V, Project S (UK), Supercop (also UK). Whatever the title, do not be fooled into thinking that this is a Jackie Chan film; yes, he does appear in the movie, but only briefly and in a scene that has absolutely nothing to do with the rest of the film. Michelle Yeoh, however, plays the same character as she did in Police Story 3 (which was known as Supercop in the US and did star JC\u0097are you keeping up?), a hard-as-nails mainland Chinese cop named Yang. She is called to Hong Kong to lend her expertise and assist in the apprehension of a gang of Chinese criminals who are pulling heists right left and centre and peeing-off the local cops. The police operations are going swimmingly until Yang recognises one of the criminals as Cheng Feng, her boyfriend from China who left for HK to find his fortune, and the two become reacquainted under somewhat difficult circumstances. With a decidedly routine plot, Project S needed to be something special in the action department in order to compensate, but despite some cracking fight action towards the end, there is far too much quiet time spent between bouts. The action is also geared towards gun-play rather than martial arts, so those expecting a full on fight-fest will be disappointed. That is not to say that Yeoh and co-stars don't display some wonderful skills from time to time; the high kicking action is pretty good when it happens\u0097it just doesn't happen often enough. The final half an hour, which has the gang attempt a daring bank robbery, offers the best dose of action, with Yang going up against a foe twice her size (and kicking ass, of course!). Director Stanley Tong and star Michelle Yeoh have both made far better films than this, but if your expectations are not set too high, you may find Project S a reasonable way to spend your time (although 105 minutes was a tad too long for me!).",
         "With a crime spree occurring across Hong Kong, and all the crimes traced to the work of one major crime syndicate, the police look to focus their resources. Having recently proved how tough and resourceful she is, Officer Hua Yang is sent to help a couple of detectives. It becomes immediately evident that the group is a lot more organised than they expected but Hua shakes off her adviser role and takes direct action \u0096 but when she discovers that the leader of the group is none other than one Ah Fung, Hua's old boyfriend. On the basis of the wonderful Michelle Yeoh being in it, I decided to give this film a go to see if it was any good. From the very start I was amused to see how cheap it looked, although it may have aged a little bit as well. As with all these type of films, plot usually comes second to the action and here is no different. The story is not that well delivered and I found myself with too many characters to care about and too little logic in the plot. It did jump around a bit and it relied too heavily on the former relationship between Jessica and Ah \u0096 but it never bothered to really make us care about either of them as real people or get emotionally involved with them as was necessary if this method was to work. Sadly it didn't work and the film was quite unengaging for the most part. Of course with good action scenes this shouldn't matter too much, but it doesn't do anything that special on the action front. This is not to suggest it is no good, because the gun play and various fights are reasonably good, it is just that they don't really do anything special and they do lack a certain amount of style. The fights do feel like they were done on a budget and, like the rest of the film, they did lack imagination and effort. The cast didn't do anything that good but in fairness my version was badly dubbed so it is hard to tell. Yeoh is a great actress who I have seen been playful, exciting, sensitive and tragic in many films but here she has nothing to do although one or two of her fight scenes hint at her ability. I never really got into the characters played by Sui-Wong, Yu and Chau as they didn't make much of an impression, although I thought that Wei was good. Bill Tung is there in a small role and does his usual stuff but were they really so desperate to attract an audience that they had to make Jackie Chan demean himself in an unfunny drag cameo? Overall this is an average film at best. The presence of one or two famous names suggests that it will be better than average but in reality it is all a bit workmanlike and lacking effort. The plot relies on the characters being developed and, when they're not, it means that it isn't very engaging as a story. The action is OK but nothing special and I never went 'wow' or anything like that. The script is average and the performances (dubbed or not) didn't really do anything to improve on the situation \u0096 Yeoh in particular was disappointingly bland for large sections.",
         "When i saw this movie i was really mad because i had bought it on DVD, thinking it was a great movie... Well i was wrong. This is not a great movie... at all. What could have been a great hong kong action movie is in reality a low budget \"american action movie\" with Asians playing all the roles. The hong kong movies i love in the martial arts genre is the ones where the action is clear, fight scenes are shot at a wide angle and with few cuts so you get pretty long sequences where you see everything the fighters do. In this movie however, they use closeups and fast cuts, usually seen in movies where they are trying to hide the fact that the actors can't fight. But we all know Michelle Yeoh can fight so why they have done this is beyond me. The lousy fight scenes ruined the entire movie for me i am a afraid. I rate this movie 4/10",
         "Crediting Jacky in this film at all was probably just a PR stunt. He's only in one scene, and that looks as though it was pulled from another film. To top it all off, he's in drag (personally, I liked the Chun Li Jacky from City Hunter better...). That being said, if you didn't know that when you rented the film, you probably haven't seen the poster. This is a typical Michelle Yeoh film: great Kung Fu/acrobatics/stunts, high melodrama, and a plot that falls apart in the last 20 minutes of the piece."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Golden Harvest Company",
         "Golden Way Films Ltd.",
         "Top Stunt"
      ],
      "summaries": ["As a crime wave sweeps through Hong Kong, the police call on Jessica Yang, a rising star in their ranks, to help stop a notorious gang of thieves."],
      "budget": 0
   },
   "movielensId": 876,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "1993-10-21",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Stanley Tong"],
      "runtime": 104,
      "movieId": 876,
      "title": "Project S",
      "mpaa": "R",
      "actors": [
         "Michelle Yeoh",
         "Yu Rong-Guang",
         "Emil Chow",
         "Jackie Chan",
         "Eric Tsang",
         "Athena Chu",
         "Fan Siu-Wong",
         "Joe Cheung",
         "Bill Tung",
         "Dick Wei",
         "Bowie Lam",
         "Yukari Ôshima",
         "Maggie Chan Mei-Kei",
         "Ailen Sit",
         "Alain Guernier"
      ],
      "imdbMovieId": "0106544",
      "originalTitle": "超级计划",
      "genres": [
         "Action",
         "Adventure",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "As a crime wave sweeps through Hong Kong, the police call Jessica Yang (Yeoh), a rising star in the ranks, to help stop a notorious gang of thieves! What Jessica doesn't realize is that her boyfriend - recently discharged from the force - is the leader of this ruthless crime ring!",
      "tmdbMovieId": 38955,
      "avgRating": 2.71667,
      "releaseYear": "1993",
      "numRatings": 330,
      "posterPath": "/fkytEZtIL4HhBg2S3w0doeLS0PI.jpg"
   }
}