{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116418",
      "video": false,
      "title": "Girls Town",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Patti Lucci",
               "gender": 1,
               "credit_id": "52fe4adac3a36847f81e5259",
               "name": "Lili Taylor",
               "profile_path": "/pIJ4Enx6kIC9srLkDfGpEzfNlDZ.jpg",
               "id": 3127,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Angela",
               "gender": 1,
               "credit_id": "52fe4adac3a36847f81e525d",
               "name": "Bruklin Harris",
               "profile_path": "/jbYhvYwDIMQK3tlZlY5eUN9bOAx.jpg",
               "id": 188642,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Emma",
               "gender": 0,
               "credit_id": "52fe4adac3a36847f81e5261",
               "name": "Anna Grace",
               "profile_path": null,
               "id": 1049720,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Nikki",
               "gender": 1,
               "credit_id": "52fe4adac3a36847f81e5265",
               "name": "Aunjanue Ellis",
               "profile_path": "/xo8wv5fhpxAPnNA7HS7WH8psguQ.jpg",
               "id": 53923,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Tomy",
               "gender": 0,
               "credit_id": "53a6d2010e0a261439003b22",
               "name": "Ramya Pratt",
               "profile_path": "/h1kWDu8mYXssOWXUQ15UvlkrkL3.jpg",
               "id": 1218139,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Marlys Giovanni",
               "gender": 0,
               "credit_id": "52fe4adac3a36847f81e526d",
               "name": "Asia Minor",
               "profile_path": null,
               "id": 1049741,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Jessie (Boom Box Guy)",
               "gender": 2,
               "credit_id": "52fe4adac3a36847f81e5271",
               "name": "Carl Kwaku Ford",
               "profile_path": null,
               "id": 1046135,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Dylan",
               "gender": 2,
               "credit_id": "52fe4adac3a36847f81e5275",
               "name": "Guillermo Díaz",
               "profile_path": "/hnWjRRud2n2rDI6NbaeSIeEOMcP.jpg",
               "id": 8695,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Teacher",
               "gender": 0,
               "credit_id": "52fe4adac3a36847f81e5279",
               "name": "Shondalin",
               "profile_path": null,
               "id": 1049744,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4adac3a36847f81e5237",
               "name": "Jim McKay",
               "profile_path": "/hrrBk9T8Ds0UH9NKds1gkbJioTo.jpg",
               "id": 205639,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4adac3a36847f81e523d",
               "name": "Jim McKay",
               "profile_path": "/hrrBk9T8Ds0UH9NKds1gkbJioTo.jpg",
               "id": 205639,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4adac3a36847f81e5243",
               "name": "Denise Casano",
               "profile_path": null,
               "id": 171497,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4adac3a36847f81e5249",
               "name": "Anna Grace",
               "profile_path": null,
               "id": 1049720,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4adac3a36847f81e524f",
               "name": "Bruklin Harris",
               "profile_path": "/jbYhvYwDIMQK3tlZlY5eUN9bOAx.jpg",
               "id": 188642,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4adac3a36847f81e5255",
               "name": "Lili Taylor",
               "profile_path": "/pIJ4Enx6kIC9srLkDfGpEzfNlDZ.jpg",
               "id": 3127,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.683963,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 110513,
      "vote_count": 3,
      "budget": 0,
      "overview": "Four women, Patti, Emma, Angela, and Nicki are completing their last year of high school. Unfortunately for the group, one of their own, Nicki, unexpectedly commits suicide. The three remaining women, upon finding out that Nicki had been raped before she died, begin to talk to each other about the ways in which they are oppressed by the men in their lives. They begin to fight together, taking revenge on Emma's rapist, Patti's abusive ex-boyfriend, and finally, Nicki's rapist.",
      "similar": [],
      "original_title": "Girls Town",
      "runtime": 90,
      "poster_path": "/ldmbetFr1AsB67V1JTVVJAANNLQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-08-21",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jim McKay"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Jim McKay",
         "Denise Casano"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116418/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkyMDMxMDcwN15BMl5BanBnXkFtZTcwMDc3MTgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lili Taylor, Bruklin Harris, Anna Grace | See full cast and crew »"],
      "reviews": [
         "i *loved* this movie. it is very realistic and it deals with very realistic issues that are difficult to deal with. what i liked most about it, was that rather than everyone getting shot or something which is typical with \"urban\" movies, this one even tho times were difficult, the characters still plodded onwards towards school. nice1.",
         "I accidentally ran into this movie on the Sundance channel and couldn't stop watching it. Menace and danger plus banality and boredom - high school from top to bottom, and nothing that anyone does or says in this really well-acted film is anything other than exactly what a 17-year-old would do or say. Good moments include the teen mom telling off a guy for dogging her one day and accepting his charm offensive the next; the only visible mom having no ability to say any unangry, unjudgemental thing to her tough, suffering daughter; and the ineffective and heartbreaking confrontation with the guy the three friends think drove their fourth friend to suicide. The girls are p_ssed, resentful, revengeful, smart, excited, violent, and together all in on the right scale - an excellent girls' Dazed and Confused that gets a perfect 10 for realness.",
         "This is one of those movies that I can see over and over again and never get tired of. It's a very realistic depiction of urban life and growing up in the big city. It was shot in my old neighborhood of Astoria, Queens and I was amazed at the accuracy in carrying that \"vibe\" to the big screen. The story is very moving and believably portrayed with an amazing cast led by Lili Taylor. The soundtrack is also worth picking up and consists of a compilation of some of the greatest female artists in music today (PJ Harvey, Lamb, Queen Latifah, Luscious Jackson).",
         "Despite previous reviews, I felt this movie was really well thought out, I saw this movie when it first came out and it definitely reached me. The subject touches but not meant to be a description of urban life at all. If you see the movie, you will understand what the real issue is. I am going to have to disagree with the dude who posted previously, this movie is geared towards anyone who believes in the issues that plague our youth and our young girls of color. It makes you want to break down the ideals that perpetuate class-ism, the gender binary and other issues that separate people. I hope others see it for what it is. Its reflective of the type of role our society and communities play in a developing child's mind. I think it should be shown to a mixed audience of boys and girls so that they can see the perspective of the other sex. I think it speaks a lot about violence in our schools.",
         "I'm a 62-year-old white male in Northern Michigan, and I liked this film. Rightly or wrongly, I felt that I was getting a good inside look at a culture that I have never brushed shoulders with. Lili Taylor, for a 30-year-old gal from Illinois, seems to have captured the spirit of Patti in a very convincing way, and her body language showed that she really had rapport with her friends. Under ordinary circumstances, I would not choose to watch a film about the subject of school kids in Brooklyn or Hackensack or wherever, but I liked these kids. It's a nice piece for older people to watch, and be entertained by people telling you things you probably didn't know. Rightly or wrongly. I'm not in a position to judge the authenticity of the cultural overview that the film presents. Warning to old fuddie-duddies: The F-word uccurs 31 times in a 51-second scene (Is this a new record?) so don't watch if the grand-kids are around!",
         "Lili Taylor is excellent in this film (as per usual). After watching this film I only wish that we could see more of the other two female actors (Bruklin Harris and Anna Grace) in this film do more work. A dark film that hits home because of the solid in the moment acting. A special film. The film credits these three fine women actors with writing credits a long with the director and Denise Casano. When watching the film you feel as if you are there due to the fine acting and excellent editing. I wish we could see more from the other two actors because they were really good in this film... it seems that this film is a lost gem.",
         "At the center of this largely improvised, sometimes moving, mostly flat cinema verite-style drama about three young women who are dealing with the suicide of one of their friends, there is a mesmerizing performance by 29-year-old Lili Taylor as the Latino, single mother, high school student Patti. I've seen only a few movies with Taylor, \"Short Cuts,\" \"Say Anything...\" and \"Ransom,\" and in each she was upstaged by actors with more screen time and juicier roles, but I know she's received rave notices for her turns in \"Household Saints\" and as the \"I\" in \"I Shot Andy Warhol.\" Here she gives an astonishingly vibrant performance that will have you guessing her age, her ethnicity, and whether or not she's really Lili Taylor. She looks the part with just some rudimentary makeup, yes, and that's nothing to sneeze at, but she also oozes authenticity -- she plays her part better than those other actresses who are just playing themselves. The rest of the movie has a few moments of truth and also a few choice repeats from High School's Greatest Hits (no small feat either; is the independent market where we must go to find realistic portrayals of public education?), but mostly it features some uninspired improv jobs and a rather sloppy directing job by Jim McKay -- he seems unwilling to exercise any discipline over any of the actors, probably too enamored with the improv style, and as a result the difficulty in framing their more kinetic scenes becomes too much. Add to this the fact that McKay fails to visibly conclude a story where no real story exists. Malick could end his storyless films properly; Kubrick, too. This is Sundance territory, though, the tightrope upon which films must be made that are daring enough to seem \"new,\" but with enough of a conventional structure to sell tickets. Judging by the rejection of most Sundance releases (with a few notable exceptions) by critics, distributors, and audiences, the festival seems to be hurting itself by playing both sides. So, in a microscopic sense, does \"Girls Town.\"",
         "Awesome film. A coming-of-age film that contains a very realistic depiction of urban life and growing up in a big city. In it, 3 straight teenage girls (Patti, Angela and Emma) lose their friend Nikki, who mysteriously kills herself. Eager to find out why she did that, they manage to retrieve a journal from her home, and they soon find out that their friend committed suicide because she had been raped while she was doing an internship at a magazine company. Then the 3 girls start talking to each other about the things that have recently been going on in their lives. They soon find out that they too have been/are being forced into sex by the men they've been with (or are being with). They start writing some \"Subvert the patriarchy!\" graffiti on their school's bathroom doors, and start making plans to take revenge on all the men that have treated/are treating them like s***. A wonderful scene is when they all wreck the car of the guy who'd raped Emma. She'd been raped at the back of his car so this was all so powerfully symbolic to take revenge that way. I couldn't stop laughing when the three girls trash the car. :D Patti's boyfriend is very violent towards her, and they also had some awesome plans to deal with him too, which ultimately will lead to them making plans against the rapist who was at least partly responsible for Nikki's death. Great film. There aren't many films like this in which poor working-class women unite together (across race divisions) and try hard to deal with a misogynistic, racist patriarchal society. The way they start feeling the harsh symptoms of it is telling. I loved the Audre Lorde quote (\"The fact that we are here and that I speak these words is an attempt to break that silence and bridge some of those differences between us, for it is not difference which immobilizes us, but silence. And there are so many silences to be broken.\") near the end, suggesting that the three teenage girls have been researching into feminism, quoting from a black lesbian feminist of the Second Wave. The 1990's female rap music enhances the film. I think there might have been more female rap artists in the 90's, before all the sexist hip hop took over. The only downside is that the film was a tad bit slow at one point, and some scenes could have been replaced with others, better ones.",
         "When I first starting watching this film, I assumed it would be a great film that follows in the style of KIDS. However, after watching twenty minutes of it, I became sorely disappointed. The \"urban\" girls in the film, which are seen outside a convenience store talking vulgarly and are seemingly all troubled, are really not as troubled as they seem. The only person in this whole movie that warrants sympathy is Patti, who apparently is a single mother that got pregnant young, although she seems way older than the rest and is teased for being held back in high school for years. She's supposed to be commended for being a good mother, however you rarely see her child and you see her drinking and smoking all the time. The girls all give speeches, and they all seem to be well-adjusted. Nikki, the girl that kills herself, has been accepted to Princeton, and before she kills herself, nothing seems to be wrong at all. After she kills herself, however, her friends are upset for a bit, and on the same day of her death, they visit her mother and have the audacity to ask her if Nikki wrote a note. The mother then gets upset and kicks them out(an incident that makes the girls call her a bitch), but one of them, Emma (who is a white girl that is about to leave for Columbia), manages to steal her journal, where it is discovered that she was raped. The movie then turns into a weird Thelma and Louise type story of women who are out to get rapists. The movie dwells too much on an incident where these girls trash a \"rapist\"'s car, and then go on to brag about it. However, they try to act like they didn't do it when anyone says anything about it. Also, the journal included the name of Nikki's rapist, and instead of handing it over to the authorities or leaving it in Nikki's room to be discovered by her parents, they kick the guys in the balls and harass him a bit, and that's how the movie ends. In conclusion, this movie is very, very trite, should have been way more developed and edited, and includes about an hour and a half of stuff that isn't necessary. You're supposed to feel sympathy for these girls, but their attitudes, ignorance, and carelessness, warrants nothing of the sort.",
         "What makes this movie amazing is the simplicity. The realness of the actors (thanks to an amazing sense of improv by the three leads) is what makes this my all-time favorite movie. It is the only film I can watch consecutively and never get tired of it. Jim McKay is an amazing director, as he has come out with some other good films, but, to me, none have topped this one. Lili Taylor is phenomenal as a \"street-wise\" single mother still in high school. Bruklyn Harris' AngelA! is a character I would personally love to be friends with and Anna Grace's style is perfect for a teenage girl. For anyone who grew up in Queens, Brooklyn, or the Bronx, this movie brings much familiarity. For those who've never been, this film will take you there."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Boomer Pictures",
         "C-Hundred Film Corporation",
         "Dolly Bell Pictures Inc."
      ],
      "summaries": ["A look at a group of girl friends coming-of-age during their senior year of high school in urban America. Nikki and Emma have a heart to heart talk one evening about how much they'll miss each other at college next year, but the next day, Nikki doesn't show up at school: she's committed suicide. The friends steal Nikki's journal and discover that she'd been raped. The rest of the movie shows our heroines growing closer in the wake of Nikki's death and the relevation of her secret (Emma reveals that she's also been raped), taking revenge on the men who oppress them, and trying to grow up and move on with their lives. Emma has to deal with a shallow boyfriend, Angela with an overbearing mother, and Patti is trying to finish high school while trying to raise a child and avoid the child's loser father."],
      "budget": 0
   },
   "movielensId": 877,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-08-21",
      "dvdReleaseDate": null,
      "directors": ["Jim McKay"],
      "runtime": 90,
      "movieId": 877,
      "title": "Girls Town",
      "mpaa": "",
      "actors": [
         "Lili Taylor",
         "Bruklin Harris",
         "Anna Grace",
         "Aunjanue Ellis",
         "Ramya Pratt",
         "Asia Minor",
         "Carl Kwaku Ford",
         "Guillermo Díaz",
         "Shondalin"
      ],
      "imdbMovieId": "0116418",
      "originalTitle": "Girls Town",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Four women, Patti, Emma, Angela, and Nicki are completing their last year of high school. Unfortunately for the group, one of their own, Nicki, unexpectedly commits suicide. The three remaining women, upon finding out that Nicki had been raped before she died, begin to talk to each other about the ways in which they are oppressed by the men in their lives. They begin to fight together, taking revenge on Emma's rapist, Patti's abusive ex-boyfriend, and finally, Nicki's rapist.",
      "tmdbMovieId": 110513,
      "avgRating": 3.16384,
      "releaseYear": "1996",
      "numRatings": 177,
      "posterPath": "/ldmbetFr1AsB67V1JTVVJAANNLQ.jpg"
   }
}