{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nitrous oxide",
            "id": 169078
         },
         {
            "name": "candid camera",
            "id": 169079
         },
         {
            "name": "double act",
            "id": 169085
         },
         {
            "name": "political satire",
            "id": 169086
         },
         {
            "name": "crooked politician",
            "id": 169097
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0115697",
      "video": false,
      "title": "Black Sheep",
      "recommendations": [
         11381,
         9622,
         13203,
         14342,
         10956,
         13778,
         14577,
         11017,
         9536,
         10406,
         2617,
         13595,
         9054,
         14170,
         11528,
         9080,
         8873,
         11310,
         11543,
         11419
      ],
      "backdrop_path": "/5e520E5E3gO3EbDqhHZ9PVstAHk.jpg",
      "revenue": 32,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mike Donnelly",
               "gender": 2,
               "credit_id": "52fe45c09251416c7506146f",
               "name": "Chris Farley",
               "profile_path": "/cBdeUwTCordbeFTSo7pPBNPRMph.jpg",
               "id": 58198,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Steve Dodds",
               "gender": 2,
               "credit_id": "52fe45c09251416c75061473",
               "name": "David Spade",
               "profile_path": "/tamKFAKdB1Q2mllHYHXxqg3YUXr.jpg",
               "id": 60950,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Robbie Mieghem",
               "gender": 2,
               "credit_id": "52fe45c09251416c75061483",
               "name": "Grant Heslov",
               "profile_path": "/7MKZWZnGmeBmK9JRUKZYDN8Cqeb.jpg",
               "id": 31511,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Al Donnelly",
               "gender": 2,
               "credit_id": "52fe45c09251416c75061487",
               "name": "Tim Matheson",
               "profile_path": "/iQQCtIS9bQJlQ8OMOzeidsJptAQ.jpg",
               "id": 21561,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Drake Sabitch",
               "gender": 2,
               "credit_id": "52fe45c09251416c7506148b",
               "name": "Gary Busey",
               "profile_path": "/n66ycv61ZoqusHthcQde1g3JY6T.jpg",
               "id": 2048,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Neuschwander",
               "gender": 2,
               "credit_id": "52fe45c09251416c7506148f",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Governor Tracy",
               "gender": 1,
               "credit_id": "52fe45c09251416c75061493",
               "name": "Christine Ebersole",
               "profile_path": "/dl8uNpIyYeGpjA90C0W1SGSsfla.jpg",
               "id": 4003,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Roger Kovary",
               "gender": 2,
               "credit_id": "52fe45c09251416c75061497",
               "name": "Timothy Carhart",
               "profile_path": "/1UEUs6UJdxjSbGakZflWuN4TS7T.jpg",
               "id": 17396,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Scott Colleary",
               "gender": 2,
               "credit_id": "52fe45c09251416c7506149b",
               "name": "Michael Patrick Carter",
               "profile_path": null,
               "id": 56486,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Clyde Spinoza",
               "gender": 2,
               "credit_id": "52fe45c09251416c7506149f",
               "name": "Boyd Banks",
               "profile_path": "/mDsIaLKyGqyV1Nt0pV9joGkQNSP.jpg",
               "id": 20196,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Motorcycle Cop",
               "gender": 2,
               "credit_id": "52fe45c09251416c750614a3",
               "name": "David St. James",
               "profile_path": "/cOJhnH9pJph2snOgpTMgWcWY5kz.jpg",
               "id": 1598,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "State Trooper",
               "gender": 2,
               "credit_id": "52fe45c09251416c750614a7",
               "name": "Skip O'Brien",
               "profile_path": null,
               "id": 162823,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Fan",
               "gender": 0,
               "credit_id": "52fe45c19251416c750614ab",
               "name": "Branden R. Morgan",
               "profile_path": null,
               "id": 56165,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Pocket Pool Lady",
               "gender": 0,
               "credit_id": "52fe45c19251416c750614af",
               "name": "Gypsy Spheeris",
               "profile_path": null,
               "id": 1073828,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Jim Blaine",
               "gender": 2,
               "credit_id": "52fe45c19251416c750614b3",
               "name": "John Ashker",
               "profile_path": null,
               "id": 1030724,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Carl",
               "gender": 0,
               "credit_id": "5987b1d99251413d180228c4",
               "name": "Jonathan Everett Lewis",
               "profile_path": null,
               "id": 1864853,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Mayor",
               "gender": 0,
               "credit_id": "59c9aa2dc3a36803a400178f",
               "name": "James Noah",
               "profile_path": "/qcqd4BnJVMMyVNSFkztY76e1GxI.jpg",
               "id": 1886271,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45c09251416c75061479",
               "name": "Penelope Spheeris",
               "profile_path": "/6MiXfO2EdA0keiJf0RmGNfLTvAc.jpg",
               "id": 58448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c09251416c7506147f",
               "name": "Fred Wolf",
               "profile_path": null,
               "id": 66563,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 7.554203,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13997,
      "vote_count": 139,
      "budget": 0,
      "overview": "When dignified Albert Donnelly runs for Governor, his team moves to keep his slow-witted and klutzy younger brother, Mike, out of the eye of the media. To baby-sit Mike, the campaign assigns sarcastic Steve, who gets the experience of a lifetime when he tries to take Mike out of town during the election.",
      "similar": [
         10735,
         27586,
         858,
         634,
         3981,
         112160,
         437557,
         258480,
         17130,
         43923,
         141,
         244772,
         242224,
         394117,
         401898,
         376867,
         297762,
         376660,
         129139,
         455661
      ],
      "original_title": "Black Sheep",
      "runtime": 87,
      "poster_path": "/2wsaboVhKXpsLchoaXi0oWmQ7xM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1996-02-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "There's one in every family.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Penelope Spheeris"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Fred Wolf"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115697/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3MDM5OTc4Ml5BMl5BanBnXkFtZTcwNjk2NDMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Farley, David Spade, Tim Matheson | See full cast and crew »"],
      "reviews": [
         "After the enormous success of TOMMY BOY, it was expected that Chris Farley and David Spade would star in another movie together. What wasn't expected was that the two movies would be so similar. In TOMMY BOY, Richard Hayden (David Spade) must look after the sweet, but clumsy Tommy Callahan (Chris Farley) so he doesn't mess up the family business. In BLACK SHEEP, Steve Dodds (David Spade) is hired by Mike Donnelly's (Chris Farley) brother to look after the sweet, but clumsy Mike so he doesn't mess up an upcoming campaign. While the plots of the two movies aren't exactly identical, they are similar enough to give the feeling that BLACK SHEEP was somewhat rushed into theaters in order to capitalize on the popularity of the duo. Opening on February 2, 1996, just eleven months after the March 1995 release of TOMMY BOY, BLACK SHEEP received dismal reviews (Gene Siskel said that this was the first film he walked out on in 26 years of reviewing movies). However, the dismal reviews weren't enough to keep audiences away from the theaters and the movie made a decent $32 million, which isn't necessarily a hit, but good nonetheless. As a major fan of both Chris Farley and David Spade, I find this movie to be one of the funniest comedies from the 1990s. I used to like it even more than I liked TOMMY BOY although I now see that TOMMY BOY is certainly the better movie. Both TOMMY BOY and BLACK SHEEP have some of the most memorable moments in comedy history, though TOMMY BOY has a lot more of them. Watch TOMMY BOY and BLACK SHEEP back to back and prepare to laugh like you have never laughed before. Chris Farley and David Spade are, in my opinion, the funniest duo ever to appear onscreen. It's a shame they didn't get to make a more movies together before Farley's death. My rating: ***1/2",
         "I really didn't think TOMMY BOY was all that funny. I didn't. But I sure did like BLACK SHEEP. The film is a good film if you want a laugh. But you need to have the right sense of humor. Gene Siskel obviously did not have the correct type of humor, as he is reported to have walked out on this film. Well, that was one of his biggest mistakes, because there are far worse movies out there! Chris Farley was funny as hell, I don't think anyone should object to that. David Spade still is pretty funny (although he lost a lot of points with me when he did JOE DIRT). I thought this film was actually pretty good. The other members of the cast were good: Tim Matheson, Gary Busey, Grant Heslov, and Bruce McGill. All of them were funny as hell. Maybe with the exception of Gary Busey's character, who I must admit was pretty stupid. The film had a good story though, and it was sweet-natured along iwth being majorly crude and funny. I recommend ALMOST HEROES and TOMMY BOY *if* you liked this movie. BLACK SHEEP gets 4/5.",
         "Black Sheep is one of the most hilarious movies I have seen... I am a big Farley, Spade fan and this is just as funny as Tommy Boy... no one does it better then Farley when it comes to physical humor, and the dry humor that David Spade delivers is knee slapping funny... I definitely recommend this movie!",
         "Black Sheep is a pretty funny Comedy, at times often laugh out loud hilarious, and Farley and Spade just have great chemistry together!, plus, the scene where Farley and Spade act as police officers and get stoned from the Nitrous Oxide is absolutely a scream!. I really don't know how Tim Matheson played it straight around Farley, cause that guy is just hilarious, and the ending is a big hoot as well, and will have you in stitches, plus while it may be a rerun of other films I still found it to be funny as hell. Gary Busey is a riot in his role as a crazy former Sgt. and it's a damn shame Farley died when he did cause he was so funny and I was looking forward to seeing more great funny films of his, plus slapstick and buffoon humor is right up my alley so of course I enjoyed this!. Overall This is a pretty funny comedy, that had me in stitches quite a bit of the time and I say this is a must see for all Farley and slapstick fans!. ***1/2 out of 5 The Acting is fun!. Chris Farley is funny as hell, he always cracks me up with his funny outbursts, this guy goes non stop, as I love his type of humor, it's just a shame he's not around anymore R.I.P Chris. David Spade is great here he had excellent chemistry with Farley and was also hilarious, I thought he did a great job. Tim Matheson is great as the brother Al and Governor candidate and the most incredible thing is he played everything straight!. Christine Ebersole is decent as the villain as the Govenor who is a crook I rather liked her. Gary Busey is a riot as the Vietnam veteran, he plays crazy so well and just cracked me up I love this guy!. Bruce McGill is good in his short role.",
         "Spoilers may appear. I must say I have no idea how this movie has an average of four on IMDb.com. This movie will completely tear you up over and over with side-splitting antics and great jokes. I read a review on another site that said, in comparison to Tommy Boy, Black Sheep has no plot and is nowhere near as funny. Wrong! The plot may be just as shallow, but the comic antics in this movie shoot way above Tommy Boy. For instance, Chris Farley and David Spade enter the cabin and find that it is infested with one single bat. They go crazy and wreck everything in the cabin, and Chris Farley's character assumes \"It's Ozzy Osbourne!\" Okay, maybe you have to watch it to get it. The plot isn't as bad as people make it out to be, but the storyline does tend to get a little foggy in places. However, the extensive appearance of crude humor and excellent acting make this movie a classic comedy. If you like hilarious movies, then this is definitely one to see.",
         "Reviews of this film were less than favourable but since I enjoyed the Farley/Spade partnership so much in Tommy Boy I thought I would check this one out as well. Farley does alot of falling over and generally self abuse in this one, for instance when he tumbles down a mountain side and then gets up and says \"What was that all about?\". The bit where the bunk bed collapses on top of Spade during the hail storm and the \"Power to the People\" speech at the rock concert are hilarious. Most viewed this film as inane and childish - one reviewer I distinctly remember said that he would rather have Des O'Connor sing him the phone book than watch this again - but I found myself laughing many times.",
         "There are many words to describe \"Black Sheep\", and most of them begin with \"un\" - as in unsophisticated, uninspired, unoriginal. Still, it has some scattershot laughs. Gary Busey, for example, is brilliantly cast as a paranoid Vietnam veteran and comes through with the funniest performance by far. Chris Farley has barely one or two mildly funny moments in the entire film, but he does achieve some touching ones, and his honest efforts to amuse his audience in any way he can at least earn your respect. (**)",
         "Black Sheep is one of the two films in which Chris Farley stars alongside the constant sarcasm of David Spade (the other being Tommy Boy, which is almost as funny), and the results are childish but endlessly amusing. Farley plays Mike Donnelly, the younger and nuttier brother of Al Donnelly, who is campaigning to be governor of Washington. Mike's seemingly constant screw-ups, which cause serious havoc during his brother's campaign, provide for the majority of the comedy in the film. There can be no mistake that this is entirely slapstick comedy, but it succeeds very well because Farley can pull it off so well. The hopelessly geeky Spade balances out Farley's hyper-activity with his collected but nerdy performance, leaving us with an odd couple that could be called a slightly less mature version of that of the late Walter Matthou and the later Jack Lemmon (a moment of silence for Matthou, Lemmon, and Farley, would be in order about now\u0085). It is strange that such an immature film could deal so extensively with a relatively serious subject as politics and still manage to keep the slapstick successful, especially since there are moments of real emotion in the film. Gary Busey appears in a small but very effective and amusing role as Sgt. Drake Savage, a military-minded guy who ultimately seems to have a heart of gold. The interactions between him and Spade are some of the funniest moments in the film, along with the constant humor that seems to always be emanating from Farley. The cabin scene with Mike and Steve (Spade) is especially amusing (\"I got dibs on top bunk!\"). I am not going to attempt to say that Black Sheep is a truly intellectual film, nor is there anything particularly amazing about the script or direction, but the comedy is excellent, there can be no mistake about that. I mean, Tommy Boy and other movies, like Major Payne, are no cerebral workouts either, but the comedy is there. That's the reason to watch these movies, and to their credit, you can tell that just by looking at the cover. You probably won't learn anything or see the portrayal of many serious issues in a movie like Black Sheep, but you will laugh heartily and you will remember it for that.",
         "Starring Chris Farley and David Spade, \"Black Sheep\" is yet another SNL-like comedy produced by creator Lorne Michaels. The movie starts with Mike Donnelly, portrayed by Chris Farley, whose brother is running for governor of Washington, but it turns out that his crazy shenanigans is ruining the campaign. So his brother sends out his personal assistant, portrayed by David Spade, to help keep Mike under control before the big campaign. \"Black Sheep\" is not a sequel to \"Tommy Boy\", even though they are both produced by Lorne Michaels, and they both have a special SNL quality to it, and the duo of Chris Farley and David Spade are back, only they are in different roles this time. This movie does have the same formula, but even if it's funny and enjoying, this is not as good as it's previous competition. It was glad to see Farley and Spade back on screen together after they previously worked with each other on \"Tommy Boy\". They are still wacky and funny like always, and it was really nice to see these two maniacs on screen. But neither one of them brings a unique or really good performance. But I would rather like to see these guys bullying each other, and bond with one quick one-liner after another, like in \"Tommy Boy\". But they don't accomplish that this time. I did laugh out loud at times, but it was just until later in the movie where almost everything becomes less funny. But let's not forget that Gary Busey, with two horrible-looking buck front teeth, makes an appearance in this movie, and it's just flat-out-weird. \"Black Sheep\" may be considered as one of the 90s worst movies to others. But I knew what I wanted to see, and I enjoyed another SNL Farley-Spade duo motion picture. \"Black Sheep\", in my review, \"completely untraditional, but somewhat hilarious\".",
         "'Black Sheep' is a decent comedy from the 1990's, that offers laughter here and there. But, the main reason why I really enjoyed this film was - The Great Chris Farley. In the lead role, the late legend delivers a lovable performance, that only goes onto to say, what a talent he was! 'Black Sheep' Synopsis: A gubernatorial candidate hires a wormy special assistant whose only job is to make sure the candidate's well-meaning but incompetent brother doesn't ruin the election. Fred Wolf's Screenplay is funny in parts. However, the writing could've been tighter & more cohesive. Penelope Spheeris Directs this Light-Hearted Comedy, ably. Cinematography, Editing & Art Design, are ordinary. Performance-Wise: It's Farley all the way. He delivers, as mentioned, a lovable performance. Also, he suits the role perfectly. David Spade contributes nicely in some sequences. Tim Matheson is perfect. Christine Ebersole is fair. Gary Busey & Grant Heslov are as usual. On the whole, 'Black Sheep' is a decent comedy, with Farley ruling the show."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Comedy about the prospective Washington State Governor Al Donnelly whose only stumbling block on the road to power is his embarrassing younger brother Mike. To keep him out of mischief, Al forces one of his aides, Steve Dodds to keep an eye on him during the election. However, this is easier said than done...",
         "A gubernatorial candidate hires a wormy special assistant whose only job is to make sure the candidate's well-meaning but incompetent brother doesn't ruin the election."
      ],
      "budget": 0
   },
   "movielensId": 88,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-01",
      "dvdReleaseDate": "2002-07-16",
      "directors": ["Penelope Spheeris"],
      "runtime": 87,
      "movieId": 88,
      "title": "Black Sheep",
      "mpaa": "PG-13",
      "actors": [
         "Chris Farley",
         "David Spade",
         "Grant Heslov",
         "Tim Matheson",
         "Gary Busey",
         "Bruce McGill",
         "Christine Ebersole",
         "Timothy Carhart",
         "Michael Patrick Carter",
         "Boyd Banks",
         "David St. James",
         "Skip O'Brien",
         "Branden R. Morgan",
         "Gypsy Spheeris",
         "John Ashker",
         "Jonathan Everett Lewis",
         "James Noah"
      ],
      "imdbMovieId": "0115697",
      "originalTitle": "Black Sheep",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["BRgCb1QjOv4"],
      "plotSummary": "When dignified Albert Donnelly runs for Governor, his team moves to keep his slow-witted and klutzy younger brother, Mike, out of the eye of the media. To baby-sit Mike, the campaign assigns sarcastic Steve, who gets the experience of a lifetime when he tries to take Mike out of town during the election.",
      "tmdbMovieId": 13997,
      "avgRating": 3.12812,
      "releaseYear": "1996",
      "numRatings": 5881,
      "posterPath": "/2wsaboVhKXpsLchoaXi0oWmQ7xM.jpg"
   }
}