{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "date",
            "id": 248
         },
         {
            "name": "transporter",
            "id": 396
         },
         {
            "name": "assassination",
            "id": 441
         },
         {
            "name": "white house",
            "id": 833
         },
         {
            "name": "usa president",
            "id": 840
         },
         {
            "name": "bodyguard",
            "id": 3088
         }
      ],
      "imdb_id": "tt0116311",
      "video": false,
      "title": "First Kid",
      "recommendations": [
         150889,
         41841,
         38132,
         31504,
         79008,
         20551,
         32611,
         25164,
         11310,
         16084,
         40562,
         40490,
         15148,
         46286,
         10696,
         13962,
         9446,
         44585,
         21352,
         26441
      ],
      "backdrop_path": "/h7amekcFMJGeDf6WykveNvGZJgI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sam Simms",
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047947",
               "name": "Sinbad",
               "profile_path": "/lQ6VVIxpZuwgXJuBX87YwQkXUoq.jpg",
               "id": 57119,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Luke Davenport",
               "gender": 2,
               "credit_id": "52fe44fb9251416c7504794b",
               "name": "Brock Pierce",
               "profile_path": null,
               "id": 72862,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dash",
               "gender": 2,
               "credit_id": "52fe44fb9251416c7504794f",
               "name": "Blake Boyd",
               "profile_path": "/gU8KziZ6zWUK9WGcerfTCpDp7rF.jpg",
               "id": 72863,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Woods",
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047953",
               "name": "Timothy Busfield",
               "profile_path": "/8sQr5B1h0wJ4kOcTgwWyCDfzzYq.jpg",
               "id": 23881,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Morton",
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047957",
               "name": "Art LaFleur",
               "profile_path": "/4rEvPSEtiOeYfqNzwZ6PnCCAP9F.jpg",
               "id": 44792,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "President Paul Davenport",
               "gender": 2,
               "credit_id": "54c7ed30c3a36874ac0045bb",
               "name": "James Naughton",
               "profile_path": "/cjEnGQb3FDoDRZKcwbeM43Kma6b.jpg",
               "id": 37421,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Linda Davenport",
               "gender": 1,
               "credit_id": "54c7ed449251416789004494",
               "name": "Lisa Eichhorn",
               "profile_path": "/1yvBmX8G8AX6pVIJvvzhfnqtwcm.jpg",
               "id": 28950,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Katie Warren",
               "gender": 0,
               "credit_id": "54c7ed5fc3a3687090000670",
               "name": "Erin Williby",
               "profile_path": null,
               "id": 1419313,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Rob McArthur",
               "gender": 0,
               "credit_id": "54c7ed7bc3a3683f7d003ef9",
               "name": "Zachary Ty Bryan",
               "profile_path": null,
               "id": 1419315,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Susan Lawrence",
               "gender": 1,
               "credit_id": "54c7ed8ec3a36874b7004a56",
               "name": "Fawn Reed",
               "profile_path": "/6vX5VD5KziXP0i7xBTYF3oQK2QT.jpg",
               "id": 147788,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Speet",
               "gender": 2,
               "credit_id": "54c7ed9d925141678c0047ac",
               "name": "Bill Cobbs",
               "profile_path": "/cP2ETKFdk93z4e1oXZVG0utI3IM.jpg",
               "id": 8854,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047963",
               "name": "Roger Birnbaum",
               "profile_path": null,
               "id": 4504,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047969",
               "name": "Dale De La Torre",
               "profile_path": null,
               "id": 69744,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c7504796f",
               "name": "Riley Kathryn Ellis",
               "profile_path": null,
               "id": 56188,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c7504797b",
               "name": "Sinbad",
               "profile_path": "/lQ6VVIxpZuwgXJuBX87YwQkXUoq.jpg",
               "id": 57119,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047981",
               "name": "Richard Gibbs",
               "profile_path": "/5jTk1fUsMzslWB86XdWB8JoYdMl.jpg",
               "id": 21068,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047987",
               "name": "Michael Jayston",
               "profile_path": "/yoTNX1Bx2YqEaEHyzQXlkTZ5Iq2.jpg",
               "id": 29069,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c7504798d",
               "name": "Anthony B. Richmond",
               "profile_path": null,
               "id": 14139,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047993",
               "name": "Harry Keramidas",
               "profile_path": null,
               "id": 1061,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047999",
               "name": "David M. Evans",
               "profile_path": "/h4PUTxhvUuRVO9EMQznDt5F2vZO.jpg",
               "id": 69741,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5654ee76c3a3684146000623",
               "name": "Tim Kelleher",
               "profile_path": null,
               "id": 1536766,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5654ee8b92514145c3000673",
               "name": "Tim Kelleher",
               "profile_path": null,
               "id": 1536766,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.78836,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12559,
      "vote_count": 35,
      "budget": 0,
      "overview": "Some say that to be the leader of a country is one of the loneliest jobs in the world. But being the child of a world leader can be doubly so. Constantly surrounded by security officers, restricted in movements and having almost every waking moment carefully monitored makes normalcy an impossibility. No one knows this better than young Luke Davenport, the son of U.S. President Davenport. He vents his loneliness, frustration and feelings of isolation from family and friends by being a brat to his private Secret Service agent. When the agent snaps from the strain in front of the First Lady, a new agent is assigned to Luke. He turns out to be the enormous Sam Simms, a bit of a rogue who managed to rise through the ranks by sheer determination rather than strict adherence to Secret-Service protocol. At first, Luke tries all his old tricks upon Sam. But instead of getting angry, Sam seems to actually understand.",
      "similar": [
         9772,
         1246,
         75,
         66,
         9386,
         1578,
         1366,
         1367,
         1374,
         6637,
         7461,
         667,
         117251,
         9440,
         117263,
         1371,
         9331,
         1375,
         586,
         921
      ],
      "original_title": "First Kid",
      "runtime": 101,
      "poster_path": "/h0rYlopeP1mKiQVxAzsB3QmU5w6.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-08-30",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "He's young. He's wild. He's fun. And he's the one protecting the president's son.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David M. Evans"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Tim Kelleher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116311/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzE1NDMyODA2NF5BMl5BanBnXkFtZTcwNzM3NDYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sinbad, Brock Pierce, Blake Boyd | See full cast and crew »"],
      "reviews": [
         "Okay, okay. The movie doesn't aim at high quality. It's not meant to be. It is meant to be funny and entertaining. It is shallow and sometimes oversubscribed. However, I thought that a) Brock Pierce did a wonderful job, b) I could deduce some messages of life, c) the plot was nice and d) the interaction between Sinbad and Brock was rather substantial and well staged. Brock Pierce showed how lonesome and frustrating the life as the \"First Kid\" can be, how isolated he is and how much he suffers from this isolation. Sinbad - I mean, he is a clumsy guy, but he did fine in here. I never thought that he was constrained or fake. The movie as a whole lacks a realistic storyline, but that didn't matter to me. I was rather attracted by the scene in which Brock told him amid tears how outcast he felt, and I thought it was witty how Sinbad showed him what to do about it. Definitely not a masterpiece but surely above the average.",
         "I am not a big fan of Sinbad's movies, but he made me laugh more than once in this movie. I recommend it to people of all ages! The other actors are OK, but it has a good plot and strong ending. Don't let the Disney fool you. I think that this is one of the best childrens movies I have seen lately.",
         "Why does this movie get such low reviews; it's terrific!!!!! I love Sinbad and he is very funny in all of his movies such as this, \"Jingle All The Way,\" \"Houseguest,\" etc.; he's DA BOMB!!!!! LOL Anyway, it's about a kid who lived in the White House. No, he can't be qualified to run our country just yet, but still... Anyhow, he likes to get spy gear, talk with his buddy Mongoose_12, and use his pet snake to trick people into thinking he's doing homework and stuff...LOL Some parts range from serious (seeing one of the \"Home Improvement\" kids as a bully; watching the \"baked bean\" fly out of that bad guy's gun) to LOL (Laugh Out Loud) fun (the spit ball the size of ice cream!!!!!; the pizza/Coke mascot, etc.)!!!!! Anyways, I've seen this in the theater in 1996, and have seen this a lot on the old Disney Channel after that. \"First Kid\" is a cool movie!!!!! 10/10",
         "Luke Davenport (Brock Pierce), the son of U.S. President Davenport (James Naughton) vents his loneliness, frustration and feelings of isolation from family and friends by being a brat to his private Secret Service agent. When the agent snaps from the strain in front of the First Lady, a new agent is assigned to Luke. He turns out to be the enormous Sam Simms (Sinbad), a bit of a rogue who managed to rise through the ranks by sheer determination rather than strict adherence to Secret Service protocol. Luke tries all his old tricks upon Sam. But instead of getting angry, Sam seems to actually understand and the two form a friendship. First Kid is usual Disney fare, but at least Sinbad was pretty funny in this one.",
         "This is a wonderful Family Movie. We ALL loved it and it leaves you with that \"feel good\" feeling that romantic comedies leave you with. It doesn't have all the violence that you see in today's movies on television but yet it hints at the cautions of the violence that kids need to be wary of so that it makes you think about it in terms of being cautious. It also hints at a little puppy-love with the thirteen year old kids. The phrases that they use are current so it makes the movie believable in today's times. It is just the right length and also ends very nicely. It's a great all-around movie that everyone can enjoy watching over and over again. I'd see it again and again because I liked it so much.",
         "[CONTAINS SPOILERS] Meet Sam Simms. He works for the Secret Service in Washington D.C., and he hopes to one day guard the president. But now he was given his most dangerous and most challenging assignment yet--protecting the president's son: 14-year-old Luke Davenport. Simms got the job when he performed the good deed of stopping Luke from showing his bare behind on TV at the mall. Simms was taking the place of Agent Woods, who was overjoyed to be rid of that kid. Simms thinks this will be easy. But immediately Luke has him look after his 6ft long python, which ends up trashing a fancy party. At school, Luke is attacked by local bully Rob. Where was Simms? He was told by Luke to give him space. Simms feels Luke got what he deserved, but felt sorry for him later. Luke is miserable with his life. He wants to be like a normal kid. The only outside friend he has is his Internet buddy, Mongoose12. Then one day, Simms offers to take Luke out and kind of show him what he's been missing. He teaches him how to box; Luke has his eye on a cute classmate, Katie. He and Simms tail her to her birthday party at a roller skating rink where Simms inadvertanly saves the day; Luke wants to go to the school dance so Simms teaches him the moves, but when an unguarded duffel bag turns up outside the White House, head of Secret Service Morton forbids Luke to go, but he and Simms go anyway. The result: Simms was fired and Luke was put under house arrest, but he escaped to go to the mall to meet Mongoose12, but unfortunately, he didn't know who this man really was. It was Agent Woods who goes completely psycho. But it's Simms to the rescue! A very entertaining Disney movie. Everybody is good in it. Zachary Ty Bryan from Home Improvement is Rob. In an interview, Bryan said Rob wasn't really a bad guy. But we all saw that Rob was a non-caring, unfeeling, destructive boy, but then again I'm sure Bryan knows the character better than we do. So, If you're looking for a good family comedy, then I recommend First Kid!",
         "I thought I'd stumbled upon another cheesy movie. But no, this is one of the good ones. As a matter of fact, I'm surprised why it's getting such a low rating. Sam Simms (Sinbad) is hired to be the personal Secret Service agent of the President's son Luke Davenport (Brock Pierce), after the current agent got fired. No wonder, too, because Luke is a pain in the neck who pulls all kinds of stunts and practical jokes - for fun or for attention? You'll find out. Sinbad and Brock Pierce work wonderfully together, and the scenes with the two of them are good. The scenes with them and Dash (Blake Boyd) are even better. I must say that I particularly liked Dash's (however brief) dancing outside the school hall - seem familiar? Oh, yes. They could have left out the kidnapping plot, but it does make for an interesting addition. A great movie. Worth the rental.",
         "The movie is about Luke a 13 years old boy but he´s not a normal kid, he´s the first kid! Luke is very difficult kid because he has no friends and not a normal life so he annoys his bodyguard. When he gets a new bodyguard they are getting friends soon and Luke learns some things like normal kids like dance, boxing and about girls. OK the story from the rich misunderstood kid isn´t really new but I liked this movie. It´s simple a fell good and have fun movie. Brock Pierce and Sindbad did a really good job, I liked the dialogues between them. I worth to see it!",
         "First Kid (1996): Dir: David Mickey Evans / Cast: Sinbad, Brock Pierce, Timothy Busfield, Blake Boyd, James Naughton: Part family film and part really bad skit. Sinbad plays secret agent Sam Simms assigned to protect the President's son. With his wild ties and sense of humour he attempts to win the boy over. After failing attempts he decides to teach the kid how to box, dance and ask out girls. The only thing he left out is teaching the screenwriter how to write a decent story. Simple plot travels formula with little or nothing original to be found. It is disturbing how the villain got to his current state. Director David Mickey Evans does what he can with the cardboard material but he is dealing with recycled nonsense. Sinbad is basically reduced to formula doing everything expected. Brock Pierce is hardly likable as the kid. In fact had he not been such a snot nose brat then none of this would have happened. Timothy Busfield plays a former bodyguard who is mistreated by this miserable brat. Blake Boyd provides no personality as the President. He is played by James Naughton and is the basic father who is absent but learns lessons of fatherhood by the conclusion. What a total crock. Film supposedly stresses the importance of good adult role models but comes off as a juvenile James Bond that should be locked away and never heard from again. Score: 1 / 10",
         "I have a particularly strange penchant for American comedies that were released between 1991 and 1998. These comedies had a few things in common. They starred someone who was quite big on TV at the time, and a movie studio decided to give them a contract to star in some low budget movies to see how they'd do. The first one did OK business, then the other sank without a trace. Damon Wayans, Pauly Shore, Phil Hartman, Sinbad, and a few other actors were in these, and although they never really gained an audience here in the UK, I have to see every one of them, because they all have the same narrative structure to them. And here's the method of that narrative. We have our star, who has some sort of wacky trait. They are in close proximity to someone who doesn't like them very much. That attitude eventually changes. They bond and become friends. Something happens that cause this friendship to finish abruptly, either someone loses their job, or our hero has been double crossed. But rest assured, all will be good come the end, the hero will get the love interest, the the hero and main plot character will bond, and every one will laugh come the end. There is always an Obi Wan type character in the film, here it's Robert Guillame, and there is always someone who wants them to fail, here it's Art La Fleur, but guess what, he warms to him come the end. Sinbad is watchable enough he's likable, and the concept here is that he's assigned to look after the Presidents son, who's a little bit of a cheeky chappie, why, in the first scene, he gets a member of the Secret Service fired, I wonder where that plot goes too? So Sinbad teaches him how to box, how to talk to girls, and things are going smoothly, until the bond ends abruptly. Even though you know what's going to happen the minute the film starts, these are my kryptonite, I'll always go back to them, because they are so easy going. They are not brilliant by any means, m sometimes embarrassed to watch them with other people, but they are comfort movies, and so entires that's what you want a film to give you."
      ],
      "genres": [
         "Family",
         "Comedy"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Walt Disney Pictures"
      ],
      "summaries": ["Luke Davenport is the thirteen-year-old son of Paul Davenport, the President of the United States, and first lady Linda Davenport. Ill tempered Agent Woods is the secret service agent in charge of Luke. Woods is fired after mistreating Luke in front of the press. Woods is then replaced by former boxer Sam Simms, who won a boxing title in 1977. Sam is eager to take the job - even though no one else wants it. Everyone thinks that Luke is just a brat when the only thing Luke wants is to just fit in and be like every other kid at his school, the Georgetown Academy. Sam almost gets fired when Luke gets decked at school by school bully Rob MacArthur. This is when Sam decides to use his boxing expertise to teach Luke how to fight. Luke has his eyes on class-mate Katie Warren, but so does Rob. Katie agrees to go with Luke to an upcoming school dance, so Sam teaches Luke how to dance. Rob is also at the dance, but this time when Rob tries to deck Luke, Luke turns the tables and decks Rob. Sam is then fired for taking Luke to the dance without permission, although Luke had the permission of his parents, but secret service chief Morton didn't want Luke leaving the White House grounds while Luke's parents were on the campaign trail. Luke runs away anyway to meet a friend that he has been chatting on the internet with. The meeting is set to take place at a local mall where Luke discovers that his secret friend is a now psychotic Woods, who blames Luke for his firing and wants revenge on Luke, but not if Sam can help it."],
      "budget": 0
   },
   "movielensId": 881,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Español"
      ],
      "releaseDate": "1996-08-30",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["David M. Evans"],
      "runtime": 101,
      "movieId": 881,
      "title": "First Kid",
      "mpaa": "PG",
      "actors": [
         "Sinbad",
         "Brock Pierce",
         "Blake Boyd",
         "Timothy Busfield",
         "Art LaFleur",
         "James Naughton",
         "Lisa Eichhorn",
         "Erin Williby",
         "Zachary Ty Bryan",
         "Fawn Reed",
         "Bill Cobbs"
      ],
      "imdbMovieId": "0116311",
      "originalTitle": "First Kid",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["_t7ubr0jBII"],
      "plotSummary": "Some say that to be the leader of a country is one of the loneliest jobs in the world. But being the child of a world leader can be doubly so. Constantly surrounded by security officers, restricted in movements and having almost every waking moment carefully monitored makes normalcy an impossibility. No one knows this better than young Luke Davenport, the son of U.S. President Davenport. He vents his loneliness, frustration and feelings of isolation from family and friends by being a brat to his private Secret Service agent. When the agent snaps from the strain in front of the First Lady, a new agent is assigned to Luke. He turns out to be the enormous Sam Simms, a bit of a rogue who managed to rise through the ranks by sheer determination rather than strict adherence to Secret-Service protocol. At first, Luke tries all his old tricks upon Sam. But instead of getting angry, Sam seems to actually understand.",
      "tmdbMovieId": 12559,
      "avgRating": 2.83472,
      "releaseYear": "1996",
      "numRatings": 1198,
      "posterPath": "/h0rYlopeP1mKiQVxAzsB3QmU5w6.jpg"
   }
}