{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "circus",
            "id": 291
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "aunt",
            "id": 6894
         },
         {
            "name": "imaginary friend",
            "id": 7942
         }
      ],
      "imdb_id": "tt0115725",
      "video": false,
      "title": "Bogus",
      "recommendations": [
         77946,
         3288,
         118430,
         33657,
         10472,
         18862,
         41582,
         10486,
         29098,
         49478,
         24793,
         2464,
         19214,
         70135,
         83489,
         33660,
         47608,
         12710,
         35645,
         11894
      ],
      "backdrop_path": "/3wVZA1uC1yTwOkZdrDiMBGYsgmg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Harriet Franklin",
               "gender": 1,
               "credit_id": "52fe439fc3a36847f8062721",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Bogus",
               "gender": 2,
               "credit_id": "52fe439fc3a36847f8062725",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Albert",
               "gender": 2,
               "credit_id": "52fe439fc3a36847f8062729",
               "name": "Haley Joel Osment",
               "profile_path": "/znbiMgFoGnY3NMANOa8u13wJqFm.jpg",
               "id": 9640,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Babette",
               "gender": 1,
               "credit_id": "52fe439fc3a36847f806272d",
               "name": "Ute Lemper",
               "profile_path": "/e8sVrg3B6sGJesrWRnB2i54XvkV.jpg",
               "id": 29408,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Penny",
               "gender": 1,
               "credit_id": "52fe439fc3a36847f8062731",
               "name": "Andrea Martin",
               "profile_path": "/syS5bfwIeFAFzAWtn0dqPbfPadM.jpg",
               "id": 8263,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lorraine Franklin",
               "gender": 1,
               "credit_id": "52fe439fc3a36847f8062735",
               "name": "Nancy Travis",
               "profile_path": "/5galk3XJxxlIEmrnAQBuJsY1AaD.jpg",
               "id": 18331,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Monsieur Antoine",
               "gender": 0,
               "credit_id": "52fe439fc3a36847f8062739",
               "name": "Denis Mercier",
               "profile_path": null,
               "id": 33157,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Ruth Clark",
               "gender": 1,
               "credit_id": "52fe439fc3a36847f806277f",
               "name": "Sheryl Lee Ralph",
               "profile_path": "/7F5p0zzzhqaNxeZZxLzGM9H3W7m.jpg",
               "id": 33613,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Mrs. Partridge",
               "gender": 1,
               "credit_id": "52fe439fc3a36847f8062783",
               "name": "Barbara Hamilton",
               "profile_path": null,
               "id": 33614,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f806271d",
               "name": "Norman Jewison",
               "profile_path": "/umNoz1FsJtvoWKlCsgNOqWlfrgh.jpg",
               "id": 13563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f806273f",
               "name": "Alvin Sargent",
               "profile_path": "/oTZ7SFxTtnokAe5518kNb3aGczD.jpg",
               "id": 7630,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f8062745",
               "name": "Norman Jewison",
               "profile_path": "/umNoz1FsJtvoWKlCsgNOqWlfrgh.jpg",
               "id": 13563,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f806274b",
               "name": "Jeff Rothberg",
               "profile_path": null,
               "id": 33611,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f8062751",
               "name": "Arnon Milchan",
               "profile_path": "/5crR5twLRcIdvRR06dB1O0EQ8x0.jpg",
               "id": 376,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f8062757",
               "name": "Marc Shaiman",
               "profile_path": "/aesoPh8jPR5qDKjjt7o5uj9kS3W.jpg",
               "id": 9251,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f806275d",
               "name": "David Watkin",
               "profile_path": null,
               "id": 10639,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe439fc3a36847f8062763",
               "name": "Stephen E. Rivkin",
               "profile_path": null,
               "id": 1721,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe439fc3a36847f8062769",
               "name": "Howard Feuer",
               "profile_path": null,
               "id": 1530,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe439fc3a36847f806276f",
               "name": "Alicia Keywan",
               "profile_path": null,
               "id": 33612,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe439fc3a36847f8062775",
               "name": "Hilton Rosemarin",
               "profile_path": null,
               "id": 7535,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe439fc3a36847f806277b",
               "name": "Ruth Myers",
               "profile_path": null,
               "id": 19310,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.525815,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 3587,
      "vote_count": 66,
      "budget": 32000000,
      "overview": "Recently orphaned, a young boy is taken in by his godmother who is shocked to realize that she can see the boy's imaginary friend: a flamboyant, French magician named Bogus.",
      "similar": [
         68728,
         27022,
         672,
         674,
         675,
         767,
         12445,
         809,
         587,
         671,
         673,
         808,
         259316,
         129,
         10882,
         10140,
         68735,
         76492,
         57158,
         37430
      ],
      "original_title": "Bogus",
      "runtime": 110,
      "poster_path": "/gftAsnrvZ1lLcG5nL7SHchtLT7n.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Yorktown Productions",
            "id": 1484,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-09-06",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "A comedy about losing your heart, finding your inner child and meeting the one friend you've always tried to avoid.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Norman Jewison"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Jeff Rothberg",
         "Francis X. McCarthy Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115725/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNjg2ODMzNV5BMl5BanBnXkFtZTcwNzI0OTQyMQ@@._V1_SY317_CR24,0,214,317_AL_.jpg",
      "actors": ["Stars: Whoopi Goldberg, Gérard Depardieu, Haley Joel Osment | See full cast and crew »"],
      "reviews": [
         "I can't believe there are bunch of people saying this movie is not really good. I thought it was original and its casual self. It didn't need to be changed in any way. It was funny, bright, happy, and a crowd-pleaser. It can make anyone smile and there was never a chance I would say this movie is bad. It has imagination, reality, and everything mixed in. The ingredients are good and well done the actors were really good and had a sense-of-humnor. You can tell nobody forced them to be like that and you can actually see they are their own self. Oscar winner Whoopi Goldberg (Ghost) does a good preformance and Haley Joel Osment, future Oscar nominee (The Sixth Sense) was also really good. And whoever played Bogus, Gerand .... was also really good and I find him funny and would like to know more about him cause he's got talent and I bet he knows it! I like this movie and this is actually a very fresh and funny film for family movie night and it's a very good selection. When you go to Blockbusters someday, try to look for Bogus!",
         "After reading the many comments and watching the movie several times, I think I realize why Albert's friend was French. The people he was closest to in his former life were the French magician and his wife/partner. Therefore it made sense that his imaginary friend was like them. I loved the movie and though Harriet seemed to change suddenly in some people's opinion, I think she was changing throughout the movie. The looks she gave and the thoughts that seemed to be going through her mind, were very evident of that fact. Gérard Depardieu was excellent in the part of Bogus, the evidence between him being so big and the boy so small. How many times have we as adults wished for someone big and strong to take us up and give us comfort? I loved the ending where he wandered away to help another child. Sometimes in my life, I wish for someone like him. He also has a lovely smile. Good movie for that time when you are wanting something different.",
         "\"Bogus\" is a touching and heart warming example of Albert Einsteins famous quote: \"Reality is our worst enemy and imagination is our best friend.\" A seven year old boy Albert (Haley Joel Osment), has a very happy life,living in Las Vegas with his circus entertainer mother,Lorraine (Nancy Travis). This almost perfect life is tragically torn away from Albert when Lorraine is killed in car crash. After squabbling over who Albert should stay with,Lorraine's colleagues find that in her will,Lorraine had stated that she wished for Albert to be put in the care of her foster sister Harriet Franklin (Whoopi Goldberg). When Harriet learns of this, she is not to happy. She has always lived alone and doesn't like the idea of being suddenly responsible for this little boy. But Harriet realizes that it's what Lorraine wanted and through thick and thin, Lorraine was always there for her. So Albert goes to live with Harriet in the less glamorous city of Newark, New Jersey. But he has not come alone!! With him,Albert has bought a friend. A gentle giant called Bogus (Gerard Depardieu) who has been his only friend since the death of his mother. Bogus is out to bring Harriet and Albert together as a family and to remind Harriet that imagination brings happiness. Whoopi, Gerard and Haley make a fantastic team and are perfectly cast in this beautiful movie! 10 out of 10!!",
         "This Movie really changed me A lot; it showed me that Imagination is Very important, and doesn't let anyone tell you different! I know a lot of you did not really care for this movie, but if you go back, and look from you Child's point of view, you might just see what I did. A very fun and loving movie that made me fell really good about myself! Whoopie dose an excellent job playing a new mother, she is a great mother in real life so I know this was hard for her. And Bogus could not have been cast better! I love this movie and can not wait to own it, (when I have money 8 ) ) Andrew",
         "What a sweet movie! It makes you wish that you were a kid again. I would gladly be seven years old once more if it meant welcoming Bogus in the form of Gerard Depardieu into my life! He was fantastic. The relationship he has with the little boy is touching without being overly sentimental, and he gives the boy exactly what he is looking for - warmth and friendship and is everything a friend (imaginary or otherwise) should be. It brought tears to my eyes one minute and made me giggle the next! In my opinion, this film is equally entertaining for adults as well as young children, since it reminds us adults that imagination is such an important part of our lives! This film is perhaps reminiscent of \"Drop Dead Fred\" which sees a grown woman being comforted by her childhood imaginary friend in a time of crisis. But this movie is far, far better done if you ask me. So for all you hardened adults out there, lighten up! This movie will help you to embrace the child within!",
         "It is extremely rare that I stop on any movie while channel-surfing. This one caught my eye because of Haley Joel Osmont...this kid was amazing even at five years old! And of course Whoopi is great as always. I even liked Gerard in this one...he generally just rubs me the wrong way in his other movies for some reason. He was perfectly cast as Mr. Bogus. This movie will be magical for those who remember (or who need to remember) those imaginary friends which got us through various growing pains. It is sweet, light-hearted, and rates 10 out of 10 on the \"warm-fuzzy\" factor. Even my husband thought it was cute, and he's not normally into these kind of movies. Loved it!",
         "Quite a good movie, describing the case of a traumatized child who makes up a \"secret friend\" to help him survive in an unfriendly world. Having his foster godmother Harriet Franklin start to see and hear Bogus, the invisible friend, is harder to accept...despite the fact that she too was once a small child with (presumably) a similar burden. Placed next to all the cliff-hanger world-threatening scenarios of many blockbuster movies, the story of a small child's trying to come to grips with his mother's death may seem somewhat trivial. But unlike those other flicks, it has the redeeming feature of being true to life. Despite the make-believe title character, the story itself is very down-to-earth (with only the exception noted above).",
         "Gerald Depardieu at his most average is better than many other actors at their very best. Well this isn't necessarily true. However as an actor, Depardieu has attempted everything, not all of them good but what he always manages to convey on the screen is a presence that is strong and full of conviction, no matter what the circumstances, as a viewer this is hard to fault. In the movie Bogus we see one of these performances. What we should also mention is fine support from Whoopi Goldberg and a sublime Haley Joel Osment. Bogus is an interesting, well acted and well crafted, fantasy piece, it is a story about the mind of a child and how this can cross over into a real/adult world. This is a movie that could have easily missed it's intended mark with lesser actors, and a less experienced director. But through imagination, depth of characters and a special bond between the three actors, this movie succeeds.",
         "Bogus is one of the saddest movies I have ever seen. I know that a lot of people didn't like the film, but I have seen hundreds of movies and have not found one that made me cry like Bogus did. After seeing Dancer in the Dark I thought that no movie could ever strike me as being sad, but this one did. Although this might not have been Gerard Depardieu's best performance or Goldberg's, the film is unique. I recommend this movie to anyone who likes any of the actors or just wants to see an interesting movie.",
         "As the movie opens, we see a woman floating in the air surrounded by fog. It's not just a fantasy. It's a performance by magician Antoine in Las Vegas. Lorraine, one of the performers, has a 7-year-old son named Albert who wants to be a magician. The boy's father must have been a magician, someone says, because he disappeared. After Lorraine dies tragically, there is no family to take care of him. Lorraine's co-workers think of Albert as family, but they travel too much (wonder why Lorraine didn't, or if she did). It is determined that Lorraine wanted Harriet Franklin to have Albert if anything happened. A flashback shows how Harriet, a little black girl, arrived at the foster home where Lorraine already lived. The two became friends, although this is not shown. When Harriet, the owner of a restaurant supply business, is contacted, she gets upset. No, she doesn't want a child! (The usual reaction from a Whoopi Goldberg character) But Harriet remembers how good a friend Lorraine was and reluctantly agrees to take Albert. Harriet lives in Newark (the only thing good about Newark is that it is close to Atlantic City, where Albert's friends will soon perform), so Albert must take a plane ride. On the plane, Albert is given a coloring book, and one of the characters in the coloring book comes to life. He is a French man who calls himself Bogus who only Albert can see or hear. Throughout the movie, people wonder who Albert is talking to. But it seems Bogus is his only friend. Harriet doesn't want him, and he doesn't bond with the other children. An example: in one scene, a magician is performing at a child's birthday party, and Albert knows how the trick was done, but when another child is scared, Albert doesn't reassure her. He just wonders silently how kids could be so dumb. Albert doesn't try very hard to be happy with his situation, while Harriet goes out of her way to help the boy and doesn't seem to be getting any reward. Just lots of parking tickets. Even though Bogus is from a fantasy world, he tries to give Albert practical advice. He knows Albert needs to face his problems and get on with life, but he still wants to have fun with the boy. There are a couple of enjoyable scenes with Bogus and Albert together, one with Jack Sheldon of 'Schoolhouse Rock' fame singing 'Me and My Shadow' as the two friends explore Newark. In another scene, an ice cream parlor magically appears in a warehouse. Harriet and her business associate Bob can't see the ice cream, though Bob pretends to. (Is something going on with those two other than business?) Whoopi Goldberg gives her usual performance. She has an attitude but tries to be civil to the boy and eventually shows signs of coming around. Gerard Depardieu is wonderful as Bogus. And while this is no 'Sixth Sense', Haley Joel Osment is still one of the best possible actors to play his role. It's a shame he will have to grow up. This is a formula movie, but I like the formula. Possible Spoiler: Eventually, Harriet does see and hear Bogus, and she even dances with him to big band and polka music, with both wearing fancy costumes that come out of nowhere."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "New Regency Pictures",
         "Regency Enterprises",
         "Warner Bros."
      ],
      "summaries": [
         "Seven year-old Albert is the son of a Las Vegas circus performer. When she is killed in a car wreck, Albert is sent to live with his mother's foster sister, Harriet Franklin, a no-nonsense businesswoman struggling in New Jersey. Albert hates it with the dour Harriet, but takes refuge in the company of Bogus, a flamboyant, gentle, loving, and altogether imaginary Frenchman. With Bogus's help, Albert can perhaps come to terms with his mother's death, and Harriet with her own loss of childhood innocence.",
         "Recently orphaned, a young boy is taken in by his godmother who is shocked to realize that she can see the boy's imaginary friend: a flamboyant, French magician named Bogus."
      ],
      "budget": 30000000
   },
   "movielensId": 885,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-06",
      "dvdReleaseDate": "2004-02-10",
      "directors": ["Norman Jewison"],
      "runtime": 110,
      "movieId": 885,
      "title": "Bogus",
      "mpaa": "PG",
      "actors": [
         "Whoopi Goldberg",
         "Gérard Depardieu",
         "Haley Joel Osment",
         "Ute Lemper",
         "Andrea Martin",
         "Nancy Travis",
         "Denis Mercier",
         "Sheryl Lee Ralph",
         "Barbara Hamilton"
      ],
      "imdbMovieId": "0115725",
      "originalTitle": "Bogus",
      "genres": [
         "Fantasy",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["UtTdKGJMLxA"],
      "plotSummary": "Recently orphaned, a young boy is taken in by his godmother who is shocked to realize that she can see the boy's imaginary friend: a flamboyant, French magician named Bogus.",
      "tmdbMovieId": 3587,
      "avgRating": 2.66267,
      "releaseYear": "1996",
      "numRatings": 667,
      "posterPath": "/gftAsnrvZ1lLcG5nL7SHchtLT7n.jpg"
   }
}