{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0120271",
      "video": false,
      "title": "Talk of Angels",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary Lavelle",
               "gender": 1,
               "credit_id": "52fe48ecc3a36847f8180add",
               "name": "Polly Walker",
               "profile_path": "/nUYl7W4QcO9ud2ig6qvLQ2qs0HZ.jpg",
               "id": 6416,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Conlon",
               "gender": 1,
               "credit_id": "52fe48ecc3a36847f8180ae7",
               "name": "Frances McDormand",
               "profile_path": "/jodV4NuQAvxQWIHxqnop1jUX77N.jpg",
               "id": 3910,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Francisco Areavaga",
               "gender": 2,
               "credit_id": "52fe48ecc3a36847f8180aeb",
               "name": "Vincent Pérez",
               "profile_path": "/elPFKCVOZyMni2hx7mLlaYkyifD.jpg",
               "id": 20239,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Vicente Areavaga",
               "gender": 2,
               "credit_id": "52fe48ecc3a36847f8180aef",
               "name": "Franco Nero",
               "profile_path": "/lwXfTQrFqAw4zcVjrhgq3THfWCg.jpg",
               "id": 22383,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Doña Consuelo",
               "gender": 1,
               "credit_id": "52fe48ecc3a36847f8180af3",
               "name": "Marisa Paredes",
               "profile_path": "/aDfNPZ2plaCmdrYkCkburjBqYnP.jpg",
               "id": 954,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Pilar",
               "gender": 1,
               "credit_id": "52fe48ecc3a36847f8180af7",
               "name": "Penélope Cruz",
               "profile_path": "/dcPSUfxMa791NZvrFiBc3ReDdpU.jpg",
               "id": 955,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Beatriz",
               "gender": 1,
               "credit_id": "52fe48ecc3a36847f8180afb",
               "name": "Ariadna Gil",
               "profile_path": "/rCxr274gYjgtHMjXaEZxvXkaqig.jpg",
               "id": 17006,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Elena",
               "gender": 1,
               "credit_id": "52fe48ecc3a36847f8180aff",
               "name": "Rossy de Palma",
               "profile_path": "/3IH9ZBUcFNwBr8IcS1RZhMKTpeg.jpg",
               "id": 25258,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Don Jorge",
               "gender": 0,
               "credit_id": "52fe48ecc3a36847f8180b03",
               "name": "Francisco Rabal",
               "profile_path": "/egKYgMjy749Fis3XZ4qrm8l9ltD.jpg",
               "id": 9768,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Duggan",
               "gender": 0,
               "credit_id": "52fe48ecc3a36847f8180b07",
               "name": "Britta Smith",
               "profile_path": null,
               "id": 1053297,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48ecc3a36847f8180ae3",
               "name": "Nick Hamm",
               "profile_path": "/7bJGwFFw1X9ek7mDxeQjjeKJ6uH.jpg",
               "id": 6361,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5910ff77c3a36864fc03887a",
               "name": "Kate O'Brien",
               "profile_path": null,
               "id": 1813137,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5910ff7e9251414e8903a06b",
               "name": "Ann Guedes",
               "profile_path": null,
               "id": 1434860,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5910ff859251414edb03971a",
               "name": "Frank McGuinness",
               "profile_path": null,
               "id": 43621,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5910ff9dc3a36864c6038c3c",
               "name": "Trevor Jones",
               "profile_path": "/86HjonjMXwcDyOlpaQW1SVR9CXh.jpg",
               "id": 7020,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5910ffb39251414e8d0377aa",
               "name": "Alexey Rodionov",
               "profile_path": null,
               "id": 57467,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "591105599251414ead036e1a",
               "name": "Michael Bradsell",
               "profile_path": null,
               "id": 23865,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59110560c3a36864fc038c57",
               "name": "Gerry Hambling",
               "profile_path": null,
               "id": 9163,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "591105679251414e920398ce",
               "name": "Mary Selway",
               "profile_path": null,
               "id": 668,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59110570c3a36864a7037fb6",
               "name": "Michael Howells",
               "profile_path": null,
               "id": 32985,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59110594c3a368650a0374e8",
               "name": "Eduardo Hidalgo hijo",
               "profile_path": null,
               "id": 1813154,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5911059ac3a36864c6038fe6",
               "name": "Totty Whately",
               "profile_path": null,
               "id": 32988,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "591105a3c3a36864c6038ff1",
               "name": "Elizabeth Waller",
               "profile_path": null,
               "id": 10499,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "591105aec3a36864ec0358b8",
               "name": "Lena Mossum",
               "profile_path": null,
               "id": 1813155,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "591105b3c3a36864d403ab99",
               "name": "Lala Huete",
               "profile_path": null,
               "id": 16986,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.300153,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 56077,
      "vote_count": 4,
      "budget": 0,
      "overview": "This is the story of a young Irish woman who comes to Spain to escape from the pressures she feels about her impending marriage to a political activist in Ireland. But in Spain in the 1930's, taking a job of governess in a wealthy family, she finds the same kinds of political unrest. In fact, it isn't long before she finds herself attracted to a married man who is similarly involved in the struggle against fascism and Franco. This awakens her to her nature that brings her to such men and resolves for her what she must do about the life she left in Ireland",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "Talk of Angels",
      "runtime": 96,
      "poster_path": "/ipDXrPjOLDBlBA4qB6Lo7Gm3jlI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Polaris Pictures",
            "id": 90101,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kanzaman",
            "id": 4169,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kan Zamia-a",
            "id": 90100,
            "origin_country": ""
         }
      ],
      "release_date": "1998-10-30",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Hamm"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Ann Guedes",
         "Frank McGuinness"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120271/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MTI5NTk4OF5BMl5BanBnXkFtZTcwNTI4NDUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Polly Walker, Vincent Perez, Franco Nero | See full cast and crew »"],
      "reviews": [
         "I really wanted to love this movie. I did love Vincent Perez, who always imbues his characters with smoldering good looks and charm and fine character. But there was no motivation for their romance, other than the fact that he was a man and she was a woman, and the movie was a love story. We never see why he falls for her, especially since he is rarely in the house with her. More chemistry is generated between Lavelle and her friends, and between herself and the family she takes care of. And the ending, without giving it away, made the movie kind of pointless. Rent it for Vincent, not the story.",
         "From reading the previous viewer contents one would never be able to truly appreciate what a marvelous film this was. Perhaps one of the reasons I reacted so positively to this film was that I lived through that period of the Spanish Civil War which had great meaning for many millions of Americans. It was, of course, the preview to WWII with the Germans backing General Franco and the Russians supplying the rebels. However even without the drama of pre civil war Spain the film stands up well on its own as a beautiful love story. An especially provocative theme of the movie is reflected in Maria's comment that \"We are shown what it is we most desire but we cannot have it\". Unfortunately this poignant comment is all too true for countless millions of folks. One important segment of the film not mentioned by previous viewers is the magnificent musical score. Its recurring melodic themes have a hauntingly beautiful effect which serves to enhance the sensuous love scenes between the two principals.",
         "\"Talk of Angels\" tells of a betrothed Irish woman (Walker) who leaves her strife-torn homeland to take a job as governess to a wealthy family in Spain where she falls in love with a married man. The film, based on the writings of Kate O'Brien, is an attempt at a lavish and rich romantic tale set against an epic backdrop of Spanish civil war (circa 1930's). However, the screenplay tries to do too much for the allotted run time resulting in a weak, diluted, and ill-focused story of nebulous purpose, meaning, and significance. \"Talk of Angels\" will likely play best with mature women and incurable romantics. (C+) Note - Viewers who enjoy this film might be interested in a parallel film, also with Penelope Cruz, of the same period but different genre, \"Belle Epoque\".",
         "It may be the oldest storytelling device in the world. You take external events, usually a war or some political oppression. You draw grand sweeps that show passion and scope and boundless consequence. And in this opulence of effect you place a love story, folded within if you wish. After all, there is no emotion in existence that is stronger than romantic love and all its twists and perversions. But these are impossible to display because they are internal. So these internal locomotives are given the external clothes of the other fold. How many of our great stories are thus framed? How many films? Well, here's one. I suppose you judge these things on how powerful the emotions are that the love story evokes. This is a sort of \"Casablanca\" with the genders reversed. The woman needs to stunt her passions and \"give\" her lover to the higher fold, and live forever with the memory of one encounter. I admit, this rings solidly for me. I shake when I shape it in my heart. Back to the judgment: how effectively is this expressed in a way that the film plumbs and guides the waters of the heart it pulls. Does the thing give us tides? Well, the people are beautiful. But oddly, we know these actors from elsewhere and they have been more beautiful there. In particular we depend on Polly Walker here. She has an extraordinary appeal in other projects. \"8 1/2 Women\" was a difficult movie to survey, but once it sticks, it is Polly who pulls us through the canals of desire. \"Enchanted April\" was slight but she was powerful. She acts with her brow and has one of the most appealing brows in film. But, alas. Although lots of money was spent. And the sets are effective, we have something like \"Head in the Clouds\" where we know what we are supposed to get. And we might get it by mere suggestion but the film actually gets in the way. So the bad guys win this time. No passion. Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.",
         "I enjoyed this movie, since I tend to like movies about longing and love. Vincent Perez has eyes that just melt the screen and Polly Walker is breathtakingly gorgeous. I liked the interaction between her character and her Irish friends - especially Frances McDormand whose face says so much with hardly a word. I think it would have been better if they showed a little bit more interaction between Vincent P. and Polly. Loved the actress that read the poem aloud. Her voice is oddly soothing. Also, got a kick out of her friend with the kooky hat! I know this is the type of movie that is more of a woman's movie - I know my husband could probably not sit through it.",
         "This movie badly wanted to be of the \"Thornbirds\" variety, but they tried to cram it all into 2 hours. Unfortunately, this means that all the different plot elements are so rushed as to become nonsensical. You never see the development of the relationship between her and the children, or even much of her and the son. The movie focuses on so much meaningful interaction between her and the father that at first I kept thinking they were going to fall in love. It certainly seemed that way on his part, and the two definitely had a lot of chemistry. Perhaps it was jealousy you see when he finds the postcard? One thing that bothered me is that her governess friends keep endlessly harping on how \"young, beautiful, naive and innocent\" Mary is. Polly was 32 when she played this role, and although she is strikingly beautiful, she is hardly what I would call a girl. Even more so considering the time period of the film. I think a much younger, authentically Irish unknown would have suited the part better. The accents are a little mystifying for me. I don't know much about Spain, but only some of the characters spoke the proper \"lisping\" Castilian Spanish. Everyone else did not. Am I missing something here? The ending was horribly rushed, in my opinion. I understand her choice to leave, but some followup would have been nice. On the whole, this movie left me wanting a few hours more, and it was ultimately disappointing.",
         "This is a very moving and informative drama set just before the eruption of the Civil War in Spain, based on a novel by the Irish writer Kate O'Brien, who died in 1974. The story may have a partially autobiographical background. The lead character in the story is a beautiful young Irish girl, played superbly and with great dignity by Polly Walker, who goes to Spain to act as a governess to an aristocratic and wealthy Spanish family in the 1930s. While there, she becomes drawn into the desperate and fatal intrigues of a country on the brink of civil war, where families such as the one with whom she lives were themselves divided in their loyalties, with tragic consequences. When Walker arrives in Spain, she is also welcomed by a small gaggle of older Irish gals who have been 'dumped' in Spain by the Irish convents because they had disgraced themselves in some way and were considered hopeless cases best expelled to a lonely exile. Two of these stand out. One, brilliantly and evocatively played by the talented and under-rated actress Ruth McCabe, is the jovial character 'O'Toole', whose personal drama unfolds in parallel but unconnected with Walker's own. McCabe steals all the scenes she is in. The other is Agatha Conion, played by a solemn and lonely Frances McDormand, whose 'failing' in Ireland had been her lesbianism, and she stoically bears the first great love of her life, Walker, being unattainable, and even helps her with her own romance. This side of the film is all excellently observed and portrayed. But the main drama takes place in the household of the Areavaga family, who are stupendously rich and pampered aristocrats of divided political opinions. Franco Nero is marvellous as the sadly resigned, gentle, and scholarly father, whose liberal ideas are rejected by his intolerant fascist wife. Their son, romantically portrayed by the dashing Vincent Perez, shares his father's political views and is in conflict with his mother. He is married to a beautiful but ice-cold fascist girl played by Rossy de Palma. The other characters in the family are the two daughters, the older of whom is played by 24 year-old Penelope Cruz, who at the beginning of the film has to be teen-aged, and is therefore made up and dressed in such a bizarre fashion that I barely recognised her at all. The intention was presumably to disguise her age at that stage in the story, but the effect is comical. Later she is allowed to look more like herself. And for those who are curious, I can certify that Penelope is more ravishing in person than on the screen, as her personality and her glow cannot be captured on celluloid or any other medium, transmitted as they are directly through the aethre to the heart. Now we must consider for a moment the tragedy of the Spanish Civil War, which nearly ruined the country and led to such a vast amount of deaths and such horrors of destruction. It is little realized that the entire conflict was artificial, and was engineered, planned, and executed by the Nazi Government of Germany. The inside story is told by Hansjuergen Koehler, in his astonishing book of 1940, 'Inside the Gestapo', in the chapter about Spain. He was a senior defector from the SS who reported directly to Heydrich, and he was himself an active planner of the Civil War in Spain. He lays it all bare in his book, which few people have ever heard of. His account of what really happened is so shocking there are many Spaniards even today who might die of shock if they read it. Koehler reveals, amongst so much else, that Franco was only the second choice of the Germans for Spanish dictator, and that the first choice was an Admiral who let them down at the last moment and had to be replaced by Franco. Koehler makes it clear that only with the secret supply of German armaments and carefully orchestrated sabotage was Franco at last able to overthrow the Republican Government and seize power. In return, Spain became an unofficial colony of Germany for the duration of the War, supplying the Germans, by banal irony, with endless supplies of oranges! What some people will do for a supply of fresh fruit! Well, Polly Walker becomes embroiled in all these intrigues, experiences the violence of the streets and the savage murders, and the full horror of what was going on then. She falls in love with Vincent Perez, and he with her, and this merely increases the insoluble problems they all face. It is a romantic saga which sweeps one away, and it is wonderfully directed by Nick Hamm, a British TV director with a classic stage background who surely has the makings of greater things, as he displays here in extraordinary fashion. He has since directed three more feature films, none of a romantic nature, but to my mind, he would be well advised to try another project like this one, as he seems to have a rare talent for making romance less saccharine than usual (which therefore makes it more meaningful), and he should apply that ability to other romantic tales which have real grit to them, if there are any such projects available and he can get the job. There is one other thing I should say about this film, apart from mentioning its extraordinarily high production values, cinematography, and art direction, and that is the wonderful singing boy, Jose Manuel Ortigosa. He appears suddenly in a romantic scene with Walker and Perez and sings an amazing song with his guitar and then vanishes. Where did they get this kid, and what has happened to him? A wonderful touch!",
         "This movie was a good effort and passable but it wasn't great. There should've been clearer evidence of why Maria went to Spain, why she needed to flee her fiance. I thought Franco Nero, the great actor that he is, should have been given a meatier role. Vincent Perez could've done so much more if only he was given the chance. The love story was rather subtle and I liked that they didn't overdo it like many other movies do. There was only one kissing scene and it wasn't shown if or not they ever consummated their love. It made you hungry for more! They didn't need a reason to fall in love, they just did. SPOILER! I thought the ending was perfect - for once, you don't see the lovers running into each other's arms for the ultimate cliched ending. The political unrest in Spain was well reflected. There was enough of it but to the oblivious like me, who never knew anything about the Franco era in Spain, maybe it would have helped if there was some clarification why there was a civil war, at least a little bit. Watch this movie for a chance to see Penelope Cruz pre-Tom Cruise days.",
         "It seems that some people still don't realise that it was Franco who was the rebel, against a democratically elected government. Part of the tension of the film stems from the fact that father and son are supporters of that government, despite its weaknesses and divisions, and that the wife/mother figure believes that Franco will save the upper classes from socialism. Penelope Cruz has a very minor role in this movie and the role of younger sister is much more important. The differing political views of the sisters are in large part a reflection of differences between the mother and father. To me the romantic element was not key to a movie which I perceived to be in equal measure about culture change and the social attitudes of the period. BTW, Polly Walker reminded me strongly of a young Sophia Loren!",
         "The superficiality of this poor film is its main failing. The Spanish Civil War was not explained at all, much less its byzantine structure, and the whole thing looked to me like an early Disney movie in Technicolor. The music was loud, overbearing, and trite. The bullfight stuff was sanitized, romanticized, and looked like some grade-schooler's idea of what a bullfight might be like. The commentary on the part of all the actors was juvenile and to me insufferable in its naiveté. The romantic stuff was wooden, rote, and simply ghastly, as Maggie Smith might observe. I know a lot about the SCW and Spain and this movie represented none of it. I have no idea what caused others here to think it good."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Kan Zamia-a",
         "Kanzaman",
         "Polaris Pictures"
      ],
      "summaries": ["This is the story of a young Irish woman who comes to Spain to escape from the pressures she feels about her impending marriage to a political activist in Ireland. But in Spain in the 1930's, taking a job of governess in a wealthy family, she finds the same kinds of political unrest. In fact, it isn't long before she finds herself attracted to a married man who is similarly involved in the struggle against fascism and Franco. This awakens her to her nature that brings her to such men and resolves for her what she must do about the life she left in Ireland."],
      "budget": 0
   },
   "movielensId": 887,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-30",
      "dvdReleaseDate": "2004-01-13",
      "directors": ["Nick Hamm"],
      "runtime": 96,
      "movieId": 887,
      "title": "Talk of Angels",
      "mpaa": "",
      "actors": [
         "Polly Walker",
         "Frances McDormand",
         "Vincent Pérez",
         "Franco Nero",
         "Marisa Paredes",
         "Penélope Cruz",
         "Ariadna Gil",
         "Rossy de Palma",
         "Francisco Rabal",
         "Britta Smith"
      ],
      "imdbMovieId": "0120271",
      "originalTitle": "Talk of Angels",
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": ["f8HvaXsVq3I"],
      "plotSummary": "This is the story of a young Irish woman who comes to Spain to escape from the pressures she feels about her impending marriage to a political activist in Ireland. But in Spain in the 1930's, taking a job of governess in a wealthy family, she finds the same kinds of political unrest. In fact, it isn't long before she finds herself attracted to a married man who is similarly involved in the struggle against fascism and Franco. This awakens her to her nature that brings her to such men and resolves for her what she must do about the life she left in Ireland",
      "tmdbMovieId": 56077,
      "avgRating": 2.94898,
      "releaseYear": "1998",
      "numRatings": 49,
      "posterPath": "/ipDXrPjOLDBlBA4qB6Lo7Gm3jlI.jpg"
   }
}