{
   "tmdb": {
      "original_language": "nl",
      "keywords": [],
      "imdb_id": "tt0109001",
      "video": false,
      "title": "1-900",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Thomas",
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad51b",
               "name": "Ad van Kempen",
               "profile_path": null,
               "id": 211203,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "54736b009251415cfc002cdb",
               "name": "Ariane Schluter",
               "profile_path": "/hRoNRFW1fTKLatWr507tR5peWZD.jpg",
               "id": 45746,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe49eac3a36847f81ad513",
            "name": "Theo van Gogh",
            "profile_path": null,
            "id": 28889,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.143272,
      "production_countries": [],
      "id": 101230,
      "vote_count": 1,
      "budget": 0,
      "overview": "Sarah, 30, single, well educated, likes art, places a voice ad for phone sex, inviting replies from men under 35, sturdy and sensual. Wilbert, a chubby middle aged architect, leaves a message that he is Thomas, 32 and well formed. A week later, she phones. She likes his voice, he likes her laugh, so once a week she phones him (he's not to know her last name, where she lives, or her number). Portraits emerge of humor and sadness. He presses for details of her life and tells her about his work; she wants these Thursday calls to be fantasy and release, separate from the rest of who she is. The film dramatizes these tensions of lies and truth, connection and distance. Written by",
      "similar": [],
      "original_title": "06",
      "runtime": null,
      "poster_path": "/xnsvk2a8BbvGfnFdynKSuA4qVFq.jpg",
      "spoken_languages": [
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "1994-09-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Theo van Gogh"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Johan Doesburg",
         "Johan Doesburg"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0109001/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0Mzk2OTM1MV5BMl5BanBnXkFtZTcwOTU4MDEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ariane Schluter, Ad van Kempen | See full cast and crew »"],
      "reviews": [
         "Theo van Gogh (distant relative of Vincent), the enfant terrible of the Dutch film 'industry' has created a pretty entertaining short movie. Certainly not sexually arousing to me but interesting and funny. Although the cast consists of only two actors in two different locations it didn't bore me. Made for (if I clearly remember) only 250.000 Dutch guilders (divide by 2 for US$). Quite a feat by itself. I liked the scene in which Wilbert impersonates a professional interviewer asking Sarah very explicit intimate sexual questions in a very formal and quick manner.",
         "Theo Van Gogh (a distant relative of the great artist Vincent with the same name as his brother) who was brutally murdered in Holland recently by Muslims, has a lasting tribute here in this tale about a connection made between two people on the phone lines. A good film about the telephone psyche that can occur with \"phone sex.\" Although this film appears to be rough-edged and the English subtitles are a bit annoying, there is a dynamic magnetism that draws you forward and if you can \"suspend your disbelief\" (Coleridge) for just a bit, this is good entertainment. Haunting and surreal this story is believable. A 30 year old woman places a voice ad for \"phone play\" and lures an innocent unsuspecting fellow into a phone connection that becomes mutually exclusive. The two of them think of each other constantly and the obsession leads to some interesting telephone encounters. The director only shows the nose, mouth and chin of the fellow and the girl is shrouded in perpetual darkness, showing only the back or top of her head, or just her body slouched languorously on her couch or bed. This allows the audience to identify with the telephone experience of \"phone play\" relating to not knowing what the other person looks like. The immediacy, panic and fury that ensues is quite exciting. One encounter has the man in a hurry to catch a flight on a business trip only to have her persuade him to take a few moments to get \"off\" in a panic \"quickie.\" Another scene has him persuade her to let him listen to her \"go\" in the toilet when nature calls which leads eventually to erotic passion for both of them. Another sequence shows them getting emotionally attached while chatting as she twirls her hair nonchalantly alternating her hand between her hair and groping over the rest of her body in the dark secret recesses of her living room. This is cheap and vulgar entertainment suitable only for late night adult viewers. This film does have its place, however, and taken in context and for what it is worth, this film is not a bad effort. More stimulating and inspirational, in fact, than a lot of the crap that is currently out there. If you let your imagination got to work, this film is somewhat erotic and arousing which is what \"phone play\" is all about anyways.",
         "After the brutal killing of Theo van Gogh yesterday 2-11-2004 numerous dutch TV stations showed interviews and documentaries of the late director and two even showed one of his films each. Not having yet seen a movie by the controversial dutch filmmaker and somewhat shocked by his brutal death I decided to watch both films, one late in the evening and one at night. The first film to be shown was \"Vals Licht\", but due to altered programming of the TV station that showed it (RTL 5) the film ran late (there were numerous interviews and documentaries on van Gogh before the film) and it would have been impossible for me to watch both films. Having seen the fist 20 minutes of Vals Licht and concluding that the lead actress () would not be too convincing, I decided to watch \"06\" on Nederland 3 instead. The film is about two 30-somethings that engage in a telephone relationship after 'meeting' on a telephone sex line. The first part of the film, involving the first conversation is actually quite exciting and arousing, but soon, I found myself wondering about the motives of the main actors and I must say that this is where van Gogh went wrong with the film. I mean there just is not enough to cover 90 minutes of film with and keep the audience interested. There isn't really any hint to why the characters do certain things and as surprising as the twist at the end may have been for some, it took me just 30 seconds to figure it out. Not a bad effort, but not a good one either. You need not have seen this, but I guess it is somewhat passable. 06 out of 010",
         "Story about 2 people having phone-sex over a period of time. So, really all you see is 2 people on the phone. Turns out these two have about the flattest characters around... This is a great story for a short movie of let's say 20 to 30 minutes, not for a full-length 90 minutes or so... The conversations start to get really boring after a period of time... You keep on wondering, when is something new going to happen? A silly attempt from shock-director Van Gogh (yes, (very distant related), there just isn't anything going on... Still, some funny moments here and there... 4/10.",
         "Yaaaawn! I'm so sick and tired of all these wannabe controversial directors and their supposedly 'groundbreaking' cinema ideas! Give it up boys; you're not shocking anybody with your lame crap! Here we have a new prodigy from the Netherlands \u0096 Theo Van Gogh \u0096 who thought it would be a cool idea to shoot a film about two people nagging over the phone the whole time. A middle-aged divorced man responds to an ad in the paper, placed by a younger woman who offers phone-sex. They make it weekly appointment and they quickly find out their whole lives turns around these weekly conversations now. They masturbate to each other's voice, argue about whether they depend on each other or not \u0085and then masturbate some more. Very boring and utterly annoying. Maybe it could have worked as a 5 (or max. 10 minutes) sketch in an educational talk show or something, but not as a full-length film. And most of all: you get the feeling that you're not supposed to see this! It's voyeuristic and low\u0085not the least bit artistic"
      ],
      "genres": [
         "Romance",
         "Drama"
      ],
      "productionCompanies": ["Dino Filmprodukties"],
      "summaries": ["Sarah, 30, single, well educated, likes art, places a voice ad for phone sex, inviting replies from men under 35, sturdy and sensual. Wilbert, a chubby middle aged architect, leaves a message that he is Thomas, 32 and well formed. A week later, she phones. She likes his voice, he likes her laugh, so once a week she phones him (he's not to know her last name, where she lives, or her number). Portraits emerge of humor and sadness. He presses for details of her life and tells her about his work; she wants these Thursday calls to be fantasy and release, separate from the rest of who she is. The film dramatizes these tensions of lies and truth, connection and distance."],
      "budget": 0
   },
   "movielensId": 889,
   "movielens": {
      "languages": [
         "Nederlands",
         "English"
      ],
      "releaseDate": "1994-09-01",
      "dvdReleaseDate": "2002-07-23",
      "directors": ["Theo van Gogh"],
      "runtime": 0,
      "movieId": 889,
      "title": "1-900",
      "mpaa": null,
      "actors": [
         "Ad van Kempen",
         "Ariane Schluter"
      ],
      "imdbMovieId": "0109001",
      "originalTitle": "06",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Sarah, 30, single, well educated, likes art, places a voice ad for phone sex, inviting replies from men under 35, sturdy and sensual. Wilbert, a chubby middle aged architect, leaves a message that he is Thomas, 32 and well formed. A week later, she phones. She likes his voice, he likes her laugh, so once a week she phones him (he's not to know her last name, where she lives, or her number). Portraits emerge of humor and sadness. He presses for details of her life and tells her about his work; she wants these Thursday calls to be fantasy and release, separate from the rest of who she is. The film dramatizes these tensions of lies and truth, connection and distance. Written by",
      "tmdbMovieId": 101230,
      "avgRating": 3.37023,
      "releaseYear": "1994",
      "numRatings": 131,
      "posterPath": "/xnsvk2a8BbvGfnFdynKSuA4qVFq.jpg"
   }
}