{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "assassination",
            "id": 441
         },
         {
            "name": "train station",
            "id": 477
         },
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "los angeles",
            "id": 12670
         }
      ],
      "imdb_id": "tt0113972",
      "video": false,
      "title": "Nick of Time",
      "recommendations": [
         2900,
         4477,
         11560,
         11088,
         2275,
         1909,
         9415,
         9271,
         178,
         11074,
         11384,
         11062,
         9057,
         12103,
         7007,
         12123,
         7548,
         9208,
         10859,
         1428
      ],
      "backdrop_path": "/ccBkUeSqxnHduFrTTTjJEoi4OkC.jpg",
      "revenue": 8175346,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Gene Watson",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f80421dd",
               "name": "Johnny Depp",
               "profile_path": "/ctaca3ALycPP0vPhRSYK5DTBEPF.jpg",
               "id": 85,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Lynn Watson",
               "gender": 1,
               "credit_id": "52fe4334c3a36847f80421e1",
               "name": "Courtney Chase",
               "profile_path": "/pFnq6LRYWjUCTZ8HjGC3uwUOBB0.jpg",
               "id": 21365,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Hucy",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f80421e5",
               "name": "Charles S. Dutton",
               "profile_path": "/ajXBoMz8xGgDDcn8xpRi8LmXKKa.jpg",
               "id": 17764,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Mr. Smith",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f80421e9",
               "name": "Christopher Walken",
               "profile_path": "/ApgDL7nudR9T2GpjCG4vESgymO2.jpg",
               "id": 4690,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Ms. Jones",
               "gender": 1,
               "credit_id": "52fe4334c3a36847f80421ed",
               "name": "Roma Maffia",
               "profile_path": "/tfscWeBOGA9aysLbYoOduimpTOk.jpg",
               "id": 21366,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Brendan Grant",
               "gender": 2,
               "credit_id": "52fe4334c3a36847f80421f1",
               "name": "Peter Strauss",
               "profile_path": "/ufx1trct43k7UcT4DpoIMPZXi5A.jpg",
               "id": 21368,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Krista Brooks",
               "gender": 1,
               "credit_id": "52fe4334c3a36847f80421f5",
               "name": "Gloria Reuben",
               "profile_path": "/z0FzEdJo8XnPGTS8pQcl10lpsNZ.jpg",
               "id": 21369,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Gov. Eleanor Grant",
               "gender": 1,
               "credit_id": "52fe4334c3a36847f80421f9",
               "name": "Marsha Mason",
               "profile_path": "/1iTPM9ciKMFb5RzePlcKhfWO0Fb.jpg",
               "id": 19131,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Franco (Governor's Bodyguard)",
               "gender": 2,
               "credit_id": "56d630bcc3a3681e4401a5de",
               "name": "Miguel Nájera",
               "profile_path": "/inkolHpGkf9uVZkjdzhOLfttbvT.jpg",
               "id": 203762,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Officer Trust",
               "gender": 2,
               "credit_id": "56d631e2c3a3682cef006dea",
               "name": "Bill Smitrovich",
               "profile_path": "/rO5wJpx7ZlT6RaunZw20OGF6O2Y.jpg",
               "id": 17200,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Mystery Man",
               "gender": 2,
               "credit_id": "56d631fac3a3681e4401a633",
               "name": "G.D. Spradlin",
               "profile_path": "/As8yIxmq1dXRIiZE4uFIsbNcoS6.jpg",
               "id": 1269763,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Sanitation Engineer",
               "gender": 2,
               "credit_id": "56d63228c3a3681e3c01a78c",
               "name": "Charles Carroll",
               "profile_path": "/5sGsNA3iVsjt3vXxNH5aK3P7toG.jpg",
               "id": 60287,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f80421a3",
               "name": "John Badham",
               "profile_path": "/vWzb3cQz4qYtfXQ6qyCrSTw61xA.jpg",
               "id": 12840,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f80421a9",
               "name": "Patrick Sheane Duncan",
               "profile_path": null,
               "id": 21101,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f80421af",
               "name": "John Badham",
               "profile_path": "/vWzb3cQz4qYtfXQ6qyCrSTw61xA.jpg",
               "id": 12840,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f80421b5",
               "name": "Arthur B. Rubinstein",
               "profile_path": null,
               "id": 12845,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4333c3a36847f80421bb",
               "name": "Roy H. Wagner",
               "profile_path": null,
               "id": 21362,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4333c3a36847f80421c1",
               "name": "Frank Morriss",
               "profile_path": null,
               "id": 12419,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f80421c7",
               "name": "Kevin Stitt",
               "profile_path": null,
               "id": 11001,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4334c3a36847f80421cd",
               "name": "Carol Lewis",
               "profile_path": null,
               "id": 21363,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4334c3a36847f80421d3",
               "name": "Philip Harrison",
               "profile_path": null,
               "id": 10936,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "54d542c2c3a3683b8c0000e4",
               "name": "Eric Orbom",
               "profile_path": null,
               "id": 14492,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 11.233036,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2086,
      "vote_count": 244,
      "budget": 8169363,
      "overview": "Gene Watson is a public accountant who arrives on a train at Union Station in Los Angeles, accompanied by his 6-year-old daughter Lynn. Because of his ordinary looks, he is approached by a pair of sinister people named Smith and Jones.",
      "similar": [
         16995,
         10139,
         9798,
         9388,
         9654,
         3580,
         4723,
         35056,
         193893,
         2453,
         1266,
         77953,
         5236,
         6637,
         4771,
         218,
         829,
         856,
         115,
         522
      ],
      "original_title": "Nick of Time",
      "runtime": 90,
      "poster_path": "/3kYcyD9yAjdjimYlIiGPfdMVbZb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-11-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Badham"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Patrick Sheane Duncan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113972/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1OTk4OTM2NF5BMl5BanBnXkFtZTYwNzE4OTc4._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Johnny Depp, Christopher Walken, Courtney Chase | See full cast and crew »"],
      "reviews": [
         "A clever idea - an thriller played along real time to involve the viewer directly in the tension and pressure of the deadlines. Depp is forced to kill a senator or his daughter will be killed by Walken and Maffia. He is given a gun and a time limit to carry it out. As the basis for a thriller it doesn't quite work - the real time concept falls apart a few times, but with this much talent on board it still holds it own. A throwback to the Hitchcock everyman thrillers of years ago, Depp plays his character well and you always believe he is just an ordinary man in an unbelievable situation rather than an action hero in the making while Walken does what he does best and plays the villain well. The plot holds together well and you really find stuff out at the same time as Depp does. Some of the conspiracy stuff towards the end of the film is obvious and doesn't add anything to the film, but the main story revolving around Depp and Walken is tense enough to carry the film. It doesn't contain any explosions or martial arts but the tension is good throughout. It's not a classic thriller but it's quite an original idea and plot and almost manages to keep the tension for the whole movie.",
         "I thought this was a pretty good movie. A suspenseful movie, Hitchcockian in that an innocent man gets involved in a deadly plot. An intriguing plot that had me thinking what I would do in the situation. Christopher Walken was, as usual, creepy and Johnny Depp was believable. The rest of the cast was very competent. I'd advise renting it. Not a special effects extravaganza but a nicely written fast moving movie.",
         "Johnny Depp takes a break from his usual roles as outcasts, in this playing a clean-cut accountant who travels by train back to LA with his daughter after the wake of his deceased ex-wife. Upon entering the station, 2 people show him a police badge, take him into a van, and blackmail him into assassinating the governor in one hour or else they'll kill his daughter. The remainder of the entire movie takes place in a hotel where the paranoid atmosphere gives clues about how big the conspiracy is and the political motives behind it; with nearly everyone keeping their eye on him and very little time, he's faced with the difficult task of getting out of this situation. A must-see if you like edge of your seat excitement and an excellent cast, with Depp (great as Gene Watson), Marsha Mason, Charles S. Dutton, and Christopher Walken, playing the most despicable bad guy since Laurence Olivier in \"Marathon Man\".",
         "I've read a lot of poor reviews for this movie. I don't understand it. The move is very good, it's not a 5 star movie, but it's still good. Johnny Depp (Edward Scissorhands, Ed Wood) stars as an average guy whose wife has just recently died. One day on the way home, Depp and his daughter are kidnapped by two people, one of them being Christopher Walken (The Deer Hunter, The Dead Zone). They tell him that his daughter will die if he doesn't kill a certain person. He soon finds out that this person is the Governor of his state. They give him a gun and tell him that if she's not dead by a certain time his daughter is dead. This is a great premise for a suspense movie and is carried out very well. The great Charles S. Dutton (Rudy, Mimic) plays a shoe-shiner who helps Depp. Depp is solid as the father in a role that's different from a lot of his earlier roles. The always excellent Walken is, as usual, awesome as the bad guy, a role I always love to see him in. The film keeps you going, by offering a couple of nice twists. Ignore the reviews and rent this movie.",
         "\"Nick of time\" is directed by John Badham - man behind an amusing 70's classic \"Saturday Night Fever\". It was a funny and a jovial little flick but this one goes maybe just a little bit further. \"Nick of time\" is a splendid, action-packed and entertaining thriller and it creates lots of excitement by practically stealing good ideas from dozens of other thrillers but still keeping the own basic idea as unique as possible. Even though this isn't actually the greatest movie of Johnny Depp or Christopher Walken (mostly because they've appeared in too many unforgettable masterpieces) it's impossible to deny the fact that their roles in here are quite amazing. Depp is great as an ordinary dad of a little girl who's facing the trial of his life and Walken has always been magnificent in the role of a villain. His mean performance as a blackmailer called Mr. Smith is just fabulous. Although \"Nick of time\" is basically an excellent stuff the idea of the film is unfortunately way too unbelievable. Could this actually happen and is this the way assassins work? Not necessarily... It won't bother too much if you just let the the increasing tension get a hold of you. Best thing of this movie is the fact that it's got absolutely nothing unnecessary in it and it certainly isn't over-long. Exquisite \"Nick of time\" is an interesting film and it does exactly what it's supposed to do. One of the most functional and successful thrillers of the mid-90's.",
         "I went to see this movie in the theater and I have to say that it is one of the most underrated films I have ever seen. This movie received a lot of bad press when it was released but I don't see how it was justified. The story is great and it makes you nervous watching it unfold. You will know what I am talking about if you see it. Christopher Walken gives another great performance as the \"policeman\" as he calls himself. Walken's voice is one of the best in the business. I highly recommend this movie if you want to be entertained with a great suspenseful film.",
         "This is one of the most suspenseful movies you'll ever see, but that good for only viewing. After you've seen it, the impact is greatly lost for further viewings. It got panned by many critics for having too far-fetched a storyline, and I agree. However, if you can put your brain on \"hold\" for 90 minutes, you'll enjoy the movie. The only annoying part for me was the typical Liberal bias in here where the Liberal politician is the target of a Conservative fanatic. They never show you the other way around. At least the writers here were somewhat subtle. As interesting the characters as Johnny Depp usually plays, the two villains in here were more fun to watch than him. Christopher Walken and Roma Maffia were riveting as the killers. Depp actually played a normal person, which is not normal for him. The suspense was so good, I could hardly watch parts of this. That was the best part of the movie. The worst may have been the so-overplayed cliché of the killers hesitating before shooting and then, because of that, being shot themselves. That is so tiresome. Or sometimes the crooks talk instead of shoot, and then are shot. It's one of critic Robert Ebert's biggest pet peeves and I agree with him. It's another reason this film got low grades by most critics. However, this \"real time\" movie (trying to get the viewer even more involved), is guaranteed, if you've never seen it, to give you an entertaining hour-and-a-half.",
         "An young accountant Gene Wilson (Johnny Deep) arrived at L.A.'s Union Station with his daughter (Courtney Chase). From the moment, they arrived, two mysterious strangers (Oscar-Winner:Christopher Walken and Roma Maffia) separate him from his daughter. One of them proposed Gene to assassinate a government official (Marsha Mason) or else, they will murder his daughter. Directed by John Badham (The Hard Way, Short Circuit, Stakeout) made an entertaining, clever if barely believable. suspense thriller that was filmed in \"real time\". Which it doesn't always paid off, especially the director used endless close-up of clocks. Which does at times makes this movie claustrophobic but not enough. This was one of the major box office flops and critical disappointments of 1995. But the picture plays surprisingly better on video and went on to have a sort of a cult following years later. DVD has an fine anamorphic Widescreen (1.78:1) transfer and an good-Dolby Digital 5.1 Surround Sound. DVD's only extra is the theatrical trailer. What makes this flawed movie watchable is a game cast, sometimes amusing dark sense of humour and a few good moments of genuine suspense. But at times, the film nearly falls apart from the unlikely false plot moment near the third act and an unsatisfying conclusion. Despite all this, this is a well directed picture that certainly worth a look of this truly real mixed bag film. Written by Patrick Sheane Duncan (Courage Under Fire, A Home of Our Own, Mr. Holland's Opus). (*** ½/*****).",
         "When you see the name Wes Craven, John Carpenter or Brian de Palma, we know that we can trust that we're in for a couple of hours of fine entertainment. Although not as much a household name as the directors above, John Badham knows how to tell a suspenseful story as well as any of the other \"kids on the block.\" Please look up his filmography and see all the countless house of excellent entertainment he has brought us; not only on the big screen but on television as well. In \"Nick of Time\" John carefully guides us through one disaster after another. Johnny Depp conveys his frustration and fear that he might not be able to prevent any of the bad things that will happen. Christopher Walken again proves that he is as comfortable being the \"heavy\" as he has been the \"hero.\" At a time when sometimes the good guys don't always win and the bad guys sometimes \"get away with it,\" this is one cinematic thriller that should keep you on the edge of your seat the whole 90 minutes.",
         "The first time I saw this movie a couple of years ago I thought it was pretty good. Seeing it again I can't remember what I thought was good about it. There are some enjoyable things like Johnny Depp and Christopher Walken; it seems that everything these actors do has some joy in it. Another nice thing is that the movie plays in real time. The movie is ninety minutes long, and so is the story. Walken orders Depp to kill a woman, the governor of California (Marsha Mason), and to persuade him he and some others kidnap his little daughter. He is given a gun by Walken. He has ninety minutes to do so and we see that ninety minutes. My problem with this movie is the Walken character. Although he is enjoyable to watch, he pops up everywhere, only to serve the plot and make things harder for Depp. Help comes from Huey (Charles S. Dutton), how I will not reveal, but his qualities and handicaps are only there to serve the plot, again. There are some clever moments, I liked them, but I kept wondering things. Pretty early in the movie we learn that almost everybody is in the conspiracy to kill the woman, including members of the security. There must have been an easier way to kill this woman when security is on your side. I kept thinking about that, spoiling parts of the movie for me. Still, if you like Depp or Walken you might enjoy this since both are on screen almost the entire time."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Gene Watson is a public accountant who arrives on a train at Union Station in Los Angeles, accompanied by his 6-year-old daughter Lynn. Because of his ordinary looks, he is approached by a pair of sinister people named Smith and Jones. Pretending to be cops, Smith and Jones kidnap Lynn and confront Gene with a simple choice -- kill California governor Eleanor Grant in 90 minutes or less, or Lynn will die. Watson is given a gun, six bullets, and a name tag, and he is told to go to the Westin Bonaventure Hotel and kill Eleanor, who is giving an afternoon speech. While Jones is watching Lynn in a van, Smith watches Watson in order to prevent Watson from alerting the authorities. Watson must quickly find some way to get himself and Lynn out of this seemingly impossible situation.",
         "Gene Watson arrives home in Los Angeles, after attending his ex-wife's funeral, with his daughter. Soon, his daughter is kidnapped. He is given a gun, and the picture and itinerary of a person, and told that if he hasn't killed that person in one hour and fifteen minutes, his daughter will be killed. We then follow him through that time.",
         "Gene Watson is an ordinary public accountant returning home from his ex-wife's funeral and is met by Mr Smith and Ms. Jones who kidnap his daughter and give him a gun, six bullets, a name-tag that will give him access to anywhere in a specific hotel, and the itinerary of Governor Grant and is informed that he must kill the Governor in 1 hour and 15 minutes or his daughter will die. The rest of the movie follows Mr. Watson as he desperately attempts to warn the Governor without the knowledge of the two and finds out that the conspiracy against her reaches all the way to those she trusts most.",
         "An unimpressive, every-day man is forced into a situation where he is told to kill a politician to save his kidnapped daughter."
      ],
      "budget": 0
   },
   "movielensId": 89,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-11-22",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["John Badham"],
      "runtime": 90,
      "movieId": 89,
      "title": "Nick of Time",
      "mpaa": "R",
      "actors": [
         "Johnny Depp",
         "Courtney Chase",
         "Charles S. Dutton",
         "Christopher Walken",
         "Roma Maffia",
         "Peter Strauss",
         "Gloria Reuben",
         "Marsha Mason",
         "Miguel Nájera",
         "Bill Smitrovich",
         "G.D. Spradlin",
         "Charles Carroll"
      ],
      "imdbMovieId": "0113972",
      "originalTitle": "Nick of Time",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["o6trRzB8fiA"],
      "plotSummary": "Gene Watson is a public accountant who arrives on a train at Union Station in Los Angeles, accompanied by his 6-year-old daughter Lynn. Because of his ordinary looks, he is approached by a pair of sinister people named Smith and Jones.",
      "tmdbMovieId": 2086,
      "avgRating": 3.13355,
      "releaseYear": "1995",
      "numRatings": 3478,
      "posterPath": "/3kYcyD9yAjdjimYlIiGPfdMVbZb.jpg"
   }
}