{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0094822",
      "video": false,
      "title": "Baton Rouge",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ana Alonzo",
               "gender": 1,
               "credit_id": "52fe4e8a9251416c91135111",
               "name": "Victoria Abril",
               "profile_path": "/qVszystVNlXomQQrhM9u3joaw9P.jpg",
               "id": 25256,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Antonio",
               "gender": 2,
               "credit_id": "52fe4e8a9251416c91135115",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Isabel",
               "gender": 1,
               "credit_id": "52fe4e8a9251416c91135119",
               "name": "Carmen Maura",
               "profile_path": "/6YU3CAWmlSy13aRUG2QWRZlJab5.jpg",
               "id": 2744,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "5a40cb010e0a264fb901d312",
            "name": "Rafael Moleón",
            "profile_path": null,
            "id": 1726049,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.974771,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 253632,
      "vote_count": 1,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "Baton Rouge",
      "runtime": null,
      "poster_path": "/q5aIioZ9qlBcwC6jfue371i2Mrj.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "1988-10-08",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rafael Monleón"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Agustín Díaz Yanes",
         "Rafael Monleón"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0094822/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0OTY5MTc1NF5BMl5BanBnXkFtZTcwNDk3OTYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Victoria Abril, Carmen Maura, Antonio Banderas | See full cast and crew »"],
      "reviews": ["Antonio Banderas was young then (mid-1980s) and he was just perfecting his smoldering STARE. He's groping breasts. He's jamming fingers in women's mouths. He's sticking other things in other places. He's the swaggering Latin star that set Madonna's and Melanie Griffith's hearts a thumpin'. But there's nothing in this movie that suggests his character is anything but surface (albeit, a constantly fornicating surface). There's hardly a character that remotely resembles a human being here. The three main characters that dance about undressed with plots and doublecrosses in their heads are there to just serve a storyline. They are not believable people. The butch Carmen Maura is a puppy dog rich woman who hooks Banderas at a service station and never lets go. Victoria Abril as the pseudo-psychologist who helps Maura with her rape-filled nightmares is as convincing as CarrotTop acting as Napoleon. This is the kind of film where plot motivations seemingly come out of nowhere, yet the characters seem to find it perfectly natural to suddenly scheme to kill another person. There is no breath or logical unfolding to scenes, therefore, the whole piece feels contrived. What twists do occur can be seen for miles, for days, for light-years away. The title is derived from Banderas' mute brother's (who's been silent since his mom died - why? - we're never told) desire to take a trip from South America (the film's locale) to the famed city in Louisiana. Why does the mute kid want to go there? Your guess is as good as any. It's another one of those cute \"foreign\" kind of things typical of international films that are there for atmosphere and not much sense. There's no sense in your visiting this Baton Rouge anytime soon. My rating * out of ****."],
      "genres": [
         "Crime",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Modigil"],
      "summaries": [
         "Isabel, donna ricca e matura, è ossessionata da un presunto blocco sessuale e cerca di farsi curare dalla giovane psichiatra Ana. Nel frattempo, Antonio, giovane e affascinante, la seduce per impossessarsi della sua ricchezza. In questo si accorda con Ana, che, non molto professionalmente, accetta la situazione. Ambigua e priva di scrupoli, la dottoressa diventa complice del giovane, con il quale escogita un complicato e raffinato piano per eliminarla. Ma ci sarà una sorpresa finale !",
         "Antonio dotes on his mute brother and promises him a better life, symbolized by Baton Rouge. He's a gigolo who moves in with Isabel, wealthy and separated from her husband. She has nightmares of rape in her own bed, so Antonio encourages her to consult a psychiatrist; they end up in the office of Ana, a young doctor. As part of the exam, Ana visits Isabel where she catches Antonio pocketing a blank check Isabel has signed. Ana pushes him into an elaborate scheme to blackmail Isabel, making it seem she has killed her husband during a nightmare. All goes smoothly until Antonio sees the body: it's not the man he thought was Isabel's husband. In whose game is he a pawn?"
      ],
      "budget": 0
   },
   "movielensId": 890,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1988-10-08",
      "dvdReleaseDate": null,
      "directors": ["Rafael Moleón"],
      "runtime": null,
      "movieId": 890,
      "title": "Baton Rouge",
      "mpaa": null,
      "actors": [
         "Victoria Abril",
         "Antonio Banderas",
         "Carmen Maura"
      ],
      "imdbMovieId": "0094822",
      "originalTitle": "Baton Rouge",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 253632,
      "avgRating": 3.13636,
      "releaseYear": "1988",
      "numRatings": 33,
      "posterPath": "/q5aIioZ9qlBcwC6jfue371i2Mrj.jpg"
   }
}