{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "disguise",
            "id": 18118
         }
      ],
      "imdb_id": "tt0117991",
      "video": false,
      "title": "Twelfth Night",
      "recommendations": [
         23817,
         49969,
         51333,
         48833,
         26156,
         49963,
         25985,
         48345,
         68430,
         34322,
         36709,
         109991,
         52654,
         18451,
         21868,
         13891,
         35151,
         19103,
         17920,
         28519
      ],
      "backdrop_path": "/60jhnDUFce7UgfggGFjBISztyid.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Olivia",
               "gender": 1,
               "credit_id": "52fe4698c3a36847f81076c1",
               "name": "Helena Bonham Carter",
               "profile_path": "/rHZMwkumoRvhKV5ZvwBONKENAhG.jpg",
               "id": 1283,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sir Andrew Aguecheek",
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076c5",
               "name": "Richard E. Grant",
               "profile_path": "/jMnSjjPQwCOAJ1kPRXLbh0WnsPa.jpg",
               "id": 20766,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Malvolio",
               "gender": 0,
               "credit_id": "52fe4698c3a36847f81076c9",
               "name": "Nigel Hawthorne",
               "profile_path": "/jKG3trCa3RGE6h5yzjMOramfoed.jpg",
               "id": 15788,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Feste",
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076cd",
               "name": "Ben Kingsley",
               "profile_path": "/2Eu3j31JDJek70ZXLY6xfeUaJoR.jpg",
               "id": 2282,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sir Toby Belch",
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076d1",
               "name": "Mel Smith",
               "profile_path": "/t9aojcL97IStdae9fP90D84NlSJ.jpg",
               "id": 141450,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe4698c3a36847f81076d5",
               "name": "Imelda Staunton",
               "profile_path": "/mKlkh0AuYPD5HjmnlrW0uPm5QvJ.jpg",
               "id": 11356,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Duke Orsino",
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076d9",
               "name": "Toby Stephens",
               "profile_path": "/zZAbK5QVmZSqZzAe16mXWzgjrSs.jpg",
               "id": 10881,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Viola",
               "gender": 1,
               "credit_id": "52fe4698c3a36847f81076dd",
               "name": "Imogen Stubbs",
               "profile_path": "/osr7TepyQdENiyy4iYi8zfWzIx.jpg",
               "id": 20769,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Sebastian",
               "gender": 2,
               "credit_id": "59fc29edc3a3681a1b027bb7",
               "name": "Steven Mackintosh",
               "profile_path": "/3TQVLNfMiiBAcoaCbmWckxXqagN.jpg",
               "id": 978,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Antonio",
               "gender": 2,
               "credit_id": "59fc29fb92514113e7025fff",
               "name": "Nicholas Farrell",
               "profile_path": "/t1I4m6x2aAki1pRueK6pxbi7j9s.jpg",
               "id": 32357,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Fabian",
               "gender": 2,
               "credit_id": "59fc2a2792514113dd02595a",
               "name": "Peter Gunn",
               "profile_path": null,
               "id": 83548,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Party Guest/Dancer (uncredited)",
               "gender": 2,
               "credit_id": "5a67d2be9251411bb8000f4c",
               "name": "David Burke",
               "profile_path": "/chZOTgwqyUiD4DgIM392L1mR1kM.jpg",
               "id": 1220099,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076e3",
               "name": "Stephen Evans",
               "profile_path": null,
               "id": 39992,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076e9",
               "name": "Trevor Nunn",
               "profile_path": null,
               "id": 98750,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076f3",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe4698c3a36847f81076f9",
               "name": "Trevor Nunn",
               "profile_path": null,
               "id": 98750,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5ab29e41c3a3686fbd00d5d3",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.334653,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 44705,
      "vote_count": 27,
      "budget": 0,
      "overview": "Shakespeare's comedy of gender confusion, in which a girl disguises herself as a man to be near the count she adores, only to be pursued by the woman he loves.",
      "similar": [
         1024,
         24420,
         1259,
         276,
         19913,
         1643,
         13523,
         226,
         44564,
         17612,
         1903,
         68718,
         38050,
         50544,
         50546,
         46705,
         862,
         13,
         38,
         86331
      ],
      "original_title": "Twelfth Night",
      "runtime": 134,
      "poster_path": "/3P83G5fXWVk6nUpzhv9BmaWwuxG.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         },
         {
            "logo_path": "/rUp0lLKa1pr4UsPm8fgzmnNGxtq.png",
            "name": "Summit Entertainment",
            "id": 491,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Renaissance Films",
            "id": 3102,
            "origin_country": ""
         }
      ],
      "release_date": "1996-10-31",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Trevor Nunn"],
      "runtime": 134,
      "synopsis": null,
      "writers": [
         "William Shakespeare",
         "Trevor Nunn"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117991/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI5NDk2ODMwMl5BMl5BanBnXkFtZTcwNzM1MDEzMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Helena Bonham Carter, Richard E. Grant, Imogen Stubbs | See full cast and crew »"],
      "reviews": [
         "Reading Trevor Nunn's thoughts on his film, it is easy to conclude that they were lucky to obtain such sublime weather for the large duration of the filming, in November. The Cornwall locations are absolutely enchanting; showing an England so far from the urban norm these days. The beautiful natural light, with later dark contrasts, perfectly complements the jovial, winning mood of this Shakespeare comedy brought to screen: and, what is more, this is truly beyond any sense of 'heritage cinema', as Shakespeare's genius is retained. Yes, it is all a very 'accessible' package, but much is unusual and distinctive to this film adaptation. Ben Kinglsey is perhaps the most glaring instance of a radical re-invisioning; his acting - stripped bare of artifice - is utterly compelling and keeps you watching his every mannerism. This Feste is an eccentric, multi-talented clown and performer, but he also bears words of cutting, melancholy truth. Indeed, both are wonderfully combined with the gorgeously sad scene of Staunton, Grant and Smith listening to his sad song: they listen and the words cut into their veneers. Loneliness is at their very core. What a brilliantly rounded comedy this is; balanced by melancholy - the inch-perfect awry note struck by Hawthorne's Malvolio appearing at the end - and good will - the comradely bonhomie that Grant and Smith are indeed shown to share. Hawthorne and perhaps more surprisingly Mel Smith and Richard E. Grant really do a fine job and imbuing some real character in their parts; treading a line between broad comedic playing and human sadness. Along with Kingsley's career-best (? not seen too many of his films) performance, they lend this film its heart, and play very well against the wonderful settings. Mackintosh and Stubbs are I guess a little less compelling, but these roles are really difficult to carry off... nothing about them really lingers too long in the memory, like Kingsley's expressions, bizarre little pieces of dance and his pared-down delivery. Helena Bonham Carter is perhaps overly assured as the vain countess dame, Olivia: oh so archly bemused when faced by the cross-gartered, prancing Hawthorne, but generally Ms. Bonham Carter is very much in her usual, predictably petulant, period-costume mode. Which is probably being unfair; she does convince, at the end of the day. Overall then, a wonderfully colourful delight, bearing the flavour of bright, melancholy late summer-into-autumn. A strange chill is cast by the compelling Kinglsey; a sadness that cannot be dispelled. This film has light amusement in addition to this real edge, and is ultimately a very affecting rendering of a bona fide Shakesperean classic.",
         "Trevor Nunn's beautifully photographed and acted, deftly written film is one of the most enjoyable adaptations of a Shakespeare play ever made. Helena Bonham Carter is pitch perfect as the beautiful Olivia, who in \"deep mourning\" for her dead brother, falls in love with Cesario (who happens to be a woman named Viola dressed up as a man, wonderfully played by Imogen Stubbs, the only actress I've ever seen able to create both a charming Viola and a totally believable Cesario), meanwhile Viola falls for the Duke of fictional Illyria (the exquisite Toby Stephens) who is desperately in love with the Lady Olivia. Meanwhile, Viola's lost twin brother (Steven Mackintosh of \"Gentlemen Don't Eat Poets\", excellent again here) winds up in Illyria and adds to the confusion. Wonderful, layered support comes from Ben Kingsley playing Feste, Olivia's fool. The only flaw, perhaps, is the few minutes before the conclusion when everything seems to be coated with a thick gloss of sugar; the film comes through this unscathed. Trevor Nunn comes through with an exquisite Shakespeare film adaptation (which is a do or die task). A great showcase for the heavenly cast featuring some of the best performances ever by Bonham Carter (save \"Wings of the Dove\"), Kingsley (in his best supporting turn ever), novice Stubbs, and Stephens. A very worthwhile effort. Rent it, you won't be let down.",
         "This is, quite simply, the best production of a Shakespeare comedy ever filmed. The plot is delightfully absurd, the acting brilliant, the direction superb. It is the sort of comedy you can watch over and over again.",
         "In Illyria, Orsino (Toby Stephens), a nobleman, is saddened because he cannot have the love of Lady Olivia (Helena Bonham-Carter) who is mourning the loss of her brother. Meanwhile, twins Sebastian (Stephen Mackintosh) and Viola (Imogen Stubbs) both survive a terrible shipwreck off the coast, but each thinks the other has died. Viola takes the guise of a man and goes to work in the household of the nobleman, falling in love with Duke Orsino. Meanwhile Olivia is taken with Viola who calls herself Cesario. This is the premise of one of William Shakespeare's most appealing comedies, Twelfth Night: Or What You Will, updated from Elizabethan England to late 19th century and brought to life by director Trevor Nunn. It is one of the best interpretations of Shakespeare that I have seen on film. Reminiscent of other Shakespearean cross-dressing comedies such as As You Like It, Twelfth Night is mostly about the ins and outs of romantic love but it is also about pride, \"overweening ambition\", disguises, and mistaken identities. The play contains some of Shakespeare's most memorable characters: Sir Toby Belch (Mel Smith), Olivia's drunken uncle, his friend Sir Andrew Aguecheek (Richard E. Grant) who is also trying to court Olivia, Olivia's gentlewoman Maria (Imelda Staunton), Feste (Ben Kingsley), the house clown, and Malvolio (Nigel Hawthorne) the prudish steward. Nunn has assembled a cast that more than does justice to the play. Imogen Stubbs as Viola actually looks like a handsome young man and has a sense of purity and innocence that makes her instantly likable. Helena Bonham Carter brings warmth to the character of Olivia who like Orsino seems to be in love with the idea of love not the reality. Some have noticed a similarity between the character of Olivia and Queen Elizabeth and interestingly, Olivia is addressed by Feste as \"madonna\", the only time the word is used in all of Shakespeare, perhaps a wry comment about the myth of the Virgin Queen. The main story involves a love triangle between Orsinio, Viola, and Olivia but the minor characters have more than ample time on stage. Malvolio is both a comic and a tragic figure, said to caricature Sir Christopher Hatton, a courtier, romantic pursuer of the Queen and rival of the Earl of Oxford. Hatton was so fawning Elizabeth called him her \"sheep\" or \"mutton\" and this allusion is present early in the play as Malvolio is called a \"rascally sheep-biter\", harking back to Hatton's letter assuring Elizabeth that \"The sheep hath no tooth to bite while the Boar's (Oxford) tusk doth raze and tear.\" Malvolio is a puritan who rails against people having fun, a trait that earns him the enmity of Sir Toby and Maria. To strike back, Maria engineers a joke on Malvolio. She forges a love letter supposedly from Olivia telling him that if he wants her to notice him, he should dress in yellow stockings and crossed garters and, as he woos Olivia dressed in his strange attire, Malvolio cuts a ridiculous figure (incidentally this is the same costume worn by Henry VIII when he danced with Anne Boleyn, Queen Elizabeth's mother, at a masked ball, before he had her beheaded for adultery). While there are many great performances, the star for me is Ben Kingsley who is totally convincing as Feste, a fool but a knowing one who functions as an objective commentator of the scene around him, exuding an air of righteous superiority. His portrayal of the priest Sir Topas who interrogates Malvolio in a darkened room has overtones of the 1581 trial and execution of Edmund Campion, a Jesuit priest who was executed by the English government in 1581. In his speech of less than fifty words, which appears to resemble nothing but nonsense, there are no less than five phrases which refer directly to Edmund Campion and his 1580-81 mission to England. Richard Desper has pointed out that the mock trial scene works as a parody of the government persecution of Catholic martyrs. \"The playwright,\" he writes, \"demonstrates for us a world turned upside down, with clowns passing themselves off as men of learning, while men of learning \u0085are pressed to deny what they believe to be true to serve political ends.\" The ending is too delightful to give anything away but it reminded me of the Ingmar Bergman comedy Smiles of a Summer Night, where mismatched couples get together at a summer cottage to sort everything out. Malvolio is pitiable in trying to redeem a shred of dignity but we feel for him when he exits saying, \"I shall be revenged on the whole pack of you\". As he leaves, he is the only person suffering in a sea of happy faces, those on screen as well as those at home.",
         "Slick Shakespeare adaptation, well acted and very humorous (in parts) in its telling. Naturally, there's always going to be some differences from stage to cinema. The film took advantage of this, of course, to avoid a \"stage\" feel. The perceptions, or rather the misperceptions, of people and motivations are well explored and portrayed. Ben Kingsley is a standout, for his interesting twist on the character Feste. In short, a good adaptation and film. Recommended.",
         "I was introduced to this delight in the 10th grade during World History as an implementation of my teacher's favorite instructing method- stick in a movie and assign an outline. Dark room, people whispering or making out in the corner, dull movie: this class was normally known as Nap Time, but not that day. In went the tape and out came a story full of vivacity, charm, hilarity and heart. The story is of a girl, Viola, who loses her brother and disguises herself as him to find work. She falls in love with the Duke, who has sent her to woo a countess by the name of Olivia, who has lost her brother as well. Of course, Olivia falls in love with Viola, thinking she is a young man. Viola now must reject one love because she is a woman and be rejected by another love that believes she is a man. What to do? Throw more people into the mix! Olivia, being a countess and therefore rich as anything, has no lack of other admirers from the insanely stupid Sir Andrew Aguecheeck that her uncle encourages for sport to her pious steward, Malvolio. Each person vies for her attentions while she goes insane over the one \"man\" she cannot have. Enter Sebastian, Viola's twin brother who *gasp* didn't die after all. Much confusion and laughter later, Viola is finally able to shed her \"masculine usurped attire\" and profess her love for the now-frazzled Duke. Don't worry about Olivia, she gets to keep a copy, the ever-willing Sebastian. Watching this movie the first time, I could hardly believe it was written 400 years ago. The story relates flawlessly to a modern audience. Watching it for the hundredth time after I bought it, I am still captivated by the genius adaption. The script is so funny and intertwines plot lines seamlessly. The actors actually know what they are trying to say, which is half of conveying the meaning of the \"difficult\" language. Even if I did not understand every word, I would get the meaning with help from the incredible acting. Imogene Stubbs is beautiful as Viola- she really makes a very cute, albeit effeminate \"boy.\" I felt the most for her, especially when she tells the Duke the story of her love for him under the guise of a \"sister.\" Toby Stephens as the Duke was quite handsome, and made the character more likable. If it had been another person, I would have wondered what in the world Viola saw in the whiny, fanciful man, but he was quite suave and charming. Olivia-Bonham-Carter shone as the almost bi-polar Olivia. She snapped from the pit of despair to the heights of love within a scene, but invited you to laugh with her in giddiness rather than snort in disbelief. Ben Kingsly was perfection as Feste, probably the best performance of the movie. He was a fool, but he knew it. He gave a performance of simple farce with a current of keen insight underneath. The others, Mel Smith, Imelda Staunton, Nigel Hawthorne, Richard Grant, Steven Mackintosh and Nicholas Farrell all provided excellent comedic support, tinged with the faintest hint of melancholy that brought just the right mix. Whether you're a fan of Shakespeare or not, Twelfth Night is without a doubt an amazing experience. It brings laughter, excitement and maybe even a misty eye with each viewing. Go rent it if you haven't seen it and if you have, pull it out and treat yourself tonight. I know I will.",
         "Reading other reviews of 'Twelfth Night' it is interesting to see that some people think it is a slow film and others quite fast. It gripped me from the opening gust of rain on a dark night to Feste dancing off into the sunset. Grappling with Shakespeare is a perilous activity but I thought Trevor Nunn brought out the comedy and the emotions of the story well. It is a film to make you smile at the follies of mankind but also their charm. Ben Kingsley is amazing. I've never seen Feste played that way but it seemed perfect. Imogen Stubbs does the comedy and the drama equally well. The scene with Orsino in the bathtub is a stock one but she does it beautifully, balancing the humour of the situation with the tenderness and the longing. Imelda Staunton brings unusual depth to the character of Maria. The rest of the cast are great too. The text of the play is changed around but not unnaturally so. The scene that cuts between Feste's song and Viola/Cesario and Orsino playing cards is wonderful, taking in eight of the characters and telling you more about them. The last act of the play is difficult to stage well but Nunn gives it a good shot. The Cornwall setting is lovely, the radiant sunshine, the green leaves and fine buildings are captured gorgeously by the cameras. I also liked the music very much and find some of the tunes quite hummable. Very enjoyable and worth seeing again and again.",
         "As with most Shakespearian comedies, the plot is deeply implausible. However, the excellent Cornish locations at St Michael's Mount & Lanhyrock give a good sense of place and the winter setting (apart from the scene of apple picking!) comes across well - it really does look like an English winter, rather than a picture postcard snow-scene. The play is cut down to a manageable length without losing the sense of it, The broad comedy aspects (Toby Belch et al) are thankfully limited. The acting is well done by a cast of British stalwarts. Amazingly, Viola and Sebastian actually do look broadly alike. This film is best viewed as an amusing light romantic comedy rather than a side-splitter.",
         "Trevor Nunn's adaptation of Twelfth Night is exceptionally beautiful, well acted, and emotionally engaging. Ben Kingsley's performance as the Fool stands out as magnificent, but the entire ensemble comes off very well. The film nails both the joy and the darkness of Shakespeare's play - and the play, make no mistake, contains plenty of dark and strange moments when things go, as the drunken uncle Sir Toby Belch says, \"Out of tune, sir.\" The filmmakers deserve credit for not glossing over the shades of sadism in Toby's treatment of Malvolio or the shallow fickleness of Orsino's character. The wintry Cornwall setting dovetails perfectly with the mood of the play, half sun and half shadow, and the costume design (roughly Edwardian, though I am not an expert on fashion history) creatively evokes the luxury of Orsino and Olivia's courtly world, while allowing for - even necessitating - the brilliant re-imagining of the Fool as bohemian vagabond.",
         "There are several good reasons to spend an evening with this production of a standard Shakespearean tale of gender confusion and romantic comedy. The lush scenery and attention to period detail, top-notch performances, and Ben Kingsley's rightly acclaimed turn as Feste, the wise and knowing Fool. Nonetheless, the move from play to the big screen has its drawbacks, foremost among which are the great suspension of disbelief the viewer must attempt when Viola is taken seriously as a man, and still moreso when brother and sister, essentially unchanged in appearance, do not immediately recognize each other. Suspension of disbelief is more commonly expected in a stage production, where the circumstances of the confined surroundings necessitate empathetic participation of the audience. In cinema, however, such constraints are generally not present, and standards are correspondingly higher. But if the screenplay includes elements that demand audience empathy, as is the case here, the production will fare badly at just those places. Hamlet and other more \"serious\" works in the Shakespearean canon have few such elements. Plays such as TN, of a more playful nature and which revolve around improbable plot elements, will bear up less well under the close scrutiny of big-screen cinema."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Renaissance Films",
         "BBC Films",
         "Circus Films"
      ],
      "summaries": [
         "Brother and sister Viola and Sebastian, who are not only very close but look a great deal alike, are in a shipwreck, and both think the other dead. When she lands in a foreign country, Viola dresses as her brother and adopts the name Cesario, becoming a trusted friend and confidante to the Count Orsino. Orsino is madly in love with the lady Olivia, who is in mourning due to her brother's recent death, which she uses as an excuse to avoid seeing the count, whom she does not love. He sends Cesario to do his wooing, and Olivia falls in love with the disguised maiden. Things get more complicated in this bittersweet Shakespeare comedy when a moronic nobleman, Sir Andrew Aguecheek, and a self-important servant, Malvolio, get caught up in the schemes of Olivia's cousin, the obese, alcoholic Sir Toby, who leads each to believe Olivia loves him. As well, Sebastian surfaces in the area, and of course there is Feste, the wise fool, around to keep everything in perspective and to marvel, like we the audience, at the amazing things happening all around.",
         "Shakespeare's comedy of gender confusion, in which a girl disguises herself as a man to be near the count she adores, only to be pursued by the woman he loves."
      ],
      "budget": 5000000
   },
   "movielensId": 892,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1996-10-31",
      "dvdReleaseDate": "2005-08-30",
      "directors": ["Trevor Nunn"],
      "runtime": 134,
      "movieId": 892,
      "title": "Twelfth Night",
      "mpaa": "",
      "actors": [
         "Helena Bonham Carter",
         "Richard E. Grant",
         "Nigel Hawthorne",
         "Ben Kingsley",
         "Mel Smith",
         "Imelda Staunton",
         "Toby Stephens",
         "Imogen Stubbs",
         "Steven Mackintosh",
         "Nicholas Farrell",
         "Peter Gunn",
         "David Burke"
      ],
      "imdbMovieId": "0117991",
      "originalTitle": "Twelfth Night",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["DGEoGFdjXi8"],
      "plotSummary": "Shakespeare's comedy of gender confusion, in which a girl disguises herself as a man to be near the count she adores, only to be pursued by the woman he loves.",
      "tmdbMovieId": 44705,
      "avgRating": 3.72618,
      "releaseYear": "1996",
      "numRatings": 1459,
      "posterPath": "/3P83G5fXWVk6nUpzhv9BmaWwuxG.jpg"
   }
}