{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "germany",
            "id": 74
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "nazi",
            "id": 2652
         }
      ],
      "imdb_id": "tt0117093",
      "video": false,
      "title": "Mother Night",
      "recommendations": [
         54087,
         27444,
         56821,
         32044,
         41807,
         63945
      ],
      "backdrop_path": "/nqf1jAZmHs9jeHFZiWwc23ZZhXB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Howard Campbell",
               "gender": 2,
               "credit_id": "52fe43e1c3a368484e0037fb",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Helga Noth / Resi Noth",
               "gender": 1,
               "credit_id": "52fe43e1c3a368484e0037ff",
               "name": "Sheryl Lee",
               "profile_path": "/zgGpEcAywZu1tx5OVj5I6j7PpxW.jpg",
               "id": 6726,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "George Kraft",
               "gender": 2,
               "credit_id": "52fe43e1c3a368484e003803",
               "name": "Alan Arkin",
               "profile_path": "/gcrKO2z0YVUXBXVeB9V8PndG0IJ.jpg",
               "id": 1903,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Young Resi Noth",
               "gender": 1,
               "credit_id": "52fe43e1c3a368484e003807",
               "name": "Kirsten Dunst",
               "profile_path": "/hA5wdCWKbRi7vOZExgEuGxakLsA.jpg",
               "id": 205,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Reverend Dr. Lionel Jones",
               "gender": 2,
               "credit_id": "52fe43e1c3a368484e00380b",
               "name": "Bernard Behrens",
               "profile_path": "/6ibwaHJ45ZExo1eyUIJrATKdio7.jpg",
               "id": 55155,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Epstein's Mother",
               "gender": 1,
               "credit_id": "52fe43e1c3a368484e00380f",
               "name": "Anna Berger",
               "profile_path": "/r9hukamoCTkuosl83xwBCnFYaEz.jpg",
               "id": 139943,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dr. Abraham Epstein",
               "gender": 2,
               "credit_id": "54a11591c3a3682f1b00c5cb",
               "name": "Arye Gross",
               "profile_path": "/ha4ziYlBSBBHs88ltnamOKLZ084.jpg",
               "id": 72028,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Werner Noth",
               "gender": 2,
               "credit_id": "54b7d425c3a36820b70019c4",
               "name": "Norman Rodway",
               "profile_path": null,
               "id": 14818,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Robert Sterling Wilson",
               "gender": 2,
               "credit_id": "54a11639925141236b003669",
               "name": "Frankie Faison",
               "profile_path": "/3717JOXK2Z8qelfyvScDGimfFBf.jpg",
               "id": 13936,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Father Patrick Keeley",
               "gender": 0,
               "credit_id": "54a11655c3a3682f1e00c474",
               "name": "Gerard Parkes",
               "profile_path": "/AgmAajLs8xJJdeCEe7OZa89XOr4.jpg",
               "id": 105777,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "August Krapptauer",
               "gender": 2,
               "credit_id": "54a11670c3a3682f2100c745",
               "name": "Vlasta Vrána",
               "profile_path": "/ug27TmlJNKvhJEa6xWGCpPz4o2q.jpg",
               "id": 58169,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Joseph Goebbels",
               "gender": 2,
               "credit_id": "54a11688925141313200c36a",
               "name": "Zach Grenier",
               "profile_path": "/vwYvEHYXhPBjovqbOHY011ipij9.jpg",
               "id": 7471,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Major Frank Wirtanen",
               "gender": 2,
               "credit_id": "595ca46f9251410bfa06ef29",
               "name": "John Goodman",
               "profile_path": "/eOIx8zj1vYIRhVY2bK5cjIQfua0.jpg",
               "id": 1230,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43e1c3a368484e0037eb",
               "name": "Keith Gordon",
               "profile_path": "/izPEmoAyZkCBnNFXEBxg03TMnLH.jpg",
               "id": 33054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e1c3a368484e0037f7",
               "name": "Robert B. Weide",
               "profile_path": "/bwjgWFDV6RpNFuWxQS82U6nn5hy.jpg",
               "id": 74159,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58f65bdd9251415de800146a",
               "name": "Kurt Vonnegut Jr.",
               "profile_path": "/6udG5CbuOheKRtdbP1YNAWy3ysd.jpg",
               "id": 1384517,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 3.002313,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20318,
      "vote_count": 16,
      "budget": 0,
      "overview": "An American spy behind the lines during WWII serves as a Nazi propagandist, a role he cannot escape in his future life as he can never reveal his real role in the war.",
      "similar": [
         424,
         14574,
         637,
         423,
         369885,
         9045,
         2253,
         228150,
         289,
         289222,
         15764,
         351339,
         13752,
         803,
         821,
         1771,
         16869,
         5925,
         857,
         203833
      ],
      "original_title": "Mother Night",
      "runtime": 114,
      "poster_path": "/1U6OkXtr4WuOlQe4FmCbznIExtK.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [{
         "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
         "name": "Fine Line Features",
         "id": 8,
         "origin_country": ""
      }],
      "release_date": "1996-11-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "The truth is more shocking than the uniform he wears... HE WAS AN AMERICAN SPY.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Keith Gordon"],
      "runtime": 114,
      "synopsis": "\"Make love when you can...when you're dead, you're dead\". the morals of the story and the philosophies of Howard Campbell Jr. Howard is writing his story from an Israeli prison. Howard is an American by birth who moves to Germany as a child with his diplomat father and mother. As Hitler takes power, Howard, now an adult, remains in Germany and becomes a well known playwright. Married to the German Helga, Howard has no real political leaning. However, as WWII breaks out and Germany declares war on the United States, howard is recruited to become a spy for his native land. He reluctantly agrees and plies his trade through propaganda radio broadcasts for the Nazis, becoming accepted by Goebbels, the director of propaganda for the Third Reich. His broadcasts become so convincing that he is branded a Nazi war criminal and captured by American Soldiers. Howard's OSS contact arranges for his escape from custody and moves him into a dreary flat in New York City. Thinking that his beloved wife has been killed, Howard leads a drab existence and makes only one friend...a friend who later betrays him to Israeli war criminal hunters. Before the betrayal, Helga appears at his door and he begins to live again, only to find that it is not Helga but her younger sister Resi. After his hopes are dashed, he resigns himself to capture and ultimately to go to his punishment.",
      "writers": [
         "Kurt Vonnegut Jr.",
         "Robert B. Weide"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117093/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNTA1Mjk2OF5BMl5BanBnXkFtZTcwNjE1MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Nick Nolte, Sheryl Lee, Alan Arkin | See full cast and crew »"],
      "reviews": [
         "I'm a rather pedestrian person, with somewhat lowbrow tastes. However, I occasionally try to raise the bar on my cultural awareness. This movie was one of my attempts. I was in awe throughout the entire movie. I liked it so much that I got my own tape so I could see it again. This is a very thoughtful and emotionally striking movie. I saw it as a huge question to the viewer: What is the depth of sacrifice to duty one can accept, can be asked to accept, should accept? As a military member, this is of course an important question to me. This question weighs heavily on the viewer of this movie. Recommended.",
         "It's so rare to find a literary work adequately translated to the screen that I may have rated this film higher than it deserves, but not by much. As a long-time student of Vonnegut's works, I have no hesitation in recommending the film to his readers, at least to those that love him as I do. The casting is inspired: Nolte is understated in triumph, bewildered in defeat, decisive in judgment. Sheryl Lee is luscious throughout, but her handling of the treacherous Resi and her tragic crescendo almost makes you forget her beauty. Alan Arkin delivers a totally lovable, but equally treacherous, Soviet spy. Do not feel you have to read Mother Night to appreciate the film; though, if you haven't read Mother Night, you will probably want to after viewing the film. Notice the shifts from color to black-and-white and back again, and don't miss the final symbolism of Campbell's noose. Watch, also, for Kurt Vonnegut's cameo near the end of the film. Bing Crosby's \"White Christmas\" will never sound the same (I write in mid-December, when the song is getting heavy radio play, and it's driving me nuts).",
         "After viewing this film I tried to put my finger on what I truly appreciated about it and found its RESTRAINT to be what captivated me the most. Nolte, not noted for restraint, was amazing in his role as Campbell. His bewilderment, resignation and acceptance of his situation came through with well-crafted acting. The love scenes were remarkably tender. Nolte's responses to the surprises and twists fit the character perfectly. Watch for Vonnegut's cameo!",
         "The folk who produced this masterful film have done fine service to a novel that stands as perhaps the best fiction work centering upon human guilt and human responsibility ever published. Nolte takes the role of Howard W. Campbell, Jr., and makes it his own, remaining true to Vonnegut's depiction of a man who has lost ALL (to and) for Love. No weaknesses in this fine adaptation.",
         "This movie pleasantly surprised me. It has a touching, slightly off-center approach that never loses your attention. This is a movie I never heard about, but if you want a \"sleeper\", this is it. Great writing, production, and acting. I highly recommend it for audiences who want something thoughtful. Nick Nolte, Sheryl Lee and Alan Arkin are marvelous. Why wasn't more made of this movie?",
         "Seldom do I see a movie in which the star performs so well you can hardly believe he is an actor, but he comes across as the real guy he is portraying. I believed Nick Nolte was an American spy who seemed to renounce his American citizenship in World War II--when in fact he should have been rewarded for having served America so well after the war was over and he returned to civilian life. I have seen Nick Nolte in other movies, but never have I been so impressed with his depth of characterization as he manifests in this film.",
         "I haven't read this book, but all through the movie I was awestruck with only one thought in my head: This is so Vonnegut. I have never seen an author, all of the intelligence and life behind the workings of a novel, translated so well to film. This movie had the same complexities found in Vonnegut's novels: the jokes were often meaningful and symbolic, and the dramatic events and symbols were often also jokes. Campbell was also a very Vonnegut character, portrayed perfectly by Nick Nolte. He had all of the earmarks of a Vonnegut \"hero\": lack of concern for political boundaries, ironic dark humor giving way to dumb inactivity in response to stress, and an unwillingness to push his version of reality on those around him. Overall, I was constantly surprised and impressed as I watched this movie. It was the same feeling I had reading \"Cat's Cradle,\" my first Vonnegut novel, as if the most perfectly oddball thing that could happen, he thought of THAT, and he made it real and important. Yes, he has nothing but army surplus \"White Christmas\" albums. So it goes!",
         "Before this, the flawed \"Slaughterhouse Five\" was the best. But this screen adaptation of \"Mother Night\" is very true to the book and keeps the comedy, mystery, and tragedy intent. Thankfully it wasn't Hollywood-ized or idiotized a la the movie of \"Breakfast of Champions.\" Another good thing about this movie is that you don't have to be familiar with the book to follow it (as I think you do for Slaughterhouse Five). That's probably true of Breakfast of Champions also but they did such a bad job of that you're better off just reading the book and not seeing the movie! Nick Nolte did an excellent job in this film.",
         "I haven't yet read the Kurt Vonnegut book this was adapted from, but I am familiar with some of his other work and was interested to see how it would be translated to the screen. Overall, I think this is a very successful adaptation of one of Vonnegut's novels. It concerns the story of an American living in Germany who is recruited as a spy for the US. His job is to ingratiate himself with high ranked Nazi's and send secret messages to the American's via his weekly radio show. But when the war ends he is denounced as a war criminal but escapes to New York, where various odd plot twists await. If Mother Night has a problem it's that it tends to get a little too sentimental at times. But for most of the film the schmaltz is kept to a minimum and the very strange plot is carried through with skill and aplomb. And there are some fabulous moments of black comedy involving three right wing Christian fundamentalists and a very highly ranked Nazi in a prison cell. Very much recommended.",
         "Mother Night is one of my favorite novels and going to see this I was expecting a huge disappointment. Instead I got a film that perfectly portrays the irony, humor, elequence, and above all else the crushing sadness of Vonnegut's novel. This is certainly Nolte's best preformance to date. He captures the defeat and selfloathing of Howard Cambell Jr. consistently from the subtle intonations of his speech to the held back tears behind his eyes. Alan Arkin is absolutly hilarious as George Kraft. Sherryl Lee is haunting in her detachment from reality as Cambell's young lover. John Goodman is understated and more than effective as Cambell's \"Blue Fairy Godmother.\" This Pinnocioesque story of Cambell trying to be his own ideal hero and unwittingly becoming his ideal tragic villian is a mature and vivid look into what we are as people. And aside from that, it is one of the most deeply romantic films I have ever come across. Cambell is the incarnation of both foolish and wise love. And at the films sastifyingly painful conclusion, he finally learns what it means to be a real boy as his Blue Fairy Godmother grants him his wish. And he realizes that...well, watch the movie and you'll see. Mother Night is without a doubt in my mind one of the best films ever made. It is a beautiful poetic story that digs deep within our emotions and is completely faithful to its original author."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Fine Line Features",
         "New Line Cinema",
         "Whyaduck Productions"
      ],
      "summaries": [
         "Howard W. Campbell, Jr., an American expatriate playwright, Nazi radio propagandist, and Allied spy, writes his memoirs during his pre-trial confinement in 1961 Haifa and learns that people are what they pretend to be.",
         "Howard W. Campbell Jr., an American living in Germany since childhood, is recruited by the United States to become an informer during the upcoming Second World War. What he does become, is one of the leading anti-semetic news broadcasters of Nazi Germany. After the fall of Hitler's Germany, Campbell's government friends arrange for a quiet life in the United States. His life is quiet until a complex web of spies and neo-Nazis draws him back into the life which he once lead. Eventually captured by the Isralies, Campbell's one defense was: \"I was an American Spy.\"",
         "An American spy behind the lines during WWII serves as a Nazi propagandist, a role he cannot escape in his future life as he can never reveal his real role in the war."
      ],
      "budget": 6000000
   },
   "movielensId": 893,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         ""
      ],
      "releaseDate": "1996-11-01",
      "dvdReleaseDate": "2000-08-22",
      "directors": ["Keith Gordon"],
      "runtime": 114,
      "movieId": 893,
      "title": "Mother Night",
      "mpaa": "",
      "actors": [
         "Nick Nolte",
         "Sheryl Lee",
         "Alan Arkin",
         "Kirsten Dunst",
         "Bernard Behrens",
         "Anna Berger",
         "Arye Gross",
         "Norman Rodway",
         "Frankie Faison",
         "Gerard Parkes",
         "Vlasta Vrána",
         "Zach Grenier",
         "John Goodman"
      ],
      "imdbMovieId": "0117093",
      "originalTitle": "Mother Night",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["KYbXUWw61ug"],
      "plotSummary": "An American spy behind the lines during WWII serves as a Nazi propagandist, a role he cannot escape in his future life as he can never reveal his real role in the war.",
      "tmdbMovieId": 20318,
      "avgRating": 3.6486,
      "releaseYear": "1996",
      "numRatings": 609,
      "posterPath": "/1U6OkXtr4WuOlQe4FmCbznIExtK.jpg"
   }
}