{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1684935",
      "video": false,
      "title": "Venice",
      "recommendations": [],
      "backdrop_path": "/ikhhdEHOsPi0BHYebstHI3pDMXw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1005,
               "character": "Marek",
               "gender": 0,
               "credit_id": "52fe49e5c3a368484e145fcd",
               "name": "Marcin Walewski",
               "profile_path": null,
               "id": 587975,
               "order": 0
            },
            {
               "cast_id": 1007,
               "character": "Joanna - Marek's mother",
               "gender": 1,
               "credit_id": "5432c0680e0a2656e2004b57",
               "name": "Magdalena Cielecka",
               "profile_path": "/cwGxSo3A6dtogxeWnObYPXRh7dC.jpg",
               "id": 591258,
               "order": 1
            },
            {
               "cast_id": 1008,
               "character": "Roman - Marek's father",
               "gender": 0,
               "credit_id": "5432c081c3a36831a9005dc2",
               "name": "Mariusz Bonaszewski",
               "profile_path": "/opB6JZyMD4aIOVSB1c8o2BQjwOv.jpg",
               "id": 140221,
               "order": 2
            },
            {
               "cast_id": 1009,
               "character": "Barbara - Joannas sister",
               "gender": 1,
               "credit_id": "5432c094c3a3681143004b22",
               "name": "Agnieszka Grochowska",
               "profile_path": "/2apU86P6peRMxzNRZJV1sYl8X8B.jpg",
               "id": 105562,
               "order": 3
            },
            {
               "cast_id": 1010,
               "character": "Weronika - Joannas sister",
               "gender": 0,
               "credit_id": "5432c0a4c3a3681143004b28",
               "name": "Grażyna Błęcka-Kolska",
               "profile_path": "/gxh68dDbe9eybsr0DzLurezaBM3.jpg",
               "id": 92652,
               "order": 4
            },
            {
               "cast_id": 1011,
               "character": "Klaudyna - Joannas sister",
               "gender": 1,
               "credit_id": "5432c0b4c3a3681143004b2c",
               "name": "Julia Kijowska",
               "profile_path": "/siNlggLwFE0BVD8tGYmuKUDb9Ge.jpg",
               "id": 1095650,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49e5c3a368484e145fb7",
               "name": "Jan Jakub Kolski",
               "profile_path": null,
               "id": 587971,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49e5c3a368484e145fc3",
               "name": "Artur Reinhart",
               "profile_path": null,
               "id": 6427,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe49e5c3a368484e145fc9",
               "name": "Witold Chominski",
               "profile_path": null,
               "id": 587974,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "571c8b2e92514115e200242b",
               "name": "Michał Kwieciński",
               "profile_path": null,
               "id": 1244217,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5432c0470e0a265872004aad",
               "name": "Jan Jakub Kolski",
               "profile_path": null,
               "id": 587971,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.823509,
      "production_countries": [],
      "id": 79782,
      "vote_count": 4,
      "budget": 0,
      "overview": "An atmospheric coming-of-age story featuring an imaginative young boy named Marek who dreams of escaping an increasingly dangerous Poland on the eve of war for beautiful Venice.",
      "similar": [],
      "original_title": "Wenecja",
      "runtime": 110,
      "poster_path": "/lUmJiBTKdesFDkgSvV9zecCgNO6.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [],
      "release_date": "2010-05-25",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henry Jaglom"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Henry Jaglom"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105729/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3OTE5ODA0NV5BMl5BanBnXkFtZTcwNDE2NDMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Nelly Alard, Henry Jaglom, Melissa Leo | See full cast and crew »"],
      "reviews": [
         "This is not such a bad movie, although I'm torn between hating it and liking it. The dialogues are obviously heavily influenced by Altman and Woody Allen, i.e. meant to sound spontaneous, realistic and witty, which is often a two-edged sword; this style makes the dialogues interesting to follow but makes the characters highly annoying, i.e. there's rarely anyone to sympathize with at all, and that is practically the case here, too. Woody Allen's movies also have this trait: irritating but interesting characters. The story reveals a huge ego behind the script, much like with Allen's movies. Jaglom is a narcissist at best, and a deluded egomaniac at worst. His character (basically himself, or how he would like to see himself, but with a fictional name) is that of a renowned director (ego alert!) who visits a European festival (pretentiousness alert!), where he meets a fairly attractive female fan who wants to meet him (ego alert!). Male fantasy, anyone? Jaglom is not only the central character here, but he lives out his fantasies of being a major director, plus some female worship of His Highness, His Jaglomity, thrown in for good measure. Of course, Allen is just as bad, if not worse; in how many Allen movies does he go out with women who are approximately 10,000 times better-looking than him? (Numbers lose all meaning in this case.) The difference is, however, that Allen's movies are usually comedies which are usually funny, while Jaglom's \"V/V\" is basically a relationship movie with a smaller dose of humour.",
         "How to categorize \"Venice/Venice\"? If I had to invent a term, I'd call it \"naturalistic romantic seriocomedy.\" If you like Eric Rohmer's films, you might also like THIS film. If you like Hollywood film... if your type of director is Capra or Hitchcock... \"Venice/Venice\" may seem trivial. The story doesn't go anywhere. The dialog seems to be about nothing. To top it off, it's heady stuff. Jaglom throws in an ample dose of physics and metaphysics. If you're looking to kick back with a flick and take in some good, ol' fashioned spoon-fed entertainment... you're looking in the wrong place with \"Venice/Venice.\" But... It's also incredibly moving. The first half of the film is set in Venice and Lido, and Jaglom takes the opportunity to weave the beautiful scenery together in a way that both reflects and honors Visconti's film version of \"Death in Venice.\" The film begins at the Hotel des Bains, where the Thomas Mann book begins. Dean (Henry Jaglom), an American director, is in Lido because one of his films is part of the Venice Biennale. He meets the beautiful young Jeanne (Nelly Allard), who demands an interview with him. The chemistry is immediate and obvious: Whatever is discussed is secondary to the facial expressions, the stares, the sounds of words. Jaglom does this MASTERFULLY. Dean and Jeanne get to know each other... and they spend romantic moments around Venice. They have a falling out when Jeanne begins to feel that Dean is not the man she fell in love with in his films. They go their separate ways... Dean back to Venice, CA and Jeanne back to France. Dean settles back in with his girlfriend, Peggy (Melissa Leo) and is readying himself to start his next production. Then, Jeanne shows up. Unlike most films, where this would lead to some kind of conflict between the female leads... here, this leads only to a conflict within Dean, who is forced to make some important decisions. What's wonderful about Venice/Venice is that it's confusing. It's not \"one thing.\" It's drama, comedy, romance. It's set in Venice, Italy and Venice, CA... worlds apart in many ways and yet both well known to art-film directors. Dean is caught between a woman he has loved (Peggy) and a woman he wants to love (Jeanne)... between... you might say... the past and the future. Dean is played by Henry Jaglom. Jaglom is the director. He's both in front of and behind the camera. At one point, in the midst of a discussion of film, he encourages the group he's with to look in a particular direction, as if they were looking right into the camera... which, in fact, they are. You're not supposed to break through the so-called \"fourth wall\" and come out into the audience. But that's exactly what Jaglom does. Jaglom's mentor was Orson Welles. Welles was a rebel in the extreme. He broke studio rules. He both created and broke the rules of film-making. Like Jaglom, Welles was fascinated with finding the liminal space between reality and fiction... questioning the nature of truth itself. Welles' film \"F for Fake\" is one of these affairs, for example. And that's what \"Venice/Venice\" is in Jaglom's work. Without question, it's self-indulgent. Jaglom is psychoanalyzing and deconstructing himself right before our eyes. If you like the proverbial \"film about film-making\" (e.g., \"Day for Night,\" \"8 1/2\", etc.)... you'll probably really dig this one. There are a few things that I particularly love about \"Venice/Venice\": 1. Naturalistic/improvised dialog. People thought that Cassavetes was nuts when he did this back in the 50s in \"Shadows.\" You'll notice that over the following decades... the whole sound and feel of dialog changed. Pre-Cassavetes... it was that snappy back-and-forth banter of Howard Hawks films that was the norm. Cassevetes and his naturalistic dialog never became mainstream... but it DID bring the mainstream to a place where we now hear people on the screen that sound somewhat like us. Jaglom is in that Cassavetes tradition. It's refreshing to watch a film like this once in a while. Crystal clean and no caffeine. 2. Wonderful actresses. Jaglom even says it in the film (as Dean.) Women are able to get more emotionally honest than men, and that's what makes women much more interesting subjects for art films. If you want nuanced personalities, cast great actresses. Jaglom not only features Melissa Leo and Nelly Allard... but Suzanne Bertish, one of the great actresses of TV, film and theater of our time. It's obvious that Jaglom wasn't interested in finding women to play parts. He cast these women to create their parts knowing that would also create chemistry. 3. The meaning creeps up on you. I love an \"Oh, yeah... huh... interesting!\" experience of film. I'm not into a spoon-feeding. If you tell me what to think... I rebel. Let me think for myself. So... while, to me, this is a film about choices, worlds in collision, dualities... about what it is to make film... about how women and men see each other (and there's some wonderful documentary-like footage about women's ideas on relationships in this film)... it can be about WHATEVER YOU WANT IT TO BE. In my mind... great art stimulates. \"Craft\" entertainment manipulates. 4. Jaglom. If you like his personality, you'll like the film. If you don't, you won't. Another reviewer called Jaglom a \"wanna-be Woody Allen\" or something like that. Jaglom is NOT AT ALL like Woody Allen. He's heady, yes. Sarcastic. But he's obviously a true romantic at heart. I don't get that in ANY of Allen's movies... even \"Annie Hall\" or \"Manhattan.\" Jaglom loves women, and I don't mean as hood ornaments. He's willing to bare his soul on the screen. Make me laugh, make me cry... move me. Jaglom has an incredible ability to make me feel everything on the sheer force of his personality and spirit.",
         "This is a wonderful film: Funny, romantic, and sentimental. Fans of Jaglom will love it. If you are new to Henry Jaglom, you are definately in for a surprise. Jaglom is a true independent, rejecting big Hollywood money and the compromises and garbage films it produces. You can expect originality and honest writing. He typically allows the actors to improvise, giving the films the feel of an Allen picture. But he's not trying to be Woody. He doesn't need to. Jaglom's films are an American treasure in every sense of the word. He may never be widely known, but that's fine with his fans. He's our secret.",
         "If you have a little bit of free time, and you are wondering whether to watch Venice, Venice. I'll make it easy ... chewing your own toenails would be more fun and enlightening. If you need more convincing, read on, otherwise check out something else. If only the director of Venice Venice were half as smart as he presents himself to be, perhaps then we would have a bearable movie worthy of our precious time. Wearing a floppy black hat to cover his balding scraggly head the director and star of this film leads us through his self congratulatory world of adoring women. There is the always loving ex-lover, the worldly Parisian, the young and bubblegummy Californian, and the ever loving secretary, desperately trying to capture the 'brilliant genius'. Through this game the director and star tries to weave strands of reality into the story allowing us to wonder whether the women really love him, or act only to love him. Previous to seeing this movie, I read Leonard Matlin review and I thought it a strong review, most likely and unwarranted one. Now I agree completely. Unless you like seeing women half the age of their love interest and obviously desperate for an acting job make complete fools of themselves as they desperately try to emote lust and desire, this film is a complete waste. Actually not a complete waste, this movie also has David Duchovny in a supporting role and it looks like he is as uncomfortable with his role as his character is. Most scenes have David squirming to get away from the camera, and carefully avoiding the audiences eyes. It is a sweet and charming performance. Too bad he had to share the film with such an obnoxious lout, whose lazy eyes and dopey california drawl leave much to be desired in what is clearly not acting. In the end this movie attempts something far more involved and interesting than possible in the hands of such a bumbling amateur. After viewing such a movie I am only left with the following -- How on earth was this movie financed? Who in their right mind gives this man money to make movies? -- and finally -- If this movie was made with the director's money, and made essentially for himself, why does he think anyone else would want to see it? I give it a solid 1. For Duchovny",
         "I certainly wish I had seen this movie ten years ago. \"Venice/Venice\" raises interesting questions about movies and television versus real life. A reporter falls in love with a Director but struggles to separate her admiration of his work from the real person. Although I saw this movie because Duchovny was in it, his performance was not the highlight, although he had a couple of cute scenes in the second half of the film. One of the highlights are the clips shown throughout the movie of women commenting on their fantasies of characters played by Cary Grant and Gary Cooper. If it were filmed today, I bet some women would mention Duchovny as their romantic on-screen hero. This movie was fascinating, if you have a chance to see it, do so.",
         "This movie is completely unbearable due to the ubiquitous vanity of the writer/director/main actor (the only person able to successfully fill these positions simultaneously seems to be Woody Allen). If you like movies about making movies please do yourself a favour and watch Fellini's \"8 1/2\" or Truffaut's \"La nuit américaine\" instead. If you like movies, where people mostly sit around and talk, I can highly recommend most of Eric Rohmer's work, he knows how to do it. But please stay away from this utterly revulsive piece of pseudo-intellectual garbage."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Rainbow Film Company, The"],
      "summaries": ["Dean is a maverick American film director surprised that his most recent film has been chosen as the Official U.S. Entry at the Venice Film Festival. A beautiful French journalist arrives at the festival with the apparent intention of interviewing the unique and eccentric filmmaker. In the midst of all the festival madness, she is forced to confront the wide divergence between things as they really are and things as they seem to be - both on screen and off. And so, finally, are we. Shot half in Venice, Italy and half in Venice, California, \"Venice/Venice\" looks at the profound effect movies have had - and continue to have - on our lives, our loves and on our dreams of romance."],
      "budget": 0
   },
   "movielensId": 895,
   "movielens": {
      "languages": ["English"],
      "releaseDate": null,
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 895,
      "title": "Venice/Venice",
      "mpaa": null,
      "actors": [
         "Henry Jaglom",
         "Nelly Alard",
         "Melissa Leo",
         "Suzanne Bertish",
         "Daphna Kastner",
         "David Duchovny"
      ],
      "imdbMovieId": "0105729",
      "originalTitle": "Venice/Venice",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Dean is a maverick American film director surprised that his most recent film has been chosen as the Official U.S. Entry at the Venice Film Festival. A beautiful French journalist arrives at the festival with the apparent intention of interviewing the unique and eccentric filmmaker. In the midst of all the festival madness, she is forced to confront the wide divergence between things as they really are and things as they seem to be - both on screen and off. And so, finally, are we. Shot half in Venice, Italy and half in Venice, California, \"Venice/Venice\" looks at the profound effect movies have had - and continue to have - on our lives, our loves and on our dreams of romance.",
      "tmdbMovieId": 79782,
      "avgRating": 2.97761,
      "releaseYear": "",
      "numRatings": 67,
      "posterPath": "/mVsRplxuZaEAJr1a8q9GCNsgEf3.jpg"
   }
}