{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113490",
      "video": false,
      "title": "The Journey of August King",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "August King",
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b609",
               "name": "Jason Patric",
               "profile_path": "/1WxY2kcQqx9gHloTmRuY5ta3Nje.jpg",
               "id": 12261,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Annalees",
               "gender": 1,
               "credit_id": "52fe4657c3a368484e08b60d",
               "name": "Thandie Newton",
               "profile_path": "/sW6XsnM2DkX6ujOXZ38aIQAMIWi.jpg",
               "id": 9030,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Olaf Singletary",
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b611",
               "name": "Larry Drake",
               "profile_path": "/m7NbC0TyREs2kD63ByL0bSPjHHj.jpg",
               "id": 16476,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mooney Wright",
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b615",
               "name": "Sam Waterston",
               "profile_path": "/fKmtS6OdDWPiAdxZflbJGz1eWml.jpg",
               "id": 8975,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Hal Wright",
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b619",
               "name": "Eric Mabius",
               "profile_path": "/mfYqgYHkvJRgPus0kN2V1GhsFOU.jpg",
               "id": 11867,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ida Wright",
               "gender": 0,
               "credit_id": "52fe4657c3a368484e08b61d",
               "name": "Sarah-Jane Wylde",
               "profile_path": null,
               "id": 233294,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4657c3a368484e08b5ff",
               "name": "John Duigan",
               "profile_path": "/bLrx4OQz5g1RnlLQc9ungQ4XKqR.jpg",
               "id": 72624,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4657c3a368484e08b605",
               "name": "John Ehle",
               "profile_path": null,
               "id": 233293,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "561cd5469251415a62003548",
               "name": "Humphrey Dixon",
               "profile_path": null,
               "id": 12759,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561cd3fdc3a368225b00304f",
               "name": "Sam Waterston",
               "profile_path": "/fKmtS6OdDWPiAdxZflbJGz1eWml.jpg",
               "id": 8975,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "561cd4469251411e650018aa",
               "name": "Nick Wechsler",
               "profile_path": "/1HeDC5sNgXBN09SiyoPs3VcUQsH.jpg",
               "id": 6468,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "561cd4599251411e650018ae",
               "name": "Stephen Endelman",
               "profile_path": "/1ey21aHi5U3FS5iZeVwvnodwSrX.jpg",
               "id": 21276,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "561cd533c3a3682253003612",
               "name": "Slawomir Idziak",
               "profile_path": "/vA9WrEK35MyUx6Sb4NtZiouotsg.jpg",
               "id": 1129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "561cd57e9251415a5f0034cd",
               "name": "William Webb",
               "profile_path": null,
               "id": 1267869,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561cd5929251415a7200355a",
               "name": "Kerry Barden",
               "profile_path": "/zb3khdNgVHerkFz4esvjSZHnbDW.jpg",
               "id": 5328,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561cd5a4c3a368225e00347f",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561cd5b6c3a3682256003a59",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561cd5c8c3a36822640035e8",
               "name": "Patricia Norris",
               "profile_path": "/gZQZwyO3fckr0qNOxTDwxEK442F.jpg",
               "id": 5634,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.701046,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61548,
      "vote_count": 3,
      "budget": 0,
      "overview": "The Journey of August King is a multi-dimensional drama about a North Carolina farmer in 1815. August King, a widower, is on his way home as he does every year after selling his produce and purchasing the stock and goods he will need to survive the winter. On his journey, he comes upon a run-away slave, a young woman about 19 and August King must decide to violate the law and help this slave to freedom or else leave her to be hunted down and, ultimately, returned to her slave owner.",
      "similar": [],
      "original_title": "The Journey of August King",
      "runtime": 91,
      "poster_path": "/hT5CF2RJPAVi9TE4iKxGYAufY4J.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Addis Wechsler Pictures",
            "id": 4665,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-14",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Duigan"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "John Ehle",
         "John Ehle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113490/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2MTMxMDQyMV5BMl5BanBnXkFtZTcwMDEzMzcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Patric, Thandie Newton, Larry Drake | See full cast and crew »"],
      "reviews": [
         "I stumbled upon this piece of art on my way to bed. 3:39am is not late at all for a film such as this. August King detailed courage and conviction in the most vulnerable way imaginable. Witnessing this man endure all to the benefit of another, under the most trying of circumstances, offered more in cinema than any three films I can immediately recall. Jason Patric has always impressed me, but now has my loyalties as a viewer. This film brings to light the inner struggles of every decision we must make in this life, and our acceptance of the consequences. The \"Journey\" compels one to ponder whether we do enough for the sake of selflessness. August King risks and loses all to lend a hand in starting life anew for a young runaway slave (mastered by Thandie Newton -- a performance and character not soon forgotten by me). Through every twist and turn, August willingly suffers the sorrows of his devotion to an unpopular cause. He challenges his own convictions to do what instinctively seems right. In the end, his pride was enough to convince me of the value of sometimes following your heart. If you have time or if you don't, stay awake and take this journey. This one just made my list. And my list is very short. Is this a film I recommend? No, this is a film I insist.",
         "Of the handful of comments for this extraordinary film, most of them have the story wrong. The tale is not about a man \"falling in love with his dead wife's slave.\" August King becomes involved in helping a young negro girl escape from her cruel owner in the backwoods of South Carolina in the early eighteen hundreds. The love is more sacrificial than sexual, and the film teaches excellent lessons about duty, honor, compassion, responsibility, and making choices. August finds himself through helping Annalees. It's beautifully filmed and very stirring, with the kind of conclusion that makes many other films seem incomplete and shallow. This is an excellent film. It's also very family-friendly aside from some thematic elements (a slave is cleaved in half, animals are slaughtered, and so forth). I purchased it on a whim and never regretted the twenty bucks I spent. Everyone should see this at least once.",
         "This is a BEAUTIFUL film, both in its cinematography and in its story. It is not, as one reviewer put it, about a man who falls in love with his dead wife's servant. It is about a man who risks all to aid a young runaway slave (no relationship to him or his wife). This is a powerful film about a man's struggle to follow his conscience despite a world that insists he do otherwise. I can't believe that until today (Aug 3, 2003), I had not seen this film. Too bad movies like this aren't made more often. Excellent acting, writing, directing, cinematography. A++",
         "This is a morality tale that will have you wondering \"How would I handle this type of situation? You hope you would do the right thing but there are consequences that may conflict with your conscience. This wonderful film will definitely make you examine your conscience. Besides all that, it is a beautifully crafted masterpiece with superior acting by Jason Patric and Thandie Newman as well as the supporting cast. As mentioned, it takes place in a beautiful part of our country, magnificently photographed by cinematographer Slawomir Idziak. The pacing is perfect, the brilliant music score by Stephen Endelman is emotionally appropriate, the script perfection, in fact, everything about this film is beautiful, except the attitude and the horrors of the pre-Civil War era. The fact that human beings were, and are, being treated worse than animals is a shameful fact about the human race. This film reminds us and jolts us smack in our conscience! I highly recommend it to every human being. BTW, I wish a CD of the music score existed. I'd buy it in a heartbeat!",
         "I loved this movie, but I saw it on cable years ago. It has sat in the back of my mind and I had almost forgotten the title. I plan on finding this to add it to my DVD collection. The Conflict and journey August faces reminds me a bit of the conversion of Francis of Assisi. It poses a question, \"how much would you give, and how far would you go?\" If you want a movie that will boost your hope, this is a movie for that. I think it is hard to believe that this movie wasn't seen on the big screen, or really advertised. It has excellent immersion, and doesn't look or feel like a cheap movie. I think it is one of the best stories told in film.",
         "On his way home from selling his produce, farmer August King meets a black teenage girl escaping her cruel master. He doesn't help her but doesn't reveal her either and later she returns looking for help. He reluctantly hides her in his wagon and continues his journey. Along the way the two get to know one another better and gradually become friends. I am a shallow, obvious man and I watched this film because I think Thandie Newton is not only a great actress but also really rather stunning! There. Cards on table! Anyway, I was interested in the title of the film and was not surprised to find that, as hinted by the title, that this is really more about a journey than the actual story. It is a little clichéd in the way that we more or less know where it is going, but it is still pretty engaging nonetheless. The story struggles a little bit to have as much meaning as it thinks it does, and too much of it is a little unsatisfactory, but it works well enough to do the job for 90 minutes. The journey is a little forced at times and doesn't always ring true but it is still worth seeing. A big part of this working is due to the characters of August and Annalees and how they work together. I found both to be interesting and engaging even if nothing was really happening at several points. It was to be expected, but they become friends and it manages to be quite touching at several points. Most of the praise of this can be laid at the actors' feet as they make these characters and quite predictable narrative involving and enjoyable. Patric is great and gives his complex character room to grow as the film progresses - even though his character is not totally clear, he still engaged me. Newton is good even though she looks far too good to be an escaping slave. Her accent is good for the most of the film and only occasionally does she go silly with it! The support cast is not quite as good but Drake and Waterson both do OK. The film looks good and has a gentle atmosphere to it that suits the landscape and also makes the tension easier to raise in the quicker moments (thanks to the contrast). It isn't a brilliant film, but manages to be an enjoyable one despite the lack of a strong narrative. The actors do very well to make engaging characters out of what could have easily been cliché and produce emotion out of what could have just been cloying sentiment.",
         "Someone said in 2003 that he had stumbled on this film on the way to bed. The same thing has just happened to me in December 2008 on BBC 1. Why are these little gems of films shown so late, and why do the listings fail to highlight them as worth watching? The film could have had no other ending than it did. The fact that August told Annalee that she would meet with kindness beyond the northern ridge and the attitude of his equally poor neighbours shows that in 1815, the anti slavery movement may have penetrated to these backwoods. At least, some of the local population were incomers from Europe where slavery was virtually unknown and who relied on their own efforts to carve out a living. I feel the ground is laid for us to suppose that the neighbours will shelter August and help him to start again and that inevitably he will marry again - perhaps to the young woman who has \"known her own mind since a girl\" and who looks at him with admiration. Those who wanted a Hollywood style romance have no historical understanding. The \"brutal master\" is revealed as Annalee's father, which is why he is so desperate to get her back - he owns her in every sense. (And her half breed status explains her beauty to both black and white). His violence is allowed by the laws of the society in which he hold some power. This does not pardon him but explains his conduct. He exacts his revenge no more than the law allows - \"the house for the girl\". The viewer may be invited to reflect on the shortcomings of the Declaration of Independence and remember that even Jefferson could not give up his slaves. The film maker should be congratulated on bring ing this relatively unknown period and place to life.",
         "this movie is one of the very few that show how brutal slavery truly was. it's in one particular scene that totally captured the spirit and brutality and the mindset of slavery. i couldn't believe what i was seeing when the young man/slave was strung up by his ankles and sliced straight down the middle of his body and cut into two whole pieces, all because he ran away. it was shocking, horrific and mind-boggling. films like roots and amistad were good, but didn't quite grasp the stringent violence of slavery. i only hope that when films made about the life harriet tubman, frederick douglas, and nat turner they will be as bold as to show slavery in its most raw form. it's too bad that more people have not seen this film.",
         "The film has a strong moral message to give to the viewer. It raises a question on the mind: is it enough to be a person working for the well-being of himself and family in a honest way in order to be considered to be a good, honorable man? The answer is no. It is not acceptable to condone the cruelty or injustice of others, a conscientious man should fight against them. At the very beginning of the film, there is a scene where a man kills his wounded dog. August King would like to stop him, but he did nothing, just turned back go his own way....At the end of the film he tells that he won't be the man he was used to be...i think he meant such situations...During his journey, August King turned to be a man who would not hesitate to break the rules to do whatever he thinks it is right to do. In sum, the film is something much more than a love story and i very much liked it.",
         "Wow, If you love history, this is as real as it gets. What a journey, I felt like I was right there with them. I first saw this movie on HBO. I watched several times. What sacrifices that had to be. I promise you will enjoy. One of the best authors of North Carolina knew to come back home. Our mountains are filled with such wonderful stories of pioneers struggling to fit in with neighbors, families mingling beliefs and faith. Our forefathers have been in Buncombe county since Revolution days. With little access to this area, it has until recently been untouched with modernization. Our people were simple but lived as Kings. Jason Patric was wonderful in this movie. I am a fan."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Addis Wechsler Pictures",
         "Miramax"
      ],
      "summaries": ["The Journey of August King is a multi-dimensional drama about a North Carolina farmer in April 1815. August King, a widower, is on his way home as he does every year after selling his produce and purchasing the stock and goods he will need for the coming year. On his journey, he comes upon a run-away slave, a 17 year old young woman and August King must decide to violate the law and help this slave to freedom or leave her to be hunted down and,ultimately, returned to her slave owner. But the drama turns into a question of whether either soul will gain freedom."],
      "budget": 0
   },
   "movielensId": 90,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-14",
      "dvdReleaseDate": "2003-01-14",
      "directors": ["John Duigan"],
      "runtime": 91,
      "movieId": 90,
      "title": "The Journey of August King",
      "mpaa": "",
      "actors": [
         "Jason Patric",
         "Thandie Newton",
         "Larry Drake",
         "Sam Waterston",
         "Eric Mabius",
         "Sarah-Jane Wylde"
      ],
      "imdbMovieId": "0113490",
      "originalTitle": "The Journey of August King",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The Journey of August King is a multi-dimensional drama about a North Carolina farmer in 1815. August King, a widower, is on his way home as he does every year after selling his produce and purchasing the stock and goods he will need to survive the winter. On his journey, he comes upon a run-away slave, a young woman about 19 and August King must decide to violate the law and help this slave to freedom or else leave her to be hunted down and, ultimately, returned to her slave owner.",
      "tmdbMovieId": 61548,
      "avgRating": 3.34,
      "releaseYear": "1995",
      "numRatings": 225,
      "posterPath": "/hT5CF2RJPAVi9TE4iKxGYAufY4J.jpg"
   }
}