{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "transformation",
            "id": 4375
         },
         {
            "name": "flower girl",
            "id": 4485
         },
         {
            "name": "colonel",
            "id": 10786
         },
         {
            "name": "wager",
            "id": 11411
         },
         {
            "name": "suitor",
            "id": 11707
         },
         {
            "name": "class differences",
            "id": 14514
         },
         {
            "name": "tutor",
            "id": 18015
         },
         {
            "name": "aristocrat",
            "id": 155697
         },
         {
            "name": "linguist",
            "id": 165278
         },
         {
            "name": "street",
            "id": 165279
         },
         {
            "name": "high society",
            "id": 165282
         },
         {
            "name": "misogynist",
            "id": 165288
         },
         {
            "name": "guttersnipe",
            "id": 165290
         },
         {
            "name": "class prejudice",
            "id": 165299
         },
         {
            "name": "opposites attract",
            "id": 165301
         }
      ],
      "imdb_id": "tt0058385",
      "video": false,
      "title": "My Fair Lady",
      "recommendations": [
         6620,
         804,
         4808,
         13320,
         981,
         900,
         3085,
         3001,
         2769,
         15121,
         11426,
         3078,
         702,
         488,
         705,
         3116,
         261,
         212,
         25673,
         10784
      ],
      "backdrop_path": "/soKwqxI1j5rNkVfDeuarmTHetcH.jpg",
      "revenue": 72070731,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Eliza Doolittle",
               "gender": 1,
               "credit_id": "52fe43fb9251416c75024eab",
               "name": "Audrey Hepburn",
               "profile_path": "/lNmmbyKxwnMSe0vb4kzZroa8lzr.jpg",
               "id": 1932,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Professor Henry Higgins",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024eaf",
               "name": "Rex Harrison",
               "profile_path": "/nWFxAoYfFURmIxz9YJBQ9DLcDx6.jpg",
               "id": 35321,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alfred P. Doolittle",
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024eb3",
               "name": "Stanley Holloway",
               "profile_path": "/3pKWIEPNOSD0lMHrK07RYkVyde4.jpg",
               "id": 12727,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Colonel Hugh Pickering",
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024eb7",
               "name": "Wilfrid Hyde-White",
               "profile_path": "/hBLDxE2Uhf41k5bz0IhmRiKhvPj.jpg",
               "id": 15387,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Mrs. Higgins",
               "gender": 1,
               "credit_id": "538e0730c3a368713f005282",
               "name": "Gladys Cooper",
               "profile_path": "/kDebiupJb7f5ZiFVNT9QTNuJfN9.jpg",
               "id": 3366,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Freddy Eynsford-Hill",
               "gender": 2,
               "credit_id": "538e073fc3a3687143005101",
               "name": "Jeremy Brett",
               "profile_path": "/d7PUiXdHcxGxao0Wmk7gQ0qBxfI.jpg",
               "id": 140914,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Zoltan Karpathy",
               "gender": 2,
               "credit_id": "538e074cc3a368714e0053aa",
               "name": "Theodore Bikel",
               "profile_path": "/haW3rcL6VM0EtwF7kZFSLgWfdys.jpg",
               "id": 6609,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Mrs. Pearce",
               "gender": 1,
               "credit_id": "538e0757c3a36871550051ce",
               "name": "Mona Washbourne",
               "profile_path": "/dYMq56N0O2r1zHM2qJ1ir4FyyIb.jpg",
               "id": 89895,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Mrs. Eynsford- Hill",
               "gender": 0,
               "credit_id": "538e0763c3a368713f00528b",
               "name": "Isobel Elsom",
               "profile_path": "/ccoA79FB3Buw1rooFBkCSqVnrpt.jpg",
               "id": 95263,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Butler",
               "gender": 0,
               "credit_id": "538e076cc3a36871550051d2",
               "name": "John Holland",
               "profile_path": "/1ctCrOanIch8iCkoVu6jxOw08dh.jpg",
               "id": 126656,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Ad Lib at Church (uncredited)",
               "gender": 2,
               "credit_id": "5a3079df0e0a264cc818ce52",
               "name": "Colin Kenny",
               "profile_path": null,
               "id": 120445,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43fb9251416c75024ebd",
               "name": "George Cukor",
               "profile_path": "/s6OKrb7REayEl3NHAQVJXvD9KrX.jpg",
               "id": 14674,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024ec3",
               "name": "Alan Jay Lerner",
               "profile_path": null,
               "id": 27968,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024ec9",
               "name": "George Bernard Shaw",
               "profile_path": "/fBFXY9ZUUToA5VUM8yXNqiOPw5O.jpg",
               "id": 33085,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024ecf",
               "name": "Alan Jay Lerner",
               "profile_path": null,
               "id": 27968,
               "department": "Writing",
               "job": "Musical"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024ed5",
               "name": "James C. Katz",
               "profile_path": null,
               "id": 5728,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024edb",
               "name": "Jack Warner",
               "profile_path": "/I8UijyhvGPOaeiPTmxgcYCa8td.jpg",
               "id": 2663,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024ee1",
               "name": "Frederick Loewe",
               "profile_path": null,
               "id": 68128,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024ee7",
               "name": "Harry Stradling Sr.",
               "profile_path": null,
               "id": 10537,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fb9251416c75024eed",
               "name": "William H. Ziegler",
               "profile_path": null,
               "id": 2773,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a5e50a89251412a0f002ab8",
               "name": "George James Hopkins",
               "profile_path": null,
               "id": 4126,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a5e50afc3a3685c900025c2",
               "name": "Cecil Beaton",
               "profile_path": null,
               "id": 108810,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 10.28184,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11113,
      "vote_count": 462,
      "budget": 17000000,
      "overview": "A misogynistic and snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.",
      "similar": [
         4348,
         14811,
         41204,
         25016,
         66473,
         205491
      ],
      "original_title": "My Fair Lady",
      "runtime": 170,
      "poster_path": "/AiyysCDn0l5SHO5dTGHsrKjPBN8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1964-10-21",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "The loverliest motion picture of them all!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George Cukor"],
      "runtime": 170,
      "synopsis": "Henry Higgins (Rex Harrison), an arrogant, irascible professor of phonetics, boasts to a new acquaintance, Colonel Pickering (Wilfrid Hyde-White), that he can teach any woman to speak so \"properly\" that he could pass her off as a duchess. The person whom he is shown thus teaching is one Eliza Doolittle (Audrey Hepburn), a young woman with a horrendous Cockney accent who is selling flowers on the street. After overhearing this, Eliza finds her way to the professor's house and offers to pay for speech lessons, so that she can work in a flower shop. Pickering is intrigued and wagers that Higgins cannot back up his claim; Higgins takes Eliza on free of charge as a challenge to his skills. Eliza's father, Alfred P. Doolittle (Stanley Holloway), a dustman, arrives three days later, ostensibly to protect his daughter's virtue, but in reality simply to extract some money from Higgins, and is bought off with £5. Higgins is impressed by the man's genuineness, natural gift for language and especially his brazen lack of morals (Doolittle explains, \"Can't afford 'em!\"). Eliza goes through many forms of speech training, such as speaking with marbles in her mouth and trying to recite the sentence \"In Hertford, Hereford, Hampshire, hurricanes hardly ever happen\" without dropping the 'h', and to say \"The rain in Spain stays mainly in the plain\" rather than \"The rine in spine sties minely in the pline\". At first, she makes no progress (due to Higgins's harsh approach to teaching), but just as she, Higgins, and Pickering are exhausted and about to give up, Higgins softens his attitude and gives an eloquent speech about the beauty and history behind the English language. Eliza tries one more time and finally \"gets it\"; she instantly begins to speak with an impeccable upper class accent. Higgins takes her on her first public appearance to Ascot Racecourse, where she makes a good impression with her stilted, but genteel manners, only to shock everyone by a sudden and vulgar lapse into Cockney; \"C'mon Dover, move your bloomin' arse!\". Higgins, who dislikes the pretentiousness of the upper class, partly conceals a grin behind his hand, as if to say \"I wish I had said that!\" The bet is won when Eliza successfully poses as a mysterious lady of patently noble rank at an embassy ball, despite the unexpected presence of a Hungarian phonetics expert trained by Higgins. Higgins's callous treatment of Eliza afterwards, especially his indifference to her future prospects, leads her to walk out on him, leaving him mystified by her ingratitude. When she is gone however, he comes to the horrified realization that he has \"grown accustomed to her face.\" Putting aside his resentment about the intrusion on his life and toward women in general, Higgins finds Eliza the next day and attempts to talk her into coming back to him. During a testy exchange, Higgins's ego gets the better of him, and his former student rejects him. Higgins makes his way home, stubbornly predicting that Eliza will be ruined without him and come crawling back. However, his bravado collapses and he is reduced to playing old phonograph recordings of her voice lessons. To Higgins' great delight, Eliza chooses that moment to return to him.",
      "writers": [
         "Alan Jay Lerner",
         "George Bernard Shaw"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0058385/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5MTEzMzE4MF5BMl5BanBnXkFtZTcwMDAzMTUyMg@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Audrey Hepburn, Rex Harrison, Stanley Holloway | See full cast and crew »"],
      "reviews": [
         "I have read in a great many places (including the IMDb) that Henry Higgins is a misogynist. It has also been said that the film is a misogynist's fairy tale. Anyone saying this has clearly not watched this film too closely. First, Higgins is not a misogynist. A misogynist hates women. What Higgins is, in reality, is a misanthrope. A misanthrope basically dislikes and distrusts everyone! Watch the film and you'll notice that Higgins treats everyone with the same disregard-Col. Pickering, Eliza's father, his own mother-everyone receives his rather cynical disdain. Some of the minor characters come off being treated worse than the principals do. It's simply more noticeable with Eliza because it's more frequent, it's newer with Eliza because the other principal characters have known Higgins longer and thus take it in stride. The myth that Higgins is a misogynist is perpetuated by the song, \"Why Can't A Woman Be More Like a Man?\". Second, it can hardly be called a misogynist's fairy tale. If that were the case, I doubt Alfred Doolittle would have cause to sing, \"Get Me To the Church On Time\", as he'd hardly be getting married. His life is just as \"ruined\" as Eliza's by his encounters with Higgins, just as altered as her life has been. This is a great musical, a good movie and it was even better as the original play by Shaw. Well worth seeing. Recommended.",
         "There's a lot of negative things been said about Audrey Hepburn's interpretation of the role of Eliza. Perhaps she's not ideal in the earliest scenes of the movie - her \"dirtiness\" is never quite believable - but it has to be said that despite this smallish drawback she still glows, and makes an amazing Eliza overall. The reason for this is simple; Audrey Hepburn brings her \"own spark of divine fire\", (to quote Higgins) to the role and her vulnerability, mixed with her sweet, naive charm and even her wonderfully juvenile pettishness shown in \"Just You Wait\" all prove what a talented actress she really is. For an example of this, just watch Eliza's facial expression at Ascot, when she realises her opportunity to demonstrate her new-found mastery of the English tongue - sweetly hilarious. MFL has been criticized as being too romanticized, too overblown. I disagree; musicals are suposed to be lavish affairs, and none pull it off quite so well as \"My Fair Lady\" does. It's a momentous film but it has its subtle points: watch the way in which Eliza's eyes are centred on Higgins when she enters at the ball, and the way in which the two of them stare at each other for a few seconds at the top of the stairs a few moments later. It musn't be overlooked that, thanks to its being based on a Bernard Shaw play, \"My Fair Lady\" has what the great majority of musicals lack: a deeper meaning and something really quite profound to say. The actor in the role of Colonel Pickering is a little weak, but it must be said that Rex Harrison IS Henry Higgins. In a lot of ways (in fact, in most ways) Higgins has an objectionable personality: rude, snobbish, impatient and even misogynistic, but somehow Rex Harrison pulls it all off and makes us like Higgins without betraying the character. As to romance, his song \"I've Grown Accustomed to Her Face\" is an ode to the kind of love which sneaks up on you. Overall, this movie is romantic, but not too sentimental. It has just enough romance to be dramatically fulfilling, but it never becomes soppy or mawkish. The word \"love\" is never mentioned at all and the two leads never even kiss. The famous end sequence is perfect and does the movie justice; after all, a big happy bow tied around a perfect romance at the end would simply not fit with everything we have learned about the two protagonists.",
         "Audrey Hepburn is radiant and touching as the poor flower seller Eliza Doolittle who challenges her mentor's makeover powers, before eventually passing for a lady in London society... She is skillfully transformed into an elegant lady by a speech professor Henry Higgins (Rex Harrison) and taught to speak properly... From first frame to last, the film is slick, graceful, gorgeous to behold, with costumes and sets richly evoking the Edwardian era... 'My Fair Lady' begins in London, on a rainy evening outside Covent Garden, where a 'respectable girl' is selling bouquets of violets... Professor Henry Higgins, a phonetics and linguistics expert, confronts the 'deliciously low so horribly dirty' Eliza Doolittle for the first time... In the best tradition, their first songs reveal their characters: 'Wouldn't It Be Loverly?' expresses Eliza's own ideas of what she dreams, while in 'Why Can't the English Learn to Speak' Higgins sings his despair over the deterioration of the English language, and displays his hard, irritable, intolerant, and elegantly arrogant nature... Lerner and Loewe's songs are shear delight as the story moves from Higgins's wager with sympathetic Colonel Pickering (Wilfrid Hyde-White) that he can change the street girl with a strong cockney accent into a different human being by teaching her 'to speak beautifully' and pass her off in an upper class lady within six months... Higgins and Pickering are both single men, and the housekeeper, Mrs. Pearce, has misgivings about the way in which they are proposing to amuse themselves without caring about the consequences for the \"common ignorant girl.\" The songs are extraordinary in their ability to enrich our knowledge of the characters... Higgins' early song 'I'm an Ordinary Man' confirms that he is a 'quiet living man' without the need for a woman... Alfred Doolittle's 'With a Little Bit of Luck ' not only states his general philosophy of life, but exposes the perfect portrait of a friendly scoundrel... Eliza's father, who calls himself one of \"the undeserving poor\" is one of Shaw's best comedy creations... When he arrives to protest at the immorality of Higgins and Pickering treatment of his daughter, it soon becomes clear that he just wants to gain something for himself out of the situation... Eliza, becoming subject to Higgins' intimidation, belts out her discomfort at the rude, selfish Higgins, imagining a king ordering his death, in \"Just You Wait, 'Enry 'Iggins.\" The music is also a logical extension of the characters' feelings... When Eliza finally pronounces impeccably: 'The rain in Spain stays mainly in the plain,' Higgins can hardly believe what he has heard: ('By George, she's got it. Now once again, where does it rain?'), and Eliza ('On the plain! On the plain!') and Higgins simply cannot be contained ('And where's that soggy plain? ') Eliza responding: In Spain! In Spain! They sing a duet together to celebrate their success... The scene leads to one of the most triumphant sequences in musical history... Further, the stunning scene in which Eliza Doolittle appears in high society when she meets Higgins's mother (the impeccable Gladys Cooper), and attends the Ascot races... She instantly charms a young admirer Jeremy Brett (Freddy) by her slightly odd manner of speaking, who later haunts Higgins' house (\"On the Street Where you Live\"). The climax comes at the Embassy Ball, where Higgins' protégé, now \"an enchanting young lady\" charms everyone with her beauty... Her exercise is an unqualified success... Her waltz with the Queen's son, and other dance partners, spreads throughout the audience about her identity... Henry and Pickering are ecstatic... They congratulate each other for their \"glorious victory,\" ('You Did It'), but Eliza is hurt and angry at being ignored... They barely acknowledge her presence... She is no longer a part of any world... When Higgins returns for his slippers, which he has forgotten, Eliza flings them angrily at him, and voices her feelings: 'Oh, what's to become of me? What am I fit for?' In an attempt to find her true identity a frustrated Eliza encounters Freddy who declares his love for her, but she returns to the populated flower market outside Covent Garden, where no one recognizes her... Her own 'miserable' father - tuxedo-dressed - gives her the cheerful news that he is about to get married... In the closing scenes, Higgins is upset to discover Liza has left him and is led to wonder why 'can't a woman be more like a man? Men are so honest, so thoroughly square.' Eliza surprises Higgings with her decision to marry Freddie, and claims: 'I shall not feel alone without you. I can stand on my own without you. I can do bloody well 'Without you!' At his home, at dusk, Higgins ultimately recognizes Liza's quality... He recalls Liza and realizes how much she has come to mean to him... Without her, he is lost and lonely... The climax is a great ending to a great musical... 'My Fair Lady' has great style and beauty... The film describes what is common in many societies... That accent determines the superficiality of class distinctions... The motion picture is humorous, notably the wonderfully steamy bath in which Prof. Higgens' female staff cleanses the accumulated dirt of the street off Eliza Doolittle... With the dazzling splendor that director George Cukor offers: the designer's eye for detail, the painter's flair for color, the artist's imagination, and the delicacy of handling, the film garnered no less than twelve Oscar nominations, and took home eight statuettes including Best Picture of the year, Best Actor- Harrison, Best Director- Cukor, as well as Best Art Decoration, Sound, Scoring, Costume Design, and color Cinematography...",
         "Very few movies are letter-perfect. Not perfect in the sense that goofs and gaffes don't exist here and there, but perfect as in pure entertainment. Especially in long movies, the squirm element is always a threat. \"My Fair Lady\", bringing the most tuneful of Broadway scores to the big screen (really big, at the time) was as perfect as movie entertainment could be. The old furors over Audrey Hepburn seem silly in hindsight. Hepburn replaced Julie Andrews, a wonderful singer-actress who had created the role, not only on Broadway but in London. But Andrews was not a familiar face to movie-goers and no one knew if she'd hold an audience in the movies as in the live theaters. Too, Hepburn was an inspired choice, since her background probably would make Eliza Doolittle's transformation from flower-selling gutter-snipe into a lady of quality more believable (Hepburn's mother was a baroness). As far as her singing voice, the new DVDs of \"MFL\" have her acting to her own recordings of a few of the songs, and while it's not bad, at this level of film-making expense and prestige, \"not bad\" is no good. Surrounding her are a magnificent cast. Stage and screen pros Rex Harrison (Henry Higgins) and Stanley Holloway (Doolittle) were carried over from Broadway (after some initial and rather foolish questions about both). Joining them were veteran droll actor Wilfred Hyde-White as Col. Pickering and an amazingly youthful Jeremy Brett (\"Sherlock Holmes\") as Freddy. The book and lyrics were by Alan Jay Lerner and the music by Frederick Loewe (\"Brigadoon\", \"Camelot\", \"Gigi\", etc.) based on George B. Shaw's best play. A fully \"integrated\" musical where the songs advance the story or reveal character, the nonpareil line-up of songs include \"I've Grown Accustomed to Her Face\", \"The Rain in Spain\", \"I Could Have Danced All Night\" and \"On the Street Where You Live\". Because of its theatrical origins there is an unavoidable stage-bound look to some scenes. But the designers have done their best to keep this from being a detriment. The interiors look like real houses, the Covent Garden set is a masterpiece of openness. Only the Ascot scene retains its staginess, but its black and white palate and stylized look adds variety to the movie. The restored DVD version looks great. I saw a print of this movie in a revival theater in the early 1980s; it was blurry and broken and the colors were faded and inaccurate. Yet the designers used a rich tapestry of colors and wood tones, giving every corner of the movie's wide screen something worth seeing. \"MFL\" was a spectacle well worth the struggle and expense of restoration. Everything about \"MFL\" was first-class, the cast, script, costuming, sets, music. For someone who enjoys musical there's not a dull moment.",
         "I first saw this film when I was eight years old, after receiving it as a first communion present from my mother. For months I watched the movie on an almost daily basis, and it was quickly a favorite. I thought it was absolute perfection. Now that I am a bit older.. I notice that is does have quite a few flaws. It doesn't really capture the essence of Shaw's Pygmalion, but I don't think that should really take away from the movie; they should be treated as separate entities. Some of the sets are a little, well, cramped, but consider what they had to work with, they did a pretty good job. And then there is the dubbing issue. I recently special on MFL on AMC, and they showed \"Wouldn't It Be Loverly\" and \"Show Me\" with Audrey's voice, and though Audrey may not have the perfect melodic voice of Marni Nixon, her voice was much more \"Eliza\". I really do think they should have just used her voice. If you watch \"Funny Face\", you get a good feel for voice, which I think is beautiful in a unconventional way. Then, there is the question of whether Julie Andrews should have played Eliza in the film version of MFL. I've gone back and forth on this issue. Now, Audrey Hepburn is my favorite actress of all time, and Julie Andrews is a close runner-up, so it really is hard to \"choose\". Of course Julie's voice is much better than even Marni Nixon's... but like I said before, I don't think a perfect singing voice really would suit Eliza. And as for which would play a better Eliza overall.. I really don't know. I wasn't alive to see MFL on Broadway, so I really can't compare the two. What I do know is that Audrey gave an amazing performance. Anyway, as someone else said, if Julie had played Eliza, who would have played Mary Poppins? ;)",
         "\"My Fair Lady\" made theater history when it opened on Broadway. The waiting for tickets to see the show was something unheard of for a sellout musical. Lerner and Loewe, its creators, probably never thought they had the tremendous hit it became, at all. The film version of \"My Fair Lady\" came to the screen via George Cukor, a man who knew about the movie business well. The film resonated with audiences because of the immensely elegant finished product Mr. Cukor offered the world. Of course, the film is helped by the genius of Cecil Beaton, who had the eye for the right style. Mr. Beaton served as art director and had a thing to say about the fabulous costumes assembled for the movie. The Ascot race sequence is a tribute to his sense of elegance. Rex Harrison, repeating the role of Professor Higgins that he originated on Broadway, gives a stellar performance. Not having seen him on stage, at least one can imagine how he amazed audiences that flocked to see the show. In the film he makes an absolutely delightful Higgins, a man of science who can't see what's in front of him. The transformation he achieves in turning the Cockney flower girl into a lady of elegance, is perhaps, something he didn't even think he would be able to pull. In Mr. Harrison's performance one can see how Eliza warms this confirmed bachelor into accepting her in a romantic way. Audrey Hepburn was chosen over Julie Andrews, the original Eliza on Broadway, in a move that puzzled everyone in the theatrical world. How could Eliza be played by anyone else, let alone that someone else would be that charming actress Audrey Hepburn? Ms. Hepburn's Eliza is a delicious characterization; her take on the poor flower girl starts slowly, taking us with her all the way. We fall in love with Eliza, the character, as played brilliantly by Ms. Hepburn, who knew how to charm us with her beauty and easy elegance in everything she did. The English cast was wonderful. Stanley Holloway, a veteran of the English cinema played Alfred P. Doolitlle, Eliza's father. Mr. Holloway is charming every time one sees him. Gladys Cooper, one of the first ladies of the English stage, is seen as Mrs. Higgins, a grande dame of society, who is charmed by Eliza and knows her son will end up loving the girl of his experiment. Wilfred Hyde-White, another distinguished actor plays Col. Pickering, Higgins' ally and friend. Jeremy Brett plays the playboy Freddy, the man that loves the street where Eliza lives! Of course, what makes \"My Fair Lady\" special is the great musical score by Mr. Loewe with lyrics by Mr. Lerner. Most of the songs are by now, standards that have delighted us since they were written and have been sung by practically all the best singers of the world. Mr. Cukor deserves credit for directing this film with his usual flair as he feasts our eyes with a stunning film that will always be loved by whoever watches it.",
         "My Fair Lady is a musical which is very witty. The dialogue is wonderful. The story begins as Henry Higgins (Rex Harrison) makes a bet that he can transform flower girl Eliza Dolittle (Audrey Hepburn) into a high society lady. Henry Higgins is the perfect example of high society snobbery of the times. What he wasn't counting on was falling in love with his \"project\". Some people may find this film to be sexist but it is really quite the opposite. While it is about a sexist person it is not actually sexist at all. In fact it is all about the irony in the relationship between that of Eliza Dolittle and Henry Higgins. It is not unbelievable that Henry and Eliza should fall in love because they are not \"compatible\". Opposites often attract after all. Even though there is an anti-romantic disclaimer in the original play Pygmalion , it is obvious that Eliza and Higgins are meant for one another in the end of My Fair Lady. My Fair Lady is really different from Pygmalion. There is a movie version of Pygmalion which is the dull non-musical version of My Fair Lady. Rex Harrison is simply wonderful as Henry Higgins. He is not one bit tired with his role. And even though Julie Andrews originated the role of Eliza on Broadway, Audrey Hepburn is great in the role. It would be unfair to say that she didn't deserve the role just because her voice was dubbed. The supporting cast is first rate as well. This film is more than just good, it is great. If you have not seen it yet you certainly should! *****/ ***** stars",
         "I thought the music was wonderful. I thought Audrey Hepburn was just adorable and so full of energy and grace and just fascinating to watch. Rex Harrison was an absolutely perfect Professor Higgins and never wavered or changed character. My problem (a minor one) is with the ending and with the dubbing. The story is brilliant of course, taken from George Bernard Shaw's acclaimed play Pygmalion, although materially altered to fit the requirements of a musical comedy. The contrast of the unschooled street urchin Liza Doolittle and the stuffy, self-possessed confirmed bachelor, a kind of nineteenth century British man of science, wonderfully accomplished in his profession, but blind to himself when it comes to relationships with other people, made for a most interesting match. And the delusive dream of a man forming his own perfect woman (which is the basis of the Pygmalion legend) works so very well with a conceited linguist tutoring a cockney girl. The entire concept is a work of genius with the drunken father and the objectifying Col. Pickering and the very right Mrs. Pierce. But there are some problems. Freddy is needed of course as another \"objectifying\" character to make it clear just how desirable Eliza really is and how foolish and blind Professor Higgins is in not seeing this--in theory, of course, because in practice with Audrey Hepburn or Julie Andrews as Eliza, this would seem entirely unnecessary. And indeed without Freddy we do not have the beautiful \"On the Street Where You Live.\" But even with him Prof. Higgins does not see, and indeed even at the resolution of the story, he still does not see, as he asks for his slippers. If this were presented to current London and Broadway audiences it would never play the way it was written. Professor Higgins would need to see the light and he would have to get his own slippers! The dubbing and the need for it is curious. There is no doubt that Marni Nixon, who did the singing, has a beautiful and commanding voice, and we are the better for having heard her, but why is the dubbing so obvious? It's almost as if Miss Hepburn is saying to the audience: they said it would be better if Miss Nixon sings instead of me because her voice is stronger and so very well trained. And so Hepburn does not completely lip-sync some of the opening words of songs as though to remind us that she is not singing. And the contrast between her delicate voice and then the sudden power of Marni Nixon's is obvious. Beyond this is the question of why Julie Andrews, who has a voice to match that of Miss Nixon, and charisma and charm at least in the same ballpark as Miss Hepburn, wasn't asked to play the part that she knew so very well from her experience on the stage. Still, as another reviewer has so acutely noted, if she had been asked, we would have missed her in Mary Poppins, which was made the same year. I should also note that Hepburn was 33 or 34 years old when this was made (although she looked almost ten years younger). Nonetheless she was playing the part of \"a good girl, I am,\" whom Pickering identifies in his call to Scotland Yard as being 21 years old. Curious. But all is forgiven because Audrey Hepburn is just so beautiful, so elegant and so delightful in the part. I especially loved her in the opening scene in her soiled clothes and hat and her sour voice. By the way, I have heard Julie Andrews sing the part, although I never saw her on the stage, and the way she \"meow's\" Eliza's accent, like a cat's claw on a chalk board, is really amazing. (Get the CD.) This is one of the best movie musicals ever made, a sheer delight highlighted not only by Rex Harrison and Audrey Hepburn, but by Stanley Holloway as the Liza's lovable rascal father and Wilfrid Hyde-White as the very understanding and very properly British Col. Pickering with opulent direction by the great George Cukor. The sets and production numbers are gorgeous. But see it for Audrey Hepburn, one of the great stars of the silver screen in one of her most memorable roles. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "Spoilers herein. I'm very impressed by how Cukor put this film together. The songs are very good, but the film still rates high even without them. The tone of the presentation is pretty sophisticated. Any musical is a self-aware stage production in the first place. Shaw's original was centered on the notion of performance, and Cukor merges these two in a few ways: --The costumes look like stage costumes, the sets like sets. The acting is projected' as if on a stage; motions are grande. --Some stage setups are particularly self-referential: for instance the morning after the play in the first scene is set up by actors entering in layers and freezing until the action is `turned on.' The Ascot crowd choreography. The `get me to the church' piece reminds us of the camera by cutting back and forth between different stagings of the number -- novel for the time. --The story is set in the context of performance. The play begins by players leaving a performance; the father becomes a celebrated philosopher as performer; the very notion of upper class (as sketched by the Ascot sequences) is cast as a performance which \u0091liza merely masters. Diction as class as performance as life: a very self-referential playwriting perspective. (Usually, we find it in a more mundane form: actors creating a script by living.) Today, this would have to include the actors acting in at least two dimensions: as the characters in the story and as actors playing them on stage. (Brando did this in `Guys and Dolls.') The judgement that Eliza was a Hungarian princess in disguise is more than a mere throwaway joke to make fun of the hapless Zoltan Karpathy (played incidentally by someone with a Hungarian heritage). The notion of Pygmalionian linguistics as both a parsable science and a lever for socialist leveling originated in Budapest. Shaw, being a master of language and student of society was interested in this, and he finally relented in having Pygmalion filmed because the studio promised a Hungarian director. The notion of linguistics and social determinism is an English obsession: the orthography (phonetic writing) that Higgins uses is derived from the first formal orthography, devised by Thomas Harriot in the 1580s to capture what he thought was a new world magic to be found in the Algonquian (a Native American) language. (The characters are half Kabbalah and half descriptive of mouth shape.) He was a contemporary of Shakespeare. Neither would have thought the English language particularly noble because it used so many French words. Both would have sounded more like the guttersnipe.",
         "The classic case of an embarrassment of riches. The infrastructure of this jewel reads like a Who's Who of American Cinema. Take the play by George Bernard Shaw. It's in the Western Canon of Literature, for heaven's sake. Then add lyrics by Jay Lerner and his longtime collaborator composer Frederick Loewe who gave us everything from An American in Paris, to Gigi, to Brigadoon, among many others. Directed by George Cuckor, whose credits include not only Gone With the Wind, but also a string of Katherine Hepburn films, My Fair Lady bears Cuckor's brilliant touch in directing leading women. And what a leading woman he had to work with this time. Audrey is breathtaking in every move and every syllable she utters. But that's not all. Those stunning costumes designed by Cecil Beaton are without peer in modern cinema, especially the Ball Gown. Audrey was so exquisite that she looked unreal, perhaps of another species, as she descended the stairs and donned her velvet cape. With music direction by Andre Previn, the baton behind Gigi, Porgy and Bess, Kiss Me Kate and even Jesus Christ Superstar, My Fair Lady's musical pedigree is complete. From this perspective, My Fair Lady is the culmination of a generation of America musicals, and the greatest one of them all even before the first frame was filmed. Ironically, Audrey was denied a well-deserved Oscar. She didn't even get nominated, which from an historical perspective boggles the mind. The Oscar that year went to Julie Andrews for Mary Poppins. Andrews, who had popularized the role of Eliza Doolittle on Broadway before the movie was made, passed on My Fair Lady to do Mary Poppins. Andrews, a gifted singer, was reportedly miffed at the casting of Hepburn, whose singing was dubbed by an uncredited Marne Nixon, and Hepburn's exuberant performance was completely ignored by the SAG. But there were enough Oscars to go around. Beaton, Harrison and Previn all collected statuettes, and My Fair Lady collected eight total and was nominated for four more. This immense achievement was almost lost to deterioration, but the newly restored version is stunning. If you don't have this one in your collection, you can't call it a collection."
      ],
      "genres": [
         "Drama",
         "Family",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Gloriously witty adaptation of the Broadway musical about Professor Henry Higgins, who takes a bet from Colonel Pickering that he can transform unrefined, dirty Cockney flower girl Eliza Doolittle into a lady, and fool everyone into thinking she really is one, too! He does, and thus young aristocrat Freddy Eynsford-Hill falls madly in love with her. But when Higgins takes all the credit and forgets to acknowledge her efforts, Eliza angrily leaves him for Freddy, and suddenly Higgins realizes he's grown accustomed to her face and can't really live without it.",
         "A chance meeting between two noted British linguists, Prof. Henry Higgins and Col. Hugh Pickering, leads to a wager that will test Higgins' skills. After they hear a cockney flower girl caterwaul in the street, Higgins proposes to transform the girl, Eliza Doolittle, into a refined Victorian lady with an aristocratic accent. After some hesitation Eliza agrees to become their test case.",
         "A misogynistic and snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society."
      ],
      "budget": 17000000
   },
   "movielensId": 914,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-10-21",
      "dvdReleaseDate": "1998-12-08",
      "directors": ["George Cukor"],
      "runtime": 170,
      "movieId": 914,
      "title": "My Fair Lady",
      "mpaa": "G",
      "actors": [
         "Audrey Hepburn",
         "Rex Harrison",
         "Stanley Holloway",
         "Wilfrid Hyde-White",
         "Gladys Cooper",
         "Jeremy Brett",
         "Theodore Bikel",
         "Mona Washbourne",
         "Isobel Elsom",
         "John Holland",
         "Colin Kenny"
      ],
      "imdbMovieId": "0058385",
      "originalTitle": "My Fair Lady",
      "genres": [
         "Drama",
         "Family",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["j2OBKPuftKk"],
      "plotSummary": "A misogynistic and snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.",
      "tmdbMovieId": 11113,
      "avgRating": 3.86604,
      "releaseYear": "1964",
      "numRatings": 12015,
      "posterPath": "/AiyysCDn0l5SHO5dTGHsrKjPBN8.jpg"
   }
}