{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "forest",
            "id": 5774
         },
         {
            "name": "black and white",
            "id": 12999
         }
      ],
      "imdb_id": "tt0039428",
      "video": false,
      "title": "Golden Earrings",
      "recommendations": [],
      "backdrop_path": "/rG3hYOGMZsACdh9RbYxtOCbUEhW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Col. Ralph Denistoun",
               "gender": 2,
               "credit_id": "52fe4a62c3a368484e1503f9",
               "name": "Ray Milland",
               "profile_path": "/zB7jGIBc6dc3fMqCpXlCDZxQrll.jpg",
               "id": 7124,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "52fe4a62c3a368484e1503fd",
               "name": "Marlene Dietrich",
               "profile_path": "/eZFuvNCV0kkI9MHFKxTKYegAfIK.jpg",
               "id": 2896,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Zoltan",
               "gender": 2,
               "credit_id": "52fe4a62c3a368484e150401",
               "name": "Murvyn Vye",
               "profile_path": "/PAJTJO03eQMl674Bvn3KYX6tVY.jpg",
               "id": 20100,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Richard Byrd",
               "gender": 2,
               "credit_id": "52fe4a62c3a368484e150405",
               "name": "Bruce Lester",
               "profile_path": "/emaaqMHeWnBoOYCCblKqWhIGwhj.jpg",
               "id": 82384,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hoff",
               "gender": 2,
               "credit_id": "52fe4a62c3a368484e150409",
               "name": "Dennis Hoey",
               "profile_path": "/sUBhxgYoVscGPzxDxgud2OdiYVc.jpg",
               "id": 25175,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Himself - American Journalist",
               "gender": 0,
               "credit_id": "52fe4a62c3a368484e150425",
               "name": "Quentin Reynolds",
               "profile_path": null,
               "id": 64111,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Prof. Otto Krosigk",
               "gender": 0,
               "credit_id": "52fe4a62c3a368484e150429",
               "name": "Reinhold Schünzel",
               "profile_path": "/3XLrHa6YZ02vQjdqB9Bh3EoDgWX.jpg",
               "id": 4344,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Maj. Reimann",
               "gender": 2,
               "credit_id": "52fe4a62c3a368484e15042d",
               "name": "Ivan Triesault",
               "profile_path": "/gWpMvwsE3ydU0GeFtvLqQZBXbov.jpg",
               "id": 5041,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Greta Krosigk",
               "gender": 1,
               "credit_id": "52fe4a62c3a368484e150431",
               "name": "Hermine Sterler",
               "profile_path": "/kDxPvpktsA0R3yiucNTebXM4pDO.jpg",
               "id": 130409,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a62c3a368484e1503f5",
               "name": "Mitchell Leisen",
               "profile_path": "/bxCNSNQe140zi82gozX5d0CkQnz.jpg",
               "id": 108914,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a62c3a368484e15040f",
               "name": "Abraham Polonsky",
               "profile_path": null,
               "id": 81976,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a62c3a368484e150415",
               "name": "Frank Butler",
               "profile_path": null,
               "id": 131408,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a62c3a368484e15041b",
               "name": "Helen Deutsch",
               "profile_path": null,
               "id": 31068,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a62c3a368484e150421",
               "name": "Yolanda Foldes",
               "profile_path": null,
               "id": 1188572,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.708331,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 121357,
      "vote_count": 3,
      "budget": 0,
      "overview": "A British colonel (Ray Milland) escapes from the Gestapo to the Black Forest and poses as a Gypsy's (Marlene Dietrich) mate.",
      "similar": [
         281957,
         7518,
         75174,
         10010,
         1579,
         1369,
         1979,
         10191,
         58595,
         390062,
         3170,
         2667,
         6947,
         2292,
         11886,
         119450,
         433808,
         395834,
         227156,
         10009
      ],
      "original_title": "Golden Earrings",
      "runtime": 95,
      "poster_path": "/2gcfgwuRuX8PfGEI00THfT0U4yl.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1947-08-27",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "Strange . . . Amazing . . . Their Love Story !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Mitchell Leisen"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Abraham Polonsky",
         "Frank Butler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039428/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MjQ1OTk4MF5BMl5BanBnXkFtZTcwNzA3ODEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ray Milland, Marlene Dietrich, Murvyn Vye | See full cast and crew »"],
      "reviews": [
         "I've watched this film perhaps a dozen times, and yet it always stays fresh with me. I think it's one of the best things Dietrich has ever done. This is a Dietrich you've never seen before. Not a worldly femme fatale, but an earthy, highly engaging woman. The interplay between this uncultured gypsy (Dietrich) guided by the spirit world and the stuffy, establishment rationalist(Milland) is both funny and poignant. Dietrich and Milland are simply wonderful in their roles, and Leisen's direction is subtle and clever. If the story lacks plausibility, who cares? This picture belongs to Dietrich and Milland and the wonderful authenticity they bring to their characters.",
         "Having recently purchased Universal's Marlene Dietrich DVD collection, I was somewhat reluctant to watch \"Golden Earrings.\" The idea of a 40-something Marlene Dietrich as a gypsy in a war-time romance seemed unusual, and implausible. I should not have worried. With all the professional talent that went into these old movies, it's hard to miss, really. The movie was a joy to watch; it's a classic. The most interesting thing about the film was Dietrich, who pulls off the gypsy role perfectly. The makeup, lighting, photography, and her performance all add up to make a really startling and memorable character. I had never seen Dietrich play a \"good\" woman convincingly before--but she does here! She played a lot of heartless vamps in those great Sternberg films, so it is refreshing to see her in a more down to earth, relaxed role, playing an exotic but very human character. Overall, a very nice romance. The love story is believable, optimistic, and the happy ending is extremely satisfying.",
         "I am really surprised that this film only has a rating of 6.4 as of the time I did this review. While not exactly a great film, I do think it's one of the best films Dietrich did and it's a shame it isn't more highly regarded. I think a lot of the reason I liked the film so much is that the usual silly Dietrich persona as the \"über-vamp\" isn't present and her role required her to actually act. I just hate seeing film after film after film in the early days of her career where she seemed more like a caricature or cliché than a real woman. I don't necessarily blame Dietrich for the silly vampish films she made in the 1930s--audiences loved them and they did make her famous. But here, she showed she really could act. After all, just looking at her in films like MOROCCO, BLONDE VENUS and THE BLUE ANGEL, who would have guessed that she was well-cast to play a Gypsy! I was quite prepared to hate the film because of this casting decision, but it worked--she was pretty believable and a lot of fun to watch as well! The film is, essentially, a vehicle just for Ray Milland and Marlene Dietrich--the other supporting characters are very much secondary to the movie. Milland is a wanted spy in pre-WWII Germany and in his efforts to escape, he stumbles upon a rather frisky lone Gypsy (Dietrich) who instantly takes him to be a fulfillment of prophecy--in other words, her new lover! Milland is quite stuffy but reluctantly agrees to travel in her wagon--even putting on body paint and piercing his ears to make him look like a Gypsy (hence the title to the movie). Over time, he slowly starts to realize that underneath her very uncouth exterior is quite a woman and romance slowly blossoms. The film in a word is \"charming\". A nice romance with a good dose of comedy and fun--just the sort of picture you wish Hollywood still made. Also, please note the performance of Murvyn Vye as \"Zoltan\". He was very magnetic in the short time he was on film and I just loved his deep and beautiful voice. Finally, a sad note to consider. While the film is set in Germany, no mention is made of the upcoming Gypsy Holocaust. During the war, throughout German territory, the Nazis exterminated a huge percentage of Gypsies and so the final nice ending to the film is a tad far-fetched.",
         "Marlene Dietrich play a Gypsy who helps British spy (Ray Milland) during World War II. They try to stop the Nazis from using poisonous gases for war use. They get romantically involved with each other while there on the mission. A nice entertaining movie to watch.",
         "I made my earthly debut on September 26, 1947 and according to my parents when they were alive, as an infant I had a particular liking for the song Golden Earrings that came from this film. It served as my best lullaby in those formative months. I wish it had come from a better film than the one it served as a title tune for. The film's story is told in flashback by Ray Milland to real life war correspondent Quentin Reynolds on a plane to Paris. Milland's got pierced ears which today would not raise a ripple, but back in 1947 was hardly in vogue, especially for a British brigadier. Back in 1939 Milland went on a mission to Germany just before war was declared to get a poison gas formula from a German scientist of liberal sympathies. But he and partner Bruce Lester get caught, but manage to escape and split up. Milland's route takes him to the Black Forest where gypsies are known to hang out and Hitler hasn't started rounding them up yet. They became targets for extermination as surely as Jews were later on. He runs into Marlene Dietrich and she teaches him a few survival tricks and a few tricks of another kind. With that kind of distraction, Milland can barely keep his mind on his mission. Golden Earrings gets very campy indeed, remarkable since Milland and Dietrich did not get along during the making. On that level it's enjoyable, as serious drama it falls real short as an espionage story. Murvyn Vye is the head gypsy and if Milland ain't got enough trouble with the Nazis, he's got to fight Vye to get Marlene and the help he needs from the clan. It'a all very silly. Vye was making his film debut and he introduces the song Golden Earrings. Vye had come from the Broadway stage where he played Jigger in the original Broadway production of Carousel. Paramount got it's number one star and biggest recording star in America at the time, Bing Crosby, to make a record of it. Bing's record sold well, but the big hit came from Peggy Lee. I'm surprised that Marlene didn't sing a full version in the film, it's just her kind of material. Could have definitely helped the film a lot.",
         "The film opens in a stuffy British men's club full of gents in leather chairs smoking cigars. This is Denistoun's world. A messenger delivers a small box to him which he opens to find a pair of gold earrings. The site of the earrings sets off a reminiscence about the time he spent in the company of gypsies. The rest of the film is flashback. Golden Earrings has been a long time favorite of mine and is probably the most romantic movie I know. Dietrich plays against her usual type. Here she's dark-haired, earthy and not in the least bit mysterious. Instead of a femme fatale, she'a tower of strength and energetically sets out to use all her resources to help Denistoun survive and reach his goal. To make sure that he's a really convincing gypsy, she pierces his ears and has him wear her dead lover's golden earrings. With his clothes and some grease, she transforms him from an effete British gentleman into a wild and sexy looking man. When I was growing up I used to hear the song \"Golden Earrings\" which is sung in the film. I think the tune is hummed a little by Dietrich. /There's a story the gypsies know is true /That when your love wears golden earrings /She belongs to you.",
         "This film is exceptional in that Marlene & Raymond present outstanding performances. The acting in this film is the greatest strength of the production, but the script, direction, and editing deserve applause. There is an extraordinary chemistry that exsists between the two stars. If you like Marlene, and you like Raymond, you'll love this film..... (It's a classic that compares with Casablanca.)",
         "Those reviewers who have complained that this movie lacks plausibility or has problems of construction are missing the point. This is a wonderfully camp romance, with plenty of Play, gypsies! Dance, gypsies! music, that both sends up exotic love stories and celebrates them. Buttoned-up Ray Milland makes an amusing foil for a Dietrich with black hair, tattered scarves, and tons of jewelry. The character's eagerness to feed Milland and look after him more closely resembles the good German hausfrau Dietrich was off the set than her mannered vamp roles. Censorship being in force, it's made clear that they share a caravan on platonic terms only, with Milland fighting off Dietrich's advances with a determination remarkable for a heterosexual bachelor who might be killed any day. His only excuse is that she smells, so perhaps a stuffy, fastidious Englishman might indeed be put off. In the small role of Milland's young companion on his secret mission, Bruce Lester adds a note of camp of a different kind. We are told at the beginning that he hero-worships Milland, and indeed he rather fawns on him. When, after they are separated, he meets Milland, now transformed into a brown-skinned gypsy with a shirt open to the waist, his glowing appreciation of the disguise even further suggests that not only Dietrich is romantically infatuated with Milland. Despite the wonderfully improbable characters and sequence of events, the growing love of Milland for Dietrich and his acceptance of the non-rational aspects of life is rather touching. And when, on their last night alone before he escapes, he says that each of them now contain half of the other, the two have become one, and then darkness falls, I think we can assume that the censor decided to give them a break! One goof--at the beginning, Milland, who is supposed to be English, refers to a lieutenant, using the American pronunciation. (The English say \"leftenant.\") Since Milland was British, he must have been saying it that way because the American movie-makers feared that American audiences would be distracted and confused by the British style.",
         "Golden Earrings (1947) A tough movie to love, but the best parts of it--or the best part, that is, known as Marlene Dietrich--make it easy to like. The actions scenes, the chitchat, even the opening scenes where men talk with bizarre astonishment a man's pierced ears, are often unconvincing. Even the core plot, looking for a key German scientist before it's too late, stumbles over its own clichés. And even worse, a key weakness is the lead male, the low key and unemphatic Ray Milland. Two years after the end of the war, when this film was made, there must have been a huge appetite for variations on stories about resisting the Nazis. This is a bizarre and highly unlikely one, not because Gypsies weren't involved behind the scenes in the action, but because the idea of a single gypsy woman taking in an Englishman who has to hide, for unexplained reasons, in Germany even though there is no war, is a stretch. (His mission is clear, but why an Englishman has to be undercover isn't historically clear to me.) But this is what we have, and Dietrich, who is German and began her acting in Germany but by this point was long part of Hollywood, plays a very fictional Gypsy. She is used a little like she was in the famous Josef von Sternberg movies, for her \"aura,\" which she had plenty of. Most of the movie follows a series of encounters and difficulties with arrogant Nazis and between themselves. Much of the filming is at night, which is dramatic, and there are scenes of Gypsy camps that are part of a long line in Hollywood films. There is also an interesting followup of sorts from Hitchcock's \"Notorious\" the previous year, in the use of two key German archetypes, Reinhold Schunzel and Ivan Triesault. This is focusing on the details, which is what you have to do. Or just pull back and see a lovely romance unfold.",
         "Marlene Dietrich plays an European Gypsy woman in Pre-World War II Europe. Ray Milland played the British officer Denistoun who is on a mission. Ray Milland and Marlene Dietrich are excellent, entertaining, and enjoyable in the film. The story is fine and could have used more work but the Milland's British gentleman turned Gypsy in order to escape the Nazis does a fantastic job. It's interesting to see a character like Denistoun to transform into a Gypsy. The ending is worth watching the film. The film doesn't address the Nazi war crimes. European Gypsies were also targeted and persecuted by the Nazis during World War II. Still, this film is entertaining to watch and suspenseful. The cast is first rate in the Hollywood studio system factory where films were made faster even with mediocre scripts. Still, this film is one of my favorites with Marlene Dietrich."
      ],
      "genres": [
         "Adventure",
         "Romance"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "On the eve of World War II (1939) English officer Ralph Denistoun is in Nazi Germany on an espionage mission to recover a poison gas formula from Prof. Krosigk. He is helped by Lydia and her band of gypsies. Naturally romance develops along the way.",
         "On a Paris bound airplane in 1945, Colonel Ralph Denistoun, of British Intelligence, is being interviewed by American correspondent Quentin Reynolds. His story begins in Germany in 1939, before war had been officially declared, but he and fellow agent Richard Byrd, stationed in Germany, are being held prisoner, incommunicado, because of their knowledge of a deadly poison gas formula perfected by Professor Krosigk for the Nazi war machine. Escaping, Denistoun and Byrd go separate ways, agreeing to meet later at a Freiburgn sign post on the road near Eschbach. Denistoun is making his way through the woods when he meets Lydia, a Hungarian gypsy girl, who offers to help him. She pierces his ears for dazzling golden earrings, stains his skin, dresses him in Zigeneur clothes and teaches him to read palms. His disguise if perfect and he emerges unharmed from several encounters with Nazi patrols. Byrd is killed by the Gestapo, leaving Denistoun on his own to contact Krosigk, a violent anti-Nazi, who gives the Britisher the secret of the poison gas. Aided by Lydia and Zoltan, the gypsy leader, Denistoun escapes from Germany across the Rhine to France, with a promise to return to Lydia after the war."
      ],
      "budget": 1000000
   },
   "movielensId": 925,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1947-08-27",
      "dvdReleaseDate": "2006-04-04",
      "directors": ["Mitchell Leisen"],
      "runtime": 95,
      "movieId": 925,
      "title": "Golden Earrings",
      "mpaa": "",
      "actors": [
         "Ray Milland",
         "Marlene Dietrich",
         "Murvyn Vye",
         "Bruce Lester",
         "Dennis Hoey",
         "Quentin Reynolds",
         "Reinhold Schünzel",
         "Ivan Triesault",
         "Hermine Sterler"
      ],
      "imdbMovieId": "0039428",
      "originalTitle": "Golden Earrings",
      "genres": [
         "Adventure",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A British colonel (Ray Milland) escapes from the Gestapo to the Black Forest and poses as a Gypsy's (Marlene Dietrich) mate.",
      "tmdbMovieId": 121357,
      "avgRating": 3.525,
      "releaseYear": "1947",
      "numRatings": 100,
      "posterPath": "/2gcfgwuRuX8PfGEI00THfT0U4yl.jpg"
   }
}