{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "half vampire",
            "id": 3630
         }
      ],
      "imdb_id": "tt0114825",
      "video": false,
      "title": "Vampire in Brooklyn",
      "recommendations": [
         8860,
         10411,
         11066,
         9713,
         6522,
         10824,
         11353,
         9405,
         16300,
         11595,
         12521,
         9644,
         8831,
         9625,
         9409,
         9292,
         10577,
         9091,
         17466,
         4954
      ],
      "backdrop_path": "/iPjz3w5J8BY56aZSnAhUQ72BavC.jpg",
      "revenue": 19800000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Maximillian | Pauly | Guido",
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcdf",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Detective Rita Veder",
               "gender": 1,
               "credit_id": "52fe44c19251416c7503fce3",
               "name": "Angela Bassett",
               "profile_path": "/tHkgSzhEuJKp5hqp0DZLad8HNZ9.jpg",
               "id": 9780,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Detective Justice",
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fce7",
               "name": "Allen Payne",
               "profile_path": "/xJtew7b2oZRZjIzocnBZgkVlWWt.jpg",
               "id": 32486,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Julius Jones",
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fceb",
               "name": "Kadeem Hardison",
               "profile_path": "/aCuoYn6GdVqZyy35JmqaY6TS9bO.jpg",
               "id": 66554,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Silas Green",
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcef",
               "name": "John Witherspoon",
               "profile_path": "/mlrxal9uTk2h6i0suarNOyYGiTN.jpg",
               "id": 56902,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Dr. Zeko",
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcf3",
               "name": "Zakes Mokae",
               "profile_path": "/sxzqrmSm7Kd7eSHzos7UeiT0mke.jpg",
               "id": 47458,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Capt. Dewey",
               "gender": 1,
               "credit_id": "55a10a00925141297d0014c3",
               "name": "Joanna Cassidy",
               "profile_path": "/p7CQ4EmGmtAaR3YWKRJTnmnRU8i.jpg",
               "id": 593,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Police Officer",
               "gender": 2,
               "credit_id": "562ff62ac3a3681b5200e109",
               "name": "W. Earl Brown",
               "profile_path": "/ygTJtQVn9R2NgE1YPybsgk33jBm.jpg",
               "id": 6951,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Nikki",
               "gender": 0,
               "credit_id": "562ff634c3a3681b5400e5e0",
               "name": "Simbi Khali",
               "profile_path": "/hOdj8WA4L6j4grdHti7hBTqRYDG.jpg",
               "id": 172200,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c09251416c7503fc9f",
               "name": "Wes Craven",
               "profile_path": "/vffssPtgNn2ZwoMfLCCDJAxlXGI.jpg",
               "id": 5140,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c19251416c7503fca5",
               "name": "Stuart M. Besser",
               "profile_path": null,
               "id": 28401,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcab",
               "name": "Mark Lipsky",
               "profile_path": null,
               "id": 56189,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44c19251416c7503fcb1",
               "name": "Marianne Maddalena",
               "profile_path": "/bBMwURi3NuQsK4pSMq6tU2RwRT9.jpg",
               "id": 35581,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcb7",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcbd",
               "name": "Charlie Murphy",
               "profile_path": "/emMzTjrwhrPr1m8gepw1bvqJb6A.jpg",
               "id": 17840,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcc3",
               "name": "Michael Lucker",
               "profile_path": null,
               "id": 71486,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c19251416c7503fcc9",
               "name": "Chris Parker",
               "profile_path": null,
               "id": 71487,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fccf",
               "name": "J. Peter Robinson",
               "profile_path": null,
               "id": 28156,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c19251416c7503fcd5",
               "name": "Mark Irwin",
               "profile_path": null,
               "id": 7413,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c19251416c7503fcdb",
               "name": "Patrick Lussier",
               "profile_path": "/xBZm3o2FtAH0RjEdmAau8OqkoZg.jpg",
               "id": 27226,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.631124,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12158,
      "vote_count": 142,
      "budget": 14000000,
      "overview": "Maximillian, the lone survivor of a race of vampires, comes to Brooklyn in search of a way to live past the next full moon. His ticket to survival is Rita, a NYPD detective who doesn't know she's half vampire -- and Maximillian will do whatever's necessary to put her under his spell.",
      "similar": [
         7131,
         138,
         6404,
         22440,
         36647,
         36648,
         6114,
         24021,
         49017,
         12437,
         277,
         18239,
         2907,
         628,
         755,
         52520,
         76492,
         50619,
         159824,
         123553
      ],
      "original_title": "Vampire in Brooklyn",
      "runtime": 100,
      "poster_path": "/bH1v8z12ZU7Y6zANgU1B00a86Co.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-10-26",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "A comic tale of horror and seduction.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Wes Craven"],
      "runtime": 100,
      "synopsis": "A ship of dead men steers into Brooklyn harbor. It keeps going until it runs aground. A large wolf jumps from the ship. The wolf is the vampire Maximilian [Eddie Murphy], the sole survivor of the massacre of a tribe of vampires living on an island in the Bermuda Triangle. Max has come to Brooklyn to find Rita Veder [Angela Bassett], the half-vampire daughter born to a human and a vampire from his tribe. Meanwhile, Julius Jones [Kadeem Hardison] isn't having a good night. First, there was that ship that ran aground and plowed right through the building where he and Silas Green [John Witherspoon] were working. Then his woman kicked him out of the house for snoring while otherwise engaged. Now, two thugs are after him for his money or his blood. Then, just as Julius is about to meet his maker, the vampire Maximilian shows up, neatly kills off the two thugs, and informs Julius that he is to become his renfield and that the first thing he must do is retrieve Max's coffin from the ship. Ship and dock are crawling with the law, one of whom is Detective Rita Veder. Rita and her partner Justice [Allen Payne] have been sent to investigate the accident in the harbor and the 18 bodies aboard that were found drained of blood. While checking out the ship, Rita falls through a rotten floorboard and lands in the cargohold where she finds a coffin and gets a glimpse of Max, who recognizes her immediately. Rita chases him, but he disappears. When she returns to the cargohold, the coffin is gone, a human ear remaining in its place. Max and Julius take the coffin to Julius's house, an apartment he rents from Silas. The ship's log is retrieved, but it is written in some obscure language that no one at the university can decipher, so it is sent to Dr Zeko for translation. Zeko's turns out to be a nightclub, but Zeko [Zakes Mokae] is able to tell that the log speaks about a nosferatu on board. As Rita sits at a table, waiting for Justice to return from a phone call, she doesn't notice that a cobra in a nearby terrarium has escaped and is crawling toward her. Fortunately, Max is seated nearby and catches the cobra just in time, giving Max the perfect opportunity to introduce himself to Rita. He asks her to dance, believing that one dance with him will make her his, but Justice returns and Julius butts in with his jive talk, so Rita splits, not at all enthralled with Max. Rita and Justice go back to the apartment Rita shares with roommate Nikki [Simbi Khali]. Nikki comes on to Justice but he turns her down and leaves. Instead, Nikki picks up Max and brings him home. Rita overhears the bumping and screaming in Nikki's bedroom. The next morning, Rita finds that Nikki has split with all her belongings, and there's a note saying that she's getting an apartment with a man she just met. Rita assumes it is Justice, and she becomes very jealous. Time is growing short. Max has to start using drastic measures, like taking on the personas of other people, such as Preacher Pauly and stupid Guido in order to get closer to Rita. But Max's plans seem to backfire, so he takes the direct route and saves her from being run over by a speeding taxi. In gratitude, Rita accepts a dinner date with him. Max hurries back to Julius's apartment and casts every spell he knows to change it from a pigsty to an elegant lovenest, complete with candelabras, fireplace, and a baby grand piano. He finally manages to get his dance with Rita as well as a bite on her neck. Julius is enjoying the benefits of working for a vampire, e.g., driving the black limo with vanity plates that say 'RIP'. He is also having to adjust to the side-effects, e.g., acquiring a taste for bugs and losing parts of his body. First his ear, then his right hand, then his hair, then an eye, then his whole right arm. Meanwhile, Justice is following up a lead that suggests Julius might have been involved in the killing of the two thugs a few nights ago. The next morning, Justice pays a visit to Julius's apartment where he meets Silas Green who tells him that Rita was there all night with the new tenant, some suave guy. Just then, Justice receives a call from the dispatcher sending him to investigate a DOA at Brooklyn City Hall. It turns out to be Nikki. Justice goes to Rita's apartment to tell her about Nikki. As he is holding her, Rita's tears turn into fangs and she tries to bite his neck. Out of the corner of her eye, she notices that her reflection in the mirror is fading. She runs to Max, who tells her of her father, the vampire. Justice goes to see Dr Zeko, who tells him the story of Rita's mother, a researcher who was studying the vampires on his island and who succumbed to the powers of the \"dark one.\" Rita is the result, he says. He warns Justice that he must kill Max and do it before Rita loses all of her humanity. Max attempts to teach Rita how to feed, but she refuses. When she tries to run away, Max retrieves her and brings her to his apartment, intending to leave for the island in the morning. He brings Silas to her, but Justice and Zeko arrive just in time to stop her from feeding on him. A fight breaks out, of course, but Max is easily able to dodge their fists and stakes. Justice searches out Max's coffin and opens it, prepared to stake him, but he finds Rita laying there. Rita begins to advance on Justice, her fangs showing. She stops long enough to share a kiss with Max and then stakes him, claiming that this part of her must die. Rita and Justice end up in each others' arms. Epiloque: Max is dead, and Julius doesn't have much left in the way of limbs, skin, arms, etc., but Silas reminds him that he does have the limo, and they decide to go for a ride. In the backseat, Julius finds a ring left behind by Max and places it on his finger. POOF! Julius has back all his parts (and then some). There's a new vampire in Brooklyn, and his name is Julius Jones. [Original Synopsis by bj_kuehl.]",
      "writers": [
         "Eddie Murphy",
         "Vernon Lynch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114825/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MTQ3NzE0MV5BMl5BanBnXkFtZTcwNDAwNzIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Eddie Murphy, Angela Bassett, Allen Payne | See full cast and crew »"],
      "reviews": [
         "Wes Craven directs LAST HOUSE ON THE LEFT, controversy ensues. Wes Craven directs THESE HILLS HAVE EYES and maims his audience. Wes Craven directs A NIGHTMARE ON ELM STREET and revitalizes a genre with a super-bad villain. Wes Craven directs THE SERPENT AND THE RAINBOW, hit. Wes Craven directs A VAMPIRE IN BROOKLYN? I don't know what to make of this one. It does have an interesting take on the vampire genre in a way that should have worked in the way he would spoof the horror genre in SCREAM, but where SCREAM had loads of in-jokes, references to other horror movies and a young cast of actors who were playing very self-conscious people who knew what to do and what not to do in a horror film, here the results just don't mix. Had he gotten a much more skilled team of writers who could come up with wicked pop-culture references to blaxploitation films (and why not make this an ultra-hip version of BLACULA?), had he nixed the fatalistic seriousness that comes through like leftovers from both BRAM STOKER'S Dracula and countless vampire films and turned this into an edgy satire a la FRIGHT NIGHT or something crazier like THE ROCKY HORROR PICTURE SHOW, maybe it would have fared better. Actually I stand corrected: it would have fared much better. But having Eddie Murphy play his role totally straight, having Angela Bassett who seems like she's in a whole other movie, and then having that totally ludicrous epilogue which seems straight out of the Friday franchise... I don't know where to make heads or tails from it. I just don't.",
         "In the 1980s, Eddie Murphy single-handedly recreated the Black Action hero, replacing the old murderous superstud of the 1970s with black characters who depended on their quick wits more than their big guns. That formula was quickly run dry, however, both by Murphy himself and the imitators he inspired. So, Eddie intelligently decided that he needed to recreate a forgotten genre of comedy, one which Peter Sellars had mastered in the 60s, and which only Murphy could do today: he would make movies in which he played multiple characters. The Genesis began with \"Coming to America\", in which Murphy played not only the lead role, but also all the inhabitants of a Harlem barbershop. The sequences were short, but Murphy was building the road to becoming the most brilliant character actor of our day. Soon followed the \"Nutty Professor\" movies, \"Bowfinger\", and his animated TV series, \"The PJ's.\" In all these Murphy played a multiplicity of roles, and played them all brilliantly (the Academy's disdain for streetwise comedies, and--well, lets just say it--their dismissal of black performers not playing slaves or pimps, are the only explanations possible for Murphy not owning an Oscar or two by now). With these projects, Eddie was not only playing different characters, but also honing a new Eddie Murphy genre: raunchy, but intelligent; gross, but heartfelt; hilariously over the top in the particulars of plot, but firmly rooted in emotional reality. He has created or has been involved with, some of the arguably best comedies of the 1990's and onward--and has been responsible for inarguably the best comic performances of the era. So, in this era, Eddie decided to push the envelope by mixing the new Eddie Genre with the Horror films he loved as a kid. The result, \"A Vampire in Brooklyn\", is unsettling to some because the lines between Eddie's wildly improvisational Black (or African American, if you insist) character comedy to straight vampire horror movie are so starkly drawn. There are very few instances where the comedy and horror overlap. This, I feel, is the brilliance of the film. There are no horror moments broken by a punchline or bad joke, and there are no comedy moments punctuated by some kind of sick horror gag (that has been done to death since John Landis' \"American Werewolf in London\". Now its being beated to death by \"Buffy the Vampire Slayer\"). The funny parts are funny and the scary parts are truly scary. And Murphy also gets to shine in multiple well-defined character parts as well, as the shape-shifting African Vampire assumes the physical identity of several of his victims. \"Vampire\" failed at the box office not because it was a bad film--its definitely is not. But because it was too unusual a film for the limited abilities of the studio's marketing department to sell. Those going expecting to see a comedy were disappointed it contained so much pure horror, and those going to see it based on the publicity that painted it as a horror film were dissapointed it contained so much hilarious Murphy style comedy. It dies because of false expectations. Eddie's other films contained quick changes in tone as well--the shifts between bathroom comedy and pathos in the Nutty Professor films is no less abrupt than those between horror and comedy in \"Vampire\". It's just that the choice of horror as the second element mixed with the comedy is a more daring and unusual one. Years from now, \"A Vampire in Brooklyn\" will be viewed as one of the highpoints of the second phase of the Eddie Murphy Genre.",
         "Ever since I was a kid, I've loved vampires. My mom had introduced me to that part of horror movies when I was very young and I always found the vampire to be the most interesting of all monsters. They are the only one's that could appear human, they lure you in making it seem normal, but then before you know it, they turn on you. They're the most terrifying monsters if you really think about it. So Wes Craven, one of the masters of horror, who brought us amazing scary movies like A Nightmare on Elm Street, The Last House on the Left, The Hills have Eyes and Scream tried to take on the vampire genre. Interestingly enough as a mixture of horror and comedy. Not something that is brand new as we see with Love at first Bite, Fearless Vampire Killers and Dracula: Dead and Loving it, but he seems to do an unbalanced job with Vampire in Brooklyn. An abandoned ship crashes into a dockyard in Brooklyn, New York, and the ship inspector, Silas, inspects it, finding it full of corpses. Elsewhere, Julius Jones, has a run-in with some Italian mobsters. Just as the two goons are about to kill Julius, Maximillian, a suave, mysterious vampire, intervenes and kills them. Soon after, Maximillian infects Julius with his vampiric blood, turning Julius into a decaying ghoul; he then explains that he has come to Brooklyn in search of the Dhampir daughter of a vampire from his native island in order to live beyond the night of the next full moon. Now he's in search of Rita, the woman he was meant to be with in Brooklyn, New York. The thing is, I still like this film despite it's flaws. I remember being obsessed with this movie when I was a kid. Growing up, I got the DVD, does it have it's problems? Yeah. Angela Bassett who is normally a great actress really overacts in this film to the point where her character becomes obnoxious. Eddie Murphy does a pretty decent job, he plays a number of characters as usual. Playing not only Maximillian, but the preacher and the crook. He seemed to have fun with the role and had a lot of charisma. I also thought the relationship and chemistry between Kadeem Hardison and John Witherspoon as Julius and Silas was not only great but absolutely hilarious. I couldn't catch my breath from laughing so much when Silas accidentally pulls Julius' arm off and Silas says \"Look at this! Now you the fugitive!\" and Julius keeps telling him to put it back on and how he needs his arm back. There are some genuine funny moments mainly between Julius and Silas. As for the scary, not so much; there are some good one's here and there, between Nikki's murder and Eddie Murphy's make up was pretty frightening. While it's a flawed film, I think it's still worth checking out over all, it's a good story that just needed a better cast and a little more thought. But I think you'll get a few good chuckles out of this film. 6/10",
         "The only person who can give a fair commentary on this film would be a vampire lover, such as myself. As much as I love to laugh and adore Eddie Murphy's comedic talent, the genre of Vampires is my ultimate favourite topic. Some may say that I'm even slightly obsessed... So when it comes to this film I will say that I was pleasantly surprised. Yes, it was a touch cheesy and yes it was funny, but why can't a vampire film make you laugh too? I approached this film with a lot of reservation because I really didn't think Eddie Murphy was vampire material. But Eddie pulled it off. Yes- I feel that he truly did. He had that hypnotic stare and seductive movement that would've paralyzed me too if I was in his presence then too. So I give this movie the thumbs up and not just for vampire lovers and not just for Eddie Murphy fans- this is quite an entertaining film.",
         "I watched this movie thinking it would be like other eddie murphy movies- lots of humor and fun. I was wrong BUT I wasn't dissapointed. I mean, for once I enjoyed a horror movie. Usually I shy away from horror movies because of their incredibly stupid and repetitive plots and characters. This one was different however. I don't really know what it was that made me like this movie, but I have to say that Eddie Murphy makes a good vampire. His version of a vampire is cool but SO totally evil.And his sidekick Kadeem Hardison(also seen in the movie Drive) is funny. In all a good movie. I guarantee that once you start watching this movie you'll be hooked and wont want to finish watching it until the end. 8/10",
         "i read through some of the negative reviews, and felt I had to add one for the positives. I am a fan of Eddie Murphy, and have noticed that many of his films have pretty poor ratings here on IMDB, including this one, which has a shockingly low rating. I thought the film had very funny moments, and Murphy had a good rapport with his Ghoul. Also, the plotline was pretty interesting. I thought it worked very well, and I hope that the IMDB rating will improve.",
         "Maximillian (Eddie Murphy) is the only survivor from a race of vampires on a Caribbean Island, and as a vampire, he must find a mate to keep the line from ending. Some have said this film is the worst for Murphy and for Wes Craven, with Murphy saying the wig he had to wear was a big part of the problem. Now, looking back almost twenty years later, the wig does not look bad, and this was far from rock bottom for Murphy. For Craven, it may not be his strongest film, but it may also not be his worst (\"Cursed\" is pretty bad). Seriously, this is not that bad of a film, even if the humor never hits exactly right.",
         "So just what type of film is this? I haven't a clue, the film seems to be unsure of this too, at moments we get some sheer comedy, while at other times we get a serious minded horror movie, however unlike most films such as IDLE HANDS & EVIL DEAD 2, where there was a perfect blend of comedy & horror, VAMPIRE IN BROOKLYN's mix does not always work, it's like watching two separate versions of this tale all at once, while the actors, direction & special effects make-up were good, the film falls into a mediocre fare. The story goes that Murphy's vampire character comes to Brooklyn to find a bride, tagging along is a slave that was once human who has been turned into a zombie by Max the vampire & in several humorous moments (Though gross too) parts of him falls off as he slowly decays & when Max the vampire thinks he's found his bride in the form of police officer ANGELA BASSETT, her partner tries to rescue her from Max's clutches as she is slowly falling under Max's spell. A major problem concerning this film was in it's pre-production, Murphy who was a fan of Wes horror films like SERPENT & THE RAINBOW, had hoped to work with the director on a film that him & his brother Charlie wrote, Craven accepted the assignment & was more than happy to work with Murphy, the problem was, was that Wes had hoped to leave the horror genre (Which he has tried to do unsuccessfully for a few years now) & do a comedy with Murphy, but Murphy had hoped to do a horror film with Wes Craven, & Paramount pictures was determined to get a comedy from Murphy, after several re-writes in which the writers tried to please the Paramount execs, Murphy fans & Craven fans both, we have wound up with this, that is not really for Murphy or Craven fans, it's just a major mess, Murphy tries hard to give his best performance but it doesn't help. Not a total loss, but nothing worthwhile either, I say skip it & check out some of Craven's & Murphy's other works instead, since they are so much better than this movie, which unwisely leaves the door open for a sequel. ** stars",
         "Vampire in Brooklyn starts as a large boat crashes into a Brooklyn dock, on-board the whole crew are discovered murdered. They were murdered by Maximillian (Eddie Murphy) a Vampire from the Caribbean who happens to be the last of his kind & needs to mate with another Vampire & the closet thing left is half Vampire half human NYPD cop Detective Rita Veder (Angela Bassett) who doesn't yet know she's half Vampire, Maximillian has to convince her she is a Vampire & then to mate with her otherwise the Vampire race will die out... Directed by Wes Craven this is a romantic comedy horror with an almost entirely black cast that doesn't really work in any respect. The script by Charles Murphy (Eddie's brother), Michael Lucker & Chris Parker quite simply is a laugh free zone, hell I didn't even crack a smile during this. The film starts off very horror orientated then it becomes very comedic before romance takes over, none of these genres particularly go well together & the film feels very uneven, I suppose it moves along at a fair pace & the basic story is alright but it's a bit of a chore to sit through as nothing on screen works that well & a constant stream of profanity is not funny on it's own, is a very lazy way to write & starts to become annoying. The scene when Murphy impersonates the preacher is just plain embarrassing & I hated the ending as well. Director Craven had never made a comedy before & it show's as the comedy scenes just don't work, the horror & gore scenes are far more effective & it's a shame there's not more of them. By the time Craven teamed up with Murphy to make this both needed a hit after their careers both hit slumps, Vampire in Brooklyn was a poor choice of film although the story does have a happy ending as Craven went on to make the mega hit teen horror slasher Scream (1996) & Murphy made the successful children's comedy The Nutty Professor (1996) as their next films respectively. Angela Bassett's stunt double Sonya Davis died went a stunt went wrong where she was supposed to fall from a building onto an airbag but she actually hit her head on the solid ground. There's some gore here, there's a ripped out heart, various dead bodies with slit throats, some blood drinking & a stake through the heart although the special make-up effects on Murphy at the end look terrible. With a supposed budget of about $14,000,000 this had a decent amount of cash thrown at it, I don't think it flopped at the box-office but it didn't do that well either. It's well made with decent production values. The acting isn't that great & surprisingly Murphy is the only one who plays it straight which is very odd, Bassett is forgettable & Kadeem Hardison as the comedy relief ghoul is terrible. Vampire in Brooklyn is a horror film that isn't scary, a comedy that isn't funny & it's got a black cast directed by a white man brought in for his name & as a whole it just doesn't work on any level. One to avoid.",
         "Contrary to IMDb grade of this movie and the many reviewers who appraised it as a low to mediocre movie piece i have only the highest praise for this movie. This is not a comedy but this is also not a horror movie.It is a mix of drama,horror and comedy. Eddie Murphys performance as a vampire was amazing and the special effects were awesome. This movie is definitely a classic and quite sure it is misunderstood by most. One of the best vampire movies ever made. 10 out of 10 Keep this treasure alive!"
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Romance"
      ],
      "productionCompanies": [
         "Eddie Murphy Productions",
         "Paramount Pictures"
      ],
      "summaries": ["Maximillian is the only survivor from a race of vampires on a Caribbean Island, and as a vampire, he must find a mate to keep the line from ending. He knows that a child had been born to a woman who had a vampire father, and he searches for her in Brooklyn. Rita's mother, who has died in an asylum, was that woman and Rita has nightmares that she does not understand. Not knowing that she is part vampire, Max woos her and attempts to bring her to her blood sucking destiny. Even though Rita has strange dreams and actions, Justice, her partner, has feelings for her and does not want her involved with this stranger Max. But it is Rita who must decide her destiny."],
      "budget": 20000000
   },
   "movielensId": 93,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-10-26",
      "dvdReleaseDate": "2002-01-29",
      "directors": ["Wes Craven"],
      "runtime": 100,
      "movieId": 93,
      "title": "Vampire in Brooklyn",
      "mpaa": "R",
      "actors": [
         "Eddie Murphy",
         "Angela Bassett",
         "Allen Payne",
         "Kadeem Hardison",
         "John Witherspoon",
         "Zakes Mokae",
         "Joanna Cassidy",
         "W. Earl Brown",
         "Simbi Khali"
      ],
      "imdbMovieId": "0114825",
      "originalTitle": "Vampire in Brooklyn",
      "genres": [
         "Comedy",
         "Horror",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "HBel3A1-f2c",
         "2qzFuLGeVGI"
      ],
      "plotSummary": "Maximillian, the lone survivor of a race of vampires, comes to Brooklyn in search of a way to live past the next full moon. His ticket to survival is Rita, a NYPD detective who doesn't know she's half vampire -- and Maximillian will do whatever's necessary to put her under his spell.",
      "tmdbMovieId": 12158,
      "avgRating": 2.51265,
      "releaseYear": "1995",
      "numRatings": 2174,
      "posterPath": "/bH1v8z12ZU7Y6zANgU1B00a86Co.jpg"
   }
}