{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "insane asylum",
            "id": 4924
         },
         {
            "name": "suspense",
            "id": 9937
         }
      ],
      "imdb_id": "tt0038109",
      "video": false,
      "title": "Spellbound",
      "recommendations": [
         303,
         940,
         223,
         11462,
         260,
         21734,
         11219,
         22527,
         574,
         31997,
         381,
         25670,
         13321,
         845,
         93,
         506,
         5780,
         30159,
         573,
         12684
      ],
      "backdrop_path": "/kEAyaTwGltnMKXLWN0bXG32HCl.jpg",
      "revenue": 7000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Dr. Constance Petersen",
               "gender": 1,
               "credit_id": "52fe43b0c3a36847f8067e77",
               "name": "Ingrid Bergman",
               "profile_path": "/jXEE0P6705JbMAJ2nwtHjmqkd5F.jpg",
               "id": 4111,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "John Ballantine",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e7b",
               "name": "Gregory Peck",
               "profile_path": "/ycs6o0UoohQ7nV7A6VWaTkoIkCQ.jpg",
               "id": 8487,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Dr. Alexander Brulov",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e7f",
               "name": "Michael Chekhov",
               "profile_path": "/8BlcUt1vKGGFBkDANlgWOVZ1ang.jpg",
               "id": 35193,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Mary Carmichael",
               "gender": 1,
               "credit_id": "52fe43b0c3a36847f8067e83",
               "name": "Rhonda Fleming",
               "profile_path": "/6yQSo2AWXePgW4mszL0ZUHpX28l.jpg",
               "id": 10160,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Dr. Murchison",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e87",
               "name": "Leo G. Carroll",
               "profile_path": "/xTxzUMrwj00ZXa3iWOqP5w1xgO5.jpg",
               "id": 2642,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Dr. Fleurot",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e8b",
               "name": "John Emery",
               "profile_path": "/44mz6m4k3x6Q7hLIlUgQ6aMCUMv.jpg",
               "id": 35194,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Mr. Garmes",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e8f",
               "name": "Norman Lloyd",
               "profile_path": "/90SbqN35suKnemwxYnEGiaIn7DR.jpg",
               "id": 2698,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "House detective",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e93",
               "name": "Bill Goodwin",
               "profile_path": "/zdbPN93HssJmpTEK7qC4rHyUnn2.jpg",
               "id": 34287,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Dr. Graff",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e97",
               "name": "Steven Geray",
               "profile_path": "/bYHgnE8wv3zXhMoZAAmZjNes7in.jpg",
               "id": 30847,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e9b",
               "name": "Donald Curtis",
               "profile_path": "/tW9pHQ3GlfLgbDup4Q70p0QPfoK.jpg",
               "id": 35847,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Det. Lt. Cooley",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e9f",
               "name": "Art Baker",
               "profile_path": null,
               "id": 35848,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Det. Sgt. Gillespie",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067ea3",
               "name": "Regis Toomey",
               "profile_path": "/wdcVhuLj0OzaEsgumhRcrMtbfq8.jpg",
               "id": 22093,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Dr. Hanish",
               "gender": 0,
               "credit_id": "52fe43b0c3a36847f8067ea7",
               "name": "Paul Harvey",
               "profile_path": "/xDk9GgK3ykYIiXeM5ybhoJUwlzg.jpg",
               "id": 34320,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Hotel masher",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067eab",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e55",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e5b",
               "name": "Ben Hecht",
               "profile_path": "/is5faYjaFObagG3b8xgwocMkUcX.jpg",
               "id": 4341,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e61",
               "name": "David O. Selznick",
               "profile_path": null,
               "id": 3248,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e67",
               "name": "Miklós Rózsa",
               "profile_path": "/1eAU1ckh7SUNMP9IZeii9qX5xa.jpg",
               "id": 7647,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e6d",
               "name": "James Basevi",
               "profile_path": null,
               "id": 2763,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067e73",
               "name": "George Barnes",
               "profile_path": "/rSN2fSx7HyorrMdBQ5IyIkskvYW.jpg",
               "id": 3356,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ab983c49251414d3d009434",
               "name": "Salvador Dalí",
               "profile_path": "/151bXN94CxxFQq1IDntXO8UOLX4.jpg",
               "id": 8988,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.620777,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 4174,
      "vote_count": 222,
      "budget": 1500000,
      "overview": "When Dr. Anthony Edwardes arrives at a Vermont mental hospital to replace the outgoing hospital director, Dr. Constance Peterson, a psychoanalyst, discovers Edwardes is actually an impostor. The man confesses that the real Dr. Edwardes is dead and fears he may have killed him, but cannot recall anything. Dr. Peterson, however is convinced his impostor is innocent of the man's murder, and joins him on a quest to unravel his amnesia through psychoanalysis.",
      "similar": [
         2502,
         1018,
         1903,
         77,
         949,
         189,
         207932,
         346685,
         336843,
         72570,
         654,
         1939,
         8834,
         10285,
         72784,
         9272,
         1923,
         11284,
         2163,
         9411
      ],
      "original_title": "Spellbound",
      "runtime": 111,
      "poster_path": "/pptQGmwPvOI49UYp5cMHo976y4d.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Selznick International Pictures",
         "id": 1553,
         "origin_country": ""
      }],
      "release_date": "1945-12-28",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "The maddest love that ever possessed a woman.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alfred Hitchcock"],
      "runtime": 111,
      "synopsis": "At the Green Manors mental hospital in Vermont the beautiful and brilliant young psychoanalyst Constance Peterson ( Ingrid Bergman) is known for being quite aloof from the romantic advances of her fellow doctors. She is only interested in her work. The head of the institution, the elderly Dr. Murchison ( Leo G. Carroll) is retiring, involuntarily. He had had an episode of nervous exhaustion from overwork, and the board had decided that this could happen again and he needed to retire. He is to be replaced by the renowned young Dr. Edwardes, who has published an acclaimed book about guilt complexes. Dr. Edwardes ( Gregory Peck) arrives. There is immediate magnetism between him and Dr. Peterson. But some disturbing developments occur. At dinner on the first evening, he has a bizarre and inappropriate outburst upon seeing Dr. Peterson draw the outline of a proposed swimming pool, using the tines of her fork, on a linen napkin. As the days go by, the friendship between Drs. Edwardes and Peterson grows closer. She goes to his room late one evening, and they declare their love for each other. But while they are embracing, he has another bizarre reaction upon seeing the parallel stripes on her white robe. Then he receives a phone call. One of the patients has become very agitated and tried to cut his throat; he is in surgery. Drs. Edwardes and Peterson go there. Dr. Edwardes has a serious panic attack in the operating room. He is taken to his own room. While Dr. Peterson is watching over him, she notices that his autograph in a copy of his book, which she has borrowed from the library, is very different from the signature on a note that he had written to her. This person is not Dr. Edwardes. When he wakes up, Dr. Peterson confronts him. He says that he does not know who he is. He killed the real Dr. Edwardes, and is taking his place. He has complete amnesia. His only connection to reality is that he has a cigarette case with the monogram \"J.B.\". She says that she trusts him completely, and will help him. The police will not come immediately, and she may be able to straighten out the mystery. He should sleep, and she will report in the morning that he is too ill for work. But during the night, he writes her a letter saying that he can't involve her in this, because he loves her. He is going to the Empire State Hotel in New York. He slips the note under her door and disappears. The next morning, the police have arrived. They were tipped off by the real Dr. Edwardes' secretary, saying that when she had telephoned him at Green Manors, she didn't recognize his voice. They show his photograph to the staff, and they all agree that that isn't the \"Dr. Edwardes\" that they know. \"Dr. Edwardes\" is of course missing. They go to see Dr. Peterson in her room. She says that she left Dr. Edwardes in his own room, and that he was too agitated to say anything sensible. She also notices the letter on the floor near her door, but is too frightened to pick it up while the others are present. The police and other staff members leave. Dr. Murchison is the last to leave, and, seeing the letter on the floor, picks it up and politely hands it to Dr. Peterson. She reads it after the others have left. The next day she goes to the hotel in New York. After managing to find out his room number by recognizing his handwriting on the hotel registration cards (he registered as \"John Brown\"), she goes to his room and talks to him. She wants to use her psychoanalytic expertise to cure him of his amnesia and guilt complex. He believes that he must have killed Dr. Edwardes, taken his identity, and come to Green Manors. But she is absolutely convinced of his innocence. She notices that his left hand has been burned. He relives some kind of accident that he must have been in, but can't remember any more details. She asks him an abstruse medical question, and determines from his accurate answer that he must have been some kind of doctor. But when they find out that her name and picture are in the newspaper, they have to make a quick exit from the hotel. They go to Grand Central Station to take a train somewhere. At the station, Constance tells J.B. to free-associate when he gets to the head of the ticket line, and when the clerk ask for the destination, say the first thing that comes to his mind. He requests two tickets to Rome. Constance explains that he means Rome, Georgia. After they get their tickets, Constance realizes that a policeman saw them, and will recognize them soon, so they can't go to Georgia. They instead take a different train to Rochester, New York, home of Dr. Alex Brulov ( Michael Chekhov), who was Dr. Peterson's teacher, analyst, and mentor. On the train trip, J.B. recalls that he was in the Army Medical Corps, flying over Rome, Italy, and his plane was shot down. He was burned at that time. When they arrive, Dr. Brulov is not in, but two men are present. It turns out that they are policemen, wanting to know what Dr. Brulov knows about Dr. Edwardes. Dr. Edwardes disappeared on a trip in the Cumberland Mountains with a patient of his. The elderly Dr. Brulov arrives. He is a stereotypical (complete with a beard and a German accent) old-school Freudian. He is not friendly to the policemen, and tells them that he disliked Dr. Edwardes. \"What kind of an analyst is it, who wants to cure psychosis by taking people skating? Or to a bowling alley?\" After the police leave, Constance announces that she is married, and introduces her husband John Brown. Dr. Brulov is delighted for her, though he says, in his strict old-school way \"Women make the best psychoanalysts, until they fall in love. After that, they make the best patients.\" He offers to put them up in his spare bedroom, and bids them goodnight with \"Happy dreams, which we will analyze at breakfast.\" In the bedroom, J.B. is concerned that, while they got past the police, Dr. Brulov might suspect something. Constance assures him that Alex is actually not very savvy in social situations. (She is wrong.) J.B. has another anxiety attack while looking at the bedspread, which is white with textured embroidery in parallel lines. Dr. Peterson realizes that parallel lines on a white background seem to be what sets off these attacks. Medical ethics, not to mention 1945 movie studio sensibilities, require that J.B. sleep on the sofa while Constance takes the bed. During the night, J.B. wakes up, realizes that he is seriously in need of a shave, and goes into the bathroom. While mixing the shaving soap, he has another episode, set off by the white color of the soap, the sink, and the bathtub. He goes downstairs, in a trance-like state, still holding a straight razor. Dr. Brulov is downstairs, having awakened in the night and gone to do some work. He offers J.B. a glass of milk. He has noticed the razor, and he secretly puts a large dose of bromide in J.B.'s milk. In the morning, Dr. Peterson comes downstairs, wondering whether J.B. has left. Dr. Brulov points to him, sleeping on the sofa. Alex and Constance then exchange sharp words. Dr. Brulov tells Constance that he knows that J.B. is quite possibly a murderer. \"The moment I see you with a husband, whose pupils are enlarged, who has a tremor of the left hand, who is on a honeymoon with no baggage, and who's name is John Brown, I know practically what is going on.\" He is going to call the police. Dr. Peterson tells him that she knows he must be innocent, because \"I couldn't feel this way toward a man who is bad.\" She couldn't love him if he were guilty. Dr. Brulov then mocks her mercilessly. \"You are twenty times crazier than him. 'She couldn't love him if he were no good.' This is baby talk.\" \"We both know that the mind of a woman in love is operating on the lowest level of the intellect.\" She finally persuades him to help her cure him, and hold off for a few days on calling the police. Dr. Brulov awakens J.B. and begins some rather stern therapy. J.B. has had a dream. Dr. Brulov tells him that dreams contain a window into whatever the person is trying to hide, but they are in terms of puzzle pieces that are all mixed up. What follows is the famous \"dream sequence\", designed by the renowned abstract impressionist artist Salvador Dali. The dream is full of fantastical images and psychoanalytic symbolism. J.B. is in a gambling casino, surrounded by drapes with eyes painted on them. The other patrons have blank faces. He deals the seven of clubs to a man with a beard, who says that he has 21 and has won. But the opponent's other cards are blank. Then the proprietor comes over and accuses the bearded man of cheating. He says \"This is my place, and if I catch you cheating again, I'll fix you.\" In the next scene, the man with the beard is leaning over the sloping edge of a high building. J.B. yells at him to watch out, but he falls over the edge. Then the proprietor appears from behind a chimney, holding a wheel. He drops the wheel. In the next scene, J.B. is running down a slope, with a large winged creature overhead. After relating the dream, J.B. begins to have another episode. Drs. Brulov and Peterson realize that he saw the view out the window, where children are sledding in the snow, leaving parallel tracks. They realize that the phobia must have arisen from seeing ski tracks, and that he must have been skiing with Dr. Edwardes. J.B. begins to recall the ski trip. Thanks to the clue of the \"angel wings\", they piece together that the place was called Gabriel Valley. Constance convinces J.B., against much resistance, that he was traumatized by something from his childhood, and that they must go to Gabriel Valley and unlock that secret and figure out what happened to Dr. Edwardes. They go skiing, with much apprehension on the part of J.B. There is a dangerous precipice at the bottom of the hill. J.B. recalls it at the last instant, and also recalls a brief incident from his childhood. He was sliding down an outdoor banister, and accidentally knocked his brother off, causing him to be fatally impaled on a fence. He stops himself and Constance just in time. \"I didn't kill my brother. It was an accident.\" His memory has returned. Back at the ski lodge, he recalls that his name is John Ballantyne. He went to Columbia Medical School, was injured in the war, and was discharged and treated for nervous shock by Dr. Edwardes. They had gone skiing, and Dr. Edwardes, who was ahead of J.B., went over the edge to his death. He also remembered that, prior to the ski trip, he had had lunch with Dr. Edwardes at some club in New York. But the police have followed them to Gabriel Valley. They found the body of Dr. Edwardes, but there was a bullet in him. J.B. is taken away, convicted of murder, and sent to prison. Dr. Peterson goes back to Green Manors. Dr. Brulov visits her and offers his heartfelt sympathy for her loss. After he leaves, Dr. Murchison, who is back as head of the institution, also offers his sympathy. During their conversation, Dr. Murchison lets slip that he knew Dr. Edwardes slightly. The words reverberate in Dr. Peterson's mind. If he knew Dr. Edwardes, he would have known instantly that he was an impostor when he arrived at Green Manors. She reaches a devastating conclusion, and confronts Dr. Murchison about it. She discusses John Ballantyne's dream. The casino symbolized both Green Manors and the restaurant in New York where John had dined with Dr. Edwardes. The eyes on the walls were the staff of Green Manors. The card suit, and the number 21, indicated that the restaurant was the Twenty-One Club. The bearded man playing cards with J.B. was Dr. Edwardes. The man threatening him was Dr. Murchison himself. Then the most devastating symbol: The \"wheel\" that he was holding was a revolver. Dr. Murchison hid behind a tree, shot Dr. Edwardes, and dropped the gun. The police will be able to trace Dr. Murchison to the Twenty-One Club and Gabriel Valley, and will find the gun, with Dr. Murchison's fingerprints. Dr. Murchison then reveals that they won't find the gun there, because it is in his desk. He pulls it out and threatens to kill Dr. Peterson. She slowly walks away. He does not kill her, and, after she has left the room, turns the gun around and kills himself. The blast from the gun is in bright red, the only instant in the movie that isn't in black-and-white. In the final scene, Constance and John are boarding a train for their honeymoon, and Alex Brulov is wishing them well.",
      "writers": [
         "Ben Hecht",
         "Frances Beeding"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038109/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2NDI5Nzg5Nl5BMl5BanBnXkFtZTcwNDk3NzI0NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ingrid Bergman, Gregory Peck, Michael Chekhov | See full cast and crew »"],
      "reviews": [
         "While I wouldn't include 'Spellbound' in my top five favourite Alfred Hitchcock movies it's still wonderfully entertaining. Of course it had dated badly in some ways, but not enough to spoil a modern viewer's enjoyment. Psychoanalysis was still quite a cinematic novelty at the time, but this means that we have to put up with an awkward opening sequence, complete with \"explanations\" on the screen, and a few pretty hokey moments throughout, but hey, I can live with that, and the amateurish filmed skiing scene. These few flaws, quite a rarity for Hitchcock, are still small potatoes. The legendary Salvador Dali designed dream sequence allegedly used very little of the great surrealists outlandish ideas, but even so it's striking and memorable. I also really enjoyed the inventive score by Miklos Rozsa, which utilized the eerie sound of the theremin, later used in the science fiction classic 'The Day The Earth Stood Still', and The Beach Boys psychedelic pop masterpiece 'Good Vibrations'. Now the best thing about 'Spellbound' and what really makes it into a wonderfully entertaining mystery/romance is Ingrid Bergman and Gregory Peck. These two Golden Age superstars are both absolutely wonderful individually, but together they are magical, and one of THE great romantic couples in movie history. 'Spellbound' may not be Hitchcock's very best work, but I still highly recommended it. I can't see how anyone could not enjoy it.",
         "\"Spellbound\" is one of Hitchcock's hardest films to evaluate, because its plot and credibility are so heavily dependent on theories of psychoanalysis that are usually considered to be implausible, at the very best. But if you can accept, for the sake of entertainment, the more dubious plot devices, what remains is a fine film dominated by the great director's usual creativity and technical mastery. Although it's hard to get away from the implausibilities, it's a fine movie in all other respects. Gregory Peck stars as an amnesia case, and Ingrid Bergman as a psychoanalyst trying to unravel his mysterious - and possibly murderous - past. Most of the other characters are also psychoanalysts or patients, and the plot revolves around the ways that Bergman's character uses Freudian theories to solve the mystery. Whether you can enjoy the story depends on how willing you are to suspend disbelief concerning the wilder aspects of these theories, but if you are willing to do so, it's quite nicely done in most parts, with some fine scenes and a couple of good plot twists. It is also worth watching for the famous Salvador Dali dream sequence, which is very creatively done and fascinating to watch. Peck and Bergman also create interesting and sympathetic characters, who make the viewer want to know what will happen to them. Overall, this is a distinctive film, and well worth seeing for any Hitchcock fan.",
         "Could this one be the most underrated of all Hitchcock's American movies/What?only 7.6?And however,you've got plenty of movies for the price of one!Come on ,wake up,and give this triumph its due! 1.It's a mystery movie:Peck suffers from amnesia,he may or may not be a criminal,only snatches of memory come back and he can't put them together.Some clues appear,the \"lines\" vision is the most famous. 2.It's a movie full of suspense;great scenes:the letter which Bergman tries to hide,the news papers at the railway station. 3.It's a chase movie:Bergman and Peck escape from the nursing home and search a shrink's colleague help. 4.It's a dreamlike movie:not only for the Dali's -too often unfairly dismissed-dream.Actually, the whole story is wrapped in a supernatural,eerie atmosphere. 5.It's a romantic story:the scenes outside the nursing home in country landscapes are wonderfully and lovingly filmed. 6.It's a movie of redemption:Bergman falls in love with her patient,and she's got to struggle -thanks Mister Freud- to help Peck to recover his full memory. 7.It's a technically astounding movie,as in every Hitch movie:it features the shortest color scene (it's a black and white movie)in cinema.And I won't tell you when it appears,watch out. 8.It's a movie from the Master of suspense,and I trade you \"a lapse of memory\",\"shattered\" and \"the third day \" for \"Spellbound\"!It deserves to be in the top 250!",
         "Alfred Hitchcock weaves his spell binding magic into this Francis Beeding novel. In some opinions, this is Hitchcock's best project from the 40's. Powerful stars and a great story line keeps your interest until the final shot. An amnesia patient(Gregory Peck)is believed to be a psychotic killer. Bits and pieces of his memory about a childhood accident makes him believe that he is a murderer. Ingrid Bergman plays a young psychiatrist, who helps Peck unravel his past and regain his memory and mental health. During this process, the lovely doctor tries not to fall in love with her needy patient. She takes him to her old professor(Michael Chekhov) for help. He is reluctant to get involved with solving the mystery to clear the patient's name. Brilliant camera work and being filmed in black & white really helped the story line. There is an eye opening dream sequence designed by Salvador Dali that is down right mystic. The strong and talented cast also includes: Regis Toomey, Leo G. Carroll and Rhonda Fleming. This film is worth the time to watch again and again.",
         "I recently saw this film on the large screen after having not seen it for over 10 years. My memories of it were not that fond -- I recalled it as an unusually melodramatic and not very convincing thriller enlivened by a very attractive cast. What I had forgotten about was how almost impossibly silly all the psychoanalytical claptrap is, especially in the first couple of reels, which thereby make us feel very quickly that we're not quite in the mature, masterful grip of Hitch's usual wit and taste. Yes, I know this was made in the 40's, but the first 20 to 30 minutes of the film have more sexist moments and infantile behavior by supposed doctors than one would ever expect from either Hitch or Ben Hecht. So who's to blame? One guess -- David O. Selznick! That being said (along with the fact that the story doesn't really add up to much of anything, since all the premises on which it's based seem so shaky, naive and downright goofy), the film has some things going for it. About midway through the picture, when Michael Chekhov appears as Dr. Brulov, the film suddenly kicks into what we might call \"classic British Hitch mode,\" with the kind of understated wit and ensemble playing the director had been doing so well since the early 30's. It almost becomes another (and far more palatable) film at this point. The scenes with Bergman, Peck and Chekhov are the highlight of the film, and I have to admit that I'm even kind of fond of the hotel lobby scene, with the appealingly breezy Bill Goodwin (of \"Burns and Allen\" radio fame) as the house detective. Peck has never been more handsome, in a strangely fragile way. Also worth a look are the brief but truly unusual Dali-designed dream sequences. There is something to be said for Miklos Rozsa's score as well: although it edges a bit far into soupy overscoring, the expressive main theme has quality, and his use of the theremin (which he also employed in his score for THE LOST WEEKEND at virtually the same time) is striking and represented \"something new\" in film music. One could easily make excuses for this film based on \"it was only 1945\" or \"what people knew about psychoanalysis was still naive\", etc., but even taken in context of its time it's a pretty silly film without the kind of sustained surety of style leavened with simultaneous suspense, intelligence, taste and humor that he had already proved he could do so well from more than ten years earlier. Given a standard he had already given us with examples from THE 39 STEPS or YOUNG AND INNOCENT through THE LADY VANISHES in the UK, or FOREIGN CORRESPONDENT and SHADOW OF A DOUBT here in the US, this film seems not up to his true capacities, and like his other Selznick-produced American film, REBECCA, seems both overfussy and filled with emphases and spoonfeeding of details which Hitch himself would never have given us. You need only compare this film with his very next one, NOTORIOUS, to be painfully aware how much better Hitchcock on his own -- using his own standards of pace, momentum and the ADULT treatment of script themes -- could be when not under the thumb of Selznick. Thank God he didn't have to work for him any more after this.",
         "A world in which Freudian psycho-analysis works as it's supposed to is rather like a world in which magic works - so call this film a fantasy. There's nothing whatever wrong with fantasy. Indeed, there's nothing better. Hitchcock announces at the very beginning that the story takes place in a Freudian world; thereafter he plays perfectly fair with us. He even chose the right collaborators for a fantasy. The dream sequences were designed by Salvador Dali. (Anyone whose dreams really do look like Dali paintings maybe COULD do with some psycho-analysis.) They're not frightening - dream sequences rarely are - but they are at any rate more interesting than the usual dreams we might have or hear about. The music was by Miklós Rózsa, maybe the best of the composers who settled in Hollywood, certainly the most vividly overpowering. He was exactly the right choice for this film - however much Hitchcock disliked the score, or said that he did. The story follows a confused Gregory Peck, who cannot remember key episodes of his recent (and not so recent) past, and who may, just possibly, be a dangerous criminal. Ingrid Bergman is a second-generation disciple of Freud who despite her professional caution finds herself falling in love with him. Perhaps it sounds cardboard already, but the performances invest the characters with more life than my descriptions did. Peck in particular is highly sympathetic. He comes across as not at all mad, not even mentally disturbed - just a man who can't remember one or two things and has an odd aversion to things like parallel lines. (That?s right - parallel lines.) Anyway, as I said, it's a fantasy: the forces of psychoanalysis must unravel the mystery before it's too late. (Why there's a \"too late\" is too complicated to go into.) The usual kind of Hitchcock suspense isn't there but the man WAS capable of moving outside his home genre now and then. Remember, his other fantasy was \"The Birds\".",
         "If Hitchcock dealt with psychological themes in 'Shadow of a Doubt' and 'Suspicion', with 'Spellbound' he was facing the affairs of the mind\u0085 Most of his film took place in a mental asylum, where the Swedish star was the best-looking doctor you have ever seen\u0085 Cool, seductive, and attractive in front of Hitchcock's eyes\u0085 When Gregory Peck arrived as the new head doctor, she fell in love with him; but soon his staring eyes, his long pauses and the heavy shadows surrounding him led her, like us, to suspect that he was not 'Dr. Anthony Edwards' at all, but was really a mental case himself who had assumed the identity of the doctor\u0085 In that case, what had happened to the real doctor? Gregory Peck could not say, because he was suffering from amnesia and could not remember his past\u0085 While we begin to wonder, he became convinced that he was a murderer and took fight, sought by the police\u0085 Convinced of his innocence \u0096 but needing to persuade her patient to prove it \u0096 Ingrid Bergman caught up with Peck and took him for shelter to a psychoanalyst who tried to solve the truth in his dreams\u0085 'Spellbound' is a harmless and suspenseful piece of cinema\u0085 Hitchcock touches were splendid, and the stars shined magically\u0085 The psychiatric window-dressing was impressive, and surrealist artist Salvador Dali was hired to paint the dream sequences... This was not, incidentally, Salvador Dali's introduction to the cinema: in 1929 he had collaborated in writing 'Un Chien Andalou' with the man whose cinematic imagination has always flowered in the gardens of the unconscious mind: Luis Buñuel. Rhonda Fleming made her film debut here, and Norman Lloyd, last seen as he fell from the Statue of Liberty in 'Saboteur', made a brief appearance as a patient\u0085",
         "This is one of my favorite movies, despite what I must reluctantly admit is a preposterous plot. But what a great cast -- Gregory Peck, the beautiful Ingrid Bergman, and various familiar character actors. Wallace Ford has an entertaining scene as an obnoxious hotel guest trying to pick up Ingrid Bergman, but who gets chased off twice by the house detective. Even though the plot elements are often unbelievable, it doesn't matter, as far as I'm concerned; the pacing is just right, the script is literate, and the dramatic tension sustains the viewer's interest to the end. And for my money, this movie contains one of the most, if not THE most, romantic scenes ever put on film: Gregory Peck and Ingrid Bergman, having met only a day or two before, admit to each other that they've fallen in love. He walks slowly toward her and she lifts her face to him and closes her eyes. The scene dissolves to a series of lovely doors opening slowly down a hall, to the accompaniment of Miklos Rosza's incomparably beautiful \"Spellbound Theme\". Now THAT'S romantic! I highly recommend \"Spellbound\" to any classic movie fan.",
         "The head of the famous Green Manors mental asylum is being replaced by a younger psychiatrist, Dr Edwards. When Edwards arrives he falls for Dr Petersen and she for him. However, after exhibiting some very strange reactions, Edwards is exposed as a fraud - an amnesiac who has deep issues and may or may not have killed the real Edwards prior to taking up his job. Blinded by her love for him, Petersen flees the police with him and protects him as she tries to uncover the truth locked deep within his mind. As someone who watches way too many films for my own good I probably should have seen Spellbound many years ago. Making up for lost time I watched it recently unsure of even the basic plot. I was surprised by the twist (which I guess for 99% of those watching this, won't be a twist) that Edwards was not who he claimed (thought) to be. The psychoanalysis against the clock scenario was a bit too tidy, but it does work well. I'm not a big believer of this world of therapy so some of the scenes stuck in my throat but it was proof of Hitchcock's ability that he managed to make them tense. The example that came to my mind was the film Blackjack by John Woo in which Dolph Lungren is scared of the colour white! In that movie I was almost in fits of laughter when Lungren is stopped in his tracks by the bad guys spilling lots of milk everywhere! Here there was no such reaction to Edwards' similar fear. The director really manages to bring out tension and paranoia in every scene \u0096 there was nary a moment where I wasn't involved in the film, it was hard to know whether Edwards was a killer, a nut or what! Some of the imagry is a little obvious (doors opening) but most is good and the Dali dream sequences are pretty cool. Of course part of this is down to Peck playing just perfect. Some of his bug eyed reactions to lines etc would have been comical had he not been able to follow through, but he did. It is to his credit that I was kept guessing as to his intentions right through the film. Bergman is also good but has to carry lines such as `I believe him because I could never feel this way for a man with badness in him' (I'm paraphrasing), the romantic side of the film is harder to carry but she does it well. Support is good, but Leo G Carroll looks very young indeed and took me by surprise when I saw him! Overall I enjoyed this film even though there was so much that could have been a mess. It is to Hitchcock's credit that he cranks the tension up well and never lets it get silly (as it could easily have been in lesser hands). Some of it is a little too easy (isn't this deep seated stuff meant to take years rather than days?) but this aside it moves swiftly along and is a very interesting way to make a thriller.",
         "In Green Manors mental institution, Dr. Constance Petersen (Ingrid Bergman) is initiating her career of psychoanalyst and is considered a cold woman that has no time for love by her colleagues. When the head of the hospital Dr. Murchison (Leo G. Carroll) is forced to retire by the board after a breakdown, his replacement is the successful Dr. Anthony Edwardes (Gregory Peck) that is so young that surprises the other doctors in his arrival. Constance and Edwardes immediately fall in love for each other, but in a couple of days later it is disclosed that the man that supposes to be Dr. Edwardes in indeed an impostor that seems to be a paranoid amnesiac with guilty complex that might have killed the famous psychoanalyst. He goes away from Green Manors to the Empire State Hotel in New York and leaves a message to Dr. Constance that decides to find him. She sneaks and travels to New York, where she meets him lodged with the identity of John Brown. Dr. Constance decides to heal him recovering his memory and discover the fate of the true Dr. Anthony Edwardes. \"Spellbound\" is far from being among my favorite Hitchcock's movies, but there is at least one unforgettable moment in this suspenseful but dull romance: the sequence of John Ballantine's dream based on designs of Salvador Dali. Ingrid Bergman performs a psychoanalyst vulnerable in many moments and with unacceptable attitudes, like for example, prioritizing to open her correspondence that giving attention to her mentally ill patient Mr. Garmes or her juvenile rapture with Gregory Peck's character. My vote is seven. Title (Brazil): \"Spellbound \u0096 Quando Fala o Coração\" (\"Spellbound \u0096 When the Heart Speaks\")"
      ],
      "genres": [
         "Film-Noir",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Selznick International Pictures",
         "Vanguard Films"
      ],
      "summaries": [
         "The head of the Green Manors mental asylum Dr. Murchison is retiring to be replaced by Dr. Edwardes, a famous psychiatrist. Edwardes arrives and is immediately attracted to the beautiful but cold Dr. Constance Petersen. However, it soon becomes apparent that Dr. Edwardes is in fact a paranoid amnesiac impostor. He goes on the run with Constance who tries to help his condition and solve the mystery of what happened to the real Dr. Edwardes.",
         "A psychiatrist protects the identity of an amnesia patient accused of murder while attempting to recover his memory."
      ],
      "budget": 1696377
   },
   "movielensId": 931,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1945-12-28",
      "dvdReleaseDate": "2002-09-24",
      "directors": ["Alfred Hitchcock"],
      "runtime": 111,
      "movieId": 931,
      "title": "Spellbound",
      "mpaa": "NR",
      "actors": [
         "Ingrid Bergman",
         "Gregory Peck",
         "Michael Chekhov",
         "Rhonda Fleming",
         "Leo G. Carroll",
         "John Emery",
         "Norman Lloyd",
         "Bill Goodwin",
         "Steven Geray",
         "Donald Curtis",
         "Art Baker",
         "Regis Toomey",
         "Paul Harvey",
         "Wallace Ford"
      ],
      "imdbMovieId": "0038109",
      "originalTitle": "Spellbound",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Dr. Anthony Edwardes arrives at a Vermont mental hospital to replace the outgoing hospital director, Dr. Constance Peterson, a psychoanalyst, discovers Edwardes is actually an impostor. The man confesses that the real Dr. Edwardes is dead and fears he may have killed him, but cannot recall anything. Dr. Peterson, however is convinced his impostor is innocent of the man's murder, and joins him on a quest to unravel his amnesia through psychoanalysis.",
      "tmdbMovieId": 4174,
      "avgRating": 3.8945,
      "releaseYear": "1945",
      "numRatings": 2526,
      "posterPath": "/pptQGmwPvOI49UYp5cMHo976y4d.jpg"
   }
}