{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "falsely accused",
            "id": 769
         },
         {
            "name": "villa",
            "id": 885
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "age difference",
            "id": 965
         },
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "expensive restaurant",
            "id": 996
         },
         {
            "name": "nice",
            "id": 1861
         },
         {
            "name": "southern france",
            "id": 2335
         },
         {
            "name": "masked ball",
            "id": 2404
         },
         {
            "name": "roof",
            "id": 2405
         },
         {
            "name": "picnic",
            "id": 2406
         },
         {
            "name": "fireworks",
            "id": 2407
         },
         {
            "name": "côte d'azur",
            "id": 2408
         },
         {
            "name": "jewelry",
            "id": 6099
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "blonde woman",
            "id": 155658
         },
         {
            "name": "cat burglar",
            "id": 156082
         },
         {
            "name": "riviera",
            "id": 188344
         }
      ],
      "imdb_id": "tt0048728",
      "video": false,
      "title": "To Catch a Thief",
      "recommendations": [
         574,
         11462,
         506,
         4174,
         521,
         303,
         11219,
         22527,
         21734,
         573,
         5780,
         845,
         4808,
         260,
         940,
         1580,
         223,
         213,
         25670,
         1939
      ],
      "backdrop_path": "/7Cg4jbFDfmwXqw9Adp2RMntUAFz.jpg",
      "revenue": 8750000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 19,
               "character": "John Robie",
               "gender": 2,
               "credit_id": "52fe423dc3a36847f800e9db",
               "name": "Cary Grant",
               "profile_path": "/psdytm6BKzKd4vEd5TLUdm3rOmc.jpg",
               "id": 2638,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Frances Stevens",
               "gender": 1,
               "credit_id": "52fe423cc3a36847f800e989",
               "name": "Grace Kelly",
               "profile_path": "/2dNjXRNbhOmovybmr5iCdAhqdwl.jpg",
               "id": 4070,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Jessie Stevens",
               "gender": 1,
               "credit_id": "52fe423cc3a36847f800e999",
               "name": "Jessie Royce Landis",
               "profile_path": "/o7NngdQPrvEfN3m3UVcjVPwC3Co.jpg",
               "id": 2640,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "H. H. Hughson",
               "gender": 2,
               "credit_id": "52fe423cc3a36847f800e99d",
               "name": "John Williams",
               "profile_path": "/jNLOYVbdkHWGLk6xrFZIPpdE8c3.jpg",
               "id": 5182,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Bertani",
               "gender": 2,
               "credit_id": "52fe423cc3a36847f800e9a1",
               "name": "Charles Vanel",
               "profile_path": "/n2QkGhxuFmGoDyzGUHxdKQfMQX2.jpg",
               "id": 2566,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Danielle Foussard",
               "gender": 1,
               "credit_id": "52fe423cc3a36847f800e9a5",
               "name": "Brigitte Auber",
               "profile_path": "/yopJUGz9G5bbJKMRQnC6R27SXtc.jpg",
               "id": 5183,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Foussard",
               "gender": 2,
               "credit_id": "52fe423dc3a36847f800e9b5",
               "name": "Jean Martinelli",
               "profile_path": "/aem2faLcsdEsnO59Om3y8OciAgu.jpg",
               "id": 5185,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Germaine",
               "gender": 0,
               "credit_id": "52fe423dc3a36847f800e9b9",
               "name": "Georgette Anys",
               "profile_path": "/sfrenrCZsCMz0CGeIein5LlabTU.jpg",
               "id": 5186,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Commissaire Lepic (uncredited)",
               "gender": 2,
               "credit_id": "59b2ef27925141078a0a8e39",
               "name": "René Blancard",
               "profile_path": "/vh1px6ibfidqLZackcu9dSb91jV.jpg",
               "id": 553626,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Big Man in Kitchen (uncredited)",
               "gender": 0,
               "credit_id": "59b2ee41c3a3681fcc04df0a",
               "name": "William 'Wee Willie' Davis",
               "profile_path": "/9HInquXPMUy4olPoh0VbLH0nrkr.jpg",
               "id": 96140,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Masquerade Party Guest (uncredited)",
               "gender": 1,
               "credit_id": "52fe423dc3a36847f800e9df",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Man Sitting Next to John Robie on Bus (uncredited)",
               "gender": 2,
               "credit_id": "5512926cc3a3686195001195",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Detective (uncredited)",
               "gender": 2,
               "credit_id": "59b2eff3c3a3682c2209e031",
               "name": "Charles Sherlock",
               "profile_path": "/9grMCbCJKbfyLgFQK6XqkWOhZ12.jpg",
               "id": 385470,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe423cc3a36847f800e985",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe423cc3a36847f800e98f",
               "name": "David Dodge",
               "profile_path": null,
               "id": 5180,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe423cc3a36847f800e995",
               "name": "John Michael Hayes",
               "profile_path": null,
               "id": 5181,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe423cc3a36847f800e9ab",
               "name": "Lyn Murray",
               "profile_path": null,
               "id": 5184,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe423cc3a36847f800e9b1",
               "name": "Robert Burks",
               "profile_path": "/2FnhbhSQzCnMYsXzFptozlTlnFK.jpg",
               "id": 2654,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe423dc3a36847f800e9bf",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe423dc3a36847f800e9c5",
               "name": "George Tomasini",
               "profile_path": "/AkhUuJi4uCqh60ZQe39ZPxULFoV.jpg",
               "id": 2655,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe423dc3a36847f800e9cb",
               "name": "J. McMillan Johnson",
               "profile_path": null,
               "id": 5187,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe423dc3a36847f800e9d1",
               "name": "Hal Pereira",
               "profile_path": null,
               "id": 5188,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "52fe423dc3a36847f800e9d7",
               "name": "Edith Head",
               "profile_path": "/63ZeXQOh26sGa8nTbYWntieyWrz.jpg",
               "id": 4350,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.421631,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 381,
      "vote_count": 394,
      "budget": 2500000,
      "overview": "To prevent being accused of the crimes, an ex-burglar must catch a thief who’s been copying his style.",
      "similar": [
         1586,
         1939,
         521,
         9769,
         638,
         9631,
         17494,
         2252,
         4771,
         9798,
         189,
         1949,
         75780,
         402,
         275,
         281,
         164,
         949,
         336843,
         3597
      ],
      "original_title": "To Catch a Thief",
      "runtime": 106,
      "poster_path": "/wizxvCHhWTpJXxRew6FGPGFWTVl.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1955-08-03",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "WANTED by the police in all the luxury-spots of Europe!... A catch for any woman!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alfred Hitchcock"],
      "runtime": 106,
      "synopsis": "\"The Cat\" is John Robie ( Cary Grant). Now a respectable and well-to-do grower of grapes and flowers on the French Riviera, before World War II he was a jewel thief -- a cat burglar -- who was imprisoned but granted parole so he could fight the Germans. Someone is using the Cat's M.O. to steal jewelry again, and the police think Robie must be involved. When they visit his handsome stone villa to take him in for questioning, he gives them the slip with help from his housekeeper Germaine ( Georgette Anys), who leads the cops on a car chase while Robie catches the bus. He drops in on his old gang from the French Resistance, a group of ex-cons whose war work, like Robie's own, led to grants of parole that depend on keeping their noses clean. Restaurant manager Bertani ( Charles Vanel), wine steward Foussard ( Jean Martinelli), and the others are all under a cloud while the Cat is at large, and they blame Robie. Still, when the police arrive at Bertani's restaurant, Foussard's teenaged daughter Danielle ( Brigitte Auber), who has apparently enjoyed flirting with Robie in the past, spirits him across the bay in a motorboat to the safety of a Cannes beach club. Robie enlists the aid of an insurance man of Bertani's acquaintance, H.H. Hughson ( John Williams) of Lloyds of London, in order to prove his innocence. Robie's plan is to catch the new cat burglar in the act. To do this, he obtains a list of the most expensive jewels on the Riviera from the reluctant Hughson. The first name on the list is Jessie Stevens ( Jessie Royce Landis), who is traveling with her daughter Francie ( Grace Kelly). Robie strikes up an acquaintance with them -- one met with delight by Jessie, a pretense of modesty by Francie, and claws-baring jealousy from Danielle. Francie is not afraid of a little fun. Although she sees through Robie's cover as an American industrialist, the considerable charms of this thief are worth catching. She dangles before him her jewels, teases him with steamy tales of rooftop escapades, exposes herself as a feline of a special breed: an accomplice who might share his passion. Fireworks fill the night and can even be seen in the sky. That night, Jessie's jewels are stolen, and Francie suddenly feels that Robie has taken advantage of her. He narrowly evades the clutches of the police and goes back on the lam. He stakes out a house where he believes the new burglar will strike and is violently attacked. In the ensuing struggle he kills the attacker. It's Foussard, Bertani's wine steward. The police chief is satisfied that Foussard was the jewel thief, but, as Robie points out to him in the presence of the abashed Hughson, this would have been impossible: Foussard had a prosthetic leg and couldn't possibly climb on rooftops. After Robie is ejected from Foussard's funeral, Francie apologizes and confesses her love for him. They agree to attend a masquerade ball the coming weekend. At the ball, Francie is resplendent in a gold gown in the style worn at the court of Louis XV, Robie unrecognizable behind the mask of her attendant, a Moor. The police hover nearby, hoping to arrest Robie. When Jessie asks the Moor to go get her \"heart pills,\" Robie's voice tips off the authorities to his identity. After he returns, Francie and the Moor dance the night away while the police wait them out. But upstairs the cat burglar strikes, cleaning out many a jewelry box. Finally, Francie and the Moor go to her room, and the mask is removed: the Moor is Hughson, switched in to conceal Robie's exit. Meanwhile, Robie waits and watches on the roof. His patience is rewarded when another figure in black appears. But just as his pursuit begins, the police throw a spotlight on him. Again he flees and shots ring out, but he manages to corner his foe with jewels in hand. Unmasked, his nemesis turns out not to be a man after all. Danielle is the new Cat, and she confesses that she's been working for her father and Bertani to frame Robie for the latest thefts. Danielle tries to get away but slips and nearly falls, until Robie has a change of heart and saves her from falling off the roof to a certain death and turns her over to the police. In the final scene, Robie speeds back to his vineyards, and Francie races after to convince him that he needs a woman around to help. He agrees but seems less than thrilled about including her mother.",
      "writers": [
         "John Michael Hayes",
         "David Dodge"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048728/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4MTkxODI5MF5BMl5BanBnXkFtZTgwNjM2OTQ3MTE@._V1._CR399,132,2606,4029_SX214_AL_.jpg",
      "actors": ["Stars: Cary Grant, Grace Kelly, Jessie Royce Landis | See full cast and crew »"],
      "reviews": [
         "A bit of a departure for Alfred Hitchcock, somewhat lighter and with less of the trademark suspense. Thoroughly enjoyable, though. Cary Grant was playing Cary Grant by this time, and no one could do it better. And Grace Kelly, what eye-candy! The snappy dialog with the sexual innuendo was done perfectly. And huge kudos to Brigitte Auber, who was gorgeous and very good. An interesting aside was that Grant's character, while pretending to be someone else, claimed to have been an American circus acrobat, which Grant sort of was early in life (albeit English, not American.) Grant (with his accent) could really never be mistaken for an American, even though he usually played one. Also it was a little eerie to see Grace Kelly driving so fast on those French Riviera cliffside roads, in light of what happened to her later. (Of course, she obviously wasn't doing so, they were using back-projection) Anyway, this film is a must for fans of Hitchcock, Kelly or Grant. Grade: A",
         "This film, \"disappointing\"? Who is that reviewer kidding? No female would ever say that. This film is escapism at its finest, and what, pray tell, is wrong with escapism in this ever-more-dreary and stressful world? I don't CARE that this isn't a serious acting effort on Cary Grant's behalf; I don't CARE that the plot is telescoped. What I DO care about is the fantasy of it all: the beauty of the two stars, their clothing, the surroundings, the sets, and the way this movie just takes a (female) viewer away to a place and time that she will never have experienced but would love to experience: the South of France in the '50s; healthy, witty people with unlimited funds; sunshine, flowers, villas; amusing intrigue involving stolen jewels; the sparkle of the Mediterranean. And that gaspingly gorgeous costume ball! Wow! Please. This is a frothy and fabulous dreamscape like no other. After a very stressful day, to lie down with a glass of chilled champagne and watch Cary Grant and Grace Kelly cavort on the French Riviera is the most sublime thing one could do. I know more than a few females who honestly could not have withstood their lives without the escape this film provides. Thank you Mr. Hitchcock! You have performed a great, great service!",
         "This is probably Hitchcock's most beautiful movie. Grace Kelly is well (but of course decorously) displayed in delicate and perfectly fitted summer dresses and evening gowns (designed by Edith Head) that show off her exquisite arms and shoulders while accentuating her elegant neck and jaw line--and, as she turns for the camera, the graceful line of her back. Opposite her is one of Hollywood's most dashing leading men, the incomparable Cary Grant. The cinematography by long-time Hitchcock collaborator Robert Burks was shot on location in the French Riviera. The style is daylight clear and sparkling, bright as the dream of a princess to be, always focused without a hint of darkness anywhere. Even the scenes shot at night on the rooftops seem to glow. The houses on the hills overlooking Princess Grace's future home and the narrow cobble stone roads with the low-lying stone walls suggest a refined and elegant lifestyle to come. Even though she drives too fast, one is not worried that she might crash... Cary Grant is John Robie who fought with the French resistance during WWII and then became a jewel thief, dubbed \"The Cat\" for his ability to slink quietly in the night over roof tops and to steal into the bedrooms of the rich and take their jewels without waking them. As the movie opens he is retired from his life of crime and living comfortably in a villa in the hills above Nice. The complications begin immediately as the police arrive at his villa to question him about some recent cat-like jewel robberies. Robie is innocent of course (we are led to believe) and to prove his innocence he is motivated to find the real thief. Grace Kelly plays Frances Stevens, the slightly naughty nouveau riche daughter of the widow of a Texas-style oil millionaire. She is used to having men fall all over themselves trying to court her, but Robie seems uninterested, and this excites her fancy and she goes after him. It is interesting to note that by this time Cary Grant (51 when the film was released) had become such a heart throb that directors liked to have the women (who were always noticeably younger; Kelly was 26) chase after him. Audrey Hepburn does as much in Charade (1963). One notes that here, as in Charade, the women kiss Cary Grant first, not the other way around. Here it is nicely done as the previously demure Frances takes a surprising initiative at the door of her hotel suite. The story itself is rather bland and predictable, reminding me of a James Bond flick from, say, the sixties as though toned down for an audience of old maids. Notable in supporting roles are Brigitte Auber as the athletic Danielle Foussard, John Williams as the British insurance agent, and Jessie Royce Landis as Frances Stevens' mother. Hitch makes his de rigueur appearance as a passenger on the mini-bus that Robie takes to get away from the gendarmes early in the film. See this for Grace Kelly whose cool and playful demeanor and statuesque beauty form the heart of this somewhat languid romantic thriller. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "Cary Grant, former resistance hero and gentlemanly cat burglar, is now retired from the trade. But there's someone out there who's using all his old cat burglar tricks and putting him in one big jackpot. Imitation may be the sincerest form of flattery, but Cary ain't flattered. With the French Surete and the English insurance company breathing down his neck, he'd better find out who the culprit is and fast. He's got one ally, John Williams of the insurance company who has a sense it ain't really Cary. He's also got to contend with spoiled rich girl Grace Kelly who's taken a fancy to him. How much help she is is a dubious proposition. Unlike a lot of Alfred Hitchcock films this one doesn't have all that much mystery to it. In fact early on you should be able to figure out who's stealing Cary's tricks. But the color photography which won an Oscar of the French Riviera is breathtaking and Cary Grant and Grace Kelly play the whole thing with such style that you really don't care. My favorite in the film is Jessie Royce Landis who is Kelly's mother. She's rich, but remembers when she was poor. She takes to Cary and sticks with him when Grace has doubts and gives her quite a lecture on men. She knows her subject well. Sadly life imitated art in this one. Grace Kelly met her future husband Prince Rainier on the set and on the road where she takes Cary Grant for a speeding car ride is the same one she had the automobile accident that took her life a generation later. But don't dwell on the morbid here. Appreciate To Catch A Thief for the fine entertainment it is.",
         "With the magnificent setting of the French Riviera, \"To Catch a Thief\" is beautiful to look at. Alfred Hitchcock, the absolute master of suspense, appears to be having a lot of fun with this playful account of the rich and famous in their playground. The film is greatly enhanced by the magnificent photography of Robert Burke whose camera does wonders to show us that beautiful part of France. The film begins with a teasing sequence where one sees a black cat running wildly on the roofs of villas, and later on, hysterical ladies are seen screaming when they realize they have been burglarized. The police links John Robie to the robberies since it appears it's his own modus operandi. In order to fool the authorities that are following him, John boards a bus full of ordinary people bringing things to the market and we catch a glimpse of Hitchcock himself, sitting in the back of the bus, next to John. This is the amazing opening for this film, which shows a lighter Hitchcock, out for a good time. We then meet the rich Stevens, mother and daughter, who are vacationing at the posh Carlton Hotel in Cannes. The insurance agent, Hughson, introduces Robie to them. Hughson wants the Stevens women to be careful with their jewelry; at least, have them keep their gems in the hotel's safe, which they will not hear of. This seems to be an excuse for bringing together John and Frances, a beautiful and elegant woman who makes a point to show how much she hates having even a conversation with Robie, who will display all his charm and ultimately win her over. The best asset in the film is the elegant and ravishing Grace Kelly, at the height of her beauty. Ms. Kelly was one of the most beautiful women ever to grace the screen. In a way, it seems almost as though this film was prophetic in what would happen in her life. First, becoming the fairy tale princess of Monaco, and later on, to die in the same highway one sees her racing her car. Ms. Kelly, dressed by the incomparable Edith Head shows an innate elegance and a great flair to carry clothes in such a wonderful manner. Cary Grant, as John Robie, was at his best portraying the debonair former jewelry thief, a man with a past that had not committed a robbery for many years now, but whose fame preceded him everywhere. Mr. Grant and Ms. Kelly make a great romantic couple whenever we see them. Mr. Hitchcock got a lot out of these two actors and in the process, gives his fan something to care for. John Williams is excellent as the insurance agent trying to protect his clients. Mr. Williams was a superb actor who almost seems not to be acting at all. The same can be said for the chic Jessie Royce Landis, who always showed she was a smart and elegant actress. While this is a film so different from most of his other films, Mr. Hitchcock shows a great affinity for comedy in it. This proved to be a pause in his distinguished career to amuse his public. How well he succeeded!",
         "The best thing about this film is the chemistry between leads Grant and Kelly. Grant is as debonair as usual and Kelly was never more glamorous. The costumes she wears are very flattering to her and she is to the clothes. The dialogue between them sparkles throughout and is a pleasure to watch even if the course of their relationship is predictable. Grant's self-deprecating in-jokes are another nice touch. Further pleasantly adding to the fantasy ambience is the spectacular photography of the French riviera. John Williams is also great as the insurance investigator, the type of character he played in Hitchcock's Dial M for Murder (also with Kelly) and in the Doris Day-Rex Harrison film, Midnight Lace. This film is not one of the most psychologically involving in Hitchcock's pantheon but it is not designed to be. It is enjoyed best as what it was produced to be: glossy high production value escapist fare. 8/10.",
         "We are taken by Alfred Hitchcock to the French Riviera where a series of robberies are occurring, and women screaming that their precious jewels are stolen... A black cat - in each robbery - is roaming stealthily in fear and shame along the roof of the elegant Carlton.. From there, Hitchcock introduces us to John Robie (Cary Grant), a retired jewel burglar known as the 'Cat' who is living in peaceful isolation in Cannes... Robie is seen upset, bothered,, and worried because the 'Cat' prowls again... But, who is the 'Cat'? Surely someone is imitating his old style, using his ability and skill, almost his cleverness and talent... Naturally, the police in Cannes is blaming him... They had his hallmark stamped and classified... They would like to catch him in the act and finish with him in jail... Robie is worried how to catch the real thief being himself subject to harass! The characteristic plot of Hitchcock: To chase and to be chased at the same time... John Williams (H.H. Hughson) whose Insurance Company has been victim of great robberies, gives Robie what he wants: A list of their wealthy clients whom might be future candidates on the list of the skillful thief... Here we discover a future victim, the rich Mrs. Stevens (Jessica Royce Landis) and her cool, beautiful and sensual daughter Frances (Grace Kelly). Four scenes, depicted by the master of suspense, catch our attention: - The classic fireworks shot when Frances and Robies expressed their passion joining their lips in a torrid kiss, igniting the fuse of a chain of explosions in sensation colors and in VistaVision... - The annoyance of Hitchcock towards eggs: Mrs. Stevens, in her hotel's room, extinguishing her cigarette in the yolk of the fried egg... - The Gala night: An extravagant festival of precious stones (diamond, emerald, ruby and gold) displayed in all its beauty and rarity on the neck of women dressed in multicolored and multifarious costumes... Also a close-up for clear identification of the police and gendarme who are ready to capture, to hit, to surprise the famous thief... - The climactic classic roof-top chase sequence between Roby and the thief seen before in \"Saboteur,\" and much later in \"Vertigo,\" and \"North By Northwest.\" With meticulous coiffure and fancy clothes, Grace Kelly plays her role with elegance and fashion... She is gracefully refined and polite showing good taste and style... In the French Riviera she meets her future husband Prince Rainier of Monaco... After finishing the filming of \"The Swan,\" and \"High Society,\" she becomes Princess Grace... The film captures the aerial shooting of the automobile chases on the Riviera Corniche, the Cote D'Azur, the flower market, the grandeur of the rugged coastal scenery, the sea with much sunshine sparkling flashes of wit and gaiety... It is a pleasant entertainment, a 'Hitchcock Champagne' indeed! Grace Kelly\u0097contributing with our ideal romantic hero in catching his thief, was in fact scheming to catch him...",
         "Like most of Hitchcock this is a film that withstands repeated viewings. A light crime farce it is nevertheless full of great Hitchcock touches- a particular favorite of mine is the chase through the flower market with Cary Grant's comic encounter with the old flower seller. Grace Kelly was perhaps the sexiest of all movie stars in that she could combine the glamor of a Katherine Hepburn or Elizabeth Taylor with the earthy sexiness of Marilyn Monroe. Witness her first surprise kiss with Cary Grant and his reaction. This is priceless acting and one of the reasons Grant is considered one of the greatest actors in movie history. John Williams is also excellent as the very British insurance agent and Jesse Royce Landis (who played Grant's mother in North by Northwest ) is also on hand for a number of fine moments. Although slim in terms of drama this has to rank among the top ten of Hitch's films.",
         "There is much to like about Hitchcock's TO CATCH A THIEF: Cary Grant and Grace Kelly at the height of their appeal, a witty script that offers Jessie Royce Landis one of the funniest roles ever seen in any Hitchcock film, and excellent cinematography designed to show off the beauties of Monte Carlo--all packaged in a lightweight tale that is two parts romance, two parts travelogue, one part comedy, and just enough classic Hitchcock suspense to keep this lighter-than-air confection from flying apart. The well known story concerns a string of jewel robberies along the Riviera which lead local officials to suspect that a famous and long retired cat burglar (Grant) is once more on the prowl--but rather than hope the authorities will find the real culprit Grant elects to protect himself by unmasking the thief for himself. In the process he encounters an icy beauty (Kelly) who takes considerable pleasure in tantalizing him with her charms, her jewels, and her knowledge of his criminal past, and her mother (Landis), who is perhaps the best of the \"clever matrons\" to appear in any Hitchcock film. As the police close in, the three of them devise a plot to expose the thief and clear Grant, with whom Kelly has now fallen in love. Unlike most Hitchcock's most famous films, TO CATCH A THIEF offers nothing dark to trouble our thoughts, and it is perhaps best regarded as a romantic fantasia, the director's vacation from his more typical material. While it will never compete with the more famous VERTIGO and REAR WINDOW of the same period, it is extremely well done and quite a bit of fun to watch. Viewers seeking a pleasant film with a romantic touch will enjoy it a great deal. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "You cannot discuss any Hitchcock movie without first giving a nod to the master. Let me ask you this: Was Michelangelo a painter or a sculptor? It is a trick answer of course.. both answers are correct but it is more correct that Michelangelo was an artist. In a similar way you might consider the relationship between the body of Hitchcock's work and \"To Catch a Thief\". TCaT (To Catch a Thief) is not a classic Hitchcock suspense thriller. It is, however quite a nice piece of work. In fact, the most suspenseful thing about this picture is whether Cary Grant will get together with Grace Kelley. The relationship between these two is really the bulk of the movie. It is beautifully photographed and what better subjects for photography than Grace Kelly and the South of France? \"Notorius Cat Burgular meets Wealthy American Heiress\" is a plot that only Hitchcock and few others could make into a picture that would hold up for nearly 50 years. The playful exchanges between Grant and Kelly, rife with sexual innuendo, propell the movie forward to its happy conclusion. For me, the \"slice of life\" of French Rivera in the 1950s is enough to make this film eminently watchable. I recommend it highly. Great date movie... though living up to Grant's or Kelly's high marks might be difficult."
      ],
      "genres": [
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "American expatriate John Robie living in high style on the Riviera is a retired cat burglar. He must find out who a copy cat is to keep a new wave of jewel thefts from being pinned on him. High on list of prime victims is Jessie Stevens, in Europe to help daughter Frances find a suitable husband. Lloyds of London insurance agent is using a thief to catch a thief. Take an especially close look at scene where Robie gets Jessie's attention, dropping an expensive casino chip down decolletage of French roulette player.",
         "When the jewelries of millionaires are stolen in French Riviera, the former burglar and member of the French resistance John Robie \"The Cat\" is the prime suspect of the police. John convinces the Lloyds of London insurance agent H.H. Hughson that a copycat is committing the burglaries and he offers to chase the thief to prove his innocence, requesting a list of possible victims in the spot. He befriends the wealthy American widow Jessie Stevens that is in the list and her spoiled daughter Frances Stevens falls in love for him. When Jessie's jewelries are robbed, Frances blames John, but her mother believes in his innocence and decides to help the retired burglar to catch the real thief.",
         "A series of ingenious jewelry robberies takes place on the French Riviera. The police suspect John Robbie - an expert thief who was known as \"The Cat\" before he retired from crime. Robbie enlists the help of an insurance man to guess where the real thief will strike next. He befriends wealthy widow Jessie Stevens and her attractive daughter Frances.",
         "John Robie is a one-time cat burglar, now reformed and living a blameless life in a plush villa. When a fresh set of burglaries rocks the Riviera all bearing the hallmark of Robie's own robberies, he is the natural suspect. Robie sets out to catch the new burglar himself, mainly to prove his innocence. He is aided by an American heiress, who initially is convinced that he is actually guilty. The title of the movie is derived from the proverb \"Set a thief to catch a thief\"",
         "When a reformed jewel thief is suspected of returning to his former occupation, he must ferret out the real thief in order to prove his innocence."
      ],
      "budget": 2500000
   },
   "movielensId": 933,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1955-08-03",
      "dvdReleaseDate": "2002-11-05",
      "directors": ["Alfred Hitchcock"],
      "runtime": 106,
      "movieId": 933,
      "title": "To Catch a Thief",
      "mpaa": "PG",
      "actors": [
         "Cary Grant",
         "Grace Kelly",
         "Jessie Royce Landis",
         "John Williams",
         "Charles Vanel",
         "Brigitte Auber",
         "Jean Martinelli",
         "Georgette Anys",
         "René Blancard",
         "William 'Wee Willie' Davis",
         "Bess Flowers",
         "Alfred Hitchcock",
         "Charles Sherlock"
      ],
      "imdbMovieId": "0048728",
      "originalTitle": "To Catch a Thief",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "K6JVaUHS0Ow",
         "2DHMYYszsgo",
         "YIc5SDKEC6g"
      ],
      "plotSummary": "To prevent being accused of the crimes, an ex-burglar must catch a thief who’s been copying his style.",
      "tmdbMovieId": 381,
      "avgRating": 3.99869,
      "releaseYear": "1955",
      "numRatings": 5350,
      "posterPath": "/wizxvCHhWTpJXxRew6FGPGFWTVl.jpg"
   }
}