{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "playboy",
            "id": 9639
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt0050658",
      "video": false,
      "title": "Love in the Afternoon",
      "recommendations": [
         5767,
         12530,
         61650,
         20139,
         27029,
         64310,
         29376,
         39871,
         4173,
         3001,
         51367,
         38531,
         22829,
         48369,
         143770,
         189578,
         212185,
         40826,
         95307,
         194272
      ],
      "backdrop_path": "/fGpEzrnFCC24S21p5CqRlZtilDL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Frank Flannagan",
               "gender": 2,
               "credit_id": "52fe47729251416c75099ad3",
               "name": "Gary Cooper",
               "profile_path": "/zVUK71x5IoBaJ5H9dTgE2CRmLKy.jpg",
               "id": 4068,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ariane Chavasse / Thin Girl",
               "gender": 1,
               "credit_id": "52fe47729251416c75099ad7",
               "name": "Audrey Hepburn",
               "profile_path": "/lNmmbyKxwnMSe0vb4kzZroa8lzr.jpg",
               "id": 1932,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Claude Chavasse",
               "gender": 2,
               "credit_id": "52fe47729251416c75099adb",
               "name": "Maurice Chevalier",
               "profile_path": "/3j483xgtPAplIX4CLcvsAP56Tg5.jpg",
               "id": 112972,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Monsieur X",
               "gender": 2,
               "credit_id": "52fe47729251416c75099adf",
               "name": "John McGiver",
               "profile_path": "/4SPN4He1egZ60aIMNuh7tArx21x.jpg",
               "id": 1943,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Michel",
               "gender": 2,
               "credit_id": "52fe47729251416c75099ae3",
               "name": "Van Doude",
               "profile_path": "/noGWxo0GIKm7zT4knGvdQDC1YPv.jpg",
               "id": 3833,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Madame X",
               "gender": 1,
               "credit_id": "52fe47729251416c75099ae7",
               "name": "Lise Bourdin",
               "profile_path": "/yW9ddTJyODZ7L4aZ3yrlyMTWgP5.jpg",
               "id": 278685,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Hotel Guest with Dog",
               "gender": 1,
               "credit_id": "52fe47729251416c75099aeb",
               "name": "Olga Valéry",
               "profile_path": "/pwfvyFYzp4vqtVwD576nXDB2GZO.jpg",
               "id": 27896,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "le réceptionniste du Ritz",
               "gender": 0,
               "credit_id": "52fe47729251416c75099aef",
               "name": "Jean Ozenne",
               "profile_path": "/hOM0tGSmZvooUpNVdAZjRU5YUip.jpg",
               "id": 37137,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "le commissaire de police",
               "gender": 2,
               "credit_id": "52fe47729251416c75099af3",
               "name": "Paul Bonifas",
               "profile_path": "/1nwh4DDwzHVqu8h46XzeX5hGgYW.jpg",
               "id": 41716,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "le boucher",
               "gender": 2,
               "credit_id": "52fe47729251416c75099af7",
               "name": "Moustache",
               "profile_path": "/qUgGUx6NYvLJg284Q5Y03tWZY2Y.jpg",
               "id": 38912,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47729251416c75099ac9",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47729251416c75099acf",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47729251416c75099afd",
               "name": "Alexandre Trauner",
               "profile_path": null,
               "id": 4103,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe47729251416c75099b03",
               "name": "William C. Mellor",
               "profile_path": null,
               "id": 18744,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47729251416c75099b09",
               "name": "Jay A. Morley Jr.",
               "profile_path": null,
               "id": 936639,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47729251416c75099b0f",
               "name": "Hubert de Givenchy",
               "profile_path": "/nZz8FUtmLdxAi5ynevm76HJBlRC.jpg",
               "id": 1045774,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.653472,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18299,
      "vote_count": 67,
      "budget": 0,
      "overview": "Lovestruck conservatory student Ariane pretends to be just as much a cosmopolitan lover as the worldly mature Frank Flannagan hoping that l’amour will take hold.",
      "similar": [
         24420,
         1259,
         1903,
         38,
         1628,
         1643,
         316021,
         13523,
         1024,
         19913,
         862,
         539,
         979,
         13,
         88,
         627,
         1213,
         46705,
         50546,
         225886
      ],
      "original_title": "Love in the Afternoon",
      "runtime": 130,
      "poster_path": "/szqbwEUt3TVWKLrQBiZiwR98Zi5.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Allied Artists Pictures",
         "id": 4928,
         "origin_country": ""
      }],
      "release_date": "1957-06-30",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Love is a game any number can play... especially in the afternoon...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Billy Wilder"],
      "runtime": 130,
      "synopsis": null,
      "writers": [
         "Billy Wilder",
         "I.A.L. Diamond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050658/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0Njc1NTYxM15BMl5BanBnXkFtZTcwMjg5ODM1Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gary Cooper, Audrey Hepburn, Maurice Chevalier | See full cast and crew »"],
      "reviews": [
         "This odd combination of story, characters, and cast could easily have fallen apart irretrievably in the first few minutes. That it holds together is due primarily to Audrey Hepburn's unsurpassed charm and Billy Wilder's resourceful story-telling technique. It ends up being enjoyable most of the time, sometimes very much so, in spite of itself. The story is rather strange - for it to \"work\" you have to buy into a number of unlikely possibilities, and even then, you have to accept the main characters as sympathetic even when they don't deserve it. It's the kind of hollow concept that you see much more often in present-day movies, which are made for audiences who don't care about plausibility, and who are easily persuaded that a shallow, pseudo-romantic attraction between two characters automatically makes them sympathetic. None of that is to imply anything against the stars. Audrey Hepburn is so engaging as Ariane that it makes you want her to be happy, even though much of her behavior is fatuous. Maurice Chevalier is enjoyable and is obviously well-cast, and John McGiver also adds some good moments. Gary Cooper's character doesn't work very well, but that should not be blamed at all on Cooper. The character just is not as appealing as the scriptwriters presume him to be, and Cooper should actually be commended for making him as likable (or as un-unlikable) as possible. Wilder's skill made some strange stories work pretty well in his time, and he also deserves much of the credit for keeping this one afloat. There are also some very good sequences in the screenplay, for all that it was uneven in general. The odd thing about \"Love in the Afternoon\" is that if you can tolerate the poor setup and get past the obvious flaws, you can really enjoy most of the movie, because it does have several positive things to offer.",
         "Love in the Afternoon is a late 50s Wilder classic. At least semi-classic. The story is about a French girl who falls in love with a swinger from Paris. The girl is Audrey Hepburn and the man is Gary Cooper. The first act lags. The only thing keeping me glued to the screen is Hepburn, who has such a screen presence (she's pretty). Recent comments have also noted Gary Cooper's miscasting. I'm not sure. I agree it's hard to believe Hepburn's character falls for him. The movie just doesn't work in his favor in the first act. It does begin to work eventually. The turning point would have to be at the picnic where he obviously starts to fall for her. Cooper falling for Hepburn: more realistic. From that point everything takes off. Cary Grant could have pulled off the attraction, but I don't think he could have pulled off the 2nd and 3rd act, and Cooper did. When he's sad (dictaphone/wine cart/sauna scenes) he's a top form comic actor. Anyways - I digress. No one can produce the feeling of heartache with so much sadness and glee as Wilder can. The gypsy band should have earned a best supporting actors nomination.",
         "The first thing I noticed about this lilting romance (on the widescreen DVD) was the beautiful, shimmering, black and white photography. Set in Paris, with some scenes filmed there, Director Billy Wilder weaves a captivating, simple tale of a 20ish woman (Hepburn), who lives with her father (Maurice Chevalier), who schemes to snag a 50ish cad (Cooper). At first the age difference is very apparent, with Cooper seemingly mis-cast as a womanizer, but he grows on you, with a sweet, gentle, quiet, attractive performance. Hepburn is stunning and spunky in one of her best performances. The song \"Fascination\" is used to great effect. Filmed in 1957, the only way to show the title occurrence is to have a camera shot following Hepburn's dis-robed fur coat falling to the hotel room's floor, as she embraces Cooper. The ending is suspenseful, with cute narration epilogue by Chevalier. A wonderful film.",
         "The plot is very cute and romantic. A private detective's innocent young daughter lives vicariously through her father's case files. Predominate among them is millionaire jet-setting Frank Flannagan, stealer of women's hearts. The detective gets involved when the stolen hearts belong to married women. One day the daughter overhears a jealous husband swear blood vengeance against Flannagan. The daughter devises a plan to thwart the killing, and in the process falls heads-over-heels in love with him. At first she's just another fling to him...but then love blossoms in his heart too. Shot on location in Paris, Maurice Chevalier plays the detective, and John McGiver the jealous husband. They are both great. Audrey Hepburn is wonderful as the daughter, but.....a Gary Cooper looking every one of his 56 years is cast as the the playboy! This miscasting is just too much to overcome. There are only four characters in the movie which runs over 2 hours. When one is so unbelievable as Cooper the movie is irreparably damaged. It's a crying shame.",
         "Love in the Afternoon was conceived and brought to the screen by Billy Wilder as a homage to his friend and mentor in Hollywood, Ernest Lubitsch. This French novel Ariane had been filmed before in fact, by the Germans just before the Nazis took over and had starred Elizabeth Bergner. Audrey Hepburn proved to be a worthy successor to Bergner. Whatever success Love in the Afternoon has is due to her performance. She radiates beauty and charm and no wonder Gary Cooper is so fascinated by her. Wilder would consider no one else for the lead and waited for Hepburn to be free while she was on a lengthy location shooting for War and Peace. But it's Cooper who's the weak one here. He was not Billy Wilder's first choice. Cary Grant for the third and final time missed out on being in a Billy Wilder film having previously turned down Five Graves to Cairo and Sabrina. The part was offered to Yul Brynner also. But Gary Cooper turned out to be available when Hepburn was and he got the role. Wilder later admitted the bad casting, but he also said that it was his ill luck to get Cooper at the start of the health problems that would eventually kill him. He said Cooper got old overnight. In fact he looks as old as Maurice Chevalier and Chevalier as Hepburn's father was 13 years older than Cooper. Maurice is a detective who specializes in tracking down and confirming spousal infidelities. He's been hired by John McGiver to find out if his wife has been seeing millionaire playboy Cooper. Daughter Hepburn however is crushing out on Gary big time and unbeknownst to Maurice she takes it upon herself to warn him. The old popular standard Fascination is heard through out the film and in the same year it came out, the 20+ year old standard was revived in a million selling hit by Pat Boone. It was not an easy shoot despite those familiar Parisian location. In a recent biography of Wilder, the story is told that he had tremendous difficulty in shooting the picnic and row boat scenes. It seems as though the location was a breeding ground for mosquitoes and they were unmerciful to cast and crew. Wilder took several takes just to get enough usable footage. Audrey Hepburn fans will be mad for Love in the Afternoon, Gary Cooper's though might wince when seeing it.",
         "This charming romance restores ones belief that the improbable, no matter how unlikely, has, to paraphrase Conan Doyle, the ring of a singular truth and beauty. The author and director clearly knew a lot about love. I guess my admiration for this film proves that after 30 years in a single blissful relationship, I am still an unabashed romantic. This film is what it's all about. I feel sorry for those art-film historians who fail to be overwhelmed by the depth and charm of this piece and would rather pick it apart with their overly dissecting, maddeningly analytic tweezers, missing the point entirely. Their lives must be rather cold and empty. This film works. Wilder's genius pulls it off. How many among us know of numerous life-long loves where the age difference between the lovers would appear prohibitive but proves to be only a minor obstacle to a lasting relationship. In my experience life imitates art. In this work it is the very difference in their ages and the differing circumstances of their lives that attract Gary Cooper and Audrey Hepburn's characters. It is the differences that are extra-normal that make this story so believable. He is attracted to her utterly captivating refined insouciance and she to his masculine-straight forward worldly charm. He is the best of the fantasies she has constructed from her father's (Maurice Chevalier's) detective business files, and she is precisely the down home girl with her wits about her who knows his world and his past and loves him anyway. Why is it the desire of all those incapable of suspending disbelief even a smidgen to turn every work of art into a highly predictable, formulaic mouthful of insipid pre-stamped pabulum. How shallow. Or perhaps I am not only overly romantic but additionally overly democratic. I am proud to see that at least the positive vote count for this film, that is the large number of 9 and 10 votes, more accurately reflects the quality of this timeless vignette, than do the rather sour comments that I have just read. If you have half a heart you will laugh and cry and truly love this film!",
         "I am not a fan of romantic movies but there are a small handful that I love and by far the one I love most (of the less bigger scale types like \"Gone With the Wind\") is \"Love in the Afternoon\". I love the story, the camerawork and especially the lead players...Gary Cooper and Audrey Hepburn. I love these two so much that it's hard to put another great screen couple above them. They make the whole story come alive in their own way. Coop with his dry but lovable wit and charming good looks, and Audrey with her universal charm, wholesomeness and great beauty. I have read in the book \"The Complete Films of Audrey Hepburn\" that Cary Grant and Yul Brynner were the first two choices to play Coop's part. Thank God that neither were able to. Coop as the character of Frank Flannagan makes the film more romantic and his ever-popular sweet-guy, no-airs-of-any-kind persona makes the film less stuffy than it would with Grant or Brynner. Audrey of course is the perfect Ariane and they shine together in each other's arms. Call it a cliche but that comment fits this film perfectly. See it if you're in the mood for good, romantic farce.",
         "Ariane Chavasse, daughter of a French detective, loves to read her father's private dossiers... She becomes fascinated with the file concerning American playboy millionaire Frank Flannagan and a certain Madame X... She soon learns that Monsieur X has sworn to kill the American, so she goes to his hotel suite to warn him... Flannagan, intrigued by the attractive mysterious girl, dates her for the following afternoon... Ariane is captured by his sophistication, and a succession of many 'afternoon rendezvous' follows... Concealing her identity, Ariane tells Frank of the many lovers in her past... He now becomes concerned about her... One day, in a steam bath, Flannagan meets Monsieur X, who advises him to consult detective Chavasse... He does, asking the detective to find out about the mysterious girl... Reunited with Billy Wilder, Audrey Hepburn once again finds herself cast opposite a father figure in the person of Gary Cooper... Their vehicle is a gay comedy that derived from a Claude Anet novel called 'Ariane,' and it had been filmed twice before... Both adaptations clung to the novel's concept of an innocent young girl's winning over a middle-aged Don Juan by pretending a romantic past of her own to equal his, and eventually reforming him altogether... With the most popular French entertainer of the last century Maurice Chevalier as the loving father, and John McGiver as the jealous husband, and considering its slight plot, 'Love in the Afternoon' maintains an atmosphere of sly charm and amusing details that almost sustains the film's length... Director Wilder is helped immensely by the luminous black-and-white photography of William Mellor and by musical composer Franz Waxman, whose various arrangements of the movie's long-playing leitmotif 'Fascination' lend so much to the resulting effect...",
         "There is likely no more romantic ending to a Hollywood movie than the one in this soufflé-light 1957 romantic comedy, where Audrey Hepburn tries to keep up with a departing train upon which Gary Cooper stands and listens intently to her babbling about her fictitious sexual conquests. Hepburn plays Ariane, a young cellist and the daughter of a Parisian private investigator named Claude Chevasse. She has an unbridled interest in her father's often tawdry cases, chief among them the affairs of Frank Flannagan, a millionaire industrialist and aging playboy who finds himself in various trysts with married women around the world. A certain Monsieur X has come to Chevasse to catch his wife in a suspected extramarital fling with Flannagan. Overhearing Monsieur X's intention to kill his wife and her lover, Ariane decides to warn Flannagan, and they embark on an afternoons-only affair under the pretense that she is as much a worldly bon vivant as he is. Things come to a head when Flannagan becomes infatuated with this mysterious \"thin girl\" and recruits Crevasse to find out who she is. Master filmmaker Billy Wilder leaves his unmistakable stamp on this confection with a clever, ironic script co-written with his long-time partner I.A.L. Diamond in their first collaboration. The dialogue is full of their trademark sparkling banter, and leave it to Wilder to use a Gypsy string quartet to act as a chorus for Flannagan's sexual shenanigans. Hepburn is her usual impeccable self as Ariane and especially good fun when she layers the deceptions about her checkered past. Cooper played this type of boulevardier role in the 1930's under masters like Ernst Lubitsch, and it is quite enjoyable to see him come back to this milieu two decades later as an aging lothario. Looking weather-beaten after years of Westerns and adventure pictures, he was given a lot of grief because of the age difference between him and Hepburn, but I actually find the gap quite touching and Cooper surprisingly game. Maurice Chevalier is ideally cast as Crevasse even if has to play down his naturally effervescent manner. Granted the film runs a little too long at 126 minutes, but it is fine, light entertainment similar to Wilder and Hepburn's previous collaboration, the classic 1954 \"Sabrina\". The print transfer on the 2005 DVD is fine though not outstanding. Unfortunately there are no extras included.",
         "This has always has been my all time favorite romantic comedy. Thanks to Billy Wilder's creative genius this film works despite Gary Cooper being miscast as the leading man. Regrettably, Gary Cooper was not only too old, but lacked the charm and suaveness needed for the role. Cooper was also in the twilight of his career and was suffering from health problems when the film was made. Cary Grant or Gregory Peck would have been more appropriate for the role of Frank Flannagan, the womanizing jet setter who falls madly in love with the daughter of a detective who has been investigating him. Nevertheless even with a miscast Gary Cooper the film works ....thanks to the marvelous performances of Audrey Hepburn and Maurice Chevalier, who play the young innocent musician daughter and her snooping, pooping private detective father. The title song \"Fascination\" with original music by F.D. Marchetti and Franz Waxman serve as a romantic thread that runs tightly through out the entire cinematic heart throbbing experience. Billy Wilder's more noted films such as \"The Apartment\" and \"Some Like It Hot\" may have garnered more recognition than this film over the years, but in my opinion none of them have the charm that this film has to offer. In fact if one is willing to \"What if?\", and trade off Gary Cooper for Gary Grant for the role of Frank Flannagan, I suspect that that this film would have been right up there with the best romantic comedy of all time, \"It Happened One Night\"."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "productionCompanies": ["Billy Wilder Productions"],
      "summaries": [
         "In Paris, detective Claude Chavasse is hired to follow a wife suspected of infidelity with the notorious American libertine Frank Flannagan. When the husband learns that his suspicions are accurate, he tells Claude of his plan to kill Flannagan. Claude's daughter Ariane overhears the threat and warns Frank of the coming trouble. She then plays the part of a worldly socialite with a list of conquests as long as Flannagan's. The bemused ladies' man returns to America the next day and Ariane, completely in love, follows his romantic escapades in the news. She sees him again in Paris the following year, and resumes her worldly guise, telling tales of former lovers when they meet at his hotel in the afternoon. Frank, amazed by the mystery girl and surprised to find himself jealous of her past, hires Claude to uncover more information about her. When the detective realizes what has happened, he asks Frank not to break his daughter's heart.",
         "Director Billy Wilder salutes his idol, Ernst Lubitsch, with this comedy about a middle-aged playboy fascinated by the daughter of a private detective who has been hired to entrap him with the wife of a client."
      ],
      "budget": 2100000
   },
   "movielensId": 937,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1957-06-30",
      "dvdReleaseDate": "2002-01-08",
      "directors": ["Billy Wilder"],
      "runtime": 130,
      "movieId": 937,
      "title": "Love in the Afternoon",
      "mpaa": "NR",
      "actors": [
         "Gary Cooper",
         "Audrey Hepburn",
         "Maurice Chevalier",
         "John McGiver",
         "Van Doude",
         "Lise Bourdin",
         "Olga Valéry",
         "Jean Ozenne",
         "Paul Bonifas",
         "Moustache"
      ],
      "imdbMovieId": "0050658",
      "originalTitle": "Love in the Afternoon",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["rSeGFCl5fWY"],
      "plotSummary": "Lovestruck conservatory student Ariane pretends to be just as much a cosmopolitan lover as the worldly mature Frank Flannagan hoping that l’amour will take hold.",
      "tmdbMovieId": 18299,
      "avgRating": 3.67727,
      "releaseYear": "1957",
      "numRatings": 550,
      "posterPath": "/szqbwEUt3TVWKLrQBiZiwR98Zi5.jpg"
   }
}