{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "mistaken identity",
            "id": 10325
         },
         {
            "name": "british high society",
            "id": 157258
         },
         {
            "name": "stepparent stepchild relationship",
            "id": 160962
         },
         {
            "name": "drunkenness",
            "id": 188991
         },
         {
            "name": "debutante",
            "id": 191790
         }
      ],
      "imdb_id": "tt0052126",
      "video": false,
      "title": "The Reluctant Debutante",
      "recommendations": [
         106990,
         98248,
         38469,
         31664,
         29605,
         222996,
         38465,
         38460,
         33536,
         38463,
         38472,
         38470,
         38456,
         33395,
         43488,
         57040,
         46081,
         71750,
         33389,
         26850
      ],
      "backdrop_path": "/cNE7PztS1Nut5dOjISRx5k38ezv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Jimmy Broadbent",
               "gender": 2,
               "credit_id": "52fe46d8c3a368484e0a6d55",
               "name": "Rex Harrison",
               "profile_path": "/nWFxAoYfFURmIxz9YJBQ9DLcDx6.jpg",
               "id": 35321,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Sheila Broadbent",
               "gender": 1,
               "credit_id": "52fe46d8c3a368484e0a6d59",
               "name": "Kay Kendall",
               "profile_path": "/tZDOMreC40cI1oTAfxMZ9PJ2KWk.jpg",
               "id": 142385,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe46d8c3a368484e0a6d5d",
               "name": "Sandra Dee",
               "profile_path": "/ePJuenWz5ZtbbKSTKrQG4I3K2PH.jpg",
               "id": 89808,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe46d8c3a368484e0a6d6d",
               "name": "John Saxon",
               "profile_path": "/140sjZuUAGQraBSNO87Y5bVC74i.jpg",
               "id": 11163,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Mabel Claremont",
               "gender": 1,
               "credit_id": "52fe46d8c3a368484e0a6d61",
               "name": "Angela Lansbury",
               "profile_path": "/nMy8sPPLf8fjSglFLP3IzIGbjly.jpg",
               "id": 14730,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Clarissa",
               "gender": 1,
               "credit_id": "52fe46d8c3a368484e0a6d65",
               "name": "Diane Clare",
               "profile_path": "/47DPimtMoHRFkHqTOJnH5WIn6c.jpg",
               "id": 102661,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "David Fenner",
               "gender": 2,
               "credit_id": "52fe46d8c3a368484e0a6d69",
               "name": "Peter Myers",
               "profile_path": null,
               "id": 19611,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Miss Grey",
               "gender": 0,
               "credit_id": "58c840a4c3a368359e00075c",
               "name": "Ambrosine Phillpotts",
               "profile_path": "/f1P4wLHBEJ64NcguyX1FkE0IVMQ.jpg",
               "id": 84406,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d8c3a368484e0a6d33",
               "name": "Vincente Minnelli",
               "profile_path": "/qUV0pO7Q1Vs9Jcvq0LWcqOERQ2H.jpg",
               "id": 13980,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d8c3a368484e0a6d39",
               "name": "William Douglas-Home",
               "profile_path": null,
               "id": 66961,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d8c3a368484e0a6d3f",
               "name": "William Douglas-Home",
               "profile_path": null,
               "id": 66961,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d8c3a368484e0a6d45",
               "name": "Julius J. Epstein",
               "profile_path": null,
               "id": 2665,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d8c3a368484e0a6d4b",
               "name": "Eddie Warner",
               "profile_path": null,
               "id": 239136,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d8c3a368484e0a6d51",
               "name": "Joseph Ruttenberg",
               "profile_path": null,
               "id": 14678,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.466582,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 64382,
      "vote_count": 16,
      "budget": 0,
      "overview": "Jimmy and Sheila Broadbent (Rex Harrison and Kay Kendall), welcome to London Jimmy's 17-year-old daughter, Jane (Sandra Dee). Jane is from Jimmy's first marriage to an American and has come to visit her father and the step-mother she has never met. While visiting Sheila has the idea of making Jane a debutante, an idea Jane resists. Difficulties range from Jane's apathy to being placed on the marriage block, the determined efforts of Sheila's cousin, Mabel Claremont, (Angela Lansbury) to win wealthy David Fenner (Peter Myers) for her debutante daughter Clarissa (Diane Clare), and Jane's attraction to David Parkson (John Saxon), an American drummer who plays in the orchestra at the coming-out balls.",
      "similar": [
         35056,
         9655,
         8467,
         59,
         213,
         2604,
         11829,
         3132,
         7303,
         157370,
         332340,
         18764,
         9716,
         59860,
         180948,
         30018,
         21629,
         3080,
         4507,
         9414
      ],
      "original_title": "The Reluctant Debutante",
      "runtime": 94,
      "poster_path": "/bjKTY9upVOsSAuolYM16TmZa4M6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1958-01-01",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "MGM presents the Comedy-Romance in luscious COLOR!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vincente Minnelli"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "William Douglas-Home",
         "William Douglas-Home"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052126/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MTk5MzU0OV5BMl5BanBnXkFtZTYwMjE0OTg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rex Harrison, Kay Kendall, John Saxon | See full cast and crew »"],
      "reviews": [
         "This is my favorite comedy. Rex Harrison plays a man in London remarried to a strikingly lovely Kay Kendall. His daughter comes to live with them from America, played by Sandra Dee. She is just the right age for a \"Coming Out Party\", so her step-mom Kay Kendall sets about to get her ready and invite all the eligible bachelors.John Saxons plays a young man named David. Sandra meets John Saxon and likes him immediately. But a friend of Kay Kendall's Angela Lansbury who also has a daughter coming out, tells her what a terrible person John Saxon is. Angela Lansbury's own daughter likes the palace guard David.Sandra cannot stand him. John Saxon is as always the handsomest man in the movie with his smoldering good looks. He is a drummer who plays at these coming out parties.Sandra likes David ( John Saxon ) but there is another David who is one of the Palace guards.This other David looks like and acts like Edgar Bergen's dummy Mortimer Snerd. He is the classic bore. With two young men with the same name you can just imagine all the fun of mistaken identity and misunderstandings. Rex Harrison and Kay Kendall are so hilarious as they go from party to party night after night, till they are not quite sure who's party they are at or why they are there. A laugh a minute. It all makes for loads of fun and laughs. Between going to all the parties Rex and Kay have to keep their eye on Sandra, which makes for more fun then I can relate. Sandra likes Saxon and sneaks out to see him. A wonderfully hilarious comedy~ Don't miss this movie. You will be glad you saw it. Go buy it because you are going to want to see it over and over again. I think I will slip my copy in the VCR now and enjoy this movie too. Enjoy!",
         "I can't add much to what has already been said of this delightful movie. But nobody has mentioned the costumes. It's astonishing to note that Balmain created the dresses for both Kay Kendall and Angela Lansbury. Nearly 50 years later, Kendall still looks ravishingly current in her haute couture day and evening wear. The magnificent red dress she wears in the first party scene is a perfect example and she had the stunning figure to enhance these wonderful costumes. Angela, who had a nifty figure herself, is a more full-figured woman. She's also playing a nasty bitch in this film, and her costumes reflect this aspect of her personality. Instead of looking chic, she looks dowdy. Sandra Dee's costumes were created by MGM's Helen Rose. I didn't care for any of her daytime wear which was very much a product of the 50s, but it is with gowns that Rose's talent shines, and there's a lovely blue gown with tiny blue bows in the final scenes of this movie that you really notice, and Dee wears the dress like the prom queen she was. Rex Harrison could wear stylish men's clothing with panache, and he does so here too. I love this sophisticated movie, which I only discovered a few years ago. And the interior sets are equally beautiful.",
         "I quite like this movie. The story is written like a Restoration mistaken identity comedy (think Wycherly, Congreve or Farquahar) but without the low necklines and with much less bawdiness (yes, you may wonder what's left). The lines given Saxon and Dee are pretty bad - and although Saxon does the best he can, I don't think Sandra Dee does an interesting job at all - she looks quite bored (if pretty). When they're on screen, this is incredibly dull. Yet the adults, working with almost nothing, go all out and make this a pleasure -- you'll wish that the story were a variant of Unfaithfully Yours with Harrison or Kendall suspecting the other of infidelity and no children in sight. Yet despite all, - Minnelli makes the movie stunningly beautiful (you very much want to be there) with great rich colors, London shown in glorious sweeping color, and the movie goes swiftly with wonderful and amusing editing -- -- the costumes and sets are just so beautiful -- -- Rex Harrison is in as finely comic a mode (don't expect his Henry IV or wonderful Julius Caesar here) as he's ever been - and that is VERY high praise -- -- Kay Kendall is a moviegoer's dream - stunningly beautiful, an exquisite comedic touch, wonderful with either a line or a pratfall. In movies like this, Genevieve, Les Girls, she is an aristocratic Lucille Ball if you can imagine that - as giddy, as wildly inventive -- but haute. -- Angela Lansbury takes a thankless part and really gets into it - and Lansbury is superb. So, sure, the story is gossamer, there aren't many amusing lines, but the panache brought by the director, costume and set designers, Harrison, Kendall and Lansbury combine to make this quite enjoyable. There's something to be said for a movie that you want to see again and again simply because you wish you were there. I own relatively few movies, but this is one.",
         "This is a cute movie, made funny by Rex Harrison and Kay Kendall. Both actors are superb in comedy, especially in this comedy. It's hard to believe Ms. Kendall would be gone a year later. According to Mr. Harrison's autobiography, he knew his wife was dying, but she did not know. This movie is a wonderful valentine Rex Harrison gave to his wife, Kay Kendall. A few years earlier, Kay Kendall made a very funny movie, \"Simon and Laura\" with Peter Finch. Movie is not available on video, so watch for it on television.",
         "I am not sure why this film isn't more famous, as it was a very entertaining romantic-comedy. Considering that it was directed by Vincente Minelli and stars Rex Harrison, it can't help but be good. It's apparently good enough that the film was remade just a few years ago as WHAT A GIRL WANTS. As the film begins, the cream of British society is readying itself for a long string of debutante balls--just as Rex Harrison's daughter from a previous marriage arrives from America (Sandra Dee). His new wife (played by his real-life wife, Kay Kendell) is having a disagreeable conversation with an annoying friend (Angela Lansbury) about these society dances when she feels compelled to announce that her step-daughter will be introduced to society at the next ball--even though the girl and her father have no interest in these stuffy affairs. But to please the step-mom, they go through with it. Unfortunately, Kay is pretty snobby and tries to arrange a marriage with an in-bred idiot and Sandra. At the same time, Kay is horrified that Sandra is falling for a lowly drummer with a lousy reputation (John Saxon). How all this is worked out to everyone's satisfaction is pretty funny and quite romantic. I think most of this is due to good writing and the nice gentle nature of the film. In fact, the longer I watched it, the more I liked it and found myself really being pulled into the story. It's a very good and often overlooked film--pity, as it really should be more widely seen.",
         "As others have noted, the plot is pretty slight, but it's a charming film, thanks to the effortless performances of Rex Harrison, Kay Kendall, and Angela Lansbury. The adults run away with this movie, rather like Beatrice and Benedick own 'Much Ado About Nothing,' even though Hero and Claudio are really the plot. The mile-a-minute dialogue between the older generation outshines the tame goings-on between Sandra Dee (who is completely adorable) and John Saxon (ditto). The reviewer who called Peter Meyers a Mortimer Snerd look-alike was spot on; he's so hilariously boring! But to return to the exquisite Kay Kendall--her comic timing is superb and so is her dress sense! She looks totally fabulous in this film. It's terribly sad to see it and realize that she had not long to live. Film comedy lost a jewel in her. According to the closing credits of 'What Every Girl Wants', 'The Reluctant Debutante' inspired that lamentable movie. Don't watch that; watch this!",
         "A very amusing film, often hilarious, and unusually intelligent in every respect. Lansbury is a gem in an essentially despicable role. Harrison and Kendall are great, and other performances match. Sandra Dee is adorable in an extremely unusual role for a British film, or one set in Britain. She portrays an INTELLIGENT American, or child of British parents who has spent time in the U.S. She commits no faux pas against British customs, does not denounce the nation or its people, does not claim that everything in America is better than anything in the U.K., and in general acts as an intelligent, decent, lovable person. Such roles, as portrayed by Mickey Rooney and nearly all others are an insult to American intelligence, and this picture deserves top ratings for this characterization, even if it didn't for its general overall entertainment value.",
         "This is one of my very favourite movies. It is a lighthearted spoof on English upper-crust society. The cast including Sandra Dee, Rex Harrison, Kay Kendall, Angela Lansbury and John Saxon is a very well chosen mix, with other extremely good performances from supporting actors. It's a brilliant Minelli film with wonderful colour, costuming and quick clever humour. It shows us London in the height of the social season in the splendour and snobbery of the debutante era, portrayed superbly throughout with deft one line quips at which Rex Harrison and Kay Kendall are masters. It is good lighthearted entertainment, most probably more a chick flick, but I would recommend it to all. Hopefully it will be re-released.",
         "Entrancing comedy driven by the captivating team of Rex Harrison and the divine Kay Kendall. Both masters of comic timing they make the slight plot of unexpectedly having to present Sandra Dee, Rex's very American daughter, into British high society highly entertaining. Hard to believe that Kay was dying of leukemia while this was being made and would only complete one more picture before her premature death at 33 the next year. She looks sensational, vibrant and full of life, and gowned and jeweled in an amazing array of stunning fashions. Rex is terrific, he often came across as a pompous ass on screen, which worked perfectly for My Fair Lady but otherwise could be off putting, but here he is bemused and full of wry detachment. The supporting cast is sprinkled with funny performances. Sandra Dee is pert, sweet and amusingly frustrated as the object of Kay's misguided good will and John Saxon is darkly handsome and quite engaging. The two became good friends during the filming of this and remained so for the rest of Sandra's life. He was one of the few people she would see after she became a recluse. Angela Lansbury is delightful as the loquacious flibbertigibbet cousin of Kay reminding those who only know her from Murder, She Wrote that she is an expert comedienne as well. The entire cast is wonderful but it is really Kay Kendall's movie all the way.",
         "I saw this one during its first-run release at the Beverly Theatre in Beverly Hills, Calif. The CinemaScope projection there was top-notch, doing full justice to Minnelli's always creative use of the wide screen. Among MGM's A-list ingredients was the casting of Kay Kendall, whose elegance and comic verve made this confection as enjoyable as one could have hoped. How I wish she had lived to make many more screen memories. Her early death was a real loss. This title appears to be available on video only in a VHS version, which no doubt means that it is probably not letterboxed. \"There oughta be a law!\""
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Avon Productions (II)",
         "Metro-Goldwyn-Mayer (MGM)"
      ],
      "summaries": [
         "Jimmy and Sheila Broadbent (Rex Harrison and Kay Kendall), welcome to London Jimmy's 17-year-old daughter, Jane (Sandra Dee). Jane is from Jimmy's first marriage to an American and has come to visit her father and the step-mother she has never met. While visiting Sheila has the idea of making Jane a debutante, an idea Jane resists. Difficulties range from Jane's apathy to being placed on the marriage block, the determined efforts of Sheila's cousin, Mabel Claremont, (Angela Lansbury) to win wealthy David Fenner (Peter Myers) for her debutante daughter Clarissa (Diane Clare), and Jane's attraction to David Parkson (John Saxon), an American drummer who plays in the orchestra at the coming-out balls.",
         "A teenage American girl while visiting her father, is thrown into London society during the \"Debutante Season\"."
      ],
      "budget": 0
   },
   "movielensId": 939,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1958-01-01",
      "dvdReleaseDate": null,
      "directors": ["Vincente Minnelli"],
      "runtime": 94,
      "movieId": 939,
      "title": "The Reluctant Debutante",
      "mpaa": "",
      "actors": [
         "Rex Harrison",
         "Kay Kendall",
         "Sandra Dee",
         "John Saxon",
         "Angela Lansbury",
         "Diane Clare",
         "Peter Myers",
         "Ambrosine Phillpotts"
      ],
      "imdbMovieId": "0052126",
      "originalTitle": "The Reluctant Debutante",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["NsMOFmi2HZY"],
      "plotSummary": "Jimmy and Sheila Broadbent (Rex Harrison and Kay Kendall), welcome to London Jimmy's 17-year-old daughter, Jane (Sandra Dee). Jane is from Jimmy's first marriage to an American and has come to visit her father and the step-mother she has never met. While visiting Sheila has the idea of making Jane a debutante, an idea Jane resists. Difficulties range from Jane's apathy to being placed on the marriage block, the determined efforts of Sheila's cousin, Mabel Claremont, (Angela Lansbury) to win wealthy David Fenner (Peter Myers) for her debutante daughter Clarissa (Diane Clare), and Jane's attraction to David Parkson (John Saxon), an American drummer who plays in the orchestra at the coming-out balls.",
      "tmdbMovieId": 64382,
      "avgRating": 3.29825,
      "releaseYear": "1958",
      "numRatings": 114,
      "posterPath": "/bjKTY9upVOsSAuolYM16TmZa4M6.jpg"
   }
}