{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "tibet",
            "id": 4558
         },
         {
            "name": "survival",
            "id": 10349
         },
         {
            "name": "shangri la",
            "id": 194281
         },
         {
            "name": "himalayan mountains",
            "id": 194282
         }
      ],
      "imdb_id": "tt0029162",
      "video": false,
      "title": "Lost Horizon",
      "recommendations": [
         29740,
         24807,
         28963,
         34106,
         911,
         17185,
         13528,
         24481,
         17382,
         25670,
         20362,
         59964,
         23518,
         41059,
         20003,
         3086,
         44334,
         25430,
         36206,
         36495
      ],
      "backdrop_path": "/1LuzmBWco1YmN7gruhotILN7jxP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Robert \" Bob \" Conway",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e89",
               "name": "Ronald Colman",
               "profile_path": "/eYzmXamTV6CpqwxZqTEJSBRNlb0.jpg",
               "id": 29522,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Sondra Bizet",
               "gender": 1,
               "credit_id": "52fe43a0c3a36847f8062e8d",
               "name": "Jane Wyatt",
               "profile_path": "/blYpLJKupFFi6QKqfMWJvN2hkpn.jpg",
               "id": 2021,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Alexander P. \" Lovey \" Lovett",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e91",
               "name": "Edward Everett Horton",
               "profile_path": "/yf4MoiK7wnb2dafruUvnVgtuxSN.jpg",
               "id": 2437,
               "order": 2
            },
            {
               "cast_id": 21,
               "character": "George Conway",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062ea9",
               "name": "John Howard",
               "profile_path": "/x4Emx0J4qTGayfVmIjK88IdO8vo.jpg",
               "id": 102687,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Henry Barnard",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e95",
               "name": "Thomas Mitchell",
               "profile_path": "/1Tiiouk77NtxSmdknoN4ny5kT9j.jpg",
               "id": 3383,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe43a0c3a36847f8062ea5",
               "name": "Margo",
               "profile_path": "/7C3uTeLp3McAtK6ybtTFEQtPlEP.jpg",
               "id": 19221,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Gloria Stone",
               "gender": 1,
               "credit_id": "52fe43a0c3a36847f8062e99",
               "name": "Isabel Jewell",
               "profile_path": "/oTaZ9jY0BpCjiGuoGnlxVA3m24b.jpg",
               "id": 33277,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Chang",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e9d",
               "name": "H.B. Warner",
               "profile_path": "/kYHCNllR7guQTtgROCb3z5dLusa.jpg",
               "id": 33278,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "High Lama",
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062ea1",
               "name": "Sam Jaffe",
               "profile_path": "/drxy1JkTOjhUhQnrFnepTmSHELd.jpg",
               "id": 10024,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Wynant (uncredited)",
               "gender": 2,
               "credit_id": "5a22b4c892514103240b5711",
               "name": "John Burton",
               "profile_path": null,
               "id": 103657,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e49",
               "name": "Frank Capra",
               "profile_path": "/hvPrtfKnJs9arck1zKGnG8uRkBC.jpg",
               "id": 2662,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e4f",
               "name": "James Hilton",
               "profile_path": null,
               "id": 33273,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e55",
               "name": "Robert Riskin",
               "profile_path": null,
               "id": 19019,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e5b",
               "name": "Frank Capra",
               "profile_path": "/hvPrtfKnJs9arck1zKGnG8uRkBC.jpg",
               "id": 2662,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e61",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e67",
               "name": "Joseph Walker",
               "profile_path": null,
               "id": 17761,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e6d",
               "name": "Gene Havlick",
               "profile_path": null,
               "id": 30154,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e73",
               "name": "Gene Milford",
               "profile_path": null,
               "id": 9852,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062e79",
               "name": "Stephen Goosson",
               "profile_path": null,
               "id": 29345,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a0c3a36847f8062e7f",
               "name": "Babs Johnstone",
               "profile_path": null,
               "id": 33275,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a0c3a36847f8062e85",
               "name": "Ernest Dryden",
               "profile_path": null,
               "id": 33276,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a0c3a36847f8062eaf",
               "name": "Sidney Buchman",
               "profile_path": null,
               "id": 30208,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 3.926269,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 3598,
      "vote_count": 51,
      "budget": 4000000,
      "overview": "British diplomat Robert Conway and a small group of civilians crash land in the Himalayas, and are rescued by the people of the mysterious, Eden-like valley of Shangri-la. Protected by the mountains from the world outside, where the clouds of World War II are gathering, Shangri-la provides a seductive escape for the world-weary Conway.",
      "similar": [
         9433,
         290512,
         87502,
         75174,
         281957,
         813,
         744,
         19908,
         5559,
         676,
         76163,
         363676,
         225574,
         238636,
         5915,
         26388,
         8358,
         1979,
         20766,
         141
      ],
      "original_title": "Lost Horizon",
      "runtime": 97,
      "poster_path": "/aoXlp2ywUZ31qZO4RLSNUAK6A0l.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1937-08-31",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "At Last ! . . . The Masterpiece Of America's Foremost Film Genius Blazes To The Screen !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Frank Capra"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Robert Riskin",
         "James Hilton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0029162/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzQxNjg0MzMwN15BMl5BanBnXkFtZTgwMzU3NDgyMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ronald Colman, Jane Wyatt, Edward Everett Horton | See full cast and crew »"],
      "reviews": [
         "There is an aura that seems to surround classic films made before the days of computer generated visual effects and intense marketing campaigns. It was a time when motion pictures depended on grand stories, superb performances, and great direction to catapult their success. This was exactly the case of `Lost Horizon,' a film from director Frank Copra (`It's A Wonderful Life'). With elaborate set designs, excellent performances by Ronald Colman, Jane Wyatt, John Howard, Thomas Mitchell, and Edward Everett Horton, `Lost Horizon' is a story of survival and ultimately finding a way home, that cannot be forgotten. `Lost Horizon' is a tale of five castaways who inadvertently find themselves in Shangri-La after their plane crashes in the mountains of Tibet. They are lead into the place of eternal youth, natural beauty, and free from strife by members of the region. They are treated as guests, and although they want to leave and find their way back to the world as they know it, porters are hard to find. It all leads to a notion that none of them want to admit; that they were meant to be in Shangri-La. Out of the thousands of movies that have been produced in the past 100 years, only a few afford of the privilege of remembrance. What's more, only a few seem to survive due to the nature of celluloid prints breaking down over time. A similar problem plagued `Lost Horizon,' in that after decades of worthy theatrical re-issues, the prints depreciated, with many withering away. As such, a preservation program was set in place to save copies of the film. Thanks to the works of countless individuals, this classic has been restored, to a certain degree, with some of the footage missing, replaced by still shots of the actors and recorded dialogue. From a critical standpoint, `Lost Horizon' has stood the test of time to be one of the greatest adventure classics ever produced by Hollywood. What is astonishing about this film is the attention to detail. As the film begins, a battle is taking place somewhere in China where we meet our protagonist, Bob Conway (Coleman). As the film continues, the scene changes to a scene on an airplane where our characters are trying to leave the war torn region. At one point, the crew is at a high altitude where the temperature is very cold. As such, we can see their breath in the shot as they speak. Normally, this kind of feature is ignored as the scene is short, but it adds a touch of realism that can't be denied. Incredible detail went into the creation of Shangri-La. With its large sets, beautiful costume design, the film takes on an epic proportion only rivaled by the grand designs of such Biblical epics as `Ben-Hur,' and `The Ten Commandments.' Truly, director Capra wanted to create an image that audiences would be astounded by\u0085and he truly succeeded. One can't help but admire the characters-they are all a bit naïve, but all intriguing in their own ways. Conway (Coleman) is a British diplomat and explorer whose fame is well deserved. His brother, George (Howard) presents a great deal of fear for the unknown Shangri-La. The characters of Henry Barnard (Mitchell) and Alexander P. Lovett (Horton) add a real sense of humor to the film. There are some minor inconsistencies in the story and various tasks that the characters try to pull off, but it's hardly worth complaining about because the film is such a treasure among other films. After 66 years, `Lost Horizon' remains far better than most of the adventure films that play in cinemas nowadays. One can only wish that they could have been present to see this in a theater during its original run. How amazing it would have been to see this epic tale of survival and the human struggle against itself back in 1937. `Lost Horizon' is indeed a remnant from the golden age of cinema. ***1/2",
         "\"I believe it because I want to believe it\". This one line speaks volumes about what the movie (and the original novel) was trying to say. The concept of Shangri-La, a place where people work and live in peaceful harmony, is as relevant today as it was in the post-World War I era that James Hilton wrote 'Lost Horizon', where the world was still in turmoil following a devastating war and another was on its way. In these days of war, humanitarian devastation and disease, how many people are there who dream of getting away from it all and living out their lives in a remote paradise just like Shangri-La? The High Lama's words to Conway resonate strongly even today. \"Look at the world today. Is there anything more pitiful? What madness there is! What blindness! What unintelligent leadership! A scurrying mass of bewildered humanity, crashing headlong against each other, propelled by an orgy of greed and brutality.\" On a more cinematographic note, the movie is visually stunning in an age before CGI and astronomical budgets. The beauty of Shangri-La, the stunning mountain landscapes and the overall settings of the movie make us believe that such a wonderful place can exist. All the actors are commendable in their portrayals (though some characters are different to those in the original novel) and their interaction with each other add a real sparkle to the movie. 'Lost Horizon' is a beautiful adaptation of James Hilton's masterpiece and captures the very feeling of the novel and I would highly recommend it to anyone who has ever dreamed of escaping from the hectic world in which we live.",
         "The Frank Capra adapation of James Hilton's popular novel, Lost Horizon, was somewhat controversial in its day, not polticality but because of its length (several reels were removed after a disasterous preview), and its production design, which many critics found unattractive. Now, in its restored version, we can see the film pretty much as it looked when it came out. Scenes that have not been found are represented by still photographs over which we hear the original dialogue. This is therefore not exactly the movie that was released to the theatres, but a fairly close approximation of it. The story concerns a planeload of passengers hijacked during a violent uprising in China who find themselves ultimately in Tibet, where the plane crashes, and are met by guides who lead them up a steep mountain to the valley of Shanri-La. In Shangri-La the weather is always perfect. There is no war or violence because the people's motto is 'be kind', and they live up to it. In other words, they are in paradise. The valley has a history, too complex to go into in any great depth, and the perfect climate enables its inhabitants to live very long lives. As one might imagine, there is trouble in paradise, and some of the visitors decide to leave. Shangri-La does not automatically make people happy. One still has to work at it, albeit under extraordinarily favorable circumstances. The movie is far from flawless, and the middle section, with the usual romantic stuff, is none too inspired; but it begins with a bang and very nearly ends with one, too. In the chaotic, early scenes there is a palpable sense of danger; and the generous budget enabled Capra to use large crowds, and he makes the most of them. Rarely, on screen, have large numbers of human beings, whether screaming, shooting or pushing, seemed so frightening. The airborne part of the film is likewise very satisfying. There's a good deal of exposition here, but it's so well done that one can scarcely find fault. The scenes of refueling in a remote village are eletrifying, and one isn't sure at first what's going on. Are they being attacked? No, but it takes a while to figure this out. The soaring over the clouds is mesmerizing in its simple beauty; while the crash-landing of the plane at what appears to be the foot of the mountain that leads eventually to Shangri La, is highly effective. And Capra, ever the master of film climate, offers us, briefly, a quite pretty and at the same time literally chilling sense of what it would be like to die, snowbound, in the Himalayas. But Capra's greatest triumph is the scene of hero Conway's departure from the peaceful valley, with his brother and girl-friend in tow. Conway does not want to leave, but his younger brother is in love with a Russian girl, who is unhappy in paradise and talks aginst the locals. As Conway is discussing the matter with his brother, inside, we hear wordless chanting outside, in what sounds like a religious ceremony, as robed figures carrying candles form a long line that surrounds the building, then pass on. As the talk inside becomes more heated, the voices (and accompanying music) grow louder. By the time Conway has made his decision to leave, and is walking up the hill to the opening in the rocks that will lead him from the warm, friendly valley to the freezing tempratures of the outisde world, the music rises in intensity, to a kind of lugubrious, hynoptic crescendo, providing a perfect auditory counterpart to the journey Conway is embarking on, and his mixed feelings about it. The result is one of the single most moving and lovely scenes in movies, technically and emotionally devastatingly effective. Ronald Colman's heartbreak as he gazes back, with as soulful expression as has been seen in movies, is worth seeing the rest of the picture for, and one of the highlights of American film.",
         "Along with A TALE OF TWO CITIES, THE PRISONER OF ZENDA, and THE LIGHT THAT FAILED, LOST HORIZON represented the best performance possible out of Ronald Colman. And his Robert Conway is the most modern of them (up to the time the films were made). LOST HORIZON is set (as James Hilton intended) in the 1930s, in war torn China. It is not the only reference in the story to the 1930s that Hilton puts into his fable of a paradise on earth. Hilton had reason to fear about the world he lived in. The Great War (as the First World War was generally called in the 1930s) was still a savage and recent nightmare. The 1920s and 1930s saw dictatorships seize control of European and Asian state, and Democracy retreating everywhere. \"Look at the world\", says the High Lama (Sam Jaffe), \"Is anything worse?\" The High Lama is correct - the world is collapsing, and the so-called panaceas (Communist Russia, Nazi Germany, Fascist Italy and Spain, Imperial Japan and it's \"Greater Asiatic Co-Prosperity Sphere\") are worse than the seeming ineptitude and drift in badly divided France, weakened Britain, and recovering American. Hilton took Conway, his brother George, Professor Edward Everett Horton, suspiciously quiet businessman Thomas Mitchell, and consumptive Isabel Elsom to an oasis (possibly the oasis) on that troubled old earth - Shangri La, or \"the valley of the Blue Moon\") where contentment and peace reigned and people could live, if not forever, far longer and more happily than in say 1937 Germany, Britain, France, Russia, Italy, the U.S., or Japan. On the whole Capra catches the spirit of the novel - his sets were dismissed as being far to simplistic, but as simplicity is the hallmark of life at Shangri-La the critics seemed to miss the point. As a matter of fact, his sets (in a temperate valley in the Himalayas - a real impossibility) are more acceptable than the idiocies of the future world in the contemporary science fiction film THINGS TO COME, where H.G.Wells believes we should live in cities built in caves. The acting is very good, particularly Sam Jaffe's ancient High Lama (always shot in shadows). Remember, he is over two hundred years old. Today, because Jaffe had a long career in Hollywood (despite being blacklisted in the 1950s), we think of him as an old man in THE ASPHALT JUNGLE or as \"Dr. Zorba\" in the series BEN CASEY. So we think he must have looked old in real life when LOST HORIZON was shot. Actually, he was in his thirties or forties, so he was not that old. But he gave a performance that suggested he was an old man. Another member of the cast that I would wish to bring up for consideration is John Howard. He is not recalled by film fans too much, but Mr. Howard was a good, competent actor. That he played Hugh \"Bulldog\" Drummond in a series of \"B\" features in the late thirties makes it ironic that he played the younger brother of Ronald Colman here, who had begun the talking picture segment of his career with the same role. Howard does not have a British accent, but he does show the adoration of the younger brother for his famous sibling, and the growing anger and contempt he develops when brother Robert fails to plan for their leaving this prison they were dragged to - note how he wants to return with a bomber to destroy Shangri-La. It is one of the two roles in major films that John Howard is remembered for, the other being \"George Kittridge\", the erstwhile fiancé of Tracy Lord (Katherine Hepburn) in THE PHILADELPHIA STORY, who is pushed aside by both Cary Grant and James Stewart. As it is one of Howard's best roles, it is nice that when the film was restored (as well as possible) in the 1980s, Howard (one of the three surviving cast members) was able to appreciate it - many of the missing sequences were his scenes. Howard was very happy at the restoration result. Now, one or two notes that may help appreciate the film a little more. Who is Robert Conway supposed to be? He is called, by the High Lama, \"Conway, the empire builder.\" He is supposedly able to do impossible things - hence the admiration of his brother. When he returns to Shangri-La at the end, the comment of the man telling the story is that Conway's journeys by himself back to his valley was beyond what ordinary men could do. So who is Conway? Well, in 1937, the model for Robert Conway was dead, from a motorcycle accident, for two years. It was, of course, Thomas Edward Lawrence \"of Arabia\", who had never been in Tibet (officially, anyway) but had served time in the Indian subcontinent area on government business in the 1920s. Quite a model for an empire builder. The character played by Thomas Mitchell is also based on a real person. Harry Barnard's real name (which I have forgotten) is that of an international financier whose vast empire collapsed ruining thousands of investors. It turns out Mitchell's character is based on Samuel Insull, a mid western utilities empire builder (out of Chicago) whose financial doings brought about his collapse in the Great Depression. Insull fled in disguise to Greece, but was found on a dirty freighter, and returned to the U.S. (where he would stand trial for fraud, but be acquitted). Edward Everett Horton's anger at Mitchell when he learned the latter's identity is understandable. Mitchell's involvement in installing new pipes in Shangri-La mirrors Insull's early days, when he was an electrician, and an assistant to Thomas Edison. The use of these two real figures as the basis of the characters helped contemporary audiences to accept the background of the plot of the film.",
         "I have seen this film many times over the years and it never ceases to amaze me. Perhaps other Capra films are better known, but I don't think they can hold a candle to this one. The cast, every one, turn in stunning performances. In his secondary role as Ronald Colman's brother, I believe John Howard's performance was superb, even among this stellar cast. His career consisted of leads in \"B\" films (Bulldog Drummond) or usually the second man in \"A\" films (such as The Philadelphia Story). A talented, highly underrated actor in my view, he was of the opinion that he deserved better roles, such as those of Ronald Colman. I agree. And how about that musical score! THE BEST OF ANY FILM, in my humble opinion. What a treat it is to watch a real gem - - Lost Horizon. Incidentally the film is far better than the book by James Hilton. Could another actor have portrayed Robert Conway as Ronald Colman has? I doubt it, even in that age of excellent actors. The scene where his brother George, aided by the Russian girl, try to convince him that Shangri-La is not what it is, is remarkable for Colman's reaction. He turns away and his face changes from disbelief to uncertainty then to acceptance of their arguments. All this without dialogue. Shortly after he turns to look at Shangri-La for the last time before plunging into the outside world and again, silently, his emotions touch us all. (At least they touch me!) We are very fortunate to have this masterpiece available to us. Now, will future generations recognize this film for what it is? Judging from today's \"hits\" I really wonder.",
         "One of my favorite books growing up was James Hilton's classic 1933 book, \"Lost Horizon\", and I believe it motivated a great deal of my current wanderlust. Even though I have had the misfortune of seeing the disastrous 1973 musical remake when I was young, the original 1937 film adaptation has been a film I have wanted to see for years, but for whatever reason, it was next to impossible to uncover. Apparently, bastardized versions have shown up on TV through the years. Now we are fortunate to have this 1999 restoration spearheaded by UCLA film archivist Robert Gitt to match as closely as possible to Frank Capra's original 132-minute running time. Similar to what was done with George Cukor's \"A Star Is Born\", \"Lost Horizon\" is presented with its complete soundtrack, but missing footage had to be found through other sources, even 16-mm prints recorded from TV broadcasts, and in a few scenes, production stills were sadly the only option to fill in the gaps. Consequently, there is a variable quality to the print, but when one thinks that much of this footage could have been completely lost, the visual lapses are more than forgivable. Now that I have seen Capra's vision of the book, I can now understand why it's a cinematic classic though I have to concede not as timeless as one would hope. The fanciful plot centers on Robert Conway, a top-level English diplomat about to become the Foreign Secretary, who helps refugees and assorted others from war-ravaged China. A motley crew of passengers led by Conway boards a plane that is skyjacked toward the Himalayas where it crash lands in a desolate spot of Tibet. They are eventually met by a sect of locals who takes them to a paradise called Shangri-La. The focus of the story then becomes how each of the plane survivors responds to this utopian existence. With his instantly recognizable mellifluous tone, Ronald Colman is perfectly cast as Conway, the only one who embraces this seemingly perfect haven from the outset. He captures the natural curiosity and open romanticism of his character with his trademark erudite manner. The rest of the cast is a gallery of stock characters fleshed out by the variable quality of the performances. H.B. Warner plays Chang with the requisite serenity of his vague, mysterious character; and Jane Wyatt - two decades before playing the perfect suburban wife and mother in \"Father Knows Best\" - is surprisingly saucy as Sondra, the young schoolteacher who has Conway brought to Shangri-La. She even has a brief nude swimming scene. John Howard unfortunately overplays the thankless role of Conway's obstreperous brother George to the point where I groan every time he appears on screen. A similar feeling comes over me when I see Edward Everett Horton's overly pixilated and fey turn as Lovett and Sam Jaffe's bug-eyed, ethereal High Lama. Isabel Jewell and Thomas Mitchell fare better as a dying prostitute and a fugitive swindler, respectively. The set designs for the Shangri-La lamasery by Stephen Goossón are intriguing in that they look like a post-modern tribute to Frank Lloyd Wright's prairie architecture, though one could argue that the exteriors also resemble a fancy Miami Beach resort hotel. I also imagine that the isolationist philosophy espoused by the High Lama may have been at odds with pre-WWII patriotic fervor, though the more lingering problem is the racism apparent in the casting (e.g., non-Asians like Warner playing inscrutable Asians) and the portrayal of the Tibetan porters as gun-toting derelicts. However, for all its flaws, the movie has some really stunning camera-work by Joseph Walker, surprisingly masterful special effects (for a near-poverty row studio like Columbia), Dmitri Tiomkin's stirring musical score and a powerful sense of mysticism that gives the film a genuine soul. It is no accident that Capra, the most idealistic of the master filmmakers, helmed this movie because a more cynical mindset could have easily sabotaged the entire venture. The DVD is a wonderful package. First, there is a fascinating photo montage documentary with narration provided by film historian Kendall Miller, which gives a true feeling of how Capra approached the production. Gitt and film critic Charles Champlin provide audio commentary on an alternate track of the film with Gitt very informative about the exhaustive restoration process and Champlin more in awe of the result. There is even an alternative ending included that Columbia chief Harry Cohn insisted on filming and using upon release, but it had thankfully been dropped two weeks later. This is a genuine treat for cinemaphiles, as there are few films that make such a compelling case for seeking out one's personal utopia.",
         "I think I was about seven or eight years old when I first saw this film, and has always lingered in the back of my mind. This is pure movie magic of a rare kind, and it is surprising how well it holds up today. The story is handled with just the right balance of seriousness and humour, with fine performances throughout, and the timeless message it sends is truly profound. The middle part may be lacking a bit in pacing, but it is a minor quibble, since this, for my money, is a masterpiece. And it still looks great, with impressive set design and an abundance of atmosphere. The finale is simply sublime, and stays in the mind for a long time afterwards, one of my favorite movie moments of all time. A movie everyone should see.",
         "This is not another of Frank Capra's sophisticated, stylish comedies of the era. That might explain the reason that \"Lost Horizon\" takes a back seat today to \"It Happened One Night\" and \"Mr Deeds Goes to Town\", the immensely critically acclaimed comedies of the time. With the theme of the small man triumphing over the big, good over evil, perhaps here Capra was trying to explain idealism over humanity. He believed in the book. In his own words, \"It held a mirror up to the thoughts of every human being on earth\". Ronald Colman is perfect in his role of Robert, an English diplomat and a leader of the people. Edward Everett Horton was again great in a seemingly bubbling, comic role and Sam Jaffe, later the professor in \"The Day the Earth Stood Still\" gives a memorable performance as the High Lama, establisher of Shangri-La, the perfect world high above in the Himalayas. Some of the cinematography was absolutely amazing. It was a shame that the film was cut to the extent that footage was lost and stills had to be used in the missing sound track places. The imagery that Capra stirs up for the viewer has certainly fulfilled his vision. The film is a bit long in some parts, but it certainly does not fail to entertain, it merely takes its time to tell a great story. Is there another film from the period that sums up the great human ideal, a perfect world, a better one than the one we already exist in? \"Lost Horizon\" with its ideals is the film for the thinking person. It thrives on its themes for humanity, of kindness and moderation, stripping away the pretense of our lives. The message is as clear as anything, but maybe we all don't want to realise it, or perhaps we can't. I hope that this movie is never remade for a third time. It is a story that could only be preserved in its own time, for this version has the message that still rings clear today, unspoilt, endearing, so simple. Hollywood will never again be able to recapture what has been already crafted. Capra's neglected movie could scarcely have been more effectively filmed. Rating: 10/10",
         "Fantasy filled film that shows the different facaets of human nature. Beautifully conceived by Frank Capra whose brilliant at making films with sentlemenity as main force. A masterpiece which was brutally cut during its threaitcal run and only recently has the film been somewhat restored. Thus, the complete version of Lost Horizon(1937) is one of many lost classics in history of film. Acting is excellent with everyone giving deep performances. An wonderful story with intriquing spirital symbolisms. Ronald Colman does a marvalous job as the good natured and tolerate Robert Conway. Personally I perfer Lost Horizons(1937) over Its a Wonderful Life(1946) because the main character in the former is more complex.",
         "British diplomat Ronald Colman and brother John Howard crash a plane with several civilians including Thomas Mitchell deep in the Himalayas and find Shangri-La. The place is literally heaven on Earth, but is it really what it seems? H.B. Warner received an Oscar nomination as the man who runs the beautiful but strange place. Frank Capra's film is really a bit dark and disturbing compared to his other famous ventures. Light-hearted in many ways, but filled with strange undertones and images, \"Lost Horizon\" is one of those odd films from the late-1930s that conveys some deep messages in unconventional ways. The case could be made about the film's support for communism due to several of the sequences. Good and definitely interesting, \"Lost Horizon\" remains one of Capra's lesser-known films that still packs a punch 65 years later. 4 stars out of 5."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "British diplomat Robert Conway and a small group of civilians crash land in the Himalayas, and are rescued by the people of the mysterious, Eden-like valley of Shangri-la. Protected by the mountains from the world outside, where the clouds of World War II are gathering, Shangri-la provides a seductive escape for the world-weary Conway.",
         "In 1935, seasoned diplomat Robert Conway is sent to rescue a group of British nationals who find themselves in China the midst of a rebellion. Conway manages to get them all out and also to escape with his brother George and several others on the last airplane only to find that they are being flown far into the Himalayas. They eventually find themselves in Shangri-La, a Tibetan monastery in a beautiful mountain valley. It soon becomes clear that they are not there by chance and that were in fact kidnapped. Conway and his fellow travelers are keen on leaving but slowly, they all come to appreciate their new surroundings. Everyone that is except George Conway who is desperate to leave. As Robert learns the true secret of Shangri-La and his reason for being there, he is faced with having to leave in order to protect his brother who will be setting off with or without him.",
         "Brit Robert Conway is a writer, humanitarian, diplomat, and former military man, all of which have made him a public hero. But he is remarkably unfulfilled in his life, something he does not tell anyone. On March 10, 1935, he is in Baskul, China, where a violent revolution is taking place. It is his job to evacuate the ninety British subjects in the area, before he himself heads back to London to become British Foreign Secretary. He is able to complete the evacuation, with him, his overly pragmatic brother George Conway, paleontologist Alexander Lovett (a fussbudget of a man), secretive Henry Barnard (who later states why he is so secretive about himself), and terminally ill American Gloria Stone his fellow passengers on the last flight out. What they are initially unaware of is that the plane has been hijacked, and eventually crash lands high in the Himalayas, killing the hijacking pilot. But instead of what seems a probable death for them, they are rescued by a band of men who take them back to their community hidden behind the mountains, a seemingly Utopian community named Shangrila, where the overall belief is to be kind. Aging is also a seemingly unknown concept. Each of the five has different feelings about their new sanctuary, where they eventually learn they were not brought by accident. On one end of the spectrum is George, who does whatever he can to get back to civilization as he knows it, despite the probable hardship of doing so, especially since there is no means of communication in and out. He believes what they have been told are all lies and that they are being held prisoners against their will. On the other end is Bob, who believes that Shangrila is exactly what he's been looking for in life. With no proof one way or another, the five have differing views of staying in Shangrila forever or trying to make their way out. It may be not until they receive that \"proof\" that a definitive decision can be made, but by that time it may be too late for some.",
         "On 10 March 1935, the pacifist British diplomat and future Foreign Secretary Robert Conway helps a group of ninety Westerns white people to escape from the Chinese city of Baskul after the beginning of a revolution. He leaves the airport in the last plane with his brother George, the geologist Alexander P. Lovett, the rogue trader Henry Barnard and the sick and bitter Gloria Stone. However, the plane is skyjacked and crashes in a remote area in Tibet. When they have no further hope of surviving, they are rescued and brought to the utopistic paradise Shangri-La, a peaceful and plentiful place without illness, war or any type of dispute. Their first sensation is that they are prisoners but along the days, each survivor loves and has no intention to leave the place except George that tries to convince the group to leave Shangri-la.",
         "A plane crash delivers a group of people to the secluded land of Shangri-La -- but is it the miraculous utopia it appears to be?"
      ],
      "budget": 4000000
   },
   "movielensId": 944,
   "movielens": {
      "languages": [
         "English",
         "普通话",
         "Español"
      ],
      "releaseDate": "1937-08-31",
      "dvdReleaseDate": "1999-08-31",
      "directors": ["Frank Capra"],
      "runtime": 97,
      "movieId": 944,
      "title": "Lost Horizon",
      "mpaa": "",
      "actors": [
         "Ronald Colman",
         "Jane Wyatt",
         "Edward Everett Horton",
         "John Howard",
         "Thomas Mitchell",
         "Margo",
         "Isabel Jewell",
         "H.B. Warner",
         "Sam Jaffe",
         "John Burton"
      ],
      "imdbMovieId": "0029162",
      "originalTitle": "Lost Horizon",
      "genres": [
         "Adventure",
         "Fantasy",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["SxKoaIq6DcY"],
      "plotSummary": "British diplomat Robert Conway and a small group of civilians crash land in the Himalayas, and are rescued by the people of the mysterious, Eden-like valley of Shangri-la. Protected by the mountains from the world outside, where the clouds of World War II are gathering, Shangri-la provides a seductive escape for the world-weary Conway.",
      "tmdbMovieId": 3598,
      "avgRating": 3.82227,
      "releaseYear": "1937",
      "numRatings": 1145,
      "posterPath": "/aoXlp2ywUZ31qZO4RLSNUAK6A0l.jpg"
   }
}