{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "warsaw ghetto",
            "id": 2435
         },
         {
            "name": "polish resistance",
            "id": 2436
         },
         {
            "name": "jewish ghetto",
            "id": 2444
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "parachuting",
            "id": 4679
         },
         {
            "name": "military officer",
            "id": 11109
         },
         {
            "name": "espionage",
            "id": 11134
         }
      ],
      "imdb_id": "tt0035446",
      "video": false,
      "title": "To Be or Not to Be",
      "recommendations": [
         1859,
         16305,
         976,
         940,
         777,
         678,
         3529,
         20334,
         887,
         631,
         11898,
         22596,
         3085,
         3086,
         1939,
         28580,
         195,
         14537,
         32255,
         934
      ],
      "backdrop_path": "/p69ybBV94wSmyCGE2y2pH9U86l0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Maria Tura",
               "gender": 1,
               "credit_id": "52fe4225c3a36847f8007ac5",
               "name": "Carole Lombard",
               "profile_path": "/uUjn5WRFxetiG8JLxbzSb1zAnbe.jpg",
               "id": 2491,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Joseph Tura",
               "gender": 0,
               "credit_id": "52fe4225c3a36847f8007ac9",
               "name": "Jack Benny",
               "profile_path": "/hcIPgGIR81NpbBPmRB3xCmJxsMm.jpg",
               "id": 2492,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Leutnant Stanislav Sobinski",
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007acd",
               "name": "Robert Stack",
               "profile_path": "/f1MchlCMVc4LDWEALsodZHPkbIu.jpg",
               "id": 2493,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Greenberg",
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007ad1",
               "name": "Felix Bressart",
               "profile_path": "/x3NDEBpQavuhcV2yFNgm3JK0d5J.jpg",
               "id": 2494,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Rawitch",
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007ad5",
               "name": "Lionel Atwill",
               "profile_path": "/kZOpzski4M8SZLFNozaAgp7Gbgp.jpg",
               "id": 2495,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Professor Alexander Siletsky",
               "gender": 0,
               "credit_id": "52fe4225c3a36847f8007ad9",
               "name": "Stanley Ridges",
               "profile_path": "/uyhntm2ILw55vvyiskDACijuiFv.jpg",
               "id": 2496,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "SS-Gruppenführer Ehrhardt",
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007add",
               "name": "Sig Ruman",
               "profile_path": "/k6w5OsiP6ijrBDACgVn9CzzMri4.jpg",
               "id": 2497,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Bronski",
               "gender": 2,
               "credit_id": "52fe4226c3a36847f8007af9",
               "name": "Tom Dugan",
               "profile_path": "/kcQeZ7chbe3J9jlHjavc64Tp1BO.jpg",
               "id": 2501,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Dobosh, Regisseur",
               "gender": 2,
               "credit_id": "52fe4226c3a36847f8007afd",
               "name": "Charles Halton",
               "profile_path": "/fQqMqIJRMSqQCM6HET2O34hD2Ar.jpg",
               "id": 2502,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Sturmführer Schultz",
               "gender": 0,
               "credit_id": "52fe4226c3a36847f8007b01",
               "name": "Henry Victor",
               "profile_path": "/zuFfbYwaCjXSaVLxZc5Rry7Oxia.jpg",
               "id": 1510,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Anna, Garderobiere",
               "gender": 1,
               "credit_id": "52fe4226c3a36847f8007b05",
               "name": "Maude Eburne",
               "profile_path": "/43MK1AP8pSmx9a48K90Hv8gBLBk.jpg",
               "id": 2503,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007aaf",
               "name": "Edwin Justus Mayer",
               "profile_path": null,
               "id": 2489,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007ab5",
               "name": "Ernst Lubitsch",
               "profile_path": "/fJeGenaTarQTLl21eDlnx4MIM9K.jpg",
               "id": 2428,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007abb",
               "name": "Alexander Korda",
               "profile_path": "/iwUTfD7I6hcBWvx2PdJsCng9xmV.jpg",
               "id": 2490,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007ac1",
               "name": "Ernst Lubitsch",
               "profile_path": "/fJeGenaTarQTLl21eDlnx4MIM9K.jpg",
               "id": 2428,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007ae3",
               "name": "Ernst Lubitsch",
               "profile_path": "/fJeGenaTarQTLl21eDlnx4MIM9K.jpg",
               "id": 2428,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007ae9",
               "name": "Melchior Lengyel",
               "profile_path": "/hR342TUtywssH7wDRYQlZEXfLw1.jpg",
               "id": 2498,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4225c3a36847f8007aef",
               "name": "Rudolph Maté",
               "profile_path": "/gEXhYXdu4yOfuiHfvdA04xGDyp4.jpg",
               "id": 11593,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4226c3a36847f8007af5",
               "name": "Werner R. Heymann",
               "profile_path": null,
               "id": 2500,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5ab84f620e0a263011003982",
               "name": "Irene",
               "profile_path": "/uqKuNQzRIV4OJQztp2AHuhitWuc.jpg",
               "id": 1012329,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5ac3c4c00e0a264a4e0819e6",
               "name": "Dorothy Spencer",
               "profile_path": null,
               "id": 14962,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 7.537933,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 198,
      "vote_count": 148,
      "budget": 0,
      "overview": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
      "similar": [
         423,
         424,
         228150,
         1771,
         289222,
         16869,
         5925,
         2253,
         613,
         637,
         409,
         676,
         14574,
         857,
         339259,
         351339,
         369885,
         289,
         668,
         954
      ],
      "original_title": "To Be or Not to Be",
      "runtime": 99,
      "poster_path": "/ug5R6fdOhud4hbb5O6pn1snSEFJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Artists",
         "id": 60,
         "origin_country": ""
      }],
      "release_date": "1942-03-05",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Ernst Lubitsch"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Melchior Lengyel",
         "Edwin Justus Mayer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0035446/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzQwNTQ5OTkyOF5BMl5BanBnXkFtZTgwMjcyOTgxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Carole Lombard, Jack Benny, Robert Stack | See full cast and crew »"],
      "reviews": [
         "This movie was made before while the US was still playin' both ends against the middle. Makin' huge profits while staying \"neutral\" The film was not allowed to be released until after, the US entered the war. Easily the best of the screen versions. The cast is tight and the timing is impeccable. You can really tell that the cast believed in the film. Since America had not taken a formal stance at the time this went into production the producers, cast, and crew were really making something revolutionary and controversial. So much so that the making of this movie was not even mentioned on the Jack Benny radio program. Which is a major deal for those familiar with Old Time Radio, Jack's film career provided excellent material for comedy writers on the radio show, but also the radio show was an excellent opportunity to promote a movie. It is doubtful that this was a missed opportunity, what is more likely is that his sponsor or perhaps the network did not want to advocate a position. This movie is wonderful for so many reasons. Not only is it hilarious, there is suspense, intrigue, and history. Another poster, mentions the Nazi's jumping out of the plane at the order of a radio transmission by Hitler. The thing to remember here is that the Nazi army was seen as an unstoppable war machine, so efficient, that soldiers would commit suicide if asked. This was less humor than it was to evoke fear of fascism. Everyone remembers Bob Hope and his travels during WWII, well Jack Benny and Carole Lombard were no slouches either. After all they made this movie. Carole died in a plane crash along with her mother and twenty others returning from a war bond rally before the film was released. Jack went where few if any cameras or radio transmitters could reach. He could be found in the most remote parts of the world entertaining the troops. Not to take anything from Bob, he went there as well, he just had more photo ops. Bottom line watch this movie--twice, maybe more, the dialogue is so quick and witty there is a good chance you might miss it the first time, them again it is worth at least to looks.",
         "There is a famous review of this film by the late Sunday Times critic, Dilys Powell which begins 'Is the joke funny?'... what Miss Powell was getting at was that, given the horror of the Holocaust, it is appropriate to laugh at the Nazis. The answer is, ultimately, irrelevant to the viewing of this modest masterpiece. Lubitsch was, by this time, coming to the end of an exquisite career that defined the nature of sophistication in 'light' cinema. 'To Be or Not To Be' skips lightly over all of the minefield of a subject like this and it is difficult or impossible to think of any other filmmaker who might have managed it (if you look at Mel Brooks' limp remake, you can see why). In 1996, I presented a massive season of 'the greatest' films in Belfast for the centenary of cinema - 250 titles in 9 months. Of all of them, this was the film which got the greatest ovation - about 5 minutes with a nearly full house standing and applauding! They may have applauded for many reasons, but here are certainly some of them... The very complicated narrative is presented virtually flawlessly and the comedy is never allowed to hold up the narrative. The principle actors - Carole Lombard (breathtakingly beautiful) and Jack Benny in particular, but many of the supporting cast as well - throw themselves into the affair with a gusto that is completely infectious. Apart from the satirical aspect of the story and the way in which Hitler and the Nazis are mercilessly ridiculed for their authoritarianism and the fear which is their only motivator, the film pokes gentle fun at the vanity of actors in a warm and happy manner. Finally, and most important, is the notion of farce. Farce rarely works in the cinema, but here it does, and in the grand manner - just look at how many times the situation regarding Professor Siletsky changes profoundly during the film - it is dizzying - yet the characters manage to come up with (often self-defeating or inappropriate) schemes on every occasion. This is a wonderful work that, I have no hesitation in saying, is absolutely vital for anyone who wants to really understand the glory of the cinema. But to answer Dilys Powell's question... yes, the joke is deliriously funny.",
         "Comedies rarely stand the test of time - this one does: one of the funniest films I have ever seen. When I was 16 (20 years ago, sigh...), this was re-released for a short time in a local art-house cinema, and my father insisted I go watching it with a friend. Well, teenagers don't normally line up to see 50 year old black and white comedies, but - man, was I glad I did! This is a pitch black comedy that feels as fresh today as it must have then; in fact, this must have been kind of a shock in 1942. There are no cheesy clean characters or cringe-worthy lines: this is a firework of fast, witty dialogue with an edge and the sexiest, cleverest (and most morally ambiguous) female protagonist I have ever seen in a film before the \"New Hollywod\" era. Even the structure and the way the story evolves are very modern; there are flashbacks and twists and turns that might be very common in contemporary films but must have seemed almost \"avant-garde\" at the time. The biggest fun, of course, is how Lubitsch takes the pi** out of Hitler's blind, fanatic followers. I don't believe the Nazis have ever been mocked better than in this comedy masterpiece (and I only hope old Adolf has seen it, too). Mel Brooks' remake is not bad, but the original is simply killer. See it, and then see it again (and again). Priceless. 10 out of 10 Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/ Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/ Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/",
         "In 1940 the American public was shocked when Charlie Chaplin released his first all talkie movie THE GREAT DICTATOR, in which he lampooned Adolf Hitler and Benito Mussolini. Despite the new European war, we were yet still at peace with both Axis states. Hollywood, with rare exceptions (BLOCKADE, CONFESSIONS OF A NAZI SPY, ESCAPE) had been gingerly tackling the Nazis and Fascists. Yet public reaction to THE GREAT DICTATOR was odd. It had a big box office success, and yet many were appalled because it chose to say Hitler could be laughed at. Chaplin's response was that if he had been laughed at to begin with he would never have become such a threat. Actually other voices were beginning to stir in Hollywood. One was the great comedy director Ernst Lubitsch, who poked an occasional jab at the Nazis. Lubitsch had to wait until 1941 for a full assault on the Nazis - TO BE OR NOT TO BE, a film that looked at the German invasion of Poland, and it's occupation of Warsaw. It had an interesting cast. The lead went to Carole Lombard, who had many comedy performances under her belt. She played Maria Tura, the leading lady (and wife) of \"that great actor\" (as he always prefaces his remarks) Joseph Tura. Joseph is Jack Benny. Of all the leading men in her career, Lombard never played opposite one who was really more of a star in a different medium. Typical co-stars for Lombard were John Barrymore, Fred MacMurray, Cary Grant, Ralph Bellamy, William Powell, Robert Montgomery, Clark Gable, and Fredric March. Here it was Benny, who while he had a string of movie credits was basically a radio comedy star (and later would be a television star). His best films (GEORGE WASHINGTON SLEPT HERE, ARTISTS AND MODELS, CHARLIE'S AUNT) were not record breakers at the box office. In fact, while his performances were good in these, he did not necessarily shine in them (Laird Cregar, in one simple moment in CHARLIE'S AUNT, got the biggest laugh of the film). Nobody realized that his performance as Joseph Tura would be his best one, and that within two years he'd make his final starring fiasco in THE HORN BLOWS AT MIDNIGHT. Benny and Lombard proved to work well together as the egotistical, but oddly loving couple of theater hams. In fact the actors making up the Tura company are all good, including Lionel Atwill (who briefly is seen playing Claudius to Benny's Hamlet), Felix Bressart as Greenberg (who dreams of doing the Shylock speech from THE MERCHANT OF VENICE), Tom Dugan as Bronski (who hopes to play Hitler on the stage), Charles Halton as Dubosch (the stage manager, and the head of the Warsaw underground), and Maude Eburne as Lombard's cynical maid Anna. The screenplay did give plenty of time showing the difficulties and tensions of a stage company working together, and of handling temperamental stars and their egos. While putting on a play lampooning the Nazis (whom Benny and the others dislike), the government of Poland (Frank Reicher) says that due to the growing problems with Germany the play can't be produced. So the troop put on Tura's production of HAMLET. Benny as the Prince of Denmark (giving the great soliloquy) goes through the proper steps, although knowing the comedian from Radio one expects him to start it with \"WELL!\". But he finds that a man in uniform (young Robert Stack) leaves his seat in the middle of the third aisles just as he begins, \"To be or not to be....\" He does not know (until later in the film) that Stack had arranged to do this to keep a rendezvous with Lombard in her dressing room. Subsequently he treats her to a plane flight (he is a Polish Air Force pilot). When war comes he and his fellows fight, but the survivors make it to England. The grimmest section of the film is the occupation scenes. Like the comedy in THE GREAT DICTATOR, because we know what actually happened these scenes seem slightly unreal. But in 1941/42 they still get the fears and difficulties of the occupation across. Signs of stores and streets we saw hanging normally earlier are in ruins (including a delicatessen). The theater is boarded up. Had Lubitsch wished to do a tragic film he could easily have done so. But he allows the situation to blossom into a black comedy. Stanley Ridges plays Professor Siletsky, a secret German Agent who has fooled the Allies into going back to Warsaw. He has the names of families of the pilots. Stack is sent back to Warsaw to stop him, and contacts Lombard who helps. Soon the entire theater group gets involved. But will their theatrical egos blow their anti-Nazi plans? That is the running theme of the concluding portion of the film. Also along for the ride is Sig Ruman as Col. Ehrhardt, the Gestapo Chief who relishes the name \"Concentration Camp Ehrhardt\", but who keeps running afoul of Professor Siletsky (it is the Professor, isn't it?), when he makes seemingly harmless comments about Hitler. His reaction is usually to yell for his adjutant, Schultz (Henry Victor), whose whole purpose is apparently to be there to be yelled at. The film was a great success, but the death of Carole Lombard in a plane crash a month after it was shot cast a shadow over it. Yet it was a fitting swan song for that divine comedienne's career.",
         "This comedy excels due to witty dialog and superior direction. Set against the backdrop of Hitler's invasion of Poland, due acknowledgment is made of the tragedy of that event. This was a wartime picture, after all. But the satire serves as a perfect antidote, and \"To Be or Not To Be\" is simultaneously funny and sharp. Right after I watched this movie, I wanted to watch it again--it was that entertaining. The stars and character actors were all superb. Having Jack Benny play the lead was an inspired casting choice. Felix Bressart and Tom Dugan as Greenberg and Bronski, sort of the Rosencranz and Gildenstern of this movie, are hilarious. If you have not yet seen this movie, rent or buy it and treat yourself to a real gem!",
         "Beneath all the one-liners and amusing gags, this classic comedy has an undertone of satire that is quite effective. Jack Benny plays his role with just the right amount of exaggeration for it to work perfectly, and he, Carole Lombard, and the rest of the cast help Ernst Lubitsch to tell a lively yet worthwhile tale. There are a few slow spots early in the movie, but after it hits its stride, everything fits together well. Very few film-makers can make something like this succeed, because they take themselves too seriously. Lubitsch does not, and as a result this film provides a caricatured but relatively insightful portrayal of the Nazis, with a light-hearted yet appreciative look at those who opposed them in the occupied countries. The right kind of lighter touch can sometimes be more effective in commenting on important issues than the heavy, emotionally laden harangues that are all too common. While providing good entertainment, this movie also brings out the Nazis' inherent insecurity, pettiness, and short-sightedness, while also demonstrating their growing capacity for destroying the innocent. For example, the wonderful character actor Sig Ruman is greatly entertaining as a Nazi bureaucrat, yet he also cleverly brings out the pathetic side of such persons. Aside from a couple of good gags, it starts off just a little slowly. A lot of time is spent on Robert Stack's character, who is (through no fault of Stack's) not very interesting. Likewise, the subplot involving him and Lombard takes up a lot more time than it was worth. Other than that, though, it moves briskly, with many entertaining scenes while it develops the story. As the pace picks up, the members of Benny's acting troupe get some fine moments of their own, Benny himself has some fine scenes with several other characters, and everything builds up nicely towards a good finale.",
         "One of the very few people who would think to remake an Ernst Lubitsch picture would be Mel Brooks who satirized just about every genre there was in Hollywood. But I doubt that Jack Benny, Carole Lombard and Robert Stack would have lent themselves to the slapstick type film that Brooks turned To Be Or Not To Be into and Mel's version is very funny. When the film opens the biggest problem that Jack Benny has on his mind is who's this secret admirer who keeps sending flowers to his wife Carole Lombard every night while they're on stage. Although it's helped his Hamlet performance, the angst Benny is feeling about Lombard being faithful, pretty soon Benny, Lombard, Polish airman Robert Stack and the whole touring company that Benny heads are all caught up in the Nazi German invasion of Poland which inaugurates World War II. Stack joins the Polish squadron of the RAF and there's a nice little Polish colony as with other occupied nations during World War II. One of them is Stanley Ridges who does propaganda broadcasts for the BBC. And he gets to be good pals with the airmen. But after he leaves for Germany on a 'secret' mission it's discovered in reality he's a German agent and is going back to Germany with a list of exiled Poles so that the Nazis could retaliate against families. Stack goes back to Poland after Ridges. Where he meets up with Lombard and Benny and the rest their troupe and let's just say that their talents as actors are never more needed than in the series of performances they give the occupying Germans. Whether dealing with marital problems or Nazis breathing down their necks Lombard, Benny, and Stack have no shortage of wits about them. Carole and Jack are old hands at comedy, but Bob Stack showed a nice gift for it as well. Of course Ernst Lubitsch's type of comedy is a great deal more sophisticated than Mel Brooks. He also was making his film at a time when the USA wasn't in the war yet and the outcome for Poland and the rest of the world remained in doubt. Not to mention what was left of a liberal spirit in Germany where Lubitsch was an exile from. This was Carole Lombard's farewell performance. Completed in 1941 To Be Or Not To Be was released just in time for Pearl Harbor and it certainly beats a lot of hastily made propaganda films that came out to tap into the national anger. It also got the same kind of knocks The Great Dictator did in satirizing the authoritarianism of the Nazis. But both films have stood the test of time. And it's not as preachy as The Great Dictator, but Lubitsch gets his point across. As for Lombard she went on a war bond tour which ended abruptly in a plane crash outside Las Vegas. FDR from the White House proclaimed she was as much a war casualty as any GI at the front and there were few who would disagree. If your taste runs to an earthier form of comedy Mel Brooks will certainly satisfy you. But for those who value sophistication as embodied in that phrase the Lubitsch touch, this To Be Or Not To Be still pulls in the laughs.",
         "Joseph Tura and his wife are part of an actors troop in pre-WW2 Poland. When a handsome young pilot is forced to break off his affair with Mrs Tura to go to England and join the RAF, he sends a message through an English agent who offers to take messages to families of all the pilots when he goes to Poland. Realising too late that Professor Siletsky is a double agent taking addresses to the Nazi's, Lt Sobinski alerts Tura who is forced to play several roles to try and outwit the Nazi's and protect the underground resistance. Despite having heard it mentioned (and avoided the remake) I had still never seen this film until earlier today. I wasn't sure what to expect as I knew that it had been made during the war and that it's humour might not seem as mocking or sharp today. However I was surprised how funny it actually was while it also dealt with the Nazi issue at the same time. The mocking tone of the film is balanced nicely by a real vein of wit with sharp word play all around. The plot is kept ticking over by this humour until Tura is able to drive the film by his many performances! The Nazi's are mocked without taking away from the horrors of what they were. The cast are what really makes the film work for me though. Although he takes second billing, I can't help but feel that Benny is the star of the film as he has all the best characters and the lion's share of the lines. Lombard does very well indeed and shows a real ability for quick witty lines \u0096 the fact that she died in a plane crash leaving this her last movie should be considered a great loss. The whole support cast, whether Polish actor or German commander, all play very well managing to bring both wit and pathos to the film. Overall a film that is not as uncomfortable to watch as I suspected it might have been, in fact one that is downright hilarious at times and has all the sharpness and wit that I want in a comedy. When Jack Benny says `so they call me Concentration Camp Ehrhardt' for the 5th time, I defy you not to be rolling!",
         "What a fine film from Ernst Lubitsch. Jack Benny is an egomaniacal famous actor in Warsaw, and Carole Lombard his unfaithful actress wife, when the Nazis take over Poland in 1939. The plot involves secret information, impersonations, spies, clandestine trips back and forth to England, assignations with Carole Lombard, and -- oh, let me recount how the featured assignation works. Lombard is visited in her dressing room by a young and animated Robert Stack, an bomber pilot in the Polish Air Force. He's been sending her flowers for days and is overwhelmed by her presence. He boasts of his exploits and she melts while listening. When he's leaving, after she agrees to see him again, he tells her he's never met a real actress before. She replies in a throaty voice, \"I've never met a man who could drop three tons of dynamite in two minutes before.\" (Lubitsch pulls this stuff off with aplomb.) The agreement is that they will meet again in her dressing room for further conversation, so to speak, during her husband's recital of Hamlet's soliloquy -- \"To be or not to be, that is the question.\" Every high school kid knows it because it's perhaps the best-known line that Shakespeare ever wrote. So, we see the performance of \"Hamlet\" with Robert Stack in the second row. Jack Benny enters, alone, pauses, closes the book he's holding, and looks up soulfully. It's his great moment. \"To be . . . or not to be --\", he begins, and Stack stands up and shuffles his way noisily out to the aisle to be with Lombard. Benny stops talking and gapes at him. This goes on for several nights in a row. Benny has no idea why the same officer stands up and leaves at the same point in the soliloquy. It's driving him nuts. Finally, with the main plot underway, Benny is unable to perform Hamlet again until the end of the movie, on the English stage. He strolls onto the stage in the same puffed-up manner, folds his book, and begins. \"To be . . . or not to be?\" And a British naval officer in the second row shuffles his way out. I don't want to get into this because I'll give away more gags, and the plot is complicated and has several surprises tucked away in it. Sig Rumann gives ample support as a comic Gestapo officer. When the movie first appeared, it was excoriated by some observers who felt that the Nazi conquest of Europe was not in the least fit as a subject for comedy. Fortunately, the Allies won the war and we can now sit back and enjoy this radiant comedy without feeling the guilt of the contemporary audience.",
         "I recall the first time I saw this movie \u0096 how I was gripped by the humor, then by the intrigue about what came next, then by concern that Carol Lombard would be found out, and then back to the humor again. This film has considerable darting between its emotion-inducing scenes. That makes it all the more a great satire and comedy. Of course, I knew it was to be a comedy. What else could it be with Jack Benny and Carole Lombard? Still, a somewhat zany story, with great screen writing and equally great direction by Ernst Lubitsch, was able to hold sway over my viewing. Then we add superb acting all around. Carol Lombard is excellent in her role as Maria Tura. Her humorous lines are very good, but as in many other films, her \"straight man\" role plays perfectly with Jack Benny's Joseph Tura. His are the exaggerated blown-up lines, side glances, smirks and assorted facial expressions that ignite our uproarious laughter. Since my first viewing, I now watch this film for the pure humor and satire, and I watch for the many little subtleties that I often miss in such clever films on first viewing. And, they're not all by the main stars. The movie has several top-flight supporting actors of its day. They are the source of many of the laughs. Most are members of the Polish theater group. Felix Bressart plays Greenberg, Tom Dugan plays Bronski, Charles Halton plays Producer Dobosh, and Lionel Atwill plays Rawitch. Viewers knew for sure that the role of SS Col. Ehrhardt would not be too stern or serious \u0096 with Sig Ruman in the role. Robert Stack is very good in his role as Polish pilot, Lt. Stanislav Sobinski, and Stanley Ridges does well in the straightest role of the film, as Professor Siletsky. \"To Be or Not to Be\" is one of a very small number of films that are genuine satire. Of course, satire is comedy and humor. But it can also be dramatic, action-filled, pathos, empathy and mystery or intrigue. It is most often a combination of these. The comedy is often the release or relief from what the story would be without it. The genius of comedy- satire is its ability to make audiences laugh by its treatment of a subject that most often is not otherwise very funny. Satire can cover any and all aspects of life, but the very best \u0096 and that with unquestionably wide appeal \u0096 is political satire. That's what we have in \"To Be or Not to Be.\" This film is a must for any movie library. It may not be as funny to younger audiences who haven't yet studied the history of the World War II period. The film was made in 1941, before the U.S. entered the war. Because America was still neutral, this movie was considered too controversial so it was held back. It was finally scheduled for release in April, 1942, Then a sad event preceded its opening when Carol Lombard was killed in a plane crash in February. She was just 33 years old."
      ],
      "genres": [
         "Comedy",
         "War"
      ],
      "productionCompanies": ["Romaine Film Corporation"],
      "summaries": [
         "In occupied Poland during WWII, a troupe of ham stage actors (led by Joseph Tura and his wife Maria) match wits with the Nazis. A spy has information which would be very damaging to the Polish resistance and they must prevent it's being delivered to the Germans.",
         "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy."
      ],
      "budget": 0
   },
   "movielensId": 946,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1942-03-05",
      "dvdReleaseDate": "2005-03-01",
      "directors": ["Ernst Lubitsch"],
      "runtime": 99,
      "movieId": 946,
      "title": "To Be or Not to Be",
      "mpaa": "G",
      "actors": [
         "Carole Lombard",
         "Jack Benny",
         "Robert Stack",
         "Felix Bressart",
         "Lionel Atwill",
         "Stanley Ridges",
         "Sig Ruman",
         "Tom Dugan",
         "Charles Halton",
         "Henry Victor",
         "Maude Eburne"
      ],
      "imdbMovieId": "0035446",
      "originalTitle": "To Be or Not to Be",
      "genres": [
         "Comedy",
         "War"
      ],
      "youtubeTrailerIds": [
         "zaC2bWF60A8",
         "-HK2Man04C4"
      ],
      "plotSummary": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
      "tmdbMovieId": 198,
      "avgRating": 3.94545,
      "releaseYear": "1942",
      "numRatings": 1595,
      "posterPath": "/ug5R6fdOhud4hbb5O6pn1snSEFJ.jpg"
   }
}