{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "europe",
            "id": 1295
         },
         {
            "name": "butler",
            "id": 1307
         }
      ],
      "imdb_id": "tt0028010",
      "video": false,
      "title": "My Man Godfrey",
      "recommendations": [
         14675,
         3529,
         24807,
         32255,
         1859,
         3086,
         34106,
         16274,
         31511,
         28001,
         17687,
         911,
         31507,
         20334,
         965,
         195,
         25431,
         198,
         31773,
         29740
      ],
      "backdrop_path": "/kZea9Lwj3lJN8cOWLMQgOWVQAYU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Godfrey",
               "gender": 2,
               "credit_id": "52fe457b9251416c7505801f",
               "name": "William Powell",
               "profile_path": "/p9RKEHo2m3VPoYPejwFkI7PwqZY.jpg",
               "id": 32428,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Irene Bullock",
               "gender": 1,
               "credit_id": "52fe457b9251416c75058023",
               "name": "Carole Lombard",
               "profile_path": "/uUjn5WRFxetiG8JLxbzSb1zAnbe.jpg",
               "id": 2491,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Angelica Bullock",
               "gender": 1,
               "credit_id": "52fe457b9251416c75058027",
               "name": "Alice Brady",
               "profile_path": "/rE7HNowLzB11QwxEiNoZzRGLerq.jpg",
               "id": 125841,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Cornelia Bullock",
               "gender": 1,
               "credit_id": "52fe457b9251416c7505802b",
               "name": "Gail Patrick",
               "profile_path": "/slrbcxt2O7yoq5cZ6r9cdIAi3YB.jpg",
               "id": 98574,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Alexander Bullock",
               "gender": 2,
               "credit_id": "52fe457b9251416c7505802f",
               "name": "Eugene Pallette",
               "profile_path": "/jGPBb0D4Dcuf0HyPnmTXNs9ysxZ.jpg",
               "id": 8728,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe457b9251416c75058033",
               "name": "Jean Dixon",
               "profile_path": "/nzRaV3QzvpZwXnuufTHORWRwHFo.jpg",
               "id": 80238,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Tommy Gray",
               "gender": 2,
               "credit_id": "52fe457b9251416c75058037",
               "name": "Alan Mowbray",
               "profile_path": "/s49NhpPmbn9ZaADRTJJAgDADDZt.jpg",
               "id": 8240,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Carlo",
               "gender": 2,
               "credit_id": "52fe457b9251416c7505803b",
               "name": "Mischa Auer",
               "profile_path": "/qeOEHGEThuu7y9spmH60GdkdTUF.jpg",
               "id": 39801,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mike Flaherty",
               "gender": 2,
               "credit_id": "52fe457b9251416c7505803f",
               "name": "Pat Flaherty",
               "profile_path": "/g1wNobJloszAtbnHe5E3kNQyCE8.jpg",
               "id": 125842,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Faithful George",
               "gender": 2,
               "credit_id": "52fe457b9251416c75058043",
               "name": "Robert Light",
               "profile_path": "/vUu10dmDEXhFu1RmZVTLmqtouUL.jpg",
               "id": 125843,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Socialite (uncredited)",
               "gender": 1,
               "credit_id": "5a6e384a925141076c01f239",
               "name": "Jane Wyman",
               "profile_path": "/nw2qjwNEEJvhJbgqSu9DmqBGY0W.jpg",
               "id": 20391,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457b9251416c7505800f",
               "name": "Gregory La Cava",
               "profile_path": null,
               "id": 74659,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457b9251416c75058015",
               "name": "Eric Hatch",
               "profile_path": null,
               "id": 74660,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe457b9251416c7505801b",
               "name": "Morrie Ryskind",
               "profile_path": null,
               "id": 10792,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "5646ad739251413ae1001731",
               "name": "Charles R. Rogers",
               "profile_path": null,
               "id": 89089,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5646ad7c9251413ae1001736",
               "name": "Charles Previn",
               "profile_path": null,
               "id": 13957,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5646ad85c3a368260c001859",
               "name": "Rudy Schrager",
               "profile_path": null,
               "id": 114280,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5646ad8f9251413acf00188f",
               "name": "Ted Tetzlaff",
               "profile_path": "/1jLw7iUJ5ywMfN8sjyaRwJPpFKq.jpg",
               "id": 4346,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5646ad979251413ad500185a",
               "name": "Ted J. Kent",
               "profile_path": null,
               "id": 2920,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5646ad9fc3a36826010018ff",
               "name": "Russell F. Schoengarth",
               "profile_path": null,
               "id": 29636,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5646ada7c3a3682614001a5c",
               "name": "Charles D. Hall",
               "profile_path": null,
               "id": 3945,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.320085,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13562,
      "vote_count": 88,
      "budget": 656000,
      "overview": "Fifth Avenue socialite Irene Bullock needs a \"forgotten man\" to win a scavenger hunt, and no one is more forgotten than Godfrey Park, who resides in a dump by the East River. Irene hires Godfrey as a servant for her riotously unhinged family, to the chagrin of her spoiled sister, Cornelia, who tries her best to get Godfrey fired. As Irene falls for her new butler, Godfrey turns the tables and teaches the frivolous Bullocks a lesson or two.",
      "similar": [
         1245,
         2758,
         10112,
         146216,
         364689,
         343668,
         192145,
         2503,
         1690,
         238,
         599,
         177677,
         228150,
         207932,
         374720,
         341013,
         8985,
         132363,
         239573,
         2897
      ],
      "original_title": "My Man Godfrey",
      "runtime": 95,
      "poster_path": "/wtfOW7fIxBZWY78rvUoPpWhMSiR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1936-09-17",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Gregory La Cava"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Morrie Ryskind",
         "Eric Hatch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028010/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NTAyMDgzNF5BMl5BanBnXkFtZTgwNTQ1NzIwMjE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: William Powell, Carole Lombard, Alice Brady | See full cast and crew »"],
      "reviews": [
         "I don't want to be one of those \"they don't make 'em like they used to\" people, but I just can't help it when it comes to comedy. We've lost that talent completely, it seems. I can't think of any really great comedies of the past ten years. The golden age for film comedy was the mid 1930s to the mid 1940s (at least for the talkies; silent comedies were a totally different art form). This is also the period of the screwball comedy. My Man Godfrey was one of the first screwball comedies. Films such as Bringing Up Baby and The Lady Eve perfected the form, but My Man Godfrey is nearly as perfect. It isn't quite as funny as Bringing Up Baby nor is it as emotionally resonant as The Lady Eve, but it is funny, it has depression era social commentary (its main theme is identical to Preston Sturges' Sullivan's Travels, beating it by 6 years), and the script is marvelous. The finale is as good as any other comic finale, including the last scene of Some Like it Hot. The actors are also in top form. William Powell is the straight man, and he plays it very well. All the rest are as nutty as ever. Carole Lombard probably gives her greatest performance here (I suppose I shouldn't say that since I've only seen her in one other film; I can only guess at this since it is one of the funniest performances of film history). Gail Patrick is perfectly devious as Lombard's conniving sister. Eugene Pallette is great as their father. Alice Brady, though, steals the show as their mother, a total fruit cake whose protoge, Carlo (Mischa Auer) does nothing but eat the household's food and pound the same couple of notes on their piano. And look for cameos by MGM regulars Franklin Pangborn and Grady Sutton. 10/10",
         "If I was the sort of person who scrutinised every frame of my viewings looking for flaws, then I still wouldn't have issue here because My Man Godfrey has no cracks in its make up. It is perfect cinema from a golden age that we rarely see in this day and age. During a rich peoples socialite scavenger hunt, air head Irene Bullock wins the contest to see who can find a forgotten man, a hobo, and showcase him at the toffs party. She falls for the charisma of down and out Godfrey Parke and gives him the job of Butler to the family Bullock, this of course bemuses the family, even more so when Godfrey turns out to be far more than they originally thought. My Man Godfrey is one of those old classic comedies that has satire at its heart, here the rich are firmly in the target sights of the makers, for it's they who come across as bumbling buffoons, whilst Godfrey the hobo is the one with tact and grace, he is the one they all should take their markers from. Yet as important as the social message is here, it's the brilliant comedy that comes to the fore, this is an electric script benefiting from great work from all involved. William Powell is Godfrey, it's a perfect performance as he is never flustered yet delivering funny lines with caustic impact. Carole Lombard is just precious as the dopey love sick Irene, her interplay with Powell is comedy gold. My favourite of the bunch tho is Eugene Palette as Alexander, the father of this bizarro family, every mannerism and every line out of his mouth had me in stitches. I must also mention that of the 6 Oscars the film was nominated for, I'm stunned there wasn't one for Gail Patrick as Cornelia, it's devilishly icy and weasel like, and she impacted hard on me to the point that I wanted to strangle her, a great performance from her. Truth is, they are all great, from the actors to the director, from the editor to the writer, My Man Godfrey is a truly brilliant film that easily entered my top 100 greatest films list today. 10/10",
         "My Man Godfrey is a classic ensemble film with Carole Lombard and William Powell at the helm. The comedic timing is nearly perfect and the script is a winner. Character actors Eugene Palette and Mischa Auer absolutely shine. Lombard defined screwball with her on and off screen antics. Her portrayal of the rich and flighty (yet ultimately wise) Irene Bullock is one of her best performances. Powell's Godfrey matches her step for step, and Powell does one better by showing us depth in his character rather than play straight man to her every madcap move. The movie is fast-paced and defines the word zany. What is worth noting though is that in many ways it is a commentary of the times by comparing the 'haves' and 'have nots'. I would encourage everyone to watch with more than a comedic eye. Through Godfrey, director Gregory La Cava's film speaks volumes about the conditions of the 1930s. The U.S. was plunged in a depression that forced thousands to the breadlines. The film opens with a treasure hunt and one of the items to find is a forgotten man. The rich set out to the city dump to locate him with no regard for his plight or his dignity. The man they bring back as the prize is Godfrey, who soon is employed by the Bullock family as their butler. Powell and Gail Patrick as Irene's snooty sister, Cornelia, are the antithesis of each other and some of the best social barbs are exchanged between them. Keeping their esteemed place in society is paramount to the Bullock family, and only the father (Pallette) ever seems to worry about money. However, La Cava does not allow the film to wallow in pity for those less fortunate. The film amuses throughout but it is a real art to weave social commentary into a comedy without banging you over the head. La Cava pulls it off beautifully. La Cava, Lombard, Powell, Auer, and Alice Brady all deservedly earned Academy Award nominations. This movie will make you laugh and it should. It is very, very funny. It should also make you think. I suspect if you do both, Mr. La Cava and his wonderful cast will have done their jobs.",
         "The great depression of the 30s, in a way, created inequality in this country. On the one hand, great fortunes were made and many more were lost. In those days Hollywood's idea for escapism was the screwball comedy, with an emphasis in presenting how the privileged classes lived. This was in sharp contrast with what the majority of regular citizens were experiencing. With that background, Gregory La Cava, a man who knew how to entertain an audience, took the direction of \"My Man Godfrey\". In the film we are given, on the one hand, what appears to be a city dump near to Sutton Place, one of the richest areas in Manhattan. We are shown a destitute man, Godfrey, who comes in contact with a couple of rich girls out on a scavenger hunt. Godfrey will change their lives forever. \"My Man Godfrey\" gathered a distinguished cast. William Powell and Carole Lombard were at the pinnacle of their popularity. Both actors exuded charisma in any film they graced with their charming presence. They both left a mark of distinction in this comedy. Both are elegant and sophisticated, and they make us care about the characters they are playing. The best thing about those 30s comedies were the marvelous ensemble casts assembled to support the stars. Thus, one is treated to delicious performances by Gail Patrick, Eugene Palette, Alice Brady, Micha Auer, Jean Dixon and Alan Mowbray. This is a classic film that will live forever.",
         "\"My Man Godfrey\" is truly one of the greatest films of the 20th century. Between comedy and romance, a great moral and wise words are nestled. The film's theme can best be stated by Godfrey's own words: \"The only difference between a man and a derelict is a job..\" The movie really hits home the fact that men are men, job or not. William Powell does a magnificent job at portraying Godfrey, the butler who humanizes derelicts everywhere. The cast is just as fantastic as the story. Carole Lombard does an amazing job at portraying Irene Bullock, the histrionic and comedic daughter of Alexander and Angelica Bullock, played by Eugene Palette and Alice Brady, both of whom do an amazing job as well. Gail Patrick also does great work as Cornelia Bullock,the uptight and bratty sister of Irene. Jean Dixon and Mischa Auer absolutely steal the show as the Bullocks' hysterical maid and protégé (respectively). The film is definitely a 10...rent it today!",
         "Why it did not receive a Best Picture nomination is a mystery to me. This is an excellent screwball comedy with a sane & socially conscious message. Although the whole cast is flawless, I would give a slight edge to Alice Brady. She did not win the Oscar in 36, but did win in 37 for \"In Old Chicago\". She had one of the best lines in the movie when speaking to one of her daughters 'It took me all these years to realize insanity runs on your father's side'. Eugene Pallete is excellent as the father & should also have been nominated. This is the only movie I can remember watching with Carole Lombard & she illuminates the screen in every scence. A must! 10/10",
         "For his second Academy Award nomination for Best Actor William Powell was loaned to Universal for My Man Godfrey. At the time this film was made there was a lot of buzz about Powell working with Carole Lombard who only a few years earlier he had been married to. They needn't have worried. The split was an amicable one and Powell and Lombard got along great on the set and created along with Director Gregory LaCava one of the classic screwball comedies of the Thirties. In fact My Man Godfrey got a whole host of nominations, for LaCava for Best Director, for Carole Lombard, for Mischa Auer for Best Supporting Actor and Alice Brady for Best Supporting Actress. In the very first year of the Supporting categories, My Man Godfrey had nominees in all the acting categories, but failed to win any awards. Curiously enough, it wasn't nominated for Best Picture. The Bulloch sisters Carole Lombard and Gail Patrick a pair of ditzy society girls are on a scavenger hunt which takes them to the city dump where they are to find a forgotten man. The expression is taken from Franklin D. Roosevelt who called those who were out of work and without hope forgotten men. The phrase had a lot of currency back in the day. In fact My Man Godfrey's origins are rooted in the Depression Years. When Powell turns down Patrick's invitation to be her trophy in the scavenger hunt, he accepts Lombard's. It turns out he's no ordinary forgotten man, he is the heir to a large estate held by a prominent Boston WASP family. But that's a fact he conceals from the Bulloch sisters when he's hired as their butler. His time with the Bulloch family is a learning experience indeed for both of them. The Depression hasn't hit these two girls, but it almost does save for Powell's financial acumen. As I said the film is firmly ground in those years of the Depression and the New Deal. It's hard to fathom, but when FDR took office on March 4, 1933, twenty five percent of the workforce was unemployed. Today if the number reaches above five percent the doomsayers are calling it a depression. I remember an uncle of mine telling me that when he graduated high school in 1937 a year after My Man Godfrey he could not get work for over 2 years until America went on a war footing before Pearl Harbor. After that he got drafted and didn't have to worry about a job for a few years. He might have been living just like the men in the city dump, but for the fact my grandparents had jobs and kept a roof over everyone's head. Mischa Auer plays Carlo, a kind of permanent houseguest of Alice Brady as Mrs. Bulloch. In today's world long after the Code has been repealed, Auer might well have been more explicitly gay. Eugene Palette is Mr. Bulloch who freely admits he lives in a house of scatterbrains. Though he got no nominations his playing of the Bulloch patriarch set a standard for him in playing a host of put upon fathers. In 1957 My Man Godfrey was remade with David Niven and June Allyson co-starring. Neither of the leads lacked for the charm needed to put over the story, but instead of The Great Depression, David Niven is an illegal alien looking to get a visa. You don't quite feel for him as you do for the jobless and hopeless William Powell. If My Man Godfrey is ever remade in the modern era, let's hope they keep the economic underpinnings of this classic screwball comedy, even if they don't take it back to the Depression Years.",
         "This movie is my champion for the golden age of movies versus today's cinema. \"Godfrey\" has pratfalls and funny situations, yes, but, it values a sly remark and character development over the cheaply-gotten laughs which seem to inundate modern comedies. A case in point is Carlo, the \"protege\" of the flighty matron of the family. Every time he is attacked by the gruff patriarch, who is rightfully angry at him for leaching off the family's good will, not to mention its money, Carlo utters a sigh so heavy and heavily-acted, that you'd think his dog had died. The mother of the family comes to his defense, admonishing the father 'You must remember that Carlo is sensitive.' Hilarious stuff! The performance of the character actors in \"Godfrey\" alone merit several viewings, but the movie also sports \"Mr. Urbanity\", William Powell. Though I think he is wonderful as \"The Thin Man,\" I often wish he had not done so many sequels, saving his talent for well-written comedies like this one. (By the way, another wonderful comedy of this ilk is \"Libeled Lady\" with Myrna Loy, who, in my humble opinion is the epitomy of class; these two together make a dazzling combo). Powell is glorious in this role. Much of the comedy comes from the fact that he is a butler serving those in a social class to which he used to belong (before the stock market crash). They hire him almost as a joke, thinking him beneath the job, when, in reality, he is highly educated, and, from a family equal or higher than they in social status. Carole Lombard is adorable in her role of the ditzy younger sister who falls for Godfrey and goes to outrageous lengths to win his heart. Much of what she says makes no sense at all, but she is so precious, you can't help loving her anyway. The actress playing the older sister is great as well as the sophisticated but snobbish socialite who will stop at nothing to get what she wants, and then rationalize that she deserves it just because she was born into high society. She develops a crush on Godfrey as well which makes for interesting conflict in the film. But, once again, the unsung stars of this film are the writers and director. There is so much humor packed into a single word or even a well-placed pause. All concerned have created an amazing piece of entertainment. I long for the day when good writing will come back to comedy, but while wading through the drivel that is another inevitable and interminable Jim Carey/Adam Sandler/Chris Farley (they are all inter-changeable to my mind) debacle, I revel in the thought that movies like \"Godfrey\" have been made in the past, and just might be made again.",
         "\"My Man Godfrey\" successfully blends the two most prominent schools of film comedy from the 1930's: `sophistication' and `screwball.' It smears the conservative upper-crust milieu with the keen eye of `Dinner at Eight' and the pie-in-your-face irreverence of `You Can't Take It with You,' with as many witticisms as either and probably more sexual innuendos. Occasional predictability keeps it from being on par with \"It Happened One Night\" or \"Trouble in Paradise,\" but it is still one of the most emblematic films of its era. William Powell is pitch perfect as Godfrey Parke, the hobo-turned-butler, breezing effortlessly through every scene. Carole Lombard also turns in one of her most cherished performances as Irene Bullock, the spoiled socialite who pretends to enjoy her wealth but really just wants to be around someone human. As their relationship progresses, Godfrey's humility rubs off on Irene and ultimately frees her from her elite family, which offered her security but only made her unstable. `My Man Godfrey' has no mercy on the aristocracy of the \u009130's, skewing it as socially incompetent and morally bankrupt. `All you need to start an asylum is an empty room and the right kind of people.' How terribly true.",
         "I've seen this comedy many times and never get tired of it. Saw it again today on TCM TV, and still get a kick out of it. The spoiled brats of wealthy family man, played by Eugene Pallette, have hired Mr Godfrey as their butler. Carole Lombard and Gail Patrick are the jealous sisters who contrive to win his affections. There is much clutter and romping and confusion, but it all comes out at the end. Mischa Auer plays his usually outrageously funny character. I remember what a hit it was in 1936, and heartily recommend it today!"
      ],
      "genres": [
         "Romance",
         "Comedy"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "In the depths of the Depression, a party game brings dizzy socialite Irene Bullock to the city dump where she meets Godfrey, a derelict, and ends by hiring him as family butler. He finds the Bullocks to be the epitome of idle rich, and nutty as the proverbial fruitcake. Soon, the dramatizing Irene is in love with her 'protege'...who feels strongly that a romance between servant and employer is out of place, regardless of that servant's mysterious past...",
         "In New York post-Great Depression, the spoiled socialites Irene Bullock and her sister Cornelia Bullock are disputing a scavenger hunt where the winner is the one who brings a \"forgotten man\" first. They go to the city dump and Cornelia offers five dollars to the derelict Godfrey Smith to go with her and her companion to the Wardolf Hotel. The man pushes her in the garbage and Cornelia leaves the landfill with her companion. However, Irene talks to Godfrey that she wanted to beat Cornelia to it and he accepts to go with her to win the prize. Irene offers the position of butler to Godfrey and tells her parents Alexander and Angelica Bullock that she has hired Godfrey to work for their dysfunctional family in their mansion. Irene has a crush on Godfrey and protects him while Cornelia hates him and wants to harm him. During a party in the Bullock's house, the Harvard graduated investor Tommy Gray recognizes Godfrey and salutes him. But the butler asks him to keep the secret of his past and schedules an encounter in the restaurant to explain what is happening.",
         "During the Depression, rich socialite Irene Bullock meets hobo Godfrey while participating in a high society scavenger hunt. He accompanies her and she wins the contest. Godfrey himself is appalled at their conduct and a guilty Irene offers him a job as her butler. He shows up the next day, properly dressed and ready to go to work. He's warned by the maid Molly that entire Bullock family all all a bit batty. Godfrey learns that the maid's assessment is mild, if anything. Despite his odd employers, Godfrey likes his job and has every intention on continuing in the position. He does have a secret however - he's really a very rich man who decided to drop out of society after a love affair gone wrong. When Irene falls in love with him, he's really not interested in pursuing another relationship. She doesn't know how to take no for an answer however.",
         "Godfrey is \"forgotten man\" who is hired by a young, wealthy eccentric as the family's new butler. Godfey brings sanity a dose of reality to this spoiled rich family.",
         "A scatterbrained socialite hires a vagrant as a family butler...but there's more to Godfrey than meets the eye."
      ],
      "budget": 656000
   },
   "movielensId": 947,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-09-17",
      "dvdReleaseDate": "2001-07-10",
      "directors": ["Gregory La Cava"],
      "runtime": 95,
      "movieId": 947,
      "title": "My Man Godfrey",
      "mpaa": "",
      "actors": [
         "William Powell",
         "Carole Lombard",
         "Alice Brady",
         "Gail Patrick",
         "Eugene Pallette",
         "Jean Dixon",
         "Alan Mowbray",
         "Mischa Auer",
         "Pat Flaherty",
         "Robert Light",
         "Jane Wyman"
      ],
      "imdbMovieId": "0028010",
      "originalTitle": "My Man Godfrey",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "6zkZd9GkxWc",
         "ImP-PLcqjcc"
      ],
      "plotSummary": "Fifth Avenue socialite Irene Bullock needs a \"forgotten man\" to win a scavenger hunt, and no one is more forgotten than Godfrey Park, who resides in a dump by the East River. Irene hires Godfrey as a servant for her riotously unhinged family, to the chagrin of her spoiled sister, Cornelia, who tries her best to get Godfrey fired. As Irene falls for her new butler, Godfrey turns the tables and teaches the frivolous Bullocks a lesson or two.",
      "tmdbMovieId": 13562,
      "avgRating": 4.03398,
      "releaseYear": "1936",
      "numRatings": 1957,
      "posterPath": "/wtfOW7fIxBZWY78rvUoPpWhMSiR.jpg"
   }
}