{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "burlesque",
         "id": 163070
      }],
      "imdb_id": "tt0036094",
      "video": false,
      "title": "Lady of Burlesque",
      "recommendations": [
         38468,
         28439,
         94241,
         38465,
         110790,
         152986,
         99627,
         112842,
         50072,
         41033,
         43901,
         38467,
         60566,
         33394
      ],
      "backdrop_path": "/hnLDalyAZpTX2reKYo26poFHD0p.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dixie Daisy",
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143c65",
               "name": "Barbara Stanwyck",
               "profile_path": "/yY2CrbaTyKpmmuUeSu57Wsf2aHk.jpg",
               "id": 14974,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Biff Brannigan",
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143c7b",
               "name": "Michael O'Shea",
               "profile_path": "/3mV23NUxmaSXjDAzUbwRblaXCa9.jpg",
               "id": 124851,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Gee Gee Graham",
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143c7f",
               "name": "Iris Adrian",
               "profile_path": "/lLZZYHBg14NJ9aUt7BqeCQri36q.jpg",
               "id": 34509,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Inspector Harrigan",
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143c83",
               "name": "Charles Dingle",
               "profile_path": "/d4kGUpmQi9pFt7ffs3K78JsyCr5.jpg",
               "id": 89813,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "S.B. Foss",
               "gender": 0,
               "credit_id": "52fe47b4c3a36847f8143c87",
               "name": "J. Edward Bromberg",
               "profile_path": "/l9OUS1NA2Wt2O6oP9Dk5gga7SiW.jpg",
               "id": 89999,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "'Stacchi' Stacciaro",
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143c8b",
               "name": "Frank Conroy",
               "profile_path": "/qaRzzjKlMHBOUB5QGp6Tib0Y7Ad.jpg",
               "id": 14658,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lolita La Verne",
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143c8f",
               "name": "Victoria Faust",
               "profile_path": null,
               "id": 120783,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Dolly Baxter",
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143c93",
               "name": "Gloria Dickson",
               "profile_path": "/3KsCJD1gJ5VygsCKjWNTMnCBLX4.jpg",
               "id": 95295,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Alice Angel",
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143c97",
               "name": "Marion Martin",
               "profile_path": "/ci5vfUjqZxm8y27tr1pMKHto7fi.jpg",
               "id": 85900,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Russell Rogers",
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143c9b",
               "name": "Frank Fenton",
               "profile_path": "/fEb36oG3aN2hDnuDx7LJOQJtnbx.jpg",
               "id": 135356,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "The Princess Nirvena",
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143c9f",
               "name": "Stephanie Bachelor",
               "profile_path": "/eIu9vN30Uk3ysaam5XjuZwfNgiW.jpg",
               "id": 106553,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Officer Pat Kelly",
               "gender": 0,
               "credit_id": "52fe47b4c3a36847f8143ca7",
               "name": "Eddie Gordon",
               "profile_path": null,
               "id": 1052815,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Janine",
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143cab",
               "name": "Janis Carter",
               "profile_path": "/dNSCg7pX3YcQNVRBxfd6A4vog5M.jpg",
               "id": 96300,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Moey, the Candy Butcher",
               "gender": 0,
               "credit_id": "52fe47b4c3a36847f8143caf",
               "name": "Lou Lubin",
               "profile_path": "/3Uxzu165PZ7pyzCu0sc9hgi1sce.jpg",
               "id": 120554,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Mandy",
               "gender": 0,
               "credit_id": "55e98900c3a3682c5f00616f",
               "name": "Pinky Lee",
               "profile_path": "/eX0x0MUdLXskVQGgsm1Ka7A7Kpm.jpg",
               "id": 1238725,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143c6b",
               "name": "William A. Wellman",
               "profile_path": "/m0RSN7IQTXF9ZFUrqoZJUzZqu02.jpg",
               "id": 14643,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143c71",
               "name": "Gypsy Rose Lee",
               "profile_path": "/3PrGQx9ZODRYc2EoZqzybhEtU24.jpg",
               "id": 82498,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b4c3a36847f8143c77",
               "name": "James Gunn",
               "profile_path": null,
               "id": 111435,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143cb5",
               "name": "Hunt Stromberg",
               "profile_path": null,
               "id": 109853,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143cbb",
               "name": "Arthur Lange",
               "profile_path": null,
               "id": 100579,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b4c3a36847f8143cc1",
               "name": "Robert De Grasse",
               "profile_path": null,
               "id": 33413,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b4c3a36847f8143cc7",
               "name": "Joseph B. Platt",
               "profile_path": null,
               "id": 3387,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b4c3a36847f8143ccd",
               "name": "Bernard Herzbrun",
               "profile_path": null,
               "id": 29637,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143cd3",
               "name": "Natalie Visart",
               "profile_path": null,
               "id": 960148,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe47b4c3a36847f8143cd9",
               "name": "Edith Head",
               "profile_path": "/63ZeXQOh26sGa8nTbYWntieyWrz.jpg",
               "id": 4350,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.190274,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50001,
      "vote_count": 10,
      "budget": 0,
      "overview": "After one member of their group is murdered, the performers at a burlesque house must work together to find out who the killer is before they strike again.",
      "similar": [
         42297,
         70233,
         43600,
         39949,
         462721,
         304840,
         39391,
         439114,
         35436,
         429762,
         62507,
         162040,
         218674,
         173842,
         218404,
         198146,
         139922,
         348573,
         152417,
         50948
      ],
      "original_title": "Lady of Burlesque",
      "runtime": 91,
      "poster_path": "/ry8Uask7c7cK1LFE5jGzs9xExic.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Hunt Stromberg Productions",
         "id": 5235,
         "origin_country": ""
      }],
      "release_date": "1943-06-01",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Mirth! Murder! Melody! Mystery! and Girls! Girls! Girls!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William A. Wellman"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Gypsy Rose Lee",
         "James Gunn"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036094/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzM4NzM2MTkyN15BMl5BanBnXkFtZTcwNTA2ODU0NQ@@._V1._CR46,40,263,407_SX214_AL_.jpg",
      "actors": ["Stars: Barbara Stanwyck, Michael O'Shea, J. Edward Bromberg | See full cast and crew »"],
      "reviews": [
         "The most surprising thing about LADY OF BURLESQUE was that it got made at all. Burlesque was all but dead by 1942, shut out of most towns and cities by relentless moral crusaders, and Hollywood itself was mired in the infamous \"production code,\" which put a heavy lid on what could and could not be shown on screen. But burlesque had spawned a number of stars who remained favorites with public, and in 1941 the legendary Gypsy Rose Lee penned a book called THE G-STRING MURDERS. It proved extremely popular, and a year later United Artists took a chance on the film project. True enough, the movie couldn't show the strippers in action or play out the bawdy comic sketches so popular in burlesque, but writer James Gunn turned in a superior script, and director William Wellman and his cast gave the whole thing tremendous dash and style. The result was a movie that captured the seedy, underworld-edged world of burlesque without actually causing censors to yank it from distribution. In theory, LADY OF BURLESQUE is a murder mystery, but mystery takes a back seat to the brawling backstage antics of crossed love affairs and star rivalry. Barbara Stanwyck endows star stripper \"Dixie Daisy\" with her own memorable brand of tough class--and although she can only be shown from the waist up when she bumps and grinds, she still manages to tear strips off her musical number \"Play It On The G-String.\" The rest of the cast is equally memorable, many of them burlesque stars in their own right. Pinky Lee (Mandy) is memorably teamed with Marion Martin (Alice Angel) to delightful effect; Iris Adrian (Gee-Gee)is the gum smacking brash blonde to end all gum smacking brash blondes; and such memorable character actors as Michael O'Shea (Biff), Gloria Dickson (Dolly), and J. Edward Bromberg (Foss) round out the cast superbly. Sad to say, LADY OF BURLESQUE has fallen into public domain, and it has not been well preserved. I have seen several releases of the film, and all of them are plagued with breaks in the film and the soundtrack. LADY OF BURLESQUE may never be regarded as a \"great\" film, but it is an extremely entertaining one, particularly for those who already know something about the now-lost world of burlesque. As one character says, \"Makes me want to leave the wife!\" Recommended. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "Gypsy Rose Lee wrote several mystery novels. The most famous is \"The G-String Murders\", from which \"Lady of Burlesque\" was adapted. The novel is delightful, as many have noted, opening a window onto a lost world of performances and the lives of those who peopled it. Director William Wellman and writer James Gunn combined their talents with Bernard Herbzrun's inspired art direction to produce a wonderfully-mounted B/W classic of images, characters and mystery here. Heading the cast are dynamic Barbara Stanwyck, Marion Martin, Pinky Lee, J. Edward Bromberg as the policeman on the case and Michael O'Shea as the brash but lovable comic who pursues Stanwyck. The storyline involved rivalries, pretensions and tensions among the ladies of a burlesque troupe; the plot is about respect and how the characters plan to obtain it. The entry of a murderer into the performers' insular and fascinating world of performing and being apart from a society which finds them amusing, exotic and unknowable makes this an interesting \"island\" vehicle, one used for examining and exampling human values, ideas and actions. The rooftop sequences are still stunning; I find that the human values retain their potency to move and to interest. Stanwyck is marvelous, O'Shea and Pinky Lee perfect. Marion Martin and Iris Adrian, as well as Bromberg, get everything out of their parts that is there, and then some. One-of-a-kind because of Miss Lee's authenticity. faithfully reproduced on screen with swift pace and intelligence. Highly recommended for its atmosphere and for much, much more.",
         "What could that mean? Well, Craig Rice ghost-wrote the novel \"The G-String Murders\" for Gypsy Rose Lee (though it's obvious GRL had a hand - the backstage burlesque atmosphere of the book is REALLY good). Good book - fun to read. It has been reprinted several times in the 70s or so, so copies aren't as hard to come by as they might be. The G-String Murders, in turn, became the movie Lady of Burlesque, which is one of my all-time favorite films. In the movie, Dixie Daisy (Barbara Stanwyck) is a rising star in burlesque who gets involved when murders start cropping up in the theatre she's just come to work for. Throw in a touch of romance and dialog that's just about as spicy as it can be without being censored (which isn't saying much - the censors were pretty tough), and the movie is really fun all 'round. If the humor on stage is lame, well, that's burlesque - in fact, the routines in the movie are classic burlesque routines, performed (at least in part) by classic burlesque comedian Pinky Lee (\"Ooh, you make me so ma-a-ad\"). 'nuff said. A couple of interesting changes from the book (without giving anything away): The lead character in the book is Gypsy Rose Lee herself, renamed Dixie Daisy for the movie. (To show you the power of the censors) In the book, the lead dancers complain about the toilet in their dressing room being broken. In the movie - it's a sink. On the other hand, until you actually see the sink, it could be either - they only refer to it as \"the antique\", \"the porcelain\" etc., probably as a nod and a wink to everyone who'd read the book. Kudos to the screenwriter, too.",
         "Did the movies ever produce a trouper more versatile than Barbara Stanwyck, a seasoned pro who not only could do anything handed to her but did them all superlatively well? Her long career encompasses melodramas, weepers, screwball comedy, noir, even Westerns. In Lady of Burlesque she sings, breaks into a variety of dance steps, and even turns a cartwheel (and if a stunt double did it for her, the editing is virtuoso). She's far and away the best thing in the movie, which is saying a lot: Lady of Burlesque is a breakneck carnival ride of a movie. It's based on The G-String Murders, a light mystery penned by society stripper Gypsy Rose Lee (her own story became legend in Gypsy, and her sister. Baby June, became actress June Havoc). But the mystery emerges late and, like the obligatory love angle, doesn't unduly detract from the movie's main business, which is a salty and affectionate reminiscence of the autumn of vaudeville's ne'er-do-well stepsister, burlesque, set, like all the best show-biz stories, backstage. William Wellman gets things popping right off the bat, in a Ziegfeld-Follies like number in which one of the prancing chorines keeps trying to blow her Veronica-Lake locks out of her face. Then there's a fast seque into Stanwyck's `Take It Off The E-String (Play It On The G-String),' then upstairs to the horror of a dressing room where the big, pale girls gussy themselves up and rip one another up one side and down the other. Their smart, snapping mouths recall the bitchiest exchanges in Stage Door, another racy peek into stage life after the curtain's rung down (among the grind-house queens are Iris Adrian, Victoria Faust, Janis Carter and Stephanie Bachelor). Another dressing room houses the men \u0096 the comics with their wide pants and tiny hats (Pinky Lee among them); Wellman even throws in some of their hoary routines but counterpoints them against offstage action to offset their stale-popcorn fustiness. Police raids and gangster boyfriends, professional jealousies and box-office worries play as much a role in the movie as a series of ecdysiasts strangled with their own beadwork. With Wellman at the helm and an enviable if not, apart from Stanwyck, especially starry cast, Lady of Burlesque delivers lots more than it promises.",
         "I did once read the book \"The G-String Murders\" and want to make a few things clear: in the book the character name of Dixie Daisy is \"Gypsy Rose Lee\". If I recall correctly, the book was amusing but thin and the movie is a considerable improvement on it. Also, if I recall correctly, Gypsy was an \"intellectual\" stripper who showed a minimum of skin and so the movie was not inaccurate in that respect. Stanwyck showed, not only versatility, but a considerable amount of warmth in the part of Dixie, qualities which the original Gypsy also had. (I had a friend, now deceased, who worked with Gypsy for a time and he spoke about her a great deal and with much admiration.) I thought Michael O'Shea was excellent as the comic Biff and Pinky Lee fit into the backstage ambiance beautifully. The \"mystery\" was of almost no interest but this is besides the point. The photography was also very interesting and added to the sleazy backstage atmosphere.",
         "Director William A. Wellman gives us Lady of Burlesque a boisterous whodunit played out in an old burlesque theatre. Based on Gypsy Rose Lee's novel The G-String Murders theres plenty of humor surrounding the murders with wisecracks left and right. Theres some bumps and grinds but no stripping due to the movie code at that time. Of course we have the wonderful Barbara Stanwyck here who dazzles us with some neat song and dance routines. Also a lovely bunch of beauties in scanty costumes including gum snapping Gee Gee (Iris Adrian), troubled Dolly (Gloria Dickson), gorgeous Alice (Marion Martin), Lolita (Victoria Faust) and Princess Nirvena (Stephanie Bachelor) both delightfully bitchy. Theres also Michael O' Shea and Pinky Lee involved in the mystery and humor at the old former opera house. So \"Take It Off The E-String, Play It On The G-String\" (song) and have a good time. Oscar nominee for Best Score.",
         "I'd never seen this film, and now I'm sorry it's taken me so long to catch up with it. It's a wonderfully rich look at life in a burlesque house, with Barbara Stanwyck as the star stripper and a great supporting cast of chorus girl types (including the incomparable Iris Adrian as her best friend). Stanwyck sings, I think for the only time on film, and dances with an impressive athleticism. And the scenes backstage and during the police interrogation, with the performers in a variety of outlandish costumes, have a wonderfully surreal quality reinforced by the films hermetic qualities (even the exteriors were shot on the sound stage). But what's really wonderful about the film is the depiction of the burlesque people as an extended family who overcome their differences and pull together when the future of their theatre is threatened. With the preponderance of women in the dressing room, the film is also surprisingly ahead of its time in its depiction of female bonding. It really deserves the same cult status as Dorothy Arzner's \"Dance, Girl, Dance.\"",
         "Nothing deep here, but that's good. A light-hearted comedy in the guise of a mystery. Don't expect to be mystified, the \"mystery\" only serves as a vehicle for the comedy and a rather believable romance. Barbara Stanwyck, though 36 years old, looks much younger. Her part was rather vivacious, risque, and revealing for a 1943 movie. The lady could act! The image on the DVD is generally very good, but there are several places where a few \"frames\" are missing, causing disquieting \"jumps\", but still, a good investment of time, if only to enjoy watching Miss Stanwyck smile and wiggle.",
         "Geeeeee! I just saw this on Turner Classics for the first time since I was a kid when you went to the movies 'cause there was no television in the homes in those days. Everything was radio, or a 78 rpm record player, and as teens we would sneak into the Gayety Burlesque House here in Cincinati to watch Rose La Rose perform. This may be going off on a tangent, but Bob Edwards, the head of A.G.V.A. (American Guild of Variety Artists in which I was a performing member; no, I was not in Burlesque) told me about the time that the manager of the Gayety called him and said the musicians went on strike and that he was needed. Of course, he didn't know what he could possibly do, but he told the manager to find something to play music so they hooked up a radio, and the dancers would dance to whatever kind of music they could find and Bob said he went down to the theater in hot pursuit. So, he got there just in time for the star stripper to do the finale to the show and just as she got ready to go into her bumps and grinds, the music stopped, and a voice came over the theater system saying, \"Have you had a rough day? Has it made you tense? Then bare it all with Bayre Asprin!\" Well, Bob said he grabbed the curtain backstage and almost tore it down trying to stand up and laugh at the same time. The star stripper was not amused! So, here we have Barbara playing Gypsy Rose Lee, of course, because it's known that the first first novel someone writes is always an autobiography with a changed name, and for Gypsy's G-String Murders turned into Lady of Burlseque. They had to change the name in those days! It's lucky that the books title got mentioned on the screen seeing the power that The Hayes Office had for decency in those days! So, we have a different Barbara here. We have her singing in Burlewque, yes that's her singing, and she's dancing, doing cartwheels and playing straight-man to all the comics and turning in quite a remarkable performance. There are only two movies that she has made that I really like, this one and Christmas in Conneticut which has become a Christmas Classic to enjoy during the Christmas Holiday! They tried to re-make Christmas in Conneticut a few years ago. Big flop! Please, will the God of Burlesque never let them re-make Lady of Burlesque? Between this movie and Gypsy with Rosland Russell and Natalie Wood playing Gypsy Rose Lee, these are my two favorite Burlesque movies of all time! It's just a shame that they didn't have a Guitar Playing Female Singer in the cast which reminds me of the time that I was doing this show and this girl was on before me and she was playing her guitar and singing and all of a sudden she broke one of the strings on her guitar and not realizing it, she said, \"Oh, my God! I just broke my G-string!\" Brought the house down and I'm suppose to go on after that? Ah, the trials and tribulations of show business! Those great days are gone forever, but great are the memories!",
         "William Wellman, the man who brought you NOTHING SACRED, BEAU GESTE, ROXIE HART, THE PUBLIC ENEMY, A STAR IS BORN, and WINGS, brings you this neglected gem starring the one and only Barbara Stanwyck. Available for some reason in a thousand cheapie video bins for under five bucks, this 91 minute classic B-movie puts the B in sublime. An A-list group decided to adapt Gypsy Rose Lee's exploitation sex - murder - laughs novel for the silver screen, and the sheer joy brought to the tawdry enterprise somehow transmutes the base material - the murder plot was creaky for 1943 - into show-biz gold. When you think of old-fashioned entertainment, you are picturing LADY OF BURLESQUE, in which a maniac is killing the show-girls in a run-down burlesque theater, and a baggy-pants comic steadfastly pursues Barbara Stanwyck with wisecracks and dutch-treat dates. The real stars are the burlesque performers, lovable freaks from the Hollywood gutter spouting a hard-bitten patter with the nano-second timing of people who'd been doing this since their parents dragged them onto the vaudeville stage when they were three. Stanwyck was the only major screen queen from the thirties and forties who specialized in hopelessly vulgar heroines (see STELLA DALLAS and BABY FACE), but here she's the class act because she's the only one not trying to be classy. Her love interest is the wonderful Michael O'Shea, who plays the false nose comedian who falls for Stanwyck. Stanwyck puts a spin on the word \"comic\" that makes it sound like a four letter word. One scene above all others stakes this movie's claim to greatness - while in the middle of a hoary old comedy sketch, Stanwyck and O'Shea are interrupted by the off-stage wailings of a stripper being beaten up by her thug boyfriend. No one backstage will stop the brutality because they're all scared of the thug, so the onstage performers strike up the band and try to drown out the screams with an up-tempo musical number and improvised jitterbugging. Note, too, the big built blonde with the lisp who declares of the most recent murder \"How gruethome!\""
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Music",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": ["Hunt Stromberg Productions"],
      "summaries": [
         "Sassy Dixie Daisy is the hot new attraction at a former opera house that's been turned into a burlesque theater. She's popular with the customers, although not with Lolita La Verne, a stuck-up diva who was hoping she'd get the top spot. Also complicating matters is the return of the Princess Nirvena, the show's former star who once had a fling with the boss. When the Princess blackmails her way into the top spot, Dixie is none too pleased. When both Lolita and the Princess are murdered, Dixie becomes a prime suspect. She then sets up a trap to nail the real killer.",
         "After one member of their group is murdered, the performers at a burlesque house must work together to find out who the killer is before they strike again."
      ],
      "budget": 0
   },
   "movielensId": 958,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1943-06-01",
      "dvdReleaseDate": "2004-05-25",
      "directors": ["William A. Wellman"],
      "runtime": 91,
      "movieId": 958,
      "title": "Lady of Burlesque",
      "mpaa": "",
      "actors": [
         "Barbara Stanwyck",
         "Michael O'Shea",
         "Iris Adrian",
         "Charles Dingle",
         "J. Edward Bromberg",
         "Frank Conroy",
         "Victoria Faust",
         "Gloria Dickson",
         "Marion Martin",
         "Frank Fenton",
         "Stephanie Bachelor",
         "Eddie Gordon",
         "Janis Carter",
         "Lou Lubin",
         "Pinky Lee"
      ],
      "imdbMovieId": "0036094",
      "originalTitle": "Lady of Burlesque",
      "genres": [
         "Comedy",
         "Thriller",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": ["IOibSeDyrMo"],
      "plotSummary": "After one member of their group is murdered, the performers at a burlesque house must work together to find out who the killer is before they strike again.",
      "tmdbMovieId": 50001,
      "avgRating": 3.12019,
      "releaseYear": "1943",
      "numRatings": 104,
      "posterPath": "/ry8Uask7c7cK1LFE5jGzs9xExic.jpg"
   }
}