{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "self-destruction",
            "id": 1824
         },
         {
            "name": "unrequited love",
            "id": 10048
         },
         {
            "name": "inheritance",
            "id": 10911
         },
         {
            "name": "doctor",
            "id": 13005
         },
         {
            "name": "destruction",
            "id": 14796
         },
         {
            "name": "tuberculosis",
            "id": 159845
         },
         {
            "name": "medical school",
            "id": 187677
         },
         {
            "name": "unwed mother",
            "id": 209090
         },
         {
            "name": "mistreatment",
            "id": 211082
         },
         {
            "name": "meltdown",
            "id": 218125
         },
         {
            "name": "aspiring artist",
            "id": 225686
         },
         {
            "name": "jilted woman",
            "id": 237446
         },
         {
            "name": "spurned man",
            "id": 238052
         },
         {
            "name": "club foot",
            "id": 238053
         },
         {
            "name": "destitution",
            "id": 238054
         },
         {
            "name": "vitriol",
            "id": 238055
         },
         {
            "name": "savings bonds",
            "id": 239101
         }
      ],
      "imdb_id": "tt0025586",
      "video": false,
      "title": "Of Human Bondage",
      "recommendations": [
         27972,
         85783,
         50070,
         43075,
         136116,
         196693,
         83667,
         84337,
         52228,
         56135,
         43232,
         34187,
         96366,
         27448,
         26323,
         75641,
         22689,
         108213,
         52863,
         27449
      ],
      "backdrop_path": "/alk0KqrlEZ87mz0daLBedXc5I8F.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Philip Carey",
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc35",
               "name": "Leslie Howard",
               "profile_path": "/upiLsG5efD8CrGO0gT6HyiZZEYh.jpg",
               "id": 11493,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Mildred Rogers",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdc39",
               "name": "Bette Davis",
               "profile_path": "/oWGPnjrIxmGHklOGimoPwvIxBgQ.jpg",
               "id": 3380,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Sally Athelny",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdc3d",
               "name": "Frances Dee",
               "profile_path": "/qXYfQyUa83g4tkdFMIU3VLBsDao.jpg",
               "id": 95117,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Norah",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdc41",
               "name": "Kay Johnson",
               "profile_path": "/a7LwnMTh28IIYQ8QLKG1SNA6Xva.jpg",
               "id": 19021,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Harry Griffiths",
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc45",
               "name": "Reginald Denny",
               "profile_path": "/s8YBz4bSkFkLDvVLJeZcbrLCff8.jpg",
               "id": 3364,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Emil Miller",
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc49",
               "name": "Alan Hale",
               "profile_path": "/7ZTTJ08iSQYBaDvfgfhmGpqCrtx.jpg",
               "id": 8729,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Cyril Dunsford",
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc4d",
               "name": "Reginald Sheffield",
               "profile_path": null,
               "id": 86349,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Thorpe Athelny",
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc51",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Dr. Jacobs",
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc55",
               "name": "Desmond Roberts",
               "profile_path": null,
               "id": 179577,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Coughing Lady (uncredited)",
               "gender": 1,
               "credit_id": "5a93168d925141417d022c28",
               "name": "Evelyn Beresford",
               "profile_path": null,
               "id": 564871,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Philip's Landlady Agnes Hollett (uncredited)",
               "gender": 1,
               "credit_id": "59bec01ec3a3683065002841",
               "name": "Tempe Pigott",
               "profile_path": null,
               "id": 29603,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Paris Art Teacher Mons. Flourney (uncredited)",
               "gender": 2,
               "credit_id": "59bec052c3a3682feb002ce9",
               "name": "Adrian Rosley",
               "profile_path": null,
               "id": 1177921,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc0d",
               "name": "John Cromwell",
               "profile_path": "/1osYpgUy3zABKeFRjyBX0K4qcY9.jpg",
               "id": 31497,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc13",
               "name": "W. Somerset Maugham",
               "profile_path": "/mseHL0TUkLcRXds5Pwjmbec8hyt.jpg",
               "id": 27916,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc1f",
               "name": "Pandro S. Berman",
               "profile_path": "/pOB0fbkzzKPUs5w9wd7aeFjjpuI.jpg",
               "id": 30174,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc25",
               "name": "Max Steiner",
               "profile_path": null,
               "id": 3249,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdc2b",
               "name": "Henry W. Gerrard",
               "profile_path": null,
               "id": 35242,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe466ac3a36847f80fdc31",
               "name": "William Morgan",
               "profile_path": null,
               "id": 56929,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5547c7a692514119e00093ba",
               "name": "Lester Cohen",
               "profile_path": null,
               "id": 1265280,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "573f70b89251414ce90009db",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 2,
               "credit_id": "584f8e71c3a36831ce0048fb",
               "name": "Carroll Clark",
               "profile_path": null,
               "id": 3255,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "584f8e789251416cd000476c",
               "name": "Van Nest Polglase",
               "profile_path": "/11wRR3ofmyXu33rjhlrwg74zpnJ.jpg",
               "id": 11036,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "584f8e809251416f100047e6",
               "name": "Walter Plunkett",
               "profile_path": null,
               "id": 11491,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.582552,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43905,
      "vote_count": 30,
      "budget": 0,
      "overview": "Club-footed medical school student Philip Carey falls in love with cynical waitress Mildred Rogers. She rejects him and runs off with a salesman, later returning pregnant and unmarried. Philip takes her in, though \"happily ever after\" is not to be.",
      "similar": [
         40807,
         339397,
         10052,
         1694,
         10312,
         27029,
         11306,
         378018,
         340027,
         11821,
         55922,
         2359,
         18215,
         439154,
         10676,
         75802,
         375950,
         7797,
         26976,
         376581
      ],
      "original_title": "Of Human Bondage",
      "runtime": 83,
      "poster_path": "/8zD3B0eWWmguo9V3TqQWspVbzx7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1934-07-20",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The Love That Lifted a Man to Paradise......and Hurled Him Back to Earth Again",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Cromwell"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Lester Cohen",
         "W. Somerset Maugham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025586/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI0MzA3MDI1NV5BMl5BanBnXkFtZTcwMTA2MDc0NQ@@._V1._CR39,50,268,404_SX214_AL_.jpg",
      "actors": ["Stars: Bette Davis, Leslie Howard, Frances Dee | See full cast and crew »"],
      "reviews": [
         "If Jack Warner had had his way, Bette Davis would have wound up playing all kinds of molls in various Warner Brothers gangster films. Of Human Bondage was a significant milestone in her career because she proved to everyone, including herself, that she was capable of so much more. Like Frank Sinatra with Angelo in From Here to Eternity, Davis knew she was born to play the slatternly amoral Mildred from W. Somerset Maugham's classic novel. Though she rarely used false accents in her movie career after this, she got the Cockney speech pattern down perfect. Davis will keep you riveted to your seat with her performance her. And what a scandal it was that she wasn't nominated. I suspect some intrigue was at work there, possibly the brothers Warner who didn't want her to get a swelled head. Also she'd gotten this break through role at another studio so they weren't going to make a dime on it. Two years later Leslie Howard and Bette Davis would team up again in The Petrified Forest. But what a contrast between the dreamy naive Gabby and Mildred. The same with the male leads. In The Petrified Forest, Leslie Howard is the world weary blasé Alan Squire. In Of Human Bondage, Howard's Philip Carey is a shy man with a deep inferiority complex because of his club foot. He clings to Mildred because even though she's degraded him, he feels he'll never find another attachment again. For both the leads Of Human Bondage represented a considerable stretching of considerable talents. The two later screen versions are markedly inferior to this one.",
         "After 21 movies and three years of working in Hollywood Bette Davis finally got a role she claimed as her own and which put her as a force to be reckoned with. As Mildred Rogers, Davis burst forth with a completely unsympathetic role of a slutty waitress who becomes the target of Leslie Howard's affections, and already eager to sink her teeth into a role like this, she had no qualms of the awful things her character was meant to do throughout the course of the film and the awful transformation she would undergo. It also has been widely noted that her performance here, one of the few things that makes this slightly uneven movie watchable, has been the one to remember even after two remakes and the scenes where she rips into Howard have made cinema history. At circa 85 minutes, the story moves at a nice pace, telling the story of Philip Carey (Howard) as his life crosses that of the destructive Mildred Rogers over and over again. Howard and Davis' chemistry is all but non-existent -- Davis sustained in an interview much later in life she personally didn't care much for Howard's iciness towards her and that helped her act even worse (in character) towards him as Mildred. All the same, the two seem awkward with one another; their scenes together remain stiff, only salvaged by the ferocious acidity Davis brings to her lines and her own nervous presence. Then again, Cromwell's direction has a certain stiltedness about itself that fails to come through at times -- he tries to fill in some space (whenever Davis is not there) with dissolves and montages indicating the passing of time (a calendar superimposed over a changing Frances Dee). All much in the style back then. This was before technicalities and complicated camera angles came into being, and in essence, the visual story is a simplified, bare essentials translation of the Somerset Maugham's novel -- which is saying a lot, since at 600 pages, \"Of Human Bondage\" would have been indeed hard to film even then. Storywise, it feels that Philip Carey may be something of a glutton for punishment, since there is no discernible, sexual attraction between he and Mildred and to compound that, Mildred never hides her displeasure from the get-go. Howard's performance never seems to go through much external emotion -- his eyes are constantly sad, his expression never veers too far away from lost (he could almost be a distant cousin to William Hurt in \"The Accidental Tourist\" -- dejected, hurt, and absolutely passive), but this is possibly a part of his character and the reason he fails to see that other women (played by Kay Johnson and Frances Dee) are making themselves vulnerable to unrequited affections. Interestingly, Johnson's Norah, once she realizes Carey will never fall for her, is the one who sums the story up with her observation that people are bound to other people -- she is bound to Carey as Carey is bound to Mildred, and Mildred herself is bound to Miller (or men who fit the role of provider). In her short but memorable scene, she's the one who holds the essence of the story's moral.",
         "Bette Davis became a star with her role in this first and best film adaptation of the Somerset Maugham novel of the same name (well worth a read). This was her first nomination for an Academy Award, for her portrayal of Mildred Rogers; a tawdry, sluttish, cockney waitress who bewitches hapless Philip Carey (Leslie Howard, best known for his role as Ashley Wilkes in \"Gone With the Wind\"). She lost the award, receiving it for her role the following year for \"Dangerous\", which is generally viewed as a consolation prize. The supporting cast includes Reginald Denny, Alan Hale Sr. (father of Alan Hale Jr., who was the skipper on the TV series \"Gilligan's Isle\"), and a breathtakingly beautiful Frances Dee. The film starts out with Philip, a failed art student with a clubfoot of which he is highly sensitive, turning to the study of medicine after facing the fact that he has no artistic talent. Shortly thereafter he meets and quickly becomes obsessed with Mildred, despite her sneering and obvious disdain for him because of his deformity. Her standard response to his affectionate overtures is a chilly \"I don't mind.\" In his dreams Mildred is sweet and kind to him; during real time she uses him, well aware of his affection for her, leaving him for other men and returning when she is down on her luck, ruining his chance for having a career or a normal life with another woman; he seems to continually finds himself inexorably drawn to her, even after his love for her has waned, until the day she finally pushes him too far. At that point, the camera fully turns to Mildred as her facial expression shifts from supplication to shock to full-on bitch in a matter of seconds, and she reacts to Philip's statement with a barrage of blood-curdling insults. Bette Davis as Mildred never fails to raise the hair on the back of my neck and arms with her performance in this particular scene. This is the role that made Davis a star. It's also one of my all-time favorite Davis films, along with such others as \"The Little Foxes\", \"The Letter\", and \"All About Eve\".",
         "Every motion picture Bette Davis stars in is worth experiencing. Before Davis co-stars with Leslie Howard in \"Of Human Bondage,\" she'd been in over a score of movies. Legend has it that Davis was 'robbed' of a 1935 Oscar for her performance as a cockney-speaking waitress, unwed mother & manipulative boyfriend-user, Mildred Rogers. The story goes that the AFI consoled Davis by awarding her 1st Oscar for playing Joyce Heath in \"Dangerous.\" I imagine Davis' fans of \"Of Human Bondage\" who agree with the Oscar-robbing legend are going to have at my critique's contrast of the 1934 film for which the AFI didn't award her performance & the 1936 film \"Dangerous,\" performance for which she received her 1st Oscar in 1937. I've tried to view all of Bette Davis' motion pictures, TV interviews, videos, advertisements for WWII & TV performances in popular series. In hindsight, it is easy to recognize why this film, \"Of Human Bondage,\" gave Davis the opportunity to be nominated for her performance. She was only 25yo when the film was completed & just about to reach Hollywood's red carpet. The public began to notice Bette Davis as a star because of her performance in \"Of Human Bondage.\" That is what makes it her legendary performance. But, RKO saw her greatness in \"The Man Who Played God,\" & borrowed her from Warners to play Rogers. I'm going to go with the AFI, in hindsight, some 41 years after their astute decision to award Davis her 1st Best Actress Oscar for \"Dangerous,\" 2 years later. By doing so, the AFI may have been instrumental in bringing out the very best in one of Hollywood's most talented 20th century actors. Because, from \"Of Human Bondage,\" onward, Davis knew for certain that she had to reach deep inside of herself to find the performances that earned her the golden statue. Doubtless, she deserved more than 2 Oscars; perhaps as many as 6. \"Dangerous\" provides an exemplary contrast in Davis' depth of acting characterization. For, it's in \"Dangerous\" (1936) that she becomes the greatest actor of the 20th century. Davis is so good as Joyce Heath, she's dead-center on the red carpet. Whereas in \"Of Human Bondage,\" Davis is right off the edge, still on the sidewalk & ready to take off on the rest of her 60 year acting career. Perhaps by not awarding her that legendary Oscar in 1935, instead of a star being born, an actor was given incentive to reach beyond stardom into her soul for the gifted actor's greatest work. It is well known that her contemporary peer adversary was Joan Crawford; a star whose performances still don't measure up to Davis'. Even Anna Nicole Smith was a 'star'. Howard Stern is a radio host 'star', too. Lots of people on stage & the silver screen are stars. Few became great actors. The key difference between them is something that Bette Davis could sense: the difference between the desire to do great acting or to become star-struck. Try comparing these two movies as I have, viewing one right after the other. Maybe you'll recognize what the AFI & I did. Davis was on the verge of becoming one of the greatest actors of the 20th century at 25yo & achieved her goal by the time she was 27. She spent her next 50 plus years setting the bar so high that it has not been reached . . . yet. Had the AFI sent her the message that she'd arrived in \"Of Human Bondage,\" Davis' life history as a great actor may have been led into star-struck-dom, instead.",
         "How amazing this film is! I've seen it over and over throughout the years and I'm always spellbound by it. The reason why the film is so easy to re-watch is, of course, the arresting performance given by the young Bette Davis. She not only steals every scene that she's in, but is actually much prettier and better photographed here (not to mention sexier) than she was in any of the films that she had made thus far at her home studio, Warner Brothers (this film was made by R.K.O. Radio Pictures). She wears a very flattering make-up and has very attractive hairstyles and oh, those lovely big eyes (especially, in the restaurant scenes that take place in London's Soho). Her body was so curvy when she was young. Get a load of it in the cheap negligee that she wears for her big explosive confrontation scene with Leslie Howard. And oh boy, she is an absolute powerhouse in that scene. Howard is a little too nervous throughout, but he does captures the hero's sensitivity. Frances Dee scores as the sweet, pretty young Sally who truly loves him. Max Steiner's score is both charming and poignant. Splendid performances and thirties flavor make this the must see version of the classic novel.",
         "This movie, even though it is over 70 years old is still a very moving, strong film. Bette Davis, as the slutty, vicious Cockney waitress Mildred is absolutely believable. Watching her performance is still spellbinding. She makes the viewer absolutely despise her and pity her at the same time. Leslie Howard's performance as the weak, obsessed Phillip Carey is not as strong, but I don't see how any actor could hold their own against Ms. Davis's performance. She chews up the scenery in every scene she is in, totally stealing the show. This is the movie that sealed her stardom and she deserved to win the Academy Award, but lost. It was shocking for it's day what with themes of unwed pregnancy, multiple sex partners, and Mildred's vicious language so it is somewhat dated, but still an excellent movie. Just to see the scene where Mildred tells Phillip what she REALLY thinks of him (\"You cad, you dirty swine....\") is still some of the greatest acting I have ever seen on film.",
         "Coming shortly before the imposition of a morality code darkened the spirits of writers, directors and actors, the first film adaptation of W. Somerset Maugham's \"Of Human Bondage\" titillated countless moviegoers. It has no shock value today, just fine acting. While the cast is excellent, this is Bette Davis's first great role and one of Leslie Howard's best performances. Howard is English wannabe Parisian artist Philip Carey who is gently and firmly told that he lacks any talent and that his dedication is no substitute for true genius. Taking the lesson to heart he returns to London and enrolls in a medical college (one, by the way, that seems to have no female students-at that time there would have been at least a few. Perhaps author/physician Maugham didn't care for distaff medicos). Having tea one day Carey is entranced by a waitress, Mildred Rogers, Bette Davis in a role as a morally loose and basically wicked farrago. Her Cockney accent is as sharp as Eliza Doolittle's. His repeated attempts to date her are greeted with the less than enthusiastic reply, \"I don't mind,\" a sure sign for any man with his head screwed on straight that he's plumbing the depths. Maugham's Mildred supplemented her waitress tips with a bit of old fashioned street-walking, something not clearly brought out here. Carey's besotted prostration serves Rogers' avaricious need for support of the financial kind. He is desperately in love with her-she plays him as a Sunday church organist effortlessly plies her instrument. No sex here. Recognizing that he is getting nowhere, he begins a chaste relationship with Norah, a woman who adores him. Re-enter Mildred, replete with a baby, and in her usual need of being taken care of. Exit heartbroken Norah. Another separation from Mildred and Carey begins a long-term friendship with Sally, abetted enthusiastically by her dad who seems to view eventual marriage as both a good thing for the two young people and a chance to be relieved of one of his nine offspring. The movie reasonably but not entirely follows Maugham's excellent novel. Howard's Carey is naive and vulnerable and for much of the movie his sad eyes remind one of a doe facing a double-barreled shotgun. Mildred is unrestrainedly wicked, a user of the worst kind, her sole preoccupation with her own needs barely disguised when she tries to wheedle Carey with a thin patina of affectionate words (and offers-at one point she promises she'll do \"anything [he] wants,\" a daring statement for the times and one I'm sure audiences fully understood. Pre-Code it may be but Mildred's quick-march dissolution would have satisfied the League of Catholic Decency. The ending is conventional-sin loses, principled behavior triumphs. Director John Cromwell wrought excellent performances from his two main stars, one well-established, the other established largely because of this film. The atmosphere is 1930s London and the trip back in time is worth taking. Available on DVD. 9/10 (for Davis's and Howard's performances)",
         "...that the Bette Davis version of this film was better than the Kim Novak version. Despite all of the other comments written here, I really prefer the Bette Davis version, even though the Novak version has a more coherent story line. However: Davis' Mildred's raw emotions seem to me to be more apt to a sluttish girl who seems easily to become a prostitute. And it is those raw emotions that constitute *part* of what the poor doctor falls in love with. He has emotions of despair, of failure, of \"otherness\" - strong emotions that he represses. Davis' Mildred, on the other hand, displays her emotions immediately and without censure. She has no feelings of despair, or of failure, or of \"otherness\"; rather, she is merely surviving as a poor Cockney woman in the Victorian era. Novak's portrayal was a more vulnerable Mildred than was Davis', almost through the the whole movie. Davis' Mildred was **never** vulnerable until she actually had to go to the doctor and beg for assistance. And when he reviles her - for her method of keeping body and soul together, and for continually taking advantage of his love for her - she unleashes arguably the most passionate repudiation of snobbish holier than thou attitude ever seen on screen: \"I wiped my mouth! I WIPED MY MOUTH!!\" Novak's vulnerability was excellent. Davis' realism was monumental. IMDb votes concur!",
         "Bette gives what LIFE magazine called \"...the best performance ever recorded on the screen by a U.S. actress\". It put her on the Hollywood map, and almost 70 years later remains one of the most powerful and original performances ever created. Some people argue that Bette likes to go over the top. I really think these individuals don't understand her unique genius. A brilliant performance in a visually intelligent movie that has not dated one bit.",
         "Bette Davis' electrifying performance is such that it is hard to remember the other female players. They were as perfect in their parts as Davis was in hers - they just didn't have as much to do. Some of the reviewers felt that the book was so much better - it was but to give the film it's due, to condense a 600 page book down to 83 minutes is no mean feat. The first part of the book didn't even make it to the screen - it told of Phillip's childhood, then moved to Germany and Paris, where Phillip had gone to try to make good as an artist. It also chronicles his first romance - with Fanny Price, who kills herself when she realises Phillip cannot return her feelings of love. It is a wonderful book but rambling and I think that anyone who does not think too highly of the film should read the book and will realise how good the film is. After realising that he will only ever be a mediocre painter, Phillip Carey (Leslie Howard) comes back to England hoping to take up medicine. When out at a tearoom he meets a sullen waitress, Mildred (Bette Davis). Even though she has no interest in him and basically treats him like dirt, Phillip is obsessed. It is so hard to watch his efforts at trying to find any civility in this vicious shrew. In one scene she promises to meet him in a second class railway waiting room, when they almost miss each other, she berates him with \"why would I wait in a second class waiting room when there is a first class one available\". You just want to shake him. The only time she is pleasant to him is when she tells him she is going to marry another man, a coarse sales- man, Emile Miller (Alan Hale). With Mildred out of the picture, he meets Nora (Kay Johnson) a lovely woman, who writes romantic novels under a male pseudonym. She jokes about the popularity the books enjoy among servants (in the novel he had seen Mildred reading them.) Nora gives Phillip all the love and confidence he needs but he is incapable of returning her love. When Mildred returns (Miller didn't marry her and she is having a baby), of course he takes care of her and helps her with the baby (in the film it is treated as an object - always called \"baby\", never given a name or gender) - she repays him by running off with his best friend. At the hospital he meets Sally Athelny (Frances Dee) who is visiting her sick father. He begins to visit her home and for the first time in his life gets a sense of family. Then surprise! surprise! Mildred returns like a bad penny and surprise! Philip takes her in. But he has changed and feels only disgust when she tries to show gratitude the only way she knows how. Then follows one of the most vicious, verbal fights on film with phrases such as \"you cad, you dirty swine\", \"I only kissed you because you begged me\" and \"when you went I wiped my mouth, I WIPED MY MOUTH\"!!! In the book a lot of Mildred's stock phrases such as \"you're a gentleman in every sense of the word\", \"I don't mind\", and \"Mr. High and Mighty\" were associated with prostitutes and when Phillip meets her for the first time he is struck by that. The end of the film shows Phillip (being truly free of Mildred in the only way possible) now free to love Sally. Again in the book Sally tells Phillip that she thinks she is having a baby but that just makes him more sure of his love. That ending, like Mildred's \"sickness\" could not be in the film - even a pre-code one. Kay Johnson was always called on to play sensible, believable women - which she played to perfection as she was obviously sensible herself. Her Nora was the woman Philip should have stayed with. Frances Dee was one of the most beautiful of screen ingenues. She was obviously being groomed for stardom with some roles that proved she was not just a pretty face (\"The Silver Cord\" and \"Blood Money\") but when she married Joel McCrea her career started to peter out. Her Sally did not push her talent to the limits. Apparently Leslie Howard was not very helpful to Bette Davis on the set - he was annoyed that an English actress was not given the part. He used to throw her her lines \"whilst reading a book off camera\". He did start to take an interest when a newspaper reported \"the kid was running away with the picture\"!!! Highly, Highly Recommended."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Radio Pictures"],
      "summaries": [
         "Abandoning artistic ambitions, sensitive and club-footed Philip Carey enrolls in medical school and falls in love with a waitress Mildred Rogers. She rejects him, runs off with a salesman and returns unmarried and pregnant. Philip gets her an apartment and they become engaged. Mildred runs off with another medical student. Philip takes her back again when she returns with her baby. She wrecks his apartment and burns the securities he needs to pay tuition. He gets a job as a salesman, has surgery on his foot, receives an inheritance, and returns to school where he learns Mildred is dying.",
         "The clubfooted aspirant painter Philip Carey is advised by an acquaintance to give-up his artistic ambition since he is a mediocre artist. He joins the medical school in London using his inheritance to pay the school and to have a comfortable life. When he meets the cold cockney waitress Mildred Rogers in a restaurant, the shy Philip has a crush on her but she rejects him. Philip stalks her and dates her; however the easy woman scorns him. When Philip proposes Mildred, she tells him that she is going to marry her lover Miller, leaving the brokenhearted Philip obsessed for her. He tries to move on, dating the affectionate Norah in an unrequited love. However, when Mildred returns alone and pregnant, Philip lodges them in his home. Sooner Mildred becomes lover of Philip's friend Reginald Denny and leaves Philip again. When Philip finds Mildred and her baby later abandoned on the street, he brings them home. Mildred unsuccessfully tries to seduce Philip but he loathes her; Mildred feels humiliated and wrecks his apartment and burns his savings, forcing Philip to quit the medical school. However his teacher offers to operate his feet first and Philip becomes a normal man. But he does not succeed to find a job and his life goes downhill fast until he meets a friend that helps him.",
         "Philip Carey is a medical student of limited means who is particularly self-conscious about his physical deformity, a club foot. When a fellow student wants to try and impress a waitress in a local restaurant, Philip goes along to show him how to make small talk with someone you're attracted to. The woman in question is Mildred Rogers, an attractive girl who gets the attention of many customers, particularly the wealthy Emil Miller. Philip takes an immediate liking to her and asks her out. It soon becomes obvious to everyone except Philip that Mildred is manipulative and using him only insofar as he spends money on her and treats her nicely. She refuses his proposal of marriage saying she is to marry someone else but many months later is back on his doorstep, pregnant and without a place to live. This will not be the last time that she seeks his help only to abandon him when a better proposition comes along. Throughout it all, Philip remains steadfast, honest and caring even though it is all to his detriment.",
         "A young man finds himself attracted to a cold and unfeeling waitress who may ultimately destroy them both."
      ],
      "budget": 0
   },
   "movielensId": 959,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-07-20",
      "dvdReleaseDate": "2002-01-22",
      "directors": ["John Cromwell"],
      "runtime": 83,
      "movieId": 959,
      "title": "Of Human Bondage",
      "mpaa": "",
      "actors": [
         "Leslie Howard",
         "Bette Davis",
         "Frances Dee",
         "Kay Johnson",
         "Reginald Denny",
         "Alan Hale",
         "Reginald Sheffield",
         "Reginald Owen",
         "Desmond Roberts",
         "Tempe Pigott",
         "Adrian Rosley"
      ],
      "imdbMovieId": "0025586",
      "originalTitle": "Of Human Bondage",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["VE3sLaSTR0s"],
      "plotSummary": "Club-footed medical school student Philip Carey falls in love with cynical waitress Mildred Rogers. She rejects him and runs off with a salesman, later returning pregnant and unmarried. Philip takes her in, though a \"happily ever after\" ending is not to be.",
      "tmdbMovieId": 43905,
      "avgRating": 3.71046,
      "releaseYear": "1934",
      "numRatings": 411,
      "posterPath": "/8zD3B0eWWmguo9V3TqQWspVbzx7.jpg"
   }
}