{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "play",
            "id": 14531
         },
         {
            "name": "hamlet",
            "id": 185011
         },
         {
            "name": "christmas",
            "id": 207317
         },
         {
            "name": "actor",
            "id": 207716
         }
      ],
      "imdb_id": "tt0113403",
      "video": false,
      "title": "A Midwinter's Tale",
      "recommendations": [],
      "backdrop_path": "/aIj2uPKXpGViZ4YUhVnfB1J0oi9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe4583c3a36847f80cb93f",
               "name": "Richard Briers",
               "profile_path": "/cdOxeResI28YXe912GbQKKvbKv8.jpg",
               "id": 29859,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Margaretta",
               "gender": 1,
               "credit_id": "52fe4583c3a36847f80cb943",
               "name": "Joan Collins",
               "profile_path": "/8KKTDl6jaM6RTWuRpuuXOvMsvG.jpg",
               "id": 13637,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe4583c3a36847f80cb947",
               "name": "Michael Maloney",
               "profile_path": "/f0rV6ZXr8W6BkSCFeJo2KXdnD4A.jpg",
               "id": 17483,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Tom Newman",
               "gender": 2,
               "credit_id": "5695150bc3a3680e9a0022fd",
               "name": "Nicholas Farrell",
               "profile_path": "/t1I4m6x2aAki1pRueK6pxbi7j9s.jpg",
               "id": 32357,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe4583c3a36847f80cb94b",
               "name": "Jennifer Saunders",
               "profile_path": "/c1qRVTYqUhWd7y2ws426zdyqhln.jpg",
               "id": 12094,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Nina",
               "gender": 1,
               "credit_id": "52fe4583c3a36847f80cb953",
               "name": "Julia Sawalha",
               "profile_path": "/57xZL2uZzRaRmWpzWxH4SnxOa2u.jpg",
               "id": 53328,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Fadge",
               "gender": 1,
               "credit_id": "546377a7c3a368124a0023a5",
               "name": "Celia Imrie",
               "profile_path": "/tAEzs5PFVX5GsfD3KTWINnuTzMJ.jpg",
               "id": 9139,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Terry Du Bois",
               "gender": 2,
               "credit_id": "56951548c3a3680e9f00222c",
               "name": "John Sessions",
               "profile_path": "/oLBcHRhah5FxyodfZECIHCrROwG.jpg",
               "id": 26860,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Young actor",
               "gender": 2,
               "credit_id": "56951563c3a3680e9a002308",
               "name": "Adrian Scarborough",
               "profile_path": "/i4oo8zApNAbKQKI4yKc0T571dBI.jpg",
               "id": 40311,
               "order": 8
            },
            {
               "cast_id": 7,
               "character": "Molly",
               "gender": 0,
               "credit_id": "52fe4583c3a36847f80cb94f",
               "name": "Hetta Charnley",
               "profile_path": null,
               "id": 237613,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Carnforth",
               "gender": 2,
               "credit_id": "52fe4583c3a36847f80cb957",
               "name": "Gerard Horan",
               "profile_path": "/fsF6Ruuf9DrTllqMaDx5aJpFiaX.jpg",
               "id": 56101,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Ventriloquist",
               "gender": 2,
               "credit_id": "589b44eec3a3683ab800793e",
               "name": "Brian Pettifer",
               "profile_path": "/2j6RQQp7Q35KN5KhWhQ5HrdIYgQ.jpg",
               "id": 97165,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Scotsman",
               "gender": 2,
               "credit_id": "589b44fac3a3683aa6007881",
               "name": "Patrick Doyle",
               "profile_path": "/mo87kZiHO5gsoax80Us0S2CPmS.jpg",
               "id": 9152,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Mule Train Man",
               "gender": 0,
               "credit_id": "589b4508c3a3683aa3007ea5",
               "name": "Shaun Prendergast",
               "profile_path": "/3IMUCBXLXb7KRvRBWqH9MVVxupo.jpg",
               "id": 1211929,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4583c3a36847f80cb935",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4583c3a36847f80cb93b",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "571c683b9251415b0c0006a4",
               "name": "Jimmy Yuill",
               "profile_path": "/zeuinVj4XOYzWSty96mM3SaD1mB.jpg",
               "id": 151797,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "571c684292514135ff0038e8",
               "name": "Roger Lanser",
               "profile_path": null,
               "id": 48971,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "571c6849c3a368197c0054a0",
               "name": "Neil Farrell",
               "profile_path": null,
               "id": 41376,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "571c6851c3a3684e620006b6",
               "name": "Tim Harvey",
               "profile_path": null,
               "id": 29857,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "571c686ac3a36824a3003abd",
               "name": "Caroline Harris",
               "profile_path": null,
               "id": 119117,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.804569,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 40154,
      "vote_count": 7,
      "budget": 0,
      "overview": "Out of work actor Joe volunteers to help try and save his sister's local church for the community by putting on a Christmas production of Hamlet, somewhat against the advice of his agent Margaretta. As the cast he assembles are still available even at Christmas and are prepared to do it on a 'profit sharing' basis (that is, they may not get paid anything) he cannot expect - and does not get - the cream of the cream. But although they all bring their own problems and foibles along, something bigger starts to emerge in the perhaps aptly named village of Hope.",
      "similar": [
         11395,
         13673,
         11881,
         10147,
         9479,
         13377,
         18147,
         323262,
         287903,
         51052,
         5825,
         1585,
         10872,
         1581,
         634,
         8871,
         772,
         10719,
         194662,
         296100
      ],
      "original_title": "A Midwinter's Tale",
      "runtime": 99,
      "poster_path": "/6u2N0gn6uUWF4cSdkXmVB8E8q2X.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Midwinter Films",
            "id": 75942,
            "origin_country": ""
         },
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         }
      ],
      "release_date": "1995-12-01",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "The drama. The passion. The intrigue... And the rehearsals haven't even started.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Kenneth Branagh"],
      "runtime": 99,
      "synopsis": "An unemployed actor directs an unlikely group in an English church's production of \"Hamlet.\"",
      "writers": ["Kenneth Branagh"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113403/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMDEwMDAyMl5BMl5BanBnXkFtZTYwOTUwNTk4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Michael Maloney, Richard Briers, Hetta Charnley | See full cast and crew »"],
      "reviews": [
         "Cliches be damned, this is a wonderful movie, all about transformations, change, and deciding what is really important. Everyone in this movie becomes a real person, moving away from the stereotypes presented in the beginning, and the comic timing is impeccable. (Don't buy the hype that Jennifer Saunders is a star of this movie, though; she's in it for maybe five minutes. Spend your time watching Richard Sessions' magnificently funny performance instead.) Branagh's Hamlet is dull, dull, dull; Branagh's movie -about- making Hamlet is another shade of wonderful entirely.",
         "This was a film that I wanted to see from the very second that I heard about it. Unfortunately (for one reason and another) I missed it at the cinema and was forced to trawl the depths of video stores to find it. It is a beautifully shot, subtly hilarious piece of cinematic history. Anyone who has ever worked in theatres or have met \"theatre types\" will empathise with the characters immediately...and anyone who has never experienced the backstage \"goings on\" of theatres should watch this film to experience the endearing qualities of theatre in its extreme. Quite simply this film is wonderful and has made me a huge fan of Kenneth Branagh's writing and direction. My only complaint about this film is that it is impossible to find!! Why can't we buy it on DVD yet??!",
         "I selected this movie from the video shelf because the title seemed consonant with my mood. My girlfriend had just dumped me, my best friend had just broken off with me, and it was raining. The realisation that it was black and white throughout seemed to be perfect. Yet the story, of a struggling actor's frantic attempts to mount a benefit showing of Hamlet to save a church, along with Branagh's comedic editing, begins as a farce, sails along with Coward-like snippets of conversation (along with the use of Coward's song \"The Show Must Go On\") and develops facilely and elegantly into a moving portrait of the camaraderie of an acting company without one noticing. I didn't realise I wasn't unhappy and in love with all these people until the movie was over and I was beaming quite sunnily (who needs friends and girlfriends anyway when you've got movies?). Julie Sawalha's reading of the line \"Let's face it, we're all depressed\" may very well have saved my life.",
         "This is a movie that will make you see that when things look their bleakest, as in midwinter, you have to push on. The characters undergo a long journey from strange actor-folk and emerge as people who are near and dear to us at the end. They are the light at the end of the tunnel. Anyone who's been involved with a difficult stage production will identify with this movie. I loved it! \"Dear Hamlet, cast thy coloured nightie off...\" -D",
         "My wife and I saw this film a week after we completed a production of A MAN FOR ALL SEASONS.( I directed and she was Meg). We had experienced the disasters of Actors who couldn't remember lines,Tech problems, an Vain Egotist causing problems etc. What A joy it was to enter the theatre as see this Branagh gem. the script,acting and Direction were all flawless. ( for those who said the characters were cliche' youve obviously never delt with actors!) the high marks were scored by Richard Briers as the older no-nonsense character actor, John Sessions as the \"queen\" gertrude , and the Highly underated Michael Maloney in the lead. Maloney has long been a favorite supporting actor of mine and its good to see him as the protaganist for a change. I cannot speak high enough of this film...and to answer Noel Coward's question \"why must the show go on?\" because if it didn't we would be robbed of this films suberbly directed ending! BRAVO BRANAGH, BRAVO!!",
         "This is a wonderful comedy about actors and the process of acting. A director, brilliantly portrayed by Michael Maloney, is desperate to find a remedy for his depressive mood and has no better idea than to gather unemployed actors around him to stage \"Hamlet\" in a church. The stunning cast adds a lot to the warm feeling that this movie leaves you with. It is a must-see and the videotape also makes a lovely Christmas present!",
         "Rating this movie, I gave it a 10 only because there wasn't a higher number allowed. Never having previously heard of this, I decided to take a chance on it one afternoon, though I generally avoid HBO, partly out of the lack of anything else important to do and partly because I saw Kenneth Branagh's name. How serendipitous. This almost perfect cinema experience moved me to tears, made me laugh, brought me to my feet applauding and cheering -- right here, perhaps foolishly, in my living room. Branagh is further evidence that God is no socialist: Branagh has looks, talent, and now deservedly has money and probably all the romance he wants to handle. In other words, he has everything, while so many of us have nothing. Proving, as I said, God is no socialist, equitably sharing the wealth. The cast of \"In the Bleak Midwinter\" is just simply magnificent. I can accept a quibble that some performances are a bit stereotyped (and one director wrote in this forum that anyone believing that just needs to accompany a troupe), but even if true, so what? I love theater people. I love theater people and that is perhaps the main reason I loved \"In the Bleak Midwinter.\" As much as any film and more than most it shows stage actors in all their quirks and foibles, and in all their inherent humanity; it shows how the love for their craft, for their heritage and traditions, motivates them far more than does money or the chance of it, more than fame or the lack of it, and much, much more than does security. Actors portraying actors often can be seen shifting into another gear, but that doesn't happen here. Director Branagh and the excellent cast of superb performers provide a nearly seamless, nearly perfect production, beautifully written by Branagh. If there were room, each and every cast member should get a glowing tribute. Each and every one was great (even Joan Collins was great, though I can't help wondering: Is she EVER going to show any age on her?), and each and every one was a standout -- which might seem to be a contradiction, a paradox, but watch \"In the Bleak Midwinter.\" You'll see what I mean. Bravo, bravo, bravo. \"In the Bleak Midwinter\" is simply magnificent.",
         "A perfect little movie, this tale of provincial actors struggling to deliver a production of Hamlet is one that will cheer your Bleak Midwinter if you have any heart whatsoever. Definitely under-rated and one of Branagh's best, it is simply and effectively photographed in black and white, and features a witty, amusing, and at times, hilarious script performed by a stand-out ensemble cast. Although its tale of backstage trials and tribulations will not appeal to all tastes, there is a lot of subtlety and truthfulness to the gentle, genuine sentiment on offer here. Among very few false notes, only Jennifer Saunder's dire caricature as a Hollywood producer really disappoints. The rest of the cast are just terrific. Almost as good a Christmas movie as It's a Wonderful Life, I recommend it.",
         "A marvelous comedy concerning a troupe of oddball, misfit actors who travel to a small village to stage a production of \"Hamlet\". Director Branagh serves up some wonderfully heartwarming sentiments while managing to keep us laugh and on our toes. His excellent direction, a witty script, and stellar acting -absolutely stellar - by the ensemble, add up to an gratifying cinematic experience! Despite a few minor flaws, the film works about 75% of the time, and when it does, it's downright hilarious. Pay close attention to the dialogue - it's venomously funny; and the black and white cinematography, and the sets, are magnificent. Two special treats for the cinema connoisseur - a brilliant Joan Collins, and a surprise cameo from Jennifer Saunders.",
         "I love this film. It is small, and quiet, and it is rather unexpectedly in black and white. It opens like a documentary, and then slips you right into the role of fly on the wall for the rest of the film. The ensemble is terrific and keep an eye on the facial expressions of the actors who are not actually speaking. A lot of Branagh regulars make welcome appearances. The \"look\" is wonderfully textured and layered, taking advantage of b/w. Ironically, I prefer many of \"Joe's\" interpretations of Hamlet to the same scenes in the various film versions I've seen, including Branagh's epic version. Of course, the version they perform is designed for the stage, with a mostly live audience.... My favorite aspect of this film is that it turns a production of Hamlet into a \"neo-pseudo-Shakespearean comedy.\" The parallels between the characters in Hamlet still exist in the players in A Midwinter's Tale. They've been updated and personalized so that Joe's comment that \"the play is about loss\" works equally well for the film. But, just as almost everyone is dead at the end of a Shakespearean tragedy, everyone is paired up at the end of MT. Of course, as a modern work it can't just end in weddings, but happy endings abound for everyone. The cleverness of this all is that there is naughty, campy, frivolous humour which hides deep emotional pain, uncertainty, and even tragedy. Anyone who is familiar with Shakespeare's comedies will be familiar with that dark edge which contrasts the joyous romping. Then there are the requisite farcical elements to make the parallel complete. The only unresolved issues I had at the end of the film/play were \"how will Molly handle the fencing scene?\" and \"how is it possible for Henry to be both Claudius and the Player King?\" But I'm not about to gripe about these little points when everything else is tied up so neatly and well."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Midwinter Films"
      ],
      "summaries": [
         "Out of work actor Joe volunteers to help try and save his sister's local church for the community by putting on a Christmas production of Hamlet, somewhat against the advice of his agent Margaretta. As the cast he assembles are still available even at Christmas and are prepared to do it on a 'profit sharing' basis (that is, they may not get paid anything) he cannot expect - and does not get - the cream of the cream. But although they all bring their own problems and foibles along, something bigger starts to emerge in the perhaps aptly named village of Hope.",
         "An out-of-work actor on the verge of a nervous break-down decides to put on a production of Hamlet in a church. At Christmas. Despite admonitions from his agent and sister about the career suicide he's about to commit by investing in such a morbid play over the holidays, he pushes on to realize his goal. Faced with a series of challenges and cast of misfits and oddballs, the troupe crawl towards opening night, discovering love, laughter, and friends along the way."
      ],
      "budget": 0
   },
   "movielensId": 96,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-01",
      "dvdReleaseDate": null,
      "directors": ["Kenneth Branagh"],
      "runtime": 99,
      "movieId": 96,
      "title": "A Midwinter's Tale",
      "mpaa": "",
      "actors": [
         "Richard Briers",
         "Joan Collins",
         "Michael Maloney",
         "Nicholas Farrell",
         "Jennifer Saunders",
         "Julia Sawalha",
         "Celia Imrie",
         "John Sessions",
         "Adrian Scarborough",
         "Hetta Charnley",
         "Gerard Horan",
         "Brian Pettifer",
         "Patrick Doyle",
         "Shaun Prendergast"
      ],
      "imdbMovieId": "0113403",
      "originalTitle": "A Midwinter's Tale",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["vBS92ui_h74"],
      "plotSummary": "Out of work actor Joe volunteers to help try and save his sister's local church for the community by putting on a Christmas production of Hamlet, somewhat against the advice of his agent Margaretta. As the cast he assembles are still available even at Christmas and are prepared to do it on a 'profit sharing' basis (that is, they may not get paid anything) he cannot expect - and does not get - the cream of the cream. But although they all bring their own problems and foibles along, something bigger starts to emerge in the perhaps aptly named village of Hope.",
      "tmdbMovieId": 40154,
      "avgRating": 3.69103,
      "releaseYear": "1995",
      "numRatings": 513,
      "posterPath": "/6u2N0gn6uUWF4cSdkXmVB8E8q2X.jpg"
   }
}