{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "angel",
            "id": 290
         },
         {
            "name": "judge",
            "id": 934
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "hell",
            "id": 6154
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "devil",
            "id": 14999
         }
      ],
      "imdb_id": "tt0038300",
      "video": false,
      "title": "Angel on My Shoulder",
      "recommendations": [
         44071,
         18034
      ],
      "backdrop_path": "/xIlQQkuUSPQv5hrUosUgyGHviP9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Eddie Kagle/Judge Fredrick Parker",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01adb7",
               "name": "Paul Muni",
               "profile_path": "/q3WSt8ZkN0D45CDiuVnOSfn0VQl.jpg",
               "id": 13352,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Barbara Foster",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01adbb",
               "name": "Anne Baxter",
               "profile_path": "/jOnJoazpO6q2vAVL37IQfzQbjav.jpg",
               "id": 10606,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01adbf",
               "name": "Claude Rains",
               "profile_path": "/ghieLWQHq15QzAsrxFzkVk1oZ3F.jpg",
               "id": 4113,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Dr. Matt Higgins",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01adc3",
               "name": "Onslow Stevens",
               "profile_path": "/giCw0flQnjJfTdlkH2A9yRD48Tg.jpg",
               "id": 89091,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Albert",
               "gender": 2,
               "credit_id": "52fe444bc3a368484e01adc7",
               "name": "George Cleveland",
               "profile_path": "/pbfP5mephNymAfn3uqADdMTqny5.jpg",
               "id": 32218,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Minister",
               "gender": 0,
               "credit_id": "52fe444bc3a368484e01adcb",
               "name": "Erskine Sanford",
               "profile_path": "/gLSuzEnOuTYmwU0wXO0GYe060n2.jpg",
               "id": 14364,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mrs. Bentley",
               "gender": 1,
               "credit_id": "52fe444bc3a368484e01adcf",
               "name": "Marion Martin",
               "profile_path": "/ci5vfUjqZxm8y27tr1pMKHto7fi.jpg",
               "id": 85900,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Smiley Williams",
               "gender": 2,
               "credit_id": "52fe444bc3a368484e01add3",
               "name": "Hardie Albright",
               "profile_path": "/4wTdULXac5ewxYHyyMBlcnNex8l.jpg",
               "id": 31702,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Bellamy",
               "gender": 2,
               "credit_id": "5829bf319251417b1d037851",
               "name": "James Flavin",
               "profile_path": "/quxPBveIsUgat0N8VePdsHpsQnq.jpg",
               "id": 3262,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ada1",
               "name": "Archie Mayo",
               "profile_path": "/qlMkKV4vwtawlBIY74c3sFXcNw.jpg",
               "id": 81165,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ada7",
               "name": "Charles R. Rogers",
               "profile_path": null,
               "id": 89089,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444bc3a368484e01add9",
               "name": "James Van Trees",
               "profile_path": "/mN09qHVEEF0QvNPV0n7J7LlyJ2Q.jpg",
               "id": 144124,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5812b329925141571e01e536",
               "name": "Harry Segall",
               "profile_path": null,
               "id": 72835,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5829bfd1c3a36823580019d9",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Music Director"
            },
            {
               "gender": 2,
               "credit_id": "5812b33d925141543e01f83b",
               "name": "Roland Kibbee",
               "profile_path": null,
               "id": 69936,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5829bf699251417b290386c5",
               "name": "Harry Segall",
               "profile_path": null,
               "id": 72835,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "5829bfc4c3a368038102cb2c",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5829bffb9251417b21037f1b",
               "name": "David W. Siegel",
               "profile_path": null,
               "id": 89090,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5829c069c3a368038102cb6e",
               "name": "David Sussman",
               "profile_path": null,
               "id": 183751,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5829c09ac3a368360f03a54c",
               "name": "William J. Fender",
               "profile_path": null,
               "id": 1708592,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5829c0fcc3a368360b03c6b9",
               "name": "George M. Arthur",
               "profile_path": null,
               "id": 103445,
               "department": "Editing",
               "job": "Editorial Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5829c1259251417b1a039341",
               "name": "Asa Boyd Clark",
               "profile_path": null,
               "id": 139220,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5829c14cc3a3683601034441",
               "name": "Bernard Herzbrun",
               "profile_path": null,
               "id": 29637,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5829c18d9251417b2603a44d",
               "name": "Ern Westmore",
               "profile_path": null,
               "id": 1249179,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "5829c1c89251417b290387e6",
               "name": "Edward G. Boyle",
               "profile_path": null,
               "id": 4104,
               "department": "Costume & Make-Up",
               "job": "Set Dressing Artist"
            },
            {
               "gender": 0,
               "credit_id": "5829c1f1c3a368038102cc37",
               "name": "Frank Webster",
               "profile_path": null,
               "id": 118317,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "5829c221c3a368623f0140e1",
               "name": "Harry Redmond Jr.",
               "profile_path": null,
               "id": 111173,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "5829c28d9251417b18038ef2",
               "name": "Maria Donovan",
               "profile_path": null,
               "id": 1708594,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5829c2cac3a368623f01414e",
               "name": "Robert Martien",
               "profile_path": null,
               "id": 1586289,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5829c3e29251417b1d037ab5",
               "name": "Howard Anderson",
               "profile_path": null,
               "id": 1708596,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.787539,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22688,
      "vote_count": 6,
      "budget": 0,
      "overview": "Gangster Eddie Kagel is killed by a trusted lieutenant and finds himself in Harry Redmond Jr's special effects Hell, where Nick/The Devil sees that he is an-exact double for a judge of whom Nick doesn't approve. Eddie is agreeable to having his soul transferred to the judge's body, as it will give him a chance to avenge himself on his killer. But every action taken by Eddie (as the judge) results in good rather than evil and, to Nick's dismay, the reputation and influence of the judge is enhanced, rather than impaired by Eddie. And Eddie also falls in love with the judge's fiancée, Barbara. Even Eddie's planned revenge fails and Nick is forced to concede defeat. He returns to Hell, taking Eddie with him, after Eddie has extracted his promise that Nick will not molest the judge or Barbara in the future.",
      "similar": [
         24420,
         1024,
         339397,
         1643,
         8067,
         86838,
         1903,
         38,
         46705,
         50546,
         225886,
         86331,
         458741,
         4823,
         1259,
         276,
         9946,
         226,
         288036,
         2252
      ],
      "original_title": "Angel on My Shoulder",
      "runtime": 100,
      "poster_path": "/5GvCXu1nYiqhVoXYvAjH5aE8DEW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Premier Productions",
         "id": 16305,
         "origin_country": ""
      }],
      "release_date": "1946-09-20",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "With an ANGEL on his shoulder... And the DEVIL in his heart!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Archie Mayo"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Harry Segall",
         "Harry Segall"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038300/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzOTUxMTYzMl5BMl5BanBnXkFtZTYwNTA5MzA5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Muni, Anne Baxter, Claude Rains | See full cast and crew »"],
      "reviews": [
         "I admit I'm a sucker for both postwar noir and movies about heaven, hell, the Devil et al, from \"Dante's Inferno\" through \"Petey Wheatstraw,\" so maybe I like this one more than you would. But I do like it a lot. Paul Muni is hilarious, mugging outrageously when he's not leaping through the air to rumble with devils or thugs. Never been the biggest Claude Rains fan--his prissiness wears on me midway through any film he's in--but he makes a good, nasty Satan. The scenes in Hell, which looks like the boiler room on the Titanic, are priceless. Lots of good character actors playing brawny devils, lunkheaded mooks, tough dames, flustered Man Fridays and such. The plots a little more clever than you'd expect from this kind of film, with a very nice twist at the end. Definitely worth seeing if you're a fan of the oldies.",
         "To begin, it's tough as nails to see a decent print of this public domain film. TCM has a very good 35mm print in their library, so I recommend seeing it there (unless you're fortunate to see it on the screen). ANGEL ON MY SHOULDER was written by Harry Segall, who also penned HERE COMES MR. JORDAN. The film is a delicious turnabout of its wonderful predecessor and Claude Rains turns in his angels wings for devils hoofs and, frankly, is much more deliciously at home. Anne Baxter is superbly understated as Barbara Foster and Onslow Stevens has a larger-than-usual role as her friend and Judge Parker's doctor/psychiatrist. Judge Parker and Eddie Kagle are both played by the great Paul Muni. Muni is a joy to watch in this picture. He rises to both comedic and extraordinarily sensitive moments in the film. And he does a few \"Scarface\" pantomime moments, brief elegant gestures, that show what a truly great screen presence he could be. The crucial scene in ANGEL ON MY SHOULDER is where Eddie, brought back from Hades by the Devil and now inhabiting the body of Judge Parker, is having a picnic lunch with his secretary/fiancé. Here he discovers all the truly important and wonderful things that life has to offer - all of which he lost out on because of his life of crime and immorality. Eddie is torn and tortured and Muni plays the inner torment with amazing sincerity. Helping a great deal is one of Dimitri Tiomkin's best, though least-known, musical scores. It is a far cry from his usual bombast and has many passages of great tenderness. Rains, of course, is marvelous and there are quite a few genuinely threatening moments in his performance. Fine support is given by James Flavin (who, in addition to his role as politico Bellamy is also heard off-screen as a district attorney, a very curious happenstance), George Cleveland (as the Judge's valet), Erskine Sanford as a minister, Hardie Albright as Smiley Williams and Fritz Leiber, Noble Johnson and Kurt Katch as residents of Hades. This is not a great film. But it's a very, very good film with some very fine sequences and performances. It deserves far better treatment than it has received since its copyright lapsed.",
         "It's the film everyone remembers from those Saturday afternoon TV film matinees. The producer, Charles R. Rogers, had a pretty bleak record when it came to producing films on his own (he was once a V.P. at Universal before going solo). But with \"Angel\" he knocked it out of the park. He inserted age-old movie favorties and combined them into one story. Gangsters, fights, comedy, drama, fantasy... what's not to love? \"Angel on My Shoulder\" (1946) offers up classic performances by such legendary stars as Paul Muni, Anne Baxter, and Claude Rains. All cast to type, they give performances that are timeless. When you think of any of these stars, think of them in this film and it will give you a pretty good idea as to what each was known for. Although this film was put together during the tail end of World War II and was designed as escapist fun, it holds up today. In fact, it begs for a good re-make. One was done for TV back in 1980, but fell flat. So bad was that version, that they should pay you to watch it. Yet if someone was to do it correctly today, they would have a real gem on their hands. If you haven't seen the original 1946 version, catch it on TV. It belongs in everybody's movie-watching repertoire.",
         "This film is a nice mixture of two great movies: the crime film SCARFACE (1932) and the fantasy HERE COMES MR. JORDAN. And it also is the only time that two of the best actors of the golden age of sound films worked in a film side by side in the same scenes of a movie.* I am referring to Mr. Paul Muni, who played Tony Carmonte in SCARFACE and Mr. Claude Rains, who played that beacon of heavenly fairness and decency Mr. Jordan in HERE COMES MR. JORDAN. (*The two actors actually appeared in a film before this: JUAREZ in 1939. But Paul Muni played Benito Juarez, and shared no scene with Rains as Napoleon III of France - the two leaders never met.) Muni's Eddie Kagle is a reprise of his Tony Carmonte, complete with Carmonte's deadly looking slit-like stare. But at the start of the film he is murdered by \"Smiley\" Williams (Hardie Albright - who is always smiling), and finds himself in the netherworld's lower regions. In some ways Eddie's discovery of Hell is among the best part of the film, as he sees the other inhabitants are all in a state of continuous agony and realization of their own sins. Eddie does not have sufficient time to suffer to become as zombie-like. A stranger comes to him, offering him an opportunity to get out of that place. Eddie is willing to hear the deal. The stranger is Rains, naturally playing the Devil (and thus joining the ranks of Walter Huston, Adolphe Menjou, Ray Milland, Laird Cregar, Ray Walston, and Edward Arnold). Rains is a businesslike Devil, who complains to his henchman that the place is too cold (the henchman increases the heat). He has nothing currently going on, when he has noticed Muni. Muni's Eddie Kagle resembles a Judge Parker, an honest, upright man who is running for governor of his state. Rains realizes that if Kagle can replace Parker, then he can ruin the Judge's campaign for cleaning up the corruption in his state. So Rains makes his offer to the eager Muni: if Kagle agrees to this switch, playing the role of Parker while the latter is in an enforced coma, and undoing Parker's campaign, Kagle will get a chance to even the score with good old \"Smiler\". Muni is definitely interested, but he wants a guarantee of no double-crossing. He knows his Devil as well as any other human, and he does not want old \"Smiler\" to get away. This is the main problem that perplexes Rains in the movie. He is the author of all the mischief in the universe, but he is also unable to fully control how that mischief is working (an interesting variation on the Devil - compare Rains here with Milland as \"Nick Beal\" or Walter Huston (for the most part) as \"Mr. Scratch\"). The best moment illustrating this problem: Rains gets Muni worked up to deliver a violent tirade that would send Judge Parker's campaign into the toilet. But a bunch of gangsters, opposed to Parker, arrange for the \"Judge\" to be met with a barrage of garbage thrown at him on stage when he's about to speak, knocking him out. Rains is flabbergasted by this, and he can't prevent it: the gangsters are doing his work too. Kagel/Parker is not condemned in the papers but praised for his bravery against the gangsters. Also, as the film progresses, Muni meets the Judge's girlfriend Barbara Foster (Anne Baxter). He falls for her, and she slowly \"corrupts\" him - he starts wondering if the Judge and Barbara don't have the better view of the world. The film is a good fantasy, that resolves well - a kind of a twist, in fact, on the conclusion of CASABLANCA, with Muni and Rains walking off together, tied by the knot of their agreement. But who will win - we are never certain until the end. The title of the film, by the way, is based on a line of dialog from a sermon that a minister (Erskine Sanford) is preparing and reads out loud.",
         "Paul Muni is a dead convict brought back to earth by the devil in \"Angel on my Shoulder,\" a 1946 film also starring Claude Rains and Anne Baxter. Muni is Eddie, a convict fresh out of jail who is killed by his partner Smiley and goes straight to you know where. Let's just say it's hot. The devil, played by Claude Rains, needs help himself. A Judge Parker is keeping too many candidates out of hell, and he sees that Eddie is a ringer for the Judge. So he arranges for Eddie to get into the judge's body as he sleeps so that he can ruin the judge's reputation and Eddie can get revenge on Smiley. But even the best-laid plans of the Devil can go astray. During and after World War II, films dealt with psychiatry, with angels, with death, and with people returning from the dead. All of this had to do with the emotional and adjustment problems that returning soldiers had and with the loss of loved ones in countless families. \"Angel on My Shoulder\" is along the same idea as \"Here Comes Mr. Jordan\" and \"A Guy Named Joe,\" and a close brother of \"Heaven Can Wait\" and the later \"The Bishop's Wife.\" This is an excellent example of the genre, with top acting by Paul Muni, Anne Baxter, and Claude Rains. Muni is great in a Bogart type of role - he gives a performance imbued with toughness and humor as a bad guy who begins to see the other side of evil. Anne Baxter is very good as his patient but suffering fiancée, endeavoring to understand the difference in the judge's personality. As the Devil, Claude Rains is inspired casting. He's elegant, charming and manipulative, and gets plenty nervous when he sees things aren't working out as he planned. Wonderful film, and a good chance to see the fine actor Paul Muni in a lighter role than he usually played.",
         "In HERE COMES MR. JORDAN, Claude Rains played an angel. Here he gets to play the opposite end of the game -- the role every actor loves to play, Satan. He is wry, menacing, and delicious as the master of evil who has met his match in a hood played wonderfully by Paul Muni. The story is interesting and the acting is first rate. See this one if you get the chance.",
         "Let out of jail, gangster Paul Mini (as Eddie Kagle) is shot dead by the \"double crossing rat\" who picks him up at the prison. Uncomfortable in Hell, Mr. Muni hooks up with wicked Claude Rains (as \"Nick\"), who seems to know his way around the underworld. Not guessing Mr. Rains is the devil in disguise, Muni walks with Rains through fire, and returns to observe the Living World. There, Rains arranges a body-switch with look-alike Judge Frederick Parker (also played by Muni). Muni is promised revenge on the crook who crossed him; and, Rains is unhappy with the Judge, who hasn't been sending many souls to Hell. So, criminal Muni embodies good Muni... Archie Mayo's \"Angel on My Shoulder\" isn't as well-remembered, or as original, as other films visiting the same territory; but, watching Muni and Rains makes up most of the difference. This version is played as a sometimes comic drama, and the stars are devilishly fun to watch. Also notable is Anne Baxter (as Barbara Foster), who plays the pretty fiancée Muni amusingly gropes with approval, then falls in love with. She may be his salvation. Perfectly cast Hardie Albright (as Smiley Williams) is no slouch; in once of the film's best scenes, he holds his own with Muni and Rains in the room. Others haven't as much to do, but they do it well. ******* Angel on My Shoulder (9/20/46) Archie Mayo ~ Paul Muni, Claude Rains, Anne Baxter, Hardie Albright",
         "Picture concerns about a gangster called Eddie Kagle (Paul Muni) who is based his way of living on what Omar Khayyan once said : ¨Live fully while you may and reckon not the cost¨ . He leaves the State Penitentiary where was imprisoned accused of murderous , Eddie makes a covenant with the devil (Claude Rains) and returns to earth for vengeance as an important judge . He becomes incarnated a kind judge and the problems emerge when is romanced with his girlfriend (Anne Baxter) , falling in love with her , but the good-heart mobster spoils the relationship . It's a romantic movie with a supernatural love story . Enjoyable romance tale in which the protagonist trio is sensational . Bemusing fantasy with excellent interpretation by Paul Muni (Scarface) in a comic character while he usually played historical or dramatic roles . Claude Rains(Casablanca) as an ironic and obstinate Devil is magnificent although in ¨Here comes Mr. Jordan¨ he played an Angel . Anne Baxter is enticing and attractive . Fine production design at the Inferno's recreation . The motion picture is well directed by Archie Mayo (Bordertown , Petrified forest , Black legion) in his last film , he's a specialist on noir cinema and worked with almost all Warner Brothers biggest stars (Paul Muni , James Cagney, George Raft , Humphrey Bogart) though also directed some comedy , as this film and with Marx Brothers, ¨One night in Casablanca¨ which had more pace and spirit that some of their later works . Rating : Entertaining and well worth watching .",
         "I didn't know anything about Muni, but I was hooked into this film by his performance. At nearly 50 when he made this movie, he quite effectively conveyed a boyish marvel when he crossed over from the dark side (trying not to include any spoilers). I believe his performance is what makes this film work. He brought comedy and dry wit into the scenes, without, himself, being too corny. He also brought energy and resilience. Watching the movie, I felt I was watching a 21st century actor. His performance is quite different than the somber, pensive performances of characters his age in noir films of that day. In summary, while this is not a great film, it is a gem just because it so different, made that way especially by Muni's performance.",
         "Angel on My Shoulder (1946) It's great to see Paul Muni in another role--he's a great actor who did too few films--and it's never bad to see Claude Rains. In this case Muni plays a con who has gone to hell, and Rains is the devil himself. They have an arrangement to go up to the surface of the earth and some trickiness ensues. It's fun, deceptive, sometimes humorous, sometimes romantically serious. Because the plot is a clear contrivance, the movie does have a slightly illustrative sense, the way \"Harvey\" does with James Stewart. But sometimes you forget about the devil and the deals he's made, and you just watch, and the best parts of the movie rise above the cleverness. This is director Archie Mayo's last film, and though he no Hollywood legend, he was a serious, consistent director, and this proves it."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": ["Charles R. Rogers Productions"],
      "summaries": [
         "Gangster Eddie Kagel is killed by a trusted lieutenant and finds himself in Harry Redmond Jr's special-effects Hell, where Nick/The Devil sees that he is an-exact double for a judge who Nick doesn't approve of. Eddie is agreeable to having his soul transferred to the judge's body, as it will give him a chance to avenge himself on his killer. But every action taken by Eddie (as the judge) results in good rather than evil and, to Nick's dismay, the reputation and influence of the judge is enhanced, rather than impaired by Eddie. And Eddie also falls in love with the judge's fiancée, Barbara. Even Eddie's planned revenge fails and Nick is forced to concede defeat. He returns to Hell, taking Eddie with him, after Eddie has extracted his promise that Nick will not molest the judge or Barbara in the future.",
         "The Devil arranges for a deceased gangster to return to Earth as a well-respected judge to make up for his previous life."
      ],
      "budget": 0
   },
   "movielensId": 960,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1946-09-20",
      "dvdReleaseDate": "2004-01-01",
      "directors": ["Archie Mayo"],
      "runtime": 100,
      "movieId": 960,
      "title": "Angel on My Shoulder",
      "mpaa": "",
      "actors": [
         "Paul Muni",
         "Anne Baxter",
         "Claude Rains",
         "Onslow Stevens",
         "George Cleveland",
         "Erskine Sanford",
         "Marion Martin",
         "Hardie Albright",
         "James Flavin"
      ],
      "imdbMovieId": "0038300",
      "originalTitle": "Angel on My Shoulder",
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "youtubeTrailerIds": ["dGJA9rMWpos"],
      "plotSummary": "Gangster Eddie Kagel is killed by a trusted lieutenant and finds himself in Harry Redmond Jr's special effects Hell, where Nick/The Devil sees that he is an-exact double for a judge of whom Nick doesn't approve. Eddie is agreeable to having his soul transferred to the judge's body, as it will give him a chance to avenge himself on his killer. But every action taken by Eddie (as the judge) results in good rather than evil and, to Nick's dismay, the reputation and influence of the judge is enhanced, rather than impaired by Eddie. And Eddie also falls in love with the judge's fiancée, Barbara. Even Eddie's planned revenge fails and Nick is forced to concede defeat. He returns to Hell, taking Eddie with him, after Eddie has extracted his promise that Nick will not molest the judge or Barbara in the future.",
      "tmdbMovieId": 22688,
      "avgRating": 3.49133,
      "releaseYear": "1946",
      "numRatings": 173,
      "posterPath": "/5GvCXu1nYiqhVoXYvAjH5aE8DEW.jpg"
   }
}