{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "corruption",
            "id": 417
         },
         {
            "name": "mayor",
            "id": 1919
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "snake oil",
            "id": 13147
         },
         {
            "name": "medicine show",
            "id": 13148
         }
      ],
      "imdb_id": "tt0041509",
      "video": false,
      "title": "The Inspector General",
      "recommendations": [
         34151,
         48375,
         19827,
         34127,
         48420,
         54494,
         34681,
         90926,
         332936,
         45675,
         39140,
         118991,
         73376,
         15494,
         36751,
         32035,
         56385,
         18966,
         59566,
         21896
      ],
      "backdrop_path": "/feY7yQNWWyJ1zQ8kVJkrExZvK6n.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Georgi",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc2a7",
               "name": "Danny Kaye",
               "profile_path": "/ujGKKit18fHDsF0ZDPTxTFsDbX7.jpg",
               "id": 70668,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Yakov",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc2ab",
               "name": "Walter Slezak",
               "profile_path": "/1XOOkCtIMjsYGF2lJsIcZMw7UTx.jpg",
               "id": 37884,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Leza",
               "gender": 1,
               "credit_id": "52fe4586c3a36847f80cc2af",
               "name": "Barbara Bates",
               "profile_path": "/ca2fjt394lIZccuYpmPF7rTCj6w.jpg",
               "id": 10611,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe4586c3a36847f80cc2b3",
               "name": "Elsa Lanchester",
               "profile_path": "/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg",
               "id": 2926,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "The Mayor",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc2b7",
               "name": "Gene Lockhart",
               "profile_path": "/7IL5fx1mfhCiMAvYXSiY1Dj7yky.jpg",
               "id": 30234,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Kovatch",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc2bb",
               "name": "Alan Hale",
               "profile_path": "/7ZTTJ08iSQYBaDvfgfhmGpqCrtx.jpg",
               "id": 8729,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Colonel Castine",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc2bf",
               "name": "Walter Catlett",
               "profile_path": "/Y5kIRVTNaKuMy8DyrFDP1kwOub.jpg",
               "id": 13819,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Inspector General",
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc2c3",
               "name": "Rhys Williams",
               "profile_path": "/jaD2gAkx9AhNABqDobe9D23oexT.jpg",
               "id": 82835,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4586c3a36847f80cc2c9",
               "name": "Henry Koster",
               "profile_path": "/tihVLXBhbDiif3u3DyZI5HJ8PZB.jpg",
               "id": 33064,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5684176ac3a3684bcc019898",
               "name": "Philip Rapp",
               "profile_path": null,
               "id": 195975,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "568417769251417def018497",
               "name": "Harry Kurnitz",
               "profile_path": "/AavMMtPOF9e6qjktWazo9gJzSSq.jpg",
               "id": 17843,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56b7ebcfc3a36806f800d11e",
               "name": "Elwood Bredell",
               "profile_path": null,
               "id": 103050,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "597b4518925141364a0118ce",
               "name": "Johnny Green",
               "profile_path": "/r5zYJNDDygX7Vtnp8VZc7S7jqAG.jpg",
               "id": 175505,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "597b45079251413662011a5f",
               "name": "Jerry Wald",
               "profile_path": "/f1eGCdVgtKLU9DYcwquzxWhZ86.jpg",
               "id": 29098,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "597b450fc3a368375a01221f",
               "name": "Sylvia Fine",
               "profile_path": null,
               "id": 1242315,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "597b452dc3a368373501172d",
               "name": "Rudi Fehr",
               "profile_path": null,
               "id": 7126,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "597b4533c3a368376c00fc55",
               "name": "Robert M. Haas",
               "profile_path": null,
               "id": 14448,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "597b4539925141364a0118e9",
               "name": "Fred M. MacLean",
               "profile_path": null,
               "id": 13974,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "597b453f925141363f011e36",
               "name": "Travilla",
               "profile_path": "/9PSAdjsMLjnNgo6tV5meAtkRPWN.jpg",
               "id": 11445,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.546409,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40206,
      "vote_count": 20,
      "budget": 0,
      "overview": "An illiterate stooge in a traveling medicine show wanders into a strange town and is picked up on a vagrancy charge. The town's corrupt officials mistake him for the inspector general whom they think is traveling in disguise. Fearing he will discover they've been pocketing tax money, they make several bungled attempts to kill him.",
      "similar": [
         193893,
         483,
         984,
         96,
         10694,
         4771,
         25376,
         429733,
         14556,
         2142,
         1266,
         1701,
         431,
         1368,
         769,
         261023,
         75780,
         281,
         339692,
         395834
      ],
      "original_title": "The Inspector General",
      "runtime": 101,
      "poster_path": "/3QM2wpD7HQ0VksuVC0maPP3icwc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1949-12-31",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "A new comedy kayo from Warner Bros.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henry Koster"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Philip Rapp",
         "Harry Kurnitz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041509/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzAzMDM2OTMxMl5BMl5BanBnXkFtZTcwNjQ3NDgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny Kaye, Walter Slezak, Barbara Bates | See full cast and crew »"],
      "reviews": [
         "An illiterate (Danny Kaye) along with his boss (Walter Slezak) are wandering and acting as medicine men into a provincial town wherein panic when he's detained for vagrancy charge but he's misidentified as a feared Inspector General who comes to check up on them whom the corrupter town officers ( the Mayor : Gene Lockhart and married to Elsa Lanchaster and another officer played by Alan Hale ) think is secretly moving in disguise . Then they make various bungled tryings to murder him . Meanwhile , he falls in love with a beautiful maid (Barbara Bates) who is serving to the Mayor. The film is a Danny Kaye recital , he sings , dances, stooges , makes acrobatics , tongue twister and puts faces and grimaces . It's a pretty amusing farce with the master comic and displays much choreography and musical numbers . Silya Fine , Kaye's wife , is the lyricist , composer , besides producer and dialogs writer , and responsible for many of the best known musical routines and songs for her husband . The best gags are developed on the Charles Chaplin imitations when Kaye is having lunch ; the events in the room with several hosts that seem Marx brothers sketches ; in addition , the comic numbers in the military trainer headquarter . The motion picture is well directed by Henry Koster . Picture is a vehicle Kaye , he's an authentic comic and real farceur . If you like Kaye's crazy interpretation ,you will most definitely enjoy this one .",
         "A pleasant farce with a fine cast, \"The Inspector General\" gives Danny Kaye a chance to show off his many talents, and also tells a story that is quite humorous as long as you do not take it too seriously. Kaye plays Georgi, an illiterate traveling huckster who helps his boss Yakov (Walter Slezak) sell useless medicines to gullible peasants. (The sequence where they try to sell their \"elixir\" is one of the movie's best scenes.) Georgi visits a small town, where through a series of coincidences, he is mistaken by the town's leaders for the Inspector General, an important official with sweeping powers to punish and reform. Half of the town fawns on him, while the other half panics over what he will discover in his \"inspection\". Kaye just wants to leave town before they figure out who he really is, but plenty of complications arise that keep things going for quite a while. Kaye gets to sing, dance, and generally entertain the audience. The supporting cast is filled with fine character actors like Gene Lockhart, Elsa Lanchester, and Alan Hale, who add to the humor. Not a lot of big laughs, but a steady stream of good-natured comedy all the way through. This is an enjoyable movie recommended for anyone who likes musical comedy.",
         "Hysterical. Danny Kaye is a comedy genius. The Gypsy song was the best part of the film. (Zummm-shtok-shtok-hahaha) This is worth a look for this scene alone. It was fun watching the crowd get into it. I'd guess that scene was mostly ad-libbed. He clearly was in control. I bought the DVD (public domain) just for that scene. The supporting cast did a great job too. Slezak nearly stole all of his scenes and Hale Sr. was perfect in support. And the costume designer deserved at least a nomination for the Oscar. You can't take this one seriously. But then Danny Kaye lived to entertain. And few did it better.",
         "I loved it as a kid and i love it even more now. This is a classic movie about mistaken identity, which inspired so many later movies. A tramp (Danny Kaye) is mistaken for the Inspector General by the corrupt mayor and his equally corrupt officials. I find Danny Kaye one of the best performers of our times and he has given one of his best performances here. Look at him rolling like a dog (a scene so touching) or imitating a fish in the beginning or singing 'drink gypsy' later on. An institution in himself. The movie can be hilarious, very touching, delightful and thrilling at the same time. It's a treasure.",
         "Danny Kaye's films with Samuel Goldwyn established him as a leading movie comedian - singer from 1944 through the late 1940s. For a number of years after he continued his popularity without Goldwyn in films like \"Knock on Wood\", \"The Court Jester\" and \"Merry Andrew\". It is likely that \"The Court Jester\" is his best film, but \"The Inspector General\" is close to the top. Based on a 19th Century satiric play by Nicolai Gogol, Kaye plays Georgi, a decent fellow who works for the bullying Yakov (Walter Slezak). Yakov and Georgi travel around the countryside selling \"Yakov's elixir\" which is supposed to cure all kinds of illnesses (that Kaye sings in a tongue-twisting song by Sylvia Fine, his wife). But they are forced to flee when Georgi tries to stop an elderly woman from wasting her money on the elixir. Naturally Yakov is upset, and sends Georgi away until he learns to be crooked. Yakov has been using a fake official document signed by Napoleon as a come on in his sales pitch. Georgi is carrying it. He is arrested by the town constable (Alan Hale Sr.) for vagrancy, but the latter reads the letter. As the Mayor (Gene Lockhart) and his cohorts are awaiting (with dread) a visit by Napoleon's Inspector General to check their records (they have been feathering their nests), they think that Georgi is this Inspector General. When Yakov comes to town he quickly grasps the situation, and pretends he is the \"Inspector's\" servant. Slezak knows that there are real opportunities here. The funny thing is that Gogol's play is not quite like the film. First of all, Gogol was writing a critique of government corruption in the Russian Empire under Tsar Nicholas I (1825-1855). Gogol was a religious mystic and satirist (best recalled for his unfinished novel about serfdom, \"Dead Souls\", and his novellas \"The Diary of a Madman\" and \"The Overcoat\"). Normally Nicholas was a humorless despot, who hated intellectuals. But he liked THE INSPECTOR GENERAL, which attacked the worst aspects of Russian local government corruptions that the Tsar did want to see eradicated. Because he approved, the play was a great success, and became one of the few 19th Century plays that became part of the permanent world repertory. But Gogol's targets were Russian, not French. Napoleon is not a background figure in the play. The Inspector General (actually the title is \"The Government Inspector\" in Russian) is from the Tsar. They have heard rumors of the corrupt practices, and are checking them. Georgi's character is not such a well-intentioned type in the play as he is in the movie. He is as willing to feather his nest as Yakob is, and they prove to be a highly successful team. This is because the Mayor and his cohorts are quite willing to bribe their way out of the current investigation. This includes selling the Mayor's wife for sex, and paying out much in bribes and \"gifts\". And in the end, after \"Georgi\" and Yakob leave with their loot, the Mayor thinks he will be called to St. Petersburg for some really important post. But months later they hear of a letter circulating in the capital from \"Georgi\" boasting of how he fooled the Mayor and his cohorts. Then, just as things couldn't get worse, a servant announces the arrival of \"a Government Inspector\" to review the books. Everyone freezes in terror as the curtain falls. The film softens \"Georgi's\" character, leaving Yakov as the greedy one (although Slezak does redeem himself at the end). The Mayor and his cohorts (who do things like collecting for a church bell but pocketing the money themselves) do try to kill off the Inspector General - there is a funny sequence at a party where \"Georgi\" sings a song about \"sing Gypsy, dance Gypsy\", and keeps on just avoiding drinking his doctored drink during the song. Georgi's guardian angel protects him. He also meets Leza, a servant (Barbara Bates) and falls for her. He debates how to appear before her as a General - should he be elegant like an Englishman, arrogant like a Russian, or smart like a German. In some ways \"Soliloquy for Three heads\" may be the best of the numbers in the film. Although watered down from Gogol's stunning comic play, enough entertainment value remains in the film to make it worthwhile viewing, and a highpoint in appreciating Kaye's movie career.",
         "Danny Kaye is absolutely phenomenal in this movie! Be it the silly patter songs, slapstick at its purest, his quick timing, his wide-eyed innocent reactions to the corruption of the councilmen, or his heartwarming moments of honesty and warmth. He will send kids and adults alike into fits of laughter with his antics, and makes a lovable and memorable figure out of what could have been a very dry character. It seems as though the director took Gogol's character and rewrote it specifically for Danny Kaye, a common practice in those days. But Kaye is not the only one in the movie that shines. The other characters may serve as foils to Georgi, but they in themselves are funny. Maria's constant overtures to Georgi, the poor councilman that is trying to resign but no one will let him, poor Kovatch who can't seem to hang onto a uniform, the twins who are constantly confusing Georgi, and especially wily Yakov. Yakov in himself is a great character, because he is a villain but in his despicably you can't help but admire his clever ways of keeping Georgi from getting caught. The obligatory love story is weak, yes, but in this case it is a good thing, because the real humor resides in this classic tale of mistaken identity, not in the love story. I rate this a nine out of ten because I really feel that the love story was unnecessary, although the love story does lend itself to a lovely song, true. Above all, this is Danny Kaye truly living up to his reputation as a superstar of his era, almost like the Chaplin of his time, only better since most of his talent shows in the patter songs and lines. He is supported by strong actors, and overall it makes a wonderful, classic film for the entire family.",
         "This is a movie! Danny Kaye is one of the lost gems. His movies are almost all classics. Whatever they lacked on the drawing board, he added to. This one was a classic story line guaranteed to be great. Some scripts are just great. \"Arsenic and Old Lace\", \"The Front Page\", movies like these are destined to be entertaining no matter how badly done. When done well, they are spectacular and spectacular! Kaye is a poor slob who thinks he is going to be hanged by a corrupt town, but then events take place which I won't spoil in this review. Trust me, you won't stop laughing. The voting for this movie indicates men like it slightly more than women. Danny Kaye was a man's man, and his heroines were always men's women, the kind so perfectly beautiful that female viewers can't help but get jealous. Female viewers like the plain Jane as female leads, like in the movies of the last twenty years. In this movie, the lead female is one of the most gorgeous you'll ever see. Kaye always managed to get paired with the most beautiful girl in the show. Then there's Danny Kaye's pure talent. He sings not only with talent, but with affection and timing. Perfect comic genius makes him a delight to watch. And the rest of the cast is splendid. Not just one of the best comedies, but one of the best movies of all time.",
         "Watching this was enjoyable. The movie started off somewhat slowly, and took its time picking up the pace. However, the pace quickly picked up speed when Danny Kaye came on screen. This is partly because his partner shows up at the same time. Walter Slezak does a fantastic job of contrasting Kaye throughout the movie, but more of that later. Danny Kaye's performance here is not quite as seamless as many. He does not seem to have the same audacity he displays in later movies, such as The Secret Life of Walter Mitty and The Court Jester. It is also different in that, although it includes the usual confusion, plot twists, and multiplicity of plans going on at once, these elements are not executed as beautifully as in, for example, The Court Jester. Thus these scenes become comedic background, still enjoyable to watch, but not the masterpiece one may have become accustomed to. However, the movie was far from terrible. There were moments which, as I watched them, made me think, \"That's so Danny Kaye.\" He has many of the same mannerisms and little twitches that make him so much fun to watch, along with an array of songs that would tie a normal tongue in knots. He looks quite dashing in his military uniform, and his character's innocence is just so much fun to see in Danny Kaye's brilliant blue eyes. His character (Georgi) is also contrasted masterfully with Slezak's (Yakov), making this movie a success. Yakov is so mean to poor Georgi (as well as everyone else) that the viewer simply must fall in love with the poor boy. Kaye plays a young man, very nearly a boy, while Yakov is so jaded and immoral. It is Yakov's cruelty to Georgi that endears Kaye's character to the viewer. To sum up, The Inspector General is a lighthearted movie involving superb writing, excellent juxtaposition, and a wonderful star and supporting villain.",
         "***SPOILERS*** ***SPOILERS*** Before you read this I want to tell you that I hope my English is good because I am Dutch. The Inspector General is one of those real Danny Kaye movies. I think that most of the youngsters of this time don't know him or haven't ever heard of him, that thought makes me sad, because I am 15 and he is my idol. Danny Kaye, what can I say about this great man. In this movie he shows great acting, singing and dancing. He accidentally becomes the inspector-general of a town called Brodny. Before this he sold special drinks with Yacov a gipsy (Walter Slezak) that should crack you up but it is actually poisoned. The mayor and his men want Georgi(Danny Kaye) dead so that they can climb to higher places. Georgi met a girl named Leza(Barbara Bates) who worked as a kind of a maid in the house of the inspector-general. First she didn't really like him but when he began to sing a wonderful song to her(Happy Times), she was already starting to love him. Meanwhile Georgi is concerned about how he should handle with this confusing situation. He can't believe he is the inspector-general. A lot of humour follows. At last the real inspector-general turns back to Brodny from a visit to the emperor (I thought) and soon Georgi and Yacov, who gave Georgi 'advice'(he wanted him actually dead so that he could get a lot of money from the townleaders)are caught and would soon be hanged. The real inspector-general and his men come to the jail to take Georgi and Yacov outside to kill them. Yacov made it to steal the papers of the inspector-general and gave them to Georgi so that all the people think again that he is the inspector-general, but Georgi admits he isn't the inspector-general and admits that he can't even read or write. The real inspector-general appreciates this so much he let them go and makes Georgi mayor and Yacov a very high soldier. So this story knows a happy end. The songs: Hail to Brodny, Happy Times, Yacov's Elixer, Arrogant, Elegant, Smart and the Gipsy Drinking Song touched me very much and are of course written by Sylvia Fine. A great movie with a very good cast.",
         "This is a nice little bit of fluff. It has more Gogol in it than you might expect. It's not really tha-a-at good, but I gave it a 7 because it's *completely* harmless, and really, Danny Kaye is so lively and charming, and so few actors have that quality of total innocence. He looks quite handsome in the officer's fancy uniform (until he starts making with the funny faces). A good one for kids."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "An illiterate stooge in a traveling medicine show wanders into a strange town and is picked up on a vagrancy charge. The town's corrupt officials mistake him for the inspector general whom they think is traveling in disguise. Fearing he will discover they've been pocketing tax money, they make several bungled attempts to kill him.",
         "Kaye is a wandering shill for snake-oil when he is mis-identified as an Inspector General come to examine a little corrupt town. Zaniness ensues, focused on Kayes performing talents rather than the town's corruption."
      ],
      "budget": 0
   },
   "movielensId": 963,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-12-31",
      "dvdReleaseDate": "2003-10-07",
      "directors": ["Henry Koster"],
      "runtime": 101,
      "movieId": 963,
      "title": "The Inspector General",
      "mpaa": "",
      "actors": [
         "Danny Kaye",
         "Walter Slezak",
         "Barbara Bates",
         "Elsa Lanchester",
         "Gene Lockhart",
         "Alan Hale",
         "Walter Catlett",
         "Rhys Williams"
      ],
      "imdbMovieId": "0041509",
      "originalTitle": "The Inspector General",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["t3ehZvLL2UE"],
      "plotSummary": "An illiterate stooge in a traveling medicine show wanders into a strange town and is picked up on a vagrancy charge. The town's corrupt officials mistake him for the inspector general whom they think is traveling in disguise. Fearing he will discover they've been pocketing tax money, they make several bungled attempts to kill him.",
      "tmdbMovieId": 40206,
      "avgRating": 3.54466,
      "releaseYear": "1949",
      "numRatings": 571,
      "posterPath": "/3QM2wpD7HQ0VksuVC0maPP3icwc.jpg"
   }
}