{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sheriff",
            "id": 798
         },
         {
            "name": "billy the kid",
            "id": 5672
         },
         {
            "name": "doc holliday",
            "id": 9550
         }
      ],
      "imdb_id": "tt0036241",
      "video": false,
      "title": "The Outlaw",
      "recommendations": [
         44098,
         41604,
         26283,
         43370,
         29966,
         64378,
         26174,
         32940,
         41058,
         72241,
         30025,
         25633,
         94139,
         160783,
         80705,
         56152,
         22356,
         27443,
         28023,
         35017
      ],
      "backdrop_path": "/zpjQ0DwpqRa7dXKLidr2fG2wGfT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Rio McDonald",
               "gender": 1,
               "credit_id": "52fe4448c3a368484e01a557",
               "name": "Jane Russell",
               "profile_path": "/hmGsWi5KQaNlD5b9MFQ5eTYli5v.jpg",
               "id": 11165,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Billy the Kid",
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a55b",
               "name": "Jack Buetel",
               "profile_path": "/2Y0EAnrol1pbqp1iid3nZbtvm96.jpg",
               "id": 89018,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Pat Garrett",
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a55f",
               "name": "Thomas Mitchell",
               "profile_path": "/1Tiiouk77NtxSmdknoN4ny5kT9j.jpg",
               "id": 3383,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Doc Holliday",
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a563",
               "name": "Walter Huston",
               "profile_path": "/17N08QrQ6Am3hQD5noz5zozGaFH.jpg",
               "id": 19020,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Guadalupe",
               "gender": 1,
               "credit_id": "52fe4448c3a368484e01a567",
               "name": "Mimi Aguglia",
               "profile_path": "/m6On1atyXyhDMcSOO4fPr5UoQzo.jpg",
               "id": 89019,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Charley Woodruff",
               "gender": 0,
               "credit_id": "52fe4448c3a368484e01a57d",
               "name": "Joe Sawyer",
               "profile_path": "/7waP4U3fOYpqUr8jJd4qAvgWWqK.jpg",
               "id": 3341,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Stranger",
               "gender": 0,
               "credit_id": "52fe4448c3a368484e01a581",
               "name": "Gene Rizzi",
               "profile_path": null,
               "id": 1090630,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Deputy",
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a58b",
               "name": "Ben Johnson",
               "profile_path": "/yqPEXD23jLYxmCCLNWtyQ3tJ89V.jpg",
               "id": 8258,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Pablo",
               "gender": 0,
               "credit_id": "52fe4448c3a368484e01a58f",
               "name": "Julian Rivero",
               "profile_path": "/lYFhu9W0Z1Sqjg417zXJtfXNEOR.jpg",
               "id": 161702,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a53b",
               "name": "Howard Hughes",
               "profile_path": "/v3c00dpgMKMN5Pigg0XWzVt2vWE.jpg",
               "id": 13348,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a541",
               "name": "Howard Hughes",
               "profile_path": "/v3c00dpgMKMN5Pigg0XWzVt2vWE.jpg",
               "id": 13348,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a547",
               "name": "Jules Furthman",
               "profile_path": null,
               "id": 4297,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a54d",
               "name": "Gregg Toland",
               "profile_path": "/6DKcT5fCniS4gIEEEqsLkZC6QeK.jpg",
               "id": 8504,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4448c3a368484e01a553",
               "name": "Wallace Grissell",
               "profile_path": null,
               "id": 34078,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4448c3a368484e01a56d",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a573",
               "name": "Ben Hecht",
               "profile_path": "/is5faYjaFObagG3b8xgwocMkUcX.jpg",
               "id": 4341,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4448c3a368484e01a579",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a587",
               "name": "Lucien Ballard",
               "profile_path": null,
               "id": 3351,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4448c3a368484e01a595",
               "name": "Victor Young",
               "profile_path": null,
               "id": 26026,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "573e5a94c3a3687ae2000522",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 2.946537,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22613,
      "vote_count": 19,
      "budget": 0,
      "overview": "Newly appointed sheriff Pat Garrett is pleased when his old friend Doc Holliday arrives in Lincoln, New Mexico on the stage. Doc is trailing his stolen horse, and it is discovered in the possession of Billy the Kid. In a surprising turnaround, Billy and Doc become friends. This causes the friendship between Doc and Pat to cool. The odd relationship between Doc and Billy grows stranger when Doc hides Billy at his girl, Rio's, place after Billy is shot.",
      "similar": [
         11967,
         12160,
         49849,
         9086,
         11969,
         196,
         429,
         1368,
         33,
         7299,
         755,
         253,
         76640,
         44896,
         57201,
         11886,
         452507,
         11509,
         9825,
         6972
      ],
      "original_title": "The Outlaw",
      "runtime": 116,
      "poster_path": "/z2euv0z2PQlXzS5xYPAVVP221Vn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Howard Hughes Productions",
         "id": 12258,
         "origin_country": ""
      }],
      "release_date": "1943-02-05",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Tall.... Terrific.... and Trouble!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Howard Hughes",
         "Howard Hawks"
      ],
      "runtime": 116,
      "synopsis": "In 1880, in Lincoln, New Mexico, newly appointed sheriff Pat Garrett (Thomas Mitchell) is pleased to see his old comrade Doc Holliday (Walter Huston) arriving on the stage coach. Doc Holliday has had his horse Red stolen and has a hunch the horse may be in Lincoln. In town, they get a lead that a horse fitting Doc's description is tied up by the dentist's office. As they head that way, Pat has to deal with a gun waving drunk at the saloon. Pat's technique is to smile and feign friendship with one hand and punch him with the other. This is a recurrent habit with Pat, throughout the rest of the film. The horse is in the possession of William Bonney, who says he bought it and is determined to keep it, despite Doc's claim that it was stolen. At the time William Bonney, known as Billy the Kid, was the most famous gunslinger of the southwest, wanted dead or alive. Billy was said to be charming, attractive and a favorite with girls. Billy (Jack Buetel) is both good looking and polite, Doc is experienced and careful, so a gunfight is avoided despite each being inflexible, as each admires the other's reputation. This does not sit well with sheriff Pat, who is unhappy that his youth is gone without having done anything notable. He was hoping to arrest Billy or take credit for having shot him dead. Frustrated, Pat orders both of them to leave Lincoln by afternoon the next day. Doc and Billy proceed together to the saloon, a classic establishment for drinking and gambling and confrontations. At the saloon, a young tough requests to talk with Billy privately, offering to help in setting a trap to assassinate Doc, but his intention is to kill Billy. Billy recognizes the deceit in the nick of time and shoots the young tough dead, in self defense. Billy and Doc calmly continue drinking and playing poker. Doc wins more money than the horse was worth, so he is even in that respect. In a surprising turnaround, Billy and Doc become friends. As Billy has practically no money left, Doc invites Billy to bunk with him for the night if he doesn't have a girl. Billy declines, choosing instead to bed down in the barn, in front of his horse. A few moments after Billy takes the gun belt off his waist, a shadow is seen at a dark corner of the barn, and shots are fired towards Billy. Billy takes off his spurs, throws them, drawing shots, makes other noises, drawing other shots, and after the sixth shot he jumps on the shadow and overpowers someone. Billy realizes that he has overpowered and subdued a female, and he warns \"Quit struggling, lady or the rest of your dress will get ripped\" as he has his way with her, in the dark shadow. When things have calmed down, we get a clear look at bosomy and sultry Rio McDonald (Jane Russell) in the hay. Billy asks why, she explains that Billy killed her brother in a gunfight. He talks back calmly to her, saying he is sorry it happened but he had not sought the quarrel, and then it was kill or die. Rio makes no fuss or comment about being subdued and getting her dress ripped. In the morning as Billy leaves the barn, he is surrounded by a group of boys fascinated by his reputation, and he shows off by shooting a hole lengthwise through a wooden stick. Back at the saloon, he is again with his new friend Doc when Pat and a squad of deputies arrive wanting to arrest Billy for the previous day's killing, even though it most likely was self defense, as the other man's gun was on the floor. Doc takes Billy's side against his old friend Pat. In a confrontation, Pat wounds Billy by a flesh wound on the thigh, but Doc arranges things so they both are able to escape on horseback leaving the deputies behind. Seeing that Doc and Billy have become comrades as Pat and Doc were in the past, a tremendous jealousy arises in sheriff Pat, and his former friendship with Doc is over. As Billy's wound needs tending, Doc takes him to hide in the isolated house where his putative girl friend Rio lives with her aunt. There, Doc asks Rio to take care of Billy, giving precise instructions as to how to care for the wound, while he continues running to throw Pat Garrett and his deputies off track. Very reluctantly, pouting, Rio agrees to hide Billy and tend to his wound. After seeing Billy weak and helpless, and in her power, the sultry Rio finds herself attracted by Billy's good looks. On multiple occasions the aunt wants to turn Billy in, but Rio nixes the idea or thwarts her plans. After having watched over Billy in bed for a time, Rio decides to kiss him. Slowly, she gets up from a chair, the camera takes the point of view of Billy's eyes, Rio approaches, flaunting her bosoms, the romantic music gets louder and louder, we see her face in slowly increasing magnification, finally mostly her lips, her lips parting in the throes of desire, just about to touch the mouth of the semi-delirious Billy [and half the men in the 1946 audience probably experience an orgasm] A man comes to the door who seems to be an old acquaintance of the aunt, and Rio energetically blocks his entrance to maintain Billy's whereabouts secret. The scene hints that the aunt might be in the habit of entertaining gentlemen for a fee. A few days later, Billy has the chills, and no amount of blankets will keep him warm. Rio has been warned that if this happens, he must be kept warm or he will likely die. She starts undressing, tells the aunt to leave the room and announces with assurance, \"I'll warm him up.\" Her ministrations must be powerful, for his fever leaves him that night, and he regains consciousness the next day, plus his appetite. While Billy heals, Doc has been playing hide and seek with sheriff Garrett and deputies in the rock canyons, with many felled by rifle fire from heights. After weeks, Doc comes back to Rio's house, planning to flee the area together with Billy and escape Garrett's jurisdiction. New tensions develop as Doc realizes that Rio has become Billy's girl friend, and they argue again as to who owns the horse Red. Doc insists that Billy can't take both Rio and the horse from him, bringing up the old question of whether a man needs his horse more than his girl, or vice versa. Doc offers Rio to keep the horse, and Billy chooses the horse over Rio, so either man values Rio less than the horse. With that settled, Rio remains in the house, theoretically as Doc's girl, and both men leave on horseback. However, on the first night that they camp out, Doc sneaks out with his old horse Red, leaving Billy alone. Having thus been betrayed by Doc, Billy returns to the house to claim Rio. He finds Rio in the bedroom, glares at her, she looks back in some fear. Billy tells Rio he wants her this time to keep her eyes open and look at him in the eyes while he does it, and approaches her as the image fades to black. With Rio under his control, Billy retraces his steps intending to leave Rio with Doc and take back his horse, but Garrett has tracked both Doc and Billy while they were distracted by the horse versus Rio disputes, and by playing one against the other he surprises, disarms and handcuffs both of them, and starts to lead them back to town. At the first ridge, they see smoke signals indicating Indian war groups are active in any of the two directions they might take, and understand they will most likely be captured. To improve their chances, Garrett frees both men and rearms them. Warlike Indians in large numbers approach. Billy knows a trick that helps them escape: They lasso Joshua trees and drag them as they gallop, creating huge clouds of obscuring dust. During this galloping chase, we get to stare hard at Rio's bouncing cleavage for minutes, while in the background is a lot of dust, through which dozens of Indians can be glimpsed riding and hollering. In a narrow twisting canyon, when the Indian groups are totally blinded by the dust, the four manage to escape. The four make it to an isolated house where all the plot threads are resolved after complex confrontations resulting from the ways in which Doc, Billy, and Pat have all deceived and double crossed each other and continue their manipulative tricks to the end. Pat shrieks to Doc as he realizes the other two have shoved him into irrelevance, \"You're not going with him! Everything was fine between us till he came along!\" Doc Holliday feels old and sick and wants to die, but wants to die shot by Billy, whom he has sort of adopted as a worthy successor. Pat Garrett wants a bit of fame for having captured or killed Billy. Billy wants to live and be free. Billy and Rio get to smolder intensely in one more scene of towering sexuality, as Billy needs to calm down and Rio is overwhelmed by a desire to help him achieve total relaxation. Doc challenges Billy to a duel, expecting to lose, but Billy refuses to draw although Doc tries extreme measures to provoke him, grazing first his hand, then his ears, with bullets. In the end, Doc is shot by Pat. After Doc is buried, Pat suggests a deal to Billy, that he should take Doc's two guns in exchange for Billy's two guns, that way Pat could claim to have shot Billy, and Billy would be thought dead and could continue free with no one looking for him. He assures Billy that the guns are loaded. Billy tries on Doc's gun belt, handles and twirls the guns, comparing them to his own, and agrees, but he senses a trick, and exchanges holsters only, not the guns. So when Pat tries to murder Billy, the gun in his hand does not fire, as the firing pins had been removed! Billy is in full control! They set up a tomb marker over Doc's grave, reading HERE LIES WILLIAM BONNEY, 13 July 1881. Finally, Billy starts to ride off, stops, then turns in his saddle to look back at Rio. She hesitates, unsure of what he means, then smiles and jumps on the back of Billy's horse and they ride away together.",
      "writers": ["Jules Furthman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036241/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczODEwNzIwOV5BMl5BanBnXkFtZTcwNDQzMzU1MQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Buetel, Thomas Mitchell, Jane Russell | See full cast and crew »"],
      "reviews": [
         "Not too many movies create myths. Anyone who read Harold Robbins', \"The Carpetbaggers\", (some 40 years ago) which in turn spawned \"Nevada Smith\", gets a superbly fictionalized accounting of Howard Hughes. Such fiction prefixes reality. It took a great number of years before I finally saw \"The Outlaw\" - an eagerly awaited event. I've attempted to view the AMC-aired movie some three times - but got so antsy that I abandoned it. Few movies of this caliber have been so uneven. And yet it endures. Vintage alone gives the film status. There's nothing wrong with anecdotal (vignette) - points-of-view movies, but in \"The Outlaw\", it was like watching one of those lumbering, exasperating silent films: where the actors stand across from each other, and each speaks their lines as if orchestrated by an off-stage conductor. Spontaneity is not this movie's long suit. The actors: Jack Beutel is one of the most beautiful men to ever stand before a camera. His eyes are smoldering, his gaze laconic, his smile cheeky one moment and sensuous the next. Walter Huston is a young man in a middle-aged body; Thomas Mitchell (Scarlet's daddy in 'Gone With the Wind') is shifty, Irish, as conniving as Wally Beery, sniveling and crafty. And then there's the statuesque Jane Russell. Robbins gave us the intimate details of the suspension bridge-designed brassier - and Jane herself speaks of how she finally pulled the damn thing off and lined her breasts with a few Kleenex. She is as luscious as a near-nude Barbie doll, she is 19 years old, her lips inspire poetry - yet her voice is as monotonous as the Valley-inspired Val-speak of 25 years ago. I wouldn't hazard to guess Howard Hughes' emotional consistency in the movie, however something went hellishly wrong. Someone fell on his face when it came to editing and scoring. Take the music, for example. It's Scoring 101, embarrassingly manipulative, often overriding the dialogue and ranging from 'Pathetique' to 'The Lone Prairie' mélange. And then there's the acting: the Mexican senora rolls her eyes with all the panache of a 1940-Mexican B-movie bit actress. There is no spontaneity; she delivers her lines badly and with burning self-consciousness. And when Huston shoots Beutel in the hand, the latter doesn't even flinch; ditto, when he pierces both his ears with bullets. Staggering disbelief. As to the scene where Jane Russell falls for Jack Beutel and kisses him, it's like watching two trains headed straight for each other. Overblown, top-heavy, agonizingly overreaching...it nonetheless has the sexual potency of an orgasm. The music, the god-awful Close-CLOse-CLOSE UP of Jane's lips bearing down on the half-delirious Beutel. Wow, what power! The men watching this film back in (ca) 1940 must have had to cover their laps. I leave it to those with a sense of adventure to debate the movie's homoeroticism. There's no such implications from Beutel toward the two older men. The movie, finally, has to be taken for the time in which it was made. The cinematography is as splendid as if it were turned 10 years ago. It is impossibly uneven, anecdotal, horrifyingly edited, pathetically scored, wretchedly acted...yet the actors are painful in their beauty. Many of the IMDb comments suggest that the film wants watching several times. I second that. It can be slow, cantankerous, giddy, sullen - but Jane's and Jack's beauty are undeniable, Walter is everybody's favorite grandfather. Toland can be thanked for giving us the movie's clarity. --And Howard... Howard was just having fun.",
         "When I was 14 or 15, I sneaked into our local flea pit to watch this film. Billy the Kid was every kid's hero in those days. But the posters of Jane Russell was the main reason that I risked getting caught. She didn't let me down. Her first film, and it showed, but wow, she was a creature from another planet. I'd certainly seen nothing like her. Having been brought up on Johnny Mac Brown, the Durango kid, and the like, this film was, at the time, a revelation. My pals all wanted to know how fast Billy was. Did he shoot Doc Holliday? Did Pat Garrett shoot him in the back? All I wanted to do was describe Jane Russell. I watched The Outlaw on TV this week, and was disappointed. Time had done it no favours. The background music, which I hadn't noticed the first time round, was truly dreadful (Tchaikovsky was it? mixed with cartoon type sounds) I still found myself admiring Russell, who for most red blooded males of my age has been a great inspiration. Like Shane, and others, I think this was a film of its time, and probably doesn't deserve to be judged by this generation, who are seeing it for the first time.",
         "Highly anticipated. Hyped to the hilt. Howard Hawks directs with the aid of Howard Hughes. This western depicts the relationships between Billy the Kid(Jack Buetel),Doc Holliday(Walter Huston) and Sheriff Pat Garrett(Thomas Mitchell). Cowboys, Indians and gun play are not the main feature...the debut of Jane Russell is! This movie was filmed in 1941, but it took two years to pass the censors due to the shameless display of Russell's ample assets(36D). Aircraft pioneer Hughes actually designed the bra that helps showcase Russell. This is also Buetel's debut; but Huston is the one to prove his screen greatness. Probably the first sex western. Of course the fade outs leave a lot to the imagination. Worth the ballyhoo.",
         "There are films that are great, films that are not so great, films that are bad...and then there are films that are so bad, so grandly misconceived, one can only gape in wonder or roar with laughter (or both) at their foolishness. Thus an awful film can sometimes provide more entertainment than many good films. (THE DEVIL BAT, starring Bela Lugosi, comes to mind.) Watched THE OUTLAW on DVD the other night with some friends, and we were falling off the couch. I'd always heard there was a homoerotic subtext to the picture, but this was no subtext -- gay porn must be more subtle than this film! Walter Huston's Doc Holliday (or Halliday -- I've seen it spelled both ways in regard to this picture) is CLEARLY the stud, Billy is a petulant young hustler who piques his interest (despite his having stolen the older man's cherished horse!), and Thomas Mitchell's Pat Garrett (Doc's \"oldest friend\") seethes with jealousy throughout until he degenerates into the very apotheosis of a passed over, frantic, shrieking old queen. \"You're not going with him! Everything was fine between us till he came along!\" It has to be seen to be believed. Hilarious! The film's musical score is the worst -- THE WORST -- I've ever heard. There's less Mickey-Mousing in a Three Stooges short. So I recommend this one highly for parties. I guarantee a laugh riot. The thought of the great cinemotagrapher Gregg Toland (CITIZEN KANE) laboring on such camp trash is depressing, but he did give the film a fine look.",
         "Ahhhh! I can't believe anybody wrote a positive review of this movie. It's just unbelievable! This IS the worst movie I have EVER seen. This one is SO bad, that it would be an injustice to let the MST3K crew take this..... they simply wouldn't have anything to do because this movie does it ALL on it's own. The music is attrocious! The dialogue is the worst I've ever heard. It's just a riot from start to almost finish (because you'll be wondering how you made it this far when you get to 90min.) This movie doesn't know whether it wants to be a comedy or a western or a drama .... in fact WE don't either... it's not dramatic, it's not funny and it's barely a western!!! I'm recommending this to EVERYONE. It is NOT to be missed! I guarantee you will howl with your friends at the dialogue, cringe in pain at the music, and stare in awe at a movie that was somehow produced but not directed! It's a riot.",
         "There's something in its very weirdness that makes this almost worth watching - which is a positive, because there really isn't much in the story itself that would make it worth watching. Best known as the film debut of a very bosomy Jane Russell, the movie actually describes a completely fictionalized friendship between Billy the Kid (Jack Beutel) and Doc Holliday (Walter Huston). According to the story, Holliday arrives in the town of Lincoln, NM and meets up with his old buddy Sheriff Pat Garrett (Thomas Mitchell.) Their friendship is strained when Billy shows up on the scene and Holliday becomes more involved with him. That's really where the weirdness comes in. Although Billy and Holliday are supposedly in a romantic competition for Rio (Russell), this really comes across as a 3-cornered homo-erotic relationship, with Holliday jilting Garrett for Billy. In the scenes between any combination of the three of them, that's really the sense you get of the relationship. It's truly bizarre to watch, which is perhaps not surprising for a movie produced and directed by Howard Hughes, who was already in a period of significant mental decline while he was putting this out. Hughes' OCD undoubtedly led to the very realistic and surprisingly detailed sets, but there was a lot that didn't fit well at all - including a dreadful musical score and some ham-fisted attempts at humour. The movie also includes surprisingly little gunplay for a Western. There's really not very much of interest here, but for Russell's sheer beauty as well as the over the top bizarre-ness of the whole thing, it gets a 4/10.",
         "...who think this movie isn't worth the time of day, I want to assert that it rises to an eminence that makes it the best western of the 1940's. Once you make an effort to penetrate the rough exterior and get the feel of it, you will agree that it is an unforgettable summit of achievement by all involved. In particular, there are two prominent points that engage my attention. One of these is the complexity of the interaction between the four principal characters. They are forever brooding over the most murderous resentments, then turning around and forming alliances, often amorous. This continual shifting of balance is what drives The Haunting (1963), and is what gives this movie its peculiar interest. Most westerns from that era have good guys versus bad guys, very boring; here we actually get something to think about. The characters are clearly defined individuals, and they behave with consistency. The other point is the musical soundtrack - it is the worst, I mean the very worst, in any movie. Tchaikovsky has never been so foully misused. Doubtless this was due to Howard Hughes' lack of taste, but the guy deserves some thanks for funding a movie no-one else would have touched back then. If the movie is ever re-released on DVD, there should be the option of squelching the music. Critics who knock the movie draw particular attention to the wooden acting of Jane Russell, but it seems just right for her part - smouldering with resentment and desire, but all of it suppressed by her need to fulfil her social role. So ignore the sniping from the boobs elsewhere at this site, and give The Outlaw a chance to capture you!",
         "I have seen this 'film', \"The Outlaw\", on a number of occasions. Frankly, I don't understand what all of the hubbub is about. The film is absolutely dreadful. Great talent (Walter Huston and Thomas Mitchell) is wasted in this film with an 'identity crisis'. It doesn't know if it wants to be a western, or a romance, or a comedy. Maybe it did introduce Jane Russell to the screen, but that appears to be the only justification for making this celluloid nightmare. Her acting talents are virtually non-existent, though she looks good. Jack Beutel is forgettable as 'Billy the Kid', and he gives an un-inspired performance that is something far beyond lackluster. One gets the feeling he is reading his lines 'cold' from cue cards. The film moves very slowly, is not particularly well written ( despite its hightly acclaimed screenwriter credits), is dreadfully acted, and is a very difficult watch, almost the equivalent of Chinese Water Torture. Fortunately, the film never takes itself seriously. And it's a good thing. It isn't the kind of film to be taken seriously !! I would recommend that it be shown in maximum security prisons as a substitute for lethal injection ! The film stunk then, it still stinks, and if it's part of film history, it isn't one of the high points, and the student of film needn't spend too much time here. The creative Victor Young music score and the innovative cinematography of Gregg Toland make the film watchable, but aren't enough to salvage this dreadnaught. Hughes shouldn'a had'da ought'a done it !! He should have hired a REAL director to crack the whip, and he should have taken the gag and handcuffs off of the writer and restored him to his artistic creativity. This didn't happen. Instead, some of the best talent of the period--both in front of and behind the camera--is wasted, and what masquerades to some as film history is seen by this writer as 'Film Misery'!!",
         "I would have preferred if there was no plot at all - Jane Russell is gorgeous, and Howard Hughes' meticulous efforts to emphasise her considerable bust make her quite a thing to look at. I would have preferred to see less of Pat Garrett and Doc Holliday, and more of Jane Russell. Even in the circumcised 95 min version i saw, there are shots of her cleavage, very rare for a 1943 film. There are other aspects of the movie which make it racy even by today's standards: one scene which made it to the most censored version involves something we don't see again till 1970 (Altman's MASH), far as i know. A man is sick, Russell is told he may die, she starts undressing, tells the maid to leave the room and tells the sick man: \"I'll warm you up.\" At times like this, there is a total fadeout to black and the music cuts out - something which never happens elsewhere in the movie. Its not hard to pick where bits have been cut out. I'd love to see the full version, available on the Criterion DVD. Plus, the transfer on the cheapie DVD i've got is not good, and Criterion always do a great transfer. The sex caused the production enough trouble, however - getting it banned in several countries, and neutered in the US. Still, there are enough scenes of Russell looking gorgeous here to recommend it to you for that alone (best bits: Russell standing in front of a mirror, riding a horse, wearing that green shirt, getting wet... you get the idea). The shot of Russell in The Outlaw's photo gallery gives you an idea of the sultry sexuality Russell had. That's a publicity still, though, so she looks slighty more natural in the movie. The western-adventure plot is impoverished and eventually turns into a love triangle with Russell, which i would have recommended to Hughes instead of trying a straight western adventure. He clearly cared most about women and aviation, and since this movie involved no planes, he needed plenty of sex to keep him interested. Hughes's frame only comes alive when Russell is on screen. Luckily, she comes on screen quite often. Still, it never seems like enough. The only interest the other characters (none other than Pat Garrett, Billy the Kid and Doc Holliday) serve is watching how often their eyes stray to Russell's bust when they're in a scene with her. Unexpectedly comic moment: in a shootout, one man refuses to draw, so the other shoots a big hole in his hand and out of his ears and he doesn't even react, as if he didn't feel it. I don't care how tough you are, you're gonna feel pain if you lose half an ear to a bullet.",
         "OMG has there been a movie icon hotter than Jane Russell in THE OUTLAW ? I don't think so either . Her smouldering sexuality is the yardstick in which to judge all woman on Earth and the likes of Monroe are second best when compared to this definitive sex goddess . And to think some people describe the likes of Jay-Lo or Abi Titmuss as the most beautiful woman who has ever lived Unfortunately Ms Russell is the only thing THE OUTLAW is remembered for , which is by no means a bad thing since this is an absolutely terrible movie . From the opening scene featuring a sheriff who gives a performance that resembles a circus clown giving a portrayal of a homo-erotic wet dream to the final credits this movie is an ordeal to sit through . It's badly directed with tons of very poor acting and ridiculous back projection and is so factually incorrect as to be laughable . Did I say it was laughable ? Maybe that's why the musical score has a comedy soundtrack complete with a WAH WAH WAH WAH sound that belongs in a three stooges feature ? I would have happily given THE OUTLAW one out of ten but because of the presence of Russell we're treated to something of a movie landmark - We're treated to on screen sex . Billy The Kid ravishes Rio Mcdonald in a hay loft 30 years before Clint Eastwood did an identical scene in HIGH PLAINS DRIFTER and in a later scene Rio asks Billy if he'll look at her while he does it , and the audience is left in no doubt what \" It \" is . Boy this must have caused people to drop dead in their seats on its initial release . Despite the controversy it's still an awful movie though"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Howard Hughes Productions"],
      "summaries": [
         "Newly appointed sheriff Pat Garrett is pleased when his old friend Doc Holliday arrives in Lincoln, New Mexico on the stage. Doc is trailing his stolen horse, and it is discovered in the possession of Billy the Kid. In a surprising turnaround, Billy and Doc become friends. This causes the friendship between Doc and Pat to cool. The odd relationship between Doc and Billy grows stranger when Doc hides Billy at his girl, Rio's, place after Billy is shot. She falls for Billy, although he treats her very badly. Interaction between these four is played out against an Indian attack before a final showdown reduces the group's number.",
         "In the Nineteenth Century, in the town of Lincoln, New Mexico, the sheriff Pat Garrett welcomes his old friend, Doc Holliday, who has had his horse Red stolen by a stranger while coming to the town. They meet the thieve and realize that the guy is the gunman Billy the Kid. Doc becomes friend of Billy, but Pat invites them to leave Lincoln in the afternoon. There is an incident, Pat wounds Billy the Kid, and Doc asks his girlfriend Rio McDonald to take care of Billy while he would misguide Pat Garret t and his officers. There is a romance between Billy the Kid and Rio, and when the hit-man is healed, he disputes with Doc the possession of Red and Rio, with Pat Garrett chasing them. On 13 July 1881, this hunting ends in a tragic way.",
         "Western legends Pat Garrett, Doc Holliday and Billy the Kid are played against each other over the law and the attentions of vivacious country vixen Rio McDonald."
      ],
      "budget": 0
   },
   "movielensId": 967,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1943-02-05",
      "dvdReleaseDate": "1999-12-21",
      "directors": [
         "Howard Hughes",
         "Howard Hawks"
      ],
      "runtime": 116,
      "movieId": 967,
      "title": "The Outlaw",
      "mpaa": "PG-13",
      "actors": [
         "Jane Russell",
         "Jack Buetel",
         "Thomas Mitchell",
         "Walter Huston",
         "Mimi Aguglia",
         "Joe Sawyer",
         "Gene Rizzi",
         "Ben Johnson",
         "Julian Rivero"
      ],
      "imdbMovieId": "0036241",
      "originalTitle": "The Outlaw",
      "genres": [
         "Action",
         "Adventure",
         "Western"
      ],
      "youtubeTrailerIds": ["Gnjv3ONSa9o"],
      "plotSummary": "Newly appointed sheriff Pat Garrett is pleased when his old friend Doc Holliday arrives in Lincoln, New Mexico on the stage. Doc is trailing his stolen horse, and it is discovered in the possession of Billy the Kid. In a surprising turnaround, Billy and Doc become friends. This causes the friendship between Doc and Pat to cool. The odd relationship between Doc and Billy grows stranger when Doc hides Billy at his girl, Rio's, place after Billy is shot.",
      "tmdbMovieId": 22613,
      "avgRating": 2.77654,
      "releaseYear": "1943",
      "numRatings": 179,
      "posterPath": "/z2euv0z2PQlXzS5xYPAVVP221Vn.jpg"
   }
}