{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "missionary",
            "id": 440
         },
         {
            "name": "river",
            "id": 1261
         },
         {
            "name": "desperation",
            "id": 1333
         },
         {
            "name": "boat",
            "id": 1422
         },
         {
            "name": "patriotism",
            "id": 1627
         },
         {
            "name": "world war i",
            "id": 2504
         },
         {
            "name": "hippopotamus",
            "id": 2509
         },
         {
            "name": "giraffe",
            "id": 2510
         },
         {
            "name": "methodist church",
            "id": 2511
         },
         {
            "name": "moqukito",
            "id": 2514
         },
         {
            "name": "boat wedding",
            "id": 2516
         },
         {
            "name": "leech",
            "id": 2517
         },
         {
            "name": "gin",
            "id": 2518
         },
         {
            "name": "canadian",
            "id": 2519
         },
         {
            "name": "tanzania",
            "id": 2520
         },
         {
            "name": "congo",
            "id": 2521
         },
         {
            "name": "animal species",
            "id": 3711
         },
         {
            "name": "hope",
            "id": 3929
         },
         {
            "name": "faith",
            "id": 6150
         }
      ],
      "imdb_id": "tt0043265",
      "video": false,
      "title": "The African Queen",
      "recommendations": [
         3090,
         910,
         11426,
         887,
         596,
         22584,
         963,
         27725,
         632,
         981,
         28580,
         903,
         288,
         11787,
         3114,
         900,
         10907,
         654,
         11016,
         821
      ],
      "backdrop_path": "/xIrEPbPrnUD9EtH2i7e7ZCiGnsM.jpg",
      "revenue": 10750000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Charlie Allnut",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012573",
               "name": "Humphrey Bogart",
               "profile_path": "/pxJrZluJHhbWRo2QXAG99FvXUi7.jpg",
               "id": 4110,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Rose Sayer",
               "gender": 1,
               "credit_id": "52fe4249c3a36847f8012577",
               "name": "Katharine Hepburn",
               "profile_path": "/ieGNYekIGc5R16cYmIzzyo59Lfz.jpg",
               "id": 6598,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Rev. Samuel Sayer",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f801257b",
               "name": "Robert Morley",
               "profile_path": "/7R4jQRl8CTFYCYpiQ1O2AjYtiK6.jpg",
               "id": 6599,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Captain of Louisa",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f801257f",
               "name": "Peter Bull",
               "profile_path": "/iIh6WkuefTUVrEybz1CXdz86puI.jpg",
               "id": 6600,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "First Officer",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80125b3",
               "name": "Theodore Bikel",
               "profile_path": "/haW3rcL6VM0EtwF7kZFSLgWfdys.jpg",
               "id": 6609,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Second Officer",
               "gender": 0,
               "credit_id": "52fe4249c3a36847f80125b7",
               "name": "Walter Gotell",
               "profile_path": "/1VZFqeruev1IQBIKmUpgo5DGBA9.jpg",
               "id": 6610,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "First Officer of Shona",
               "gender": 0,
               "credit_id": "52fe4249c3a36847f80125bb",
               "name": "Peter Swanwick",
               "profile_path": null,
               "id": 6611,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Second Officer of Shona",
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80125bf",
               "name": "Richard Marner",
               "profile_path": "/r9g2sRTyYztWcG3UmFTJEcuVbXI.jpg",
               "id": 6612,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f801255d",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012563",
               "name": "Sam Spiegel",
               "profile_path": "/zM5qW22AbzXUE626uZD0OXNzDWD.jpg",
               "id": 6594,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4249c3a36847f8012569",
               "name": "C. S. Forester",
               "profile_path": null,
               "id": 6595,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f801256f",
               "name": "James Agee",
               "profile_path": null,
               "id": 6596,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4249c3a36847f8012585",
               "name": "John Woolf",
               "profile_path": null,
               "id": 6601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012591",
               "name": "Jack Cardiff",
               "profile_path": "/3WSJNaLdjX2ToZ3QrNhkpBS9fe6.jpg",
               "id": 6603,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f8012597",
               "name": "Ralph Kemplen",
               "profile_path": null,
               "id": 6604,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f801259d",
               "name": "Wilfred Shingleton",
               "profile_path": null,
               "id": 6605,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "52fe4249c3a36847f80125a3",
               "name": "Connie De Pinna",
               "profile_path": null,
               "id": 6606,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe4249c3a36847f80125a9",
               "name": "Doris Langley Moore",
               "profile_path": null,
               "id": 6607,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80125af",
               "name": "Cliff Richardson",
               "profile_path": null,
               "id": 6608,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe4249c3a36847f80125c5",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5748d66ec3a36833990000d2",
               "name": "Allan Gray",
               "profile_path": null,
               "id": 1627145,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "55181eb39251416f0000449d",
               "name": "Kevin McClory",
               "profile_path": "/bnrmpPnHRV9FXwR2vN6dGijJUvx.jpg",
               "id": 9951,
               "department": "Sound",
               "job": "Boom Operator"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.979689,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 488,
      "vote_count": 293,
      "budget": 1300000,
      "overview": "At the start of the first World War, in the middle of Africa’s nowhere, a gin soaked riverboat captain is persuaded by a strong-willed missionary to go down river and face-off a German warship.",
      "similar": [
         314095,
         7555,
         7549,
         975,
         795,
         16442,
         1683,
         10130,
         237,
         1988,
         119698,
         12700,
         415214,
         3010,
         33796,
         4274,
         8353,
         51067,
         882,
         69989
      ],
      "original_title": "The African Queen",
      "runtime": 105,
      "poster_path": "/6BEiFFQCKKJpz9A6rHbDOw8oGFk.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Kiswahili",
            "iso_639_1": "sw"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Independent Film Distributors",
            "id": 262,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Romulus Films",
            "id": 3632,
            "origin_country": ""
         }
      ],
      "release_date": "1951-12-03",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "The greatest adventure a man ever lived...with a woman!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Huston"],
      "runtime": 105,
      "synopsis": "An English spinster, Rose ( Katharine Hepburn), is the sister of a missionary, Rev. Samuel Sayer ( Robert Morley). The two Christian missionaries are in a remote African village with grass huts and a little wooden church, which is located somewhere deep in a German African colony during WWI near the Ulanga River. The German war machine appears to brutally start burning the little straw hut village, killing the native women and children while kidnapping the African men, and just as quickly the German terror vanishes. When the smoke clears from the burning village, all is in ruin. The meek and fragile Rev. Samuel Sayer is so distraught by what he has just witnessed he kills himself. Rose is left all alone to fend for herself;she is lost in despair. There is no safety here, and the German threat is all around. There is no way out except to travel south down the dangerous and unforgiving Ulanga River. The river leads to Lake Victoria and possible freedom. Except for the last danger, which is the Louisa - a German gunship that patrols the Tanganyika shore of the lake up to the southern mouth of the river. The Ulanga is filled with dangers like animals that can eat you, rocks and white water rapids that can smash and sink a boat. It has only been successfully navigated once by a map maker named Spangler a hundred years ago and no one since has repeated the feat. Rose is straggling about the burnt village in shock and despair from her brother's suicide when a Mr. Charlie Allnut ( Humphrey Bogart) shows up out of nowhere to save her. This scruffy old gin-swigging rummy is a boat captain who is unshaven and crusty. Mr. Allnut is there to deliver mail and supplies to the village. Mr. Allnut travels up and down the northern part of the Ulanga on a rusty old 12-foot boat called the African Queen. The boat barely runs, powered by a small antique steam engine on its last legs kept together and encouraged to run with a few well placed kicks and bangs from a hammer by Mr. Allnut. Mr. Allnut buries Rev. Sayer and takes Rose to the African Queen for safety before the Germans come back. While on the African Queen Rose attempts to convince Mr. Allnut they should go south down the Ulanga and sink the Louisa. Mr. Allnut thinks the spinster is a crazy old maid and tells her so. And Rose thinks Mr. Allnut is washed-up rummy good for nothing coward unfit to be a captain. As impossible as it may seem Mr. Allnut decides to follow her suggestion because its the only way to avoid the Germans, and probably the only way to shut Rose up and stop her from nagging on and on about her crazy plan to fight the German navy. During the first few days aboard the African Queen navigating the Ulanga they annoy each other to the point of being disgusted. Rose reads her bible while Mr. Allnut drinks rum from a generous supply he has on board until he passes out every day. Rose decides to dump all of Mr. Allnuts bottles of gin into the river one morning while Mr. Allnut is still passed out. When Mr. Allnut awakes, he is emotionally destroyed by the thought of no more booze. How could you, Miss? Mr. Allnut asks over and over as the African Queen smokes and tugs along the Ulanga. Rose decides to stop talking to Mr. Allnut and gives him the silent treatment until he gives in to her plan to sink the Louisa. Mr. Allnut continues to talk to Rose even though Rose refuses to acknowledge his existence on the little boat. Mr. Allnut pretends he doesn't care even though the silence is slowing killing him. It is apparent they cannot stand each others company. Finally Mr. Allnut can't take the silence anymore and agrees to Rose's impossible plan to sink the Louisa using home made torpedoes made by Mr. Allnut. Mr Allnut says he can make them from the supplies on the boat - explosives and two gas canisters used for welding. As the two strangers sail down Ulanga River like great map makers before them and determined to sink the Louisa, Rose is impressed by Mr. Allnut's abilities and admires his seamanship when they hit big white water and how he skillfully navigates past the dangerous rocks. They ride into some really rough white water that causes Rose to feel aroused by the thrill of the ride. Not understanding the experience she compares it to a thrilling sermon delivered by her brother when the holy ghost consumed him. The spiritual excitement overcomes her as she describes her excitement to Mr. Allnut. Rose and Mr. Allnut survive a second and more dangerous set of white water rapids, along with extra dangers from African guerrillas shooting at them from the banks of the river hoping to kill them and capture the African Queen. When they realize they have survived certain death again they start hugging and kissing. After they kiss, they realize they are in love. It's implied they are lovers that afternoon after much flirting and a quick nap. However, their troubles are not over as the African Queen breaks down and they work as a team to fix it. Mr. Allnut shaves, baths and listens to Rose read the good book. They make tea and find they adore each others company. They call each other dear and tell each other sweet nothings. Nevertheless there is still more danger ahead. The river disappears, the water is shallow, and Mr. Allnut is forced to get into the mucky river and pull the African Queen by hand to higher water. Blood sucking leeches, mosquitoes, and dangerous animals torment the couple's efforts. The African Queen comes to a complete stop, stuck dead in mucky swamp water and high weeds covering any sight of land or water ways. They are lost in the weeds and can't see anything. They are disheartened and beaten and accept their doomed fate as they hold each other in exhaustion waiting to die. Passed out on the African Queen they lie there defeated. When it begins to rain and the river rises, the African Queen becomes unstuck and floats down the river only a few hundred feet from high water and the mouth of the Ulanga River. The Ulanga River is pouring into Lake Victoria and they see the Louisa gunship for the first time as it makes a routine patrol.. The two lovers are now alive again! With new hope and determination they are convinced they can now sink the Louisa. They wait in the banks of the Ulanga out of sight of the Louisa until it comes back on its routine patrol. They have fixed and fastened two homemade torpedoes to the insides of the African Queen. By cutting circle holes above the water line they can stick the tips of the torpedoes through the holes which act as battering rams that will compress on collision and ignite the explosives to explode the gas canisters when they crash into the Louisa at full speed ahead. Rose and Mr. Allnut lovingly argue about who will stay ashore while the other steers the boat into the Louisa. The hero will jump just before the collision and explosion that will sink the Louisa on impact. They both decide they would not want to live without the other so they will do it together. Rose and Mr. Allnut wait until the Louisa comes back on its patrol routine that evening and begin to plan to ram the Louisa. Building steam as the weather starts to change and the waves grow higher. The Louisa is not expecting the African Queen to even be there let alone capable of exploding and sinking the Louisa. As they steam towards the Louisa the lake begins to become rough, a rain storm squalls, and the seas begin filling the boat with water. A rogue wave turns the African Queen upside over tossing Rose and Mr. Allnut into the lake. The two are separated by another huge wave and disappear. Have they drowned? Alas, the Louisa is not sunk and the African Queen appears to be gone with the two star-crossed lovers. The sun appears after the storm and we see Mr. Allnut is alive. He was rescued and captured by the Germans. Mr. Allnut is now standing on the Louisa's deck in the captain's office. He is being interrogated by the Louisa's captain ( Peter Bull). The captain is determined to have Mr. Allnut answer his questions. The German captain always ends each question with the threat of death and hanging to Mr. Allnut, who is depressed and despondent. Mr. Allnut answers each question and threat of death with a hopeless sigh of, who cares! Because Mr. Allnut believes his Rose has drowned. Mr. Allnut is relieved by the thought of hanging rather than live without his Rose. Suddenly he hears Rose's voice coming from a life boat that has rescued her. Mr. Allnut, thrilled that Rose is alive, decides to deny he knows her in hopes of saving her from his fated hanging by the Germans. But the very English Rose not only argues with the captain but brags how she and Charlie and the African Queen sailed down the Ulanga, and how Charlie made homemade torpedoes, and how they came within feet of sinking the Louisa by themselves and would have, but the storm saved the Louisa from their doom when the weather caused the African Queen to sink and a wave tossed them into the water. The Louisa's captain thinking them both crazy decides to hang them both. On the deck of the Louisa, Rose and Charlie stand holding hands deeply in love, happy about dying together. Standing there with the hangman's rope around their necks Charlie asks the Louisa's captain to marry them as his last request before hanging. Charlie says he really doesn't care about getting married but it would mean a lot to the Mrs. A teary-eyed Rose is thrilled by the suggestion. The Louisa's captain thinks they are both mad but reluctantly agrees to marry them. The two are so happy to be married that they don't care they are going to be hung. Just as he pronounces them man and wife the Louisa explodes. The sunken African Queen has been hit by the Louisa. Rose and Charlie find themselves swimming and the Louisa is gone. They did it. A wood plank with the name African Queen floats by and the two grab it as they swim to apparent safety. Swimming away, the two sing merrily, \"There was an old fisherman...\"",
      "writers": [
         "C.S. Forester",
         "James Agee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043265/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTg0NjY1NTEyMF5BMl5BanBnXkFtZTgwNjUwMTY3MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Humphrey Bogart, Katharine Hepburn, Robert Morley | See full cast and crew »"],
      "reviews": [
         "THE African QUEEN is probably one of the most widely available films in the world, on sale in the electronics department of virtually every major retail chain, a commonplace at every rental counter, frequently seen on television. It is hard to imagine any one in the western world, especially in the United States, who has not seen the film at least once--and probably more than once. And so we take it for granted. That is a mistake. Based on the famous C.S. Forester novel, which it follows quite closely, THE African QUEEN is the simple story of pragmatic river-rat Charlie Allnut (Bogart) and high-minded Methodist missionary spinster Rose Sayer (Hepburn) who are thrown together by chance when German troops sweep through Africa during World War I. Once safely aboard his beat-up riverboat \"The African Queen,\" Allnut desires nothing more than to dodge the Germans until war's end; Rose, however, determines to strike a blow against the Germans by sailing the boat downriver to attack a German battleship. There are so many fine things about this movie that they are hard to innumerate. Filmed on location in the Congo, the cinematography is remarkably fine without being obtrusive; the script, which is at once subtle and very purposeful, has a remarkably natural tone; the two stars--who play the vast majority of the film alone together--give justly famous performances; and Huston's direction is so fine that we never feel even the slightest hint of directorial manipulation. As an adventure, it has a sense of realism that most adventure stories lack; as a character study it is remarkably detailed and finely wrought; as a love story, it is quite touching without engaging in common sentimentality. And it can be enjoyed by many people of diverse backgrounds and ages without the faintest qualm. If you haven't seen THE African QUEEN in a while (or heaven forbid never seen it at all) don't take it for granted thinking you'll catch it sooner or later. Sit down with the film and watch it with fresh eyes. You'll be amazed. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "To face a script in which most of the plot revolves around the dialogue of only two people in one location must be terrifying. Thank goodness for Katharine Hepburn and Humphrey Bogart. John Huston's adaptation of C.S. Forester's The African Queen was solid. And the decision to film on location in Africa helped develop the concept of nature as a viable character within the plot helps solidify the film. But without Katharine Hepburn, and Humphry Bogart, this film could have been reduced to a nice little travelog on the beauty and terror of African and the pretty animals living there. Within The African Queen each character undergoes metamorphosis. Charlie Alnutt grows from an apathetic man who enjoys the inside of a bottle, to a courageous man. Rosie in turn allows herself to be human, and vulnerable perhaps for the first time in her life. With lesser actors these changes would have appeared rushed, unexplained,and a dull beginning to an inexplicable romance. But it isn't. It's a captivating film. Rosie's brittle smile, Charlie's face as his vices are destroyed, these are moments of brilliance in an incredible film. I highly recommend it. It's also worth noting that this was not an easy film to make. These performances survived crew and cast illnesses, constant mechanical errors and inclement weather. For more about the conditions it was created under, I suggest you read Katherine Hepburn's The Making of The African Queen or How I went to Africa with Bogart, Bacall and Huston and almost lost my mind. She's not the sanest author in the world, but all the more enjoyable.",
         "This great classic has everything you could ask for - two fine stars who could carry the show by themselves, and a story full of adventure, drama, humor, and romance. It's a lot of fun to watch, and it is also a film you can admire for the expert way it was put together. Bogart and Hepburn not only give great performances, they are also wonderful together, and they make the on-screen relationship between their characters believable and interesting - it's great to watch as it develops. The adventures that they find are that much more entertaining for the way that you come to care about them. The story itself is exciting, too, with a lot of ups and downs for the heroes. Topping it off are the wonderful settings, with a lot of fine shots of wild animals and jungle scenery - there is always plenty to look at, and it also sets off the action nicely. Any one of a number of things would make \"The African Queen\" worth watching, and as a whole it is a terrific movie. It's a must-see for any fan of classic movies, and one that you can also enjoy watching numerous times.",
         "To me this film will always be the validation of Humphrey Bogart's long and distinguished career. His portrayal of the hard drinking Charlie was what made this film what it was. Also, he showed just how great an actor he was when he was able to match up against the woman who is generally considered to be the greatest actress in film history, Katherine Hepburn. Also, this film will always be recognized for having the perfect mix of action, romance and comedy and it will always be a classic.",
         "\"The African Queen\" was Bogart's fourth film to be directed by John Huston and his performance in it was very likely the best in his career as well as one which finally won him an Academy Award\u0085 He beat out Marlon Brando, who was heavily favored to win for \"A Streetcar Named Desire.\" The screenplay by Huston and the celebrated movie critic-writer, James Agee, matched Bogart with Katherine Hepburn in what amounted to a two-star tour de force in a deeply touching romance linked to adventures and heroics\u0085 Bogart and Hepburn were delightful as they infused their personal conflict with a warmth, humor, and tenderness rarely seen in films\u0085 Mixing comedy and adventure, it was a two-character film, in which Hepburn gave a fine demonstration of her ability to develop within a role... The sensitive interaction between her and Bogart (in an unfamiliar guise) undoubtedly benefited from her many films with Tracy\u0085 Bogart was given a rare opportunity to demonstrate his range as an actor, more than holding his own opposite the formidable Hepburn... He played many scenes with maximum effectiveness, down impossible rapids, where he becomes covered with leeches and suffers a severe fever attack, his drunk scene where he rebels against Hepburn and mocks her high-blown speeches, and the tender moments in which he realizes he's fallen under her bewitching spell\u0085 \"The African Queen\" was not an easy film to make, most of it being done on location in the insect-infested, suffocatingly hot and humid African Congo\u0085 But the result was a brilliantly entertaining film, a successful mixture of comedy, character and adventure\u0085",
         "The African Queen is a significant historical film in two respects. Along with King Solomon's Mines it was the first American film to show the real Africa to the American public. Previously our ideas about Africa were gleaned from studio backlot jungles created for Tarzan films and the like. The African Queen changed all that, no cheap studio sets would do any more. But also, The African Queen dealt with romance among mature adults in their forties. A ne'er do well river pilot on a ramshackle boat and the spinster sister of a missionary, thrown together by the circumstance of war. Humphrey Bogart, our intrepid river pilot, makes a scheduled stop to deliver mail to the mission run by Robert Morley and Katharine Hepburn. And he breaks the news to them that World War I has started. Almost as soon as he leaves them, German troops from East Africa come to call. Bogie comes back and he finds Kate with her dead brother. They bury him and skedaddle. And while skedaddling they conceive of a cockeyed plan to help in the war effort. To say what it is and what happens would spoil the story, but let me say this. The original opening of the film with Bogart coming in as church services are being conducted for a few hundred uncomprehending native Africans is Director John Huston's comment on the usefulness of the lives Morley and Hepburn have led up to that point. What Hepburn and Bogart accomplish by the end of the film makes up for the waste that was Hepburn's life. But The African Queen is a great romance as well. Bogart became a great romantic star in Casablanca and he upholds the tradition here, winning an Academy Award for Best Actor. Katie Hepburn doesn't seem to miss her usual partner Spencer Tracy not a bit, the part of Rose Sayer is a perfect fit. As was remarked, they're going to have stories to tell their grandkids. When I watch The African Queen I'm reminded of what Bogart's friend Frank Sinatra sang in one of his best ballads about how Love Isn't Just For the Young. Kate and Bogie sure prove it here.",
         "This is one of those films whose special effects and scenery must have been astounding at the time (1951), but which seem mediocre at best today. BUT, and that's a big 'but', this does not detract from the greatness of the movie overall. The scenery truly is beautiful, for one thing--and the direction and cinematography is great. However, what truly makes this film a classic, and deservedly so, is the performances given by the lead actors. For their one film together, Humphrey Bogart and Katharine Hepburn pull out all the stops. Bogart is crude, dirty and a low-life river-rat with a heart of gold. He gives the Oscar-winning performance of his lifetime. Hepburn is prim and prissy, but always manages to win us over with her radiance and vulnerability, as well as that core of steel and strength she lends to all her on-screen characters. He's charming, in his way; she's achingly beautiful in hers. You can't help but warm to Charlie and Rosie, and truly, genuinely root for them to get together. The ending is predictable; all 'opposites-attract' romance adventure stories are. You know without a doubt that the sunset will be there for Charlie and Rosie to ride off (or swim) into together. But you still hurt when Charlie hurts; and you still smile like a fool when he sees Rose, and when he tries to explain her forthrightness away by jungle fever. You believe the love, and that's what the African Queen is all about. Oh, and the gin and leech scenes, of course. Those are brilliant, as everyone else here has already mentioned! ;)",
         "The African Queen is an entertaining film done in grand old Hollywood style, and it is probably the most conventional movie John Huston ever made. It's surprising though that people can call this movie one of the greatest of all time considering the hokey (and at times unbelievable) script and the awkward lack of chemistry between Bogart and Hepburn. Actually, that lack of chemistry creates some strangely funny moments which change the tone of this adventure story--sometimes for the better and sometimes for the worse. The two are never really believable as the characters they are playing, but they are still fun to watch as a couple of stars chewing up the scenery. Bogart's Academy Award for this performance is obviously a Revlon choice in that it makes up for his being overlooked for at least 10 better performances that he gave prior to this one. Huston's direction seems to lose focus in the last 10 minutes or so and the ending is very abrupt, but overall the film is briskly paced and painless. Also worth noting is the wonderful use of African locations as photographed by master cinematographer Jack Cardiff. If you want to see a better film with similar themes, check out Huston's far superior Heaven Knows, Mr. Allison.",
         "This one's unique. The photography often makes it look like a travelogue, but it's one of the most captivating adventure/love stories ever put on film. Humphrey Bogart and Katherine Hepburn cruising down the river. Taking care of the gin. Over the rapids. Past the bullets. Through the swamp. Among the leeches. \"It's no wonder you love boating, Mr. Alnutt.\" And guess who comes to the rescue! This is an epic quest, the kind of tale humans have been spinning since we learned to talk. Movies don't get much better than this.",
         "This is not the best movie Ford, Bogart, or Hepburn did as individual artists, the but joining of their considerable talents did create a unique and most enjoyable movie that is fondly associated with all of them. \"The African Queen\" is a war movie, romance, adventure, comedy, drama, morality tale, and battle of the sexes all in one and it works on all levels. Though it often appears as somewhat \"hoaky\"...almost like a silent movie at points with its melodramatic score... that's because it does not strive to recreate reality like the usual war movie, it is actually an on location play. You could put it on a Broadway or London stage today and it would still work without a word or inflection changed. Though this is a movie of many great moments, what stays with you is the blossoming love of Charlie and Rose and how it helps them find the best in themselves for each other. I guess when all is said and done, \"The African Queen\" is a romance after all. If you appreciate any of the great artists that created it or just great movie making, this is one for the collection."
      ],
      "genres": [
         "Adventure",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Romulus Films",
         "Horizon Pictures"
      ],
      "summaries": [
         "September 1914, news reaches the colony German Eastern Africa that Germany is at war, so Reverend Samuel Sayer became a hostile foreigner. German imperial troops burn down his mission; he is beaten and dies of fever. His well-educated, snobbish sister Rose Sayer buries him and leaves by the only available transport, the dilapidated river steamboat 'African Queen' of grumpy Charlie Allnut. As if a long difficult journey without any comfort weren't bad enough for such odd companions, she is determined to find a way to do their bit for the British war effort (and revenge her brother) and aims high as God is obviously on their side: construct their own equipment, a torpedo and the converted steamboat, to take out a huge German warship, the Louisa, which is hard to find on the giant lake and first of all to reach, in fact as daunting an expedition as anyone attempted since the late adventurous explorer John Speakes, but she presses till Charlie accepts to steam up the Ulana, about to brave a German fort, raging rapids, very bloodthirsty parasites and the endlessly branching stream which seems to go nowhere but impenetrable swamps... Despite fierce rows and moral antagonism between a bossy devout abstentionist and a free-spirited libertine drunk loner, the two grow closer to each-other as their quest drags on...",
         "1914 in German East Africa. Brother and sister, Reverend Samuel and Miss Rose Sayer, are British Christian missionaries. They are reliant upon Canadian Charlie Allnut, who owns and operates a run-down river boat called the African Queen, for mail and supplies, Charlie who works as a mechanic at a mine one day away along the river. The Sayers merely tolerate Charlie, who they consider a little too rough around the edges for their proper British and Christian sensibilities. They consider his heavy drinking especially problematic. The Sayers only hear about the war raging in Europe from Charlie, not experiencing any of it until the Germans later raid their village, the Germans believing it the best way to control the natives and co-opt them into military service. Reverend Sayer passes away from the shock experienced by watching what the Germans did. As such, Charlie has to help Rose escape from the ravaged missionary compound before the Germans return. They not only have to beware the Germans, who Charlie knows they have to pass along the only route along the river, but deal with dangers of the river, such as the rapids, and their own differences, especially being in such tight quarters on a 30 foot boat. Those differences are heightened when Charlie would rather wait their time out somewhere secluded along the river, while Rose suggests they torpedo a German gunboat along the way. But all these issues in combination make for strange bedfellows, the two who are dependent upon each other for both their physical and emotional well being.",
         "At the start of World War 1, Charlie Allnut is using his old steamer, The African Queen, to ferry supplies to villages in East Africa. When the Rev. Samuel Sayer dies, Charlie agrees to take Sayers' sister, Rose, back to civilization, taking on the Germans at the same time.",
         "In Africa during WWI, a gin-swilling riverboat captain is persuaded by a strait-laced missionary to use his boat to attack an enemy warship."
      ],
      "budget": 0
   },
   "movielensId": 969,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Kiswahili"
      ],
      "releaseDate": "1951-12-03",
      "dvdReleaseDate": "2010-03-23",
      "directors": ["John Huston"],
      "runtime": 105,
      "movieId": 969,
      "title": "The African Queen",
      "mpaa": "G",
      "actors": [
         "Humphrey Bogart",
         "Katharine Hepburn",
         "Robert Morley",
         "Peter Bull",
         "Theodore Bikel",
         "Walter Gotell",
         "Peter Swanwick",
         "Richard Marner"
      ],
      "imdbMovieId": "0043265",
      "originalTitle": "The African Queen",
      "genres": [
         "Adventure",
         "War",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "GzcRa6n_qoE",
         "7U2QBCAwmlw",
         "RkJWvecgpT4",
         "HUKpm2bcIz8",
         "J1YtsXsPM1s"
      ],
      "plotSummary": "At the start of the first World War, in the middle of Africa’s nowhere, a gin soaked riverboat captain is persuaded by a strong-willed missionary to go down river and face-off a German warship.",
      "tmdbMovieId": 488,
      "avgRating": 4.06272,
      "releaseYear": "1951",
      "numRatings": 11871,
      "posterPath": "/mw1O0JxtDgXt2FHZnUn8w0wrjF1.jpg"
   }
}