{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "writer",
            "id": 13028
         }
      ],
      "imdb_id": "tt0047162",
      "video": false,
      "title": "The Last Time I Saw Paris",
      "recommendations": [
         141127,
         124427,
         110465,
         84210,
         93629,
         59230,
         41503,
         23020,
         130461,
         22994,
         21950,
         19221,
         30833,
         52228,
         29069,
         25773,
         57258,
         28073,
         46498
      ],
      "backdrop_path": "/5f5Qh9tpxIaQK9EkHzZ4oYZmy4.jpg",
      "revenue": 105,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Helen Ellswirth",
               "gender": 1,
               "credit_id": "52fe493ac3a36847f818fcdb",
               "name": "Elizabeth Taylor",
               "profile_path": "/kLSHCsowVnTvIbDD5Virb0yfLCW.jpg",
               "id": 3635,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Charles Wills",
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fcdf",
               "name": "Van Johnson",
               "profile_path": "/6sWt0ilIFgggXr2wtUia3iv8dYa.jpg",
               "id": 37446,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "James Ellswirth",
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fce3",
               "name": "Walter Pidgeon",
               "profile_path": "/OLUiYHE3wQ5vLswr59RNi1qU5I.jpg",
               "id": 12308,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Marion Ellswirth",
               "gender": 1,
               "credit_id": "52fe493ac3a36847f818fce7",
               "name": "Donna Reed",
               "profile_path": "/jGSZJKut5cOHqiKnz6cC0AMol7v.jpg",
               "id": 17752,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lorraine Quarl",
               "gender": 1,
               "credit_id": "52fe493ac3a36847f818fceb",
               "name": "Eva Gabor",
               "profile_path": "/xmUoBtWHw2v89Yd9MAVoh9Y0QAw.jpg",
               "id": 44714,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Maurice",
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fcef",
               "name": "Kurt Kasznar",
               "profile_path": "/yyZ5ohS8Yk0peBlU8GKDHsheby8.jpg",
               "id": 40620,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Claude Matine",
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fcf3",
               "name": "George Dolenz",
               "profile_path": "/7ZLpMDLocmgHBMsYLTWjWHhmoP3.jpg",
               "id": 97279,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fcf7",
               "name": "Roger Moore",
               "profile_path": "/8tnAaHY6cehjC9B6mIvxaFPewbh.jpg",
               "id": 10222,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Vicki",
               "gender": 1,
               "credit_id": "52fe493ac3a36847f818fcfb",
               "name": "Sandy Descher",
               "profile_path": "/6FuhxHLYXjkjVdadOv1x6y4ClKM.jpg",
               "id": 153493,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mama",
               "gender": 1,
               "credit_id": "52fe493ac3a36847f818fcff",
               "name": "Celia Lovsky",
               "profile_path": "/houYB0BFbDah7JxzBBpb48pyHft.jpg",
               "id": 15942,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Barney",
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fd03",
               "name": "Peter Leeds",
               "profile_path": "/7nSJjfvU1O4LCOrcpbVoiULymUw.jpg",
               "id": 115330,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Campbell",
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fd07",
               "name": "John Doucette",
               "profile_path": "/fgxqNmMIQHHCy0uxN1XXEon9eLq.jpg",
               "id": 34130,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Singer (as Odette)",
               "gender": 1,
               "credit_id": "52fe493ac3a36847f818fd0b",
               "name": "Odette Myrtil",
               "profile_path": "/stZzVQg97ZLlDrfT88y4LeJwKRk.jpg",
               "id": 30281,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fd11",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fd17",
               "name": "Julius J. Epstein",
               "profile_path": null,
               "id": 2665,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fd1d",
               "name": "Philip G. Epstein",
               "profile_path": null,
               "id": 2666,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe493ac3a36847f818fd23",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe493bc3a36847f818fd29",
               "name": "F. Scott Fitzgerald",
               "profile_path": null,
               "id": 40035,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.087496,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 57575,
      "vote_count": 11,
      "budget": 0,
      "overview": "Charles returns to Paris to reminisce about the life he led in Paris after it was liberated. He worked on \"Stars and Stripes\" when he met Marion and Helen. He would marry and be happy staying in Paris after his discharge and working for a news organization. He would try to write his great novel and that would come between Charlie, his wife and his daughter",
      "similar": [
         19053,
         1643,
         24420,
         11801,
         1024,
         1259,
         276,
         9777,
         979,
         627,
         1628,
         316021,
         12281,
         13523,
         226,
         158907,
         44564,
         192145,
         46825,
         23949
      ],
      "original_title": "The Last Time I Saw Paris",
      "runtime": 116,
      "poster_path": "/rerbqTR085seifQjy7bpnEJJ9qI.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1954-01-01",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "The sensational story of youth on a fling",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Brooks"],
      "runtime": 116,
      "synopsis": "Paris, France. After the success of his first book, famous American writer Charles Wills (Van Johnson) returns to Paris, and visits a local cafe named Café Dhingo where he chats with the bartender about his life. Charles flashes back to his past.... In May 1945, just as World War II was ending in Europe, Charles was on the streets of Paris, covering the city-wide V-E celebration. He was suddenly grabbed by the most beautiful woman he ever saw, she kissed him on the lips and disappeared. Charles followed the crowd to Café Dhingo and met another pretty woman named Marion Ellswirth (Donna Reed). The mutual attraction was instant, and he was invited to join the party her father was throwing in celebration of the end of the war. Charles, Marion, and her persistent French suitor Claude Matine (George Dolenz) arrived at the Ellswirth household, only to find that the woman who kissed Charles was Marion's younger sister Helen (Elizabeth Taylor). During drinks, Charles learned that Marion and Helen's father, James Ellswirth (Walter Pidgeon), came out of World War I alive and promptly joined the drifter generation. Unlike most drifters, he never grew out of it; even went as far as raising his two daughters to desire such lifestyle. Helen took after her father and used her beauty to sustain a life of luxury even though James was flat broke. Marion went the other way, and looked for serious-minded and conventional young men such as Claude the aspiring prosecutor and Charles the future novelist. Charles and Helen fell in love and started dating. After Helen recovered from a near-death case of pneumonia from being out in the rain, they got married and settled in Paris. James had hoped that Helen would marry rich, but having taken a liking to Charles, he good-naturedly joined the happy family of Charles. One year later, Helen got pregnant and gave birth to a daughter, whom they name Vickie. Marion, having lost Charles to Helen, agreed to marry Claude around the same time. Charles struggles to make ends meet with his meagre journalist salary while he worked on his novels as well as look after Vicki, while Helen and Grandpa James partied on. Then one day luck struck. James had bought a few large pieces of land in Texas, convinced that he would become an oil baron. The oil never came and the deeds became a family joke. Always ready with practical jokes, he gave those deeds to Charles as Helen's dowry. Five years later, the joke turned into gold as oil began to shoot up from these lands non-stop. Charles quit his job, and Helen and James began to host parties instead of going to them. Over the next year, the relief of financial strain and the influx of wealth suddenly brought out the irresponsible side of Charles, as he could no longer deal with the disappointment of his manuscripts getting rejected by publishers. And unexpectedly, this brought out the responsible side of Helen. Now it was Helen who wished to stay home, while Charles partied his wealth away. They also each took on other interests: Helen started to flirt with handsome English tennis player named Paul Lane (Roger Moore). Charles asked professional divorcee Lorraine Quarl (Eva Gabor) to join him as he competed in a local Paris-to-Monte Carlo race. After the race, Charles returned to Paris to patch things up with Helen, only to find her sitting in Café Dhingo with Paul. A fight broke out between Paul and Charles, an angry Charles went home first and bolted the door. Helen ended up having to walk all way to Marion's place in the snow. She caught pneumonia again and this time... she didn't make it. Charles hears about her hospitalization the next day and races to the hospital to be at her side when she dies. After Helen's funeral, Marion petitioned for and got full custody of Vickie, Charles went back to his hometown of to Milwaukee to deal with the loss of both his wife and daughter. A few years later in the present day 1954, having straightened out his life and quit drinking, Charles returns to Paris (where the movie begins) and finished telling his story to the Café Dhingo bartender. Charles then goes to Marion's house, hoping that his reformation would have softened Marion, and give nine-year-old Vickie (Sandy Descher) back to him. Still feeling resentful towards Charles for having fallen for Helen instead of her, Marion refuses. Seeing that Charles and Vickie belong together, Claude finally stepped in and told Marion off. In the final scene, Marion and Claude bring Vickie to Café Dhingo to look for Charles. And in front of the painting of Helen, the family is finally reunited again. Charles and Vickie then walk off together to go back to America.",
      "writers": [
         "Julius J. Epstein",
         "Philip G. Epstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047162/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3Mzk2ODI2OF5BMl5BanBnXkFtZTcwMTk2MDIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Elizabeth Taylor, Van Johnson, Walter Pidgeon | See full cast and crew »"],
      "reviews": [
         "Here in The Last Time I Saw Paris an interesting thing happens. Elizabeth Taylor becomes a woman. Before this picture there were really only two other outstanding performances by Miss Taylor. Or I should say where she was allowed to rise above the material. The first being of course the rhapsodic National Velvet and the second the astonishing A Place In The Sun. The films in between those and The Last Time I Saw Paris were mostly along the `Isn't she beautiful?' line of movie making, and, why not? That was the main engine of most Hollywood star vehicles of the day. A Star didn't have to be a talent. But it was essential to possess a presence that reached out from the screen and touched the audience in a primal way. Miss Taylor had that in spades but she had much more that was often eclipsed in the dazzling explosion of her extraordinary almost alien beauty. But here in the hands of director Richard Brooks (who would later lead her to her triumph in Cat On A Hot Tin Roof) Miss Taylor finds a new level in her abilities as an actress. Her Helen is a woman of many layers and dark corners, of mercurial flights and deep sadness. Elizabeth at the tender age of 22 grasps all the aspects of this tragic woman and illuminates not only the screen with them but the whole enterprise as well. She shows us where she, as an actress is going in the future. And who she will become in her later films, one of the best screen actresses of the twentieth century. This is the real beginning of the Elizabeth Taylor of legend. She fills the role as no one of her generation could. Never again after this film would she sleepwalk through a film, a beautiful shadow to dream over. She is aided in what is perhaps one of Van Johnson's best performances. Donna Reed scores high in the role of Helen's bitter sister and Walter Pidgon is a delight as her roguish father. A standout cameo is presented by Eva Gabor, (not Zsa Zsa) the only one of the famous sisters who had any real talent. The only false performance in the film comes from child actress Sandy Descher. When you compare her forced and overly cute performance to that of the child Elizabeth Taylor in `Jane Eyre' then you see what a treasure Miss Taylor has always been. There is something so essentially wonderful in this gem from MGM and it is this. The Last Time I Saw Pairs is the perfect example of the last flowering in the 50's of the `woman's picture'. Films where women could be multi faceted and complex and drive the story on under their own steam as whole human beings. This is a window to the 50's and a style of filmmaking that seems gone forever, great stories of strong women who fill the screen with power and grace. But with `Far From Heaven' and `The Hours' I may be wrong about forever. I recommend this admittedly dated but charming film for anyone who wants to see what screen acting is all about. It is about thinking and Miss Taylor is a master at the craft.",
         "Advancing F. Scott Fitzgerald's Babylon Revisited from the jazz-age Paris of the `Lost Generation' to the late 1940s and early 1950s looks logical enough, one World War being much like another, but a certain piquant period flavor gets lost. The madcap behaviors and post-Victorian motivations that made sense in the age of corset-free flappers and expatriate wastrels seem dated in the more efficient, streamlined age of jet travel. The way the characters ruminate about life back home in the United States, you'd think they'd colonized Mars rather than taken lodgings near the Eiffel Tower. Amid the city-wide orgy of V-E Day, Army correspondent Van Johnson meets two sisters: Donna Reed, who gives him the eye, and Elizabeth Taylor, who catches his. Their happy-go-lucky father (Walter Pidgeon) isn't rich but lives like it (`It's cheaper that way,' Taylor explains). Taylor and Johnson marry, have a daughter, and party in an upper-crust social whirl, while he types out multiple drafts of The Great American Novel. How they (or Pidgeon) can afford their high life goes unmentioned, and when they suddenly come into money, thanks to some Texas oil wells that start gushing, there's little detectable change in the texture of their lives. Except for disaffection. Johnson drinks more heavily as the rejection slips pile up (Pidgeon advises him that the secret to success is mediocrity). Taylor starts ditching the kid at bistros while she's off jumping into fountains. Three sheets to the wind, Johnson speeds off in his sports-car with Eva Gabor riding shotgun, but his reckless driving comes to naught (twice). Both partners play at adultery but never actually engage in it. Occasionally Reed, a frosty smile frozen on her face, pops up to register her smouldering resentment against Johnson. But then Taylor, of such delicate constitution that she has been known to contract \u0091flu not from microbes but from a gentle rain, gets soaked to the skin when she's locked out of the house at dawn and slogs her way through the slush... Given these melodramatic excesses, Richard Brooks keeps the movie refreshingly low-key; he draws a subdued and affecting performance from Taylor (at the dizzying pinnacle of her young beauty). There are some missteps (Johnson having a drunken argument with himself; Roger Moore as a tennis-pro gigolo; a comfy wrap-up that comes off as forced and abrupt), but Brooks keeps the proceedings passably watchable. This heady, romanticized peek into the life of Americans abroad has its allure, and, though you don't believe it for a minute, it makes you want to sip a Pastis and light up a Gitane.",
         "\"The Last Time I Saw Paris\" converted the author's sensibility downward, to compassion and soap opera\u0085 The movie therefore betrayed the dry-eyed spirit of the original material\u0085 The first mistake, though, was in changing the era from the Lost Generation Twenties to post-World War II\u0085 The jazz age ambiance, recollected in the story, the mystique of Paris in the Twenties\u0097these key tokens of Fitzgerald's sensibility were missing\u0085 Even more damaging than the switch in era is the attempt to expand the characters whose motivations are only sketched lightly in the short story\u0085 Told in flashback, the story centers on a successful American novelist (Van Johnson) who returns to Paris and a reunion with the child he left in the custody of his sister-in-law (Donna Reed), since the death of his wife... The movie and the actors do not move the characters from point A to point B: why, for instance, do husband and wife reverse roles, she transformed from party girl to sober wife who wants to go home to America, he collapsing from serious writer to disappointed drunk\u0085 Van Johnson lacks the mythic stature to suggest other than a poor man's version of the great, doomed Fitzgerald\u0085 And Liz was too young and inexperienced at the time to embody an arch-neurotic, part a malicious temptress, and part an aiding angel\u0085 The role is a cumulation of the Taylor ingénue: the goodtime flirt, cunningly stealing a man from her older sister; the spoiled daughter of a fast living phony; the irresponsible party girl with a good heart underneath it all; the sober young mother and wife; the defiant adulteress; the frail spirit cut down by the forces of nature\u0085 At each \"station,\" she is on home ground, but the part comes out in bits and pieces rather than a coherent whole: the character, finally, does not add up\u0085 It may be partly Taylor vapidity (Beverly Hills didn't prepare her for Paris), but it's also the script and the direction: that saintly woman, forgiving all, has very little connection to the blithe spirit who steals her sister's man and parties with non-stop frenzy\u0085",
         "A great romantic classic. I saw it again now in 9/2001. Some would say that it is a little slow. I still loved it. Liz Taylor looks as beautiful as ever. But the real star is Van Johnson. Great acting. The emotion that he shows is outstanding and very real. I am an older man now...57 years old. I had to reach for my hanky several times. The love...the joy...the tears... and the sorrow of a man for his wife and his child. Well...well...it is too bad they don't have movies like this anymore. I miss them. This is one I will save and enjoy seeing again someday....",
         "The Last Time I Saw Paris was the second of two films that Elizabeth Taylor and Van Johnson co-starred. What a difference in four years from The Big Hangover where Johnson was billed ahead of Taylor. Which is odd in this case because the film is really about Johnson. It's based on F. Scott Fitzgerald's story, Babylon Revisited which takes place in Paris after World War I. MGM apparently thinking that the audience would be more amenable to a story taking place after World War II, so the plot was updated for France of the Fourth Republic. It doesn't quite work though, France of that era was a whole lot different than France of the Roaring Twenties. They partied then also when Paris was liberated and the Germans chased out of their country, but on the whole it was a time for more sober reflection of what France's role in the post war world would be. The Roaring Twenties that Fitzgerald wrote about were not the Roaring Forties. Van Johnson is a GI who comes upon a family of expatriates who lived in Paris right through the occupation. Walter Pidgeon and his two daughters, Donna Reed and Elizabeth Taylor. They both are interested, but Johnson has eyes only for Liz. And the film is their story. It's a tragic story, you can see Fitzgerald himself in Van Johnson, the would be writer who becomes a dissolute playboy. Partying right along with him is Taylor who is the image of Fitzgerald's party girl wife Zelda. MGM did this one on the cheap. There are some shots of Paris, but on the whole the Paris you see is the Paris that was created by the studio for their classic musical An American in Paris. View the films side by side and you'll have no doubt. Look for Eva Gabor as a divorcée who likes Johnson and a very young Roger Moore as a tennis pro who'd like to be a kept man by Taylor. It's a nice story, but it could have been a whole lot better if MGM had actually shot the film in Paris completely and really set in the period it was written.",
         "The Last Time I saw Paris Reviewed by Dan Cooper This film was made in 1954, and by virtue of its age it becomes an easy target for those who would use it as a vehicle to pump up their own egos with a verbal bashing that will likely go unchallenged. The film has indeed been bashed, here on this database among other places, as unimportant and unworthy of your time as a possible rental choice. I disagree completely with the uncalled for bashing, and with the judgement that the movie is unworthy of your time. See it for yourself. And if you are young enough to be completely unfamiliar with all of the actors, so much the better for you to judge it fairly on its merits rather than be snowed by the reputations of Hollywood personalities. The plot has depth and very few weaknesses, the acting is good to very good, and the story has interest value in both historical and social frames of reference. The plot concerns the uniting of two people whose tragic flaws are not well matched, with the obligatory tragic results. The pair gets together spinning out of a near-miss love triangle. The man (Van Johnson) has no idea of the existence of the triangle, as he is completely taken with Taylor and just as completely forgets his earlier attraction to the other woman (Donna Reed). Reed, the rejected third wheel, is actually not rejected, per se, but becomes the \"odd man out\" none the less when her sister (Liz Taylor) successfully steers the affections of the duped Johnson in her own direction instead. Reed adopts the persona of the rejected party to a relationship that never was, and exacts her revenge later in the film. While the big name actors of the day are no longer influencing moviegoers today, they undoubtedly sold the film in 1954. I find some weaknesses in both acting and directing, but the film is definitely worth seeing if you have never had the pleasure. Van Johnson's role is that of a fairly shallow character with a good heart but no follow-through to carry him to victory until way too late to do much good. Johnson possibly could have done more with the role, but the weakness of the character should not be confused with some partially perceived weakness in Johnson's delivery of the part. Taylor does a nice job as the sly and experienced older sister, the one with the better looks and the Machiavellian technique to get whatever she wants, again at the expense of little sister Reed. The film is actually carried more by the acting of the supporting cast than by the efforts of the leads. Two very strong performances are put forth by Walter Pidgeon and George Dolenz. Pidgeon plays the opportunistic pretender to wealth and father of the two women. Dolenz is the earnest lover of Reed, who inherits her full-time attentions only after Johnson is fully occupied with Taylor. Dolenz marries Reed and in the end does a very nice job of becoming the film's heroic figure. Eva Gabor at the peak of her youthful beauty does a good job as yet another love triangle component for the easily side-tracked Johnson after his marriage to Taylor. Another triangle develops with a very young Roger Moore finding the eye of Taylor. Do yourself a favor and see this movie. Dan Cooper is a freelance writer/editor. He has been writing for over 30 years and has done book and movie reviews sporadically since the 1970's.",
         "I went into this one not expecting much, and I wasn't disappointed. Basically you have a pleasingly low-key performance by Van Johnson as a hard-working American G.I. who decides to stay in Paris, under the spell of a lovely bohemian (Liz Taylor) and her anti-pragmatic father (Walter Pidgeon), but his performance eventually veers too deeply into the maudlin as we're expected to believe that his inability to write a successful novel has brought about an existential crisis for the protagonist as well as a marriage crisis for the couple. The most irritating thing about the movie is the way that the writers tried so hard to make sure that the audience wouldn't blame either of the lovers for any of the bad things that are happening, all the while expecting us to buy that each lover blames the other at least at one point or another. That makes me suspect more than anything that some radical changes must have been made to F. Scott Fitzgerald's original story. It's even hard to say if the film has any visual beauty to compensate for the lack of believable characters, at least on the DVD I saw (where it was coupled with \"Father's Little Dividend\") the colors were very faded and there were visible scratch lines and so forth indicating that this DVD was made from a print and not a negative. So I couldn't possibly take away or add any credit to the film because of photography because it's very hard to judge the quality of the images. However I found the directing in general to be good with regards to the actors' performances but pretty nondescript in terms of visual sensibilities.",
         "Elizabeth Taylor, Donna Reed, and Walter Pidgeon turn in fine performances in this updated adaptation of F.Scott Fitzgerald's short story, BABYLON REVISITED. Two serious flaws keep this good movie from succeeding completely. One is a seriously miscast Van Johnson. His limited talent does not include the ability to portray a writer, much less one who struggles with intellectual despair. The second and more serious flaw is the movie's ending. The happy ending constructed for the movie is completely out of line with the story's point of view and makes no sense for the motivations of all the characters as written by Fitzgerald or adapted by the screenwriter. The title song is nicely sung by Dinah Shore.",
         "How anyone could indicate that Van Johnson is \"wooden\" or miscast in this film is an incredible conumdrum. With his usual innocent charm, he builds the character with an authenticity which is totally suited to the screenplay. He is totally credible and authentic. If no other success can be perceived, surely the later scenes with his concern for both wife and daughter are amazingly touching; his tears are touching and beautifully demonstrated as no actor in my memory. The breadth of his performance stands out, with this character being fleshed out and fully developed. I hope that in his later years at the nursing home he did not read some of the uncharitable reviews of his performance. A highly underrated actor who deserved better. This is his very best role which he embraced fully, sensitively and beautifully. What a guy!",
         "and this film, while dated, captures some of its aura. I am saddened as I write this, realizing a no-talent celebrity has marred the name \"Paris\" in America, but perhaps Americans will soon come to their senses. But I digress. Other reviewers have analyzed Ms. Taylor's performance, and she does quite well; her father is portrayed by Walter Pigeon as a shallow lothario, Donna Reed is the angelic sister, and Van Johnson the writer/husband. While I agree with a previous review that the persona of F. Scott Fitgerald is not completely manifested, Johnson does a good job of being a conflicted writer, loves his wife, but needs more, eventually spiraling downward into alcoholism. One scene with their young daughter is particularly touching, she is on a merry-go-round in the park, near the Seine, it is cold, Johnson is trying to reconcile with Elizabeth Taylor; He will change, he will stop drinking, he will redeem himself;(he promises, to no avail). The hope and sadness are projected on screen. The moods and cinemascope coloring from 1954 are classic. We do not see such subtlety today. The incidental music is also haunting. Highly recommended, especially if you love Paris."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Charles returns to Paris to reminisce about the life he led in Paris after it was liberated. He worked on \"Stars and Stripes\" when he met Marion and Helen. He would marry and be happy staying in Paris after his discharge and working for a news organization. He would try to write his great novel and that would come between Charlie, his wife and his daughter.",
         "After an absence of two years, Charles Wills returns to his favorite bar and reminisces about his love affair with Helen Ellswirth at the end of World War II. Charles was an army Lieutenant writing for Stars and Stripes at the time and she the daughter of a one-time rich man who has always lived a life of luxury. They are a study in contrasts - he is level-headed and serious while she is fun loving and carefree - but they eventually marry and Charles continues as a civilian reporter while writing the great American novel. His lack of success as a writer weighs heavily on him but but his fun-loving wife parties on. As time goes by they have a daughter but it doesn't change Helen's lifestyle. Growing ever more frustrated with his inability to get published, Charles also begins to drink heavily and he and Helen quickly grow apart. Following a tragedy, Charlie leaves but is now back in Paris not knowing what the future may hold."
      ],
      "budget": 0
   },
   "movielensId": 972,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1954-01-01",
      "dvdReleaseDate": "2002-04-23",
      "directors": ["Richard Brooks"],
      "runtime": 116,
      "movieId": 972,
      "title": "The Last Time I Saw Paris",
      "mpaa": "PG",
      "actors": [
         "Elizabeth Taylor",
         "Van Johnson",
         "Walter Pidgeon",
         "Donna Reed",
         "Eva Gabor",
         "Kurt Kasznar",
         "George Dolenz",
         "Roger Moore",
         "Sandy Descher",
         "Celia Lovsky",
         "Peter Leeds",
         "John Doucette",
         "Odette Myrtil"
      ],
      "imdbMovieId": "0047162",
      "originalTitle": "The Last Time I Saw Paris",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["ebDVU2OjsSw"],
      "plotSummary": "Charles returns to Paris to reminisce about the life he led in Paris after it was liberated. He worked on \"Stars and Stripes\" when he met Marion and Helen. He would marry and be happy staying in Paris after his discharge and working for a news organization. He would try to write his great novel and that would come between Charlie, his wife and his daughter",
      "tmdbMovieId": 57575,
      "avgRating": 3.15909,
      "releaseYear": "1954",
      "numRatings": 132,
      "posterPath": "/rerbqTR085seifQjy7bpnEJJ9qI.jpg"
   }
}