{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "bandleader",
            "id": 171346
         }
      ],
      "imdb_id": "tt0029588",
      "video": false,
      "title": "Something to Sing About",
      "recommendations": [],
      "backdrop_path": "/x6ViVmDOUS9LB412CtQ6wClVpDA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Terrence 'Terry' Rooney",
               "gender": 2,
               "credit_id": "52fe493ac3a368484e12107d",
               "name": "James Cagney",
               "profile_path": "/ltNtoIKkh6zjjLxPTkw8EKYiQPi.jpg",
               "id": 5788,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Rita Wyatt",
               "gender": 0,
               "credit_id": "52fe493ac3a368484e121081",
               "name": "Evelyn Daw",
               "profile_path": "/3boDr0ZaGACuCYOdHN7NGtnGhrQ.jpg",
               "id": 538638,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Hank Mayers",
               "gender": 2,
               "credit_id": "52fe493bc3a368484e121085",
               "name": "William Frawley",
               "profile_path": "/nG2PEowEAQEB7yiaJ6kvoFHNuNU.jpg",
               "id": 34285,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Stephanie 'Steffie' Hajos",
               "gender": 0,
               "credit_id": "52fe493bc3a368484e121089",
               "name": "Mona Barrie",
               "profile_path": "/fY5mh4iUid3eeqUQcLQ2znJZYQ5.jpg",
               "id": 101995,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Bennett O. 'B.O.' Regan",
               "gender": 2,
               "credit_id": "56ce19e6c3a368127b00073a",
               "name": "Gene Lockhart",
               "profile_path": "/7IL5fx1mfhCiMAvYXSiY1Dj7yky.jpg",
               "id": 30234,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ito (Terry's servant)",
               "gender": 2,
               "credit_id": "56ce19f392514152b60006f6",
               "name": "Philip Ahn",
               "profile_path": "/pVJZ47pTD15MntJUlFe458Mcuhc.jpg",
               "id": 95014,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mr. Farney (dialogue director)",
               "gender": 2,
               "credit_id": "56ce1a0292514152ad0006ee",
               "name": "Marek Windheim",
               "profile_path": null,
               "id": 956444,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mr. Easton (makeup supervisor)",
               "gender": 2,
               "credit_id": "56ce1a10c3a368126800071b",
               "name": "Dwight Frye",
               "profile_path": "/ybXg4HVKGTtlVaxFpy4mtxF7gqX.jpg",
               "id": 1549,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Dancer in Drag in 'Deck Number' (as Skins Miller)",
               "gender": 2,
               "credit_id": "582e423fc3a368772d00f021",
               "name": "John 'Skins' Miller",
               "profile_path": null,
               "id": 1027429,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Mr. Daviani (as John Arthur)",
               "gender": 0,
               "credit_id": "58cd33f2c3a36850f300aea3",
               "name": "Johnny Arthur",
               "profile_path": "/f8mltNpEviyIDYnKFBbwRtFAm7o.jpg",
               "id": 34086,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Mr. Richards (as William Davidson)",
               "gender": 2,
               "credit_id": "58cd3403c3a36850fb00acb1",
               "name": "William B. Davidson",
               "profile_path": "/6MmhkoDiuyoW7HxlJ6F42kPkm6J.jpg",
               "id": 95729,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Mr. Blaine",
               "gender": 2,
               "credit_id": "58cd34129251415a4500b700",
               "name": "Richard Tucker",
               "profile_path": "/knGS2fF9Df9CSqJdj2RKMkN70qz.jpg",
               "id": 14290,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Miss Amy Robbins",
               "gender": 1,
               "credit_id": "58cd34219251415a7400b7e9",
               "name": "Kathleen Lockhart",
               "profile_path": "/gp2jUYelIMHwV5gc2tj4dSKuS2O.jpg",
               "id": 34182,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Jimmy - Band Member",
               "gender": 2,
               "credit_id": "58cd3431c3a368510400ac30",
               "name": "James Newill",
               "profile_path": "/6R3T6EHdBi96mywP5UeYrIXTEA6.jpg",
               "id": 133344,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Pinky - Band Pianist",
               "gender": 0,
               "credit_id": "58cd343ec3a368510400ac55",
               "name": "Harry Barris",
               "profile_path": "/AcNj8OnDKaPG7zxyJXac7tLY9dk.jpg",
               "id": 1143201,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Cully - Band Member",
               "gender": 2,
               "credit_id": "58cd344c9251415a4100b7c9",
               "name": "Cully Richards",
               "profile_path": null,
               "id": 165738,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe493ac3a368484e121073",
               "name": "Victor Schertzinger",
               "profile_path": "/7veCOonIn3dVyOaTuidaNDKDNHv.jpg",
               "id": 148849,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe493ac3a368484e121079",
               "name": "Austin Parker",
               "profile_path": null,
               "id": 374004,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "582e4232c3a368772d00f017",
               "name": "Gene Milford",
               "profile_path": null,
               "id": 9852,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "582e4224925141094800f2c7",
               "name": "Myrl Alderman",
               "profile_path": null,
               "id": 1710292,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "582e422b925141094800f2cc",
               "name": "John Stumar",
               "profile_path": null,
               "id": 1144702,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.460463,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 76464,
      "vote_count": 2,
      "budget": 0,
      "overview": "James Cagney has a rare chance to show his song-and-dance-man roots in this low-budget tale of a New York bandleader struggling with a Hollywood studio boss.",
      "similar": [
         872,
         812,
         224141,
         38757,
         11224,
         10530,
         11970,
         11631,
         703,
         46195,
         196867,
         114,
         134,
         18947,
         19404,
         194662,
         254470,
         353616,
         342473,
         354912
      ],
      "original_title": "Something to Sing About",
      "runtime": 93,
      "poster_path": "/59mhvtSPqE2cnyCl3kBNhHFNZLa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Grand National Pictures",
            "id": 5999,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zion Meyers Productions",
            "id": 19729,
            "origin_country": ""
         }
      ],
      "release_date": "1937-09-30",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "A Cagney you have never seen!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Victor Schertzinger"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Victor Schertzinger",
         "Austin Parker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0029588/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMjYwMjM4Ml5BMl5BanBnXkFtZTcwNjAwMjQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: James Cagney, Evelyn Daw, William Frawley | See full cast and crew »"],
      "reviews": [
         "This very well produced film from Grand National was it's downfall. Costing $900k in 1937 to produce (3 times more than 42nd Street or a quarter of Gone With The Wind) it never recovered its costs and sank the studio. A mini major wannabe of its day, it grew from the reshuffle in 1934 that saw Monogram, Liberty, Mascot and Majestic studios all become Republic. Tiffany studios had gone dark about 1932 and Grand National reopened that lot in 1935 amid the talent and exec merry go round of forming and shedding. A Warners squabble saw Cagney suspended so he walked to Grand National who much have thought they had won the talent lottery. To create industry credibility in their production values for any Cagney film, they had to spend big, and GREAT GUY in 1936 worked. But in 1937 their swing musical based loosely on their own studio tales (and lot) cost far too much and the loss by 1938 shortened their schedule and they went dark. Most jumped ship to re-formed Monogram Pictures and series films like the Shadow and Renfrew Of the Mounted Police had a new life there. Grand National had big hopes and plans and it is a huge shame they did not continue. It is a fascinating true story of ambition and crash and should be a film in itself. SOMETHING has been available in Australia on tape and DVD for years and is widely available here..like a lot of weird and small RKO titles. Lucky us and lucky you if you can find them. Grand national was a good outfit. The opening and closing nightclub scenes in this film are really smart and quite elaborate. There's even a BIG-like keyboard dance solo. And that Logo! Wow!",
         "The plot of this film is fairly ordinary--bandleader/hoofer goes to Hollywood and becomes a star, studio wants to play up his credentials as a lover so they put the kibosh on announcing his marriage and cook up an on-set romance for the papers, the strain threatens his marriage. If it were with any other cast, that might have been the end of it. But with Cagney in the starring role, the movie just pops. The man had star quality positively oozing out of him, which had been evident from his earliest bit roles, in films like \"A Handful of Clouds.\" This was Cagney's second and last film with Grand National studios, where he'd taken refuge during a contract dispute with Warner Brothers. The first film had cast him in standard dramatic fare, but this one reunited him with his NY dance coach, Harland Dixon, who staged the dances for the film. Cagney's dancing is even more spirited than in \"Yankee Doodle Dandy\"--at one point, where other dancers might kick their heels, he kicks his knees! According to a NY Times article cited in the AFI Catalog, Cagney practiced his steps with Fred Astaire before filming. What's most striking to me, though, in this film is Cagney's incomparably naturalistic acting. One scene in particular, where Cagney phones his fiancée back in New York while sitting in the dark in his Hollywood apartment, and listens to her sing a new song, is as moving and realistic as anything I've seen. Many scenes will evoke more famous moments from later films--Cagney dancing on piano keys, like Tom Hanks and Robert Loggia in \"Big,\" or Cagney working on his pear-shaped tones, like Gene Kelly in \"Singin' in the Rain.\" Cagney gives them all his unique brand of liveliness. There is also an almost anachronistic recognition of the degradation Hollywood visited on minorities, in the person of Philip Ahn, who plays Cagney's manservant, Ito. Evelyn Daw, as Cagney's fiancée, was a discovery of the director, Schertzinger, and this was her first film. She's got a cute little smile, but her voice is absolutely wrong for the sort of band Cagney is supposed to be leading. She does well enough, though, and holds her own with William Frawley as Cagney's sympathetic press agent and Gene Lockhart as the studio boss. The only real sour note is sounded by Mona Barrie, as the Hungarian star set up as Cagney's love interest by the studio press machine. She's neither attractive nor talented, and one has to wonder why she was supposed to be such a big star. This movie is out on DVD, unlike all too many of Cagney's early efforts, and it's worth checking out for a side of Cagney seen entirely too seldom.",
         "Weary of railing against Warner Brothers for the studio's mishandling of him, James Cagney moves to small Grand National, which produces for the star this sprightly musical compote. Cagney brings along all of his vigor and verve, and the little-known studio supplies a substantial budget for this tale of a Manhattan hoofer and bandleader, Terry Rooney (Cagney), and his sweetheart/wife (Evelyn Daw), who journey to Hollywood when Rooney is offered a film contract. Down-to-earth Rooney is resistant to receiving the prescribed \"star treatment\" and the head of the studio, Mr. Regan, (Gene Lockhart) construes his attitude as hauteur; when the initial film made with Rooney unexpectedly becomes wildly successful, the studio boss tries to keep the compass of his triumph from the budding star to prevent the latter from becoming more arrogant. Meantime, Rooney places his film experiences behind him by taking his bride on a lengthy cruise in a tramp steamer to the South Seas, and when they return and discover his exploding fame, comedic complications ensue. Cagney displays his customary class in his every scene with the musical production numbers being particularly effective, his dancing skill being a prominent element. True soprano Evelyn Daw performs beautifully throughout, and the classically trained singer makes for a comely female lead as well, while William Frawley as a press agent, Mona Barrie as the studio diva, and Philip Ahn, who plays Rooney's houseboy, all provide enjoyable turns. Director Victor Schertzinger utilizes his own Academy Award nominated score to a liberal extent throughout and the product becomes a tuneful and rather undervalued musical comedy.",
         "This little-known film is surprisingly entertaining, with lots of pre-\"Singin' in the Rain\" pokes at Hollywood's star machine, good songs, and a few lively dance numbers, especially the one onboard ship. James Cagney is great as usual, and the supporting cast has some fine bits of their own, especially Gene Lockhart as arrogant but ineffectual studio head \"B.O.\" Regan. William Frawley from \"I Love Lucy\" gets to show a different side as a tough and efficient publicist. Unusually, the film makes a small plea for treating minorities as full-fledged people (what a concept!), though how well it succeeds in that will be up to the individual viewer. The movie also proclaims that there's nothing wrong with women band leaders--an idea still unusual today. The production design will please 30's fans: the studio's offices are a small wonder of art deco intimidation, and even the regular movie theaters have signs with beautiful typography. Odd item to watch for: the shipboard cat boxing match--they wear gloves, so no one gets hurt, but some will find it cruel. But the film overall is a fine addition to musicals of the period.",
         "Something to Sing About was produced at Grand National Studios where James Cagney was working while under a contract dispute with the brothers Warner. He did two films for this B studio, neither of which rank high in the Cagney credits. One of the great losses to cinema is the fact that Jimmy Cagney did so few films that utilized his terrific dancing abilities. The two that come to mind immediately are Yankee Doodle Dandy and Footlight Parade. Two lesser films are The West Point Story and Never Steal Anything Small. Cagney himself said he never used to watch anything but his musicals in retirement. So why did he make so few of them? Well this one was all wrong. The plot of Something to Sing About concerns a hoofer who fronts for a band who's discovered and given a movie contract. There are the usual complications of a conniving studio boss and a conniving press agent played respectively and well by Gene Lockhart and William Frawley. His contract calls for a no- marriage clause, so Cagney and band girl singer lady Evelyn Daw marry in secret. Then we get the complication of a publicity driven studio romance with screen leading lady Mona Barrie. I think you can figure where this is going. The most disappointing thing about Something to Sing About is the lack of dance numbers for Cagney. He dances briefly at the beginning and the end of the film and nothing in the middle. Evelyn Daw had a nice singing voice and the charisma of a ham sandwich. She got the musical numbers such as they were. I'm sure the movie-going public was paying their tickets to see Cagney dance. Also in addition to giving him some dance numbers a female dance partner would have been nice. He danced well with Ruby Keeler in Footlight Parade and with Virginia Mayo and Doris Day in The West Point Story. Weren't Ginger Rogers, Eleanor Powell or Ruby Keeler available? No memorable songs came out of this. And Daw's voice is waisted as well. She has a Jeanette MacDonald soprano voice which was so out of place with a swing band. No wonder Cagney went running back to Warner Brothers. But they should have given him some decent musicals.",
         "James Cagney got tired of film studios wanting him to make gangster films and typecasting him, so he went to Grand National Pictures and made this film with a Independent film maker. In this picture Caqney plays the role as Terry Rooney a band leader who has a great show in Manhattan with a great singer, Rita Wyatt, (Evelyn Daw) and there is plenty of comedy and great dancing routines throughout the show. Terry is very well liked as well as his singer Rita. Hollywood becomes interested in Terry and Bennett Regan, (Gene Lockhart) is a Hollywood director who wants to give Terry a contact to make a picture. Terry finds it hard to break into the Hollywood scheme of things and gets down in the dumps about his performances. Little does Terry realize that the producers and directors all like Terry and feel he is doing a great job, but Bennett Regan does not want to tell him that in order to keep him from getting a big head on his shoulders. Great Cagney film with outstanding dance routines.",
         "James Cagney wanted to do more than play gangsters, and he loved dancing. Warner Brothers was having none of it so Cagney successfully got out of his contract and signed to do two films with Grand National Pictures. Something to Sing About was the first. The movie's a great look at a singing, dancing Jimmy Cagney. That it's only a so-so film is almost beside the point. The story is amusing most of the time. It gives us several musical numbers, including two full-blown productions with Cagney. It's also takes a lot of gentle pokes at the movie business. Terry Rooney (Cagney) is a Broadway nightclub song and dance man. He's happy and ambitious. He's got his band and he has his cute, adoring fiancée, Rita (Evelyn Daws). When he's offered a chance to star in a movie, he grabs it and heads west. But the studio boss realizes Terry is a potential big star, so instructs everyone not to praise him. He doesn't want Terry to get a big head. Terry, finally fed up, finishes the movie and heads back to Rita. They marry and take a long cruise on a freighter for a honeymoon. But wait. Terry's movie is a smash. The public want more of Terry Rooney. When he and Rita return, the studio boss, Bennett O. \"B.O.\" Regan (Gene Lockhart), and the studio's press head, Hank Meyers (William Frawley), convince Terry to sign a seven-year contract. All Terry has to do is keep secret his marriage. Rita, loving Terry, agrees and becomes his secretary. He starts a second movie as a star, but there are misunderstandings, more Hollywood press shenanigans, a co-star who wants more attention, more Hollywood columnists who want scoops about phony romances. Finally, Rita has had enough and returns to New York and the band. Terry, seeing how all the Hollywood razzmatazz is separating himself from Rita, follows her...and they reunite in a production number on the stage of the nightclub before a sell-out crowd. The best things about this movie are Cagney, his song and dance numbers and the fairly gentle but pointed pokes at Hollywood movie making. Cagney gets two big numbers and they're a lot of fun. One opens the movie with his nightclub act, singing, dancing up and down stairs and obviously enjoying himself immensely. The second is on the freighter. He joins crew members for an evening's entertainment of tap dancing, tumbling and cross- dressing. How do you describe Cagney's dancing? It's unique. He goes at it with great energy, stiff- legged, straight backed and with his rear out. He combines tap, some ballet moves and old- fashioned hoofing. And he's fast. Gene Lockhart does a great job as \"B.O.,\" the studio boss, pompous and petulant, a man who sees yes-men as essential to success. Evelyn Daws plays Rita. Daws was a young singer with a trained soprano; she was a discovery of the director, Victor Schertzinger. She sounds like Jeanette MacDonald's little sister and can hit high notes that'll cause nose bleeds. Daws made one movie after this and was never heard from again. After Cagney, Philip Ahn is one of the most interesting characters in the movie. He plays Ito, Cagney's gentleman's gentleman, with ludicrous pidgin-English...until we learn he speaks better than most everyone else in the movie. For fans of Cagney, the movie is probably a must.",
         "Hollywood was really turning the cameras on itself when it made this 1937 movie. This is a very good take-off on why so many Hollywood marriages fell apart-mainly the studio system. So many stars of the past blamed Hollywood for their marriages falling apart. Right off the bat, I can think of Judy Garland and David Rose. Cagney proved what a great hoofer he was 5 years before his Oscar win in \"Yankee Doodle Dandy.\" This wonderful Hollywood plot concerns itself with Cagney making it big in Hollywood and then running away and marrying his sweetheart, well played by Evelyn Daw. Too bad we never heard much from her. William Frawley, the future Fred Mertz, of I Love Lucy Fame, steals the picture as a publicity agent hell-bent on getting Cagney stature no matter what the cost. There is that accidental item that could cause a fatal rift between the married couple but Hollywood knew how to settle that so well in a final staging of a song and dance number.",
         "I didn't know what to expect from this movie at all; I never really heard of it or saw it anywhere and I bought it on a $1 DVD. I think it's a very enjoyable late 30s film, really hampered only by the sometimes painful singing of Evelyn Daw. I didn't know Cagney had made a musical this early in his career, five years before \"Yankee Doodle Dandy.\" In fact this one came out before \"Angels with Dirty Faces\" so I think it's fair to say he wasn't a very big star yet and his tough guy persona hadn't been cemented yet. He looks great doing his tap dance numbers early in the film. It's a shame they didn't have him do more dancing as the film progressed instead of concentrating quite so much on the situational comedy. Cagney plays a \"hoofer\" who goes by the stage name of Terry Rooney. He goes to Hollywood to make a film and the producers very foolishly try to convince him that he's bad so that he won't demand a lot of money. The foolish part is that they don't sign him until after the movie is released, so then they have to track him down and try to sign him without his knowing about it. By then he's married his sweetheart Rita (Daw) and the studio wants to keep the marriage a secret. I've never really heard of songwriter/director Victor Shertzinger; looking at his credits I see he wrote the famous song \"I Remember You\" from the great Alan Ladd/Veronica Lake film \"The Glass Key\" and was kind of a big shot at Paramount in the 30s. None of the music in this particular film is very memorable unfortunately. It's not bad music, the main problem is that they let Daw go into a very high range that the music just doesn't justify. More Cagney dancing and less Daw singing would have made this a more satisfying musical film. But the comedy is very good, I was laughing out loud at a couple of the scenes. Cagney is a very funny guy and he seems more free in this movie without the burden of the \"tough guy\" that he later needed to either live up to or run away from. There's a wonderful scene with Cagney showing his wife how he made all these different faces when he was acting. There's also a funny scene where Cagney beats up a couple stuntmen and then trashes the entire set of the movie. Every James Cagney fan should see this movie because it's a bit like seeing what his career might have been like if he had stayed more in the musical comedy realm. No, it's not a masterpiece like \"Yankee Doodle Dandy\", but it never tries to be. It's just a very light piece of classic entertainment that goes down very smoothly.",
         "JAMES CAGNEY was having contract problems at Warner Bros. when he went out on his own and did this little musical for Grand National, which--unfortunately--flopped at the box-office. It's the kind of musical with a Hollywood background that pokes fun at the film colony and its star-making machinery (a la SINGIN' IN THE RAIN), and gives Cagney a chance to shine as a hoofer. Cagney is Ted Rooney, a bandleader who bids farewell to his band and his fiancé (EVELYN LAW) to take temporary leave for a film when Hollywood beckons. WILLIAM FRAWLEY is the publicity agent who meets him at the station with a bevy of Hollywood cuties to snap photographs of his arrival. GENE LOCKHART is the overbearing studio mogol who calls his make-up men to give their opinion of how to prepare him for photography. A vocal coach with a heavy accent is brought in to teach Cagney how to speak. And so it goes. It never misses a chance to spoof the Hollywood star-making machinery and phoniness. When Rooney's picture is a smash hit, the studio can't find him. He's fled Hollywood to join his sweetheart and they embark on a cruise ship where Cagney is part of the oddly amusing entertainment. You know it won't be long before Hollywood catches up with him in time for a happy ending. It's strictly fluff but Cagney gives a solid comedy/musical performance, coasting along nicely in his role despite some shaky support from Evelyn Law, a young lady who appears to be an inexperienced actress with a singing voice not suitable for the swing band music that Cagney indulges in. She's a big drawback in a film that needs a good partner for Cagney in the love interest department. Summing up: Trivial, predictable musical comedy which should at least interest Cagney fans but it's easy to see why it failed to please at the box-office."
      ],
      "genres": [
         "Comedy",
         "Musical"
      ],
      "productionCompanies": ["Zion Meyers Productions"],
      "summaries": [
         "Popular New York band leader Terry Rooney (Cagney) is offered a lucrative film contract out in Hollywood. Rooney and his wife pack up and head for California. Upon arriving, they meet Mr. Regan, the head of the studio, who believes that Rooney's true lack of desire for stardom is arrogance on the band leaders part. When his first film is huge success and hit for the studio, Regan tries to hide the truth from Rooney. Feeling a need to get away from Hollywood, Rooney takes his wife on a South Seas cruise, only to return to the real truth of his fame.",
         "A New York bandleader journeys to Hollywood when he is offered a contract with a studio, but he is determined to do things his way and not theirs."
      ],
      "budget": 900000
   },
   "movielensId": 975,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1937-09-30",
      "dvdReleaseDate": "2003-11-25",
      "directors": ["Victor Schertzinger"],
      "runtime": 93,
      "movieId": 975,
      "title": "Something to Sing About",
      "mpaa": "",
      "actors": [
         "James Cagney",
         "Evelyn Daw",
         "William Frawley",
         "Mona Barrie",
         "Gene Lockhart",
         "Philip Ahn",
         "Marek Windheim",
         "Dwight Frye",
         "John 'Skins' Miller",
         "Johnny Arthur",
         "William B. Davidson",
         "Richard Tucker",
         "Kathleen Lockhart",
         "James Newill",
         "Harry Barris",
         "Cully Richards"
      ],
      "imdbMovieId": "0029588",
      "originalTitle": "Something to Sing About",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "James Cagney has a rare chance to show his song-and-dance-man roots in this low-budget tale of a New York bandleader struggling with a Hollywood studio boss.",
      "tmdbMovieId": 76464,
      "avgRating": 2.96552,
      "releaseYear": "1937",
      "numRatings": 29,
      "posterPath": "/59mhvtSPqE2cnyCl3kBNhHFNZLa.jpg"
   }
}