{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "hollywood bowl",
            "id": 156105
         }
      ],
      "imdb_id": "tt0027980",
      "video": false,
      "title": "Moonlight Murder",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Steve Farrell",
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262cc9",
               "name": "Chester Morris",
               "profile_path": "/hnsLbr1xpjwmHv0L8P88EoFoa61.jpg",
               "id": 34754,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Antonia 'Toni' Adams",
               "gender": 1,
               "credit_id": "52fe4d79c3a36847f8262ccd",
               "name": "Madge Evans",
               "profile_path": "/fz1OHlZrxXWOEck7Ltd4VkJLsss.jpg",
               "id": 104728,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Gino D'Acosta",
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262cd1",
               "name": "Leo Carrillo",
               "profile_path": "/cki1H09lrHHANmvtVFKr9HxsTHo.jpg",
               "id": 78850,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "William",
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262cd5",
               "name": "Frank McHugh",
               "profile_path": "/oSBztLH3U3TctJnuJm0U9600fSq.jpg",
               "id": 74875,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Diana",
               "gender": 1,
               "credit_id": "52fe4d79c3a36847f8262cd9",
               "name": "Benita Hume",
               "profile_path": "/1TU1zl2UbZ0HOtZjEjLV7hVENJK.jpg",
               "id": 131726,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Dr. Paul Adams",
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262cdd",
               "name": "Grant Mitchell",
               "profile_path": "/cDZpWgH0qOF4L5nmZJzGIHE5xo3.jpg",
               "id": 30215,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Louisa (as Katherine Alexander)",
               "gender": 1,
               "credit_id": "52fe4d79c3a36847f8262ce1",
               "name": "Katharine Alexander",
               "profile_path": "/pbr30ojcz37WQG10jTMJXtRle5V.jpg",
               "id": 133227,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "André Bejac",
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262ce5",
               "name": "J. Carrol Naish",
               "profile_path": "/iHUIlLxzgkZSMvapdxLhBZe82B.jpg",
               "id": 30686,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Godfrey Chiltern",
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262ce9",
               "name": "H.B. Warner",
               "profile_path": "/kYHCNllR7guQTtgROCb3z5dLusa.jpg",
               "id": 33278,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Quinlan",
               "gender": 2,
               "credit_id": "53b63b3a0e0a2676b80047e7",
               "name": "Robert McWade",
               "profile_path": "/eQTam5irf6HovM0WueHv7LO0ew7.jpg",
               "id": 30007,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Pedro",
               "gender": 0,
               "credit_id": "53b63b510e0a2676c7004bb4",
               "name": "Duncan Renaldo",
               "profile_path": "/pepgLXmkQGnnvSj2x9VsisAIIot.jpg",
               "id": 144387,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Ivan Bosloff",
               "gender": 0,
               "credit_id": "53b63b6f0e0a2676c7004bba",
               "name": "Leonard Ceeley",
               "profile_path": null,
               "id": 1155163,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Swami",
               "gender": 2,
               "credit_id": "53b63b860e0a2676bb0048d4",
               "name": "Pedro de Cordoba",
               "profile_path": "/8kIq2o5ZljNmCS1u6bKO1bTBlhy.jpg",
               "id": 103493,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Stage Manager",
               "gender": 2,
               "credit_id": "53b63b980e0a2676cf004845",
               "name": "Charles Trowbridge",
               "profile_path": "/70CRYTOSQWiIgGQsOqN8JKItssK.jpg",
               "id": 96721,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262cad",
               "name": "Edwin L. Marin",
               "profile_path": "/tOsRr6PgCYIE0uKBd3t3LxgH4kz.jpg",
               "id": 78053,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262cb3",
               "name": "Albert J. Cohen",
               "profile_path": null,
               "id": 90051,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d79c3a36847f8262cb9",
               "name": "Edgar Allan Woolf",
               "profile_path": null,
               "id": 1505,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4d79c3a36847f8262cbf",
               "name": "Florence Ryerson",
               "profile_path": null,
               "id": 9053,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d79c3a36847f8262cc5",
               "name": "Robert T. Shannon",
               "profile_path": null,
               "id": 240239,
               "department": "Writing",
               "job": "Storyboard"
            },
            {
               "gender": 0,
               "credit_id": "575b7924c3a3684a6d000fab",
               "name": "Ned Marin",
               "profile_path": null,
               "id": 1299412,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "575b792bc3a36826d30004b5",
               "name": "Lucien Hubbard",
               "profile_path": null,
               "id": 34752,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "575b79369251410500001107",
               "name": "Herbert Stothart",
               "profile_path": null,
               "id": 72066,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "575b793fc3a3684a82001073",
               "name": "Edward Ward",
               "profile_path": null,
               "id": 101711,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "575b7946c3a3687fdc000dbf",
               "name": "Charles G. Clarke",
               "profile_path": null,
               "id": 70821,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "575b79509251410500001117",
               "name": "Ben Lewis",
               "profile_path": null,
               "id": 22599,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "575b7956c3a3680144000e8a",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575b795fc3a3684a82001081",
               "name": "Lesley Selander",
               "profile_path": "/iQMfk2Ujf2AW24XeIFVgLxGicKW.jpg",
               "id": 130325,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "575b796792514105040012c8",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 0.623813,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 176841,
      "vote_count": 1,
      "budget": 0,
      "overview": "An amateur detective gets a chance to test his sleuthing skills when an opera singer is murdered at the Hollywood Bowl.",
      "similar": [
         12150,
         4771,
         320,
         25376,
         910,
         2832,
         1586,
         10528,
         807,
         11423,
         1847,
         75780,
         1939,
         1923,
         21484,
         984,
         6973,
         9411,
         4176,
         2275
      ],
      "original_title": "Moonlight Murder",
      "runtime": 65,
      "poster_path": "/xQWc31kJ3cMcMvNebMZLz9vaEGh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1936-03-27",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "20,000 eyes looked - and no one saw!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edwin L. Marin"],
      "runtime": 66,
      "synopsis": null,
      "writers": [
         "Florence Ryerson",
         "Edgar Allan Woolf"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0027980/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTQ4MDI4NTk2Nl5BMl5BanBnXkFtZTgwODIyNzg3MzE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Chester Morris, Madge Evans, Leo Carrillo | See full cast and crew »"],
      "reviews": [
         "Chester Morris and Madge Evans head an absolutely stellar cast (well, this was MGM - even their B movies were made with class and sophistication). This snappy murder mystery is set at the Hollywood Bowl, amidst Grand Opera and prima donnas!! The dress rehearsal of \"Il Travatore\" is not going smoothly - dancers have their mind on other things and the lead tenor, Gino D'Acosta (Leo Carrillo) has just been told by a fortune teller that if he sings tomorrow, he will die!! As he is temperamental, egotistical and a womanizer, there are no end of suspects. There is an unhinged composer, Bejac (J. Carroll Naish), a tenor eager to replace him, a jealous wife and an unhappy dancer who carries knives (Duncan Reynaldo). For a while Bejac is safely in custody, being driven to the local asylum but he manages to overpower his guards and is soon back at the Hollywood Bowl and at the top of the list of suspects. The conductor (H.B. Warner) proves to be pretty callous, the way he organises back up singers only moments after Gino meets his death. Chester Morris breezes through his role as the enthusiastic sleuth with his usual professionalism and Madge Evans makes a very attractive scientist. J. Carroll Naish adds another to his long list of superlative characterizations and one person you can definitely count on for laughs is Frank McHugh. This movie went through quite a few name changes - \"Hollywood Bowl\", \"Murder Under the Stars\" and \"Murder in the Bowl\". I actually liked the Opera and thought this movie had the perfect blend of music and murder. Recommended.",
         "Before a rehearsal at the Hollywood bowl, philandering tenor is warned of danger if he sings in the next nights opera by a mystic, The tenor laughs it off. When he's attacked by an escaped maniac everyone thinks that perhaps there is something to it. As show time draws near signs of danger increases until the tenor is killed during a performance in front of 20,000 witnesses. Things get complicated as more mayhem happens. Breezy murder mystery with Chester Morris and Leo Carrillo is the sort of thing that you might as well just sit and enjoy since odds are you're not going to figure it out (The clues are a late in the game revelation-revealed semi fairly). It's a got a great cast some good laughs (of the right sort) and a nicely complicated plot. If there is any real flaw its that there is a too much music. There isn't anything wrong with the opera scenes by themselves, rather its that this film barely runs over an hour and the lengthy singing scenes make the rest of the film feel rushed. Worth a look if you run across it.",
         "...and annoying is the best way to describe tenor and opera singer Gino D'Acosta (Leo Carrillo). In the looks department he is a solid 5/10 yet in spite of that and his obvious lack of sincerity and subtlety he is a lady's man with two currently on a string, he has an understudy that badly wants his big chance, then there are the boyfriends (husbands??) of the girls he is stringing along, and a lunatic that wants to kill D'Acosta because he won't sing an opera he has written. So when D'Acosta dies on stage it is no surprise to the audience. On hand to solve the murder is the reason I - and maybe most people - hang around. That reason is Chester Morris as Detective Steve Farrell. He teams up with Dr. Adams' niece Toni (Madge Evans) who is a chemist and helps him analyze evidence. You see, at first it is thought D'Acosta was poisoned by some wine he drank before going onstage, but the autopsy proves that the poison was delivered while he was performing, and now it is a combination of Steve's detective work and Toni's forensic analysis that work to crack the case. Madge Evans is playing this role somewhat as a screwball comedienne Jean Arthur style, and the result is a good performance and good chemistry between herself and the always entertaining Chester Morris who plays this role as a good yet tough guy. So what's not so good about this film? Mainly the short running time combined with, IMHO, an excess of opera music. The time taken up by the opera music could have been used to beef up the plot a bit more. Still I'd recommend it for fans of B murder mysteries from the 30's and 40's and definitely for fans of Chester Morris.",
         "There haven't been many musical murder mysteries in the history of cinema: \"Murder At The Vanities\" (1934) is one, \"Moonlight Murder\" is another. This is a film of average quality for the most part, but it does offer three novelties: the genre mix, the highly original murder method (which I have only ever seen used in one more film, a \"Mr.Wong\" entry, which however was made a few years later, so \"Moonlight Murder\" gets extra points for originality), and the unexpectedly tearjerking finale, which, to be honest, did nearly make me cry, thanks to exceptional work by the three actors involved (of course writing their names here would be a spoiler). Also notable is Benita Hume, who shows more cleavage than you might think was \"acceptable\" in a 1930s post-Code film! **1/2 out of 4.",
         "\"Moonlight Murder,\" from 1936, is an operatic mystery. A tenor,Gino (Leo Carrillo), singing Manrico in \"Il Trovatore\" at the Hollywood Bowl is told by a fortune teller (Pedro de Cordoba) not to perform or he will die. Well, you can't keep a tenor from performing that way. But he does die under mysterious circumstances. Chester Morris plays the detective brought in to investigate. It's a pretty good mystery, and the detective soon learns there are plenty of suspects, including the Gino's cover, who wants to go on in his place, various women, and an escaped lunatic who is angry that Gino did not sing his opera. Some people complained here that there was too much opera. Frankly I could have used more. Of course I love Trovatore. I actually thought the first aria done by Carrillo (who was dubbed by Alfonso Pedroso) was quite good. Most of the singing was okay despite some screechy high notes. A little baby boomer trivia: For us boomers, Carrillo was Pancho on \"The Cisco Kid,\" and the Cisco Kid was Duncan Renaldo - who is listed in the cast here. As a friend of mine used to say, \"foreshadowing.\" Ah, Pancho; ah, Cisco.",
         "I just wanted to make a comment about the quality of the singing. While Frank McHugh is always fun to watch, no matter what part he's playing, I kept wondering who was really singing during the operatic performances in the film. I think this page has a listing for the singer dubbing Carillo's part, but not certain about the rest. Anyway, the singing is top notch -- beautiful voices of Metropolitan Opera quality. Sad that this is not appreciated! Carillo was also pretty (deliberately) hilarious in his part, and I enjoyed watching him. Interesting that Duncan Renaldo (a very attractive young tenor in the film) teamed up with Carillo to play Cisco and Pancho in The Cisco Kid later on. This may be classed as a \"B\" film but there is a great deal of talent here, and Hollywood quality touches (like the truly good singing talent).",
         "1936's \"Moonlight Murder\" may be from MGM, but its 'B' status is assured by starring Chester Morris, whose 'A' status had passed, but his solid pedigree remained for second features such as RKO's \"Five Came Back,\" plus all 14 features in Columbia's 'Boston Blackie' series. Leo Carrillo is cast against type as opera crooner/lothario Gino D'Acosta, who has more than a few interested females, an escaped maniac (J. Carrol Naish) determined to do away with him, and a mysterious swami (Pedro de Cordoba) predicting his imminent demise if he performs his next opera. There's plenty of opera, predating \"Charlie Chan at the Opera\" by at least five months, and it does tend to slow things to a crawl, particularly after the murder, when we're itching for some mystery relief to take charge. Another commentator took note of the method of murder popping up in a 'Mr. Wong' feature, but there also were two Monogram Charlie Chans, plus Universal's 1939 \"The House of Fear\" as well. Director Edwin L. Marin never seemed to escape the 'B' tag (even at MGM), his best remembered features including his debut \"The Death Kiss,\" \"A Study in Scarlet,\" \"Bombay Mail,\" \"The Crosby Case,\" \"The Casino Murder Case,\" \"The Garden Murder Case,\" \"A Christmas Carol,\" \"Invisible Agent,\" \"Tall in the Saddle,\" and \"Nocturne.\"",
         "It's opera night at the Hollywood Bowl and tenor Gino D'Acosta (Leo Carillo) has everyone mad at him: his understudy, the conductor, two women he's been leading on, an aspiring composer upset because Gino won't read his opera\u0085.It seems only a matter of time before somebody knocks Gino off. A fortune teller has already told him: \"If you sing tomorrow night, you will die.\" The story's not real unique but it's performed with panache by a solid and colorful cast. Chester Morris is a fast talking police detective who strikes up a romance with cute scientist Madge Evans. Grant Mitchell is earnest as the tenor's doctor friend. Frank McHugh has some good moments as the singer's secretary who keeps belting out bits of opera, much to the annoyance of maestro H.B. Warner. The setup of various characters' motives is rather involved and there is a fair amount of music, as well, so the story itself moves somewhat deliberately. The complicated plot eventually arrives at a surprising (and unlikely) resolution. It's certainly not the best B mystery ever made, but MGM's production values, the somewhat unusual setting, and a fun cast make it very watchable."
      ],
      "genres": [
         "Crime",
         "Music",
         "Mystery"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Opera star Gino D'Acosta (Leo Carrillo), due to perform in the open air of the Hollywood Bowl, is warned by a Swami (Pedro de Cordoba)that he will die if he sings. That warning comes to pass and his death proves to be murder. Police detective Steve Farrell (Chester Morris) works backstage to sort out the clues pointing to the identity of the killer. Suspects include a primma donna, her conductor husband, an insane composer, an ambitious singer and a dancer and her husband partner.",
         "An escaped lunatic, a mysterious swami, and various lovers all have designs on a famous opera singer."
      ],
      "budget": 0
   },
   "movielensId": 977,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-03-27",
      "dvdReleaseDate": null,
      "directors": ["Edwin L. Marin"],
      "runtime": 65,
      "movieId": 977,
      "title": "Moonlight Murder",
      "mpaa": "",
      "actors": [
         "Chester Morris",
         "Madge Evans",
         "Leo Carrillo",
         "Frank McHugh",
         "Benita Hume",
         "Grant Mitchell",
         "Katharine Alexander",
         "J. Carrol Naish",
         "H.B. Warner",
         "Robert McWade",
         "Duncan Renaldo",
         "Leonard Ceeley",
         "Pedro de Cordoba",
         "Charles Trowbridge"
      ],
      "imdbMovieId": "0027980",
      "originalTitle": "Moonlight Murder",
      "genres": [
         "Music",
         "Mystery"
      ],
      "youtubeTrailerIds": ["1kzvOtFi_mY"],
      "plotSummary": "An amateur detective gets a chance to test his sleuthing skills when an opera singer is murdered at the Hollywood Bowl.",
      "tmdbMovieId": 176841,
      "avgRating": 2.16667,
      "releaseYear": "1936",
      "numRatings": 12,
      "posterPath": "/xQWc31kJ3cMcMvNebMZLz9vaEGh.jpg"
   }
}