{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0111173",
      "video": false,
      "title": "Shopping",
      "recommendations": [],
      "backdrop_path": "/cnUKRi0czPSQwElBs9K4B8JZoDa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jo",
               "gender": 1,
               "credit_id": "52fe46c8c3a36847f8111c0b",
               "name": "Sadie Frost",
               "profile_path": "/nORllrdt6W4GYZUcVXJoM0Cxhg1.jpg",
               "id": 41381,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe46c8c3a36847f8111c0f",
               "name": "Jude Law",
               "profile_path": "/4077Cyuo1mw53u1gNjLyQkqeZN0.jpg",
               "id": 9642,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe46c8c3a36847f8111c13",
               "name": "Sean Pertwee",
               "profile_path": "/mHNlvnrlFvNddFY6isD0S40lAIu.jpg",
               "id": 28848,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Be Bop",
               "gender": 2,
               "credit_id": "52fe46c8c3a36847f8111c17",
               "name": "Fraser James",
               "profile_path": "/mGAPQG2OKTgdKFkp9YpvCSqcbgY.jpg",
               "id": 30087,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Venning",
               "gender": 2,
               "credit_id": "52fe46c8c3a36847f8111c1b",
               "name": "Sean Bean",
               "profile_path": "/iIxP2IzvcLgr5WaTBD4UfSqaV3q.jpg",
               "id": 48,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Bev",
               "gender": 1,
               "credit_id": "57929c149251413ce1002fa3",
               "name": "Marianne Faithfull",
               "profile_path": "/sVWt2U1im7YZcCVlW6YF9RT5yZR.jpg",
               "id": 19995,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Conway",
               "gender": 2,
               "credit_id": "57929c23c3a36828a6002c99",
               "name": "Jonathan Pryce",
               "profile_path": "/dAgcoPcDtlhIUTrksPtsWdlfBX.jpg",
               "id": 378,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Dix",
               "gender": 2,
               "credit_id": "57929c3f9251414b3b002473",
               "name": "Ralph Ineson",
               "profile_path": "/zqvpAuiocN9hHjg6f9Dqu2S8y9x.jpg",
               "id": 202032,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Peters",
               "gender": 2,
               "credit_id": "57929c489251413dae002ff4",
               "name": "Eamonn Walker",
               "profile_path": "/mfB9S91rT1ZbqZloEn5i5jYTKoC.jpg",
               "id": 19299,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Pony",
               "gender": 2,
               "credit_id": "57929c5ac3a3687cab0045d1",
               "name": "Lee Whitlock",
               "profile_path": null,
               "id": 1243685,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Market Trader",
               "gender": 2,
               "credit_id": "57929c62c3a368636b00164f",
               "name": "Jason Isaacs",
               "profile_path": "/1GtGhAJz1JloqHARqc2xMsq5rG4.jpg",
               "id": 11355,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "57929c77c3a368631c0015a4",
               "name": "Melanie Hill",
               "profile_path": "/tE0vWMofdPASlzE3yminUQxhhQg.jpg",
               "id": 207295,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Mrs Taylor",
               "gender": 1,
               "credit_id": "5906727ec3a3684a4e0259f5",
               "name": "Tilly Vosburgh",
               "profile_path": "/ed4ZGtFjcDPKoM0iPuud77L5KaE.jpg",
               "id": 185464,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Billy's Dad",
               "gender": 0,
               "credit_id": "57929c7f9251413ce1002fdb",
               "name": "Brian Croucher",
               "profile_path": "/tGx2FOJucKTvnBcFj3UcxD7zmGZ.jpg",
               "id": 32810,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Yuppie",
               "gender": 0,
               "credit_id": "59067271c3a3684af00221db",
               "name": "Chris Constantinou",
               "profile_path": null,
               "id": 1800866,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Car Thief",
               "gender": 2,
               "credit_id": "57929c86c3a368636b001666",
               "name": "Clint Dyer",
               "profile_path": "/7j1oI9jluKJ5qQj6a3ueNnayLYv.jpg",
               "id": 109383,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Tommy's Gang #1",
               "gender": 0,
               "credit_id": "590672b092514169b802437e",
               "name": "Simon Bateso",
               "profile_path": null,
               "id": 1509445,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Tommy's Gang #2",
               "gender": 0,
               "credit_id": "590672c4c3a3684ab4025efd",
               "name": "Polly Moore",
               "profile_path": null,
               "id": 42664,
               "order": 18
            },
            {
               "cast_id": 18,
               "character": "Tommy's Gang #3",
               "gender": 2,
               "credit_id": "58ee3ac5c3a3683df500a262",
               "name": "Vinny Mann",
               "profile_path": null,
               "id": 1794058,
               "order": 19
            },
            {
               "cast_id": 25,
               "character": "Tommy's Gang #4",
               "gender": 0,
               "credit_id": "590672e6c3a3684ab4025f0f",
               "name": "Julian Sandell",
               "profile_path": null,
               "id": 1807615,
               "order": 20
            },
            {
               "cast_id": 26,
               "character": "Monkey",
               "gender": 2,
               "credit_id": "59309b25c3a3686a620003f4",
               "name": "Daniel Newman",
               "profile_path": null,
               "id": 8323,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c8c3a36847f8111c21",
               "name": "Paul W.S. Anderson",
               "profile_path": "/AeYYSi30WCkowdk04Awa0kr1E4S.jpg",
               "id": 4014,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c8c3a36847f8111c27",
               "name": "Paul W.S. Anderson",
               "profile_path": "/AeYYSi30WCkowdk04Awa0kr1E4S.jpg",
               "id": 4014,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5904d582c3a3684a8e00e574",
               "name": "Laurie Borg",
               "profile_path": null,
               "id": 948439,
               "department": "Production",
               "job": "Line Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.129445,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 45549,
      "vote_count": 16,
      "budget": 0,
      "overview": "A dark, hip, urban story of a barren and anonymous city where the underclass' sport of choice is ram-raiding. An exciting game in which stolen cars are driven through shop windows to aid large-scale looting before the police arrive. For Tommy, it's a business, but for Billy and Jo, it's a labour of love. As the competition between Tommy and Billy grows more fierce, the stakes become higher and the \"shopping\" trips increasingly risky.",
      "similar": [],
      "original_title": "Shopping",
      "runtime": 105,
      "poster_path": "/jdYL6f0KXnYBcnWnwGtnanJtKlE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Channel Four Films",
         "id": 181,
         "origin_country": "GB"
      }],
      "release_date": "1994-12-06",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "No one leaves without paying...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul W.S. Anderson"],
      "runtime": 105,
      "synopsis": "Bored adolescents, scared by drugs and sex, resort to Ram-Raiding and Joyriding with stolen cars to entertain and support themselves.",
      "writers": ["Paul W.S. Anderson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111173/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA5NzE3MjQ4MzFeQTJeQWpwZ15BbWU3MDQ1MDU2MjE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sadie Frost, Jude Law, Sean Pertwee | See full cast and crew »"],
      "reviews": [
         "Having read all the other reviews on this site, I notice that most people either completely hate the film or completely love it. I take the middle ground. I greatly enjoyed the visual elements, both with regard to the good-looking leads and the stylish camera work. I enjoy a film where I can pick out performers from other films and this one offered a few. I recognized Jason Isaacs (Captain Hook in the recent \"Peter Pan\" film), for one. That being said I was disappointed that Sean Bean's part was so small. However, I was glad Marianne Faithful's role was only a small cameo. It is painful to me to see her looking so haggard. I also enjoyed the pulsating soundtrack and believe that, with an inferior effort, the film would be even less appealing. As others have pointed out, there's not much of a plot, but, beyond that, it was difficult to sympathize with the characters -- other than the police! The law officers in this film were not portrayed as sadistic or even unlikable. Frustrated, yes. The \"protagonists\" had no redeeming characteristics other than youth, good looks and energy. The film seems to present the viewpoint that the police deserved the treatment they received from the thugs. To me, the film produces a nihilistic, 'who gives a damn' about anything attitude. It made me think about anarchy: after \"the system\" is demolished, with what will it be replaced? I'm probably waxing too philosophical about a movie that never even aspired to such musings. The producers probably just wanted to give a youthful audience the smash 'em up, 'wham bam thank you ma'am' form of entertainment many seem to want. (Witness \"The Fast and the Furious\" and Vin Diesel's \"XXX\" among others.) I like a bit of action, too, but I prefer to care about someone or something along the line. Nevertheless, I maintain that I have seen worse films. I confess to an admiration of British films and actors that causes me to overlook aspects of a movie that I don't like in order to focus on what I consider to be redeeming features. For example, I found Sean Pertwee's character in this film interesting, even if the character is what we Americans like to call a \"scumbag\". The bottom line, to me, is that the positives -- including the soundtrack, visual elements, and interesting cast -- outweigh the negatives. I bought the film at what you British call a jumble sale for $2.00 (American money), so I'm not out a lot of loot in any case. I will keep the film alongside \"Love, Honour and Obey\", another second-hand bargain I found along the way. It too, has redeeming features.",
         "This film just plain doesn't work. The protagonists are a bunch of losers - just out for thrills, like joyriders are meant to be, yes - but it attempts to glamourise and politicise them - to give them deeper motives - in a way that completely fails to come across. Meanwhile, you have the Sean Pertwee character, who's meant to be a sell-out, who is violating the spirit of the life they lead by going 'legit' and forming associations with true organised crime. But instead, next to this bunch of anarchistic, narcissistic overgrown children, he appears to be the only responsible, sympathetic, adult character. Meanwhile, Jonathan Pryce's paternal policeman is completely ineffective in what is meant to be the true adult presence of the film. There's one scene which epitomises the failings of the film - Billy's rebuff of Jo's attempted seduction by saying sex is too dangerous in the 90's. Never mind that he'd already attempted to chat up a stranger in a club! It reinforces one's perception of him as a big kid unwilling to grow up. . . Characters' actions have to be believable, and his aren't. No wonder one TV version I saw cut the scene short, it's almost embarrassing to watch. Hence the title I've chosen for this review!",
         "The plot: Jude and Sadie form half of an underworld gang who get their kicks, and their living, from the adrenalin fuelled lifestyle choice that once was ram-raiding. Facing the dual enemies of what seems to be the entire London police force, and a rival gang (cue a cockney Sean Bean) led by Sean Pertwee (with an admirable attempt to rescue the film with a Johnny Depp in Pirates of the Carribbean performance) \u0096 Jude and Sadie go from ram raid to ram raid with an incredible inability to appeal to the viewer. The film is littered with wannabe-weighty one liners which fail to rouse anything other than a sigh. Post Mortem: An awful attempt to make an edge-of-society, dark moody film. The casting is shocking \u0096 both Jude and Sadie are far too posh for the criminal underworld characters. Sadie's accent is eventually recognisable as a strain of Irish, sounding slightly like Jerry Adams on helium. This film wants to be an urban Mad Max and ends up looking like what it is \u0096 a posh cast trying to play scum and looking embarrassingly out of their depth.",
         "This movie by Paul W Anderson hit a lot of controversy when it was released in 1994 with the usual right wing tabloids screaming that this film should be banned since it was encouraging a spate of ram raiding and joyriding . Certainly if you want to ban it on the grounds of quality control no one would miss it much , but as for encouraging anything it'd only encourage people not to go to the cinema to watch anymore films by Channel 4 The film starts with tough tearaway joyrider Billy played by Jude Law in his first starring role being released from his prison cell . Cut to Billy being led down a prison corridor by a couple of screws who put him in an interview room with veteran detective Conway played by Johnathan Pryce \" So Billy what has prison taught you ? \" A short pause and get that Oscar speech ready Mr Anderson \" Don't get caught \" Anyone not expecting that far too obvious line ? I had hoped for a second Billy would have said something along the lines of \" Since I look like Jude Law and I've been in a prison surrounded by tough lags I've learned my lesson Mr Conway . I now have a rectum like a windsock and can assure you I will cause no more trouble \" And that's the problem . The film is trying to sell a good looking , young British cast , the much hyped and quickly forgotten \" Brit Pack \" but seem absolutely unsuited to their characters as working class anti-heroes from the inner city . After being released from the big house Billy meets his Irish girlfriend Jo played by Sadie Frost . The strange thing is Ms Frost actually looks older here than she does in 2013 which gives the impression Billy has hooked up with some MILF Anyway they decide to carjack a BMW car with a cunning plan of ramming it from behind then when the driver runs up to remonstrate with them they sneak in to the BMW and drive off in it . The problem is this is done on a urban stretch of road and there's no possible way they could have hid anywhere and the two cars are only a couple of yards apart . It's almost as if they can teleport . This sets up a car chase with the police as Billy and Jo taunt the police with \" Oh gosh aren't we a couple of posh actors having a bit of a laugh playing a couple of naughty chavs what ? \" That's a major failing of the film with only JonathanPryce's human portrayal of Conway and Sean Pertwee's stock villain Tommy being in any way convincing That said seeing a bunch of young toffee nosed thespians straight out of stage school who'd totally brick it on a tough estate playing characters from da ghetto is genuinely amusing . Not so the rest of the film which has a bizarre structure in that if randomly chopped up the film and inserted the scenes in any haphazard manner you'd not notice any difference",
         "Shopping is set in a shabby, dark, crumbling post-industrial UK city in the early 90s. Blast furnaces and abandoned factories line the roads, battered old Ford Escorts, Sierras, Capris and early 90s BMWs are everywhere. The plot centres around a grim inner city estate of dilapidated tower blocks and deals with the aspirations of some of its residents. Jude Law plays self-destructive Billy McKenzie, a 19 year old nihilistic man who despises his society and hates his life. His older girlfriend Jo (played by Sadie Frost) is tired of the scene Billy is involved with, car theft, joy riding and ram raiding, but cannot drag him out of it. Sean Pertwee gives a good performance as another petty criminal Tommy, whose interests have grown to include shifting stolen goods, drugs, organised crime and generally more aspirational ideals. After being released from his first three-month tenure in prison, Billy immediately seeks out his old mates and gets back into his old ways. Tommy initially tries to make an ally of him with stories of organisation and easy money, but Billy is only interested in getting respect from the estate and destruction and adrenaline and soon makes himself an enemy of Tommy and his crew, with ultimately tragic consequences. Whilst the screenplay and direction are excellent, the film is totally let down by its script. Many of the character's exclamations and reposes are less than natural, some are downright baffling and some leave you cringing in your seat. It's not consistently bad, there are also genuinely heart wrenching moments and some excellent quotes, but you will also find yourself burying your head in your hands at other points and thinking \"nobody says that!\". Billy's two mostly annoying mates are stereotypes of stereotypes and there's also some representations of dark and dingy illegal \"raves\" that are... well, preposterous. But when all's said and done, despite the cheesy moments in the script, it's a good movie. The story, all the action aside, is really about Billy's seething self-hate and unwillingness to love and be loved. The cars, the ram-raiding, the police, Tommy, the estate... it's all just a backdrop to the story of the slow and tragic destruction of an depressed young man caught in a world he has learned only to hate.",
         "Released from prison after three months, Billy wastes no time in getting back into his previous life of stealing and joy riding. Night one back on the streets sees him and girlfriend Jo racing through the streets in a stolen BMW pursued by the police. Not long after he is right back into the \"crash and carry\" habit, essentially ram-raiding a shop and getting away with as much stuff as possible before the police can respond. However a raid on one shop brings him into direction conflict with gang leader Tommy \u0096 who had already arranged a big money deal with Venning to hit the same shop. At the time of release this film benefited from the Daily Mail and other Middle-England tabloids ringing their hands with worry and condemning the film for encouraging youths to replicate the crimes in the film. Over a decade later, stripped of the hype and \"controversy\", Shopping looks quaintly dated and the portrayal of disaffected youth in a neo-light strobing world of crime and attitude seems old fashioned and a bit silly. This isn't helped by the fact that the script never aspires beyond this basic aim and characters that are never developed beyond the most basic of motivations. The idea that some foreign viewers would watch this and take it to be a realistic portrayal of modern Britain in rather hilarious to me but in fairness, films are under no pressure to be real. This still leaves a fairly simply story with some very poor dialogue and not much material to work with. Anderson's direction is solid enough in terms of style though \u0096 which is really where his strengths continue to lie; but as a result he seems to have a limited interest in depth and his input as writer is to blame for the problems with the material. The cast match this by being pretty and famous but not doing much else. Law is skinny and bland and doesn't do anything other than looking like he is having a teenage strop for the majority of the film. Frost isn't much better and it is left to Pertwee to easily steal the film as a memorable if simple tough guy. James is OK while small roles from Bean, Faithful, Pryce and Walker make the film feel crowded with famous faces \u0096 not that any of them add much value outside of this. Overall this is a stylish film but one that now looks dated and rather empty. Without the controversy not much is left and the story and characters are too simple to engage most viewers I would suggest. Interesting to see as part of looking at early work for several British actors but probably not interesting or engaging enough to be worth a look on its own merits as a film.",
         "For kicks, young and beautiful Jude Law (as Billy) and disaffected tough Sadie Frost (as Jo) steal cars, drive them into stores, and trash the places. They call it \"Shopping\". A rivalry develops between the two joy-riders and smarmy Sean Pertwee (as Tommy), who is the best store thrasher in the English neighborhood. Director Paul Anderson's star displays only a fraction of his later acting success; surprisingly, most of the spark occurs between Ms. Frost and Mr. Pertwee. \"Shopping\" seems meant to be compared with \"A Clockwork Orange\" - a certain musical interlude drives that point home - but, neither Mr. Law nor the film approach Malcolm McDowell or Stanley Kubrick. Not that it doesn't have style, mind you. And, Jonathan Pryce, Sean Bean, and Marianne Faithful help make the trip. Anderson should have ended with Law being thrown from the car into a bloody display with the store mannequin; instead, he blinked... ***** Shopping (6/24/94) Paul W.S. Anderson ~ Jude Law, Sadie Frost, Sean Pertwee",
         "Brilliant if slightly flawed - one for the gutter kids of the 90s. I didn't think I'd like this film after all these years. Boy was I wrong! Billy is actually much more sympathetic than his role suggests, compared to the criminals of today anyway. He's a loser adrenalin junkie, true, but there's something pure, almost artistic about his love of the chase and addiction to capturing and destroying high powered automobiles. He doesn't attack people and he isn't in it to make money - he just loves shopping! By which I mean ram-raiding high class shopping malls and stealing odd bits of crap. Billy isn't antisocial, he loves his father (who has given up on him) and has a great platonic love for his girl, whom he doesn't shag but prefers to stay best friends with. All in all, a very sympathetic character that just couldn't exist today. Bit silly, but then I think you had to be around in the 90s to really appreciate what this film's about - there was that time when nobody had any money and car thieves had the edge on the cops, and all their crimes only involved cars and shops anyway, and who cares about some stupid machine? It reminds me a lot of \"Crash\" - the JG Ballard novel and the late-nineties film - in that it has that Ballardian acknowlegement that we all secretly want the bomb to drop, we want the bad guy to win, and that's what's so great about Shopping. Considering that he's a posh kid Jude Law's performance is stellar. So if you like the 80s and 90s, like the \"industrial\" asthetic, love to see cars destroyed, hate (or have hated) authority, watch this film. It's the cools.",
         "I've heard a criticism levelled at this film that it is all style and no content. However, those who make that criticism are missing it completely. that is the whole point of the movie. I can't go into too much detail without putting in spoilers, but trust me: in this movie, style is everything. And *what* a style: Paul Anderson directs with flair and panache that is in turns both breathtaking in its inventiveness and audacity and sublime in its simplicity and poignancy. He really has a feel for his characters and the high-speed, adrenalin-fuelled world in which they live. The cinematography is also outstanding, and script and soundtrack complement the visuals perfectly. One word, though: if you can, watch this film in a cinema - the editing and cinematography lose something in the small screen. I know that this is a tall order, but it's worth the effort. Watch $hopping and see an example of audacious, passionate filmmaking, that should be used as a template for all Hollywood actioners.",
         "This one features a very young Jude Law, and a fairly unknown, Sadie Frost.. an independent film i caught on IFC the other night,, very dark,, lot's of good tracking shots,, especially the opening one.. a group of disenchanted youths crash cars into storefront windows for kicks, and then go shopping,, after 3 months in prison our main guy get's out , and is warned by the Inspector,, so now Billy back out and looking to make a score,, seems to get on the bad side of the new gang leader,, and takes down his store,, so the gang leader decides that he isn't just going to take that lying down,, good chase scenes in a tunnel.. at first i thought that maybe it was the Chunnel,, but i'm not sure.. love the battles that the gangs have with police,, evading them and destroying their cars in the process. overall though it's not for everyone,, it has a niche,, i think you have to look \"outside the box\" to like this one,, and i'm happy to say i did,, so i liked it very much."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Impact Pictures",
         "Kuzui Enterprises"
      ],
      "summaries": [
         "Lone group of teens, led by recently released joyrider and his disenchanted Belfast girlfriend, strives to leave their mark on \"a British city in the near future\" while attempting to avoid a rival gang. Scenes of joyriding and ram-raiding, which attempt to portray the addictiveness of fast driving whilst also showing the downside (the effect on the community and ultimately death)",
         "Billy and his girlfriend Jo steal expensive cars and speed them into shop windows (ram-raiding), which they find exciting and gives them an addictive adrenaline rush. There are many fast chases and encounters with the police. Rivalry grows between Billy and Tommy, as both want to be seen as \"the hero\". Jo wants her and Billy to change their way of life, but Billy wants first to ram-raid the Shopping Mall, because it has never been done before. But, who will get there first, Billy or Tommy? Hard-hitting, fast-moving, ultraviolent drama.",
         "Billy and Jo get their kicks from their special type of window- shopping (driving a car through the window and stealing everything inside. These professional criminals are not in it for the money, but for the fun of it. When Billy gets released from prison, his rival Tommy has taken over the street. A fight for power commences as Billy starts his own gang and hits a shop the day before Tommy had planned to. Tommy makes a move on Billy's girlfriend Jo, who wants Billy to change his lifestyle and move away, instead of fighting Tommy, a fight which will hurt them both. He agrees, but he wants to hit the shopping mall on a final hit. That has never been done before, so it will make him a hero among the others.",
         "You've run out of options, no school, no job. Steal a car, smash a shop with a heavy car and reap the proceeds!. This movie is about underground England. The causes, the benefits, and the result of a life of 'crash and carry'.",
         "Auch die heutigen Jugendlichen wissen nicht, was sie tun: Autoklau als Lebensinhalt ACTION-DRAMA Tödliche Langeweile plagt die Jugendlichen in einer englischen Industriestadt. Also stehlen Billy und seine Freundin Jo mit ihrer Bande Autos. Damit fahren sie zum \"Einkaufen\" - direkt in die Schaufenster der Geschäfte. Doch dann gibt es Ärger mit Billys Ex-Kumpel Tommy, der inzwischen seine eigene Gang gegründet hat. Er macht aus dem Zeitvertreib ein Geschäft. Auf Bestellung des Hehlers Venning soll Tommy ein Kaufhaus ausrauben. Es kommt zum Showdown jenseits der Geschwindigkeitsgrenze..."
      ],
      "budget": 0
   },
   "movielensId": 98,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-12-06",
      "dvdReleaseDate": "2001-07-31",
      "directors": ["Paul W.S. Anderson"],
      "runtime": 105,
      "movieId": 98,
      "title": "Shopping",
      "mpaa": null,
      "actors": [
         "Sadie Frost",
         "Jude Law",
         "Sean Pertwee",
         "Fraser James",
         "Sean Bean",
         "Marianne Faithfull",
         "Jonathan Pryce",
         "Ralph Ineson",
         "Eamonn Walker",
         "Lee Whitlock",
         "Jason Isaacs",
         "Melanie Hill",
         "Tilly Vosburgh",
         "Brian Croucher",
         "Chris Constantinou",
         "Clint Dyer",
         "Simon Bateso",
         "Polly Moore",
         "Vinny Mann",
         "Julian Sandell",
         "Daniel Newman"
      ],
      "imdbMovieId": "0111173",
      "originalTitle": "Shopping",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["cR1Zvw5MmLs"],
      "plotSummary": "A dark, hip, urban story of a barren and anonymous city where the underclass' sport of choice is ram-raiding. An exciting game in which stolen cars are driven through shop windows to aid large-scale looting before the police arrive. For Tommy, it's a business, but for Billy and Jo, it's a labour of love. As the competition between Tommy and Billy grows more fierce, the stakes become higher and the \"shopping\" trips increasingly risky.",
      "tmdbMovieId": 45549,
      "avgRating": 2.65385,
      "releaseYear": "1994",
      "numRatings": 91,
      "posterPath": "/jdYL6f0KXnYBcnWnwGtnanJtKlE.jpg"
   }
}