{
   "tmdb": {
      "original_language": "cn",
      "keywords": [],
      "imdb_id": "tt0093229",
      "video": false,
      "title": "Yes, Madam",
      "recommendations": [
         45450,
         154877,
         47634,
         38902,
         65649,
         29014,
         75839,
         112903,
         50572,
         58412,
         98497,
         119336,
         74225,
         81128,
         67097,
         68590,
         21990,
         400549,
         89433,
         42120
      ],
      "backdrop_path": "/oGCAFwlycf4fDoOvUn35fsufrIM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Senior Inspector Ng",
               "gender": 1,
               "credit_id": "52fe47199251416c9106a063",
               "name": "Michelle Yeoh",
               "profile_path": "/OhW6BfeZBRn7iupeI8elngV2EN.jpg",
               "id": 1620,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Senior Insp. Carrie Morris",
               "gender": 1,
               "credit_id": "52fe47199251416c9106a06f",
               "name": "Cynthia Rothrock",
               "profile_path": "/cdWIhVIGlW8UAXpZ0XKbH5FYrPY.jpg",
               "id": 74375,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Sifu",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a07f",
               "name": "Sammo Hung",
               "profile_path": "/hpqwIMmLLpn0mMmpi4EhzARK24K.jpg",
               "id": 62410,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Weak Heart",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a0a7",
               "name": "Richard Ng",
               "profile_path": "/bes3WQmFA3IpFtCE3U3WKHUPoHe.jpg",
               "id": 62417,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Asprin",
               "gender": 0,
               "credit_id": "52fe47199251416c9106a06b",
               "name": "Mang Hoi",
               "profile_path": "/c4QVmvGxkxrAkpCiTIEASBqqUky.jpg",
               "id": 83556,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Strepsil",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a067",
               "name": "John Shum Kin-Fun",
               "profile_path": "/v4G13KqlLS97LbEQXD2nF5h6p5D.jpg",
               "id": 116906,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Panadol",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a073",
               "name": "Tsui Hark",
               "profile_path": "/spPu64ewZ4Gwo2UzBfKIjfAj9BT.jpg",
               "id": 26760,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Big Moustache/Mad Dog",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a0ab",
               "name": "Chung Fat",
               "profile_path": "/p4JkuLfeK8enSyh4gZ6rqt0lvoY.jpg",
               "id": 119460,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Dick",
               "gender": 0,
               "credit_id": "52fe47199251416c9106a083",
               "name": "Dick Wei",
               "profile_path": "/sOhPtfy5nrDlxklZpJ374o3T2KV.jpg",
               "id": 62424,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Wong",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a087",
               "name": "Melvin Wong",
               "profile_path": "/dUhC5e587qIEhmerIHHakOqVC5z.jpg",
               "id": 26786,
               "order": 9
            },
            {
               "cast_id": 8,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a077",
               "name": "Dennis Chan",
               "profile_path": "/qZiaEH1JJt8c0WUPJl9gqArGT2P.jpg",
               "id": 64662,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Beat Cop",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a08b",
               "name": "Wu Ma",
               "profile_path": "/bCd5wwWdAe2ecCemyVOPCiILYYR.jpg",
               "id": 134704,
               "order": 11
            },
            {
               "cast_id": 9,
               "character": "Goh/Frankie",
               "gender": 2,
               "credit_id": "52fe47199251416c9106a07b",
               "name": "Fruit Chan",
               "profile_path": "/j1Xktbs6M6kNIwaLUps9swSEdVs.jpg",
               "id": 56865,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Officer Bo",
               "gender": 0,
               "credit_id": "59d5d1829251417f5c009fd2",
               "name": "Tai Bo",
               "profile_path": "/4qB04Yp3MvaiB1lW0VanL7oSh7M.jpg",
               "id": 1174365,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Henry Tin Wai Keung",
               "gender": 0,
               "credit_id": "59d5d1b39251417f7f00a359",
               "name": "James Tien",
               "profile_path": "/oYz7TsMQEuprMST4PEYTjaPEUPQ.jpg",
               "id": 62427,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Sifu's roommate",
               "gender": 2,
               "credit_id": "59d5d1e4c3a36831dd00a833",
               "name": "David Chiang",
               "profile_path": "/ptY33J5Ap1hxDUf9a8tNjDz3SER.jpg",
               "id": 65986,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Policeman [extra]",
               "gender": 0,
               "credit_id": "59d5d1fb9251417f1e00a4b3",
               "name": "Corey Yuen",
               "profile_path": "/uLRXQt1LlTfbYtm0kMLC8KSvHxN.jpg",
               "id": 35452,
               "order": 16
            },
            {
               "cast_id": 26,
               "character": "Henry's thug",
               "gender": 0,
               "credit_id": "59d5d22fc3a36831dd00a870",
               "name": "Chin Ka-Lok",
               "profile_path": "/iLEg3CFYdweWuVdIE3T3UdeRINs.jpg",
               "id": 148884,
               "order": 17
            },
            {
               "cast_id": 27,
               "character": "Ah Tung (armored car thief) [cameo]",
               "gender": 0,
               "credit_id": "59d5d24b9251417f6e00a5fc",
               "name": "Lam Wai",
               "profile_path": "/hOeh4ioB7FD9HF7ZB12avE3nwNn.jpg",
               "id": 83630,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47199251416c9106a05f",
               "name": "Corey Yuen",
               "profile_path": "/uLRXQt1LlTfbYtm0kMLC8KSvHxN.jpg",
               "id": 35452,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47199251416c9106a097",
               "name": "Sammo Hung",
               "profile_path": "/hpqwIMmLLpn0mMmpi4EhzARK24K.jpg",
               "id": 62410,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47199251416c9106a09d",
               "name": "Corey Yuen",
               "profile_path": "/uLRXQt1LlTfbYtm0kMLC8KSvHxN.jpg",
               "id": 35452,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47199251416c9106a0a3",
               "name": "Mang Hoi",
               "profile_path": "/c4QVmvGxkxrAkpCiTIEASBqqUky.jpg",
               "id": 83556,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            },
            {
               "gender": 0,
               "credit_id": "5742a5039251411dc800128f",
               "name": "Barry Wong",
               "profile_path": "/paZy6ZlXIBUmq2mZUyN0KsZKhmO.jpg",
               "id": 62412,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 2.441675,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 39448,
      "vote_count": 14,
      "budget": 0,
      "overview": "Asprin (Mang Hoi) and Strepsil (John Shum), two petty thieves who inadvertently become involved in a murder case when they steal items belonging to a murdered man. The man had hidden an important microfilm in his passport, which the thieves pass onto a forger friend Panadol (Tsui Hark). Inspector Ng (Michelle Yeoh) is assigned to the case, along with Inspector Morris (Cynthia Rothrock) from Scotland Yard! The investigation leads the cops to the bumbling crooks and soon they are on Triad leader Tin's (James Tien) tail, he will stop at nothing to get the incriminating film back and with his hitman and bodyguard (Dick Wei) at his side, he proves too much for the inspectors to catch using legal means, in frustration they give up their badges and go after Tin alone.",
      "similar": [],
      "original_title": "Huang jia shi jie",
      "runtime": 93,
      "poster_path": "/aVAxfAtIGf99mGCTxoTRcXsmaaX.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "D & B Films Co. Ltd.",
         "id": 22060,
         "origin_country": ""
      }],
      "release_date": "1985-01-01",
      "vote_average": 7.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "In the Line of Duty Collection",
         "id": 242765,
         "poster_path": "/5Uy5n3fNaCV6hAVC9ZHXHyLkYG7.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Corey Yuen"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "James Clouse",
         "Barry Wong"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0093229/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNzU4NzUwNl5BMl5BanBnXkFtZTcwNTkyOTcxMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Michelle Yeoh, Cynthia Rothrock, John Sham | See full cast and crew »"],
      "reviews": [
         "A revolutionary a film for kick starting and defining the Battling Babes genre, in the same way 'Zu' was for the fantasy swordplay movies, 'Yes, Madam!' combined the best of Hong Kong action cinema with a fresh, sexy and exciting look. Rarely ever had women played such dominant roles and kicked as much butt as they do here, while still being allowed to show a coy, feminine side. Both Yeoh and Rothrock made their action debuts in this film, and they couldn't have been picked at a better time. The action choreography in HK was entering a new, fast and brutal phase while both girls were at the peak of their physical fitness. The end result is not only the definitive femme-fatale flick, but also one of the finest actioners to leap on to the screen in the mid 80's. The final fight scene alone is more than worth the cost of the DVD and puts Hollywood to shame with its raw power and inventiveness. The best offered in the West at the time was a macho Sigourney Weaver in 'Aliens', but even she wouldn't have been able to touch these girls! Also known as 'In the line of Duty 2' following the later produced 'Royal Warriors' aka 'In the line of Duty' (1986) 'Yes, Madam!' set a new trend in the later 80's whereby attractive women such as Cynthia Khan, Moon Lee, Yukari Oshima and many more were given free reign to dish out the pain, being made to look like the greatest screen fighters ever courtesy of rigorous training from the likes of Dick Wei, Yuen Kwai and Yuen Woo Ping. Even today we are reaping the rewards as female faces, new and old, do battle on the screen in modern classics like 'Crouching Tiger, Hidden Dragon'. Entertaining cameos from Sammo Hung and Richard Ng as well as great fighting performances from the likes of Chung Fa and Dick Wei makes this a testosterone junkies dream! Ultimately lacking in great cinematography or even much of a plot, the name of the game is to excite the audience in as many ways possible, whether it's with lingering shots of a luscious, young Michelle Yeoh or an animated, head and arm cracking La Rothrock - this movie should not be missed by anyone interested in action - \"Hong Kong style\".",
         "The first chapter of this movie (In the Line of Duty 1) was a hit in Asia in the '80 years. So the producer company (D&B: famous producer company of martial arts and Made in Hong Kong movies) decided to make a sequel. Michelle Yeoh (Khan) is not a real martial arts expert like Cynthia Rothrock. M.Yeoh was a Chinese ballet. Cynthia Rothrock was 5 years undefeated female karate champion of USA. The story is simple. But the action scenes are perfect. What would you except more than action from these two dangerous-dead dealing women? They are showing us all their martial arts techniques. If you like martial arts movies then this is your `must to see movie'. If you decide to watch this movie then find a Cantonese version. English translated version is very bad. Check out for Rothrock 's Scottish accent in English version. I would like to know who made this terrible translating in English. Also recommend for all Cynthia Rothrock fans, like me.Michelle Yeoh is still the best partner of Cynthia Rothrock. .I hope that Michelle Yeoh and Cynthia Rothrock ever will play in a movie again.",
         "Hong Kong Cinema has to be the best to happen to action film history. Well, I'll say Asian Cinema has had a tremendous impact period. Hollywood just can't stop duplicating their style (Matrix for example). Hong Kong action films in the 80's should be given a lot of praise because of what has been accomplished. I'm very happy to say that I'm a martial arts FANATIC!!! Yes Madam! (A.K.A. Police Assassins) kicked A**!!! I loved the way Michelle and Cynthia connected with each other. I have a lot of respect for those 2 ladies along with Cynthia Khan (another female heroine). The last fight says enough, it doesn't need to be explained. When I saw this movie for the first time, I rewinded that same scene at least 12 times to get that rush again. This is the type of action that action films are missing today. There are too many digital effects and wire work in today's line of work. I wish Hong Kong action films would repeat this formula again along with other movies. About the content of the movie: Well, the movie is kind of on and off with action scenes. At times, I think the movie didn't know whether to be serious or be comedic. The scene with Sammo Hung, David Chiang, and Richard Ng should've been omitted. I liked the fact that Tsui Hark was in this movie. This is the only movie where I've seen him acting. He did a good job though. He interaction between aspirin and strepsil was funny enough. The first 5 minutes of the movie was off da hook!! Michelle shows off her bad a** cop skills. Cynthia shows off some moves at the airport. And then..... THE FINAL SCENE!!!! To tell the truth, I bought the movie because of the final scene. Those 2 ladies were so graceful with the fight scenes at the end. I enjoyed every punch and kick. Its amazing how Michelle's dancing skills helped so much with her martial arts training. IMPRESSIVE!!! My Overall Judegement: 3.5/4 stars",
         "Hong Kong Cinema has on many occasions either broken the mould of action movies or set a new high in action movies. This movie does the first. By pitting two of the world's major female fighters in the same kick-ass movie they break the mould of a majorly male lead industry. Whilst this is comendable and indeed fantastic, the result is of kick-ass action female heros shows even females can kick ass and look damn good doing it. Unfortuently although this film is fun, it isn't up to scratch on the plot, writing or characters. It still plays like the old cliched action movies of the past. It still has one-dimensional people, over the top bad guys and a story that doesn't make sense the more it is explained. You shouldn't concern yourself with the plot in this movie, although it really does pull this movie down slowly but surely. Michelle Yeoh and Cynthia Rothrock team up to track down the murderer of a British Diplomat. Rothrock is from Scotland Yard and immediatley makes an impression with her almost upskirt camera angles and her long skirt waving about on screen as she kicks and beats an escaping convict. But Rothrock's character is muddled. Why is she constantly beating up prisoners? Why is she angry all the time? Was the diplomat Rothrock's father? Nope. Does Scotland Yard's way of questioning come from a POW camp? Who knows. Fortuently her character is muted along the film so we don't have to think about it. Rothrock's fiery character is played against the sure and measured response of the beautiful Michelle Yeoh. The film is rather dated. The film quality isn't all that good. The one dimensional characters do not make it feel as good as it could have been. Dick Wei in his usual bad guy routine plays a damn good bodyguard to the drug dealing bad guy but during the end sequences he is left as the only man to stop these two girls. Their two on one fight is very, very short...It should have been five times as long. Also I have a problem with the character of \"Mad Dog\". Who is he? Why is he there? What's wrong with his 'tache? Why has he got a US army uniform on? His character is perhaps the worst of the one dimensional characters in the film, and that's not even including the ravenousily cackling drugs baron bad guy. I kept shouting \"stop laughing for goodness sake\". The end fight sequence is amazing as Rothrock and Yeoh gatecrash the drugs baron's mansion - and the ending is pretty good with the bad guy getting away with his crimes *well, almost*. But it isn't as good as the DVD seems to think it is. The DVD version has no audio commentary, the interview has no questions just answers and when questioned the interviewees don't even talk about the movie, which seems strange considering this is what I paid for. As police action movies goes Yes Madam or Police Assassins is a dated but still fun attempt to break the mould of action movies. And whilst it does do this, it doesn't do it in the same way as say Jackie Chan's prolific and far superior \"Police Story\". I'd buy that instead. But if your into female fighting films, this is probably a good a start as any. Overall: 4/10.",
         "So here it is -- Yes, Madam -- Michelle Yeoh's first starring role, back in 1985. I'd been wanting to see this one for a few years. I was a bit worried because the DVD appeared to be a bootleg once it arrived, but it worked fine, so I won't complain. But wow, Yeoh was so amazing in the film. She had won the title of Miss Malaysia just a couple years earlier, for damn good reason, but she took her start in the action genre seriously and trained hard for a few months before shooting began. Sammo Hung himself was the producer (and has a cameo, along with half the industry), and he was looking for two female leads, to make something different from the typical male buddy-cop films. For a co-star they got Cynthia Rothrock, who was making her start in the genre as well. Though she was the real deal as far as martial arts skill. I was interested in the film more for Yeoh but Rothrock certainly held her own. Well, with the action, not the acting, ha ha. Now then, the average American audience might not think much of the movie. It's full of the kind of very odd and stupid HK humor that I've gotten used to. But Yeoh shines in every moment she's on screen, and the action scenes are incredible. In particular the final fights near the end of the film had me as excited as being at a Bulls game. I couldn't believe some of the stuff they were pulling off. My heart goes out to those stunt men!! The actual final minute of the film caught me off guard, though it was realistic. But damn... that ten minutes or so of fighting was among the best I've ever seen.",
         "Ah, this film could have been so great. I tend to like Hong Kong actioners from the 80's so Police Assassins didn't cause me too much irritation for all its flaws, but its sad that the film is the way it is given its potential. Potential that amounts to this: Michelle Yeoh teamed up with Cynthia Rothrock. Two great ass-kicking ladies, Rothrcok with her genuine martial arts talents and Yeoh a graceful mover with some great training behind her (though she wasn't originally a martial artist), they make for a fine team and the film zings whenever they are together. Regrettably their time together is much less than it should have been, as the film inexplicably chooses to focus on a trio of dimwitted petty criminals who get in over their heads in a bit of dirty corporate dealing. John Sham and Hoi Mang are little more than irritating as the oddly named Strepsil and Asprin, while Tsui Hark (best known as a veteran director) does a bit better as the wheeler dealer forgery expert Panadol, perhaps the only one of the three who actually fits into the film. He puts across his sly and shifty, mischievous role pretty nicely and gets a few decent scenes, and isn't cloying in his comedy or emotions like the other two, who overact, mug and generally detract from affairs. Most of the comedy in this film is \"off\", the mixture of light and seriousness is even less well handled here than it is in other films of the same stripe. The films other problem is that the plot is pretty inconsequential, the device on which events hinge is never well explained, thus the film lacks suspense, and the arch baddies is never quite villainous enough to be an effective force, though his two head hench-people (Dick Wei and Fat Chung) are appropriately menacing and fine fighters. Also, the film is largely inconsequential in events until the halfway mark, there are fights and the pace is fair, but it all feels contrived and hastily put together. For all this the film isn't too bad in the end, mostly due to some great action and the fine style on display from director Cory Yuen. He knows just when to slow up or slow down a fight, plenty of smart angles and fast paced editing that remains coherent whilst keeping the pace rapid, also fitting in a couple of nifty jump cuts. His choreography ranges from solid in earlier stages to excellent in the rip-snorting finale and even with the aforementioned plot contrivances, when the film gets moving it gets pretty exciting. To sum up the good points, they just about balance out the bad and leave the film ultimately moderately satisfying. It surely isn't great (it took me a few viewings to really warm to it), but if 80's style Hong Kong action is your cup of tea, this film is certainly better than a poke in the eye with a wet stick. A low 6/10 then.",
         "A HK action drama starring Michelle Yeoh and Cynthia Rothrock as Inspector Ng and Inspector Morris, out to locate a missing microfilm that could be used to implicate Triad Leader Tin (James Tien). Caught in the mix are petty thieves Asprin (Mang Hoi) and Strepsil (John Shum), who accidentally gained possession of the microfilm. The subplot involving the thieves and their leader Panadol (Hark Tsui) is somewhat intriguing; however, it drags on and on with little suspense. The main plot involving the inspectors investigating Triad leader Tin trying to locate the incriminating microfilm he proves to be too big of a task for the inspectors to catch using legal means, which gives the story a bit of a twist. The chemistry between the partnership of Ng and Morris was well-played, as in their fighting choreography. However, what the movie lacks is humor, a well-connected plot that ties everything together and a ***spoiler ahead*** fitting ending (it was very anti-climatic)***spoiler ends***. Overall, though, it's not too bad of a film. It's impressive action scenes are definitely the highlight of the movie. Grade C-",
         "This to me is the best movie Cynthia Rothrock ever made, and one of the best movie from Michelle Yeoh's early career. The final action scene involving the two guarantees it. This was one of very early D&B movie studio's production. D&B movies brought more modern style to Hong Kong movies, and it's clear from this movie that it's years ahead compared other action movies of the time in terms of content, the fashion the actors are wearing, the modern looking background, the speed the scene moves, and the three dimensional shooting. Hong Kong movies in few short years following this movie makes a stellar leap in terms of quality, but you can already see most of the elements in this movie. Cynthia Rothrock plays inspector Carrie Morris from Scotland Yard, and Michelle Yeoh plays inspector Ng of Hong Kong police department. They're after a microfilm that was stolen by two small time crooks. The microfilm contains the names of the ones who are involved in criminal activity. The real bad guy who's got most to lose from the microfilm is Mr. Tin and is willing to go any extent to get the microfilm. Eventually, the small time crook, Yeoh, and Rothrock ends up in Tin's house, and massive fight ensues. The number of casts appearing in this movie is amazing, and this helps to weave many threads in this story. The story has comedic touch, serious touch, and lot of action depending on who's playing the part of the story. It's definitely not one dimensional, and is entertaining to watch. The production is classy, and has high quality looks to it. This movie started the \"Huang Ka\" (Royal) movie craze in Hong Kong, and many movies crowning these two characters were made. The movie has confusing number of titles like \"Super Cops\", \"In the line of Duty\", \"Yes Madam\", \"Ultra Force\", which actually makes finding this movie difficult. The final fight scenes appears in many specials that chronicles Hong Kong martial arts movies to this day. The amazing physical ability of Michelle Yeoh, and Cynthia Rothrock launched them into superstar status. This is one of the best martial arts themed movie to come out of Hong Kong, and is highly recommended for viewing whether you're a martial arts movie fan or not.",
         "Moments of slapstick comedy are nothing but expected when Sammmo Hung makes an appearance, however it may be a touch overdone here in this sub-genre defining \"femme-fatale\" flick. Two female officers of the law present themselves as hard-hitting women which should be shown absolute respect, but another group of protagonists weighs them down and the overall result is more comedic than dramatic. There simply wasn't enough Michelle Yeoh and Cynthia Rothrock on-screen to provide sufficient character development, but even at a basic level it works to support the crime investigation story (which is also very simple). A reel of film ends up being passed around Hong Kong as a triad corporation tries to obtain and destroy it in order to avoid the legal consequences attached. Meanwhile, a group of idiotic underdogs inadvertently become mixed up with the triad affair, as well as our two female hero cops Yeoh and Rothrock. The adventure is goofy yet fun, and the finale will take your breath away in terms of martial arts prowess. This is an iconic movie of both Hong Kong action cinema and the femme- fatale sub genre, and if your mildly interested in either you'll have a great time with this one. - 7/10",
         "As with most original movies that create a long series of sequels, this one is good. Basically a couple of small time crooks who are scrapping money to get their master out of a nursing home get caught up in a fraudulent business. They accidentally steal a micro-fiche upon which a false contract, which will destroy the credibility of a major corporation, has been printed. Unfortunately this corporation wants it destroyed and thus they find nasty hit men after them. This movie stars Cythia Kahn, the star of the In the Line of Duty movies, but it also stars Cynthia Rockwell, an American martial artist. From what I remember of her, she was an attractive woman that could kick butt, but in this movie she is much more masculine, and scary. Both Cynthias come across as very competent and are two women which you do not want to mess with. The movie opens with action and the action goes right through to the end, and the suspense is gripping. It all winds up to a movie where there is a shallow victory because even though the bad guys have lost, the good guys have not won. It is a movie that is not willing to kill off major characters and to show that even though violence may solve problems, it will create a lot more. The axiom that violence never solves anything is not entirely true. Rather it should be that violence creates more problems than it solves. For an action movie, this is great, but if you are wanting a simple movie where the good guys beat the bad guys and come out on top, then this is not that type of movie. It is a movie where things go from bad to worse, and the end comes about from a final act of desperation to make sure that justice is done. The one thing that I got from reading the bible tonight is that even if somebody seems to have everything, that will not last forever. The thing is that God will bring about their destruction, not us, so to attempt to speed up the inevitable will not solve anything. Here all of the evidence may have been destroyed, the bad guy will have to die sometime, and when he dies he will learn the truth of what life is really all about."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["D & B Films Co. Ltd."],
      "summaries": ["Asprin (Mang Hoi) and Strepsil (John Shum), two petty thieves who inadvertently become involved in a murder case when they steal items belonging to a murdered man. The man had hidden an important microfilm in his passport, which the thieves pass onto a forger friend Panadol (Tsui Hark). Inspector Ng (Michelle Yeoh) is assigned to the case, along with Inspector Morris (Cynthia Rothrock) from Scotland Yard. The investigation leads the cops to the bumbling crooks and soon they are on Triad leader Tin's (James Tien) tail, he will stop at nothing to get the incriminating film back and with his hitman and bodyguard (Dick Wei) at his side, he proves too much for the inspectors to catch using legal means, in frustration they give up their badges and go after Tin alone."],
      "budget": 0
   },
   "movielensId": 980,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English"
      ],
      "releaseDate": "1985-01-01",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Corey Yuen"],
      "runtime": 93,
      "movieId": 980,
      "title": "Yes, Madam",
      "mpaa": "",
      "actors": [
         "Michelle Yeoh",
         "Cynthia Rothrock",
         "Sammo Hung",
         "Richard Ng",
         "Mang Hoi",
         "John Shum Kin-Fun",
         "Tsui Hark",
         "Chung Fat",
         "Dick Wei",
         "Melvin Wong",
         "Dennis Chan",
         "Wu Ma",
         "Fruit Chan",
         "Tai Bo",
         "James Tien",
         "David Chiang",
         "Corey Yuen",
         "Chin Ka-Lok",
         "Lam Wai"
      ],
      "imdbMovieId": "0093229",
      "originalTitle": "Huang jia shi jie",
      "genres": [
         "Action",
         "Foreign"
      ],
      "youtubeTrailerIds": ["g4IAe3VmUpk"],
      "plotSummary": "Asprin (Mang Hoi) and Strepsil (John Shum), two petty thieves who inadvertently become involved in a murder case when they steal items belonging to a murdered man. The man had hidden an important microfilm in his passport, which the thieves pass onto a forger friend Panadol (Tsui Hark). Inspector Ng (Michelle Yeoh) is assigned to the case, along with Inspector Morris (Cynthia Rothrock) from Scotland Yard! The investigation leads the cops to the bumbling crooks and soon they are on Triad leader Tin's (James Tien) tail, he will stop at nothing to get the incriminating film back and with his hitman and bodyguard (Dick Wei) at his side, he proves too much for the inspectors to catch using legal means, in frustration they give up their badges and go after Tin alone.",
      "tmdbMovieId": 39448,
      "avgRating": 3.1037,
      "releaseYear": "1985",
      "numRatings": 135,
      "posterPath": "/aVAxfAtIGf99mGCTxoTRcXsmaaX.jpg"
   }
}