{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "picnic",
            "id": 2406
         },
         {
            "name": "labor day",
            "id": 15057
         }
      ],
      "imdb_id": "tt0048491",
      "video": false,
      "title": "Picnic",
      "recommendations": [
         45220,
         62655,
         37315,
         30095,
         37041,
         28007,
         43336,
         3012,
         92432,
         68850,
         32940,
         40985,
         62804,
         99657,
         41206,
         13385,
         30784,
         31694,
         74585,
         32636
      ],
      "backdrop_path": "/sxTDoXY3wRNN4Z2YtHCYucn0g9t.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Hal Carter",
               "gender": 2,
               "credit_id": "52fe47409251416c9106f287",
               "name": "William Holden",
               "profile_path": "/6sa5f8p1KBhYxJDEmCLxn7QLcBe.jpg",
               "id": 8252,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Marjorie 'Madge' Owens",
               "gender": 1,
               "credit_id": "52fe47409251416c9106f28b",
               "name": "Kim Novak",
               "profile_path": "/uTxpa6y6nKo2nfpOP4zsR6abLdi.jpg",
               "id": 5729,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Flo Owens",
               "gender": 1,
               "credit_id": "52fe47409251416c9106f28f",
               "name": "Betty Field",
               "profile_path": "/lqTpbIAThp7ChbHC3Pf914MMtul.jpg",
               "id": 13785,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Millie Owens",
               "gender": 1,
               "credit_id": "52fe47409251416c9106f293",
               "name": "Susan Strasberg",
               "profile_path": "/cSsDPRDucyPylZAmRIAkKkv8l9O.jpg",
               "id": 30043,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Alan Benson",
               "gender": 0,
               "credit_id": "52fe47409251416c9106f297",
               "name": "Cliff Robertson",
               "profile_path": "/q8DvYrkVZ6GajgU2V771Y0dOGWy.jpg",
               "id": 19153,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Howard Bevans",
               "gender": 2,
               "credit_id": "52fe47409251416c9106f29b",
               "name": "Arthur O'Connell",
               "profile_path": "/rWoLpGwQlIZSiPIzJqE1yIMiDxr.jpg",
               "id": 857,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Helen Potts",
               "gender": 1,
               "credit_id": "52fe47409251416c9106f29f",
               "name": "Verna Felton",
               "profile_path": "/uUu5xXqN1x00nuXzv2x84cAWLqu.jpg",
               "id": 67290,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Irma Kronkite",
               "gender": 1,
               "credit_id": "52fe47409251416c9106f2a3",
               "name": "Reta Shaw",
               "profile_path": "/vEiRl8Mj51VCykLT3TQox05CGKt.jpg",
               "id": 5828,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Bomber",
               "gender": 2,
               "credit_id": "52fe47409251416c9106f2a7",
               "name": "Nick Adams",
               "profile_path": "/wtA4pLwHxAROYry4MPq0eLWZ9Cd.jpg",
               "id": 2787,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mr. Benson",
               "gender": 2,
               "credit_id": "52fe47409251416c9106f2ab",
               "name": "Raymond Bailey",
               "profile_path": "/f27gMhRJhKdC99Ti2cloU7P5fLs.jpg",
               "id": 5737,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Rosemary - The School Teacher",
               "gender": 1,
               "credit_id": "52fe47409251416c9106f2af",
               "name": "Rosalind Russell",
               "profile_path": "/zXDvAzoz2hX9XW7i2AHHeIidOex.jpg",
               "id": 30233,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Juanita Badger",
               "gender": 1,
               "credit_id": "52fe47409251416c9106f2b3",
               "name": "Phyllis Newman",
               "profile_path": "/5gbG0bBUon3uRBHFc1b3ZnO42ib.jpg",
               "id": 165553,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47409251416c9106f277",
               "name": "Joshua Logan",
               "profile_path": "/2ywCSjYwYhpojIwKXZcSCXVxzKa.jpg",
               "id": 86051,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47409251416c9106f27d",
               "name": "Daniel Taradash",
               "profile_path": null,
               "id": 20600,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47409251416c9106f283",
               "name": "William Inge",
               "profile_path": null,
               "id": 122953,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56117b989251417899002742",
               "name": "Fred Kohlmar",
               "profile_path": null,
               "id": 30919,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56117ba9c3a368680e0127c9",
               "name": "George Duning",
               "profile_path": null,
               "id": 16748,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56117bcb9251415e530063af",
               "name": "James Wong Howe",
               "profile_path": "/rbAffvKfJYrfLCuuYPzXKSSyU6t.jpg",
               "id": 14569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56117be5c3a368680b012be5",
               "name": "William A. Lyon",
               "profile_path": null,
               "id": 64118,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56117bfac3a3686810012f48",
               "name": "Charles Nelson",
               "profile_path": null,
               "id": 20601,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56117c19925141789900274e",
               "name": "Jo Mielziner",
               "profile_path": null,
               "id": 1518623,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "56117c2ac3a3686814013dff",
               "name": "William Flannery",
               "profile_path": null,
               "id": 1025726,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56117c7fc3a368680e0127de",
               "name": "Robert Priestley",
               "profile_path": null,
               "id": 3649,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "56117c91c3a368681f0116ec",
               "name": "Jean Louis",
               "profile_path": "/uJ2hQZlHtrMJpcigGtM6KP7svBz.jpg",
               "id": 12145,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56117ca4925141478d009649",
               "name": "Clay Campbell",
               "profile_path": null,
               "id": 31206,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 1,
               "credit_id": "56117cb5c3a3682206000a51",
               "name": "Helen Hunt",
               "profile_path": null,
               "id": 31207,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56117cc79251410d80004f45",
               "name": "Carter De Haven Jr.",
               "profile_path": null,
               "id": 13862,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.959551,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39940,
      "vote_count": 21,
      "budget": 0,
      "overview": "The morning of a small town Labor Day picnic, a drifter (Hal Carter) blows into town to visit an old fraternity buddy (Alan Benson) who also happens to be the son of the richest man in town. Hal is an egocentric braggart - all potential and no accomplishment. He meets up with Madge Owens, the town beauty queen and girlfriend of Alan Benson.",
      "similar": [
         9362,
         11069,
         76640,
         262841,
         1585,
         11615,
         83666,
         6977,
         59,
         346364,
         296096,
         162,
         793,
         1427,
         338766,
         339967,
         273481,
         472805,
         359940,
         1368
      ],
      "original_title": "Picnic",
      "runtime": 115,
      "poster_path": "/iOdP6Ybu5ZuNPm0c4zAnlTFF98B.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1955-11-18",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Electrically attracted to each other...Overwhelmingly engulfed by it...Guiltily in love!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joshua Logan"],
      "runtime": 115,
      "synopsis": "A handsome stranger ignites passions at a small-town dance. Beginning with his college fraternity buddy, both youthful students and others old enough to have children are faced with the regrets, whether their own or those of others from less than ideal homes. Should one envy a pretty other? Should another not marry at all? Wouldn't this pretty thing fall into misfortune if mother not make decisions for her? How are things for real in this small town? What are the passions which cannot be held down? And What part can a stranger play if he's not dishonest to his truest self?",
      "writers": [
         "Daniel Taradash",
         "William Inge"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048491/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyMTMxNDg3NF5BMl5BanBnXkFtZTgwODA3NDgyMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Holden, Kim Novak, Betty Field | See full cast and crew »"],
      "reviews": [
         "There are a few great writers of the overheated repressed and desperate from the theater and film world of the 1950's. At the top sit the two greatest, Tennessee Williams and William Inge. In a decade of conformity and great prosperity Inge and Williams tackled subjects ahead of their time. Of course they in some cases had to veil the subject matter but that lead to some wonderful revelations in writing and reading between the lines. In this DVD from Colombia of Inge's Pulitzer Prize winning \u0091Picnic' we have one of the best films of this genre of sexual repression, animal heat, and desperation in small town America. Most reviewers of this film might begin with the leads but I must start of with the wonderful Verna Felton as Helen Potts the sweet old lady who is caretaker of her aged mother and lives next door to the Owens family. This gifted and now forgotten character actress sets the tone of the picture as she welcomes drifter Hal Carter (William Holden) into her house for some breakfast. At the end of the film she glows in tender counterpoint to the dramatic ending. She is the only person who understands Hal, even more than Madge (Kim Novak). Her speech about having a man in the house is pure joy to watch. Her most touching scene is at the picnic when she tells Betty Field. `You don't know what it's meant to me having you and the girls next door.' It is a small but important performance that frames the entire story with warmth and understanding. Betty Field turns in a sterling performance as Flo Owens, Mother of Madge and Millie. She is disapproving of Millie's rebellious teen and smothering of her Kansas hothouse rose Madge. This deeply felt performance is a stark contrast to her lusty waitress in Inges `Bus Stop' the next year. A single Mom trying in desperation to keep Madge from making the same mistakes she did. She becomes so wrapped up in Madge's potential for marriage to the richest boy in town she completely ignores the budding greatness that is bursting to get out in her real treasure. Millie. Susan Strasberg creates in her Millie a sweet comic oddball. She is the youngest daughter who awkwardly moves through the landscape of Nickerson Kansas nearly un-noticed, reading the scandalous `Ballad of the Sad Café' - being the only one who is different and can't hide it. Her yearning to get out of the smallness of small town life is colored with the skill of a young actress with greatness her. Watch how she handles her most tender scenes with Kim Novak. Strasberg has a deep connection with Millie, an understanding of what it means to want to get out and yet want so desperately to fit in. Rosalind Russell nearly steals the show as the fourth woman in the Owens household boarder, Rosemary the schoolteacher. She is the living example of what Flo doesn't want Millie to become, a frantic, hopeless and clutching spinster. In the capable hands of Miss Russell we have a real powerhouse of a performance. She imbues Rosemary with all the uptight disapproval of a woman who knows that her time has past and there are very few options left. She is electric in her need for love. Every nuance of her emotions is sublime in her presentation. Just watch her hands alone. She is present down to her fingertips as this poor clinging woman. Floating above all of this is Madge Owens, the kind of girl who is too pretty to be real. The kind of girl who in a small town like this is not understood to have any real feelings or thoughts other than those that revolve around being beautiful and empty. Enter Kim Novak, who is just such a girl. Who could ever expect such a beauty to be anything more than just pretty? But Miss Novak, a vastly underrated actress in her day (as were most beauties of the day) paints a knowing and glowing portrait of Madge. Her explosion of sexual heat upon meeting Hal for the first time is internal and barely perceptible until she looks at him from behind the safety of the screen door the end of their first scene. It's as if that screen door is a firewall protecting her from the flames. This device is used again near the end of the film where the screen becomes something that keeps her and Hal separated from each other in a new way. At that point it is a safety net keeping them from sex by calling her home. Here she hesitates again to reveal her longing for him. She fights in the early part of the film to keep her sexual desire for Hal in check. That night she loses her fight at the picnic and we watch as she opens to reveal a woman of feelings and dreams so much deeper than the prettiness of her eyes or the luminosity of her skin. This is one of Kim Novak's early great roles and one she fills out with lush and deep emotion. The lives of all of these women of Nickerson Kansas are changed one Labor Day in 1955 when Hal Carter comes steaming into town. William Holden gives a raw and wounded portrayal to Hal, a man at the edge of his youth and on the verge of becoming a lost man. He lives as he always has, on the cache of his golden boy charm and his muscular magnetism. Holden was 35 when he made Picnic, a golden boy at the edge of his youth. He was perfect for the part. Some reviewers say he was too old to play Hal, but I disagree. Without being thirty-five in real life as well as in the story Rosemary's `Crummy Apollo' speech would not be so effective or devastating. Hal is a man 10 to 12 years out of college who never bothered to grow up, a man who never let anyone get too close for fear they might see through is bravado and discover his fears of feeling something, anything before it's too late. Holden also brings a sexual heat to the film that is eons beyond the time it was filmed. He is presented almost like a slab of meat, something we were used to seeing in our female stars of the day, but not so blatantly in our men. He struts around in a pre-Stonewall dream of sexy hotness. Not only the girls in town notice him but a few boys too. (There are several layers to Nick Adams paperboy if one bothers to look.) When finally Holden sparks with Novak they blow the lid off of the uptight code bound studio-strangled world of Hollywood in the Fifties. The film is photographed magnificently in lush color and cinemascope by famed cinematographer James Wong Howe. The famous score by George Durning is classic not only for the famous reworking of the old standard `Moonglow' but for his virtuosity in dramatic power. This is a giant of a score from the silver age of film music. The direction by Josh Logan is perfect in every way and stands among the best of his work. The DVD has a few extras, more than most Colombia releases. However I want to point out that there is an excellent photomontage with music from the film to be found here. In watching the shots and listening to the accompanying score by Durning one can really appreciate his artistry as a composer. Finally, this is a very sexy film and should not be missed as a lesion in how really smart people got so much past the censors in an age of sexual repression and conformity.",
         "It pains me to see people miss Picnic's message; as people hastily label it as 'outdated' or flawed in any way, they neglect the fact that what Inge, Logan, and the cast have offered us is indeed universal. Set on Labor Day weekend in Middle America, this is a film about the bittersweet irony of living in a world governed by rules and time. The characters in Picnic is confronted by a demon that, if not dealt with appropriately, serves to consume them and ensure that they become the thing they most fear. In a desperate search to find love, Rosemary (Rosalind Russell) alienates people to the extent that she seems increasingly destined to be alone. Admired throughout the town for her beauty, Madge (Kim Novak), in her unwillingness or inability to assert herself, is trapped inside her pretty face and finds she cannot build a character to support it. Her younger sister Millie (Susan Strasberg) is devoted to intellectual pursuit but finds her intellectual superiority complex serves to limit her peer group and rob her of her childhood. She is seen throughout the film sneaking cigarettes, and at one point steals a swig of whiskey, all in a rather revealing display of her conflict with regards to her place in the transition from youth to adulthood. Mrs Owens (Betty Field), having been left by her husband presumably for a younger woman, attempts to force Madge into an early marriage to a rich man so that she will not face the same anguish, but her dominating insistence on Madge's beauty as her chief asset is what eventually drives her away with little regret. This truly is the story of the varying ways people create and deal with solitude. Each character undergoes the struggle we all must to find a person beneath the masks we hide behind. It is a study of the irony of the evanescence of happiness - at this Labor Day picnic that is the great joyful gathering of the entire town, each of our main characters seeks their own escape. The emotional rawness of the end of Summer is exposed and serves as the perfect time for seasonal as well as personal transition. They are all, in effect, living parts of a sunset, as described by Russell in perhaps the most significant examination of time in the film. Holden's character is unique in that it is a true testament to the everyman and the power of chance. His arrival in this town is in fact the catalyst for reflection and action, and he shakes things up without having any inherent wisdom or inspiration (he is actually something of a moron, thus his ability to make things happen is so much more intriguing). That this is a passionate and beautifully acted (the occasional vacancy and slowness only a reinforcement of the emotional stagnancy Logan intends to have us defeat) love story with a heart-wrenchingly beautiful theme song is only icing on the cake.",
         "William Inge had his finger on the pulse of small town America. He wasn't checking the heartbeats of its inhabitants but his own. I've just said that as if I knew all about it and I don't, but I sense it. I mean, \"Splendor In The Grass\", \"The Dark At The Top Of The Stairs\", \"Come Back Little Sheeba\" That's all the evidence we need to know that he was a male writer with a woman's heart. \"Picnic\" epitomises that theory. Director Joshua Logan and writer Daniel Taradash trusted Inge's world without questioning it. Everything flows with the irrational sanity of a woman's heart. William Holden was a bit too old for the part but who cares! He is William Holden, capable to provoke passions of Mediterranean intensity at any age. He seems a bit self conscious at times and that helps the character's foibles no end. Kim Novak is breathtaking. Susan Strasberg milks her tomboy with a longing for all its worth. Betty Field, Daisy Buchanan in the original \"Great Gatsby\", gives a masterful performance without uttering a word that may reveal what she's actually feeling, until the end of course. That scene in which she tries to stop her daughter from going away, is as much Field's as it is Inge's. Rosalind Russell didn't get the Oscar for her superb, time bomb disguised in a school teacher's dress, performance. Her craving for sex and romance and sex and marriage and sex is as bold as anything she had ever done and Rosalind Russell new how to be bold from \"His Girl Friday\" to \"Auntie Mame\". The Moonglow sequence has become a classic moment in pictures. Deservedly so. I would suggest, if you haven't done it yet, take a trip through William Inge's territory. Familiar faces, familiar landscapes, familiar feelings, all completely new.",
         "Kim Novak made a tremendous impression as the heroine of \"Picnic\". Looking cool, lush and marvelous in lilac as she walked through her films expressing polite interest and a terror of emotional reactions toward the situations which arose\u0085 \"Picnic\" follows a brawny wanderer who causes sexual havoc one summer in a small American town\u0085 Holden was the charming drifter who arrives, on one hot Labor Day, to a small Kansas town, to look up an old schoolmate, Alan (Robertson), who is the town rich-man's son and from whom he hopes to obtain work\u0085Alan is kind at first\u0097until Madge, Alan's fiancée falls for Hal\u0085 \"Picnic\" was quite compulsive despite some overacting\u0085 Betty Field was excellent as Madge's warm and protective mother who fears for her daughter's happiness if she passes up her rich fiancée\u0085 Madge's teenaged sister (Strasberg) longed for beauty and sympathy\u0085 Her good-hearted neighbor, Verna Felton, was gently compassionate\u0085 Robertson was handsome but presumptuous and arrogant\u0085 O'Connell was delightful as the confused and unsure cigar-chomping salesman\u0085 Rosalind Russell was the easily frustrated and inconsistent spinster who loses her self-control while drunk and practically accosts Hal on the dance floor, destroying his shirt\u0085 When Hal rebuffs her, she storms off in anger; later she begs her shy boyfriend to marry her\u0085 Beautifully photographed, \"Picnic\" will remain always a loved romantic film, largely for the high chemistry of its two stars, Holden and Novak\u0085",
         "Picnic offers superior acting all around, some great cinematography, and a number of excellent scenes, including the famous dance sequence between Holden and Novak. The writing, unfortunately, veers between wonderful and maudlin, and the movie feels outdated in many ways. Worst of all, the directing and music can be heavy-handed at times, clubbing the viewer with melodrama in some of the key moments, when a more subtle approach would have turned this into a real classic. Yet, despite its flaws, there's something special about this film. It has a haunting quality that I can't quite put my finger on. A kind of nostalgia - not for the supposed innocence of small-town life, which the film shows to be a myth, but for the disappearing natural wildness of ourselves as people, the primitive element in humanity that both causes problems and gives us real vitality. My wife and I found ourselves discussing Picnic at length over dinner the following night and even watched several of the scenes again. There are many good details and powerful moments scattered among the weaker parts. I appreciated William Holden's performance even more the second time around - his sense of impatience and desperation are palpable. And he's such a great presence on the screen - I wound up watching him more than Novak in the dance sequence. In fact, my one disappointment with this scene is that Novak doesn't serve as his cinematic equal. She's no Bacall who can fill the screen with Bogart. Rosalind Russell and Arthur O'Connell both do great jobs, especially during the scene where they are discussing marriage. Susan Strasberg pulls off a difficult role and manages to look even more attractive than Kim Novak at times, reminding me of a young Winona Ryder. The Holden and Novak characters are both viewed as sexual objects, yet they're actually quite humble people who can't handle the shallowness of the society around them and who are searching for genuine love. William Holden is always a pleasure to watch, and his fans should find this role particularly interesting. Picnic won't go down as a great film, but there is a great film lurking somewhere inside it.",
         "Picnic was the second film that acclaimed stage director Joshua Logan did, adapting work that he had previously directed for Broadway. I absolutely marvel at Logan's sense of the cinema for someone who worked primarily in the theater. Had he concentrated on the screen instead, I'm sure Logan would have been as acclaimed as John Ford or Alfred Hitchcock or even Orson Welles. William Inge's play Picnic is set in a small Kansas town where drifter William Holden comes to town to look up and old friend from college, Cliff Robertson. As it happens he arrives on Labor Day and the town is having their annual Labor Day picnic. In that 24 hours he changes the lives of all around him, mostly for the better. Especially the women folk. Holden does a very good job in a role he was really miscast in. The part should have gone to Marlon Brando or James Dean or even Paul Newman. Newmwn was in the original Broadway cast, but in the Cliff Robertson part. The lead was done by Ralph Meeker. The women of all ages go for Holden unbridled sexuality from Verna Felton, Betty Field, Rosalind Russell, Kim Novak, and Susan Strassberg in descending order of age. They all kind of like him, but Holden goes for Novak who's Robertson's girl. I think you can figure the rest of it out. Arthur O'Connell as confirmed bachelor/boyfriend of Russell got an Academy Award nomination for Best Supporting Actor, but lost to Jack Lemmon in Mister Roberts which incidentally was directed by Joshua Logan on Broadway and uncredited for the screen when John Ford left the film. But the performance that was absolutely the best was that of Rosalind Russell as the schoolteacher who's approaching what would be called spinster hood and not liking it a bit. She's sending out a booty call to Holden that is unmistakable. In her memoirs Russell said that when Logan asked her to take Eileen Heckart's part from Broadway, he didn't even get to finish the sentence when she agreed. Picnic was playing on Broadway the same time she was doing Wonderful Town and she admired the play by Inge and the work of Joshua Logan very much. I like the individual performances in Picnic, but even more I like the way Logan used the whole town of Hutchinson, Kansas where the film was shot on location as a stage setting. One of the best transferals from stage to cinema ever and it sure helped to have someone at the helm who knew the property and knew how to accomplish his goal. Picnic is a great view of America in the red states in the Eisenhower years and should not be missed.",
         "Hunky drifter Hal (William Holden) arrives in a small Kansas town, disturbing the status quo in \"Picnic,\" a 1955 film based on Wiliam Inge's play and directed by Josh Logan. It co-stars Kim Novak, Susan Strasberg, Rosalind Russell, Betty Field, Cliff Robertson, Arthur O'Connell, and Verna Felton. It's Labor Day and time for the big annual picnic. Beautiful, 19-year-old Madge Owens prepares to attend the picnic with Arthur (Robertson), a young man from a wealthy family. She fights with her jealous, nerdy sister, Millie. And she's warned by her mother (Field) that with each passing year she will become less marketable as a wife. She's advised to solidify things with Arthur. Renting a room from them is Rosemary, a schoolteacher - what one called \"an old maid\" back then. A brittle loudmouth, she's doesn't have not much use for her boyfriend Howard, but he's taking her to the picnic. When Hal jumps off the train to look up his old college friend Arthur, he innocently becomes a catalyst for change. In one way or another, he manages to arouse emotions - mostly sexual - in nearly everyone he meets. A braggart who gives his loose-ends, wandering life a romantic spin, he's hoping Arthur's dad will give him a job. Then he sees Madge. \"Picnic\" is a beautiful story about loneliness, settling for what you can get, love, frustration, and dreams left behind. Madge is sick of being the pretty one, Millie is sick of being the smart one, Rosemary is sick of being an old maid, Arthur is sick of not being a winner in his father's eyes. \"Picnic\" contains some memorable scenes, the best remembered being the classic \"Moonglow\" sequence when Madge shuns tradition and gives into her womanly feelings in one of the most erotic scenes ever filmed. William Holden is too old for the role for Hal (his classmate, played by Cliff Robertson, is 29) but his casting is excellent. Virile, oozing with sex appeal and good looks, Hal turns a lot of heads when he's shirtless and when he flashes his gorgeous smile. In Madge, he sees his last chance to make something of himself; with her as his inspiration, he can do anything. Gorgeous in lavender, Kim Novak's Madge is every man's dream, and as she makes evident in her scenes with Robertson, she isn't sure this is all there is. When she meets Hal, he awakens feelings in her she's never had. Betty Field does a beautiful job as Flo Owens, a woman whose life has been one of disappointment but hopes for a good marriage for Madge. Susan Strasberg as the geeky Millie is superb - tomboyish, with feelings for things other than English literature held inside. The main characters all believe their lives are on a set path. No one believes this more than Millie. \"I will be living in New York and writing books no one reads,\" she announces to her sister. But it's she who convinces Madge that for the fearless, life doesn't have to be set in stone. Arthur O'Connell is effective as Rosemary's boyfriend - though he normally goes along with her, he can be tough when necessary. The scene where he's completely overcome by the town's women and can't get a word in is a classic. Arthur's afraid of change, but his life is going to change by unanimous female consent. One of the best performances comes from veteran Verna Felton as Mrs. Potts. Her final scene with Flo Owens is so poignant as she talks about what it's meant to her to watch Flo's daughters grow up while she cares for her invalid mother. When she meets Hal, it's as if her whole existence comes alive once again. \"There was a man around, and it was good,\" she says. Felton essays a wonderful, wise woman with an understanding of life and love and makes the role shine. The problematic role is that of Rosemary. When people say that Picnic is dated, they're perhaps speaking of Rosemary, an old maid whose sexual desires become unbearable once she sees Hal and witnesses Hal and Madge together. \"Every year I keep telling myself something will happen,\" she tearfully tells Howard. \"But it doesn't.\" What's dated is the implication that an unmarried woman must be unfulfilled - the concept is dated, but it fits into '50s middle America - and don't kid yourself, step out of a big city and there are plenty of people who still feel this way. Rosemary's big confrontation scene with Howard is magnificent acting, but I frankly found Russell over the top in parts of the movie. Some of it is the character, some is not enough attention to directing her. Rosemary might be annoying, but she is also an object of pity. When you wish she'd just stop talking and leave, there's a problem. \"Picnic\" doesn't tell us about the rest of these peoples' lives. The final scenes are really just the beginning. Though both Hal and Madge want to build a real life together, one wonders if they can, and if love and passion are enough to carry them through hard times. One suspects that Madge will one day return to Kansas, sadder but wiser. Hal will always have wanderlust, always put the best spin on marginal situations, and never really hold down a good job. Rosemary will be able to put on an act that she has what she wants, but that's all it will be. Without the competition of Madge, Millie may just surprise herself by blossoming, allowing the womanly part of her in, and have some opportunities in the big city that are more than career-based. In fact, of all of the characters, she perhaps has the best future in front of her. A slice of '50s life, thought provoking, excellent characterizations - Picnic is one of the best films of the '50s with two of its brightest stars. Highly recommended.",
         "There is so much to enjoy in this American melodrama with a deliciously miscast William Holden and a gelid, beautiful Kim Novak that the film can be seen again and again without being disturbed by the 40 year old Holden playing the drop out stallion trying to make amends with his past forging a sort of future for himself, at least that's what I think he wants and I'm sticking with that notion. Holden plays the loser with his shiny boots and smallish brain and that's what reminds us this is just a romantic drama thought by William Inge with a patina of reality and that's all that is real, the patina. I didn't care that emotionally couldn't play because emotionally worked for me thanks to the sexual power of the miscast star. William Holden is a sort of God who awakes the (seemingly) heavily sedated Novak into a towering passion. I would have too. The supporting cast is sensational. Rosalind Russell is a jarring masterpiece of an over the top clichè. The old maid, school teacher with a taste for alcohol and an understandable terror of her own future, overtaking her at an incredible speed. Susan Strasberg, in the part created by Kim Stanley on the Broadway stage is delightful but made me wonder what Kim Stanley may have done with that part. Betty Field is the one character that expresses the most saying the least. She, as per usual, is outstanding. All in all, a film/play that shouldn't be dismissed.",
         "I like the surface simplicity of this movie, beneath which lie important questions: Can we be free of our ancestors' demons? Can love between two emotionally crippled people be healthy? Madge and Hal are -- probably tragically - made for each other. Each is a product of a broken home. Each wants to create a life worth living, despite family history, circumstances, and friends who expect little of them. My heart goes out to both of them. (The sad truth is that Madge's mother's warning will probably come true.) I love the ambiguity of the movie's ending. I read that William Inge (or was it the screenwriter?) had originally had Madge return to her five and dime deadend job. I much prefer the ending that Mr. Logan chose. Alcohol ought to be listed in the cast credits. It plays a big role at the picnic, and the effects of parental alcoholism pervade Hal's and Madge's lives. Roz Russell the town schoolmarm and Howard the shopkeeper provide delightfully lighthearted counterpoints. No car crashes, no karate. Just a simple story, simple setting, and timeless questions.",
         "Very Good movie, despite the flaws. A must for anyone into American mid-century drama. Beautifully filmed and written. Some excellent performances. The Good: Rosalind Russell, Arthur O'Connell, Betty Field, Susan Strasberg. The adequate: Kim Novak and Cliff Robertson. The not too great: William Holden. I'm not bothered by Novak's performance, she was often only as good as her director, and Joshua Logan was an entirely stagebound stylist. Holden on the other hand, is entirely miscast. Way too old for the character by at least 10 years. This is a meaty, sweaty, rebellious part suited to a young Paul Newman or James Dean, not a late '30's, already craggy faced William Holden (he was ideally suited for his Bridge on the River Kwai role). The reading of his lines is artificial and contrived, the pacing atrocious. It's really Logan's fault though. In every one of his films, characters, especially the supporting ones, end up performing like cartoon characters... (Betty Field in Bus Stop, Everyone in South Pacific and Fanny)... and in Picnic, Logan lets almost everyone go over the top with this kind of mannered, ill-paced stuff. However, I love this flick too... the story conquers the flaws, and it consistently pulls me in. Rosalind Russell (though she's allowed to go over the top too) and Arthur O'Connell have remarkable scenes together. Good Movie!"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "The morning of a small town Labor Day picnic, a drifter (Hal Carter) blows into town to visit an old fraternity buddy (Alan Benson) who also happens to be the son of the richest man in town. Hal is an egocentric braggart - all potential and no accomplishment. He meets up with Madge Owens, the town beauty queen and girlfriend of Alan Benson.",
         "The drifter Hal Carter hitchhikes by train to a small town to visit the college friend Alan Benson, who is the son of the industrialist Mr. Benson that is the wealthiest person in town. Hal asks for a small job to Ms. Helen Potts and the old lady feels affection for him and tells that nobody works in the Labor Day. She gives a breakfast to Hal and he meets her next door neighbor, the gorgeous Marjorie \"Madge\" Owens that is Alan's girlfriend. Then Hal is welcomed by Alan that invites him to go to the local picnic with Madge's younger sister Millie Owens. Hal is a braggart, but attractive and gentle, and he becomes successful with the local girls. However, he falls in love with Madge and Alan feels betrayed by his best friend.",
         "Hal Carter is a drifter whose life thus far hasn't amounted to much. He got as far as third year in college and since then has tried his hand at a number of things, all without success. He decides to head for Kansas to find his old college buddy, Alan Benson the son of a wealthy man. It's Labor Day and most of the town is preparing to go to the annual picnic. Hal finds his old friend but is immediately taken with Alan's beautiful girlfriend, Madge Owens. Madge's mother very much wants her to marry Alan and while Madge likes him, it's apparent that she doesn't love him. The sparks fly however between Madge and Hal.",
         "Of the Owens sisters, nineteen year old Madge is seen as the pretty one, and high school senior Millie is seen as the smart one, although they both would like to be perceived a little more like the other. Millie makes no effort to be feminine, believing it will put her deeper into Madge's shadow in comparison. Madge wants to be more than just an object to be looked at. She believes her current boyfriend, Alan Benson, sees her solely in that light. Alan wants to marry her, but she isn't sure she loves him. Madge's mother, Flo Owens, wants her to marry wealthy Alan if only to get her into a better life than she had with her deadbeat husband, who left them, leading them needing to open their home as a boarding house to make ends meet. On the other hand, Alan's father, who owns most of the grain elevators in their small Kansas town, feels Madge isn't good enough for his son. On Labor Day, Alan's old fraternity brother, Hal Carter, who he hasn't seen since their college days, comes unexpectedly into town. Hal is a drifter in every aspect of the word, who comes from a poor family and who could only afford to go to college, where he was eventually dismissed for poor grades, because of a football scholarship. Hal is at the end of his rope and has come to ask Alan for a job, somewhat naively believing he can get a white collar office job complete with a secretary. Hal is all bravado, which captivates some, and off-puts others. Regardless, Hal is seen as a fresh breath of masculinity by most of the women in town. As Hal spends time with Alan, the Owens, spinster schoolmarm Rosemary Sydney (the Owen's boarder) and Rosemary's somewhat beau Howard Bevans, over the course of the day, mostly at the town's annual Labor Day picnic, Hal and Madge find in the other something that is missing from their respective lives that they believe could be fulfilled by the other - which would be against Alan's plans - while Rosemary, who believed she was still young and desirable, comes to certain realizations about her life.",
         "Emotions are ignited amongst the complacent townsfolk when a handsome drifter arrives in a small Kansas community on the morning of the Labour Day picnic."
      ],
      "budget": 0
   },
   "movielensId": 982,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-11-18",
      "dvdReleaseDate": "2000-04-18",
      "directors": ["Joshua Logan"],
      "runtime": 115,
      "movieId": 982,
      "title": "Picnic",
      "mpaa": "PG",
      "actors": [
         "William Holden",
         "Kim Novak",
         "Betty Field",
         "Susan Strasberg",
         "Cliff Robertson",
         "Arthur O'Connell",
         "Verna Felton",
         "Reta Shaw",
         "Nick Adams",
         "Raymond Bailey",
         "Rosalind Russell",
         "Phyllis Newman"
      ],
      "imdbMovieId": "0048491",
      "originalTitle": "Picnic",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["k1A1vqmkftw"],
      "plotSummary": "The morning of a small town Labor Day picnic, a drifter (Hal Carter) blows into town to visit an old fraternity buddy (Alan Benson) who also happens to be the son of the richest man in town. Hal is an egocentric braggart - all potential and no accomplishment. He meets up with Madge Owens, the town beauty queen and girlfriend of Alan Benson.",
      "tmdbMovieId": 39940,
      "avgRating": 3.64607,
      "releaseYear": "1955",
      "numRatings": 623,
      "posterPath": "/iOdP6Ybu5ZuNPm0c4zAnlTFF98B.jpg"
   }
}