{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0113730",
      "video": false,
      "title": "Madagascar Skin",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Flint",
               "gender": 2,
               "credit_id": "52fe4d28c3a36847f8251d9f",
               "name": "Bernard Hill",
               "profile_path": "/fX9ggRFAZM7J8vPBdTWQphUNiRt.jpg",
               "id": 1369,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe4d28c3a36847f8251da3",
               "name": "John Hannah",
               "profile_path": "/jnHc3tC8mzLbVVJD6xWGUsEzC2r.jpg",
               "id": 10727,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4d28c3a36847f8251da9",
               "name": "Chris Newby",
               "profile_path": null,
               "id": 1063201,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d28c3a36847f8251daf",
               "name": "Chris Newby",
               "profile_path": null,
               "id": 1063201,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.018452,
      "production_countries": [],
      "id": 172868,
      "vote_count": 0,
      "budget": 0,
      "overview": "This is the story of Harry and Flint, an unlikely couple. Harry is a shy young gay man who can't seem to fit into his local bar scene. Flint is a crusty, older, and seemingly straight man with a questionable background. They meet on a gorgeous coastline, and evolve from distrust to deep love.",
      "similar": [
         449176,
         184352,
         26280,
         383526,
         338189,
         26933,
         380874,
         376867,
         47643,
         11000,
         258034,
         428493,
         160165,
         1966,
         142,
         1213,
         9800,
         398818,
         11421,
         340684
      ],
      "original_title": "Madagascar Skin",
      "runtime": 96,
      "poster_path": "/sO4lasAsXBDo78B7v7E9DNIrl3j.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-01-26",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chris Newby"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Chris Newby"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113730/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMTY4ODI4NF5BMl5BanBnXkFtZTYwNTAxNDI5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bernard Hill, John Hannah, Mark Anthony | See full cast and crew »"],
      "reviews": [
         "I bought this on video and found it to be as comforting and reassuring a film as any romantic could wish for. Two men meet on a beach, in slightly bizarre fashion. A young and rather sad homosexual, Harry, spurned and rejected by the big city gay community, due to a birth-mark the shape of Madagascar on his face. The other - Flint, a weather-worn (and seemingly heterosexual) sea-urchin prone to swallowing mice and spiders (rather gross this!). They set up house together in a clay cottage by the sea. Initially nothing much happens between them. Harry is attracted to Flint, but fears another rejection. (\"I'm going to die alone, and no-one, ever, will have touched me!\") Yet slowly, mutual affection wins the day. In a touching and believable manner, Flint woos Harry and wins him over. Yet, as they are squatters and outcasts in an unfeeling society, there is always the threat of exterior forces ripping open the idyll. Madagascar skin is a romantic treat. Some may find the symbolic shots of starfish, scuttlefish, crabs (and shoes?) stranded on a beach distracting, while the dream-sequences sometimes disrupt what is basically a straight-forward story. But this is nitpicking. The story of two people finding strength and love in each other's company wins you over in the end. The message would read, like the title of an old Stephen Stills song: \"LOVE THE ONE YOU'RE WITH.\" And the actors work wonders with their characters. Bernard Hill is excellent as Flint, while John Hannah takes risks with almost every part he plays. A great film from Channel 4 and the British Film Institute. You'll love it \"as long as you're straight!\"",
         "What a surprise this movie was. I had no idea what to expect, and the Netflix summary didn't prepare me one whit. Maybe not having expectations helped. I see that other reviewers are put off by the artfulness of the film. That's just what I liked. It's very filmic, full of interesting photography and nonlinear storytelling. Well, sort of nonlinear. The plot, such as it is, follows the development of a relationship between two social misfits. I completely bought the John Hannah characterization of a gay man who's suffered lifelong alienation because of an enormous port wine stain on his face. I believed that the birthmark and being homosexual could have resulted in a character like Harry. I didn't quite understand if he always lived on the fringes, or if, at the point we meet him, he had just given up trying to fit into society. Not that it mattered. The lack of clarity gave \"value added\" as far as I'm concerned. The performances are excellent. The story is compelling and somewhat mysterious. The photography is inventive and evocative. In short, Madagascar Skin has everything I like to see in a film. That it had gay content made it all the better for me. I'm putting this film in my top ten gay movies list.",
         "A well-acted film that unfortunately is a bit too pretentiously 'artsy' to be really good. Too much Pinteresque dialogue and abstract imagery hinder what could have been a really good film considering the talent involved. And I couldn't really believe the basic premise that this attractive man had never experienced sex because of a simple skin defect. Granted many gay males are overtly narcissistic, but certainly not to that extreme. And why did Flint suddenly go from 'straight' to 'gay' with no coherent explanation.",
         "I wish some reviewer somewhere had warned that this movie contains images (verbal and/or visual) of animal suffering. Evidently so few people care about such things that no one bothers. I am doing it now. I might have liked this movie otherwise. Most of what other reviewers say about it appeals to me strongly; I just cannot stand even hints of animal suffering in movies, so when Harry started telling about his job in the research lab I hit the STOP button hard, and I will not go back. I know I will be ridiculed and reviled for writing this, particularly by coolly cynical Europeans if past experience is any indication, but that is just too bad.",
         "I've just seen this film on TV, on the premise of some casual recommendations. According to which I expected a story of earthly resonances about two lonely souls finding long-due comfort in each other. I waited patiently for this to happen, and it only did because the script said so. The film was too busy concocting a medley of stereotyped gay sentimentality and secondhand, Jarman-citing \"artfulness\" - both begging to be put in the same flaming suitcase in which the main protagonist cremates a past of shallow pursuits. The pushy symbolism & stylistics (metaphysical shoes on the seashore, dead fish and squids by truckload, \"significant\" tattoos, and - oh, dear - lightnings during first encounter in bed) create a world of no plausibility and suck all blood out of the characters."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "British Film Institute (BFI)",
         "Channel Four Films",
         "Dan Films"
      ],
      "summaries": ["This is the story of Harry and Flint, an unlikely couple. Harry is a shy young gay man who can't seem to fit into his local bar scene. Flint is a crusty, older, and seemingly straight man with a questionable background. They meet on a gorgeous coastline, and evolve from distrust to deep love."],
      "budget": 0
   },
   "movielensId": 983,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-01-26",
      "dvdReleaseDate": "2003-10-15",
      "directors": ["Chris Newby"],
      "runtime": 96,
      "movieId": 983,
      "title": "Madagascar Skin",
      "mpaa": null,
      "actors": [
         "Bernard Hill",
         "John Hannah"
      ],
      "imdbMovieId": "0113730",
      "originalTitle": "Madagascar Skin",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "This is the story of Harry and Flint, an unlikely couple. Harry is a shy young gay man who can't seem to fit into his local bar scene. Flint is a crusty, older, and seemingly straight man with a questionable background. They meet on a gorgeous coastline, and evolve from distrust to deep love.",
      "tmdbMovieId": 172868,
      "avgRating": 2.68182,
      "releaseYear": "1995",
      "numRatings": 22,
      "posterPath": "/sO4lasAsXBDo78B7v7E9DNIrl3j.jpg"
   }
}