{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117669",
      "video": false,
      "title": "Small Wonders",
      "recommendations": [],
      "backdrop_path": "/bDXi2AcGptmGQIyzPnXGFNsfJTm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "55586e60c3a368776f0095c0",
            "name": "Allan Miller",
            "profile_path": null,
            "id": 1468019,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.002307,
      "production_countries": [],
      "id": 124632,
      "vote_count": 0,
      "budget": 0,
      "overview": "A dedicated music teacher in East Harlem instructs a gaggle of underprivileged children in the art of the violin. In the climax, they play Carnegie Hall with some of the world's foremost fiddlers.",
      "similar": [],
      "original_title": "Small Wonders",
      "runtime": 77,
      "poster_path": "/y6PIqj451fJjoJCKDA5nmaOqjE7.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "When funding for the arts was cut, these kids and one great teacher decided to pull their own strings.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Allan Miller"],
      "runtime": 77,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117669/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4OTkxNDg3OF5BMl5BanBnXkFtZTcwNDQwODUxMQ@@._V1_.jpg",
      "actors": ["Stars: Roberta Guaspari, Arnold Steinhardt, Isaac Stern | See full cast and crew »"],
      "reviews": [
         "No lover of children, of music, of this country, of life itself could fail to be moved and inspired by the love and care and passion evident in this film and the program which is its basis.",
         "Beautiful, heart-warming documentary of music a teacher in New York who develops a violin program for young children. Simple style allows for wonderful story to be told without unnecessary frills or effects. Great cameos by Yitzhak Pearlman and Isaac Stern. Superb grand-finally at Carnegie Hall. Nominated for Best Documentary in 1995.",
         "I saw the documentary some years ago and absolutely loved it. I therefore looked forward to seeing the film, and while enjoyable, it just did not have the impact of the documentary. Small wonders seemed immediate and real life. Music From the Heart by contrast followed the predictable path of sentimentality with a couple of unnecessary romances thrown in as an afterthought, like sugar in a coffee. You know that one or two children are going to have problems at home and need to leave the program. You know that they lose the original venue after tickets have been sold, until SHAZAM someone comes to the rescue with Carnegie Hall. Small Wonders kept the sentimental goo out of the mix and showed it like it was, and Roberta Guaspari was a demanding tyrant, jus1 like the teachers who got the best out of me when I was at school. I would like to see a 'where are they mow?' follow up of the children.",
         "The DVD for this documentary was included in my purchase of the DVD of the movie, \"Music of the Heart\" starring Meryl Streep. Violinists have always been part of my life, my dad was a violin maker and a Cajun fiddler in S. Louisiana back in the 1930s, 40s, and 50s. Roberta Guaspari is the teacher who made all this possible when she needed a job and had 50 violins. In spite of resistance from both the school and some of the parents, and to much doubt that these kids could be interested, she established the inner city program in a tough area of Harlem. As they say, 'the rest is history.' Near the end of the Streep movie is re-created the benefit concert at Carnegie Hall. This documentary has the actual footage of the real concert. As a musician myself, and having played since I was about 10, I can hardly imagine the poise of these small school children, standing next to great violinists like Arnold Steinhard, Isaac Stern, Itzhak Perlman, and other great violinists as they played the concert. Every time I watch it I get a lump in my throat. It is perhaps the best demonstration of the idea that there is no limit to what kids can accomplish if they don't know limitations."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Music"
      ],
      "productionCompanies": ["Four Oaks Foundation"],
      "summaries": ["A dedicated music teacher in East Harlem instructs a gaggle of underprivileged children in the art of the violin. In the climax, they play Carnegie Hall with some of the world's foremost fiddlers."],
      "budget": 0
   },
   "movielensId": 985,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Allan Miller"],
      "runtime": 77,
      "movieId": 985,
      "title": "Small Wonders",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0117669",
      "originalTitle": "Small Wonders",
      "genres": [
         "Documentary",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A dedicated music teacher in East Harlem instructs a gaggle of underprivileged children in the art of the violin. In the climax, they play Carnegie Hall with some of the world's foremost fiddlers.",
      "tmdbMovieId": 124632,
      "avgRating": 3.41935,
      "releaseYear": "1995",
      "numRatings": 62,
      "posterPath": "/y6PIqj451fJjoJCKDA5nmaOqjE7.jpg"
   }
}