{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "aviation",
            "id": 10168
         },
         {
            "name": "tragedy",
            "id": 10614
         },
         {
            "name": "goose",
            "id": 15169
         },
         {
            "name": "earring",
            "id": 15171
         },
         {
            "name": "shampoo",
            "id": 15172
         },
         {
            "name": "hang glider",
            "id": 15173
         },
         {
            "name": "ecology",
            "id": 15174
         }
      ],
      "imdb_id": "tt0116329",
      "video": false,
      "title": "Fly Away Home",
      "recommendations": [
         9449,
         17414,
         13225,
         8986,
         9446,
         21355,
         9822,
         9266,
         30765,
         6878,
         1634,
         9073,
         40688,
         15739,
         25330,
         10714,
         9611,
         11457,
         19371,
         49792
      ],
      "backdrop_path": "/zJiKgxIeikZPr0nM6qNgDL2gzjr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Thomas 'Tom' Alden",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023df1",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Amy Alden",
               "gender": 1,
               "credit_id": "52fe43f29251416c75023df5",
               "name": "Anna Paquin",
               "profile_path": "/5Q4vZK2PqHkreQLmbPspIgrSLUP.jpg",
               "id": 10690,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Susan Barnes",
               "gender": 1,
               "credit_id": "52fe43f29251416c75023df9",
               "name": "Dana Delany",
               "profile_path": "/6BfV8TS5Z28VNUVUX5J0NwRIDNT.jpg",
               "id": 65002,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "David Alden",
               "gender": 2,
               "credit_id": "52fe43f29251416c75023dfd",
               "name": "Terry Kinney",
               "profile_path": "/hv6CObyItPeEg5eJzzTb4L1j6DP.jpg",
               "id": 11067,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Barry Stickland",
               "gender": 2,
               "credit_id": "59a734ae92514157ee00572e",
               "name": "Holter Graham",
               "profile_path": "/wW48TzQ7yOGTi4Fi46fuHEQXvrP.jpg",
               "id": 92726,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Glen Seifert",
               "gender": 2,
               "credit_id": "59a734dcc3a3683c8700580e",
               "name": "Jeremy Ratchford",
               "profile_path": "/fzzVrrOw00lWlqJs4dBSD8gJGZg.jpg",
               "id": 44205,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "General Hadfield",
               "gender": 2,
               "credit_id": "59a73505c3a3683c87005825",
               "name": "Michael J. Reynolds",
               "profile_path": "/3JA1yjTfSM35GNzWR2dZgubRZ8B.jpg",
               "id": 86442,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023e03",
               "name": "Carroll Ballard",
               "profile_path": "/h4y9QocZWrBSlYd9ZavcJBRAHd5.jpg",
               "id": 68212,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023e09",
               "name": "Bill Lishman",
               "profile_path": null,
               "id": 68213,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023e0f",
               "name": "Robert Rodat",
               "profile_path": null,
               "id": 12832,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe43f29251416c75023e15",
               "name": "Carol Baum",
               "profile_path": null,
               "id": 36131,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023e1b",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023e21",
               "name": "Caleb Deschanel",
               "profile_path": "/2TsYnZibZRfHY3vcmEdLTJSR4kl.jpg",
               "id": 8750,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f29251416c75023e27",
               "name": "Nicholas C. Smith",
               "profile_path": null,
               "id": 28161,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 7.547841,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11076,
      "vote_count": 137,
      "budget": 0,
      "overview": "Amy is only 13 years old when her mother is killed. She goes to Canada to live with her father, an eccentric inventor whom she barely knows. Amy is miserable in her new life... until she discovers a nest of goose eggs that were abandoned when a local forest is torn down. The eggs hatch and Amy becomes \"Mama Goose\". When Winter comes, Amy, and her dad must find a way to lead the birds South...",
      "similar": [
         334,
         2024,
         425,
         605,
         879,
         95,
         49519,
         675,
         10999,
         1164,
         744,
         1374,
         745,
         335,
         70,
         142,
         1562,
         637,
         363676,
         116711
      ],
      "original_title": "Fly Away Home",
      "runtime": 107,
      "poster_path": "/azFDIXe7TgEgte7gHL8PkvXW0GC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sandollar Productions",
            "id": 5842,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-09-13",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Carroll Ballard"],
      "runtime": 107,
      "synopsis": "Thirteen year-old Amy ( Anna Paquin) is riding passenger with her mother ( Deborah Verginella) in their car one rainy night in New Zealand. All seems right and pleasant until the mother loses control of the car and crashes. Amy awakens later in the hospital to find her father, Thomas Alden ( Jeff Daniels), who says that he's come to take her home with him to Canada. Her mother has perished in the accident. Thomas brings her back home to his farm where he's evidently been used to living on his own for a while; most of the rooms in the house are used to store works of art and the barn has become his workshop. Amy isnt used to the transition and claims she doesn't remember anything about living there. Her displeasure is further fueled when her father introduces her to his girlfriend, Susan ( Dana Delany). Amy responds to the introduction with quiet hostility. As Amy tries to become adjusted to her new life, she finds her father's traits difficult to accept at first. One morning he angrily runs out of the house clad in nothing but his underwear to confront a construction team deforesting the area around his home. Another day, Amy finds him testing a new invention for flight; an aluminum glider strapped to his shoulders which he soon crashes in the surrounding field. Scared and unsure if her father's all right after the crash, Amy shuts herself in the house when he finally emerges and shouts triumphantly. One day, while exploring the area around the Alden farm, Amy comes across a portion destroyed by the construction crews. Under a fallen tree, she discovers an abandoned nest of goose eggs, some of which emit weak chirps. She gathers all the eggs and brings them back to the barn where an old bureau stuffed with scarves and cloth provides a safe place to put them. She takes a heating lamp from her father's workshop and uses it to provide light and warmth for the eggs. The next morning, as she's preparing for her first day at school, she stumbles on her uncle David ( Terry Kinney) who Thomas invited over to help with his work. She's quickly ushered out the door and impatiently sits through her classes as the first of the eggs begin to hatch. When she arrives home, she greets her father and Susan who say theyre going to a town meeting. Amy later takes advantage of her uncle's distracted attention and sneaks away to the barn where she finds the newly hatched goslings. They look at each other and a bond immediately forms. At the meeting, Thomas speaks out against the construction thats been destroying the habitats around his home but is criticized by one of the drivers who says he's merely performing a job to provide income for his family. The local game warden ( Jeremy Ratchford) draws attention when he addresses the threat of construction not only towards local home owners, but to the wildlife. Thomas and Susan return home to find Amy missing and frantically search for her in the night fog with a remorseful David. However, they find her sleeping in the barn surrounded by her hatchlings. When she wakes up, she asks if she can keep them. Though Thomas is welcome to do anything for his daughter's happiness, hes less than enthused about sharing space with a flock of geese. He goes to the game warden, Glen, and issues his concerns. Glen gives general advice and stops by the farm to observe the goslings following Amy around the property, a trait called imprinting where baby geese or ducks assume the first thing it sees is its mother and will follow. At the house, he attempts to pinion the geese in accordance to a law that states all domestic geese must be rendered flightless. It would involve cutting off the first wing joint of each of the goslings, something Amy objects to by hitting Glen over the head with her popcorn bowl. She quickly gathers up her geese in the bowl and locks herself in the bathroom while Thomas forcefully ejects Glen from the house. Glen threatens that he will have to confiscate the geese if they start flying. Thomas tries to apologize to Amy but she refuses to come out. She spends the night in the bathroom. The next morning, Thomas' friend Barry ( Holter Graham) stops by the farm to visit while Amy is in the shower with her goslings. When she accidentally sprays soap into her eyes and steps out of the shower screaming, chaos ensues after Thomas breaks the bathroom door in to expose the naked Amy. Susan shoves a shaken Thomas out of the bathroom and tries to console Amy. Amy lets out her frustrations of having to live with her father who is 'so weird' and her anger towards the game warden. Susan says that she knows she cannot replace Amy's mother, but that she can be her friend and assures her, as a friend, that nothing will happen to the geese. Thomas realizes that the realities of the geese flying is a real problem and devises a way to show the birds how to migrate south. With the help of David and Barry he upgrades his glider with a series of engines to maintain flight until he is able to construct a frame that he can sit in and control the plane with. He introduces the idea of leading the birds south to Amy, who is hesitant but agrees to help. Still, no matter how many times they try, the geese prefer to stick close to Amy rather than follow Thomas in his plane. Frustrated, Amy decides to try manning the plane herself and manages to get airborne, with the geese following, before crashing into a fence. Thomas finds her alive and well but breaks down, having thought the worst. Despite that, having seen the slight success of Amy's ill-fated flight test, Thomas proposes to Susan that he teach Amy to fly a new glider and lead her and the geese south. Susan thinks the idea is ludicrous but Amy is excited. Thomas sells one of his art pieces, a model of the lunar lander, to fund construction of a new glider complete with goose wings and head. He teaches Amy how to pilot it and, to everyone's elation, the geese follow her in flight. David is able to contact a bird enthusiast and entrepreneur, Dr. Killian ( David Hemblen) about introducing the geese to a local bird sanctuary in South Carolina. The expert explains that if the geese are able to land by a certain date, the land is theirs. Meanwhile, Thomas and Amy continue training the geese in flight, making them stronger and discussing flight paths and when their takeoff date should be. However, on one training flight, Igor, a goose born with a limp and hesitant to fly, is accidentally knocked out of the air when he flies into Amy's plane. Fortunately, he is found later by Amy and the others during a night search in the woods. During this time, however, Glen revisits the farm and confiscates all the geese in their crates unnoticed. The next day, Thomas picks up Amy during lunch period from school while David drives down to the game warden's office claiming to have hit a mysterious creature during the night. Glen is teaching school children about conservation while all this is happening. As David takes the officer at reception to his, now empty, truck and suggests scanning the area for the missing beast, Sharon and Barry spring the geese loose from the back of the building and herd them into flight as Thomas and Amy pass overhead in their planes, beginning the flight south. As they pass over the school, Glen is left speechless. After crossing Lake Ontario, low fuel forces Thomas and Amy to land on an army base where they are quickly taken into custody. After they tell their story, however, they are welcomed and allowed to stay the night before leaving the following morning with plenty of news reporters documenting their amazing journey. At one point Amy's geese become distracted by a large flock of wild geese and follow them into marshlands where hunters take aim at them. Amy and Thomas fly in low, shocking the hunters, and land to search for the geese. They come across an old woman with a shotgun ( Gladys O'Connor) who offers them residence when she discovers that Amy is 'the little girl I saw on television'. Back en route, Amy and Thomas find themselves in thick fog and descend into a dense city, narrowly missing skyscrapers while navigating the main street below. On the last day of their trip, Susan, David, and Barry arrive at the bird sanctuary early to find a crowd of people waiting for Amy and the geese, shouting their support and protesting against a corporation bent on bulldozing the sanctuary. As Amy and Thomas get nearer, Thomas' plane malfunctions and he crashes into a field. He persuades Amy to fly ahead, saying that she's got her mothers spirit and that she will make it to the sanctuary. Thomas rides ahead and makes it to the sanctuary in time to see Amy fly in over the dunes and land safely to cheers of hundreds, both on site and watching on TV. Reporters flock to her as her geese flock happily to their new winter home. An epilogue video shows Amy waking up on an early spring morning to the sounds of her geese returning along the route she had led them on, testing their feet on a still frozen pond.",
      "writers": [
         "Bill Lishman",
         "Robert Rodat"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116329/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA0OTE5MDQ0NTBeQTJeQWpwZ15BbWU4MDI5OTc3NTMx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeff Daniels, Anna Paquin, Dana Delany | See full cast and crew »"],
      "reviews": [
         "I got sucked into a movie on the satellite dish the other day, 'Fly Away Home.' It's a story about a young motherless girl (Amy) who rescues some wild goose eggs and basically becomes their mother. The story evolves as the goslings grow into young adult birds ready to fly south. Since they never had parents the geese haven't learned to fly. The girl's dad thinks he can get them to fly by following him in his ultra-light. But they will only follow Amy. So dad teaches her to fly. Soon the geese are flying. Next, dad and Amy hatch a plot to fly south and have the geese follow them. We know this actually happened when 2 scientists did something similar. One of the reasons I was sucked into this wonderful family movie was the photography. It is National Geographic quality. In fact I was so impressed with the cinematography that I had to look up who did it: Caleb Deschanel. The setting, a farm in Southern Ontario, allowed him to become intimate with the geese and the natural setting. Another reason I couldn't stop watching the movie was the stunning performance by Anna Paquin, the 16-year old girl who played Amy. I remembered her from the movie, 'Piano.' She played Flora, the daughter of Holly Hunter. I'm sure they picked Paquin to do that part because of her speaking ability. Holly Hunter played the part of Ada, a woman who couldn't talk. She communicated with sign language through her daughter. Paquin was so good in her part that she won the Oscar, quite a feat for an 11-year old. The story, 'Fly Away Home' is touching because she's not the kind of Hollywood-trained child actor you find in most movies. A surprising thing happened as I watched Amy and her geese. I could sense a startling serenity from her as the bond had developed between them. I wondered how she could manage that. She was only a 16-year old actress then but she conveyed a mothering instinct that goes back to the ageless beginnings of life on this planet. When the goslings were following her around, much of the photography was from ground level. Later when they were all flying, the photography was right there in the flying formation. You were seeing the birds, in flight, right next to you. The beauty of motion was unbelievable. I thought, 'How could anyone shoot these creatures?' There is beauty in seeing them fly. There is beauty in seeing them in their habitat. But the overwhelming beauty is in their living. They deserved that life. It made me think of this sad planet and the billions of creatures that have died because of the human race. Here was a story that went against the slaughter. When Amy and her birds arrived at their destination in Chesapeake Bay I had misty eyes. So I'm a soft touch.",
         "I don't have much in the way of feelings so usually stick to science. An engineer by trade I used to subscribe to a \"tecchie\" aviation magazine. One issue had this incredible story by some kindly if eccentric Canadian folks who had raised a gaggle of baby geese, and you know the rest. Details of aviation aside, the story warmed my heart. Most Unusual. A year or so later I took my kids to see \"Flyaway Home\" expecting a mildly entertaining nature documentary, like Disney's old \"Prairie Dog Town\" with an aviation twist. What I saw was a superbly crafted and deeply touching little masterpiece. I was in tears by the end. Metaphors of kindness aside, this film will touch any heart however hardened or scarred . And the kids liked it too.",
         "Following Toy Story comes Fly Away Home, another string to the increasingly large bow of children's films that adults can also enjoy. The story follows Amy, a 13-year-old New Zealand girl who is forced to live with her estranged father in Canada following a car crash that kills her mother. Amy becomes increasingly withdrawn and upset until she finds a collection of similarly orphaned goslings that she takes care of, nurturing them until they are ready to migrate to the southern United States. The film could easily have fallen into the sappy \u0091family film' category. However, it never lets itself, choosing to concentrate more on characters than moments. Amy's character, played with breathtaking maturity by Anna Paquin, is better developed and more complex than characters in most films aimed at adults. The supporting cast also flesh out their strong characters to make the whole film much more believable. The cinematography is beautiful, the dusky-autumnal scenes are captured in an explosion of reds and yellows and oranges that seem to wash over you time and time again, and the final flight sequence is a wonderful closing to an incredibly refreshing film.",
         "People always seem to quote this movie as perfect family fair. I hate your typical Hollywood-produced family movie with ingratiatingly saccharine kids and perfect parents-with-a-message. Despite its plucked from the headlines (mostly) true story roots and workmanlike, rather than inspired scripting, this movie manages to transcend that due to a number of factors. Beautiful cinematography of both the geese and southern Ontario. Decent supporting performances. But mostly due to the perfectly cast leads, Jeff Daniels and Anna Paquin, as the estranged father and daughter. Everyone says Daniels is underrated, so I guess that means he isn't. He manages to make the father eccentric without ever falling into caricature. Paquin creates a believable teen character, never straying from truth in favour of evoking our sympathy by being cute. Her naturalistic style of acting sometimes seems out of place with other more studied actors (e.g. the almost unwatchable Hurlyburly) but here she and Daniels and the minimal dialogue of the script work so well. Its about time someone gave her another decent lead role. Finally, the opening credits sequence is a masterclass in storytelling economy, giving us the plot background without words, and setting up the whole downbeat tone of the movie with Mary Chapin Carpenter's haunting version of 10,000 Miles.",
         "This is poetic, emotional, breathtaking film-making blessed with a truly inspiring Mark Isham score. The theme song, \"10,000 Miles\", is achingly beautiful and is first used with intuitive irony over the film's opening credit sequence. Anna Paquin is the little girl who, with her father, Jeff Daniels, \"imprints\" with a flock of young geese and leads them, via homemade aircraft, to a new home thousands of miles away. The flight sequences, which combine real flying with computer-assisted imagery over rivers, pastures and cityscapes, are flawless. They capture the awe and staggering thrill of flight without ever resorting to unnecessary, contrived stuntwork. Daniels, not a regular face on the silver screen these days, is natural and likable as Paquin's eccentric father while Paquin once again demonstrates what a brilliant talent she is. The narrative builds to an exciting conclusion as the film's environmental theme is amplified. Director Ballard, who also made the striking BLACK STALLION and the stark NEVER CRY WOLF, brings acute visual economy to every scene and never allows the film's underlying theme to become preachy. Caleb Deschanel, the film's cinematographer, gives us flawless images that frequently drop the jaw. A major achievement in a minor key.",
         "The greatest challenge any of us will ever face is how to regain the ability to reach for joy after the loss of a loved one. Especially, when that loss is abrupt and occurs at an age before one has developed the capacities to manage it. That is the over-arching and powerful theme that \"Fly Away Home\" manages to evoke so beautifully. It's difficult to pin-point which of the masterfully developed elements of filmmaking that make this movie such a joy to watch again and again. But, surely, it all comes down to the great story-telling ability of Mr. Carol Ballard. Everything is harnessed to tell the story (a basic element of drama surprisingly ignored these days in Hollywood) of a girl who loses her mother at a critical point in her life, and has to find a way to the rest of her life, while reeling from the trauma and uncertain of how to survive her grief. The discovery of an abandoned nest of Canadian geese eggs is the simple overlaying metaphor that takes us on her journey. The great difference between this movie and other movies of its type is that Mr. Ballard resists the temptation to explicate the transcendent story of Amy's emotional triumph over her loss and grief. Simply put, the story is about the geese, but it's really about Amy's recovery and reconnection with her future, with her life, though there isn't one line of dialogue explaining that to the viewer. It seeps out of the story through the masterful, chekovian performances of Anna Paquin as Amy and Jeff Daniels as her father. This theme is supported with such unerring consistency in the music (Mark Isham at his most sublime), the cinematography, editing, lighting, art direction and casting. All of the casting is just perfect. Especially in the sense that none of the actors ever seem to be pulling anything out of their \"bag of tricks\" or doing some bit you've seen them do before. The quality of the work is such that much of the dialogue in the movie seems spontaneous and almost ad libbed. The final sequence is a thing of sublime, subtly powerful beauty that is rarely seen in movies these days. A powerful, wordless climax. Something that happens so effortlessly, because the story that comes before has been told so completely and with such skill. I cry every time I watch it. Thank you, Carol Ballard, for this beautiful gift of compassion and belief. Note: Did Anna Paquin actually move from little girl to adolescent in the course of making this movie, or is it more of the master magicianry of Carol Ballard and his team?",
         "I saw this movie in theaters with my dad. When we left he said, \"It makes you want to go buy a little airplane, doesn't it?\" It did. I loved this movie, the music especially. I was saddened to find that they didn't release a soundtrack. While a little folksy, it is nevertheless a funny and heartwarming story about a girl's relationship with her father in a home she is struggling to remember. Amy is trying to cope with her mother's death, then has to move halfway across the world and get used to new family members, her father's workaholic bachelor life, and her father's girlfriend. Just as she is ready to give up, she becomes the mother to fifteen abandoned Canadian geese. Her father and friends put together an elaborate scheme to teach the geese to fly and chaos ensues as Amy and her father lead their flock south for the winter. A touching story of life and love. I recommend it highly.",
         "A family film .. yes but certainly one that can be watched and watched again without the need for a licensing child. Jeff Daniels is superb as an eccentric father who takes on board his daughter after his estranged wife's death in a car accident. A strong supporting cast (including geese) are driven to support Amy's desire to assist a bunch of orphaned geese to maintain a wild existence. This involves teaching the geese to fly and leading them South by air. This journey for both the daughter coping with grief after the loss of her mother, the father in discovering his daughter once more and the geese in finding a new home for the Winter adds up to .. well tears and more tears. Before you write this film off as \"fantasy\" take the time to watch the BBC's Life of Birds final part. There you meet a remarkable farmer from the US who is using a microlite to aid a few of the last remaining Whooping Cranes to re-establish migratory patterns. In the UK the site of skeins of wild geese migrating in Winter form their Summer homes in Iceland and the Arctic circle is one of the last great wildlife dramas left on this small island. The views in Fly away Home of Amy's geese as they move in to join the hundreds of wild geese powering South capture this majesty. This story of a group of people who care about and assist this natural pattern may help reinforce some of the awe that we should all feel when confronted with these epic and annual journeys.",
         "WARNING: This review may reveal portions of the movie plot. If you want to just lose yourself in a story that is sweet and uplifting, then this is the movie for you. I was surprised at how efficiently this movie drew me in, but then again I'm a big softie at heart. I started watching this movie late one night and didn't want to stop -- so I didn't! The movie concerns a young girl who goes to live with her father after her mother is killed in a car accident. Dad and Mom divorced many years before and live on opposite sides of the world -- Canada and New Zealand -- so she doesn't know Dad very well. Jeff Bridges plays the father in this film and does it incredibly well. He's an artist who is just a little bit quirky, a big believer in following your dreams, and desperately trying to capture the love for his daughter that he regrets having lost in the divorce years before. Anna Paquin as his 13-year old daughter is wonderful -- how do young kids act so well??? -- as she learns to grieve for her mother, find a new life in a new country, and love and trust a father whom she has barely known most of her life. The supporting cast shines as well, in most cases. Most notably is Terry Kinney as Daniels brother and the young girls uncle. He's the kind of uncle everyone wants to have around, although when he falls asleep while babysitting and Paquin's character disappears, he doesn't seem very responsible. He becomes a bit of a scene stealer though as the movie progresses. He has one of the best lines in the film when he tries to convince a U.S. border-patrol agent that he needs dozens of gallons of gas to go camping for his portable generator to run his blender and TV. \"Nothing like camping in the middle of no where with your VCR, a good movie, and a pina colada.\" Dana Delany (of TV's \"China Beach\" fame) plays Daniels sometimes live-in girlfriend and seems to be the only actor who doesn't really stretch in this part. I don't believe this is Delany's fault, however. This story is primarily about the father-daughter relationship, and Delany's part suffers as a result. Most scenes are supportive and don't really give her a chance to shine. The story is well written with a combination of genuine emotion, without becoming overly sappy. Yes, the film is sweet, but not sickeningly so. When the credits began to roll at the end of this movie, the first thing I thought of way, \"How could this have gotten a PG rating?\" I *literally* heard one four-letter word in the entire film, and that is said under the breath so that I wasn't even sure I heard it. There is one reference to sex outside marriage, and a car accident at the beginning of the film. That's it. Parents, you can show this to young children without any real concern. My suggestion: Watch the first 5 minutes of the film and if you decide your children can handle the opening sequence of a car crash, then there probably is nothing else in the film that should be a problem (in my opinion!)",
         "I love this movie it's a classic.You will love it. It's one of those heart toucher's.Its a great story and you can tell that there's a lot of meaning to it.I guarantee you'll love it!!It is based on a true story,its about a girl who finds 16 goose eggs and begins raising the geese after the eggs hatch.It's a sad and happy story and also a must see motion picture. I have seen this movie at least 50 times and i am willing to watch it another million times!! I personally recommend that you see this movie. If you don't see it i can guarantee you will regret it. So go rent Fly Away Home a great 1996 film for you and your family. Enjoy watching this great film,i know I did!!"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Sandollar Productions"
      ],
      "summaries": [
         "Amy is only 13 years old when her mother is killed in an auto wreck in New Zealand. She goes to Canada to live with her father, an eccentric inventor whom she barely knows. Amy is miserable in her new life...that is until she discovers a nest of goose eggs that were abandoned when developers began tearing up a local forest. The eggs hatch and Amy becomes \"Mama Goose\". The young birds must fly south for the winter, but who will lead them there? With a pair of ultralight airplanes, Amy, her dad and their friends must find a way to do it...",
         "Amy is a young teenager when she loses her mother to a car accident. Because of it, she moves in with her father. Amy finds her new life absolutely miserable, until she finds abandoned goose eggs from when the developers tore up the forest behind her home. They soon hatch and Amy becomes their \"mother\" and takes care of them. Winter quickly arrives, and the geese must go south. But who will show them the way? It is up to Amy and her father to make sure that the young geese find their way, and with the assistance of her father's invention, they do just that.",
         "Amy is reunited with her father after her mother's death. She withdraws from her new life, and life in general, until she finds a reason to participate in something: the preservation, parenting, and eventual migration-instruction of a flock of orphaned geese.",
         "A father and daughter decide to attempt to lead a flock of orphaned Canada Geese south by air."
      ],
      "budget": 0
   },
   "movielensId": 986,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-13",
      "dvdReleaseDate": "2001-08-07",
      "directors": ["Carroll Ballard"],
      "runtime": 107,
      "movieId": 986,
      "title": "Fly Away Home",
      "mpaa": "PG",
      "actors": [
         "Jeff Daniels",
         "Anna Paquin",
         "Dana Delany",
         "Terry Kinney",
         "Holter Graham",
         "Jeremy Ratchford",
         "Michael J. Reynolds"
      ],
      "imdbMovieId": "0116329",
      "originalTitle": "Fly Away Home",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["KxEK8xHyAnc"],
      "plotSummary": "Amy is only 13 years old when her mother is killed. She goes to Canada to live with her father, an eccentric inventor whom she barely knows. Amy is miserable in her new life... until she discovers a nest of goose eggs that were abandoned when a local forest is torn down. The eggs hatch and Amy becomes \"Mama Goose\". When Winter comes, Amy, and her dad must find a way to lead the birds South...",
      "tmdbMovieId": 11076,
      "avgRating": 3.50119,
      "releaseYear": "1996",
      "numRatings": 3348,
      "posterPath": "/azFDIXe7TgEgte7gHL8PkvXW0GC.jpg"
   }
}