{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "singer",
            "id": 10229
         },
         {
            "name": "songwriter",
            "id": 33475
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0116442",
      "video": false,
      "title": "Grace of My Heart",
      "recommendations": [
         51049,
         29691,
         50225,
         110598,
         249391,
         56135,
         42257,
         53263,
         15506,
         26042,
         23312,
         24826,
         52017,
         98864,
         61280,
         58467,
         43232,
         61168,
         19033,
         35371
      ],
      "backdrop_path": "/5vsKH7q59okwwHDbN2mUYZlwZQz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Denise Waverly / Edna Buxton",
               "gender": 1,
               "credit_id": "52fe497cc3a36847f819c9c1",
               "name": "Illeana Douglas",
               "profile_path": "/w2O2SOXzwtJu9eytb3hGS7T8ftR.jpg",
               "id": 7796,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joel Millner",
               "gender": 2,
               "credit_id": "52fe497cc3a36847f819c9c5",
               "name": "John Turturro",
               "profile_path": "/70V4hwvWN0J3aX2LzQg7eKCeq29.jpg",
               "id": 1241,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Howard Cazsatt",
               "gender": 2,
               "credit_id": "52fe497cc3a36847f819c9c9",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jay Phillips",
               "gender": 2,
               "credit_id": "52fe497cc3a36847f819c9cd",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kelly Porter",
               "gender": 1,
               "credit_id": "52fe497cc3a36847f819c9d1",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Mrs. Buxton",
               "gender": 1,
               "credit_id": "532b678bc3a3684bbf00013b",
               "name": "Christina Pickles",
               "profile_path": "/gHEzuKpIPJYXIDPoXzsGbnhv19S.jpg",
               "id": 94978,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Doris Shelley",
               "gender": 1,
               "credit_id": "532b67aac3a3684bb100012b",
               "name": "Jennifer Leigh Warren",
               "profile_path": "/RA1xFVBUCT4k2WfD0n2xb16UmF.jpg",
               "id": 91850,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Audition Record Producer",
               "gender": 2,
               "credit_id": "532b67cdc3a3684bc600011c",
               "name": "Richard Schiff",
               "profile_path": "/gHFxL7MIGvmcbg5hhTNrbjIttQN.jpg",
               "id": 31028,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Annie",
               "gender": 1,
               "credit_id": "532b6802c3a3684bc6000121",
               "name": "Tracy Vilar",
               "profile_path": "/qizLuMAfvMudC1VyODiSp9ukeGK.jpg",
               "id": 156633,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "John Murray",
               "gender": 2,
               "credit_id": "532b682ac3a3684bbf000153",
               "name": "Bruce Davison",
               "profile_path": "/kYFBIffblcsbLMITDZYHhVf5c9f.jpg",
               "id": 52374,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Cheryl Steed",
               "gender": 1,
               "credit_id": "532b6881c3a3684bbf00015e",
               "name": "Patsy Kensit",
               "profile_path": "/fp8059ZLrCiZFgdhcwHTHHe6kBr.jpg",
               "id": 14326,
               "order": 23
            },
            {
               "cast_id": 27,
               "character": "Marion",
               "gender": 1,
               "credit_id": "532b68b4c3a3684bb800014f",
               "name": "Lucinda Jenney",
               "profile_path": "/nhKWN1oWThSgz0AnUDOcQTubh3r.jpg",
               "id": 5148,
               "order": 24
            },
            {
               "cast_id": 28,
               "character": "The Riptides' Engineer",
               "gender": 0,
               "credit_id": "532b68e3c3a3684bce000160",
               "name": "J. Mascis",
               "profile_path": null,
               "id": 1059867,
               "order": 25
            },
            {
               "cast_id": 29,
               "character": "Commune Guitarist",
               "gender": 1,
               "credit_id": "532b6905c3a3684bab00015c",
               "name": "Shawn Colvin",
               "profile_path": "/srRZ16WENQp2dtmP4xNi6qFGlQQ.jpg",
               "id": 158020,
               "order": 26
            },
            {
               "cast_id": 30,
               "character": "Matthew Lewis",
               "gender": 2,
               "credit_id": "532b693ac3a3684bce00016b",
               "name": "Chris Isaak",
               "profile_path": "/7NdLnxpXoUhQRQOkAbXfpqCIYdr.jpg",
               "id": 6591,
               "order": 27
            },
            {
               "cast_id": 31,
               "character": "Singing Contestant",
               "gender": 0,
               "credit_id": "532b6962c3a3684bc6000143",
               "name": "Jill Sobule",
               "profile_path": null,
               "id": 150202,
               "order": 28
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe497cc3a36847f819c9d7",
               "name": "Allison Anders",
               "profile_path": "/rsfxpcNEdmNqZyNcct0J695LhBK.jpg",
               "id": 3110,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "532b6a1bc3a3684bb8000167",
               "name": "Allison Anders",
               "profile_path": "/rsfxpcNEdmNqZyNcct0J695LhBK.jpg",
               "id": 3110,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5998a0f6c3a3680ce1016cfd",
               "name": "Sara Andrews",
               "profile_path": null,
               "id": 9042,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5998a1009251412601015928",
               "name": "Susan L. Bertram",
               "profile_path": null,
               "id": 62277,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5998a00192514126010157e1",
               "name": "Jean-Yves Escoffier",
               "profile_path": null,
               "id": 6626,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5998a024c3a36821c80150f3",
               "name": "Thelma Schoonmaker",
               "profile_path": "/mGhfN5gVg9U3iitLcCM3l4Bix4o.jpg",
               "id": 3661,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5998a03492514125b5015c5e",
               "name": "Harvey Rosenstock",
               "profile_path": null,
               "id": 57642,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5998a03c92514125c2015835",
               "name": "James Y. Kwei",
               "profile_path": null,
               "id": 11474,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5998a043c3a36821c8015120",
               "name": "Russell Gray",
               "profile_path": null,
               "id": 3118,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5998a0e8c3a3682b81015c2e",
               "name": "François Séguin",
               "profile_path": null,
               "id": 38523,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5998a0ef925141418e00c55d",
               "name": "Mayne Berke",
               "profile_path": null,
               "id": 11423,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.836979,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 58985,
      "vote_count": 19,
      "budget": 0,
      "overview": "An aspiring singer, Denise Waverly/Edna Buxton, sacrifices her own singing career to write hit songs that launch the careers of other singers. The film follows her life from her first break, through the pain of rejection from the recording industry and a bad marriage, to her final triumph in realizing her dream to record her own hit album.",
      "similar": [
         258480,
         27586,
         31900,
         10735,
         858,
         112160,
         254470,
         141,
         634,
         401898,
         437557,
         244772,
         242224,
         370663,
         43923,
         340485,
         250124,
         297762,
         376660,
         129139
      ],
      "original_title": "Grace of My Heart",
      "runtime": 116,
      "poster_path": "/uxHVD9NKZPA1PqGhr7XJDVhY8Yi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cappa Productions",
            "id": 691,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": "/nlG4JEjJ7SAFDehgIVvHFBPW23y.png",
            "name": "Gramercy Pictures",
            "id": 37,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-09-13",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "For years her songs brought fame to other people. Then she found her own voice.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Allison Anders"],
      "runtime": 116,
      "synopsis": "Set in the early 1960s, Edna Buxton (Illeana Douglas) is a steel heiress from Chestnut Hill, Philadelphia, who wants to be a singer and enters a local talent contest. She plans to sing \"You'll Never Walk Alone,\" until, backstage, she meets a blues singer named Doris Shelley (Jennifer Leigh Warren) who is belting out \"The Blues Ain't Nothin' (But a Woman Cryin' for her Man).\" Doris advises Edna to follow her heart, so Edna sings \"Hey There\" instead and wins the contest. She uses some of her own money to record a demo of her first original song, \"In Another World\". Record producer Joel Milner (John Turturro) likes the demo but says he cannot market a girl singer-songwriter. He becomes her agent, renames her \"Denise Waverly\" and invents a blue-collar persona for her. Milner also reworks her song for a male doo-wop group, the Stylettes, and the song becomes a hit. Denise (formerly Edna) moves to New York and becomes a professional songwriter in the Brill Building. She worries that she will not be able to pen a follow-up to \"In Another World,\" but Milner encourages her to look at the world around her. She meets fellow songwriter Howard Caszatt (Eric Stoltz), and after a difficult first encounter she becomes professionally and romantically involved with him. She also meets once again with Doris, who is now an unsuccessful young singer, and persuades Milner to let Doris and her group audition. Milner likes the group and the song Denise has written, and he renames them the Luminaries. The group is a success, and disc jockey John Murray (Bruce Davison) credits Denise with \"sparking the craze for girl groups.\" Denise and Howard write a song about the condition of working class black girls in New York City. Denise then suggests that she and Howard should write a wedding-themed song for the Luminaries. Howard refuses, but when Denise reveals that she is pregnant with Howard's child - and is herself an heiress - they get married and have a daughter. However, Howard starts flirting with Cheryl Steed (Patsy Kensit), a newly hired English songwriter. In 1965, Joel asks Cheryl and her husband Matthew (Chris Isaak) to write a song for the Luminaries. The result becomes a hit. Howard, annoyed, concedes that Denise's instincts were right. Then Joel asks Denise and Cheryl to collaborate on writing a song for closeted lesbian ingenue singer Kelly Porter (Bridget Fonda). Denise agrees, even though she dislikes Cheryl, but when she arrives home unexpectedly and finds Howard in bed with another woman, she takes her child in a cab to the studio and tells Cheryl what has happened. Cheryl comforts Denise and the two become friends. She learns that she is pregnant with Howard's second baby; Cheryl convinces her to go to an obstetrician, who safely performs an illegal abortion. Over the next few years, Denise throws herself into her work and becomes a highly successful songwriter. Having broken up with Howard, she has a brief but unhappy affair with the married John Murray, which ends when he moves with his family to Chicago. With the British Invasion, the Brill Building songwriting machine has become obsolete. Milner tells Denise she should not be so sad, because she forced him to take chances he would have never had the courage to tackle alone. He finally allows her to become a singer, and introduces her to Jay Phillips (Matt Dillon), the singer, songwriter and producer of a popular surf-rock group. Denise initially hates Jay's music, but agrees to let him produce her. She writes and sings \"God Give Me Strength,\" and she is delighted when he gives the song a skilful orchestral arrangement. However, the record bombs, and Denise blames herself for making the song too personal. Denise and Jay become a couple and re-settle in California at the height of the hippie movement. Cheryl is songwriting in Los Angeles. She and Denise collaborate on songs for a Bubblegum pop TV show called Where the Action Is. Jay is affectionate but also childlike, reclusive and a heavy drug user, and becomes increasingly paranoid. He disapproves of Denise writing songs for the TV show, insisting that it's beneath her. His band mates distance themselves from him, leaving him to work alone in his studio. In a fit of paranoia, he accuses Denise of stealing tapes from him, but when it turns out that he threw the tapes over the studio balcony in a fit of irritation and then forgot that he had done so, Denise is distressed. He also takes his and her children to the museum and forgets to bring them home. While Denise is at a club with Doris, Jay, directionless and in despair at his inability to be more responsible, wanders into the ocean and drowns. Numbed by Jay's death, Denise retires with her family to a hippie commune in the mountains above Palm Springs and adopts yet another father-figure in the commune's guru. Joel Milner visits Denise in the commune and takes her and her children out to dinner. That night, he confronts her with her constant reliance on men for guidance and her failure to take responsibility for her own talent. Denise's suppressed anger spills out, and she screams at Milner that he is a \"fucking leech\" who exploited her. He agrees with her, and the more he agrees with her the angrier she becomes, until he deliberately provokes her by throwing his drink into her face. She strikes him and then collapses in tears, grieving for Jay. Milner consoles her and the two are reconciled. In the closing sequence (set in 1973), Denise is seen confidently recording and producing her first solo album 'Grace of My Heart' with her extended family and friends in attendance.",
      "writers": ["Allison Anders"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116442/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMzMxNzM2NF5BMl5BanBnXkFtZTYwMTY3NzU5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Illeana Douglas, John Turturro, Sissy Boyd | See full cast and crew »"],
      "reviews": [
         "\"Grace Of My Heart\" is similar to \"Valley Of The Dolls\" because the characters, in both films, are \"loosely based\" on actual people showing their rise & fall in show business. Illeana Douglas plays singer/songwriter Edna Buxton who becomes Denise Waverly. She's based on Carol Klein who became Carole King. A New Yorker who churned out hit after hit in the famous Brill Building. Where some of the action in \"Grace Of My Heart\" also takes place. John Turturro is based on record producer Phil Spector (complete with bad toupee & the wearing of sunglasses indoors). Matt Dillon fronts \"The Riptides\" (The Beach Boys). \"The Luminaires\" are based on girl groups like The Shirelles & The Chiffons. Bridget Fonda portrays \"teenaged\" angst-ridden, big-haired, bubblegum idol & lesbian Kelly Porter. There's no question that she's based on Lesley Gore. Interestingly, Lesley Gore wrote the tune Bridget lip synch's in the film, \"My Secret Love\" (which is a homage to Lesley's \"You Don't Own Me\"). The music in this movie is very good & has that 60's, 70's feel to it. I just wish the soundtrack album had included the tunes \"Hey There\" & \"Grace Of My Heart\" by Kristen Vigard who did the vocals for Illeana Douglas. If you like nostalgic movies about pop music like \"The Idolmaker\", \"Grease\", \"That Thing You Do\" & \"Hairspray\" you'll like this too.",
         "First of all, this was NOT a \"Carole King biopic.\" The character is called Denise Waverly, NOT Carole King. The character was loosely based on Carole King, just as other characters were LOOSELY based on people from the era. Secondly, phony soundtrack? Ummmmmm . . .ok, wanna check out the composers on the soundtrack?? Finally, calling Ileanna Douglas a \"dog\" or \"ugly\" was perhaps the stupidest comment I have EVER seen on IMDB, and believe me, I've seen many stupid comments. Not only is she beautiful, she is also a wonderful actress who does an amazing job in this film. AND even if she was \"ugly\" (not my words), why should that hinder your enjoyment of the film? Give me a break. If you don't like a film, at least do us all the favor of giving good reasons and at least ATTEMPT to make intelligent comments rather than the half-baked crap we see here. This film was excellent. The soundtrack was amazing, the actors were even more amazing. 10/10",
         "I was reminded of how really good this movie is today when I saw it on T.V. (with commercials ugh) I've seen it a few times before and every time I watch it, I bawl like a baby and I'm a guy. A really tough guy. But this movie goes straight to my heart and puts a squeeze on it through the wonderful music, the sweet nostalgia and what a cast! Illeana Douglas is beautiful and she really plays her character with great talent. She's supported by a strong cast and how can you go wrong with Turturro playing Phil Specter? The first time I saw this there was something familiar about the music; the songs, like \"God give me Strength\". As much as I like Elvis Costello, that scene of Illeana performing it for Matt (Brian Wilson) Dillon was such a unique delivery of a pure and powerful vocal. I later found that the 'familiarity' is Burt Bacharach and the 'voice' is Kristin Vigard: Wow! Back in those days there was such an explosion of music and creativity and Burt Bacharach was truly a pop force. I loved the Brill Building scenes, especially when they were working on the songs. I thought the movie lost something when it moved west to California but was deeply moved by Douglas and Turturro 'having it out' at the empty poolside. The final song with the flashbacks and her crowning achievement of recording that \"one great album\" had me weeping again. I really like this movie so I ordered the DVD online.",
         "I rented this movie a couple years ago because I like Illeana Douglas. I ended up buying 20 copies of it to give to friends as gifts for Christmas that year. The story is compelling, the cast is amazing...I can't believe more people don't know about this movie. The original music is great, too. The film moves seamlessly from the fifties through the seventies due in part to the talent of the actors, but also due to the impressive costume and makeup work and the wonderful original music written for each period. Y'know how people often say of good movies, \"You'll laugh/You'll cry\"? Well this is one of those.",
         "Illeana Douglas portrays songwriter Densie Waverly in a film loosely based on Carole King. It is more like a sneak peek into the lives of the 60's pop composers at the famous Brill Building(Neil Diamond, Jeff Barry, Ellie Greenwich). Most of the characters are based on real life rock and rollers. John Turturro plays a Phil Specter like producer named Joel, who discovers Denise. Matt Dillon does a pretty decent portrayal of a producer, not unlike Beach Boy Brian Wilson. Some parts are a bit too dramatic, but the songs in the movie--composed by the Brill writers make up for it. The highlight is Douglas's lip sync(sung by Kristen Vigard), written by Burt Bacharach and Elvis Costello. Good rock and roll movie. If you like this try: *La Bamba *That Thing You Do *The Rose",
         "Grace Of My Heart is a great rock-n-roll movie. It is also a very good character based drama. The cast is very good with Illeana Douglas and John Turturro turning in great performances. The director, Allison Anders, has made a very tight and well constructed story. The music is great and I also enjoyed Matt Dillon's performance as a paranoid musical genius. This is a very good movie.",
         "\"Grace Of My Heart\" is an excellent movie with many plot twists and a great storyline! Kudos to Allison Anders for another FANTASTIC story!! I have not seen anything from this multi-talented writer that I have been disappointed in yet! She always provides a unique point of view in her stories and deals with valid issues. A Great triumph! AWESOME music as well! An absolute 10 in my book! I would suggest this movie VERY highly! Congrats to Allison! Keep on writing!",
         "The chronically under-appreciated Illeana Douglas gives a characteristically glowing, winsome, totally spot-on performance as aspiring singer/songwriter Denise Waverly, who during a very turbulent and wildly eventful fifteen year time span goes from being a frustrated, creatively stifled behind-the-scenes magic maker to eventually acquiring the clout and courage to branch out on her own to sing her own material in a strong, assertive, independent female voice. Learning under the expert tutelage of cranky, eccentric, misanthropic Brill Building impresario Joel Millner (a fabulously freaky John Turturro) and enduring a steady succession of unsuccessful romantic relationships with footloose, insecure, insensitive bohemian songwriter Howard Castatt (a perfectly jerky Eric Stoltz), conventional married disc jockey John Murray (a typically fine Bruce Davison), and brilliantly innovative, but paranoid and temperamental surf-rock composer Jay Phillips (a splendidly spaced-out Matt Dillon), the extremely intelligent and resilient Denise uses her bittersweet life experiences as prime fodder for her ever evolving and emotionally charged songs. Flavorfully documenting rock music's growth from effervescent girl group pop to trippy psychedelic experimentation to intensely personal singer/songwriter confessional tunes, Allison Anders' simply sensational feature, loosely based on the real-life exploits of Carole King (besides the obviously King-influenced Denise, most of the other characters are clearly composites of various actual rock people as well) and executive produced by Martin Scorsesse, crackles with all the joyous vibrancy and infectious exuberance of the marvelously dynamic and exciting music scene its set in. Anders' deft, assured direction and sharply perceptive script, both keenly tuned in to the mercurial zeitgeist of the 60's and the then burgeoning women's right movement, works as both invigorating rock music history and inspirational pro-feminist tract alike. The splendidly catchy and melodious Larry Klein-produced soundtrack, Jean Yves Escoffier's smooth, agile, gliding cinematography, a story which manages to be genuinely touching without ever lapsing into mawkishly contrived sentiment, an absorbing, minutely detailed backstage glimpse at the pop music songwriting and recording process, and the uniformly superlative acting -- Patsy Kensit as Denise's longtime songwriting partner and loyal gal pal Cheryl Steed, Bridget Fonda as awkward closeted lesbian pop singer Kelly Porter, and David Clennon as a flaky hippie shrink are especially terrific -- round out this positively radiant and utterly delightful gem.",
         "As a former singer with a female group from the 70's, called \"SOFTOUCH\", I could really appreciate the movie, \"Grace of My Heart\". I thought the movie was very authentic in its presentation of the artists' struggles with becoming a \"singer\" in his or her own right, as well as a writer. It was not a popular position to be in in the 50's and 60's. I love Ms. Douglas. I thought she did an exceptional job with the material and the singing. John Tuturro was great as the manager and provided great comedic relief. Since his performance, I have gone out of my way to see everything he has performed in. He is an awesome actor! Most importantly, I enjoyed the music of Burt Bacharach. There is none other to compare. His songs are historic! My only concerns are these: 1) I would have appreciated the female vocalist, Kristin Vigard recording the hit \"God Give Me Strength\". I thought her voice was much more haunting and convincing. 2) Where can I purchase the Song Book for the sound track? I am now a teacher of middle school students in the arts program, and there are several clips from the movie that I have been able to show my students - and they love this movie! I cannot show the entire movie for the obvious sexual content however, they get a kick out of the music, storyline and the progress of the time including the wardrobe changes.",
         "Just a reminder, folks, that not all movies are supposed to be, nor do they attempt to be, Oscar-contenders. Some films are merely entertaining. I enjoyed this film for exactly that reason -- ENTERTAINMENT. If a movie makes you laugh or cry, it has accomplished its mission. Great soundtrack too, by the way (which I bought). Oh, and a little note to those of you who are trying (in vain) to be the next Gene Shalit or Roger Ebert: Some of your \"reviews\" are exasperatingly immature, e.g., \"she's ugly.\" Illeana Douglas is an excellent actress with a unique beauty. I'm guessing the \"she's ugly\" comments come from a big fan of Baywatch and Pamela Anderson? Since when do a person's physical looks have anything to do with their ability to act?"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Cappa Production",
         "Gramercy Pictures (I)",
         "Universal Pictures"
      ],
      "summaries": ["An aspiring singer, Denise Waverly/Edna Buxton, sacrifices her own singing career to write hit songs that launch the careers of other singers. The film follows her life from her first break, through the pain of rejection from the recording industry and a bad marriage, to her final triumph."],
      "budget": 5000000
   },
   "movielensId": 988,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-13",
      "dvdReleaseDate": "1999-08-17",
      "directors": ["Allison Anders"],
      "runtime": 116,
      "movieId": 988,
      "title": "Grace of My Heart",
      "mpaa": "R",
      "actors": [
         "Illeana Douglas",
         "John Turturro",
         "Eric Stoltz",
         "Matt Dillon",
         "Bridget Fonda",
         "Christina Pickles",
         "Jennifer Leigh Warren",
         "Richard Schiff",
         "Tracy Vilar",
         "Bruce Davison",
         "Patsy Kensit",
         "Lucinda Jenney",
         "J. Mascis",
         "Shawn Colvin",
         "Chris Isaak",
         "Jill Sobule"
      ],
      "imdbMovieId": "0116442",
      "originalTitle": "Grace of My Heart",
      "genres": [
         "Drama",
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": ["UvN3iJxZuF0"],
      "plotSummary": "An aspiring singer, Denise Waverly/Edna Buxton, sacrifices her own singing career to write hit songs that launch the careers of other singers. The film follows her life from her first break, through the pain of rejection from the recording industry and a bad marriage, to her final triumph in realizing her dream to record her own hit album.",
      "tmdbMovieId": 58985,
      "avgRating": 3.34025,
      "releaseYear": "1996",
      "numRatings": 554,
      "posterPath": "/uxHVD9NKZPA1PqGhr7XJDVhY8Yi.jpg"
   }
}