{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fantasy",
            "id": 2486
         },
         {
            "name": "surprise",
            "id": 4902
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "rich",
            "id": 34143
         },
         {
            "name": "stranger",
            "id": 156104
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0117473",
      "video": false,
      "title": "The Rich Man's Wife",
      "recommendations": [
         45069,
         16053,
         26738,
         21033,
         59930,
         45622,
         68430,
         44941,
         41185,
         58434,
         13816
      ],
      "backdrop_path": "/xeupvE9Oc73ApHCKaQ6ZtdHvuZ.jpg",
      "revenue": 8538318,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jake Golden",
               "gender": 2,
               "credit_id": "52fe468ac3a36847f8104893",
               "name": "Clive Owen",
               "profile_path": "/jm2as6tLcvHCYQvmMYM4VK6JEnr.jpg",
               "id": 2296,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Josie Potenza",
               "gender": 1,
               "credit_id": "52fe468ac3a36847f8104897",
               "name": "Halle Berry",
               "profile_path": "/w7HRZh4UhimZO2F6GywkYhjgAX3.jpg",
               "id": 4587,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cole Wilson",
               "gender": 2,
               "credit_id": "52fe468ac3a36847f810489b",
               "name": "Peter Greene",
               "profile_path": "/zCHUxWj7BZ3Uzmkbq9FPpOicniQ.jpg",
               "id": 11803,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Detective Ron Lewis",
               "gender": 2,
               "credit_id": "52fe468ac3a36847f810489f",
               "name": "Frankie Faison",
               "profile_path": "/3717JOXK2Z8qelfyvScDGimfFBf.jpg",
               "id": 13936,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Detective Dan Fredricks",
               "gender": 2,
               "credit_id": "53fc24b8c3a3687361006083",
               "name": "Charles Hallahan",
               "profile_path": "/bXRE5dfHZZhovEbXgQCXDTw9ZHY.jpg",
               "id": 15414,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bill Adolphe",
               "gender": 2,
               "credit_id": "53fc24cbc3a36873520060f6",
               "name": "Allan Rich",
               "profile_path": "/Asmdc5LrKtjklKyWuEochYe3Rn2.jpg",
               "id": 568531,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Tony Potenza",
               "gender": 2,
               "credit_id": "53fc24f7c3a3687361006086",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Nora Golden",
               "gender": 1,
               "credit_id": "57bc9bc492514167be0005c2",
               "name": "Clea Lewis",
               "profile_path": "/xg0epjCQSeEv6DviXfnYSryPCWn.jpg",
               "id": 1215072,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe468ac3a36847f81048a5",
               "name": "Amy Holden Jones",
               "profile_path": "/qnevPdc8w1ryklGNn4b4bGelOjL.jpg",
               "id": 21371,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe468ac3a36847f81048ab",
               "name": "Amy Holden Jones",
               "profile_path": "/qnevPdc8w1ryklGNn4b4bGelOjL.jpg",
               "id": 21371,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56805afbc3a368607500c4ff",
               "name": "Haskell Wexler",
               "profile_path": "/k3JSEg2tildKuFl6F6T1gLQSwgf.jpg",
               "id": 7067,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.159973,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44465,
      "vote_count": 13,
      "budget": 0,
      "overview": "A rich man's wife finds she has a bad prenuptial agreement with an even worse husband. Over drinks with a stranger, she fantasizes about doing her husband in to void the prenupt. The stranger decides to turn her imagination into reality much to the wife's surprise.",
      "similar": [
         3134,
         133805,
         27292,
         158011,
         12162,
         298312,
         156022,
         281957,
         281,
         948,
         238636,
         445954,
         371608,
         22825,
         276488,
         2142,
         400,
         59940,
         22323,
         521
      ],
      "original_title": "The Rich Man's Wife",
      "runtime": 94,
      "poster_path": "/lXHMHKkCEG9Tksn4KvYGKrTEbIr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-13",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Someone Is Playing A Very Deadly Game...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Amy Holden Jones"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Amy Holden Jones"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117473/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3NjI3MTU4OV5BMl5BanBnXkFtZTYwODgxOTM5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Halle Berry, Christopher McDonald, Peter Greene | See full cast and crew »"],
      "reviews": [
         "It would appear that the writers of this rather muddled movie were in a big rush to get the script in. They borrowed elements of a number of movies, including the two in my summary, patched them together and voila. Instant movie. Don't get me wrong, this movie isn't a total loss. If you just consider the acting, we have two standouts. Peter Greene as one of the vilest villains I've seen in a while, and Clea Lewis as the greedy, vindictive wife of the best friend. Let's not forget Halle Berry. No, let's not. Her acting is always credible, even when she's forced to recite lines like these. And I can assure you she is as adorable in person as she is on screen. I worked with her on a mini-series called \"The Wedding\" some years ago. She was pleasant, professional, cheerful, friendly, and beautiful. Gee, I almost sound like I'm gushing, but I have worked a lot of movies with a lot of actors, and she really did stand out. All in all, I don't think you can lose by spending a little time with this movie, but I have to warn you: There are more plot holes in it than there are pot holes in Jersey City.",
         "I started watching The Rich Man's Wife, even though the title alone would suggest a crappy, soap-ish kind of movie. But I was pleasantly surprised with this murder mystery, although in flashbacks we see that there's not much of a mystery as to who was killing who. What I liked was the way Halley Berry's character's handled herself in such a strong, almost \"Ripley\" like way; not some simpering, whimpering victim. She shoots the \"bad guy\" with a precision that professional marksmen would envy. It's a good movie, right up to the ending, then along comes that final twist-- the one plot twist too many-- that shot the whole movie to hell for me. Had the last five minutes not happened, for it me it would have been almost perfect movie, so I give this movie 5/10.",
         "I watched this movie around 3 o'clock in the morning and I wasnt really impressed. First of all, How can you trust a guy like Peter Greene(Cole Wilson)? This film was predictable in many parts and the lighting was really bad.However,Halle Berry was very pretty in this movie and yes she actually does cry. Just dont make the same mistake I did and stay up til' 3 o'clock in the morning.But what the heck I was bored. To wrap this comment up I give it a 6/10 *",
         "This wasn't a bad film, it was entertaining, made you guess most of the time, and was pretty tense, its only flaw is some stupidity, and the jump scenes in it are predictable. Plus the film itself is predictable, but it is good, and it worth watching. Halle Berry is sensational as The Rich Man's Wife. The ending is especially satisfying, making your jaw drop to the ground. I give it a 7 out of 10. Rated R for strong violence and language.",
         "My problem with this movie is that it tries too hard. It is neither thriller no suspenseful as it intended to be. Can you say predictable?? It tries to take twists and turns but any intelligent viewer has figured them out before the movie actually gets to them. 1. Halle Berry's character says she doesn't need to speak with an attorney. Only an idiot would make a remark like that sitting in jail facing a murder one rap. 2. Plot hole. We see Halle Berry in one scene playing with the gun that would eventually kill her husband. Now if she had nothing to do with it as she claimed, how did Peter Greene's character get the exact same gun? I'm not even a cop and I could have figured that one out. When Berry's Jeep breaks down in the middle of nowhere, there is no other car behind her. Greene just shows up out of the blue. Come on!!? Mainly the conversation between Cole Wilson (Greene) and Jake Golden (Clive Owen) How can Berry's character tell the story for scenes she wasn't even in? We learn that supposedly Golden hired Cole to do a simple hit and not even talk to Josie (Berry), but he became attracted to her. How can she tell how the murder occurred if she was not there or had nothing to do with it? And when Berry discovers Jake's involvement, this is no surprise as we already knew this! Jake's ex-wife had something to do with it obviously because she was always taking up for Josie. This movie just has bad pot holes and flaws. If you're going to do a murder-for-hire \"Don't be seen with the killer in public\" Dumb writing, even dumber acting. And this cast is generally a very talented set of actors, too bad they had to follow this piece of crap of a script.",
         "I would have considered \"The Rich Man's Wife\" a wonderfully acted and competently made, if cliché ridden, \"Women in peril\" chick flick, except for the last five minutes. The ending redeems the movie and makes it a \"must see\" mystery for those who enjoy movies such as \"The Six Sense\" and \"Wild Things\". Peter Greene takes the obnoxious, menacing villain to new levels of creepiness; and Clea Lewis dominates every one of her small scenes. I just wish the movie had used the \"Wild Things\" end credits technique to tie everything together a little better. WARNING: SPOILER For those who complain of pot holes and \"Berry tells the story in the first person, but scenes occur that she couldn't possibly know\" is misguided. Since Berry and Lewis have concocted the entire story to kill their husbands and inherit the estates, of course the story is going to have some disjointed elements. Their dialog is meant to tell the dumb, chauvinistic cops just what they want to hear; or, at least, what they would expect from a couple of women. Most likely, Berry lured Clive Owen's character to the house and shot him. Likewise, she may have actually recruited Peter Greene herself and killed him once he was no longer useful. \"If she paid Cole $30,000, where is the money?\" asks the cops and DA? Obviously, Cole (Peter Greene) never had the $30,000. Berry gave it to Clea Lewis, so Berry and Lewis could live off it until the estates of their late husbands cleared probate. That might also explain how Cole got through security gates and the alarm system, to get into the house and menace Berry on two occasions; not to mention, how Cole got Berry's gun to use to kill Berry's husband. END OF SPOILERS Hopefully, one day, critics and viewers will take a second look at \"The Rich Man's Wife,\" just as they did \"Vertigo.\" I give \"The Rich Man's Wife\" an \"8\"",
         "Beautiful young Halle Berry (as Josie) is married to ultra-rich older PBC-TV network executive Christopher McDonald (as Tony Potenza). Her job is to look beautiful and dress sexy. His job is to review TV pilots and the fall line-up. They love each other, really, but each are having extracurricular sex. She is getting hers from British restaurateur Clive Owen (as Jake Golden). He has various dalliances. Because Ms. Berry loves her husband, really, she is concerned with his drinking problem and preoccupation with work. Berry feels neglected and believes their marriage may be on the rocks... To help repair the marriage, Berry arranges for the couple to spend some time in a small romantic cabin. Alas, her husband drinks too much and falls asleep. They give up on sex and he leaves. She decides to stay and check out local action in a dive bar. Arriving solo and looking to arouse, Berry has a drink and catches the eye of pool-playing Peter Greene (as Cole Wilson). Possibly turned-off by his creepy eye make-up, Berry leaves without a pick-up. Alas, her jeep dies. Stalled on a dark and rainy night, Berry is now a damsel in distress. No problem, as Mr. Greene happens by to drive her home... Berry insists she loves her husband and declines Greene's sexual invitations. They portend rape, but Berry decided to date Greene anyway. They discuss her failing marriage. Berry was an innocent 17-year-old poor girl, swept off her feet. Greene believes Berry is asking him to kill her husband, but she disagrees. That's the set-up. \"The Rich Man's Wife\" begins with Berry's arrest. Then, she tells her story. It doesn't make a lot of sense, but can be followed. However, a final scene strains credulity to the breaking point. Cinematography (by Haskell Wexler) and support (like Clea Lewis) help. ***** The Rich Man's Wife (9/13/96) Amy Holden Jones ~ Halle Berry, Peter Greene, Clive Owen, Clea Lewis",
         "just saw this movie today. Caught my attention due mainly to the supreme creepiness of the actor who played Cole. However, it never ceases to amaze me when continuity directors completely miss the boat when it comes to the number of shots being fired in any given scene. The little pistol in this flick holds a 6 round clip yet time after time they where pumping away like there was an endless supply of bullets. OK, I might have OCD, but I usually count the shots fired in a pick just to see how serious the filmmakers are about making things realistic. Obviously, they were far too consumed with making the villain a first class creep-they did an excellent job but missed the target with the shoot-em-ups",
         "Josie and Tony Potenza are your typical (Hollywood) upper-crust couple. The middle-aged Tony (Christopher McDonald) is somewhat of an apathetic husband and an alcoholic, but is an otherwise loving husband with a thriving career as a film executive. Josie, the wife about half his age, feels neglected by him, but hides her concerns because she still loves her husband (and the money, let's not kid ourselves). Their flawed, but satisfactory life goes awry one night when Josie admits her marital problems to a Cole (Peter Greene), a total stranger who she becomes acquainted with after her car breaks down and he helps her out. Unfortunately for Tony, she also admits to Cole she sometimes wishes Tony was dead. Despite taking the comment back, Cole appears to take Josie's words seriously, and the problems ensue. The cast, especially the supporting actors, bring a rather pedestrian script to life. Halle Berry is not only beautiful, but a competent actress in any role (aside from Catwoman), and in the context of the first 93 of the films 94 minute runtime, she does extraordinary as a woman lost in a situation which is totally out of her control. Christopher McDonald is great as usual, and fits the role of a wealthy, apathetic husband well. Peter Greene and Clive Owen (Josie's boyfriend) both work with what they have, and Clea Lewis (who I never heard of before this film) brings some mild humor. The plot itself is nothing particularly new or original, but it grabs your attention slowly and when it has you hooked, it doesn't let go. While most of the material is recycled from previous (and better) films, it's presented in a manner that's still refreshing, and the characters hold it together. Of the crew, the cinematographer, Haskell Wexler, displays his talents the best. There are many great sweeping shots of the mountains and forests, and the film as a whole has a glossy, well-composed look to it. And there you have it: the good. The film's first 93 minutes is time well spent. The plot is interesting, the acting is above average, and film is well-shot. Unfortunately, the last 60 seconds, yes, sixty seconds, is the film's undoing. I won't spoil the \"surprise,\" but it is a twist ending that will cause you to scratch your head for a few minutes, and then make you wish you hadn't wasted your time. It seems like no thought went into the twist ending, and it was just tacked on because it was a popular thing to do. And with the twist at the end, gaping plot holes are left in the film. Horrible to end to an otherwise good movie. So, please take my advice. It's not such a bad movie, but skip the last 60 seconds or you'll feel cheated out of your time and intelligence.",
         "\"The Rich Man's Wife\" is technically a neo-noir that, for most of its length prior to a twist ending, draws plot elements from \"The Postman Rings Twice\" and \"Strangers on a Train\". Therefore, it plays more like a classic noir. The film seems not to have satisfied a good many movie viewers, judging from its below-par rating and most of the IMDb reviews. I find the movie entertaining, cleverly constructed and well-done in all departments, including acting and cinematography. The use of some familiar plot elements or resemblance to such elements didn't matter too much, because the film had plenty of originality besides. Suspense and realism are good. Halle Berry is shown as a strong and capable woman, but then she's telling the story. The movie is best seen without having read reviews beforehand that revealed too much plot. I had no idea what it was about. The whole story, up to just a few minutes at the end when Berry is released and leaves the police station, is related by Halle Berry to two policeman. It is not a confession but her recounting of events that led to the deaths of 3 men. We see nothing in the past but what she says. However, at the end we do see in real time the questions and reactions of the two cops after she leaves the station. The 3 men now dead are her husband, Christopher McDonald; a stranger to her with a criminal record, Peter Greene; and her lover, Clive Owen. McDonald died in a park of multiple gunshot wounds in an apparently failed carjacking. Greene and Owen died at her residence, both shot. Two guns were involved. Entering her story is also Owen's ex-wife, Clea Lewis. According to her story, Greene killed her husband and was going to frame her and blackmail her. She says that Greene killed Owen who had come to rescue her, and she killed Greene with a second gun. The two policemen, Charles Hallahan and Frankie Faison, don't believe her story. Too much is hard to explain, and she has a motive. Her husband is rich, controls all assets in his name, and she has signed a pre-nuptial agreement that rules out divorce as a means of getting his wealth. But his death will benefit her after a wait for probate. The title is \"The Rich Man's Wife\", and that tells you something right away that's true. Halle Berry, in a very good role and doing a very good job handling it, plays a poor but beautiful black girl who married a rich white executive, after knowing him and he knowing her for one day. It tells you that the story is focused on her, which it is. Almost everything is told by her and involves her, but not all. She recounts some events according to her reconstruction of what happened when others were involved. The title raises questions. What is Halle Berry really like? Is she telling the truth? What's she after? Her husband's wealth? Or is she trying to extricate herself from being charged with several felonies? Or some combination of these? However, once the movie gets going and we enter the flow of events, we are likely to forget that she's telling the story. We are likely to believe her rather than constantly remind ourselves to be skeptical until there is verification that what she says is true. Alternatively, we can, like the detectives, be checking up on the logic of the details to see if the story hangs together and resolves the origins of the three men's deaths. The story functions then as a suspended mystery. Altogether, for a noir fan like me, \"The Rich Man's Wife\" filled the bill and then some. In plot, it's much more like a classic noir than a neo-noir. Director Amy Holden Jones, who also wrote the movie, got a really good performance out of Halle Berry. The supporting cast is believable and quite strong without overdoing it. Haskell Wexler's cinematography is a strong point. What we see on the screen, told through Berry's eyes, seems to have just the right patina or feeling of a remembrance as opposed to something we are seeing in the real-time of events."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Caravan Pictures",
         "Hollywood Pictures"
      ],
      "summaries": [
         "A rich man's wife finds she has a bad prenuptial agreement with an even worse husband. Over drinks with a stranger, she fantasizes about doing her husband in to void the prenupt. The stranger decides to turn her imagination into reality much to the wife's surprise.",
         "A beautiful young womans marriage to a rich older man is on the rocks. When a make-up vacation goes badly, the wife confides to a stranger in a bar that she wishes her husband were dead. A short time later he is killed in an apparent car-jacking, and the wife is the prime suspect. Did she do it? If not, is she responsible?"
      ],
      "budget": 0
   },
   "movielensId": 992,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-13",
      "dvdReleaseDate": "2000-04-11",
      "directors": ["Amy Holden Jones"],
      "runtime": 94,
      "movieId": 992,
      "title": "The Rich Man's Wife",
      "mpaa": "R",
      "actors": [
         "Clive Owen",
         "Halle Berry",
         "Peter Greene",
         "Frankie Faison",
         "Charles Hallahan",
         "Allan Rich",
         "Christopher McDonald",
         "Clea Lewis"
      ],
      "imdbMovieId": "0117473",
      "originalTitle": "The Rich Man's Wife",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["NGCcCuY00OE"],
      "plotSummary": "A rich man's wife finds she has a bad prenuptial agreement with an even worse husband. Over drinks with a stranger, she fantasizes about doing her husband in to void the prenupt. The stranger decides to turn her imagination into reality much to the wife's surprise.",
      "tmdbMovieId": 44465,
      "avgRating": 2.75267,
      "releaseYear": "1996",
      "numRatings": 281,
      "posterPath": "/lXHMHKkCEG9Tksn4KvYGKrTEbIr.jpg"
   }
}