{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new mexico",
            "id": 1508
         },
         {
            "name": "atomic bomb",
            "id": 1815
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "new orleans",
            "id": 2411
         },
         {
            "name": "atomic bomb test",
            "id": 4593
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "tuberculosis",
            "id": 159845
         }
      ],
      "imdb_id": "tt0116635",
      "video": false,
      "title": "Infinity",
      "recommendations": [],
      "backdrop_path": "/zo487YtSWHsvfrKW17It1euc3ph.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Richard Feynman",
               "gender": 2,
               "credit_id": "52fe432ec3a36847f8040913",
               "name": "Matthew Broderick",
               "profile_path": "/j9ETatVKFxYR5Ijk8l5tzKO4HPn.jpg",
               "id": 4756,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Arline Greenbaum",
               "gender": 1,
               "credit_id": "52fe432ec3a36847f8040917",
               "name": "Patricia Arquette",
               "profile_path": "/9Sz0M91CHHkJ5tlPteiXv34gpgK.jpg",
               "id": 4687,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Mel Feynman",
               "gender": 2,
               "credit_id": "52fe432ec3a36847f804091b",
               "name": "Peter Riegert",
               "profile_path": "/yPgaRZBMVy9eoNNuiPIm0wzG9sD.jpg",
               "id": 20899,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Young Richard",
               "gender": 0,
               "credit_id": "52fe432ec3a36847f804091f",
               "name": "Jeffrey Force",
               "profile_path": null,
               "id": 20900,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Harold",
               "gender": 2,
               "credit_id": "52fe432ec3a36847f8040923",
               "name": "David Drew Gallagher",
               "profile_path": null,
               "id": 20901,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Robert",
               "gender": 0,
               "credit_id": "52fe432ec3a36847f8040927",
               "name": "Raffi Di Blasio",
               "profile_path": null,
               "id": 20902,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe432ec3a36847f804092b",
               "name": "Josh Keaton",
               "profile_path": "/a5V2UtUKApe38ZW9OiZbFRAvvTh.jpg",
               "id": 20903,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Abacus Adder",
               "gender": 2,
               "credit_id": "52fe432ec3a36847f804092f",
               "name": "James Hong",
               "profile_path": "/8k4RrDRsqkvJDePU8ciMOOx5Zso.jpg",
               "id": 20904,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Young Joan",
               "gender": 1,
               "credit_id": "52fe432ec3a36847f8040933",
               "name": "Melissa DeLizia",
               "profile_path": null,
               "id": 20905,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Dr. Gell-Mann",
               "gender": 2,
               "credit_id": "52fe432ec3a36847f8040937",
               "name": "Peter Michael Goetz",
               "profile_path": "/a2hLcCidETgwlVyQnYy4kXVKUcn.jpg",
               "id": 20906,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Nurse Kate",
               "gender": 1,
               "credit_id": "56b68e8f925141677c00087a",
               "name": "Kelly Wolf",
               "profile_path": "/oBiqQmt5cRk3QBlUJDj7jk0xBho.jpg",
               "id": 86474,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe432ec3a36847f80408eb",
               "name": "Matthew Broderick",
               "profile_path": "/j9ETatVKFxYR5Ijk8l5tzKO4HPn.jpg",
               "id": 4756,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe432ec3a36847f80408f1",
               "name": "Matthew Broderick",
               "profile_path": "/j9ETatVKFxYR5Ijk8l5tzKO4HPn.jpg",
               "id": 4756,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe432ec3a36847f80408f7",
               "name": "Patricia Broderick",
               "profile_path": null,
               "id": 20896,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432ec3a36847f80408fd",
               "name": "Joel Soisson",
               "profile_path": "/hr2hlrFO9NQVZzHsIaN5mbK32BQ.jpg",
               "id": 18384,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432ec3a36847f8040903",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe432ec3a36847f8040909",
               "name": "Lisa Bankert",
               "profile_path": null,
               "id": 20898,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe432ec3a36847f804090f",
               "name": "Patricia Broderick",
               "profile_path": null,
               "id": 20896,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.684891,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2033,
      "vote_count": 0,
      "budget": 0,
      "overview": "Story of the early life of genius and Nobel Prize-winning physicist Richard Feynman.",
      "similar": [
         637,
         369885,
         5925,
         423,
         424,
         857,
         2253,
         16869,
         14574,
         613,
         228150,
         289222,
         1251,
         12220,
         1771,
         853,
         339259,
         712,
         2018,
         13813
      ],
      "original_title": "Infinity",
      "runtime": 119,
      "poster_path": "/pwADoLVt7sO79V9HtTUKLNSPTEt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Neo Productions",
            "id": 887,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Overseas FilmGroup",
            "id": 888,
            "origin_country": ""
         }
      ],
      "release_date": "1996-10-04",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matthew Broderick"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Richard Feynman",
         "Ralph Leighton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116635/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwNDQzMDI0Nl5BMl5BanBnXkFtZTcwMzc1OTIyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Broderick, Patricia Arquette, Jeffrey Force | See full cast and crew »"],
      "reviews": [
         "This was a very worthy project of the Brodericks, mother and son, and one which I would have liked to have tackled myself, having read and greatly enjoyed both \"Surely You're Joking, Mr. Feynman!\" and \"What Do You Care What Other People Think?\". To concentrate on the deep love story between Feynman and his first wife Arlene, which coincided with his work on the Manhattan Project at Los Alamos, was, I feel, a good filmic move in order to give the story an anchor (not to mention the fact that it truly is one of the most romantic real love stories I've ever heard of). Every movie adaptation has to make sacrifices, and this one obviously had to sacrifice all the other interesting stuff that happened to Feynman in the years after the war. So I don't have a problem with the quality of the script, and they also had a big enough budget to get the period feel. However, this film falls down in a major way on the characterisation of its lead character. Surprisingly, for Broderick is not a bad actor, he just comes across as being Broderick - a good looking young man who can look lovingly at Patricia Arquette and add a bit of passion to his voice when explaining complicated physics. But we've all seen the real Feynman on television and in film - he was LARGER than life! He was intensely charismatic, a brilliant expositor of scientific ideas and a great teacher. It seems to me that instead of succumbing to the temptation of directing, that Broderick should really have got someone else direct, so that he could concentrate on really getting inside the head of Feynman and reproducing on screen some of that charisma - something I'm quite sure Broderick is capable of doing. So ultimately this is a missed opportunity. You learn some of the facts about what happened, but you don't really meet the real Richard P. Feynman. Last point. Not quite sure why they misspelled his wife's name as \"Arline\" in the credits. It is spelt \"Arlene\" in the books.",
         "This was kind of a strange, low-key movie, one that isn't going to get a lot of attention, especially with a younger audience which wants anything but a slow- moving story. But, whatever your age, if you want simply a nice movie, you have one here. Other reviewers here have gone into the details about the real-life persons this film is based on, so I will just make a few general comments I had while watching this. First, I enjoyed Matthew Broderick's narration. Broderick usually plays likable roles and is an underrated actor, I think. I've never seen him in a bad performance. Even though this story is an emotional one, I found little emotion in the film but that makes it intriguing in parts. Sometime past the halfway mark, I asked myself, \"What is the point of this story?\" There is a point, and there is more than what meets the eye to this. Those who have seen this film know what I mean. I'm making vague statements, but I don't want to give away anything. I enjoyed the 1940s look to this, appreciated Patricia Arquette's against-type role; appreciated the fact there were no villains in here and the profanity was low. As I said, it's a nice film and touching drama. Broderick and his mother wrote, produced and directed this film.",
         "A caution: this review reveals details of the movie. The movie \"Infinity\", stars Matthew Broderick who portrays the Nobel-prize-winning physicist Richard Feynman. Broderick also co-produced and directed the movie. Keeping it in the family, the screenplay was written by Matthew's mother, Patricia Broderick. The other major role, that of Feynman's first wife Arline Greenbaum, was played by Patricia Arquette. Infinity is not a documentary about a phase in the life of Feynman the scientist, my expectation. My first impression as the movie unfolded was disappointment. I have been intrigued by Feynman the physicist and scientist since I purchased his Quantum Mechanics lectures trilogy in 1968. As the movie progressed, I saw that it isn't a movie about science; it is a movie about the heart. The point of this movie is to portray Feynman the person, and his relationship to the love of his life, Arline Greenbaum; in this it succeeds wonderfully. A few years back, while reading one of Feynman's books, I ran across a passage which made a big impression. Feynman wrote that his children, who were raised in private schools and visited home only during holidays, were known well enough to him that if he were to meet one on the street, he would probably recognize that person as his child. That statement helped convince me to move from academia to the business world, making becoming a better father and husband my top priority. After seeing this movie, I better understand Feynman the person. The tragic loss of his first wife probably produced a life-long desire to hold personal relationships at a distance, and to make research and teaching his top priorities. Broderick does an impressive job of directing the film. Just one example: at the moment of the death of his wife, my expectation was for there to be intrusive weepy violins. Instead, the moment moved through silence, making a more powerful statement. That scene reminded me of George Burns pulling down his shoe box of old photos from the top shelf of his closet, and looking at them quietly in \"Going in Style\", a scene which packed an emotional punch without resorting to violins. There is another dimension to the two Brodericks' intelligence which surprised me: they did not botch the physics, what little there was. Nearly every Hollywood movie which has an opportunity to do so, gets the science wrong... having space ships produce impressive sounds as they move through the vacuum of space, for example. Matthew Braderick as Feynman explains beta decay to his wife using olives from his lunch in an approach worthy of the real Feynman. Also, Feyman's father explanation of inertia, in which he differentiated between being able to name it and describe it, which he could do, and understanding the \"why\" of it, which no one could do, was a \"deep\" understanding of science which Broderick portrayed with sympathy and understanding. By staying away from complex mathematics and the physics that could have been incorporated into this story, to the delight of the geeks of the world, Broderick created a movie that is accessible to all. \"Infinity\" is a gem of a small movie, a love story, a true story, told with gentleness and feeling; a movie which does not overreach itself. I strongly recommend it.",
         "There is very little more that I can add to the kudos for this film, other than utter praise. I can understand and I know. You see, I am one of these people, a Scientist. We as a breed are seldom understood and, more often than not, badly served by cinema image. This film of the quiet, patient, dedicated love between two people, one of whom is a Scientist, is a milestone. Might I add that I have always felt that Matthew Broderick is a fantastic actor, especially in roles that require an average looking, quiet introspective character. He is perfect for this cinematic vehicle, and equal to the talents of a Tom Hanks any day. I was also impressed that he produced, directed and shared writing credits on this film project.",
         "I read the book, \"What Do You Care What Other People Think\" and did some research. From there I learned to respect the man. \"Infinity\" is a wonderful movie. It shows a real love story between two people. Feynman's desire to marry Arlene, even though she was ill, shows dedication to principles that are wanting in our society. This wasn't an easy thing. Then there is the personal story of his work on the Manhattan Project. He was a practical physicist, who brought the science down to \"our\" level. Who can forget his demonstration of the \"O-Ring\" failure from the Shuttle Challenger. This approach changed my perception of the science and I learned to love physics. So, yes, I recommend this movie. Laura",
         "For fans of Feynman's books, this will be a disappointment. Matthew Broderick's performance doesn't capture the fire, playfulness and wonder of Feynman's personality (as do documentaries of his lectures). Furthermore, his direction botches many of the anecdotes, missing the points of emphasis and undermining the quirky humour and sense of irony in the original telling. For example, in the Chinese abacus scene (which is shifted to a much earlier period in Feynman's life), Broderick has Feynman initiate the challenge, whereas in real life, it was the hapless abacus salesman who challenged him, completely unaware that he was taking on a renowned physicist. Therefore, the sense of irony, and of Feinman's idiosyncrasy in the world of mere mortals, is lost. Only Patricia Arquette seems to have captured the essence of the memoirs, despite her often unintelligible dialogue.",
         "Take a real-life pair of lovers. Stay true to the specifics of their lives. Don't over-emphasize high points and low points for unrealistic dramatic effect. Let the story tell itself. In the mid-1930's, a brilliant young scientist fell in love with a girl from his neighborhood and began a relationship with her that lasted until her untimely death. They went on dates, he told her about his work, she opened up his mind to the arts, and they made love whenever and wherever possible. Here's another clue to filming a love affair: don't show the couple in the act of love accompanied by the pop hits of the day. Show us the prelude and the afterglow and save the gymnastics for the screenwriters with little imagination. Matthew Broderick shines as both star and director of this small film, and Patricia Arquette gave her best performance to date as his no-nonsense leading lady. The physics are a bit over my head but the romance is real and beautiful to watch.",
         "I'm at odds with this film. I first launched myself into physics because of the books that feynman wrote (well, spoke) and i received the full set of the feynman lectures before i started college. Matthew Broderick has always been one of my favorite actors. I liked his nerdiness and i could relate. So he was one of my reasons for deciding to branch off from physics and start a film career. In the end, though, i see why i always have a little regret for not sticking with physics. Film could never fully realize what it means to be in love with science. I understand that Feynman loved his wife, but he loved everything, that's what made her so important, he could never tire of learning to look. just like her. But this film really doesn't get that across. Plus, instead of relying on smart direction and good editing they give the game away in the opening titles, which are ridiculously lame. **SPOILER** (please it's a real story go read the book) The intercut to the parallel line of the Trinity test explosion is a neat idea, but ultimately poorly executed and timed. But i see where they were going. But they missed it. Because the explosion for feynman is when he sees the dress, not when she dies. remember that great advice, you can call it whatever you want in a thousand languages but that doesn't mean you know it. When feynman sees the dress, he *knows* what it means for arlene to die. He can't share with her anymore, that is what her death *is*. and that should have been the point. you've got to learn what a thing is before you can tell someone else. Feynman was a great man, but he had his flaws. However, the number of people he has influenced is incredible. And i'm glad that somebody made a film about him. However, Feynman's clipped style of speech, what made him so unique and distinct, is not available to the viewer and it cheapens it. I'm sorry to say that i did not like this film. In fact, it made me a little angry to watch it and see my hero stripped of his unique story.",
         "Infinity is not a masterpiece nor even great cinema (but do we hold it on account of that?), but it does have something that I really loved about it. I adore Richard Feynman, he being my favourite scientist and one of my two heroes (the other being Itzhak Perlman) to really try to aspire to be everything I can be. I think everyone should read his books (even his Physics lectures, even if you hate Physics. He makes everything worthwhile). Onto the film... The film starts out with the sweet, gentle relationship between father and son, taking direct quotes from Feynman's own novels (he actually didn't write them; they are accounted stories) Surely You're Joking Mr. Feynman! and What Do YOU Care What Other People Think? and letters and such. It progresses through Richard's days in high school, to meeting Arline (that is the correct spelling) onto MIT and Princeton (pre Los Alamos). During this, my biggest complaint would be that the film moved way too fast. There were some lines (\"Look I'm gorgeous\") that were just beginning to show Feynman's character and his way with humour, but it plowed right through them onto the next scene. I think Broderick was so intent on keeping everything to the book, he forgot some very vital elements of what made \"Richard Feynman\" Richard Feynman. What really grasped Feynman's character was when the film steered into the direction of Feynman's days at Los Alamos (working on \"the bomb\") and Arline was at the sanatorium. The film showed just how much fun Arline had with Feynman and vice versa (I loved that the film included Feynman's birthday present from Arline!). It also showed the tenderness, yet sometimes almost \"absent\" love of Feynman. In Perfectly Reasonable Deviations from the Beaten Tack: the letters of Richard Feynman, he writes a letter to Arline before she dies telling her how he wished he would have been there for her more, loved her more, etc. I think the film really captures that, even before the book was published, Broderick had a sense of what Feynman was going through. He didn't really know how to handle his wife dying. Lastly, I loved how they implement Feynman's love of \"drumming\". It really didn't become an obsession until much later (when he went to Brazil after Arline's death), but the film shows the beginnings of a love that Feynman would love until his death (a number of his friends joked that he was going to spend his Nobel earnings on a new bongo drum). There were flashes of the Feynman people know and love, but it didn't really hold true at the beginning. One thing that seemed confusing was a brief snipet involving Broderick as Feynman hearing about a \"baby\". This is most likely in reference to a pregnancy scare that took place when Arline was in the sanatorium. They thought they'd have to abort the baby, but it turned out she was pregnant and that she was just malnourished because of her illness. They didn't explain that very well though. Next they need to make a film about his marriage to Gweneth and his later years winning the Nobel and working on the Challenger. Even though I don't act, I could play Gweneth! hahaha, yeah right.",
         "This movie is long and not very well made, but not offensively bad. Why is it when actors direct they love to have long long takes and scenes that don't go anywhere? The story of this man needs to be told, but in a bold and interesting way. This movie did it in a meek and 'decent' way, and it's a real shame. Patricia Arquette obviously wants to bring it some verve, and you kind of feel for her. Matthew Broderick has a lot on his plate, and perhaps should have turned over the directing to someone else. Someone who would've made a few cuts. I give it a 3 on a scale of 10."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "First Look International",
         "Neo Productions",
         "Overseas FilmGroup"
      ],
      "summaries": [
         "As a young boy, Richard was fascinated with science and objects in motion. This wonderment was reinforced through the efforts of his father. The only thing that mattered as much as science, and his family, was Arline, whom he met when they were both in school. But fate can often be cruel and Arline is found to be stricken by Tuberculosis. Undaunted, Richard studies the disease as he studies science in hopes of curing her. When her disease is in remission, they marry and he proceeds on to college where his studies and the war lead him to Los Alamos to work on the Manhattan Project. While Richard is intrigued with the solution to the project, he is also concerned with the outcome and saddened with the failing health of Arline.",
         "Story of the early life of genius and Nobel Prize-winning physicist Richard Feynman."
      ],
      "budget": 0
   },
   "movielensId": 993,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-04",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Matthew Broderick"],
      "runtime": 119,
      "movieId": 993,
      "title": "Infinity",
      "mpaa": "PG",
      "actors": [
         "Matthew Broderick",
         "Patricia Arquette",
         "Peter Riegert",
         "Jeffrey Force",
         "David Drew Gallagher",
         "Raffi Di Blasio",
         "Josh Keaton",
         "James Hong",
         "Melissa DeLizia",
         "Peter Michael Goetz",
         "Kelly Wolf"
      ],
      "imdbMovieId": "0116635",
      "originalTitle": "Infinity",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["U0tE1GkugR0"],
      "plotSummary": "Story of the early life of genius and Nobel Prize-winning physicist Richard Feynman.",
      "tmdbMovieId": 2033,
      "avgRating": 3.50784,
      "releaseYear": "1996",
      "numRatings": 255,
      "posterPath": "/pwADoLVt7sO79V9HtTUKLNSPTEt.jpg"
   }
}