{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new jersey",
            "id": 586
         },
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "restaurant",
            "id": 1946
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "food",
            "id": 10637
         },
         {
            "name": "car salesman",
            "id": 10729
         },
         {
            "name": "italian restaurant",
            "id": 14836
         },
         {
            "name": "feast",
            "id": 34068
         },
         {
            "name": "1950s",
            "id": 208611
         }
      ],
      "imdb_id": "tt0115678",
      "video": false,
      "title": "Big Night",
      "recommendations": [
         38772,
         66600,
         45225,
         35976,
         10608,
         19317,
         14320,
         10631,
         42176,
         42719,
         41253,
         31944,
         207257,
         43232,
         50812,
         16814,
         43321,
         42257,
         68201,
         38914
      ],
      "backdrop_path": "/6a4v3LxvjcamEhW9SuKzavEBVxg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Secondo",
               "gender": 2,
               "credit_id": "52fe47689251416c7509834f",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Primo",
               "gender": 2,
               "credit_id": "52fe47689251416c75098353",
               "name": "Tony Shalhoub",
               "profile_path": "/jXzlVxS8u64XEZUoNPiuhGcQXDW.jpg",
               "id": 4252,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cristiano",
               "gender": 2,
               "credit_id": "52fe47689251416c75098357",
               "name": "Marc Anthony",
               "profile_path": "/b6E5BCQkOXlxT1E4nHRyOpehuYU.jpg",
               "id": 47775,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Phyllis",
               "gender": 1,
               "credit_id": "52fe47689251416c7509835b",
               "name": "Minnie Driver",
               "profile_path": "/iWqTeFmdoY8V8RLcH89K75AKeQN.jpg",
               "id": 6613,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Gabriella",
               "gender": 1,
               "credit_id": "52fe47689251416c7509836b",
               "name": "Isabella Rossellini",
               "profile_path": "/yKnom6aUaP17Z49mypVZmq1jdjH.jpg",
               "id": 6588,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Leo",
               "gender": 2,
               "credit_id": "52fe47689251416c7509836f",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Pascal",
               "gender": 2,
               "credit_id": "52fe47689251416c75098373",
               "name": "Ian Holm",
               "profile_path": "/27SAk1v043GdOeAxT5pPoMUYhGg.jpg",
               "id": 65,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Ann",
               "gender": 1,
               "credit_id": "52fe47689251416c75098377",
               "name": "Allison Janney",
               "profile_path": "/cDcB8mKP1GiIeoM3Qe7GIucs0iv.jpg",
               "id": 19,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Natalie",
               "gender": 0,
               "credit_id": "52fe47689251416c7509837b",
               "name": "Dina Spybey-Waters",
               "profile_path": "/rA6gMWarWOpxUCFsfYFz4Gcok7o.jpg",
               "id": 56567,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Woman in Restaurant",
               "gender": 1,
               "credit_id": "590101ffc3a3681101001a29",
               "name": "Caroline Aaron",
               "profile_path": "/9v9h9bR4CX6MrpZFgEktTHFIlgT.jpg",
               "id": 1910,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47689251416c75098361",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47689251416c75098367",
               "name": "Campbell Scott",
               "profile_path": "/LpYIN2jh58sHaUFM2r3G4G0iE6.jpg",
               "id": 55152,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54525d9bc3a3681159001ec5",
               "name": "Joseph Tropiano",
               "profile_path": null,
               "id": 1379604,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54525da50e0a263a04006fef",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.909008,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18203,
      "vote_count": 59,
      "budget": 0,
      "overview": "Primo &amp; Secondo, two immigrant brothers, pin their hopes on a banquet honoring Louis Prima to save their struggling restaurant.",
      "similar": [
         2142,
         101,
         295964,
         2062,
         181283,
         212778,
         298312,
         507,
         25468,
         2255,
         3134,
         41110,
         1730,
         72207,
         11564,
         68812,
         7007,
         152599,
         123109,
         13573
      ],
      "original_title": "Big Night",
      "runtime": 107,
      "poster_path": "/1n0H40ebJx1sO9itVvJ1jis0nqI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Rysher Entertainment",
         "id": 11661,
         "origin_country": ""
      }],
      "release_date": "1996-09-20",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "In love and life, one big night can change everything.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Campbell Scott",
         "Stanley Tucci"
      ],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Joseph Tropiano",
         "Stanley Tucci"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115678/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzMjAzMjMyMl5BMl5BanBnXkFtZTcwNTUzNDIyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Tony Shalhoub, Stanley Tucci, Marc Anthony | See full cast and crew »"],
      "reviews": [
         "This is an excellent little movie which looks like it's about food but is actually about the search for success, the striving for excellence in a crass and uncaring world, and brotherly devotion. Two Italian brothers run a little restaurant serving superb food as a labor of love, but it's failing, in contrast to the wildly successful spaghetti emporium down the street with execrable food but which is raking in the big bucks. The story line - set in the late 50's U.S.A. - is paper thin, but the movie is populated with interesting, likable people and the tale is lovingly told with an excellent script and superb acting all around, especially from the two brothers and from Ian Holm, the British actor, who does an unexpectedly great job as the owner of the red sauce place (Ian Holm playing an Italian? Yes, stunningly). Caring seriously about food does help one to appreciate this flick; I have never seen the preparation and serving of food presented so beautifully and lovingly in a movie. The final, wordless scene, in which a simple omelette is prepared and the brothers express their reconciliation, is, for me, one of the most eloquently poetic codas I have ever seen. This is a warm-hearted movie with a great deal of humor that rates an A+.",
         "I can't even begin to explain how much I love this film. First, it may be one of the great \"food movies\" of all time. Anyone who considers him/herself a lover of good food and doesn't drool over the \"timpano\" alone should check their pulse... And the performances are remarkably restrained, yet lively. Stanley Tucci is sublime, Tony Shalhoub is, as always, a marvel. Truly interesting camerawork that draws one in, yet doesn't detract (or distract) from the story or the characters. Because, at its heart, this is a character-driven piece -- about the love and mutual respect shared by two strong-willed siblings. Someday I will take part in a feast like that shared by the characters in this film, and on that day, I will be an extraordinarily happy man. Until then, I'll watch this movie again and again.",
         "After having looked over my reviews on IMDb, I noticed that only one of them was enthusiastic. That should be rectified, since I consider myself a big fan of cinema, and I choose as my second enthusiastic recommendation Big Night. This is one of those films that doesn't have to show off. It's a slice of life sort of thing going on here, with an assortment of people with strengths and faults, but who all value life's simple pleasures, like good food. It's a story about the underdogs , and their hopes and dreams and struggles -- some within reach, some not. It's got a good cast too. They all make it look easy, but they have a charming script and careful direction. I think Billy Wilder would have approved. At turns funny and touching, and the last scene -- several minutes without a word of dialogue -- is pure gold.",
         "I just need to mention that this is my friend's review that I wanted, with his permission, to share with you. I believe his meticulous view has discovered a veiled aspect which most of us have missed. MR ******** `Big Night' is a movie not so much about food and Italian cuisine but rather about cultural encounter and identity crises that most immigrants face upon their arrival in the new homeland. The story cleverly unfolds the multi-personalities of an immigrant's character in a metaphorical representation. A character that is overwhelmed in a fierce inner struggle, constantly striving to reach a desired compromised. The big night is a milestone in an eventful and often chaotic journey. It's a moment for close encounter with reality. The movie is about two brothers, Italian immigrants, trying to run ` Paradise' a gourmet restaurant. Primo is an uncompromising chef, who wishes to educate Americans to appreciate `The Real Italian Food'. Despite the obvious failure of their business, he stubbornly defies his customers' conception of Italian food. He simply cannot stand it when, a customer wants her risotto, painstakingly prepared seafood, with spaghetti and meatballs, and he calls her a `Philistine'. While the brothers are battling for survival, Pascal, another Italian immigrant one generation older, runs a busy restaurant that fulfills the American conception of Italian food. Pascal is the kind of immigrant who has a clear mission statement. He is here to do business. Secondo, the younger brother, who is in charge of management and accounting tries to convince his brother to give in and accept the business realities. He is in favor of changes to save the `Paradise'. Primo the gifted chef, Secondo the manager who wants to run his business with the Rules of the Game, and finally Christian that mysteriously and quietly is there for the brothers in times of need, all are three aspects of the same person. A person lost and exhausted in the `Paradise'. Torn apart between Pascal who runs an enormously successful Italian restaurant across the street and Alberto the isolated barber who preserved his old social values. The Movie begins with a scene that shows Christian in deep thought looking at the sea. We will see him often around the brothers throughout the movie. He hardly says anything. However, his presence has a mysterious significance yet unrevealed. Perhaps, an aspect of the immigrants' character that is more fundamental than the ones affected by cultural differences. Primo represents that side of the immigrant that's terrified by the might of the new culture and the impending changes that eventually unravel. He is reserved, strongly opinionated and scared that he may lose it all in this journey and end up `eaten up' by the new culture. Secondo shows us the willingness of the immigrant for discovery, understanding and adaptation to the new social values. He looks up to Pascal for advice and, as Gabriella (Pascal's mistress) puts it, sees him as a `lighthouse' in a raging sea. The night of the feast is an important milestone in this evolutionary process. It is an opportunity for Primo to show us what he possesses and how precious those possessions are. At the same time, it's a moment to face the reality that `Paradise' is in trouble and without a compromise it won't make it. The film ends with Secondo, Christian and Primo eating three scrambled eggs the morning after the big night. Scrambled eggs and bread, a basic food in both cultures, implying a retreat to a common ground, for further evaluation and perhaps some adjustments. The movie, quite appropriately, doesn't reveal the direction that our immigrants will take. However, it beautifully displays the quiet coexistence of three personalities in a more persuasive journey! I wonder if `the Big Night' is an adaptation of Freudian Psychoanalysis. If so could you identify `Id', ` Ego' and `superego'? SR",
         "This is just amazing, quite unlike any other \"american\" film I ever saw; a gentle, bittersweet tale of frustrated dreams and artistic integrity, an hilarious comedy of manners performed by an outstanding international cast, a touching blend of awkward romance and the central relationship between the two brothers, brilliantly portrayed by co-creator Tucci and Hollywood's \"every-foreigner\", the sublime Tony Shalhoub. Big Night dragged me through wider range of emotions than any other movie, it made me want to dance and sing during the party scene (Mambo Italiano), made me laugh out loud at the wacky characters sprinkled throughout, made me angry with the philistines and money-grabbing capitalists who spoil the brothers' dream, made me want to hug Shalhoub's shy gastronomic genius Primo as he tried so clumsily to chat up his flower-girl; the food looked simply amazing, Minnie Driver splashing around in the sea was at her most gorgeous, every actor played their brilliantly scripted part to perfection and the scene at the end with the omelette is the most beautiful and poignant ending I could ever hope to see. All in all this film is one of the best ever made and everyone in the world and especially in Hollywood should be forced to watch it every week until they get some humanity back in them. But not on an empty stomache, get some snacks in first eh.",
         "Campbell Scott and Stanley Tucci are good friends in real life and together they made this delicious gem. Tucci plays Secondo who along with his brother Primo (Tony Shalhoub) run a restaurant named the Paradise. Primo is a genius as a chef but they are on the verge of going out of business so Secondo goes down the street to a very popular place run by an acquaintance named Pascal (Ian Holm) and Secondo asks for a loan. Pascal doesn't give it to him but decides to help him by having singer Louis Prima come to their restaurant with the press knowing he's coming also. Their restaurant will become famous when its mentioned in the paper so the two brothers plan a big night with special meals. Secondo invites his girlfriend Phyllis (Minnie Driver) and Primo wants to invite the flower shop woman Ann (Allison Janney) but is to shy. Secondo helps him out by inviting her. This is another enjoyable film where food is the common component that enables them to communicate. The food and its preparation is the art of the film. Watching Primo prepare meals is a real spectacle to behold. He really does come across as a great chef, there is no doubt as you watch this. But at the core of this film is the love and respect of Secondo and Primo as brothers. Even when they argue it is done with mutual respect. Yes, they get furious but at no real time do we get the feeling that they will walk away from one another. Scott and Tucci have created a wonderful blend of food and love and its the relationship between the two brothers that is the key here. Secondo is having problems committing to Phyllis and while its an important part of the film, its not the main focus. Janney adds just the right touch as Ann and you can understand the awe that she feels when she watches Primo at work and can witness his skill first hand. Tucci and Shalhoub shine in their roles and together they bring a very good film up another notch! This film also does a believable job of recreating the time period that the film is suppose to take place in. When people ask me for a good film to rent I always think of this one. Its a real gem.",
         "When the British film magazine Sight & Sound had one of their periodic times of asking critics to list what they thought were the best films ever made, there was a book which collected articles by several of them, one of whom said that if you were the type of person who didn't tear up at THE BELLS OF ST. MARY'S, he didn't want to know you. I try to avoid that philosophy, but if I endorsed it, BIG NIGHT would be that type of film for me, a litmus test. This is a wonderful movie, and I usually am not a big fan of food movies. I thought BABETTE'S FEAST was too full of whimsy, and whimsy also bogged down the often good TAMPOPO(EAT DRINK MAN WOMAN, it could be argued, was a relationship movie which happened to be set in the world of food, where the others are inextricably food movies). But this was wonderful. Tucci and Scott said they studied a lot of film masters, and it shows here; there's nothing that screams \"first film.\" Instead, they take their time telling the story, and setting up characters we care about, even Pascal, the rival restaurant owner. And a lesser movie wouldn't have had the scene between Isabella Rosellini and Minnie Driver which is quiet yet moving, like the rest of the movie. The food scenes live up to the hype, and that final scene is moving.",
         "Big Night is a peaceful joy to watch because its themes and the overall feeling of the film is so normal. The characters, so beautifully rich, are realistic and so are their problems. The characters are mainly wonderfully, infectiously bombastic Italians, and entire scenes are sometimes constructed of the process of making Italian food from scratch. The subtlety and unaffronting reality of these qualities are so endearing to me. In fact, the scene that leaves an imprint on me more than any of the others, despite how fun it is to see the actors have a blast playing fiery, thick-mustachioed men with heavy Italian accents, is a scene that hardly has a connection with any of the others. An Italian ballad is playing over the soundtrack through the previous scene and continues into this scene, wherein Marc Anthony, playing a low-level restaurant bus boy, a small, quiet, incidental character, begins dancing with himself as he mops the floor of the restaurant. When other characters enter, the music, coming from nowhere but the film's soundtrack itself, cuts off and he continues mopping the floor as if the dancing never happened. It's so touching for that scene to have been slipped in, giving a person who is only against the background of everyone's lives a dreamy, sensitive personality that he keeps to himself. The focal point of the film is the chemistry between the characters of Stanley Tucci, playing a hard-working, pleading, frustrated restaurant owner, whose head carries only logic and a goal for success, and Tony Shalhoub, his brother, whose aggressive passion is for the food he cooks and the mystery and subtext within it, yet his interaction with people is painfully shy. Their clashes of pride, their battles with each other's completely different perspectives, and yet their sharing of the same dream are what drives the story. A lot of the film's humor comes from the hilarity of Ian Holm. Ian Holm, a stiff-limbed Englishman, plays here a loud, very animated, hot-tempered Italian entrepreneur with a seamless and wonderfully entertaining delivery of an Italian accent and Italian movements. It's my favorite performance of his because I had never before imagined that he would play a role like this. Big Night is not a masterpiece nor do I think it was even meant to be one, but what it is is subtle and interesting for purely human reasons. It's soundtrack is also a fantastic celebration of Italian music.",
         "This movie is fantastic. You feel like you are on the Jersey shore and can smell the sauce being cooked. Even Minnie Driver is great! Eat something first because the food consumed and prepared during the movie will have you drooling.",
         "This movie is like a good poem: it doesn't all make sense, but you love experiencing it, and after you're done you keep thinking about it for days and days. \"Big Night\" tells of two Italian brothers trying to succeed as restaurateurs in the 1960s. The bulk of the movie revolves a single \"big night\" in which they unleash their finest dishes in a culinary extravaganza. The leads, Shalhoub and Tucci, are joined by Ian Holm (depicting a rival restaurateur) in a really memorable set of performances. All the minor supporting characters are equally endearing and real-to-life. There is a lot of attention given to the food and to its preparation, and the cinematography used to actually depict the meal (and the music superimposed onto it) is fantastically enjoyable. It's like the dishes are actors or characters in the play! The movie's final scene is perhaps deserving of the all-time hall of fame. It plays out over several minutes of complete wordless silence, yet it makes such a lasting impression. Ultimately the scene shows that the movie is not about the food or the striving for success, but about the relationship between these brothers, and that the relationship will outlast any of the trials they are undergoing, no matter how severe. If you insist on a tidy ending that resolves all the issues, don't look here because the ending is completely hanging. Yet somehow I found it satisfying nevertheless. You'll find yourself recalling scenes and lines from the film for weeks to come."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Rysher Entertainment",
         "Timpano Production"
      ],
      "summaries": [
         "Primo and Secondo are two brothers who have emigrated from Italy to open an Italian restaurant in America. Primo is the irascible and gifted chef, brilliant in his culinary genius, but determined not to squander his talent on making the routine dishes that customers expect. Secondo is the smooth front-man, trying to keep the restaurant financially afloat, despite few patrons other than a poor artist who pays with his paintings. The owner of the nearby Pascal's restaurant, enormously successful (despite its mediocre fare), offers a solution - he will call his friend, a big-time jazz musician, to play a special benefit at their restaurant. Primo begins to prepare his masterpiece, a feast of a lifetime, for the brothers' big night...",
         "A failing Italian restaurant run by two brothers gambles on one special night to try to save the business."
      ],
      "budget": 4100000
   },
   "movielensId": 994,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-09-20",
      "dvdReleaseDate": "1998-02-24",
      "directors": [
         "Stanley Tucci",
         "Campbell Scott"
      ],
      "runtime": 107,
      "movieId": 994,
      "title": "Big Night",
      "mpaa": "R",
      "actors": [
         "Stanley Tucci",
         "Tony Shalhoub",
         "Marc Anthony",
         "Minnie Driver",
         "Isabella Rossellini",
         "Liev Schreiber",
         "Ian Holm",
         "Allison Janney",
         "Dina Spybey-Waters",
         "Caroline Aaron"
      ],
      "imdbMovieId": "0115678",
      "originalTitle": "Big Night",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["IkaaUuQwRZY"],
      "plotSummary": "Primo &amp; Secondo, two immigrant brothers, pin their hopes on a banquet honoring Louis Prima to save their struggling restaurant.",
      "tmdbMovieId": 18203,
      "avgRating": 3.99758,
      "releaseYear": "1996",
      "numRatings": 5581,
      "posterPath": "/1n0H40ebJx1sO9itVvJ1jis0nqI.jpg"
   }
}