{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fish market",
            "id": 5562
         },
         {
            "name": "drifter",
            "id": 13017
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0115847",
      "video": false,
      "title": "Caught",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe4727c3a36847f812638b",
               "name": "Edward James Olmos",
               "profile_path": "/i7zKqsFqL5L1HPmAMeSA1xZzlD5.jpg",
               "id": 587,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe4727c3a36847f812638f",
               "name": "María Conchita Alonso",
               "profile_path": "/u2cQAgruOQxTE4gwJKodr0u2QmL.jpg",
               "id": 2051,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe4727c3a36847f8126393",
               "name": "Arie Verveen",
               "profile_path": "/yh3mOsRXENzK3JJljFlSgX7p6QL.jpg",
               "id": 91612,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Amy",
               "gender": 1,
               "credit_id": "52fe4727c3a36847f8126397",
               "name": "Bitty Schram",
               "profile_path": "/fcUmGsYdoK31CGxIyk1D4clnBK0.jpg",
               "id": 138240,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe4727c3a36847f812639b",
               "name": "Steven Schub",
               "profile_path": "/8Rt1XNnNAYG48yEY8WRSUmWwp60.jpg",
               "id": 15371,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4727c3a36847f8126381",
               "name": "Robert M. Young",
               "profile_path": null,
               "id": 86293,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4727c3a36847f8126387",
               "name": "Edward Pomerantz",
               "profile_path": null,
               "id": 138239,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe734c92514128e403619e",
               "name": "Edward Pomerantz",
               "profile_path": null,
               "id": 138239,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.08337,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47260,
      "vote_count": 5,
      "budget": 0,
      "overview": "A middle-aged couple has a drifter enter their lives. The fish-store owners find that the mysterious young man awakens the couple in ways they didn't expect. Things get tense when the drifter begins an affair with the woman of the house.",
      "similar": [
         188166,
         1427,
         4771,
         829,
         949,
         2034,
         320,
         180,
         187,
         189,
         101,
         77,
         78,
         401371,
         59967,
         2019,
         421044,
         9504,
         164457,
         984
      ],
      "original_title": "Caught",
      "runtime": 110,
      "poster_path": "/1UXbJIszOEalpFY0BKkRn1cRv66.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cinehaus",
            "id": 761,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Circle Films",
            "id": 11273,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "DuArt",
            "id": 20049,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-24",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert M. Young"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Edward Pomerantz",
         "Edward Pomerantz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115847/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2ODQ0MDg1Ml5BMl5BanBnXkFtZTcwODAxMTkxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Edward James Olmos, Maria Conchita Alonso, Arie Verveen | See full cast and crew »"],
      "reviews": [
         "\"Caught\" is a tight, ensemble drama which does something few films can do. It offers solid character development and explores the range of human emotion while telling a story with real depth and fidelity. Perfectly cast and executed, \"Caught\" peers into the lives of a middle aged couple who own a NYC fish market as a hired man becomes more than just a friend displacing their wayward adult son by day, the work-a-day husband by night, and acts as a catalyst for some compelling situations and performances. An excellent watch for mature audiences into psychodramas sans Tinseltown's usual hype and glitz.",
         "We saw this indie film when it made its commercial debut. The other night it was shown on cable and we decided to take another look. Directed by Robert M. Young, and based on a novel and screen play by Edward Pomerantz, \"Caught\" is an erotically charged movie. Joe and Betty feel sorry for the young man who seems to be a drifter and employ him to work in their fish store in New Jersey. Betty, who is obviously a sexually repressed woman, finds in the new man the excitement she is sorely lacking in her marriage. When their son Danny returns from the West Coast, things take a turn as this is a doomed romantic triangle from the start. Mr. Young, the director has gotten excellent acting all around from the cast. Edward James Olmos is Joe. Maria Conchita Alonso is Betty a woman of a certain age who discovers pleasure with a younger man. Arie Verveen, is Nick the young man who is the object of Betty's passion. \"Caught\" is worth a look, as it won't disappoint the viewer who stumbles into it.",
         "Nick (Aire Verveen), a young Irish starving drifter, is helped by Joe (Edward James Olmos), the owner of a small fish market in New Jersey, and his wife Betty (Maria Conchita Alonso). They feed and bring him home, to work with Joe in the fish market. They also offer lodging for a period in the room of their son Danny (Steven Schub), who moved to Hollywood, looking for success as a performer and actor. Nick is treated like a son, working in the store and learning how to trade and handle with fishes. Pretty soon, he becomes Joe's best friend. Meanwhile, a huge company makes an offer for buying Joe's establishment, but he refuses the offer. Betty seduces Nick and they become lovers. The cuckold Joe trusts in Nick and cannot imagine the affair between Betty and Nick. Betty asks Nick to convince Joe to sell the fish market to improve their lives and Joe decides to accept the offer of US$ 750,000.00. The relationship of Joe's family changes when Danny returns home, with his wife and son. The selfish Danny, full of jealousy and greed, begins a game of intriguing, ending in a very tragic way. This film is the proof that a low-budget movie may work, since supported by a good screenplay and excellent casting. A very credible and cruel story, with an amoral and realistic end, not indicated for romantic viewers. My vote is seven.",
         "This movie had me thinking well after viewing it. I had never heard of 'Caught' until I stumbled on it on late night free to air TV last week. Watched about an hour of it and found it very hard to drag myself off to bed (had to work next day), so I video taped the remainder. The excellence of this movie can not be understated. Outstanding acting by all which is evident by the fact I liked greatly or disliked intensely the relatively small cast. It is also a realistic slice I think of a battling small business in a big city. Crux of the story is an outwardly happy married couple who own a fish store, take in a down to earth homeless young man, Nick. From a hearty meal at their home, Nick ingratiates himself with both Joe & Betty and ends up staying with them in their only childs (Danny, a Hollywood hopeful) room. Nick works with Joe at the fish store and gradually becomes like the son taking over the family business. Everything goes fine until a number of linked incidents take place. Firstly there is a possibility of Joe & Betty getting out of their day to day existence when a developer is interested in their shops location for a sizeable amount of money. Next is the gradual interest of Nick and Betty in each other which ultimately leads to a torrid affair. Finally there is the return of the prodigal son Danny with his wife and young child. From here, the movie will glue you to your seat. So sit back and take it all in (I have no intention of stating 'enjoy'). If you get a chance to see this underrated movie, invest the time required to view it.",
         "One of the best performances I've ever seen is Danny, played by Stephen Schub. Permissible use policy of IMDb prohibits me from using any of the words that can describe the character of Danny. If you ever want to see an actor convincingly play the most detestable person you can ever imagine, see Schub play this role. Everyone else is good, too. An entertaining, enjoyable picture.",
         "I loved this film because it was absolutely real and totally believable. The character development was awesome and the tensions between the characters could be cut with a knife (sorry, you'll see why!). An emotional rollercoaster from start to finish. Don't miss this one.",
         "CAUGHT (1996) *** Edward James Olmos, Maria Conchita Alonso, Arie Verveen, Steven Schub, Bitty Schrimm. Kind of an update of `The Postman Always Rings Twice' with drifter Verveen (in an impressive acting debut reminiscent echoing early Brando) who wanders into the lives of a Jersey City fish store owner and his wife making more than a difference and causing a rippling effect by his impact. Schub effectively balances menace and annoyance as easily the worst attempt at becoming a comedian!",
         "A fairly common theme- a young drifter has an affair with a bored older married woman, but somehow special. Very erotic, but not an X movie and tastefully done. Alonso is great, as are Olmos and the newcomer- Vereen. Also has a little bit of comedy. Alonso is very sexy, and also very realistic. You can actually feel what the three leads are feeling. The setting- a fish market is perfect. The characters of the three leads are all sypathetic and likeable. I have watched the movie several times.",
         "I was informed that there is an old Eskimo custom where the guest in an Eskimo couple's home has to sleep with the wife as a sign of gratitude for the hospitality. \"Caught\" puts Joe and Betty, a Hispanic couple, in the same situation with the exception that Joe neither knows of or allowed for his guest Nick to show that kind of gratitude for the hospitality offered through his servitude at the couple's fish market and home. If a stray is cute enough, a family member will fall in love with it enough to keep it at home. Joe is much the business traditionalist by his rebuffing of corporate takeover requests pressured on him, but this hurts his marriage, giving his newest and prospective employee a new perspective. He's the son they always wanted to replace the son they wanted to replace, Danny. Betty still gazes at Danny's video past to expect a good future, much as she does for Joe's pastime despite his heart condition. Gazes are what occurs with Nick and Betty that slowly leads to the affair that lifts Betty spirits after Nick coerces Joe into selling the business for a fishing business venture. Sure enough, Danny returns with a wife and child for a surprise visit. The reality of the new living arrangements, Nick in Danny's old room, pushes Danny to the realization of his replacement. Now, a thorn has been added to the side of Nick, Betty, and Joe. It takes a good deed by Nick against Danny as well as the knowledge of Nick's affair that causes Danny to spiral down, even with part of the money Betty gave to help Danny, which is used against her when Joe gets the news broken to him. By the end, all four never see their futures. Half die suddenly while the other half die extremely slowly and sadly. Counting the number of holes in Olmos' face of checking out Alonzo's firm contours and sensuality also helps in viewing this movie but the story is plotted well despite the reality that someone would have beaten the hell out of Danny for his annoying behavior.",
         "This could have been your run of the mill erotic thriller with the tired plot of lonely couple takes in drifter, drifter has affair with woman, etc. However with superb acting by the entire cast, good writing and direction this goes beyond the genre. After Schub appears in the last part, the movie gets even better. Denoument comes fast and furious. I kept expecting it to lapse into cliches, but it never did. I do not understand the last scene with Alonso, but this is a must see sleeper."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Cinehaus",
         "Circle Films",
         "DuArt"
      ],
      "summaries": ["Joe and Betty run a fish market and have sunk into a comfortable, if somewhat boring life. Enter the drifter Nick, who takes a job in the store and a place in their home. He proceeds to awaken Joe's hope in the future as well as Betty's sexual passions. Until their son Danny returns home and notices the changes..."],
      "budget": 0
   },
   "movielensId": 997,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-24",
      "dvdReleaseDate": "2003-08-05",
      "directors": ["Robert M. Young"],
      "runtime": 110,
      "movieId": 997,
      "title": "Caught",
      "mpaa": "",
      "actors": [
         "Edward James Olmos",
         "María Conchita Alonso",
         "Arie Verveen",
         "Bitty Schram",
         "Steven Schub"
      ],
      "imdbMovieId": "0115847",
      "originalTitle": "Caught",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["i0Ja-Ttm_5E"],
      "plotSummary": "A middle-aged couple has a drifter enter their lives. The fish-store owners find that the mysterious young man awakens the couple in ways they didn't expect. Things get tense when the drifter begins an affair with the woman of the house.",
      "tmdbMovieId": 47260,
      "avgRating": 3.53261,
      "releaseYear": "1996",
      "numRatings": 230,
      "posterPath": "/1UXbJIszOEalpFY0BKkRn1cRv66.jpg"
   }
}