{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "single parent",
            "id": 641
         },
         {
            "name": "bank robber",
            "id": 2492
         },
         {
            "name": "last chance",
            "id": 4813
         },
         {
            "name": "heist",
            "id": 10051
         },
         {
            "name": "los angeles",
            "id": 12670
         }
      ],
      "imdb_id": "tt0117603",
      "video": false,
      "title": "Set It Off",
      "recommendations": [
         31357,
         8291,
         16096,
         22314,
         16094,
         37315,
         19033,
         9416,
         150065,
         61016,
         58680,
         20513,
         44857,
         16162,
         4968,
         43334,
         39310,
         28028,
         46027,
         26475
      ],
      "backdrop_path": "/xSRMGAs6zbgrIDlDlmfH8OtaOIf.jpg",
      "revenue": 41590886,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Stony",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b39d5",
               "name": "Jada Pinkett Smith",
               "profile_path": "/Pb8KeGa4kTgJqS2ASoYvbNHbLr.jpg",
               "id": 9575,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cleo",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b39d9",
               "name": "Queen Latifah",
               "profile_path": "/ht52no1SMDhYBwRAmWL9a5YCss1.jpg",
               "id": 15758,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Frankie",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b39dd",
               "name": "Vivica A. Fox",
               "profile_path": "/uxTOzgRhk0VkbK1ZiOrQSTYuzAl.jpg",
               "id": 2535,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tisean",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b39e1",
               "name": "Kimberly Elise",
               "profile_path": "/315K0qi3aFmcgGweUiLwhdrvcfU.jpg",
               "id": 55314,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Keith Weston",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b39e5",
               "name": "Blair Underwood",
               "profile_path": "/xDqEtEwJNb3fDYnopeFlmMYVQ66.jpg",
               "id": 56871,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Detective Strode",
               "gender": 2,
               "credit_id": "55d4df0e92514102c60026bf",
               "name": "John C. McGinley",
               "profile_path": "/6AJL0ylRtJ9vcR57yEenhWHXHFt.jpg",
               "id": 11885,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Detective Waller",
               "gender": 1,
               "credit_id": "55d4df19c3a368508200293e",
               "name": "Ella Joyce",
               "profile_path": "/jMqU4FQcQUY9CNp6zMfXWCiTEHx.jpg",
               "id": 58681,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Nate Andrews",
               "gender": 2,
               "credit_id": "55d4df30c3a368507f002a05",
               "name": "Charles Robinson",
               "profile_path": "/vUloFyvSAeIMNU1dMryCu7ge6yM.jpg",
               "id": 43524,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Black Sam",
               "gender": 2,
               "credit_id": "55d4df3992514102d20027d2",
               "name": "Dr. Dre",
               "profile_path": "/lPcS1QAULXTZP53ogsYSW4bZAOe.jpg",
               "id": 2041,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Darnell",
               "gender": 2,
               "credit_id": "55d4df6992514102c60026c4",
               "name": "WC",
               "profile_path": null,
               "id": 305427,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Guy Driving Low-Rider",
               "gender": 2,
               "credit_id": "55d4df8cc3a3687b99001fe1",
               "name": "F. Gary Gray",
               "profile_path": "/hjMfkAyz5ECn0svAzrkG3YsEaEW.jpg",
               "id": 37932,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "TV Anchor",
               "gender": 0,
               "credit_id": "55d4dfa4925141154e001e09",
               "name": "Mark Thompson",
               "profile_path": null,
               "id": 164939,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Nigel",
               "gender": 0,
               "credit_id": "55d4dfb3c3a368508200294a",
               "name": "Geoff Callan",
               "profile_path": null,
               "id": 1233979,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Tanika",
               "gender": 0,
               "credit_id": "55d4dfcac3a368508f002389",
               "name": "Natalie Desselle",
               "profile_path": "/wfJLseA8S721ACajZr6W8btVIku.jpg",
               "id": 83099,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Luther",
               "gender": 2,
               "credit_id": "55d4dfd392514102d80028bf",
               "name": "Thomas Jefferson Byrd",
               "profile_path": "/pFmHmzQ3rS9ZD8A2eDXzk6wkHT6.jpg",
               "id": 98889,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Stevie Newsome",
               "gender": 2,
               "credit_id": "55d4dfe1c3a3685abc00086f",
               "name": "Chaz Lamar Shepherd",
               "profile_path": null,
               "id": 154176,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "Lorenz",
               "gender": 0,
               "credit_id": "55d4dfee92514102c300264c",
               "name": "Samuel Monroe Jr.",
               "profile_path": null,
               "id": 1424350,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b39eb",
               "name": "F. Gary Gray",
               "profile_path": "/hjMfkAyz5ECn0svAzrkG3YsEaEW.jpg",
               "id": 37932,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b39f1",
               "name": "Takashi Bufford",
               "profile_path": null,
               "id": 57679,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b39f7",
               "name": "Takashi Bufford",
               "profile_path": null,
               "id": 57679,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b39fd",
               "name": "Oren Koules",
               "profile_path": null,
               "id": 2147,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b3a03",
               "name": "Dale Pollock",
               "profile_path": null,
               "id": 57680,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a09",
               "name": "Christopher Young",
               "profile_path": "/2laVovSXDVpHRS6HSpKyCspSmze.jpg",
               "id": 19155,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a0f",
               "name": "Marc Reshovsky",
               "profile_path": null,
               "id": 42130,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b3a15",
               "name": "John R. Carter",
               "profile_path": null,
               "id": 8582,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5973dd3a925141582b005d53",
               "name": "Kate Lanier",
               "profile_path": null,
               "id": 66598,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5973dd6492514157f2006667",
               "name": "Takashi Bufford",
               "profile_path": null,
               "id": 57679,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.331633,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9400,
      "vote_count": 85,
      "budget": 9000000,
      "overview": "Four black women, all of whom have suffered for lack of money and at the hands of the majority, undertake to rob banks. While initially successful, a policeman who was involved in shooting one of the women's brothers is on their trail. As the women add to the loot, their tastes and interests begin to change and their suspicions of each other increase on the way to a climactic robbery.",
      "similar": [
         23397,
         96,
         949,
         449443,
         90,
         193893,
         4771,
         1640,
         9654,
         562,
         281,
         1538,
         1572,
         968,
         755,
         395990,
         553,
         10623,
         11966,
         359412
      ],
      "original_title": "Set It Off",
      "runtime": 123,
      "poster_path": "/lfMk5h35Fccl5gOsBaeYvMnBUPb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1996-11-06",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "It's about crime. It's about payback. It's about survival.",
      "adult": false,
      "homepage": "http://www.newline.com/properties/setitoff.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["F. Gary Gray"],
      "runtime": 123,
      "synopsis": "Lida 'Stony' Newsom, Cleopatra 'Cleo' Sims, Francesca 'Frankie' Sutton and Tisean 'T.T.' Williams are four female inner city Southern Californian childhood friends. Now adults, \"Set It Off\" focuses on life's series of unfortunate events and taking vengeance on life with an Uzi in hand. They embark on a series of robberies in the Southern California banking district to fund their escape from a life surrounded by tragedy, poverty and despair. That triggers an over diligent Detective Strode and his female partner, Detective Waller, on a hunt for the \"armed and dangerous\" women. That triggers another series of unfortunate that corners Lida 'Stony' Newsom into choosing between her new found love interest and friends.",
      "writers": [
         "Takashi Bufford",
         "Takashi Bufford"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117603/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2MzUxODQ0Nl5BMl5BanBnXkFtZTcwNTQyNzEyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Jada Pinkett Smith, Queen Latifah, Vivica A. Fox | See full cast and crew »"],
      "reviews": [
         "\"Set it Off\" is another brilliant little B sleeper by the talented F. Gary Gray. What sets this film apart from your routine crime caper/heist flick is that it features some very impressive and strong performances by Jada Pinkett-Smith (one of her very best roles) and Quen Latifah. Vivica Fox, Kimberly Elise and the underrated John C. McGinty were also quite effective in supporting roles. Blair Underwood, who I lilke, was sort of wasted as reverse eye candy. The love story sub plot was a bit if a distraction, only in a minor way. But at the core of this film was the bond between these ladies, all driven to rob banks for various reasons. What they all shared was their desperation. Instead of cliched cardboard characters, we are served pretty well fleshed out characters with as much depth as time allows. Some have mentioned they didn't like the ending, but I rather did. Queen Latifah was outstanding as a hardened career criminal. There is one scene where Jada's character stands up to her and it's tasty. All in all, a pretty dang good thriller film that should be seen. The performances are what elevates it above the norm for this genre.",
         "Great Movie. Gripping tale of 4 women who turn to robbing banks to make it out of ghetto life. The 4, played by Jada Pinkett, (Not married to Will Smith at time of filming) Vivica A. Fox, Dana Owens (Better know as Queen Latifa) and newcomer at the time, Kimberly Elise all work legally until they figure that crime will pay them more than honest work. Blair Underwood is excellent as the love interest for Stoney (Pinkett) with his Harvard education mixed with a street knowledge. Pace of the movie is good, and it all flows very well. Excellent movie. Worth renting from Blockbuster.",
         "I thought this was great. I am not being biased because of the fact that F. Gary Gray directed this but this was actually a very good movie. There is so much in this movie that really made me feel bad for the female quartet of bank robbers: (1. Stony degrades herself in order to put her brother through college only to find out he didn't get in and to see him shot dead minutes later (2. T.T., a single mom gets her pay docked, and is forced to bring her son to work who is hospitalized there as well (3. Frankie is robbed at gunpoint by some rockheads from her hood and loses her job because she didn't follow the procedure, and knowin' the game you're not supposed to snitch on someone from your own block 'cause that puts you at risk and (4. Cleo, the trigger happy, dyked out robber of the bunch has led a life of crime and has no one to turn to but her girlfriend and best friends. This was such a wonderful movie because the action was definitely present here and the acting(especially Jada Pinkett and Queen Latifah) was great! Not only was the action there but the sentiment of the girls and what they've been through and what they go through shows how unfortunate they were and even worse, I damn near almost started crying at the ending 'cause it made me feel so bad. Christopher Young score well with the BGM of this flick to put the cherry on top. very wonderful movie with a conscience 10/10",
         "This movie gives us a graphic insight into the possibility of what people might do under certain circumstances and situations. These young ladies' misfortunes in life have driven them to do something that otherwise would not have entered their minds: robbing a bank. Their participation in this criminal activity is a crying-out against the evils of their society and environment. In other words, they are saying \"because of what you did to me...this is how I will respond\". Anyone who has seen this film honestly knows that what they're doing is just as morally wrong as what has happened to each of them, but, for some deep-seated reason, we find ourselves rooting for them - even hoping that they get away with it. Each character reveals a problematic area in our working society: unfair employment and termination practices, inadequate childcare options, hindrances and distractions of the ghetto and other social plights and dilemmas. We may not agree with what these young ladies are doing but somehow we understand. (please see this movie...)",
         "My first impression was \"Gangsta flick with chicks.\" And, to some extent, that's what I got. But there was a lot more, and I was deeply impressed with the realism, with one exception. The exception comes near the end and I won't give it away, but it involves police officers taking shots at a suspect with a bus full of people in the background. One of the recurring themes of this film is how innocence and good intentions can turn into a nightmarish reality. A bank teller is confronted by a robber that she knows from childhood. She can hardly believe what is happening, and she doesn't react in the manner in which all bank tellers are trained. A hostage dies, and she loses her job. A slow reaction leads to a death, accusations, and the loss employment. A bright young man gets a haircut that is identical to a robbery suspect's. The police surround him. He has a champagne bottle in his coat that he doesn't want to break and tries to pull it out. They think it is a gun. An innocent mistake leads to a death. A loving mother can no longer afford a babysitter. She has to bring her child to work, and he gets into some cleaning supplies. A mother's good intention turns into a hospital trip and a custody battle. There were other instances where one mistake led to dire consequences, but I found them all believable, and none of them gave me the impression of being mere vehicles to advance the plot. I enjoyed some of the other representations of Life as it is. One being the inclusion of a lesbian (Latifa) in the cast without making a big deal out of it. Although exhibiting some stereotypical lesbian traits (denim overalls for example,) she wasn't overly \"butch.\" And homosexuality wasn't used as a plot device to include nudity either. Speaking of which, the sex in the movie was pretty well done. When there was love, the sex was passionate. When Stony was doing it for money, she looked ready to burst into tears. For the most part, the sex came without nudity: disappointing in some ways, but adding credibility to the movie in others. I did have a few problems with this movie. One is a failing that I see in many movies. When a character's friend or family member is killed, he or she expresses initial shock and pain, but later on exhibits no outward mental stress. There is also the \"I would have done it differently\" factor. I felt this a few times, the first being the opening scene where Frankie (Fox) is being held up. Or when Cleo (Latifa) is stealing get away cars and tossing the previous owner's CDs out the window. Both of these are cases in which one needs to move fast and do what is needed to move on. You don't have time to stare blankly at your old friend. You don't have time to select the proper driving ambience. But these flaws didn't take too much from the general feeling. I rated it 8 of 10.",
         "A great movie for those peoples that like to empathize with a movie. If you let yourself have the same feelings as the characters in the movie have you might have strong emotions like: despair, feeling trapped and injustice. You might even find, that choices you can't comprehend are suddenly very logical. For peoples that don't let their feelings participate in watching the movie. I imagine this movie is less appealing.",
         "\"Set It Off\" is about four African-American women(Jada Pinkett Smith, Queen Latifah, Vivica A. Fox, and Kimberly Elise) who decide to go out and rob a few banks. They don't rob banks for sheer enjoyment or because they have nothing better to do. No, they rob them because they are getting back at \"the system\" that they feel has screwed them over in their lives. Here are the reasons: in the opening bank robbery sequence, Frankie(Fox), who was at the time a teller, was fired simply because she knew the suspect who robbed it; Stony's(Smith) younger brother, Stevie was killed by police after being mistaken for the robbery suspect; Cleo(Latifah) joins them simply because she is p***ed off at society; Tisean(Elise) is a single mother who is barely able to support her son and when he is accidently poisoned and taken away by child services, decides she has no other choice. I feel I must point out that up until that point, she is reluctant to join the other three women. This is a really good movie that is definitely Oscar-worthy material. Maybe not for the Best Picture category, but definitely Oscar-worthy. The performances are excellent especially from all four of our young stars. Queen Latifah should definitely should have gotten an Oscar or Golden Globe nomination for Best Supporting Actress. Her portrayal of a fiery lesbian is right on key. F. Gary Gray, who also directed Ice Cube and Chris Tucker in \"Friday\", is quickly becoming one of my favorite directors. I don't think you should really call \"Set It Off\" an action movie since there isn't really action until the ending. A line from the movie, \"if that crackhead Darnell can rob a bank, then so can we.\" This quote outlines the main message that the movie is trying to tell: the social standing of women in our society, saying that they have rights too. The movie says that women can basically do anything men can do (and probably better) and they must be applauded for their efforts. Now I'm not saying that women should all go out and round up their friends and start robbing banks. Director F. Gary Gray definitely should be praised for his smart casting choices. 10/10 P.S.: Now from the sound of this review, I've probably got you thinking I'm a woman. Wrong! I'm just a 16 year-old boy from Virginia.",
         "Here's a movie that bombed because nobody had any idea how to advertise it. It turns out that \"Set it Off\" is the devastatingly sad story behind a string of unusual bank robberies. I highly recommend it as you really grow to care about the characters, which makes the final act all the more harrowing. My only problem is that the romantic subplot seems out of place. Other then that, make sure you have a box of tissues ready.",
         "A formula caper film,but not in the style of Ridley Scott's \"Thelma and Louise\",the film \"Set It Off\",offers the novelty of a quartet of young black working-class girls from South Central Los Angeles who turn to bank robbing when times get tough. Although the characters are well played with some of great and intense action scenes makes for an uneven mix of social drama and exploitation film,from which the likes haven't see since the days of the 1970's action blaxploitation films. Bank teller Frankie Scott(Vivica A. Fox)is fired from her job and joins three friends in working for a late-night cleaning service. Complaining about the work,she suggests in jest that they rob a bank. Cleo(Queen Latifah),a hard-drinking tough-as-nails female,and the only one in the group with a criminal record,is seriously interested. Both Stony(Jada Pinkett-Smith),a young woman trying to put here brother through college,and Tisean(Kimberly Elise),a single mother,dismiss the motion out of hand. Events take a turn for the worst when Stony's brother,Stevie(Chaz Lamar Shepard),is killed by the police in a case of mistaken identity,and Tisean's son is taken away from her by Child Protective Services after he accidentally swallows cleaning fluid at the girls' workplace. Frankie insists that,with her knowledge of banks,they can plan a foolproof job,and she and Cleo convince the other two that they can get out of South Central Los Angeles for good with enough cash. Stony,is sent to case Downtown Federal,where she catches the eye of Keith,a handsome,well-educated bank manager(Blair Underwood),who gives her his phone number. They soon began dating. The four girls execute their first bank job wearing wigs and sunglasses and make off with $12,000. A second robbery nets them $300,000,enough for them to leave L.A. They hide the loot inside an air vent in the cleaning office. They decide to wait three days before leaving town,until after Tisean's court date to get her child back. Meanwhile, Detective Strode(John C. McGinley)and his female partner Detective Waller(Ella Joyce) doggedly pursue all leads and identify Stony,Frankie and Cleo as suspects. Learning that their boss,Luther(Thom Byrd),has fled with the stolen money,the girls enlist the aid of an notorious gunrunner,Black Sam(Andre \"Dr. Dre\" Young),who is also a local gang leader,to track Luther to a seedy motel. When Luther pulls a gun out on Cleo,Tisean shoots and kills him. But they are unable to find the money. The girls pull one last bank job-at Downtown Federal,where Keith works. In order to get Keith out of the bank during the robbery,Stony calls him and tells him to meet her. Strode and his partner interrupt the robbery and get the drop on all four girls. In the ensuing confrontation,a bank guard fires and wounds Tisean and is then shot by Stony. The girls flee with the money and manage to elude the police for several hours. Before the night is over,Tisean dies from her wounds,and Cleo and Frankie are both killed by police bullets in separate incidents. Stony manages to get on a bus to Mexico and freedom. She calls Keith and thanks him. The motion picture,\"Set It Off\" offers the audience four intriguing young black female characters,a rare grouping in any Hollywood movie and from the strength of this film went on to become one of the top ten best action films of 1996. Three of the group who stars in \"Set It Off\",constitute the hottest young black female actresses of their day. You have Jada Pinkett-Smith(\"The Nutty Professor\",\"Menace II Society\", \"Jason's Lyric\",\"Collateral\"),Vivica A. Fox(\"Independence Day\",\"Soul Food\"),rapper-sitcom-singer star Queen Latifah(from the television series \"Living Single\",\"Chicago\"),not to mention at the time newcomer Kimberly Elise(\"John Q\",\"Diary of a Angry Black Woman\"). What made this film so very riveting to watch was the electrifying performance of actress Queen Latifah,in one of the most surprising roles ever accompanish by a actress,is a thrill to watch as Cleo. No one else but Latifah can bring this riveting and pulsating character to life with her outlandish style of gun-toting and sometimes extremely foul mouthed criminal flair. Instead,\"Set It Off\" is fast paced and very well-acted. The director F. Gary Gray,most notably for the original comedy \"Friday\",with Ice Cube and Chris Tucker,and the fast paced crime thriller \"The Negotiator\",with Kevin Spacey and Samuel L. Jackson makes imaginative use of L.A. landscape,but still will leave a feeling of social conscience,especially when it touches the issue concerning the explosive rage inside the angry black woman,and the harsh realities of trying to survive in a rugged landscape.",
         "I rented this movie expecting to see just another average gang related film about the Ghetto, but I was proved wrong. It ended with my eyes wide opened and my mouth to the floor. Set It Off is a very Dramatic film and the performances by the four women were done perfectly. Set It Off reached my heart and all my emotions. It starts off light, but ends deep and touching. There is no possible way you could leave from watching this movie without your eyes being flooded. -A heart-filled film that deserved more publicity than it received."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Peak Films"
      ],
      "summaries": [
         "Four Black women, all of whom have suffered for lack of money and at the hands of the majority, undertake to rob banks. While initially successful, a policeman who was involved in shooting one of the women's brothers is on their trail. As the women add to the loot, their tastes and interests begin to change and their suspicions of each other increase on the way to a climactic robbery.",
         "All have suffered that what they did was wrong and one loses all her friends that passed on the money they have stolen."
      ],
      "budget": 9000000
   },
   "movielensId": 998,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-06",
      "dvdReleaseDate": "1999-09-14",
      "directors": ["F. Gary Gray"],
      "runtime": 123,
      "movieId": 998,
      "title": "Set It Off",
      "mpaa": "R",
      "actors": [
         "Jada Pinkett Smith",
         "Queen Latifah",
         "Vivica A. Fox",
         "Kimberly Elise",
         "Blair Underwood",
         "John C. McGinley",
         "Ella Joyce",
         "Charles Robinson",
         "Dr. Dre",
         "WC",
         "F. Gary Gray",
         "Mark Thompson",
         "Geoff Callan",
         "Natalie Desselle",
         "Thomas Jefferson Byrd",
         "Chaz Lamar Shepherd",
         "Samuel Monroe Jr."
      ],
      "imdbMovieId": "0117603",
      "originalTitle": "Set It Off",
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["bKB2KclDMTY"],
      "plotSummary": "Four black women, all of whom have suffered for lack of money and at the hands of the majority, undertake to rob banks. While initially successful, a policeman who was involved in shooting one of the women's brothers is on their trail. As the women add to the loot, their tastes and interests begin to change and their suspicions of each other increase on the way to a climactic robbery.",
      "tmdbMovieId": 9400,
      "avgRating": 3.22313,
      "releaseYear": "1996",
      "numRatings": 856,
      "posterPath": "/lfMk5h35Fccl5gOsBaeYvMnBUPb.jpg"
   }
}