{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "gun",
            "id": 1419
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "cocaine",
            "id": 2150
         },
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suicidal",
            "id": 11258
         },
         {
            "name": "scam",
            "id": 11454
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "explosion",
            "id": 14601
         },
         {
            "name": "argument",
            "id": 41379
         }
      ],
      "imdb_id": "tt0115438",
      "video": false,
      "title": "2 Days in the Valley",
      "recommendations": [
         10990,
         16384,
         10859,
         18621,
         9452,
         29193,
         16148,
         11718,
         10608,
         12596,
         9440,
         10631,
         12395,
         26261,
         15745,
         12518,
         10442,
         2107,
         27224,
         6470
      ],
      "backdrop_path": "/gtoc4eqNxmtBLayuzq1nORn6fof.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Dosmo Pizzo",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a6f",
               "name": "Danny Aiello",
               "profile_path": "/UvPalkz4ynJJrTcrbpfD05gVoO.jpg",
               "id": 1004,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Allan Hopper",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a73",
               "name": "Greg Cruttwell",
               "profile_path": "/44afCUYh5lG4zDhCPp1uV8Srxuu.jpg",
               "id": 58090,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Alvin Strayer",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a77",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Becky Foxx",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b3a7b",
               "name": "Teri Hatcher",
               "profile_path": "/xnvUJvf0vjHliYa2PlXyLGaJe9l.jpg",
               "id": 10742,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Helga Svelgen",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b3a7f",
               "name": "Charlize Theron",
               "profile_path": "/k5Xt2mNlraX7yHYaPy9gvayCaKV.jpg",
               "id": 6885,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Lee Woods",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a83",
               "name": "James Spader",
               "profile_path": "/gFDjZje8P0S3MzHuw1cxiYuHBX5.jpg",
               "id": 13548,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Wes Taylor",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a87",
               "name": "Eric Stoltz",
               "profile_path": "/fXaULtqnMDKsqT1to8vnLjSXe0w.jpg",
               "id": 7036,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Detective Creighton",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a8b",
               "name": "Keith Carradine",
               "profile_path": "/b2GbGSrgb6twTdjfvUK4y0WrIjx.jpg",
               "id": 30613,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Susan Parish",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b3a8f",
               "name": "Glenne Headly",
               "profile_path": "/a90ZslKOvecuy7doMWXsFc1Aoc4.jpg",
               "id": 21104,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Audrey Hopper",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b3a93",
               "name": "Marsha Mason",
               "profile_path": "/1iTPM9ciKMFb5RzePlcKhfWO0Fb.jpg",
               "id": 19131,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Teddy Peppers",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a97",
               "name": "Paul Mazursky",
               "profile_path": "/2ooiA3X9Y0cpyBIAHTpU5Q3Q7em.jpg",
               "id": 47773,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Evelyn",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b3a9b",
               "name": "Louise Fletcher",
               "profile_path": "/A4Cn7LsuLlOXvOMKv5ez4ThyeZL.jpg",
               "id": 7071,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Ralph Crupi",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a9f",
               "name": "Austin Pendleton",
               "profile_path": "/pxcdhd4oAsnhvUg0BalmiiKJyXg.jpg",
               "id": 6168,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Roy Foxx",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3aa3",
               "name": "Peter Horton",
               "profile_path": "/uq9ry9LRU2yn63LigCQFkB07CCY.jpg",
               "id": 44990,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Old Man",
               "gender": 2,
               "credit_id": "5938b8c292514108990068ad",
               "name": "Lawrence Tierney",
               "profile_path": "/iFPg06kGUTdgRUkrYir3xt1Dt7c.jpg",
               "id": 6937,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Midori",
               "gender": 1,
               "credit_id": "5989203a9251414bdd008a3c",
               "name": "Kathleen Luong",
               "profile_path": "/cYU1V29lAb9AtO0HXTpi9NrFcOU.jpg",
               "id": 158112,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a47",
               "name": "John Herzfeld",
               "profile_path": null,
               "id": 27846,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a4d",
               "name": "Herb Nanas",
               "profile_path": null,
               "id": 11369,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a53",
               "name": "Jeff Wald",
               "profile_path": null,
               "id": 58089,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a59",
               "name": "John Herzfeld",
               "profile_path": null,
               "id": 27846,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a5f",
               "name": "Anthony Marinelli",
               "profile_path": null,
               "id": 28155,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a65",
               "name": "Oliver Wood",
               "profile_path": null,
               "id": 11409,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3a6b",
               "name": "Jim Miller",
               "profile_path": null,
               "id": 9615,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a6fe52dc3a36847e40095f2",
               "name": "Alan L. Nineberg",
               "profile_path": null,
               "id": 1690421,
               "department": "Sound",
               "job": "ADR Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 6.582543,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9401,
      "vote_count": 88,
      "budget": 0,
      "overview": "In a sleepy bedroom community of LA's San Fernando Valley, the murder of a professional athlete by two hit men sets into motion a chain of events that puts the mundane lives of a dozen residents on a collision course. This clever tale tells the story of two hit men, a mistress, a nurse, a vindictive ex-wife, a wealthy art dealer and his lovelorn assistant, a suicidal writer and his dog, and a bitter cop and his partner.",
      "similar": [
         10651,
         13184,
         96,
         1538,
         156022,
         306,
         562,
         2252,
         9654,
         9679,
         101,
         949,
         787,
         4771,
         320,
         281,
         37094,
         395834,
         10694,
         44147
      ],
      "original_title": "2 Days in the Valley",
      "runtime": 104,
      "poster_path": "/fT4ELMHeGzrSk1x2guF6vImgtiy.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Tiếng Việt",
            "iso_639_1": "vi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Redemption Productions",
            "id": 19529,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-09-11",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "You have one minute to decide the rest of your life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Herzfeld"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["John Herzfeld"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115438/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1ODM4NzQ1NV5BMl5BanBnXkFtZTcwNDQyMDU1MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Teri Hatcher, Jeff Daniels, Danny Aiello | See full cast and crew »"],
      "reviews": [
         "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.) Yes. You've seen \"grunge on the run\" romantic comedies--Wild at Heart (1990), Natural Born Killers (1994) come to mind, and poor waitress/crazy old man romantic comedies, e.g., As Good As It Gets (1997)--well, this is a mousy secretary/aging hit man romantic comedy. Somewhat. It's also a tongue-in-the cheek satire on all things that Hollywood thinks movie-goers crave: cute dogs, sexy women, good-hearted underdogs winning out, dumb cops, the ugly rich (Greg Cruttwell's wormy Allan Hopper fits the bill), shoot-outs, blood, dead bodies (enough to grace a Shakespearean stage) and that favorite of testosterone males everywhere: a good old-fashioned cat fight. Charlize Theron and Teri Hatcher provide the eye appeal as they slap and toss each other around; and to be honest I have to say they are definitely worth watching. Excellent support comes from James Spader, as an amazingly clean-shaven (what does he use--Nair?) psycho-sickie with a stopwatch. But Danny Aiello is the real star. He plays Dosmo Pizzo, the over-the-hill hit man (currently moonlighting in embarrassment at the local pizzeria). He loses his hairpiece, finds redemption, true love, thirty thousand Big Ones, and presumably lives happily ever after on the lam with his unlikely moll (Glenne Headly) in this clever plot by coincidence from director and scriptwriter John Herzfeld. (By the way, what's with Hollywood and its perverse love affair with sympathetic hit men? A new genre? The hit man as the underclass hero? I just saw Grosse Pointe Blank (1997) which stars John Cusack as a \"cute\" amoral murder artist. What next? The lovable terrorist? Knowing Hollywood, I think we can count on it.) Anyway, Spader's character is not so lovable. He kills without the slightest qualm and takes a great delight in blowing people away. Charlize is his girl friend and they have lots of you-know-what together. Teri Hatcher is an Olympic class skier with a loser boyfriend. And the Valley of course is the San Fernando Valley just north of L.A., onetime home of the Valley girls, now best known as the porn capital of America. Jeff Daniels and Eric Stoltz play Valley cops (who are not as smart as L.A. cops--one of the jokes in the movie, ha, ha, ha). Both do a great job. Daniels is street wise and quick on the trigger and a bit of a prude while Stoltz is naive and a wanna-be homicide inspector. There are half a dozen cameos by not so well-known but talented people like veteran Austin Pendleton who does a killer sarcastic monologue on the directorial failures of suicidal Teddy Peppers (Paul Mazursky). One-time \"Goodbye Girl\" Marsha Mason has a modest part as a sweet and realistic nurse, and she is excellent. And there are dogs. You gotta have dogs. However what makes this work is some clever dialogue and some satirical plot ideas, but mainly it is a tour de force of acting by a talented and highly professional cast. This is one of those movies in which every actor is a threat to steal the show at any time one way or the other. In a way it's a parade of cameos cleverly stitched together and then nicely edited. But see this for James Spader whose skill playing nerdish weirdos is on fine display.",
         "In addition to the clever plot and delicious acting you get to see very early work by Charlize Theron and James Spader, either of which is worth your time. All of the characters are full-fledged characters, with not a weak link in the chain; and those playing those characters all make the best of it. It's a true ensemble cast, with no one -- with the possible exception of Spader, having a lead role. The story is full of twists, surprises and turnabouts enough to flesh out two or three movies. You can tell that all of these fine actors are enjoying playing the quirky characters we are presented with to make this a true fun romp.",
         "Unfortunately, \"2 Days in the Valley\" didn't get a big audience. I saw it in theaters and enjoyed it very much, and now that I bought the DVD I still enjoy it very much! This is really a unique, original piece of work with echoes of Tarantino. Just like any Tarantino film, the characterizations are very well-developed and the dialogue is sharp, witty and full of observation. The film is an ensemble piece that works on the same level as many others in the genre: We're approached with a series of characters and as the story develops, we watch how the situations all interweave. The result is a hilarious, drop-dead funny dark comedy that's entertaining from start to finish! The music by Anthony Marinelli perfectly accentuates the ironic, darkly comic setting. One of the crucial elements to make a film like this work is, of course, the characters. Each character is quirky in their own respect, yet they're not caricatures. This is not a farce; this is a real comedy about real people who are really screwed up. We probably know some of these people in our personal lives. And the wonderful cast of multi-talented performers shine in each of their respective roles. Danny Aiello is definitely one of our best actors, with an intense screen presence. He blesses us with another memorable performance as a hitman-turned-pizzeria-owner, who takes a yuppie couple (Glenne Headley, Greg Crutwell) hostage. Headley is a mousey, ultimately naive woman who does everything for, yet ceases to please, her mate--Crutwell as an annoyingly snooty Englishman with kidney problems. You want to cheer in every scene Aiello yells in his face or punches him out. Former teen star Eric Stoltz is good in a quiet role as a rookie detective, who's a little held-back but knows what's right. Jeff Daniels is beautifully cast and outstanding as his partner, who's been in the business for a lot longer, but is a loose cannon and will do absolutely anything--including exposing the masseuses of a Japanese parlor for alleged prostitution--to protect the dear \"Valley.\" James Spader has mastered the role of the yuppie serial killer, and reprises the role he was born to play. He's smooth as ever and sadistic as ever. That's the Spader we know! Charlize Theron is the sexiest in her debut role as Spader's seductive partner. If you want to see the beautiful Charlize at her absolute hottest--look no further! Paul Mazursky--who I've seen in other movies, but doesn't quite stick in my mind--has a nice little supporting role as a washed-up screenwriter. I'll probably have him better stored in my memory after seeing him in this movie, he really is terrific. Finally, we have veteran actress Marsha Mason as a nurse, whose half brother is Crutwell. And there we go--the characters interweave. Each character has an odd sense of irony, which is what's wonderful about this movie. The only minor flaws are the sometimes-contrived ways of merging the characters into different situations and the excess of characters. There are tons of characters, and though they are all greatly developed in their own particular scenes, the running time prohibits us from getting to know the whole story on some of them--and that's a little bit of crutch, since we grow to love (or love to hate) all these characters. For example, I wanted to see more of Daniels' character and his story comes to a halt midway. Nevertheless, I was laughing all the way through and never once felt that the film lagged. I was surprised to look at John Herzfeld's (the writer/director) filmography and see a group of TV movies, after-school specials and a few flops, including \"Two of a Kind\" with John Travolta and Olivia Newton-John. Herzfeld really has an ear for dialogue, and he can be the next Tarantino! I'm not kidding! And I love the way he captures the sunny California setting. So beautiful and picturesque. I know I'm using a lot of superlatives to describe this movie, but it's so darn good and so few people went to see it and I hope more people do. So I urge anyone who hasn't to check out this underrated gem! You won't be disappointed! My score: 8 (out of 10)",
         "Yes, this can be compared to \"Pulp Fiction\". It has a slew of twists and veers from one set of characters to another at the drop of a hat. Unlike \"Pulp\", however, there are many sympathetic characters mixed into the cast. The film has humor (a hired gunman that spends much of the movie looking for Italian seasonings while cooking for his captives), some sadness (a once successful director down on his luck, ready for suicide, being ridiculed by a bit part actor), a very lush Charlize Theron, a movie mogul with \"kidney stones\", and an extremely competent killer that has a thing with his stop watch. Let's not forget the two police officers, one a compassionate young man looking to advance to criminal investigation, the other a red neck failure that decides its time to shoot a foursome at the golf course next to his home. How these characters are brought together through the planning of an Olympic star (well, almost a star)who is ready to have her ex knocked off for the will is amusing, well acted, and one of the best films I've seen in some time.",
         "1st watched 2/5/2000 - (Dir-John Herzfeld): Interesting mish-mash of characters who all eventually fit together amidst violent crimes started by a man who seems to be used to this line of work. Despite the obvious muddle-filled lives we are able to pick out those that we route for and they seemed to win out in the end. Interesting small film with many big names.",
         "John Herzfeld writes and directs a tangled story that unravels and rewinds itself. The plot seems to involve a murder by hire that goes awry. A dozen or so Californians have their lives intersect with each going different directions. Violence, sex and dark humor are the adhesive for this scattered, but interesting movie. An ensemble cast keeps your attention. James Spader is a very effectual and ruthless assassin. The drop dead gorgeous Charlize Theron accomplishes raising blood pressures. Her fight with Teri Hatcher is one you will remember. Danny Aiello is an aging hit man and provider of comic relief. Jeff Daniels is a burnt out detective and Eric Stoltz is a detective wannabe. Rounding out the cast is Paul Mazursky, Peter Horton, Marsha Mason, and small parts for Keith Carradine and Louise Fletcher. You will probably want to invite friends over and watch this thing again. It is worth it.",
         "Wow! Fantastic. A very dark humorous movie, one of the best of its kind that I know of. Like any good dark story, every character is presented very shortly and separately, in a way that you can already pinpoint every of his traits in a split-second. Also, like any good dark story, they all get involved with each other one way or another, would that be by being allies that we didn't know of, or simply people that cross the street at the same time and will just look at each other and go on with their lives. A must-see.",
         "Trying to compare Two Days in the Valley with Tarantino's Pulp Fiction is pointless. There is very little originality in the vast majority of modern movies; by and large within their particular genre most movies are variations on a theme. I've watched Pulp Fiction several times and enjoyed it every time and I'll probably watch it many times more. I watched Two Days in the Valley and never once thought about PF, because I enjoyed it and accepted it as just another variation on a theme that was worth watching....and I'll more than likely watch it again....for its entertainment value. The characters were believable in a many-threaded plot that finally knitted together in a way that did not seem contrived.",
         "O.K. movie. I gave it a 5.If available, I probably would have given it a 5.5. Mildly entertaining. It was good to see Marcia Mason. I think if she lost weight she would still be very attractive. Glen Headly is an outstanding actress and is the only performer in the entire film bringing something new to the screen, as she always does. Loved the fight scene between Terri Hatcher and Charlize Theron. Charlize looks great in the tight jump-suit. It must have been cold on the stage the day they shot the fight scene because she was looking a little \"nippley.\" Best phrase: As Terry Hatcher is rubbing her face into the wall she says,\"Like that wall.\"",
         "Herzfelds 2 days in the valley is a different film. Borrowing styles of films such as Pulp Fiction and the more recent Crash (intertwining stories meeting each other), its an effective portrayal of what the title states. The performances are good for the most part, although Glenne Headly and Jeff Daniels were not good in this flick. Aiello, Stoltz and Theron were great. My favorite performance of the film came from Paul Mazursky who was great as a washed up TV film director/writer. James Spader and Teri Hatcher were both also good in their roles and Austin Pendletons cameo was one of the highlights of this film. The film is not great, it has some flaws in acting and a few scenes which just don't belong and are very cliché, however as a whole, i liked it, good cinematography and score as well as good performances for the most part, Herzfelds direction and writing was also good, a good debut for him. 8/10 #197 on my list of all time favorite films"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Rysher Entertainment",
         "Redemption Productions"
      ],
      "summaries": [
         "John Herzfeld deftly welds together a multitude of subplots-- a loser hitman and a cool assassin involved in an insurance scam; a washed-up director, turned suicidal, if only he had someone to care for his beloved dog; a snooty art dealer, wracked by kidney stones, cared for by his devoted assistant; a grungy deranged vice cop, now partnered with a fresh-faced rookie; and two beautiful and jealous women entangled in their deadly scheme--into a spoof of the crime thriller genre.",
         "48 hours of intersecting lives and crimes in Los Angeles."
      ],
      "budget": 0
   },
   "movielensId": 999,
   "movielens": {
      "languages": [
         "English",
         "Tiếng Việt"
      ],
      "releaseDate": "1996-09-11",
      "dvdReleaseDate": "2007-11-20",
      "directors": ["John Herzfeld"],
      "runtime": 104,
      "movieId": 999,
      "title": "2 Days in the Valley",
      "mpaa": "R",
      "actors": [
         "Danny Aiello",
         "Greg Cruttwell",
         "Jeff Daniels",
         "Teri Hatcher",
         "Charlize Theron",
         "James Spader",
         "Eric Stoltz",
         "Keith Carradine",
         "Glenne Headly",
         "Marsha Mason",
         "Paul Mazursky",
         "Louise Fletcher",
         "Austin Pendleton",
         "Peter Horton",
         "Lawrence Tierney",
         "Kathleen Luong"
      ],
      "imdbMovieId": "0115438",
      "originalTitle": "2 Days in the Valley",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["umjwm08s104"],
      "plotSummary": "In a sleepy bedroom community of LA's San Fernando Valley, the murder of a professional athlete by two hit men sets into motion a chain of events that puts the mundane lives of a dozen residents on a collision course. This clever tale tells the story of two hit men, a mistress, a nurse, a vindictive ex-wife, a wealthy art dealer and his lovelorn assistant, a suicidal writer and his dog, and a bitter cop and his partner.",
      "tmdbMovieId": 9401,
      "avgRating": 3.28875,
      "releaseYear": "1996",
      "numRatings": 3271,
      "posterPath": "/fT4ELMHeGzrSk1x2guF6vImgtiy.jpg"
   }
}